[
    {
        "content": "* Alcoa corporation amends revolving credit agreement with improved terms and greater flexibility",
        "date": "11162017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa amends $1.5 billion revolving credit agreement "
    },
    {
        "content": "* Norges Bank reports 5.01 percent passive stake in Alcoa as of Nov 14 - SEC filing Source text: (http://bit.ly/2hy5fX7) Further company coverage:",
        "date": "11162017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Norges Bank reports 5.01 pct passive stake in Alcoa "
    },
    {
        "content": "* Greenlight Capital Inc dissolves share stake in Alcoa Corp - SEC filing",
        "date": "11142017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Greenlight Capital dissolves stake in Alcoa  raises in Hewlett Packard Enterprise "
    },
    {
        "content": "* Q3 earnings per share view $0.77 -- Thomson Reuters I/B/E/S",
        "date": "10182017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa Corp reports Q3 earnings per share $0.60 "
    },
    {
        "content": "* Alcoa Corporation reaches early termination agreement for power contract tied to curtailed rockdale smelter in Texas",
        "date": "10132017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa reaches early termination agreement for power contract tied to curtailed rockdale smelter in Texas "
    },
    {
        "content": "* ‍Luminant - Estimates that about 200 employees will be impacted by Big Brown closure​",
        "date": "10132017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Luminant to close two Texas power plants "
    },
    {
        "content": "CONAKRY  Sept 25 Bauxite mining companies have resumed normal operations in Guinea's Boke region as local authorities try to negotiate a definitive end to unrest that has disrupted production for more than a week  sources familiar with the matter said on Monday.",
        "date": "09252017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Guinea bauxite mining back to normal after week of riots "
    },
    {
        "content": "CONAKRY Guinean bauxite miner CBG's operations were halted again on Tuesday by protesters who blocked roads and train tracks in the town of Kamsar out of frustration at electricity cuts  a company official and a state agency source said.",
        "date": "09192017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Guinean protests halt bauxite miner CBG's operations "
    },
    {
        "content": "CONAKRY  Sept 19 Guinean bauxite miner CBG's operations were halted again on Tuesday by protests in the town of Kamsar having restarted a day earlier  a company official and a source at the state agency for mining infrastructure said.",
        "date": "09192017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Guinean bauxite miner CBG operations halted by protests "
    },
    {
        "content": "* Omega Advisors Inc dissolves share stake in Alcoa Corp- SEC Filing‍​",
        "date": "08142017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Omega Advisors Inc dissolves share stake in Alcoa  Humana "
    },
    {
        "content": "* Third Point LLC takes share stake of 2.7 million shares in NXP Semiconductors",
        "date": "08112017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Third Point LLC dissolves stake in Alcoa  Salesforce.Com "
    },
    {
        "content": "July 19 Aluminum producer Alcoa Corp on Wednesday trimmed its forecast for a measure of profitability  citing market trends.",
        "date": "07192017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa trims forecast for earnings measure "
    },
    {
        "content": "* Q2 earnings per share view $0.60 -- Thomson Reuters I/B/E/S",
        "date": "07192017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa Q2 earnings per share $0.40 "
    },
    {
        "content": "LONDON  July 13 Alcoa is bringing one of its U.S. aluminium smelters back from the dead.",
        "date": "07132017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "COLUMN-Can Trump resurrect U.S. aluminium  and who killed it anyway? Andy Home "
    },
    {
        "content": "July 11 Aluminum producer Alcoa Corp said on Tuesday it would partially restart its Warrick smelter in Indiana more than a year after closing the then largest operating smelter in the United States.",
        "date": "07112017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa to partially restart Warrick smelter in Indiana "
    },
    {
        "content": "July 11 Aluminum producer Alcoa Corp said on Tuesday it would partially restart its Warrick smelter in Indiana  more than a year after closing the then largest operating smelter in the United States.",
        "date": "07112017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Alcoa to partially restart Warrick smelter in Indiana "
    },
    {
        "content": "* Alcoa Corp plans partial restart of aluminum smelter at Warrick operations",
        "date": "07112017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa Corp plans partial restart of Aluminum smelter at Warrick operations "
    },
    {
        "content": "MELBOURNE  June 9 Global aluminium maker Alcoa has restarted half the capacity at its aluminium smelter in Australia's Victoria that was crippled by a state-wide blackout six months ago.",
        "date": "06092017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "UPDATE 1-Alcoa restores half its Australian aluminium output in wake of blackout "
    },
    {
        "content": "MELBOURNE  June 9 Global aluminium maker Alcoa has restarted half the capacity at its aluminium smelter in Australia's Victoria that was crippled by a state-wide blackout six months ago.",
        "date": "06092017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa restores half its Australian aluminium output in wake of blackout "
    },
    {
        "content": "* Alcoa - on May 9  board appointed Roy C. Harvey  co's CEO  to additional officer role of president of Alcoa  effective immediately Source text for Eikon: (http://bit.ly/2qoZEG0) Further company coverage:",
        "date": "05152017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa board appointed Roy C. Harvey to additional officer role of president "
    },
    {
        "content": "* Omega Advisors Inc takes share stake in Alcoa Corp of 200 000 shares - SEC filing",
        "date": "05152017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Omega Advisors Inc takes share stake in Alcoa  Netflix "
    },
    {
        "content": "May 4 Arconic Inc on Thursday nominated two directors for its board  as it gears up for a shareholder vote later this month that pits the specialty metals maker against activist investor Elliott Management in a fight for direction of the company and control over the board.",
        "date": "05042017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 2-Arconic taps two directors ahead of shareholder vote "
    },
    {
        "content": "April 26 Specialty metals maker Arconic Inc said on Wednesday it would exit its stake in Alcoa Corp through a debt-for-equity swap with two of its creditors.",
        "date": "04262017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Arconic sheds Alcoa stake through debt-for-equity swap "
    },
    {
        "content": "* Arconic announces debt-for-equity exchange for Alcoa Corporation common stock",
        "date": "04262017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Arconic announces debt-for-equity exchange for Alcoa Corp common stock "
    },
    {
        "content": "* Files to say selling stockholders are offering about 13 million shares of co's common stock - sec filing",
        "date": "04262017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa files to say selling stockholders are offering about 13 mln shares "
    },
    {
        "content": "* Q1 earnings per share view $0.63 -- Thomson Reuters I/B/E/S",
        "date": "04242017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa Corp reports Q1 earnings per share $1.21 "
    },
    {
        "content": "* Alcoa Corp - company to streamline administrative locations globally to reduce complexity and lower costs",
        "date": "04192017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa says consolidates administrative locations "
    },
    {
        "content": "* Selling stockholder may offer  from time to time  up to 12.96 million shares of co's common stock - SEC filing",
        "date": "03212017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa says selling stockholder may offer  from time to time  up to 12.96 mln shares - SEC filing "
    },
    {
        "content": "WASHINGTON  March 16 The Trump administration on Thursday proposed eliminating Energy Department loan programs and some research funding for energy- efficient technology and electric vehicle development at three carmakers as the industry shifts more of its focus to electric and self-driving vehicles.",
        "date": "03162017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Trump budget plan would scrap energy grants  auto loan program "
    },
    {
        "content": "* CEO Roy Harvey's fy 2016 total compensation was $4.1 million versus $3.0 million in fy 2015",
        "date": "03172017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa CEO 2016 total compensation was $4.1 mln "
    },
    {
        "content": "March 2 Aluminum producer Alcoa Corp named a new head for its aluminum business on Thursday and said it would consolidate its business units into three divisions from six  to increase efficiency and cut costs.",
        "date": "03022017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa merges business units  names new aluminum unit head "
    },
    {
        "content": "March 2 Aluminum producer Alcoa Corp named a new head for its aluminum business on Thursday and said it would consolidate its business units into three divisions from six  to increase efficiency and cut costs.",
        "date": "03022017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Alcoa merges business units  names new aluminum unit head "
    },
    {
        "content": "* Alcoa Corp - company to consolidate number of business units to reduce complexity and lower costs",
        "date": "03022017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa corporation streamlines company structure "
    },
    {
        "content": "* Alcoa corp -  committee approved increase to the base salary of CFO from $550 000 to $605 000  effective March 1  2017  Source text for Eikon: (http://bit.ly/2kVlfpY) Further company coverage:",
        "date": "02242017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa corp -committee approved increase to the base salary of CFO "
    },
    {
        "content": "Arconic Inc   which is under pressure from hedge fund Elliott Management  said it sold nearly two-thirds of its 19.9 percent stake in Alcoa Corp  for about $890 million.",
        "date": "02152017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Arconic sells 60 percent stake in Alcoa for $890 million "
    },
    {
        "content": "Feb 15 Arconic Inc  which is under pressure from hedge fund Elliott Management  said it sold nearly two-thirds of its 19.9 percent stake in Alcoa Corp for about $890 million.",
        "date": "02152017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Arconic sells 60 pct stake in Alcoa for $890 mln "
    },
    {
        "content": "* Says monetized more than 60 percent of 36.3 million shares it retained in Alcoa Corporation",
        "date": "02152017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Arconic says monetized more than 60 pct of 36.3 mln shares it retained in Alcoa Corp "
    },
    {
        "content": "Feb 15 Arconic Inc said on Wednesday it had sold more than 60 percent of its stake in Alcoa Corp  about $890 million.",
        "date": "02152017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Arconic sells 60 pct of its stake in Alcoa for $890 mln "
    },
    {
        "content": "* Alcoa Corp files for secondary offering of up to 36.3 million shares   Source text: (http://bit.ly/2kPhpOw) Further company coverage:",
        "date": "02082017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa Corp files for secondary offering of up to 36.3 million shares "
    },
    {
        "content": "CHICAGO  Jan 31 Arconic Inc <ARNC.N  which makes engineered metal parts for the aerospace  automotive and other industries  on Tuesday reported a quarterly net loss that was driven by charges related to the company's separation from Alcoa Corp last November.",
        "date": "01312017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Arconic posts loss driven by separation costs from Alcoa "
    },
    {
        "content": "NEW YORK Arconic Inc  Chief Executive Officer Klaus Kleinfeld  under pressure from hedge fund Elliott Management  on Wednesday defended the metal maker's performance since spinning off from aluminum producer Alcoa Corp .",
        "date": "02012017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Arconic digs in heels against Elliott as proxy fight begins "
    },
    {
        "content": "NEW YORK  Feb 1 Arconic Inc Chief Executive Officer Klaus Kleinfeld  under pressure from hedge fund Elliott Management  on Wednesday defended the metal maker's performance since spinning off from aluminum producer Alcoa Corp .",
        "date": "02012017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Arconic digs in heels against Elliott as proxy fight begins "
    },
    {
        "content": "NEW YORK  Feb 1 Arconic Inc Chief Executive Officer Klaus Kleinfeld  under pressure from hedge fund Elliott Management  on Wednesday defended the metal maker's performance since spinning off from aluminum producer Alcoa Corp AA.N>.",
        "date": "02012017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Arconic CEO defends performance as Elliott ramps up pressure "
    },
    {
        "content": "Alcoa Corp  reported higher-than-expected revenue in its first quarterly results after the metals company split into two in November  helped partly by a rise in alumina prices.",
        "date": "01242017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa beats revenue estimates  sees higher aluminum demand "
    },
    {
        "content": "Jan 24 Alcoa Corp reported higher-than-expected revenue in its first quarterly results after the metals company split into two in November  helped partly by a rise in alumina prices.",
        "date": "01242017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 2-Alcoa beats revenue estimates  sees higher aluminum demand "
    },
    {
        "content": "* Federal government provides A$30 mln  state A$210 mln -source",
        "date": "01202017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "UPDATE 3-Australia's $182 mln aid secures Alcoa plant  jobs in state hit by closures "
    },
    {
        "content": "* Sees strong demand growth for alumina and aluminum particularly in China - conf call",
        "date": "01242017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa sees strong demand growth for alumina and aluminum in China - Conf Call "
    },
    {
        "content": "* Q4 earnings per share view $0.19 -- Thomson Reuters I/B/E/S",
        "date": "01242017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa reports Q4 adj. earnings per share $0.14 excluding items "
    },
    {
        "content": "Jan 24 Alcoa Corp reported a loss in its first quarterly results after the metals company split into two in November.",
        "date": "01242017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa reports quarterly loss "
    },
    {
        "content": "SYDNEY An Australian smelter run by Alcoa Corp will resume production after a major blackout  under a government-sponsored rescue package securing its future for at least four years  with electricity supplied by AGL Energy Ltd.",
        "date": "01202017",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa Australian aluminum plant rescued with government aid "
    },
    {
        "content": "SYDNEY/MELBOURNE  Jan 9 The Australian government has offered \"substantial\" financial support to help repair Alcoa Corp's aluminium smelter in Victoria that was crippled last month by a state-wide blackout  government ministers said on Monday.",
        "date": "01092017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Australia offers financial support for crippled Alcoa aluminium plant "
    },
    {
        "content": "Alcoa Corp said it would permanently close its Suralco alumina refinery and bauxite mines in Suriname  more than a year after stopping production at the plant.",
        "date": "01032017",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa to close Suralco refinery in Suriname "
    },
    {
        "content": "MELBOURNE A blackout that forced Alcoa Corp to shut one of two potlines at its Portland aluminum smelter in Australia will ratchet up costs further and may put the plant's future in jeopardy  analysts said on Friday.",
        "date": "12022016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Blackout ramps up pressure on Alcoa Australian aluminum smelter "
    },
    {
        "content": "* Announces revised record date for quarterly cash dividend for common stock",
        "date": "10192016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa sets quarterly dividend of $0.09per share "
    },
    {
        "content": "* Alcoa CEO says \"Right now we see a lot of strength across the aluminum sector both in China and in the rest of the world\" - Conf call",
        "date": "10202016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa CEO sees strength across aluminum sector in China  rest of the world - Conf call "
    },
    {
        "content": "Metals company Alcoa Inc   weeks away from splitting into two  on Tuesday reported a quarterly profit that missed estimates and lowered its revenue forecast for the unit serving the auto and aerospace sectors  sending shares down 10 percent.",
        "date": "10112016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa stock tumbles as profit  revenue miss expectations "
    },
    {
        "content": "Oct 11 Metals company Alcoa Inc  weeks away from splitting into two  on Tuesday reported a quarterly profit that missed estimates and lowered its revenue forecast for the unit serving the auto and aerospace sectors  sending shares down 10 percent.",
        "date": "10112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 4-Alcoa stock tumbles as profit  revenue miss expectations "
    },
    {
        "content": "* United Steelworkers - USW reaches agreement with Alcoa on effects of Alcoa/Arconic split",
        "date": "10112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-USW reaches agreement with Alcoa on effects of Alcoa/Arconic split "
    },
    {
        "content": "Oct 11 Metals company Alcoa Inc on Tuesday reported higher quarterly profit due to cost-cutting and lower tax provisions  but the results missed expectations and its stock sank nearly 10 percent.",
        "date": "10112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "REFILE-UPDATE 2-Alcoa 3rd-qtr results miss expectations  stock sinks "
    },
    {
        "content": "Oct 11 U.S. stocks opened lower on Tuesday after Alcoa kicked off the third-quarter earnings season on a disappointing note.",
        "date": "10112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS SNAPSHOT-Wall St opens lower after Alcoa's results "
    },
    {
        "content": "* St. Jude falls after warning on battery flaw in heart device",
        "date": "10112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Wall St set to open lower after Alcoa's results "
    },
    {
        "content": "* Q3 earnings per share view $0.35 -- Thomson Reuters I/B/E/S",
        "date": "10112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa reports Q3 earnings per share $0.33 "
    },
    {
        "content": "Oct 11 Metals company Alcoa Inc on Tuesday reported higher quarterly profit despite lower revenue  due to cost-cutting measures and lower income tax provisions.",
        "date": "10112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Cost-cutting boosts Alcoa Q3 profit "
    },
    {
        "content": "* On September 29  board appointed Ken Giacobbe to become executive VP and CFO of company  Source text for Eikon:  Further company coverage:",
        "date": "10052016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa board appointed Ken Giacobbe to become executive VP and CFO "
    },
    {
        "content": "Aluminum producer Alcoa Inc said on Thursday its split into two publicly traded companies is expected to be effective Nov. 1  after the company's board approved the separation.",
        "date": "09292016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa board approves split  expected effective November 1 "
    },
    {
        "content": "* Alcoa Inc announces closing of debt offering in connection with separation  Source text for Eikon:  Further company coverage:",
        "date": "09272016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa inc announces closing of debt offering in connection with separation "
    },
    {
        "content": "Sept 29 Aluminum producer Alcoa Inc said on Thursday its split into two publicly traded companies is expected to be effective Nov. 1  after the company's board approved the separation.",
        "date": "09292016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa board approves split  expected effective Nov. 1 "
    },
    {
        "content": "* Declared dividends on its $3.75 cumulative preferred stock and on its common stock.",
        "date": "09292016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa declared quarterly dividend of 9 cents/share "
    },
    {
        "content": "* Michael Morris will become non-executive chairman of Alcoa Corporation",
        "date": "09292016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa board approves separation of company "
    },
    {
        "content": "* Priced offering of $750 million aggregate amount of 6.75 pct senior notes due 2024 and $500 million aggregate amount of 7.00 pct senior notes due 2026",
        "date": "09222016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa reports pricing of debt offering in connection with separation "
    },
    {
        "content": "* Announces proposed debt offering in connection with separation",
        "date": "09202016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa announces proposed debt offering in connection with separation "
    },
    {
        "content": "MELBOURNE Alcoa Inc and Alumina Ltd  have settled a dispute and agreed to reshape their joint venture  removing an obstacle to Alcoa's plan to split into two companies and making its Australian partner a more attractive takeover target.",
        "date": "09022016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa  Alumina settle dispute  clearing hurdle to Alcoa split "
    },
    {
        "content": "* Alumina shares jump 8.5 pct   (Adds Alumina CEO  investor comments  share price)",
        "date": "09022016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 2-Alcoa  Alumina settle dispute  clearing hurdle to Alcoa split "
    },
    {
        "content": "MELBOURNE  Sept 2 Alcoa Inc and its Australian partner  Alumina Ltd  have settled a dispute and agreed to make changes to their joint venture  removing an obstacle to Alcoa's plan to split into two companies.",
        "date": "09012016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa  Alumina settle dispute  revise joint venture "
    },
    {
        "content": "TOKYO  Aug 30 A major aluminium producer has offered Japanese buyers a premium of $82 per tonne for October-December primary metal shipments  down 9-12 percent from the previous quarter  three sources directly involved in pricing talks said on Tuesday.",
        "date": "08302016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Aluminium producer seeks Q4 premium of $82/T from Japan buyers-sources "
    },
    {
        "content": "TOKYO  Aug 30 A major aluminium producer has offered Japanese buyers a premium of $82 per tonne for October-December primary metal shipments  down 9-12 percent from the previous quarter  three sources directly involved in pricing talks said on Tuesday.",
        "date": "08302016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Aluminium producer seeks Q4 premium of $82/T from Japan buyers-sources "
    },
    {
        "content": "* Alcoa names Kate Hargrove Ramundo future Arconic chief legal officer  Source text for Eikon:  Further company coverage:",
        "date": "08242016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa appoints Kate Ramundo future Arconic chief legal officer "
    },
    {
        "content": "* Alcoa Inc files preliminary proxy statement related to vote on proposal to authorize co's board to effect reverse stock split of  shares at ratio of 1-for-3  Source text: (http://bit.ly/2aikkGT) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07272016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa files preliminary proxy statement "
    },
    {
        "content": "* \"Does not anticipate issuing fractional shares as a result of reverse stock split\"",
        "date": "07272016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa announces plan for 1-for-3 reverse stock split "
    },
    {
        "content": "* Declared a quarterly common stock dividend of 3 cents per share  Source text for Eikon:  Further company coverage:",
        "date": "07222016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa declares quarterly dividend of 3 cents per share "
    },
    {
        "content": "* Ratan Tata reports open market purchase of 2 045 shares of Alcoa Inc at prices ranging from $10.7248 To $10.7250 - SEC filing",
        "date": "07152016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Ratan Tata reports open market purchase of 2 045 shares of Alcoa - SEC filing "
    },
    {
        "content": "CHICAGO  July 11 Metals company Alcoa Inc  on Monday reported a lower quarterly net profit  citing a 10 percent decline in revenue due to lower prices for aluminum and alumina and plant operations that have been curtailed  closed or sold off.",
        "date": "07112016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa Q2 profit falls on low aluminum prices "
    },
    {
        "content": "CHICAGO Alcoa Inc on Monday reported a lower quarterly net profit  with falling aluminum and alumina prices pressuring revenue while plant operations have been scaled back ahead of a spinoff of its traditional smelting business later this year.",
        "date": "07122016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Low aluminum prices hurt Alcoa second-quarter profit "
    },
    {
        "content": "NEW YORK The benchmark U.S. S&P 500 stock index set record closing and intraday highs for the second straight day on Tuesday and the Dow Jones industrial average reached record highs for the first time in over a year as optimism about the world economy and upbeat corporate results from Alcoa boosted risk appetite.",
        "date": "07122016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Dow  S&P hit record closing highs on greater risk tolerance "
    },
    {
        "content": "* Dollar hits more than two-week high vs. yen   (Updates to close of U.S. markets)",
        "date": "07122016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "GLOBAL MARKETS-Dow  S&P hit record closing highs on greater risk tolerance "
    },
    {
        "content": "* Indexes up: Dow 0.47 pct  S&P 0.54 pct  Nasdaq 0.62 pct   (Adds details  comments  updates prices)",
        "date": "07122016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-S&P  Dow hit record highs  Nasdaq turns positive for 2016 "
    },
    {
        "content": "* Indexes up: Dow 0.63 pct  S&P 0.65 pct  Nasdaq 0.73 pct   (Updates to open)",
        "date": "07122016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Dow  S&P hit record highs  Nasdaq erases 2016 losses "
    },
    {
        "content": "* Futures up: Dow 72 pts  S&P 9.75 pts  Nasdaq 25.25 pts   (Adds details  comments  updates prices)",
        "date": "07122016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-S&P 500 poised to hit record high; Alcoa gains "
    },
    {
        "content": "* Fitch removes Alcoa's 'BB+' IDR from evolving watch; outlook stable  Source text for Eikon:  Further company coverage:",
        "date": "07072016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Fitch removes Alcoa's 'BB+' IDR from evolving watch  outlook stable "
    },
    {
        "content": "* Will produce proprietary titanium  nickel and aluminum powders optimized for 3D printing aerospace parts",
        "date": "07062016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa opens 3D printing Metal Powder Plant "
    },
    {
        "content": "* Alcoa Inc's outlook remains negative following form 10 filing   Source text for Eikon:  Further company coverage:",
        "date": "06302016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Moody's says Alcoa Inc's outlook remains negative following form 10 filing "
    },
    {
        "content": "June 30 U.S. metal company Alcoa Inc has won a long-term $470 million contract to provide aluminum sheet and plate for Brazilian aircraft maker Embraer SA's  E2 model  which is scheduled to enter service in 2018  they said on Thursday.",
        "date": "06302016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa gets $470 million aluminum contract from Embraer aircraft "
    },
    {
        "content": "* Alcoa awarded multi-year  $470 million contract with Embraer",
        "date": "06302016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa awarded multi-year  $470 mln contract with Embraer "
    },
    {
        "content": "CHICAGO Metals company Alcoa Inc said on Wednesday it will spin off its traditional aluminum smelting business as part of its planned company split  with up to 19.9 percent of the new company owned by its business that serves aerospace and transportation industries.",
        "date": "06292016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa spins off smelting business; aero  auto unit now 'Arconic' "
    },
    {
        "content": "CHICAGO  June 29 Metals company Alcoa Inc  said on Wednesday it will spin off its traditional aluminum smelting business as part of its planned company split  with up to 19.9 percent of the new company owned by its business that serves aerospace and transportation industries.",
        "date": "06292016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 4-Alcoa spins off smelting business; aero  auto unit now 'Arconic' "
    },
    {
        "content": "* Alcoa Upstream Corp files form 10 registration statement with U.S. SEC in connection with co's spinoff plan  - Sec filing",
        "date": "06292016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa Upstream Corp provides details in connection with spinoff plan "
    },
    {
        "content": "* Separation of upstream business and Alcoa Corp on track to be completed in second half of 2016  Source text for Eikon:",
        "date": "06292016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa says separation of upstream business  Alcoa Corp to be completed in second half of 2016 "
    },
    {
        "content": "CHICAGO  June 28 Metals company Alcoa Inc  said in a regulatory filing on Wednesday that it will spin off its traditional upstream smelting business as part of a planned split that is due to take place in the second half of this year.",
        "date": "06292016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa unveils details of spinoff of upstream business - filing "
    },
    {
        "content": "MELBOURNE  May 30 Australia's Alumina Ltd  has \"serious concerns\" about the impact of a demerger plan of U.S. partner Alcoa Inc on the pair's bauxite and alumina production joint venture  the Australian company said on Monday.",
        "date": "05302016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "UPDATE 1-Alcoa's spinoff plan sparks dispute with Australian partner Alumina "
    },
    {
        "content": "MELBOURNE  May 30 Australia's Alumina Ltd  on Monday said it has \"serious concerns\" about the impact of a demerger plan of U.S. partner Alcoa Inc on the pair's bauxite and alumina production joint venture  Alcoa Worldwide Alumina and Chemicals (AWAC).",
        "date": "05302016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa's spin-off plan sparks dispute with Australian partner Alumina "
    },
    {
        "content": "* Japan buyers not willing to accept $110/T -source   (Adds comment  detail)",
        "date": "05302016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Aluminium producer seeks Q3 premium of $110/T from Japan buyers -sources "
    },
    {
        "content": "TOKYO  May 30 A major aluminium producer has offered Japanese buyers a premium of $110 per tonne for July-September primary metal shipments  down 4-6 percent from the previous quarter  three sources directly involved in pricing talks said on Monday.",
        "date": "05302016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Aluminium producer seeks Q3 premium of $110/T from Japan buyers-sources "
    },
    {
        "content": "May 18 United Parcel Service Inc  the world's largest package delivery company  said on Wednesday it will expand the 3D printing services provided through its UPS Stores to create an on-demand manufacturing network starting this summer.",
        "date": "05182016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPS  SAP team up for on-demand 3D printing network "
    },
    {
        "content": "* Karl Tragl  group president of transportation and construction solutions appointed group president of engineered products and solutions",
        "date": "05122016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa appoints Karl Tragl group president of engineered products and solutions "
    },
    {
        "content": "NEW YORK Alcoa Inc has agreed a new power deal in Washington state to prevent the closure at the end of June of its 279 000 tonne-per-year Intalco aluminum smelter  the company said on Monday.",
        "date": "05022016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa will keep Intalco aluminum smelter open after power deal "
    },
    {
        "content": "* Alcoa reaches power agreement to improve competitiveness of Intalco Smelter",
        "date": "05022016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa reaches power agreement to improve competitiveness of Intalco Smelter "
    },
    {
        "content": "* north american packaging market has become increasingly commoditized",
        "date": "04222016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Alcoa Inc says separation of companies targeted in second half of 2016 "
    },
    {
        "content": "NEW YORK Alcoa Inc has agreed to a new power deal for its 279 000 tonne-per-year Intalco aluminum smelter  according to a statement from its power supplier  potentially staving off closure of one of the last remaining U.S. aluminum plants.",
        "date": "04132016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa in power deal that may keep Intalco aluminum plant open "
    },
    {
        "content": "NEW YORK  April 13 Alcoa Inc has agreed to a new power deal for its 279 000 tonne-per-year Intalco aluminum smelter  according to a statement from its power supplier  potentially staving off closure of one of the last remaining U.S. aluminum plants.",
        "date": "04132016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 2-Alcoa in power deal that may keep Intalco aluminum plant open "
    },
    {
        "content": "* Announced on Monday it had signed a Stock Purchase Agreementwith a subsidiary of Alcoa Inc. to acquire its Remmele Medical Operations for $102 million (\u007f90 million)",
        "date": "04122016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "BRIEF-Lisi to acquire Alcoa's subsidiary Remmele Medical Operations "
    },
    {
        "content": "CHICAGO Metals company Alcoa Inc  on Monday reported a lower quarterly profit  with results hurt by low commodity prices  the strong U.S. dollar and plant closures or divestments  but the company's top executive said he expected aluminum demand to grow faster than supply this year.",
        "date": "04112016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa profit falls; demand seen growing faster than supply "
    },
    {
        "content": "CHICAGO  April 11 Metals company Alcoa Inc  on Monday reported a lower quarterly profit  with results hurt by low commodity prices  the strong U.S. dollar and plant closures or divestments  but the company's top executive said he expected aluminum demand to grow faster than supply this year.",
        "date": "04112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 2-Alcoa profit falls; demand seen growing faster than supply "
    },
    {
        "content": "* In 2016  Alcoa projects an approximately 1.1 million metric ton global aluminum deficit",
        "date": "04112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa Q1 adjusted earnings per share $0.07 "
    },
    {
        "content": "* Q1 adjusted EPS $0.07  Q1 Revenue $4.95 billion - CNBC tweet  Source text for Eikon: [http://bit.ly/25VtxNc] Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa Q1 revenue $4.95 bln - CNBC tweet "
    },
    {
        "content": "April 11 Berkshire Hathaway Inc's  Business Wire website  which distributes press releases issued by companies  went down just before the U.S. stock market closed on Monday.",
        "date": "04112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Business Wire goes down ahead of Alcoa's earnings statement "
    },
    {
        "content": "CHICAGO  April 11 Metals company Alcoa Inc  on Monday reported a lower quarterly profit  with results hurt by low alumina and aluminum prices  the strong U.S. dollar and plant closures or divestments.",
        "date": "04112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa profit falls  hurt by alumina  aluminum prices "
    },
    {
        "content": "* CEO Klaus-Christian Kleinfeld says delay in earnings results due to Businesswire being down- CNBC    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "04112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa Inc CEO Klaus-Christian Kleinfeld says delay in earnings results due to Businesswire being down- CNBC "
    },
    {
        "content": "SYDNEY  March 31 Energy infrastructure owner Duet Group launched a A$200 million ($153 million) capital raising on Thursday to finance the purchase of the remaining 20 percent of the Western Australian state gas transmission line it does not already own from Alcoa Inc's  Australian arm.",
        "date": "03302016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Australia's Duet to raise $153 mln to pay for Alcoa pipeline stake "
    },
    {
        "content": "TOKYO  March 22 Some Japanese aluminium buyers have agreed to pay a premium of $115 per tonne for primary metal for shipment in the April-June quarter  three sources directly involved in the quarterly pricing talks said.",
        "date": "03222016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Some Japanese aluminium buyers agree to Q2 premium of $115/T -sources "
    },
    {
        "content": "TOKYO  March 22 Some Japanese aluminium buyers have agreed to pay a premium of $115 per tonne for primary metal to be shipped in the April-June quarter  three sources directly involved in the quarterly pricing talks said.",
        "date": "03222016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Some Japanese aluminium buyers agree to pay Q2 premium of $115/T -sources "
    },
    {
        "content": "CHICAGO  March 15 Metals company Alcoa Inc  said on Tuesday it has decided that its valued-added business will carry the name Arconic after the firm splits in two later this year.",
        "date": "03152016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa says plane  car business to be named 'Arconic' after split "
    },
    {
        "content": "* Says both Arconic and Alcoa will be domiciled in United States and listed on New York Stock Exchange",
        "date": "03152016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa's future value-add company to be named \"Arconic\" "
    },
    {
        "content": "NEW YORK The U.S. government has granted aid to workers at Alcoa Inc's  Intalco aluminum smelter in Washington state  after they complained that Chinese dumping threatened their jobs  according to a federal ruling.",
        "date": "02032016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "U.S. grants aid to Alcoa smelter workers after China complaint: ruling "
    },
    {
        "content": "NEW YORK The U.S. government has granted aid to workers at Alcoa Inc's Intalco aluminum smelter in Washington state  after they complained that Chinese dumping threatened their jobs  according to a federal ruling.",
        "date": "02032016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "U.S. grants aid to Alcoa smelter workers after China complaint - ruling "
    },
    {
        "content": "Aluminum producer Alcoa Inc  said it would appoint three new directors to its board  expanding its size to 15  as the company to prepares to split itself into two later this year.",
        "date": "02012016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa to appoint three new members to board "
    },
    {
        "content": "NEW YORK  Feb 3 The U.S. government has granted aid to workers at Alcoa Inc's Intalco aluminum smelter in Washington state  after they complained that Chinese dumping threatened their jobs  according to a federal ruling.",
        "date": "02032016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-U.S. grants aid to Alcoa smelter workers after China complaint - ruling "
    },
    {
        "content": "* Elliott Management to support slate of director nominees   (Adds stock movement)",
        "date": "02012016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 2-Alcoa to appoint three new members to board "
    },
    {
        "content": "NEW YORK  Feb 3 The U.S. government has granted aid to workers at Alcoa Inc's Intalco aluminum smelter in Washington state  after they complained that Chinese dumping threatened their jobs  according to a federal ruling.",
        "date": "02032016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "U.S. grants aid to Alcoa smelter workers after China complaint- ruling "
    },
    {
        "content": "U.S. aluminum producer Alcoa Inc  said on Thursday it will supply aerospace parts to Boeing Co  under a new long-term agreement  the latest in a series of contract wins.",
        "date": "01282016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa wins Boeing supply agreement "
    },
    {
        "content": "Jan 28 U.S. aluminum producer Alcoa Inc  said on Thursday it will supply aerospace parts to Boeing Co  under a new long-term agreement  the latest in a series of contract wins.",
        "date": "01282016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Alcoa wins Boeing supply agreement "
    },
    {
        "content": "Jan 28 U.S. aluminum producer Alcoa Inc  said on Thursday it will supply multi-material aerospace parts to Boeing Co under a new long-term agreement.",
        "date": "01282016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa wins supply agreement with Boeing "
    },
    {
        "content": "Alcoa Inc  responding to a Moody's warning of a possible cut to its credit rating  said it was focusing on its plane and car parts business as well as its aluminum smelting and refining operations to help them succeed as independent companies.",
        "date": "01222016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa responds to Moody's warning on rating downgrade "
    },
    {
        "content": "Jan 22 Alcoa Inc  responding to a Moody's warning of a possible cut to its credit rating  said it was focusing on its plane and car parts business as well as its aluminum smelting and refining operations to help them succeed as independent companies.",
        "date": "01222016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 2-Alcoa responds to Moody's warning on rating downgrade "
    },
    {
        "content": "LONDON The only way to make money out of producing aluminum  it seems  is not to produce any.",
        "date": "01222016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "What can mend aluminum market's bleeding heart?: Andy Home "
    },
    {
        "content": "FORT LAUDERDALE  Fla.  Jan 21 Alcoa Inc  may keep its 279 000 tonne-per-year Intalco smelter in Washington state open if power costs decline  an executive said in a presentation on Thursday.",
        "date": "01212016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "UPDATE 1-Alcoa holds door open for Washington state smelter return "
    },
    {
        "content": "LONDON  Jan 21 The only way to make money out of producing aluminium  it seems  is not to produce any.",
        "date": "01222016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "RPT-COLUMN-What can mend aluminium market's bleeding heart?: Andy Home "
    },
    {
        "content": "LONDON  Jan 21 The only way to make money out of producing aluminium  it seems  is not to produce any.",
        "date": "01212016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "COLUMN-What can mend aluminium market's bleeding heart?: Andy Home "
    },
    {
        "content": "Alcoa Inc said it will delay the curtailment of its Intalco Works smelter in Ferndale  Washington until the end of the second quarter of 2016.",
        "date": "01192016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa delays curtailment of Intalco smelter until end of second quarter "
    },
    {
        "content": "DENVER -- Through the misfires  miscues and dropped passes  Peyton Manning stayed the course until it finally came all together for the Denver Broncos.",
        "date": "01182016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Manning  Broncos drive past Steelers "
    },
    {
        "content": "Jan 19 Alcoa Inc said it will delay the curtailment of its Intalco Works smelter in Ferndale  Washington until the end of the second quarter of 2016.",
        "date": "01192016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Alcoa delays curtailment of Intalco smelter until end of Q2 "
    },
    {
        "content": "Jan 19 Alcoa Inc said it will delay the curtailment of its Intalco Works smelter in Ferndale  Washington until the end of the second quarter of 2016.",
        "date": "01192016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa delays curtailment of Intalco smelter until end of Q2 "
    },
    {
        "content": "NEW YORK Alcoa Inc's  plans to close its 269 000 tonne-per-year Warrick smelter  announced on Thursday  will bring U.S. aluminum output to its lowest level in more than 65 years as the industry endures tumbling prices amid rising trade tensions with China.",
        "date": "01072016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa smelter closure to bring U.S. aluminum output to post-WWII levels "
    },
    {
        "content": "NEW YORK  Jan 7 Alcoa Inc's plans to close its 269 000 tonne-per-year Warrick smelter  announced on Thursday  will bring U.S. aluminum output to its lowest level in more than 65 years as the industry endures tumbling prices amid rising trade tensions with China.",
        "date": "01072016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 2-Alcoa smelter closure to bring U.S. aluminum output to post-WWII levels "
    },
    {
        "content": "CHICAGO Metals company Alcoa Inc  on Monday reported a quarterly net loss after charges related to shuttering parts of its traditional smelting business.",
        "date": "01112016",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa posts fourth quarter loss due to charges from shuttering capacity "
    },
    {
        "content": "Jan 7 Alcoa Inc said it will permanently close its 269 000 metric ton Warrick Operations smelter in Evansville  Indiana by the end of first quarter.",
        "date": "01072016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa to close Warrick smelter operations in Indiana "
    },
    {
        "content": "CHICAGO  Jan 11 Metals company Alcoa Inc  on Monday reported a quarterly net loss after charges related to shuttering parts of its traditional smelting business.",
        "date": "01112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "RPT-UPDATE 1-Alcoa posts 4th qtr loss due to charges from shuttering capacity "
    },
    {
        "content": "CHICAGO  Jan 11 Metals company Alcoa Inc  on Monday reported a quarterly net loss after charges related to shuttering parts of its traditional smelting business.",
        "date": "01112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Alcoa posts 4th qtr loss due to charges from shuttering capacity "
    },
    {
        "content": "CHICAGO  Jan 11 Metals company Alcoa Inc  on Monday reported a quarterly net loss after charges related to shuttering parts of its traditional smelting business.",
        "date": "01112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa posts Q4 loss due to charges from shuttering capacity "
    },
    {
        "content": "Alcoa Inc said on Monday it had signed a $1.5 billion long-term contract with General Electric Co's aviation unit to supply components used in aircraft engines.",
        "date": "01112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa gets $1.5 billion supply contract from GE's aviation unit "
    },
    {
        "content": "Jan 11 Alcoa Inc said on Monday it had signed a $1.5 billion long-term contract with General Electric Co's aviation unit to supply components used in aircraft engines.",
        "date": "01112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Alcoa gets $1.5 bln supply contract from GE's aviation unit "
    },
    {
        "content": "Jan 11 Alcoa Inc has won a $1.5 billion long-term contract from General Electric's aviation unit to supply vital components used in making aircraft engines  the Wall Street Journal reported.",
        "date": "01112016",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa gets $1.5 bln supply contract from GE's aviation unit -WSJ "
    },
    {
        "content": "CHICAGO Metals company Alcoa Inc said on Thursday it has signed two long-term supply contracts with plane manufacturer Boeing Co worth more than $2.5 billion that will be part of its value-added business once the company splits in the second half of 2016.",
        "date": "12172015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa lands two Boeing contracts worth more than $2.5 billion "
    },
    {
        "content": "CHICAGO  Dec 17 Metals company Alcoa Inc  said on Thursday it has signed two long-term supply contracts with plane manufacturer Boeing Co worth more than $2.5 billion that will be part of its value-added business once the company splits in the second half of 2016.",
        "date": "12172015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa lands two Boeing contracts worth more than $2.5bln "
    },
    {
        "content": "NEW YORK  Dec 10 Activist investors are building bigger stakes in bigger companies and their influence is helping reshape the landscape of corporate USA.",
        "date": "12112015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Activist pressure helps reshape U.S. corporates  from Yahoo to Dow "
    },
    {
        "content": "Hedge fund Elliott Management Corp disclosed a 6.4 percent stake in \"undervalued\" Alcoa Inc on Monday  sending the aluminum producer's shares up as much as 6.3 percent.",
        "date": "11232015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Elliott Management takes 6.4 percent stake in 'undervalued' Alcoa "
    },
    {
        "content": "* Indexes up: Dow 0.07 pct  S&P 0.22 pct  Nasdaq 0.31 pct   (Adds details  updates prices)",
        "date": "11232015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Wall St edges up  helped by material and energy stocks "
    },
    {
        "content": "Nov 23 Hedge fund Elliott Management Corp disclosed a 6.4 percent stake in \"undervalued\" Alcoa Inc  on Monday  sending the aluminum producer's shares up as much as 6.3 percent.",
        "date": "11232015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Elliott Management takes 6.4 pct stake in \"undervalued\" Alcoa "
    },
    {
        "content": "Nov 23 Hedge fund Elliott Management Corp has a 6.5 percent stake in Alcoa Inc  CNBC reported on Monday  citing sources. (http://cnb.cx/1MxBldX)",
        "date": "11232015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Elliott Management takes 6.5 pct stake in Alcoa - CNBC "
    },
    {
        "content": "Aluminum producer Alcoa Inc  said it named Roy Harvey chief executive of its traditional aluminum smelting and refining operations  which would be separated from its faster growing plane and car parts business.",
        "date": "11242015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Roy Harvey to head Alcoa's commodities business post split "
    },
    {
        "content": "Nov 24 Aluminum producer Alcoa Inc said it named Roy Harvey chief executive of its traditional aluminum smelting and refining operations  which would be separated from its faster growing plane and car parts business.",
        "date": "11242015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "CORRECTED-Roy Harvey to head Alcoa's commodities business post split "
    },
    {
        "content": "NEW YORK Alcoa Inc will receive almost $70 million in aid over 3-1/2 years from New York state to keep the Massena West  New York  aluminum smelter open  under a deal announced on Tuesday.",
        "date": "11242015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa to get aid from NY state to keep aluminum smelter open "
    },
    {
        "content": "NEW YORK  Nov 24 Alcoa Inc will receive almost $70 million in aid over 3-1/2 years from New York state to keep the Massena West  New York  aluminum smelter open  under a deal announced on Tuesday.",
        "date": "11242015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Alcoa to get aid from NY state to keep aluminum smelter open "
    },
    {
        "content": "NEW YORK  Nov 24 Alcoa Inc and New York state reached a deal to keep the Massena West  New York aluminum smelter  which had previously been slated for curtailment  open for 3-1/2 years  the company announced on Tuesday.",
        "date": "11242015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa  New York reach deal to prevent Massena aluminum smelter closure "
    },
    {
        "content": "NEW YORK  Nov 3 U.S. aluminum premiums have jumped to their highest in three months after Alcoa  announced plans to idle the bulk of its U.S. smelting capacity  stirring speculation among traders that the market may have turned a corner.",
        "date": "11042015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "RPT-U.S. aluminum premiums rise as Alcoa cutbacks signal turnaround "
    },
    {
        "content": "NEW YORK  Nov 2 Alcoa Inc will idle three aluminum smelters in the United States  the company said on Monday  leaving it with just one operating smelter in the country as it seeks to curtail uncompetitive capacity.",
        "date": "11022015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa says to idle three of four active U.S. aluminum smelters "
    },
    {
        "content": "NEW YORK  Nov 3 U.S. aluminum premiums have jumped to their highest in three months after Alcoa  announced plans to idle the bulk of its U.S. smelting capacity  stirring speculation among traders that the market may have turned a corner.",
        "date": "11032015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "U.S. aluminum premiums rise as Alcoa cutbacks signal turnaround "
    },
    {
        "content": "NEW YORK  Nov 3 Alcoa's planned curtailment of 500 000 tonnes of aluminum capacity  announced Monday afternoon  could provide support to the U.S. Midwest Aluminum premium  Aleris Corp chief executive Sean Stack said on Tuesday.",
        "date": "11032015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa curtailments could cause aluminum premiums to tighten -Aleris CEO "
    },
    {
        "content": "NEW YORK Alcoa Inc said on Monday it will idle three of its four active U.S. aluminum smelters  slashing annual capacity by 500 000 tonnes  in the steepest cuts yet by an aluminum producer to battle oversupply and sinking metal prices.",
        "date": "11032015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa idling three U.S. aluminum smelters as prices bite "
    },
    {
        "content": "NEW YORK  Nov 2 Alcoa Inc said on Monday it will idle three of its four active U.S. aluminum smelters  slashing annual capacity by 500 000 tonnes  in the steepest cuts yet by an aluminum producer to battle oversupply and sinking metal prices.",
        "date": "11032015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Alcoa idling 3 U.S. aluminum smelters as prices bite "
    },
    {
        "content": "Oct 16 Workers at Alcoa's Intalco Works aluminum smelter voted to accept the company's final contract offer  staving off a second labor dispute at a U.S. smelter this year as prices tumble below production costs.",
        "date": "10162015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Union accepts proposed labor deal at Alcoa Intalco aluminum smelter "
    },
    {
        "content": "Oct 16 Workers at Alcoa's Intalco Works aluminum smelter voted to accept the company's final contract offer  staving off a second labor dispute at a U.S. smelter this year as prices tumble below production costs.",
        "date": "10162015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Union accepts proposed labor deal at Alcoa Intalco aluminum smelter "
    },
    {
        "content": "WASHINGTON  Oct 7 A $22 million deal between the Aluminum Company of America and Patriot Coal Corp has been abandoned as the coal company seeks to finalize its bankruptcy plan  which U.S. Democratic presidential candidate Hillary Clinton criticized last week as \"outrageous.\"",
        "date": "10072015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Patriot Coal withdraws Alcoa deal as bankruptcy talks continue "
    },
    {
        "content": "Alcoa Inc reported a smaller-than-expected quarterly profit  hurt by slumping prices for aluminum and other commodities and unfavorable foreign exchange rates.",
        "date": "10082015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa profit misses as aluminum prices slide "
    },
    {
        "content": "Oct 8 Alcoa Inc reported a smaller-than-expected quarterly profit  hurt by slumping prices for aluminum and other commodities and unfavorable foreign exchange rates.",
        "date": "10082015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 3-Alcoa profit misses as aluminum prices slide "
    },
    {
        "content": "Alcoa Inc said it had got a contract to supply titanium to Lockheed Martin Corp's F-35 Lightning II aircraft.",
        "date": "10072015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa wins $1.1 billion contract for Lockheed's F-35 fighter jets "
    },
    {
        "content": "Oct 7 Alcoa Inc said it had got a contract to supply titanium to Lockheed Martin Corp's  F-35 Lightning II aircraft.",
        "date": "10072015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa wins $1.1 bln contract for Lockheed's F-35 fighter jets "
    },
    {
        "content": "* Energy sector leads advancers as oil rallies to three-month high",
        "date": "10082015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Wall St rises after release of 'dovish' Fed minutes "
    },
    {
        "content": "Oct 8 Alcoa Inc reported a smaller-than-expected quarterly profit  hurt by a slide in aluminum prices that has prompted the company to separate the smelting operations from the faster-growing plane and car parts business.",
        "date": "10082015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Alcoa profit misses as aluminum prices slide "
    },
    {
        "content": "Davie  FLORIDA  Oct 2 U.S. Democratic presidential candidate Hillary Clinton said Friday that a bankruptcy plan proposed by Patriot Coal Corp. is \"outrageous and must be stopped\" because it diverts money intended for coal miners' retirement benefits.",
        "date": "10032015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Clinton blasts Patriot Coal bankruptcy plan "
    },
    {
        "content": "Oct 8 Alcoa Inc reported a 10.7 percent fall in quarterly sales  hurt by sliding aluminum prices and divestitures.",
        "date": "10082015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa sales fall 10.7 pct "
    },
    {
        "content": "Oct 5 Alcoa Inc said it has signed a contract worth about $1 billion with Airbus Group for multi-material aerospace fastening systems.",
        "date": "10052015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa signs $1 bln contract with Airbus "
    },
    {
        "content": "Davie  FLORIDA U.S. Democratic presidential candidate Hillary Clinton said Friday that a bankruptcy plan proposed by Patriot Coal Corp. is \"outrageous and must be stopped\" because it diverts money intended for coal miners' retirement benefits.",
        "date": "10052015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Clinton blasts Patriot Coal bankruptcy plan "
    },
    {
        "content": "CHICAGO Alcoa Inc  said Monday it will break itself in two  separating a faster growing plane and car parts business from traditional aluminum smelting operations as shareholders seek higher returns amid a commodity slump. | Video ",
        "date": "09282015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa to split into two as aluminum glut batters legacy business "
    },
    {
        "content": "SYDNEY  Sept 29 In what could be a cautionary tale for Alcoa Inc  global miner BHP Billiton's   decision to spin off non-core businesses into a separate company is yet to pay off for shareholders.",
        "date": "09292015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "RPT-BHP Billiton's split may have lessons for Alcoa "
    },
    {
        "content": "LONDON  Sept 29 Alcoa is synonymous with aluminium.",
        "date": "09302015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "RPT-COLUMN-Alcoa and the painful business of making aluminium: Andy Home "
    },
    {
        "content": "CHICAGO  Sept 28 Alcoa Inc said Monday it will break itself in two  separating a faster growing plane and car parts business from traditional aluminum smelting operations as shareholders seek higher returns amid a commodity slump.",
        "date": "09282015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 4-Alcoa to split into two as aluminum glut batters legacy business "
    },
    {
        "content": "LONDON  Sept 29 Alcoa is synonymous with aluminium.",
        "date": "09292015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "COLUMN-Alcoa and the painful business of making aluminium: Andy Home "
    },
    {
        "content": "* GRAPHIC on average aluminum production costs: http://reut.rs/1P8X7F2",
        "date": "09292015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "RPT-Alcoa's split brings losses from its aluminum smelters into focus "
    },
    {
        "content": "SYDNEY  Sept 29 In what could be a cautionary tale for Alcoa Inc  global miner BHP Billiton's   decision to spin off non-core businesses into a separate company is yet to pay off for shareholders.",
        "date": "09292015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BHP Billiton's split may have lessons for Alcoa "
    },
    {
        "content": "CHICAGO  Sept 28 Metals firm Alcoa Inc  said on Monday it would split into two publicly traded entities  acknowledging that its legacy aluminum operations and higher-value and automotive businesses were diverging and no longer compatible.",
        "date": "09282015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "CORRECTED-Alcoa to split into two companies in second half of 2016 "
    },
    {
        "content": "CHICAGO Alcoa Inc  said Monday it will break itself in two  separating a faster growing plane and car parts business from traditional aluminum smelting operations as shareholders seek higher returns amid a commodity slump. | Video ",
        "date": "09292015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa to split into two as aluminum glut batters legacy business "
    },
    {
        "content": "* GRAPHIC on average aluminum production costs: http://reut.rs/1P8X7F2",
        "date": "09292015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa's split brings losses from its aluminum smelters into focus "
    },
    {
        "content": "* Graphic on average production costs: http://reut.rs/1P8X7F2",
        "date": "09212015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "China's rising output  price rout deepen aluminum industry gloom "
    },
    {
        "content": "CHICAGO  Sept 14 Ford Motor Co will begin in the fourth quarter to use multiple components in its high-selling F-150 pickup model made from an advanced Alcoa Inc  aluminum alloy that is tough enough to replace steel parts yet significantly lighter  both companies said on Monday.",
        "date": "09142015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "UPDATE 1-Ford F-150 2016 model parts to be made of Alcoa's Micromill aluminum "
    },
    {
        "content": "* Ford Motor Co  Alcoa Inc Collaborate On More Formable And Design Friendly next-generation aluminum alloys",
        "date": "09142015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Ford Motor  Alcoa collaborate to produce automotive aluminum alloys "
    },
    {
        "content": "* Says will commercialize its Micromilltm technology  working with the Danieli group",
        "date": "09142015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "BRIEF-Alcoa to commercialize its MicromillTM technology  working with The Danieli Group "
    },
    {
        "content": "CHICAGO  Sept 14 Ford Motor Co will begin in the fourth quarter to use multiple components in its high-selling F-150 pickup model made from an advanced Alcoa Inc  aluminum alloy that is as tough enough to replace steel parts yet significantly lighter  both companies said on Monday.",
        "date": "09142015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Ford F-150 to get Alcoa's Micromill aluminum parts starting Q4 "
    },
    {
        "content": "Sept 14 Alcoa Inc said it would stop production at its Suralco alumina refinery in Suriname due to dwindling bauxite ore supply.",
        "date": "09142015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Alcoa to stop production at Suriname refinery "
    },
    {
        "content": "NEW YORK  Sept 8 Alcoa Inc will restart its Texarkana  Texas casthouse  which has been idled since 2009  to meet growing demand for aluminum slab from the automotive industry  the company announced on Tuesday.",
        "date": "09082015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa to restart Texarkana plant to meet automotive aluminum demand "
    },
    {
        "content": "Sept 14 Alcoa Inc said it would cut remaining capacity at its Suralco alumina refinery in Suriname and take a related restructuring charge of $65 million-$75 million.",
        "date": "09142015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa to cut remaining capacity at Suriname refinery "
    },
    {
        "content": "CHICAGO  Sept 3 Metals company Alcoa Inc  said on Thursday it will invest $60 million to expand its research and development center in Pennsylvania to explore ways to make 3D printing viable on an industrial scale to produce parts for the aerospace  automotive and construction sectors.",
        "date": "09032015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa plans new R&D center for advanced 3D printing processes "
    },
    {
        "content": "NEW YORK Alcoa Inc will challenge the chairman of the U.S. commodities regulator on its authority to interfere in the London Metal Exchange's warehousing reform at a meeting on Wednesday  a spokeswoman said on Tuesday.",
        "date": "08252015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa will meet CFTC to challenge LME warehouse reform "
    },
    {
        "content": "NEW YORK  Aug 25 Alcoa Inc will challenge the chairman of the U.S. commodities regulator on its authority to interfere in the London Metal Exchange's warehousing reform at a meeting on Wednesday  a spokeswoman said on Tuesday.",
        "date": "08252015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 2-Alcoa will meet CFTC to challenge LME warehouse reform "
    },
    {
        "content": "NEW YORK  Aug 25 The chairman of the U.S. commodities regulator and aluminum producer Alcoa Inc  will meet this week to discuss metals warehousing reform  a spokesman for the agency said on Tuesday.",
        "date": "08252015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "CFTC to meet with Alcoa on LME warehouse reform "
    },
    {
        "content": "LONDON Aluminum prices tumbled to six-year lows on Thursday as the market focused on a growing supply glut due to surging exports from top producer China and high stocks.",
        "date": "08062015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Supply glut pushes aluminum to six-year low "
    },
    {
        "content": "NEW YORK  Aug 5 U.S. aluminum producer Alcoa Inc  has stepped up efforts to challenge the U.S. commodities regulator's intervention in the London Metal Exchange's warehousing reform plan  criticizing its handling of the issue for a second time in as many months.",
        "date": "08052015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa ramps up criticism of CFTC over LME warehouse reform "
    },
    {
        "content": "NEW YORK  Aug 5 U.S. aluminum producer Alcoa Inc  has stepped up efforts to challenge the U.S. commodities regulator's intervention in the London Metal Exchange's warehousing reform plan  criticizing its handling of the issue for a second time in as many months.",
        "date": "08052015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Alcoa ramps up criticism of CFTC over LME warehouse reform "
    },
    {
        "content": "LONDON China exported 2.5 million tonnes of unwrought aluminum and aluminum products in the first half of this year.",
        "date": "07142015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa shines a light on China's 'fake semis' trade: Andy Home "
    },
    {
        "content": "LONDON  July 13 China exported 2.5 million tonnes of unwrought aluminium and aluminium products in the first half of this year.",
        "date": "07142015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "RPT-COLUMN-Alcoa shines a light on China's \"fake semis\" trade: Andy Home "
    },
    {
        "content": "LONDON  July 13 China exported 2.5 million tonnes of unwrought aluminium and aluminium products in the first half of this year.",
        "date": "07132015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "RPT-COLUMN-Alcoa shines a light on China's \"fake semis\" trade: Andy Home "
    },
    {
        "content": "LONDON  July 13 China exported 2.5 million tonnes of unwrought aluminium and aluminium products in the first half of this year.",
        "date": "07132015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "COLUMN-Alcoa shines a light on China's \"fake semis\" trade: Andy Home "
    },
    {
        "content": "* Euro zone ministers to meet on Saturday to decide on Greece",
        "date": "07102015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Wall St jumps in broad rally on Greece hopes "
    },
    {
        "content": "* Euro zone ministers to meet on Saturday to decide on Greece",
        "date": "07102015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Wall St rises; Yellen says expects Fed to raise rates this year "
    },
    {
        "content": "* Euro zone ministers to meet on Saturday to decide on Greece",
        "date": "07102015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Wall St higher on hopes of Greek debt deal "
    },
    {
        "content": "* Euro zone ministers to meet on Saturday to decide on Greece",
        "date": "07102015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Wall St opens higher on Greek hopes  China bounce "
    },
    {
        "content": "BENTONVILLE  Ark. Metals company Alcoa Inc reported a quarterly profit that missed expectations due to plunging primary aluminum prices on Wednesday  but revenues topped estimates on an ongoing drive to reduce reliance on the company's legacy commodity business.",
        "date": "07082015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa earnings hurt by low aluminum prices  higher global surplus seen "
    },
    {
        "content": "NEW YORK Alcoa Inc said Wednesday it expects Chinese exports of semi-finished aluminum to slow as prices drop and Beijing increases oversight  even as the U.S. company blamed the world's top producer and consumer for a ballooning global surplus.",
        "date": "07082015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa expects China aluminum exports to slow but sees higher surplus this year "
    },
    {
        "content": "NEW YORK  July 8 Alcoa Inc said Wednesday it expects Chinese exports of semi-finished aluminum to slow as prices drop and Beijing increases oversight  even as the U.S. company blamed the world's top producer and consumer for a ballooning global surplus.",
        "date": "07082015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 2-Alcoa expects China aluminum exports to slow but sees higher surplus this year "
    },
    {
        "content": "BENTONVILLE  Ark.  July 8 Metals company Alcoa Inc reported a quarterly profit that missed expectations due to plunging primary aluminum prices on Wednesday  but revenues topped estimates on an ongoing drive to reduce reliance on the company's legacy commodity business.",
        "date": "07082015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 2-Alcoa earnings hurt by low aluminum prices  higher global surplus seen "
    },
    {
        "content": "NEW YORK  July 8 Alcoa raised its forecast for the global aluminum surplus by more than half as China  the world's top producer and user of the light metal  has not cut output as much as expected  a senior executive said on Wednesday.",
        "date": "07082015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa sees bigger-than-expected aluminum surplus due to China "
    },
    {
        "content": "BENTONVILLE  Ark.  July 8 Metals company Alcoa Inc on Wednesday reported a slightly higher quarterly net profit on flat revenue.",
        "date": "07082015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa posts slightly higher quarterly net profit "
    },
    {
        "content": "LONDON  July 3 Investors in industrial metals will keep a close watch on miners' results in coming weeks for possible announcements of production cutbacks that could bolster weak prices.",
        "date": "07032015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Metals investors look for miners to cut supplies to lift prices "
    },
    {
        "content": "* Futures down: Dow 130 pts  S&P 15 pts  Nasdaq 31 pts   (Adds details  comment  updates prices)",
        "date": "07082015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Wall St set to open lower on China  Greece worries "
    },
    {
        "content": "TOKYO  July 3 Japan's aluminium premiums for July-September shipments were mostly set at a six-year low of $100 per tonne  plunging 74 percent from the previous quarter due to a supply glut  five sources directly involved in the talks said.",
        "date": "07032015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Japan Q3 aluminium premiums mostly set at six-year low of $100/T -sources "
    },
    {
        "content": "MOSCOW  June 11 Russian aluminium maker Rusal  and several of its domestic consumers have proposed a tax on imports of products containing aluminium  such as wheel disks  Vedomosti newspaper reported on Thursday.",
        "date": "06112015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "CORRECTED-Russia's Rusal  consumers propose import tax on aluminium products - Vedomosti "
    },
    {
        "content": "BRUSSELS  June 12 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "06122015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "EU mergers and takeovers (June 12) "
    },
    {
        "content": "WASHINGTON  June 8 Metals producer Alcoa Inc  on Monday challenged the U.S. commodities regulator's authority to intervene in a contentious overhaul of the London Metal Exchange's warehouse policy that has caused an unprecedented drop in aluminum prices.",
        "date": "06082015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa queries US regulator over bid to reform LME policy "
    },
    {
        "content": "LONDON Aluminum premiums are in meltdown the world over.",
        "date": "06042015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Falling LME aluminum price confounds the theorists: Andy Home "
    },
    {
        "content": "CHICAGO  June 4 Metals company Alcoa Inc  said on Thursday it is supplying aerospace-grade aluminum to Samsung Electronics Co Ltd for its Galaxy S6 and S6 edge models  enabling the smartphone maker to produce more durable and sleeker phones.",
        "date": "06042015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa supplying aerospace aluminum for Samsung Galaxy 6 phones "
    },
    {
        "content": "DUBAI  May 12 Saudi Arabian Mining Co  (Ma'aden) said a massive smelter run jointly with U.S. group Alcoa  which had experienced few technical glitches on start-up  will produce above its initial capacity target this year.",
        "date": "05122015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "UPDATE 1-Saudi  Alcoa aluminium smelter production to top initial target this year "
    },
    {
        "content": "BRUSSELS  May 8 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "05082015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "EU mergers and takeovers (May 8) "
    },
    {
        "content": "* Indexes up: Dow 0.3 pct  S&P 0.5 pct  Nasdaq 0.5 pct   (Updates trading volume  adds PriceSmart and Medicines Co news)",
        "date": "04092015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "US STOCKS-Wall St ends up on energy rebound; early earnings weak "
    },
    {
        "content": "* Dow flat  S&P up 0.1 pct  Nasdaq up 0.1 pct   (Updates to afternoon trading)",
        "date": "04092015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Wall St edges up as energy rebounds; early earnings weak "
    },
    {
        "content": "NEW YORK  April 8 The world aluminum market will see a surplus of 326 000 tonnes in 2015  an executive at Alcoa Inc said following a presentation of the company's first-quarter 2015 earnings on Wednesday.",
        "date": "04082015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "UPDATE 2-Alcoa now sees global aluminum surplus of 326 000 tonnes in 2015 "
    },
    {
        "content": "CHICAGO Alcoa Inc earned a profit in the first quarter after a year-earlier loss  reflecting its ongoing shift from traditional  smelting and refining to value-added businesses such as automotive and aerospace  the aluminum producer said on Wednesday.",
        "date": "04092015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa posts profit after year-earlier loss  confirms '15 outlook "
    },
    {
        "content": "CHICAGO Alcoa Inc earned a profit in the first quarter after a year-earlier loss  reflecting its ongoing shift from traditional  smelting and refining to value-added businesses such as automotive and aerospace  the aluminum producer said on Wednesday.",
        "date": "04082015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa posts profit after year-earlier loss  confirms '15 outlook "
    },
    {
        "content": "CHICAGO  April 8 Alcoa Inc earned a profit in the first quarter after a year-earlier loss  reflecting its ongoing shift from traditional  smelting and refining to value-added businesses such as automotive and aerospace  the aluminum producer said on Wednesday.",
        "date": "04082015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 2-Alcoa posts profit after year-earlier loss  confirms '15 outlook "
    },
    {
        "content": "* Fed minutes indicate rate hike in 2015; members differ on month",
        "date": "04082015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Wall St ends with modest gains after Fed minutes "
    },
    {
        "content": "CHICAGO  April 8 Metals company Alcoa Inc  kicked off the first-quarter earnings season on Wednesday  reporting that it swung to a quarterly profit on a jump in revenue  primarily in its value-added automotive and aerospace businesses.",
        "date": "04082015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa swings to 1st-quarter profit as revenue rises "
    },
    {
        "content": "NEW YORK Market focus will shift from macro to micro next week as economic data winds down and quarterly earnings reports from S&P 500 components including Alcoa  take center-stage.",
        "date": "04022015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Stocks could resume gains as focus shifts to earnings "
    },
    {
        "content": "LONDON U.S. aluminum producer Alcoa has this week announced the full shuttering of the Alumar smelter in Brazil.",
        "date": "04012015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "The decline and fall of South American aluminum production: Andy Home "
    },
    {
        "content": "NEW YORK  April 2 Market focus will shift from macro to micro next week as economic data winds down and quarterly earnings reports from S&P 500 components including Alcoa take center-stage.",
        "date": "04022015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Wall St Week Ahead-Stocks could resume gains as focus shifts to earnings "
    },
    {
        "content": "* Brazil  US physical premiums: http://link.reuters.com/buv44w",
        "date": "04012015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "COLUMN-The decline and fall of South American aluminium production: Andy Home "
    },
    {
        "content": "March 30 Aluminum maker Alcoa Inc said on Monday it will shut its only remaining smelter in Brazil  the latest victim of a toxic mix of weak metal prices and high energy costs.",
        "date": "03302015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "UPDATE 1-Alcoa's Brazil aluminum smelter latest victim of high costs "
    },
    {
        "content": "NEW YORK Market focus will shift from macro to micro next week  and investors betting on gains in stocks will hope coming earnings reports will be somewhat stronger than recent disappointing economic figures.",
        "date": "04032015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Stock markets hope earnings offset weak economic data "
    },
    {
        "content": "March 30 Aluminum maker Alcoa Inc said on Monday it would shut the remaining 74 000 metric tons of capacity at its Sao Luis smelter in Brazil due to weak metal prices and high costs.",
        "date": "03302015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa to shut Sao Luis smelter in Brazil "
    },
    {
        "content": "LONDON U.S. aluminum producer Alcoa has this week announced the full shuttering of the Alumar smelter in Brazil.",
        "date": "04032015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "The decline and fall of South American aluminum production: Andy Home "
    },
    {
        "content": "Aluminum maker Alcoa Inc said it would curtail 443 000 metric tons per year of alumina refining capacity at its Suralco facility in Suriname.",
        "date": "03172015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Alcoa to curtail 443 000 metric tons refining capacity in Suriname "
    },
    {
        "content": "March 17 Aluminum maker Alcoa Inc said it would curtail 443 000 metric tons per year of alumina refining capacity at its Suralco facility in Suriname.",
        "date": "03172015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "CORRECTED-UPDATE 1-Alcoa to curtail 443 000 metric tons refining capacity in Suriname "
    },
    {
        "content": "March 17 Aluminum maker Alcoa Inc said it would curtail 443 000 metric tons per year of alumina refining capacity at Suralco in Suriname.",
        "date": "03172015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "CORRECTED-Alcoa to curtail 443 000 metric tons refining capacity in Suriname "
    },
    {
        "content": "LONDON  March 11 U.S. aluminium producer Alcoa  last week said it had placed 500 000 tonnes of production capacity under review for possible closure or sale.",
        "date": "03112015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "COLUMN-Ominous warning signs from the aluminium market: Andy Home "
    },
    {
        "content": "* Indexes up: Dow 0.8 pct  S&P 0.4 pct  Nasdaq 0.3 pct   (Updates to close)",
        "date": "03092015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "US STOCKS-Wall St rebounds on deal activity; Apple up after watch news "
    },
    {
        "content": "CHICAGO Alcoa Inc agreed to pay $1.3 billion to acquire titanium supplier RTI International Metals Inc  the metals company's latest investment in more profitable products for the aerospace and automotive industries.",
        "date": "03092015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa to buy titanium supplier RTI to boost aerospace business "
    },
    {
        "content": "CHICAGO  March 9 Alcoa Inc agreed to pay $1.3 billion to acquire titanium supplier RTI International Metals Inc  the metals company's latest investment in more profitable products for the aerospace and automotive industries.",
        "date": "03092015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 3-Alcoa to buy titanium supplier RTI to boost aerospace business "
    },
    {
        "content": "NEW YORK  March 6 A warning by Alcoa that it may reduce smelting capacity is the first concrete sign that lower delivery premiums for aluminum are threatening producers amid low futures prices  traders and industry sources said.",
        "date": "03062015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa's warning of smelter closures shows impact of falling premiums "
    },
    {
        "content": "* Indexes up: Dow 0.6 pct  S&P 0.3 pct  Nasdaq flat   (Updates to midday trading)",
        "date": "03092015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Wall St gains on deal activity  energy shares rally "
    },
    {
        "content": "* Indexes up: Dow 0.4 pct  S&P 500 0.2 pct  Nasdaq 0.1 pct   (Updates to market open)",
        "date": "03092015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Wall St gains  M&A provides a lift "
    },
    {
        "content": "* China nickel premiums jump as country shuts old NPI plants   (Updates with closing prices)",
        "date": "03062015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "METALS-Copper falls after strong U.S. jobs report boosts dollar "
    },
    {
        "content": "* Futures up: Dow 12 pts  S&P 3 pts  Nasdaq 8.5 pts   (Updates trading  adds McDonald's sales)",
        "date": "03092015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Futures point to flat open after recent decline "
    },
    {
        "content": "* Futures down: Dow 23 pts  S&P 2.75 pts  Nasdaq 3.75 pts   (Updates trading  adds Alcoa news)",
        "date": "03092015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Futures dip  extending recent weakness  on rate uncertainty "
    },
    {
        "content": "March 6 Aluminum maker Alcoa Inc said a review of its operations to cut costs could impact 14 percent of its global smelting capacity and 16 percent of its global refining capacity.",
        "date": "03062015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 1-Alcoa says review could affect 14 pct of smelting capacity "
    },
    {
        "content": "CHICAGO  March 9 Metals company Alcoa Inc  on Monday that it would acquire titanium supplier RTI International Metals Inc for $1.5 billion  or the equivalent of $41 per share  in an all-stock transaction.",
        "date": "03092015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa to acquire titanium supplier RTI International for $1.5bln "
    },
    {
        "content": "March 6 Aluminum maker Alcoa Inc said a review of its operations could impact 14 percent of its global smelting capacity and 16 percent of its global refining capacity.",
        "date": "03062015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa says review could affect 14 pct of smelting capacity "
    },
    {
        "content": "LONDON Non-Chinese aluminum production was unchanged in January  according to the latest figures from the International Aluminum Institute (IAI).",
        "date": "02252015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Aluminum restarts not just a matter of price: Home "
    },
    {
        "content": "NEW YORK  Feb 9 U.S. stock index futures were lower on Monday  in the wake of disappointing economic data out of China and signs of rising tensions surrounding Greek debt negotiations.",
        "date": "02092015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "US STOCKS-Futures lower on China data  Greek debt worry "
    },
    {
        "content": "NEW YORK  Jan 12 Alcoa Chief Financial Officer William Oplinger said on Monday that the all-in aluminum price  including benchmark future prices and regional premiums  would remain \"similar to the market situation that we have today.\"",
        "date": "01122015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "UPDATE 1-Alcoa CFO says overall aluminum price to remain stable "
    },
    {
        "content": "NEW YORK  Jan 12 Alcoa's Chief Financial Officer William Oplinger said in the company's fourth-quarter earnings call on Monday that the all-in aluminum price  including benchmark future prices and regional premiums  would remain \"similar to the market situation that we have today.\"",
        "date": "01122015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa CFO says overall aluminum price to remain stable "
    },
    {
        "content": "CHICAGO Metals company Alcoa Inc  on Monday reported higher-than-expected quarterly profit  swinging from a year-earlier loss due to a boost from automotive demand  higher aluminum prices and lower energy costs.",
        "date": "01122015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa swings to profit  sees strong demand for aerospace "
    },
    {
        "content": "CHICAGO  Jan 12 Metals company Alcoa Inc  on Monday reported higher-than-expected quarterly profit  swinging from a year-earlier loss due to a boost from automotive demand  higher aluminum prices and lower energy costs.",
        "date": "01122015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 2-Alcoa swings to profit  sees strong demand for aerospace "
    },
    {
        "content": "SYDNEY The euro was pinned near nine-year lows on Wednesday as investors wagered the European Central Bank was just a week away from launching a new stimulus campaign  while concerns about the global economy kept Asian equities subdued.",
        "date": "01132015",
        "name": "Alcoa Corporation",
        "news_type": "topStory",
        "symbol": "AA",
        "title": "Euro pressured  oil slide a boon for bonds "
    },
    {
        "content": "NEW YORK  Jan 12 The global aluminum deficit will shrink to 38 000 tonnes in 2015 as more than 5 million tonnes of new capacity partially offsets rising demand  Alcoa  said in a presentation on Monday after reporting higher-than-expected fourth-quarter profit.",
        "date": "01122015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa sees global aluminum deficit shrinking in 2015 "
    },
    {
        "content": "* Indexes off: Dow 0.5 pct  S&P 0.8 pct  Nasdaq 0.8 pct   (Updates to close)",
        "date": "01122015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Wall St falls; energy shares dragged down further by oil "
    },
    {
        "content": "NEW YORK U.S. stocks ended down slightly in a volatile session on Tuesday  led by a drop in materials and energy shares following further weakness in commodity prices.",
        "date": "01132015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Wall St. ends down in volatile day; materials a drag "
    },
    {
        "content": "CHICAGO  Jan 12 Metals company Alcoa Inc  on Monday reported a higher-than-expected quarterly profit excluding restructuring costs  as the firm continued its transition toward more lucrative automotive and aerospace products and away from high-cost smelting facilities.",
        "date": "01122015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "Alcoa swings to quarterly profit as restructuring proceeds "
    },
    {
        "content": "* Indexes down: Dow 0.5 pct  S&P 0.6 pct  Nasdaq 0.4 pct   (Updates to afternoon)",
        "date": "01132015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Wall St reverses early gains; materials  energy lead decline "
    },
    {
        "content": "* Indexes up: Dow 0.8 pct  S&P 0.6 pct  Nasdaq 1 pct   (Updates to midday  changes byline)",
        "date": "01132015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Wall St gains after 2-day drop; tech shares rise "
    },
    {
        "content": "* Indexes up: Dow 1.48 pct  S&P 1.23 pct  Nasdaq 1.43pct   (Adds quote)",
        "date": "01132015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Wall St rallies after 2-day drop  Alcoa earnings "
    },
    {
        "content": "NEW YORK  Jan 13 U.S. stocks rose broadly at the open on Tuesday  following two days of losses on the S&P 500  the day after financial results from Alcoa helped ease some investor jitters regarding the corporate earnings season.",
        "date": "01132015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS SNAPSHOT-Wall St opens up as Alcoa results boost confidence "
    },
    {
        "content": "* Futures up: Dow 92 pts  S&P 10 pts  Nasdaq 24.75 pts   (Adds quote)",
        "date": "01132015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Wall St to open higher after 2-day drop  Alcoa results "
    },
    {
        "content": "* Futures up: Dow 81 pts  S&P 8.5 pts  Nasdaq 20.5 pts   (Adds premarket actives)",
        "date": "01132015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Futures higher after 2-day decline  Alcoa results "
    },
    {
        "content": "NEW YORK  Jan 13 U.S. stock index futures advanced on Tuesday after the S&P 500 fell for a second consecutive session  as earnings from Alcoa helped ease some investor skittishness about the corporate earnings season.",
        "date": "01132015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "US STOCKS-Futures higher after 2-day fall  Alcoa earnings "
    },
    {
        "content": "* Macquarie expects slight global deficit in 2015   (Adds Macquarie 2015 outlook  bullet points)",
        "date": "01132015",
        "name": "Alcoa Corporation",
        "news_type": "normal",
        "symbol": "AA",
        "title": "UPDATE 3-Alcoa's aluminum price for estimates 'similar' to current levels "
    }
]