[
    {
        "content": "SAN FRANCISCO Alphabet Inc's  Google reclaimed on Tuesday its spot as the default search engine on Mozilla Corp's Firefox Internet browser in the United States and other regions as the browser maker stunned Verizon Communication Inc's  Yahoo by canceling their deal.",
        "date": "11152017",
        "name": "Altaba Inc",
        "news_type": "topStory",
        "symbol": "AABA",
        "title": "Firefox opts for Google as default search in U.S.  surprising Yahoo "
    },
    {
        "content": "SAN FRANCISCO  Nov 14 Alphabet Inc's Google reclaimed on Tuesday its spot as the default search engine on Mozilla Corp's Firefox Internet browser in the United States and other regions as the browser maker stunned Verizon Communication Inc's Yahoo by canceling their deal.",
        "date": "11152017",
        "name": "Altaba Inc",
        "news_type": "normal",
        "symbol": "AABA",
        "title": "UPDATE 1-Firefox opts for Google as default search in U.S.  surprising Yahoo "
    },
    {
        "content": "SAN FRANCISCO  Nov 14 Alphabet Inc's Google reclaimed on Tuesday its spot as the default search engine on Mozilla Corp's Firefox Internet browser in the United States and other regions as the browser maker stunned Verizon Communication Inc's Yahoo by canceling their deal.",
        "date": "11142017",
        "name": "Altaba Inc",
        "news_type": "topStory",
        "symbol": "AABA",
        "title": "Firefox opts for Google as default search in U.S.  surprising Yahoo "
    },
    {
        "content": "WASHINGTON Former Yahoo Chief Executive Marissa Mayer apologized on Wednesday for two massive data breaches at the internet company  blaming Russian agents for at least one of them  at a hearing on the growing number of cyber attacks on major U.S. companies. | Video ",
        "date": "11092017",
        "name": "Altaba Inc",
        "news_type": "topStory",
        "symbol": "AABA",
        "title": "Former Yahoo CEO apologizes for data breaches  blames Russians "
    },
    {
        "content": "WASHINGTON  Nov 8 Former Yahoo Chief Executive Marissa Mayer apologized on Wednesday for a pair of massive data breaches at the internet company and blamed Russian agents at a hearing on the growing number of incidents involving major U.S. companies.",
        "date": "11082017",
        "name": "Altaba Inc",
        "news_type": "topStory",
        "symbol": "AABA",
        "title": "Former Yahoo CEO apologizes for data breach  blames Russians "
    },
    {
        "content": "WASHINGTON  Nov 8 Former Yahoo Chief Executive Marissa Mayer apologized on Wednesday for two massive data breaches at the internet company  blaming Russian agents for at least one of them  at a hearing on the growing number of cyber attacks on major U.S. companies.",
        "date": "11092017",
        "name": "Altaba Inc",
        "news_type": "normal",
        "symbol": "AABA",
        "title": "UPDATE 4-Former Yahoo CEO apologizes for data breaches  blames Russians "
    },
    {
        "content": "WASHINGTON Former Yahoo Chief Executive Marissa Mayer and the current and former CEOs of Equifax Inc  will testify before a U.S. Senate panel on Nov. 8 on two massive data breaches  the committee said Wednesday.",
        "date": "11012017",
        "name": "Altaba Inc",
        "news_type": "topStory",
        "symbol": "AABA",
        "title": "Former Yahoo CEO  Equifax CEO to testify at Senate hearing "
    },
    {
        "content": "WASHINGTON Verizon Communication Inc  media chief Marni Walden confirmed on Tuesday she had decided to leave the telecommunications company next year after it became clear she would not become its next chief executive.",
        "date": "10102017",
        "name": "Altaba Inc",
        "news_type": "topStory",
        "symbol": "AABA",
        "title": "Verizon media chief departing after not getting top job "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Yahoo is like a zombie feasting on Verizon’s brains. Marni Walden  a top executive at the $200 billion U.S. telecom group  is leaving just a day after the internet firm she helped to acquire tripled its tally of customer accounts exposed to a 2013 hack. While the company suggests the timing is a coincidence  it’s clear that Yahoo is a problem that continues to fester.",
        "date": "10052017",
        "name": "Altaba Inc",
        "news_type": "topStory",
        "symbol": "AABA",
        "title": "Breakingviews - Yahoo’s corpse keeps festering at Verizon "
    },
    {
        "content": "Yahoo on Tuesday said that all 3 billion of its accounts were hacked in a 2013 data theft  tripling its earlier estimate of the size of the largest breach in history  in a disclosure that attorneys said sharply increased the legal exposure of its new owner  Verizon Communications Inc . | Video ",
        "date": "10042017",
        "name": "Altaba Inc",
        "news_type": "topStory",
        "symbol": "AABA",
        "title": "Yahoo says all three billion accounts hacked in 2013 data theft "
    },
    {
        "content": "WASHINGTON The chairman of the U.S. Senate Commerce Committee said on Tuesday he plans to hold a hearing later this month over massive data breaches at Equifax Inc  and Yahoo  which is now owned by Verizon Communications Inc .",
        "date": "10042017",
        "name": "Altaba Inc",
        "news_type": "normal",
        "symbol": "AABA",
        "title": "Senate panel to hold hearing on Yahoo  Equifax breaches "
    },
    {
        "content": "WASHINGTON  Oct 3 The chairman of the U.S. Senate Commerce Committee said on Tuesday he plans to hold a hearing later this month over massive data breaches at Equifax Inc and Yahoo  which is now owned by Verizon Communications Inc.",
        "date": "10032017",
        "name": "Altaba Inc",
        "news_type": "topStory",
        "symbol": "AABA",
        "title": "U.S. Senate panel to hold hearing on Yahoo  Equifax breaches "
    },
    {
        "content": "Oct 3 Yahoo on Tuesday said that all 3 billion of its accounts were hacked in a 2013 data theft  tripling its earlier estimate of the size of the largest breach in history  in a disclosure that attorneys said sharply increased the legal exposure of its new owner  Verizon Communications Inc.",
        "date": "10042017",
        "name": "Altaba Inc",
        "news_type": "normal",
        "symbol": "AABA",
        "title": "UPDATE 4-Yahoo says all 3 billion accounts hacked in 2013 data theft "
    },
    {
        "content": "* Yahoo has put out a release that says it is tripling the number of users affected by the 2013 hack to 3 billion‍​ Source text for Eikon: Further company coverage:",
        "date": "10032017",
        "name": "Altaba Inc",
        "news_type": "normal",
        "symbol": "AABA",
        "title": "BRIEF-Yahoo tripling the number of users affected by 2013 Hack to 3 billion "
    },
    {
        "content": "Oct 3 Yahoo  now part of Verizon Communications Inc  said on Tuesday that all of its 3 billion user accounts were affected in the August 2013 data theft  following an investigation involving forensic experts.",
        "date": "10032017",
        "name": "Altaba Inc",
        "news_type": "normal",
        "symbol": "AABA",
        "title": "Yahoo says all 3 bln accounts affected in 2013 hack "
    },
    {
        "content": "* Yahoo provides notice to additional users affected by previously disclosed 2013 data theft",
        "date": "10032017",
        "name": "Altaba Inc",
        "news_type": "normal",
        "symbol": "AABA",
        "title": "BRIEF-Yahoo provides notice to additional users affected by 2013 data theft "
    },
    {
        "content": "Two former editorial directors at Yahoo Inc fought back against its bid to toss their lawsuit accusing the company of terminating qualified male editors in favor of a new guard of women leaders.",
        "date": "09112017",
        "name": "Altaba Inc",
        "news_type": "topStory",
        "symbol": "AABA",
        "title": "Former Yahoo editors say company's review system masked gender bias "
    },
    {
        "content": "A U.S. judge said Yahoo must face nationwide litigation brought on behalf of well over 1 billion users who said their personal information was compromised in three massive data breaches.",
        "date": "08312017",
        "name": "Altaba Inc",
        "news_type": "topStory",
        "symbol": "AABA",
        "title": "Yahoo must face litigation by data breach victims: U.S. judge "
    },
    {
        "content": "Aug 31 A U.S. judge said Yahoo must face nationwide litigation brought on behalf of well over 1 billion users who said their personal information was compromised in three massive data breaches.",
        "date": "08312017",
        "name": "Altaba Inc",
        "news_type": "normal",
        "symbol": "AABA",
        "title": "Yahoo must face litigation by data breach victims -U.S. judge "
    },
    {
        "content": "TORONTO In his first U.S. court appearance on Wednesday  Canadian Karim Baratov pleaded not guilty to charges that he helped Russian agents in a high-profile cyber attack on Yahoo email accounts  his lawyer said.",
        "date": "08232017",
        "name": "Altaba Inc",
        "news_type": "topStory",
        "symbol": "AABA",
        "title": "Canadian accused in Yahoo hack pleads not guilty in U.S. court "
    },
    {
        "content": "Yahoo Inc owes a prize promoter $5.5 million for backing out of a contract to pay $1 billion for predicting every winner in the 2014 NCAA men's basketball tournament  and entering a similar contract with Quicken Loans Inc and Warren Buffett's Berkshire Hathaway Inc   a court decided on Monday.",
        "date": "08212017",
        "name": "Altaba Inc",
        "news_type": "topStory",
        "symbol": "AABA",
        "title": "Yahoo owes millions for busting NCAA tournament bracket deal: court "
    },
    {
        "content": "Aug 21 Yahoo Inc owes a prize promoter $5.5 million for backing out of a contract to pay $1 billion for predicting every winner in the 2014 NCAA men's basketball tournament  and entering a similar contract with Quicken Loans Inc and Warren Buffett's Berkshire Hathaway Inc  a court decided on Monday.",
        "date": "08212017",
        "name": "Altaba Inc",
        "news_type": "normal",
        "symbol": "AABA",
        "title": "Yahoo owes millions for busting NCAA tournament bracket deal-court "
    },
    {
        "content": "* Altaba Inc - ‍board appointed Richard Kauffman as independent director filling vacancy on Altaba's board and bringing total number of directors to five",
        "date": "08152017",
        "name": "Altaba Inc",
        "news_type": "topStory",
        "symbol": "AABA",
        "title": "BRIEF-Altaba appoints Richard L. Kauffman to board of directors "
    },
    {
        "content": "* Refers to article published on the edge singapore and yahoo",
        "date": "08152017",
        "name": "Altaba Inc",
        "news_type": "normal",
        "symbol": "AABA",
        "title": "BRIEF-Second Chance Properties clarifies on article published in The Edge Singapore And Yahoo "
    },
    {
        "content": "* Greenlight Capital Inc takes 4.3 million share stake in Altaba Inc - SEC filing",
        "date": "08142017",
        "name": "Altaba Inc",
        "news_type": "topStory",
        "symbol": "AABA",
        "title": "BRIEF-Greenlight Capital Inc takes 4.3 mln share stake in Altaba Inc "
    },
    {
        "content": "* Takes sole share stake of 3.3 million shares in Altaba Inc ‍​- SEC filing",
        "date": "08142017",
        "name": "Altaba Inc",
        "news_type": "normal",
        "symbol": "AABA",
        "title": "BRIEF-Jana Partners takes sole share stake in Altaba  Pandora  Zimmer Biomet "
    },
    {
        "content": "* Altaba inc - ‍new authorization supersedes existing buyback program  which was authorized in March 2015 when company was known as Yahoo! Inc.​ Source text for Eikon: Further company coverage:",
        "date": "07312017",
        "name": "Altaba Inc",
        "news_type": "topStory",
        "symbol": "AABA",
        "title": "BRIEF-Altaba announces $5 billion share repurchase program "
    }
]