[
    {
        "content": "MONTREAL  Nov 17 Business jet operators  already offering double digit raises to attract pilots  could face a labor shortfall in North America as they compete with U.S. airlines for talent  executives and analysts said.",
        "date": "11182017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Business jets risk U.S. pilot shortage on  competition from airlines "
    },
    {
        "content": "* AMERICAN AIRLINES ANNOUNCES NEW SERVICE TO REYKJAVIK  ICELAND",
        "date": "11142017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-AMERICAN AIRLINES ANNOUNCES NEW SERVICE TO REYKJAVIK  ICELAND "
    },
    {
        "content": "DUBÁI/SINGAPUR  6 nov Qatar Airways amplió su alcance global con la compra de un 9 61 por ciento de participación en Cathay Pacific  con lo que sumó otro inversor estratégico a la aerolínea de Hong Kong en momentos en que busca reducir costos.",
        "date": "11062017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "Qatar Airways compra 9 61 pct de participación en Cathay Pacific por 661 mln dlr "
    },
    {
        "content": "DUBAI/SINGAPORE Qatar Airways has broadened its global reach by purchasing a 9.61 percent stake in Cathay Pacific   adding another strategic investor to the Hong Kong carrier's complicated share register at a time when it is looking to cut costs.",
        "date": "11062017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Rebuffed by American Airlines  Qatar Airways buys into Cathay Pacific "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - Qatar Airways has landed in the centre of the debate about Cathay Pacific’s future. The state-owned Middle Eastern carrier is buying nearly 10 percent of its struggling Hong Kong counterpart for about $661 million. That may not be a money-spinner for the Qataris  but it will certainly complicate any future manoeuvring over Cathay’s ownership.",
        "date": "11062017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Breakingviews - Qatar Airways gets seat for any Cathay dealmaking "
    },
    {
        "content": "* Joins concentrated register alongside Swire Pacific  Air China",
        "date": "11072017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "RPT-UPDATE 3-Rebuffed by American Airlines  Qatar Airways buys into Cathay Pacific "
    },
    {
        "content": "DUBAI Etihad Airways said on Thursday it would stop flying to Dallas-Fort Worth next year after American Airlines'  decided in July to end a codeshare agreement between the two carriers.",
        "date": "11022017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "Etihad to end Dallas-Fort Worth route  blames American Airlines "
    },
    {
        "content": "* Says on Nov 1  American Airlines  co entered third amendment to credit and guaranty agreement amending agreement dated April 29  2016​",
        "date": "11012017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines says entered into amendment to credit and guaranty agreement "
    },
    {
        "content": "Oct 31 Canadian carrier WestJet Airlines Ltd said on Tuesday it would weigh the possibility of a revenue-sharing arrangement or joint-venture with a U.S. carrier  after reporting better-than-expected profits on an increase in passengers in the third quarter.",
        "date": "10312017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 3-WestJet to weigh possible joint venture with U.S. carrier -CEO "
    },
    {
        "content": "No. 1 U.S. airline American Airlines Group Inc  reported a better-than-expected quarterly profit on Thursday on higher demand for business and leisure travel  but shares fell nearly 5 percent on factors including higher operating expenses.",
        "date": "10262017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines third-quarter profit beats Street  shares fall "
    },
    {
        "content": "Oct 26 No. 1 U.S. airline American Airlines Group Inc reported a better-than-expected quarterly profit on Thursday on higher demand for business and leisure travel  but shares fell nearly 5 percent on factors including higher operating expenses.",
        "date": "10262017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 4-American Airlines 3rd-qtr profit beats Street  shares fall "
    },
    {
        "content": "NEW YORK  Oct 26 American Airlines Chief Executive Doug Parker said on Thursday that a move by the leading U.S. black civil rights group to warn black travelers off the airline was \"obviously a disappointment.\"",
        "date": "10262017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines CEO disappointed by black rights group's warning "
    },
    {
        "content": "* Q3 earnings per share view $1.40 -- Thomson Reuters I/B/E/S",
        "date": "10262017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group reports third-quarter profit "
    },
    {
        "content": "* American Airlines Group Inc - expects Q4 total revenue per available seat mile (TRASM) to be up approximately 2.5 to 4.5 percent year-over-year‍​",
        "date": "10262017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American airlines expects Q4 TRASM to be up about 2.5 to 4.5 pct "
    },
    {
        "content": "Oct 26 American Airlines Group Inc's profit fell 15.3 percent in the third quarter  hurt partly by disruptions arising from hurricanes.",
        "date": "10262017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines' profit dips 15 pct in 3rd quarter "
    },
    {
        "content": "* American Airlines Group Inc says ‍continues to expect that Q4 trasm growth versus. 2016 will exceed Q3 growth​ - SEC filing",
        "date": "10102017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines expects Q3 TRASM to be up about 0.5 to 1.5 pct vs 2016​ - SEC filing "
    },
    {
        "content": "* American Airlines - ‍ entered into amended  restated note purchase agreement to provide for future issuance by American of Series B equipment notes",
        "date": "10062017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines - ‍Entered into amended note purchase agreement "
    },
    {
        "content": "* On October 4  2017  co entered into amended and restated note purchase agreement  amendments to participation agreements - SEC filing",
        "date": "10052017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines amends and restates note purchase agreement "
    },
    {
        "content": "SANTIAGO LATAM Airlines   Latin America's largest carrier  said on Tuesday that Brazil's antitrust authority Cade had approved its joint business agreement (JBA) with American Airlines Group Inc  without restrictions.",
        "date": "10032017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "LATAM Airlines says Brazil watchdog approves deal with American "
    },
    {
        "content": "SANTIAGO  Oct 3 LATAM Airlines  Latin America's largest carrier  said on Tuesday that Brazil's antitrust authority Cade had approved its joint business agreement (JBA) with American Airlines Group Inc without restrictions.",
        "date": "10032017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-LATAM Airlines says Brazil watchdog approves deal with American "
    },
    {
        "content": "SANTIAGO  Oct 3 LATAM Airlines  Latin America's largest carrier  said on Tuesday that Brazil's antitrust authority Cade had approved its joint business agreement (JBA) with American Airlines Group Inc without restrictions.",
        "date": "10032017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "LATAM Airlines says Brazil watchdog approves JBA with American "
    },
    {
        "content": "* American Airlines CEO Doug Parker on CNBC says the infrastructure doesn't exist in Puerto Rico to ramp up operations",
        "date": "09282017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines CEO on CNBC says infrastructure doesn't exist in Puerto Rico to ramp up operations "
    },
    {
        "content": "* Says sees consolidated CASM excluding fuel  special items and impact of future labor contracts of about 2 percent for 2018 - SEC filing‍​",
        "date": "09282017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines provides long-term guidance "
    },
    {
        "content": "EVERETT  Wash.  Sept 25 Qatar Airways Chief Executive Akbar Al Baker said on Monday the carrier plans to expand its fleet  stepping up orders for Boeing Co aircraft and accepting four Airbus aircraft that it had cancelled in July because of delays due to supplier problems.",
        "date": "09252017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-Qatar Airways chief wants to expand fleet  look for U.S. investments "
    },
    {
        "content": "EVERETT  Wash.  Sept 25 Qatar Airways Chief Executive Akbar Al Baker said on Monday that the carrier plans to expand its fleet  buying four Boeing Co 777-300 aircraft for its passenger fleet and accepting four Airbus A350 aircraft that it had rejected in July.",
        "date": "09252017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Qatar Airways chief wants to expand fleet  look for U.S. investments "
    },
    {
        "content": "* American Airlines Group Inc - on Sept 20  American Airlines Group announced pricing of offering of $193.4 million class B trust certificates - SEC filing​ Source text: [http://bit.ly/2ygHE3c] Further company coverage:",
        "date": "09212017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group announced pricing of offering of $193.4 mln class B trust certificates "
    },
    {
        "content": "BRASILIA Brazil's government has approved a plan by American Airlines Group Inc  to build a maintenance center at Sao Paulo's Guarulhos airport  a $100 million investment that will help the U.S. carrier consolidate its South American operations.",
        "date": "09152017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "Brazil approves $100 million American Airlines maintenance center "
    },
    {
        "content": "* American Airlines Group reports record August traffic results",
        "date": "09122017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group reports record Aug traffic results "
    },
    {
        "content": "WASHINGTON American Airlines Group Inc will not resume commercial flights at its Miami International Airport hub on Monday but may operate flights to bring in staff and supplies.",
        "date": "09112017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American won't resume Miami service until Tuesday at earliest "
    },
    {
        "content": "WASHINGTON  Sept 10 American Airlines Group Inc will not resume commercial flights at its Miami International Airport hub on Monday but may operate flights to bring in staff and supplies.",
        "date": "09112017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-American won't resume Miami service until Tuesday at earliest "
    },
    {
        "content": "* American Airlines names Neisha Strambler-Butler vice president – benefits Source text for Eikon: Further company coverage:",
        "date": "09072017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines names Neisha Strambler-Butler vice president – benefits "
    },
    {
        "content": "* American Airlines - Co and American Airlines Group Inc entered into a second amendment to credit and guaranty agreement",
        "date": "08212017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines and American Airlines Group Inc enters into amendment to credit and guaranty agreement dated as of April 29  2016 "
    },
    {
        "content": "* Soros Fund Management LLC dissolves share stake in Alphabet Inc class A shares   ‍​",
        "date": "08142017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-Soros Fund Management LLC dissolves share stake in Alphabet  Amgen  American Airlines ‍​ "
    },
    {
        "content": "* New summer service to Budapest  Prague from Philadelphia  additional service to Venice from Chicago  starting May 4  2018​ Source text for Eikon: Further company coverage:",
        "date": "08162017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines announces new flights to Europe "
    },
    {
        "content": "* Omega Advisors Inc takes share stake in American Airlines Group Inc of 178 400 shares - SEC filing",
        "date": "08142017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-Omega Advisors takes share stake in American Airlines  cuts share stake in Hess Corp "
    },
    {
        "content": "* American Airlines Group reports record July traffic results",
        "date": "08092017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group reports record July traffic results "
    },
    {
        "content": "NEW YORK  Aug 2 Qatar Airways will not proceed with its proposed financial investment in American Airlines   reversing an earlier decision to build a stake of up to 4.75 percent in the U.S. carrier  the state-owned airline said in a statement.",
        "date": "08022017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Qatar Airways reverses decision to buy into American Airlines "
    },
    {
        "content": "NEW YORK  Aug 2 Qatar Airways will not proceed with its proposed financial investment in American Airlines Group Inc  reversing an earlier decision to build a stake of up to 4.75 percent in the U.S. carrier.",
        "date": "08022017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 2-Qatar Airways reverses decision to buy into American Airlines "
    },
    {
        "content": "NEW YORK U.S. airlines striving to boost profitability are up against an army of penny-pinching customers who would rather sit in a dreaded middle seat than pay more to fly  says a Reuters/Ipsos opinion poll released on Wednesday.",
        "date": "08022017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Perks? No! U.S. flyers prefer the cheap seats: Reuters/Ipsos poll "
    },
    {
        "content": "American Airlines Group Inc  on Friday reported quarterly revenue and adjusted profit that beat analyst projections  helped by strong passenger demand and improving average fares.",
        "date": "07282017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines revenue  adjusted profit beats forecasts "
    },
    {
        "content": "July 28 American Airlines Group Inc on Friday reported quarterly revenue and adjusted profit that beat analyst projections  helped by strong passenger demand and improving average fares.",
        "date": "07282017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 2-American Airlines revenue  adjusted profit beats forecasts "
    },
    {
        "content": "* Q2 earnings per share view $1.87 -- Thomson Reuters I/B/E/S",
        "date": "07282017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group reports Q2 adjusted earnings of $1.92/shr "
    },
    {
        "content": "July 28 American Airlines Group Inc reported a 7.2 percent rise in quarterly revenue  helped by strong passenger demand and improving average fares.",
        "date": "07282017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines revenue rises 7.2 pct "
    },
    {
        "content": "Airline shares tumbled on Thursday as investors were discouraged by quarterly results and forecasts from Spirit Airlines Inc  and an \"uninspiring\" third-quarter outlook by rival Southwest Airlines Co .",
        "date": "07272017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "Airline shares tumble on Southwest  Spirit Air results "
    },
    {
        "content": "WASHINGTON  July 21 The U.S. Transportation Department said on Friday has fined Frontier Airlines  American Airlines and Delta Air Lines for violating the department’s airline consumer protection rules.",
        "date": "07212017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "U.S. fines American Airlines  Delta  Frontier for violating consumer protection rules "
    },
    {
        "content": "DOHA  July 13 Qatar Airways Chief Executive said on Thursday the airline still planned to buy a stake in American Airlines despite the U.S. carrier ending a code-share agreement between the two companies.",
        "date": "07132017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Qatar Airways to go ahead with American Airlines stake buy despite codeshare ending "
    },
    {
        "content": "* American Airlines says has been notified by the Federal Trade Commission that Qatar Airways has withdrawn its previously filed notification - SEC Filing",
        "date": "07122017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines says has been notified by the Federal Trade Commission that Qatar Airways has withdrawn its previously filed notification - SEC Filing "
    },
    {
        "content": "U.S. airline stocks rose on Wednesday after American Airlines Group Inc  became the latest carrier to raise its estimate for per seat revenue over the past week. | Video ",
        "date": "07122017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines' upbeat forecast lifts airline stocks "
    },
    {
        "content": "American Airlines and investment manager American Beacon Advisors have agreed to pay $22 million to resolve a proposed class action accusing them of improperly profiting from the airline's employee plan at the expense of workers.",
        "date": "07102017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines  fund company settle 401(k) lawsuit for $22 mln "
    },
    {
        "content": "July 12 U.S. airline stocks rose on Wednesday after American Airlines Group Inc became the latest carrier to raise its estimate for per seat revenue over the past week.",
        "date": "07122017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 3-American Airlines' upbeat forecast lifts airline stocks "
    },
    {
        "content": "July 12 American Airlines Group Inc on Wednesday raised its forecast for a closely watched performance metric for the second quarter ending June  citing higher average fares.",
        "date": "07122017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines raises forecast for key revenue metric "
    },
    {
        "content": "DUBLIN Qatar Airways is to press on with plans to build a stake of up to 4.75 percent in American Airlines  in the near future  despite the \"categorical\" opposition of the U.S. company's management  Qatar Chief Executive Akbar al-Baker said on Thursday.",
        "date": "07062017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "Qatar Airways set to start buying shares in American Airlines "
    },
    {
        "content": "* Says hopes American will change stance (Adds quotes from Qatar Airways CEO; details of planned share purchases)",
        "date": "07062017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-Qatar Airways set to start buying shares in American Airlines "
    },
    {
        "content": "DUBLIN  July 6 Qatar Airways Chief Executive Akbar al-Baker said on Thursday the Doha-based carrier would soon start buying shares in American Airlines \"depending on the share price.\"",
        "date": "07062017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Qatar Airways aims to start buying American Airlines shares \"soon\" "
    },
    {
        "content": "* American Airlines - co  Analogic Corp have announced joint partnership that will expand use of computed tomography technology at airports worldwide",
        "date": "06272017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines  Analogic announce joint partnership "
    },
    {
        "content": "HONG KONG  June 26 China Southern Airlines said on Monday it will raise up to 12.7 billion yuan ($1.9 billion) in a private sale of new shares to fund the purchase of aeroplanes and replenish working capital.",
        "date": "06262017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "China Southern Air to raise up to $1.9 bln in share issue for aircraft purchase  capital boost "
    },
    {
        "content": "American Airlines' chief executive said on Thursday he is not \"particularly excited\" about Qatar Airways' interest in buying up to 10 percent of the U.S. carrier's shares  in a letter to employees following the state-owned Gulf airline's overture. | Video ",
        "date": "06222017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines pushes back on Qatar Airways plan to buy stake "
    },
    {
        "content": "* Qatar Airways interested in buying 10 pct of American Airlines",
        "date": "06222017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 5-American Airlines pushes back on Qatar Airways plan to buy stake "
    },
    {
        "content": "DOHA  June 22 Qatar Airways said on Thursday it intends to buy a stake of up to 4.75 percent in American Airlines and that it hoped to build a passive shareholding in the U.S. airline.",
        "date": "06222017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Qatar Airways to buy 4.75 percent stake in American Airlines "
    },
    {
        "content": "June 22 American Airlines Group Inc said on Thursday Qatar Airways had expressed interest in buying a 10 percent stake in the U.S. airline.",
        "date": "06222017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines says Qatar Airways interested in buying 10 pct stake "
    },
    {
        "content": "WASHINGTON  June 13 In a move likely to relieve taller air travelers  American Airlines Group Inc will reduce leg room by one inch instead of two as originally planned on some seats in its Boeing 737 MAX jets.",
        "date": "06132017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Tall people be relieved! American Air to cut leg room by one inch  not two "
    },
    {
        "content": "* American Airlines Group Inc - company continues to expect its q2 pre-tax margin excluding special items(1) to be between 12 percent and 14 percent.",
        "date": "06092017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group reports May traffic results "
    },
    {
        "content": "WASHINGTON  June 5 An American Airlines Group Inc regional jet made an emergency landing in Norfolk  Virginia  on Monday because of a cracked windshield  and no injuries were reported  an airport executive said.",
        "date": "06052017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines jet makes emergency landing in Virginia "
    },
    {
        "content": "* American Airlines names Nathan J. Gatten senior vice president – government affairs Source text for Eikon: Further company coverage:",
        "date": "05242017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines names Nathan Gatten senior vice president "
    },
    {
        "content": "* Berkshire Hathaway Inc ups share stake in American Airlines Group by 8.2 percent to 49.3 million shares",
        "date": "05152017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-Berkshire Hathaway ups share stake in American Airlines  Southwest Airlines "
    },
    {
        "content": "* American Airlines promotes Patrick O’Keeffe  to senior vice president – people Source text for Eikon: Further company coverage:",
        "date": "05152017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines promotes Patrick O’Keeffe  to senior VP  People "
    },
    {
        "content": "SANTIAGO  May 10 LATAM Airlines will increase seats on flights between Chile and North America and Europe  and add a new route to North America  it said on Wednesday  as it seeks to win regulatory approval for a deal with IAG's British Airways and Iberia and American Airlines Group.",
        "date": "05102017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "LATAM Airlines moves to ease Chile regulator fears on IAG deal "
    },
    {
        "content": "Spirit Airlines Inc  passengers brawled in a Florida airport late on Monday after the budget carrier  which is in dispute with its pilots  canceled several flights. | Video ",
        "date": "05102017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Fights erupt at Florida airport after Spirit flights canceled "
    },
    {
        "content": "* American Airlines Group reports  record April traffic results",
        "date": "05092017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group reports April total RPMs up 3.1 pct to 18.6 bln "
    },
    {
        "content": "OMAHA  Neb.  May 6 Warren Buffett  the chairman of Berkshire Hathaway Inc  on Saturday faulted Wells Fargo & Co for failing to stop employees from signing up customers for bogus accounts even after learning it was happening  causing a scandal.",
        "date": "05062017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-Buffett assails Wells Fargo  defends 3G at wide-ranging meeting "
    },
    {
        "content": "* American Airlines Group Inc - CEO W. Douglas Parke's 2016 total compensation was $11.1 million versus $11.4 million in 2015",
        "date": "05012017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group's CEO 2016 total compensation was $11.1 million "
    },
    {
        "content": "* American Airlines-on April 25  at their request  Robert D. Isom  Jr.  Elise Eberwein  Stephen L. Johnson  Derek J. Kerr entered letter agreements with co",
        "date": "05012017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines says executives enter letter agreements "
    },
    {
        "content": "NEW YORK  May 3 American Airlines is shaving off an additional two inches of economy class legroom on some of the seats in its new Boeing Co 737 MAX jets  just as relations between U.S. airlines and their passengers sink to a new low.",
        "date": "05032017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Air cuts two inches of legroom on some seats in new jets "
    },
    {
        "content": "* Says intend to work with unions to adjust hourly base pay rates of all american pilots and flight attendants - sec filing",
        "date": "04262017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group Inc - intend to work with unions to adjust hourly base pay rates of all american pilots and flight attendants - sec filing "
    },
    {
        "content": "NEW YORK Shares of American Airlines Group Inc  dropped more than 8 percent on Thursday after the company said it had offered a mid-contract pay increase for pilots and flight attendants.",
        "date": "04272017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines shares nosedive on proposed employee pay increases "
    },
    {
        "content": "NEW YORK/PARIS  April 27 American Airlines Group Inc said on Thursday it had deferred the delivery of several wide-body Boeing and Airbus jets  in the latest sign of oversupply in the market for long-distance airliners.",
        "date": "04272017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines delays Boeing  Airbus jet deliveries "
    },
    {
        "content": "NEW YORK  April 27 Shares of American Airlines Group Inc dropped more than 8 percent on Thursday after the company said it had offered a mid-contract pay increase for pilots and flight attendants.",
        "date": "04272017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 2-American Airlines shares nosedive on proposed employee pay increases "
    },
    {
        "content": "* American airlines group inc - expects its q2 total revenue per available seat mile (trasm) to be up approximately 3 to 5 percent",
        "date": "04272017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines expects Q2 revenue per available seat mile to be up about 3 to 5 percent "
    },
    {
        "content": "NEW YORK  April 27 American Airlines Group Inc on Thursday announced it was deferring the first delivery of its Airbus A350 XWBs from 2018 to 2020  and had pushed back the delivery of two Boeing 787-9 aircraft from the second quarter of 2018 to the first quarter of 2019.",
        "date": "04272017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines defers delivery of Airbus  Boeing aircraft "
    },
    {
        "content": "NEW YORK The woman who clashed with an American Airlines flight attendant has secured the services of the same attorney representing Dr. David Dao  who was dragged from a United Airlines plane earlier this month.",
        "date": "04242017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "Lawyer representing United passenger takes on American Airlines "
    },
    {
        "content": "NEW YORK American Airlines  on Saturday apologized to a female passenger and suspended an employee after a video showing an onboard clash over a baby stroller went viral  in the latest embarrassment for a U.S. carrier over how it treated a customer.",
        "date": "04232017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines apologizes for onboard clash over stroller "
    },
    {
        "content": "NEW YORK  April 24 The woman who clashed with an American Airlines flight attendant has secured the services of the same attorney representing Dr. David Dao  who was dragged from a United Airlines plane earlier this month.",
        "date": "04242017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 2-Lawyer representing United passenger takes on American Airlines "
    },
    {
        "content": "April 11 American Airlines Group Inc on Tuesday raised its quarterly forecast for a key revenue metric  citing higher average fares.",
        "date": "04112017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines raises forecast for key revenue metric "
    },
    {
        "content": "April 11 American Airlines Group Inc on Tuesday raised its quarterly forecast for a key revenue metric  citing higher average fares.",
        "date": "04112017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-American Airlines raises forecast for key revenue metric "
    },
    {
        "content": "* American Airlines Group Inc - expects the value of its net special items (before the impact of taxes) in the first quarter to be about $125 million",
        "date": "04112017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines expects 2017 consolidated CASM excluding fuel and special items to be up about 4 pct "
    },
    {
        "content": "* American Airlines Group Inc - Expects its Q1 2017 total revenue per available seat mile (TRASM) to be up about 2 percent to 4 percent year-over-year",
        "date": "04112017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group reports March traffic results "
    },
    {
        "content": "SHANGHAI  March 26 China Southern Airlines  is negotiating a potential strategic tie-up with American Airlines that could involve a share issue and other forms of business cooperation  it said on Sunday.",
        "date": "03262017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "China Southern Airlines in talks over American Airlines cooperation deal "
    },
    {
        "content": "SHANGHAI China Southern Airlines is in talks over a tie-up with American Airlines that could involve the U.S. carrier taking a stake in the state-owned airline  boosting routes between the world's two largest travel markets.",
        "date": "03272017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "China Southern in talks over American Airlines tie-up "
    },
    {
        "content": "MILAN  March 27 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "03272017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "European shares seen lower after Trump healthcare defeat- For more see the LiveMarkets blog "
    },
    {
        "content": "HONG KONG/SHANGHAI China Southern Airlines Co Ltd  said on Tuesday it will sell a small stake to American Airlines Group Inc  in a $200 million deal that will give the carriers better access to the world's two largest travel markets.",
        "date": "03282017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "All aboard: American Airlines takes $200 million stake in China Southern "
    },
    {
        "content": "* Talks involve American Airlines taking stake in China Southern",
        "date": "03272017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-China Southern in talks over American Airlines tie-up "
    },
    {
        "content": "* Deal means China's big 3 airlines have foreign stakeholders",
        "date": "03282017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 3-All aboard: American Airlines takes $200 mln stake in China Southern "
    },
    {
        "content": "SHANGHAI  March 28 China Southern Airlines Co Ltd's Hong Kong-listed shares jumped by more than 2.5 pct in opening trade after the company said it would sell a stake to a subsidiary of American Airlines",
        "date": "03282017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "China Southern Airlines' shares jump after American Airlines buy-in "
    },
    {
        "content": "CAIRO  March 20 Egypt's new stamp duty on stock exchange transactions will come into effect in May and include for the first time a 0.3 percent levy for investors acquiring more than a third of a company's stocks  deputy finance minister Amr al-Munayer said.",
        "date": "03202017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "UPDATE 1-Egypt to introduce stamp duty in May  targets 1-1.5 bln pounds in revenues "
    },
    {
        "content": "HONG KONG  March 28 China Southern Airlines Co Ltd said on Tuesday it would issue HK$1.55 billion ($199.6 million) worth of shares to a wholly-owned subsidiary of American Airlines Group Inc.  raising funds for general working capital.",
        "date": "03282017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "China Southern Airlines says to sell $200 mln shares to American Airlines "
    },
    {
        "content": "* American Airlines Group reports february traffic and record operational performance",
        "date": "03092017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines reports february traffic "
    },
    {
        "content": "PARIS  March 10 IranAir has taken delivery of its second Western jet under a nuclear sanctions deal with major powers: an Airbus A330 long-haul aircraft  the European planemaker said on Friday.",
        "date": "03102017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "IranAir receives second jet under sanctions deal "
    },
    {
        "content": "NEW YORK  Feb 27 Billionaire investor Warren Buffett told CNBC on Monday his conglomerate Berkshire Hathaway Inc had more than doubled its stake in Apple Inc.  since the end of 2016  making it one of Berkshire's biggest equity holdings  and that U.S. stocks overall were not in \"bubble territory.\"",
        "date": "03062017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "RPT-UPDATE 5-Buffett's Berkshire more than doubled its stake in Apple -CNBC "
    },
    {
        "content": "NEW YORK  Feb 27 Warren Buffett  chairman and chief executive of Berkshire Hathaway Inc  told CNBC on Monday that his conglomerate had purchased \"70 million plus\" shares of Apple Inc in 2017 and that U.S. stocks were not in \"bubble territory.\"",
        "date": "03062017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "CORRECTED-(OFFICIAL)-Buffett says Berkshire owns 133 mln shares of Apple -CNBC "
    },
    {
        "content": "* American Airlines Group Inc - files for potential mixed shelf; size undisclosed - SEC filing  Source text for Eikon: (http://bit.ly/2l9Nhdv) Further company coverage:",
        "date": "02222017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group Inc says files for potential mixed shelf size undisclosed - SEC filing "
    },
    {
        "content": "NEW YORK  Feb 14 Pilots at American Airlines Group Inc denounced the carrier's chief executive officer  Doug Parker  on Tuesday  citing his decision last week to skip a meeting with U.S. President Donald Trump.",
        "date": "02152017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American pilots denounce CEO  citing missed White House meeting "
    },
    {
        "content": "* Appaloosa LP takes share stake of 1.3 million shares in American Airlines Group Inc",
        "date": "02142017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-Appaloosa LP takes share stake in American Airlines  Comerica "
    },
    {
        "content": "NEW YORK  Feb 14 Warren Buffett's Berkshire Hathaway Inc was an aggressive buyer of stocks in last year's fourth quarter  nearly quadrupling its stake in Apple Inc  and increasing its stake sevenfold in the four biggest U.S. airlines.",
        "date": "02152017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 2-Berkshire takes huge bite of Apple  boosts airline stakes "
    },
    {
        "content": "* Berkshire Hathaway Inc dissolves share stake in Deere & Co - SEC filing",
        "date": "02142017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-Berkshire Hathaway ups share stake in United Continental Holdings  American Airlines "
    },
    {
        "content": "* American Airlines' pilot union leaders approved a no-confidence vote against CEO Doug Parker and his management team - Bloomberg  Source text for Eikon: [http://bloom.bg/2lcIWJZ] Further company coverage:",
        "date": "02142017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines' pilot union leaders approve no-confidence vote - Bloomberg "
    },
    {
        "content": "* On Jan 25  board of directors of American Airlines Group Inc adopted an amendment and restatement of company's bylaws",
        "date": "01302017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group adopts an amendment and restatement of company's bylaws "
    },
    {
        "content": "BEIJING/SYDNEY American Airlines Group Inc  and Australia's Qantas Airways Ltd  may reapply to the U.S. Transportation Department for permission to coordinate prices and flight schedules now the Trump administration is in charge  Qantas Chief Executive Alan Joyce said.",
        "date": "01272017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines  Qantas may revive joint venture plan under Trump "
    },
    {
        "content": "BEIJING/SYDNEY  Jan 27 American Airlines Group Inc and Australia's Qantas Airways Ltd may reapply to the U.S. Transportation Department for permission to coordinate prices and flight schedules now the Trump administration is in charge  Qantas Chief Executive Alan Joyce said.",
        "date": "01272017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-American Airlines  Qantas may revive joint venture plan under Trump "
    },
    {
        "content": "American Airlines Group Inc  shares plunged on Friday after the company's release of its fourth-quarter and full-year 2016 results  as mounting costs and growing wage pressures spooked investors.",
        "date": "01272017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines stock plunges on rising labor costs "
    },
    {
        "content": "Jan 27 American Airlines Group Inc  shares plunged on Friday after the company's release of its fourth-quarter and full-year 2016 results  as mounting costs and growing wage pressures spooked investors.",
        "date": "01272017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-American Airlines stock plunges on rising labor costs "
    },
    {
        "content": "* American Airlines Group reports fourth quarter and full year profit",
        "date": "01272017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group Q4 adjusted earnings per share $1.48 "
    },
    {
        "content": "Jan 27 American Airlines Group Inc  the No. 1 U.S. airline by passenger traffic  reported a fall in profit from a year earlier  when it recorded a $3 billion tax benefit.",
        "date": "01272017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines profit plunges "
    },
    {
        "content": "BEIJING/SYDNEY  Jan 27 American Airlines Group Inc and Australia's Qantas Airways Ltd may reapply to the U.S. Transportation Department for permission to coordinate prices and flight schedules now the Trump administration is in charge  Qantas Chief Executive Alan Joyce said.",
        "date": "01272017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines  Qantas may revive JV plan under Trump "
    },
    {
        "content": "* American Airlines Group Inc - Announced it will begin selling basic economy fares in addition to wide range of main cabin fares currently offered",
        "date": "01182017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines to begin selling Basic Economy fares "
    },
    {
        "content": "Jan 11 American Airlines Group Inc  operator of the No. 1 U.S. airline by passenger traffic  raised its estimates for a key industry revenue measure and its pretax margin for the fourth  quarter  citing improving average fares.",
        "date": "01112017",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "UPDATE 1-American Airlines raises unit revenue estimate "
    },
    {
        "content": "* American Airlines Group Inc - Mainline CASM excluding fuel and special items is expected to be up approximately 5 to 7 percent in 2016",
        "date": "01112017",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines says 2016 total system capacity was up 1.7 pct vs 2015 "
    },
    {
        "content": "NEW YORK American Airlines Group Inc  on Tuesday won about $15.3 million in an antitrust lawsuit that accused airline booking service Sabre Corp  of harming competition and charging grossly inflated booking fees.",
        "date": "12202016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines wins $15 million in antitrust case against Sabre "
    },
    {
        "content": "WASHINGTON American Airlines  will pay a record-matching $1.6 million fine for violating a rule that prohibits long tarmac delays  the U.S. Transportation Department said on Wednesday.",
        "date": "12142016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "U.S. fines American Airlines $1.6 million for violating tarmac delay rule "
    },
    {
        "content": "NEW YORK American Airlines Group Inc  will cut nearly 25 percent of its flights to Cuba in 2017  a company spokesman said on Thursday  attributing the move to travel demand rather than the election of Republican Donald Trump as U.S. president.",
        "date": "12022016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines to trim Cuba flight schedules "
    },
    {
        "content": "Nov 28 American Airlines Group Inc and Australia's Qantas Airways Ltd have dropped their bid to coordinate prices and flight schedules  according to a filing submitted to the U.S. Transportation Department on Monday.",
        "date": "11282016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines  Qantas end bid to grow partnership "
    },
    {
        "content": "SANTIAGO Chile's FNE competition regulator said a joint-business agreement that Santiago-headquartered LATAM Airlines inked with American Airlines Group Inc and IAG's British Airways and Iberia risks increasing fares and lowering quality on routes.",
        "date": "11232016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "LATAM Airlines deal with IAG  American threat to competition: Chile regulator "
    },
    {
        "content": "SANTIAGO  Nov 22 Chile's FNE competition regulator said a joint-business agreement that Santiago-headquartered LATAM Airlines inked with American Airlines Group Inc and IAG's British Airways and Iberia risks increasing fares and lowering quality on routes.",
        "date": "11232016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "LATAM Airlines deal with IAG  American threat to competition- Chile regulator "
    },
    {
        "content": "NEW YORK Warren Buffett's Berkshire Hathaway Inc on Monday said it has bought shares in the four biggest U.S. airlines: American Airlines Group Inc  Delta Air Lines Inc  Southwest Airlines Co and United Continental Holdings Inc.",
        "date": "11152016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Warren Buffett's Berkshire makes surprise U.S. airline bet "
    },
    {
        "content": "WASHINGTON Plans by American Airlines Group Inc  and Qantas Airways Ltd  to expand their alliance for flights between the United States and Australasia were tentatively denied by the U.S. Transportation on Friday  the agency said  citing competition concerns.",
        "date": "11182016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "U.S. tentatively blocks American Airlines-Qantas expansion "
    },
    {
        "content": "WASHINGTON  Nov 18 Plans by American Airlines Group Inc and Qantas Airways Ltd to expand their alliance for flights between the United States and Australasia were tentatively denied by the U.S. Transportation on Friday  the agency said  citing competition concerns.",
        "date": "11182016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-U.S. tentatively blocks American Airlines-Qantas expansion "
    },
    {
        "content": "* Berkshire Hathaway takes share stake of 21.8 million shares in American Airlines - SEC filing",
        "date": "11142016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-Berkshire Hathaway takes share stake in American Airlines  cuts in Kinder Morgan - SEC filing "
    },
    {
        "content": "Nov 14 Warren Buffett's Berkshire Hathaway Inc  on Monday said it has bought shares in the four biggest U.S. airlines: American Airlines Group Inc  Delta Air Lines Inc  Southwest Airlines Co and United Continental Holdings Inc.",
        "date": "11142016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Buffett's Berkshire makes bet on U.S. airlines "
    },
    {
        "content": "MEXICO CITY  Nov 14 Conglomerate Grupo Synergy plans to invest up to $100 million in Mexican airline Aeromar to acquire a 49 percent stake  Synergy Chairman German Efromovich said on Monday.",
        "date": "11142016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Grupo Synergy to buy 49 pct stake in Mexico's Aeromar "
    },
    {
        "content": "American Airlines Group Inc and Alaska Air Group Inc said on Friday an outage related to a technical issue at reservation services provider Sabre Corp's computer systems has been resolved.",
        "date": "11112016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "U.S. airlines say outage linked to tech glitch at Sabre resolved "
    },
    {
        "content": "Nov 11 American Airlines Group Inc and Alaska Air Group Inc said on Friday an outage related to a technical issue at reservation services provider Sabre Corp's  computer systems has been resolved.",
        "date": "11112016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-U.S. airlines say outage linked to tech glitch at Sabre resolved "
    },
    {
        "content": "* Transport Workers Union -  members approved a new five-year contract  which goes into effect on Nov. 21",
        "date": "11102016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-Transport Workers Union members approved a new five-year contract "
    },
    {
        "content": "WASHINGTON  Nov 7 The U.S. Transportation Department on Monday said it was proposing to award American Airlines Group Inc a new daily scheduled nonstop flight between Los Angeles and Beijing.",
        "date": "11072016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "U.S. proposes awarding new direct China flight to American Airlines "
    },
    {
        "content": "Nov 11 American Airlines Group Inc and Alaska Air Group Inc on Friday experienced a brief computer outage caused due to a technical issue at reservation vendor Sabre Corp.",
        "date": "11112016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "U.S. airlines face brief computer outage "
    },
    {
        "content": "* American Airlines says earlier today  Sabre had brief technical issue that impacted multiple carriers  issue has been resolved- Spokesman  Further company coverage:",
        "date": "11112016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines says Sabre technical issue that impacted multiple carriershas been resolved "
    },
    {
        "content": "SAO PAULO Brazil's competition regulator Cade said on Monday that a deal between LATAM Airlines   British Airways and Iberia  could have a negative impact on routes between Brazil and Europe.",
        "date": "11072016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Brazil says LATAM  IAG airline deal could pose competition problems "
    },
    {
        "content": "WASHINGTON/SEATTLE A fire on an American Airlines passenger plane as it was taking off from Chicago's O'Hare International Airport last week was sparked when the right engine broke apart  the U.S. National Transportation Safety Board said on Friday.    The investigative update shed new light on a rare \"uncontained\" engine failure  in which pieces escaped the engine housing  that has been the talk of aviation circles since the incident on Oct. 28.",
        "date": "11042016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "U.S. blames American Airlines fire on engine failure "
    },
    {
        "content": "WASHINGTON/SEATTLE  Nov 4 A fire on an American Airlines passenger plane as it was taking off from Chicago's O'Hare International Airport last week was sparked when the right engine broke apart  the U.S. National Transportation Safety Board said on Friday.",
        "date": "11042016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 2-U.S. blames American Airlines fire on engine failure "
    },
    {
        "content": "* American Airlines flight 569 diverted to denver on flight from L.A. to Toronto; reported mechanical issues  landed safely - Denver Intl. airport spokeswoman   Further company coverage:",
        "date": "10302016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines flight 569 diverted to Denver - Denver International airport spokeswoman "
    },
    {
        "content": "* American Airlines Group Inc - co  American Airlines Inc entered into a first amendment to credit and guaranty agreement - sec filing",
        "date": "11012016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group Inc & American Airlines Inc entered into a first amendment to credit and guaranty agreement "
    },
    {
        "content": "Nov 5 General Electric Co is seeking to remove an engine part from service after an American Airlines jet erupted in flames last week  it told air carriers in a letter seen by Reuters on Saturday.",
        "date": "11052016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "GE alerts airlines about engine part after American Airlines fire "
    },
    {
        "content": "CHICAGO  Oct 28 The engine of an American Airlines jet caught fire as the aircraft was about to depart Chicago's O'Hare International Airport on Friday  prompting the crew to abort takeoff and evacuate passengers via emergency chutes  authorities said.",
        "date": "10292016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "CORRECTED-UPDATE 5-American Airlines jet catches fire on takeoff at Chicago airport "
    },
    {
        "content": "* Fiji Airways & American Airlines strengthen codeshare agreement",
        "date": "10252016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-Fiji Airways Co & American Airlines strengthen codeshare agreement "
    },
    {
        "content": "* Transport Workers Union And International Association Of Machinists members approved new five-year contract",
        "date": "10242016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines flight simulator engineers approve five-year contract "
    },
    {
        "content": "DALLAS -- After an 0-3 start  the Los Angeles Kings hit the ice at American Airlines Center Thursday night with a sense of urgency. And thanks to Alec Martinez scoring the game-winner 1:20 into overtime  the Kings left town with a 4-3 victory against the Dallas Stars.",
        "date": "10212016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "Martinez scores in OT as Kings top Stars for 1st win "
    },
    {
        "content": "American Airlines Group Inc  shares dipped on Thursday after the carrier said cheap airfares and higher wages will squeeze profits in the current quarter.",
        "date": "10202016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines profit margin forecast disappoints "
    },
    {
        "content": "DALLAS -- The Stars' potent offensive tandem of Jamie Benn and Tyler Seguin accounted for only one point  but Adam Cracknell and Antti Niemi stepped up in Dallas' 4-2 victory over the Anaheim Ducks on Thursday in the season opener at American Airlines Center.",
        "date": "10142016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "Cracknell  Niemi lift Stars past Ducks in opener "
    },
    {
        "content": "Oct 20 American Airlines Group Inc  shares dipped on Thursday after the carrier said cheap airfares and higher wages will squeeze profits in the current quarter.",
        "date": "10202016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 3-American Airlines profit margin forecast disappoints "
    },
    {
        "content": "* Q3 revenue $10.6 billion versus I/B/E/S view $10.54 billion",
        "date": "10202016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group Q3 GAAP earnings per share $1.40 "
    },
    {
        "content": "Oct 20 American Airlines Group Inc  reported a 1.1 percent drop in quarterly revenue as a crowded market hurt ticket sales.",
        "date": "10202016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines revenue falls 1.1 pct "
    },
    {
        "content": "* American Airlines Group Inc - expects  value of net special items (before the impact of taxes) in Q3 to be approximately $300 million - SEC filing",
        "date": "10112016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines expects value of net special items in Q3 to be approximately $300 mln "
    },
    {
        "content": "* September passenger load factor 81.6 percent  down 1.1 points",
        "date": "10112016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group reports September traffic "
    },
    {
        "content": "* On Oct 3  American Airlines entered note purchase agreement that provides for future issuance of equipment notes of $813.8 million  Source: (http://bit.ly/2dHGjcl) Further company coverage:",
        "date": "10042016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American airlines enters purchase agreement on future issuance of equipment notes "
    },
    {
        "content": "* On Sept 22  Co  American Airlines Group entered into second amendment to credit and guaranty agreement dated as of April 20  2015",
        "date": "09222016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines entered amendment to credit and guaranty agreement on Sept 22 - SEC Filing "
    },
    {
        "content": "* August total capacity was 24.7 billion available seat miles (asms)  up 1.4 percent versus August 2015",
        "date": "09122016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group reports August traffic "
    },
    {
        "content": "* American Airlines and transport workers union reach tentative agreement for flight sim engineers  Source text for Eikon:  Further company coverage:",
        "date": "09102016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines  transport workers union reach agreement for flight sim engineers "
    },
    {
        "content": "* American Airlines announces new flights from Dallas Fort Worth International Airport to Rome and Amsterdam  Source text for Eikon:  Further company coverage:",
        "date": "09082016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines announces new flights from Dallas to Rome and Amsterdam "
    },
    {
        "content": "Aug 29 United Continental Holdings Inc  said it has named Scott Kirby  a veteran of American Airlines Group Inc  as the president of United Airlines.",
        "date": "08292016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "United Airlines names American Airlines veteran Scott Kirby as president "
    },
    {
        "content": "Aug 29 United Continental Holdings Inc  has hired the No. 2 executive at rival American Airlines Group Inc  Scott Kirby  to be its president  the companies said on Monday.",
        "date": "08302016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "UPDATE 2-United Airlines hires No. 2 at American to be its president "
    },
    {
        "content": "* As president  Isom will continue to oversee Airline's operation and assume all revenue responsibilities for Airline",
        "date": "08292016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group names Robert Isom as president "
    },
    {
        "content": "* July total passenger load factor was 85.2 percent  down 2.1 percentage points versus july 2015",
        "date": "08092016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines group reports July traffic "
    },
    {
        "content": "* To consolidate three pilot training centers into two by end of 2017 to standardize instruction - employee letter",
        "date": "08042016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines to consolidate pilot training centers "
    },
    {
        "content": "Aug 5 American Airlines Group Inc said it had reached an interim agreement with a labor union to raise wages for about 30 000 of its ground staff  effectively immediately.",
        "date": "08052016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines reaches interim deal to hike ground staff wages "
    },
    {
        "content": "Aug 5 American Airlines Group Inc said it had reached an interim agreement with a labor union to raise wages for about 30 000 of its ground staff  effective immediately.",
        "date": "08052016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-American Airlines reaches interim deal to hike ground staff wages "
    },
    {
        "content": "* Estimate new pay rates will increase pre-tax operating costs by about $75 million in Q3 2016 and $120 million in Q4 - SEC filing  Source text - http://bit.ly/2aAcwmn Further company coverage:",
        "date": "08052016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines says new pay rates to increase pre-tax operating costs by about $75 mln in Q3 - SEC filing "
    },
    {
        "content": "* TWU-IAM union says reached interim deal with American Airlines to provide about 30 000 ground workers about 22 percent wage hikes  retirement improvements  Source text for Eikon:",
        "date": "08052016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-TWU-IAM reaches interim deal with American Airlines "
    },
    {
        "content": "WASHINGTON  July 20 Four U.S. carriers have won tentative approval to launch daytime U.S. flights to Tokyo's Haneda airport as early as this fall  the U.S. Transportation Department said on Wednesday.",
        "date": "07202016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "UPDATE 1-Four U.S. airlines get OK for daytime flights to Tokyo Haneda "
    },
    {
        "content": "* American Airlines says Q3 mainline capacity to be $64.1 billion  Q4 capacity of $58 billion",
        "date": "07222016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines expects Q3 RASM to be down 3.5-5.5 pct y-o-y - conf call "
    },
    {
        "content": "* Q2 revenue $10.4 billion versus I/B/E/S view $10.32 billion",
        "date": "07222016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group reports Q2 earnings per share $1.68 "
    },
    {
        "content": "July 22 American Airlines Group Inc's  quarterly profit plunged 44 percent  hurt by a big provision for income tax.",
        "date": "07222016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines quarterly profit plunges 44 pct "
    },
    {
        "content": "* Expect consolidated pre-tax income for financial reporting purposes to increase by approximately $200 million in H2 of 2016",
        "date": "07122016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group expects consolidated pre-tax income to increase by about $200 mln in H2  2016 "
    },
    {
        "content": "* American Airlines  Citi  Barclaycard US  and Mastercard announce new credit card agreements",
        "date": "07122016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines  Citi  Barclaycard US  Mastercard announce credit card agreement "
    },
    {
        "content": "* Sees Q3 mainline ASMS 64.1 billion; Sees q4 mainline ASMS 58.0 billion",
        "date": "07132016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines - Expects Q2 mainline ASMS 62.7 bln "
    },
    {
        "content": "* Havana flights will go on sale later this month after DoT issues final decision  with service expected to begin in november",
        "date": "07072016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American airlines says Havana flights will go on sale later this month after DoT's final decision "
    },
    {
        "content": "* American Airlines announces first routes for Boeing 787-9 Dreamliner",
        "date": "07072016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines announces first routes for Boeing 787-9 Dreamliner "
    },
    {
        "content": "WASHINGTON  July 7 The Obama administration on Thursday proposed eight airlines including United Continental Holdings Inc  Delta Air Lines Inc  American Airlines Group Inc (AAL.O> and JetBlue Airlines Corp to start nonstop flights from the United States to Havana  Cuba as early as this fall  administration officials said.",
        "date": "07072016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "U.S. proposes United  Delta  American airlines fly nonstop to Havana "
    },
    {
        "content": " ",
        "date": "07062016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "U.S. RESEARCH ROUNDUP-Netflix  Juniper Networks  American Airlines "
    },
    {
        "content": "* TSA and American Airlines anticipate deployment of automated screening lanes to Chicago (O'Hare)  Dallas/Fort Worth  Los Angeles and Miami",
        "date": "07052016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-TSA  American Airlines jointly testing airport security technology "
    },
    {
        "content": "* New York Transportation Development Corporation issued about $844 million of special facility revenue refunding bonds on behalf of unit  Source text - http://1.usa.gov/1Q9kBis Further company coverage:",
        "date": "06162016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines NYTDC issued $844 mln of special facility revenue "
    },
    {
        "content": "NEW YORK Airlines' efforts to help the U.S. government manage long airport security lines are not sustainable  the chief executive of American Airlines Group Inc said in an interview.",
        "date": "06092016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "Efforts to cut U.S. airport security delays not sustainable: American Airlines CEO "
    },
    {
        "content": "* Continues to expect its Q2 consolidated PRASM to be down approximately 6 to 8 percent",
        "date": "06092016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group reports May traffic "
    },
    {
        "content": "* American Airlines says in 2017 it will require that customers spend minimum dollar amounts on travel  on top of miles or segments flown  to earn elite status",
        "date": "06062016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines to add spending requirement for elite status "
    },
    {
        "content": "* On may 16  entered into a note purchase agreement - SEC filing",
        "date": "05172016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group Inc enters into note purchase agreement "
    },
    {
        "content": "LAS VEGAS  May 12 John Lykouretzos  who runs New York-based hedge fund firm Hoplite Capital Management  said on Thursday that the firm is shorting American Airlines Group Inc  as it is the \"most compelling short in the U.S. airline industry.\"",
        "date": "05122016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Hoplite Capital's Lykouretzos says shorting American Airlines shares "
    },
    {
        "content": "* Continues to expect its Q2 pretax margin excluding special items to be between 14 and 16 percent.",
        "date": "05102016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines posts April total available seat miles 22.42 bln  up 1.3 pct "
    },
    {
        "content": "* Primecap Management Company reports 5.86 pct passive stake in American Airlines Group Inc as of April 30  2016 - Sec Filing  Source text: [http://1.usa.gov/1Okm13t] Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05092016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-Primecap Management Co reports 5.86 pct passive stake in American Airlines Group Inc as of April 30 "
    },
    {
        "content": "(The Sports Xchange) - Robby Fabbri and Paul Stastny each had a goal and an assist and Brian Elliott stopped 27 of 28 shots for the St. Louis Blues in a 4-1 win against the Dallas Stars in Game 5 of their second-round playoff series at American Airlines Center on Saturday afternoon.",
        "date": "05072016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "Stars singing the Blues as St. Louis grabs series lead "
    },
    {
        "content": "* On April 29  American Airlines Inc and American Airlines Group Inc entered into a credit and guaranty agreement",
        "date": "05022016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group says co and American Airlines entered into credit and guaranty agreement on April 29 "
    },
    {
        "content": "DALLAS -- The St. Louis Blues wanted a split in Dallas  and thanks to their captain  David Backes  who scored a power-play goal 10:58 into overtime  the Blues edged the Dallas Stars 4-3 in overtime of Game 2 of the second-round playoff series on Sunday at American Airlines Center.",
        "date": "05022016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Backes scores winner as Blues tie series with Stars "
    },
    {
        "content": "DALLAS -- Radek Faksa definitely likes Game 1 of a playoff series. For the second consecutive series  the Dallas rookie scored the game-winning goal to open the series as the Stars defeated the St. Louis Blues 2-1 in in the second-round series on Friday at American Airlines Center.",
        "date": "04302016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "Faksa helps Stars take Game 1 vs. Blues "
    },
    {
        "content": "* Promotion of Heather Garboden to vice president - financial planning  Source text for Eikon:  Further company coverage:",
        "date": "04282016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines promotes Heather Garboden to vice president of financial planning "
    },
    {
        "content": "American Airlines Group Inc  terminated Chief Executive Douglas Parker's employment agreement on his request but said he would continue to be the chairman and CEO of the company.",
        "date": "04292016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines' CEO contract scrapped but he will stay in role "
    },
    {
        "content": "* Entered into agreement with ceo w. Douglas parker  to provide that his employment agreement is terminated",
        "date": "04292016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group CEO's employment agreement is terminated "
    },
    {
        "content": "* CEO Douglas Parker's 2015 compensation was $11.4 million versus FY 2014 compensation of $12.3 million - SEC filing",
        "date": "04292016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group CEO Parker's 2015 compensation $11.4 mln - SEC filing "
    },
    {
        "content": "* Says cfo derek j. Kerr fy 2015 total compensation $5.2 million versus $5.6 million in fy 2014 - sec filing",
        "date": "04292016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group says CFO's 2015 total compensation $5.2 mln "
    },
    {
        "content": "(The Sports Xchange) - The Oklahoma City Thunder are a step away from the Western Conference semi-finals.",
        "date": "04242016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "Thunder close in on semi-final spot "
    },
    {
        "content": "* Mainline CASM excluding fuel and special items is expected to be up approximately 3 percent to 5 percent in 2016",
        "date": "04222016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group says 2016 total system capacity is expected to be up about 2.5 pct versus. 2015 "
    },
    {
        "content": "* American airlines submits application to u.s. Department of transportation to serve Tokyo's Haneda Airport from Los Angeles and Dallas/Fort Worth  Source text : http://bit.ly/1XLp75U Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04212016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines submits application to US Department of Transportation to Operate Service Between Los Angeles and Beijing "
    },
    {
        "content": "* American airlines group inc says authorized a new $2.0 billion share repurchase program that will expire at end of 2017",
        "date": "04222016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Q1 earnings $1.14/shr "
    },
    {
        "content": "* Moody's affirms Ba3 CFR of American Airlines; Assigns Ba1 rating to new credit facility",
        "date": "04182016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-Moody's affirms Ba3 CFR of American Airlines; Assigns Ba1 rating to new credit facility "
    },
    {
        "content": "* Expects its Q1 2016 consolidated passenger revenue per available seat mile to be down about 7 to 8 percent year-over-year",
        "date": "04112016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines Group March passenger load factor 81.7 pct  down 0.4 points "
    },
    {
        "content": "* American airlines submits application to u.s. Department of transportation to operate service between los angeles and beijing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "03282016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines submits application to operate service between LA  Beijing "
    },
    {
        "content": "April 1 EHarmony on Friday launched a recruitment portal  but the online matchmaker's long-promised service will begin to generate revenue only late this year  a company executive told Reuters.",
        "date": "04012016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Dating site eHarmony sees rev from new job portal late this year "
    },
    {
        "content": "* To accelerate hourly pay rate for flight attendants  and to increase current pay scales by 6 percent  effective April 1 - memo  Further company coverage:",
        "date": "03232016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines to increase hourly pay rate for flight attendants - memo "
    },
    {
        "content": "* says its brussels airport check-in operates at row 8 of the departure hall  and the explosions did not occur at row 8   Further company coverage:",
        "date": "03222016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines says explosions at Brussels airport not near its check-in desk "
    },
    {
        "content": "* American Airlines establishing a profit sharing program effective with our 2016 annual earnings - memo to employees",
        "date": "03232016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines establishes profit sharing program effective 2016 earnings - memo "
    },
    {
        "content": "* \u007fAnnounces that it has reached agreement with American Airlines for extension of important catering and provisioning business\u007f",
        "date": "02292016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-Gategroup Holding extends contract with American Airlines "
    },
    {
        "content": "CARACAS American Airlines said on Tuesday it will ax its Caracas to New York route on April 4 due to low demand just over three months after reinstating it.",
        "date": "03082016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines to ax newly reinstated Caracas-New York route "
    },
    {
        "content": "CARACAS  March 8 American Airlines said on Tuesday it will axe its Caracas to New York route on April 4 due to low demand just over three months after reinstating it.",
        "date": "03082016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines to axe newly reinstated Caracas-New York route "
    },
    {
        "content": "American Airlines had no duty to restore the seniority it stripped from TWA flight attendants in a 2001 merger before American merged with US Airways in 2013  a federal appeals court held Tuesday.",
        "date": "02172016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines wins seniority fight with former TWA flight attendants "
    },
    {
        "content": "Feb 19 The U.S. Justice Department has started an investigation into whether top airlines have complied with contracts to carry mail cargo for the U.S. Postal Service  the three biggest U.S. passenger carriers said this week.",
        "date": "02192016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "UPDATE 1-Justice Dept. scrutinizes top U.S. airlines over mail cargo "
    },
    {
        "content": "NEW YORK American Airlines'  president on Friday said it is too early to tell if the rapidly spreading Zika virus will impact travel  but so far the airline has seen no material change to flight bookings.",
        "date": "01292016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines says too early to tell Zika's impact on travel "
    },
    {
        "content": "NEW YORK  Jan 29 American Airlines'  president on Friday said it is too early to tell if the rapidly spreading Zika virus will impact travel  but so far the airline has seen no material change to flight bookings.",
        "date": "01292016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-American Airlines says too early to tell Zika's impact on travel "
    },
    {
        "content": "NEW YORK  Jan 29 American Airlines'  president on Friday said it is too early to tell if the rapidly spreading Zika virus will impact travel  but so far the airline has seen no material change to flight bookings.",
        "date": "01292016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "REFILE-American Airlines says too early to tell Zika's impact on travel "
    },
    {
        "content": "American Airlines Group Inc  on Friday reported a fourth-quarter profit above analysts' estimates as tumbling oil prices continued to add to its bottom line.",
        "date": "01292016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines' fourth-quarter profit beats expectations "
    },
    {
        "content": "Jan 29 American Airlines Group Inc on Friday reported a fourth-quarter profit above analysts' estimates as tumbling oil prices continued to add to its bottom line.",
        "date": "01292016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-American Airlines' 4th-quarter profit beats expectations "
    },
    {
        "content": "Jan 29 American Airlines Group Inc on Friday reported a fourth-quarter profit above analysts' estimates as cheap fuel continued to add to its bottom line.",
        "date": "01292016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines 4th-quarter profit beats expectations "
    },
    {
        "content": "NEW YORK  Jan 28 While airlines are in no rush to pass on fuel savings to passengers brought by the collapse in oil prices  the Houston travel market has left them little choice.",
        "date": "01282016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "In U.S. oil capital Houston  no cheap fuel bonanza for airlines "
    },
    {
        "content": "Jan 27 American Airlines Group Inc has expanded its refunds for pregnant customers visiting areas impacted by the Zika virus to include Puerto Rico  Martinique and nine countries in Central and South America and the Caribbean  a spokesman said Wednesday.",
        "date": "01272016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines expands refunds related to Zika virus "
    },
    {
        "content": "American Airlines Group Inc on Tuesday said it has written off more than half a billion dollars in revenue stuck in Venezuela because of currency controls.",
        "date": "01122016",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines writes off $592 million trapped in Venezuela "
    },
    {
        "content": "Jan 12 American Airlines Group Inc on Tuesday said it has written off more than half a billion dollars in revenue stuck in Venezuela because of currency controls.",
        "date": "01122016",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines writes off $592 mln trapped in Venezuela "
    },
    {
        "content": "Dec 31 American Airlines Group Inc said its unit U.S. Airways Group merged with the company  as part of efforts to integrate operations of the businesses following a merger in 2013.",
        "date": "12312015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines merges operations of unit U.S. Airways "
    },
    {
        "content": "Members of the association representing American Airlines Group Inc's  reservations and gate agents approved a new five-year contract that includes an immediate 30 percent average wage hike.",
        "date": "11302015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines  union reach deal to hike agents' pay "
    },
    {
        "content": "Nov 30 Members of the association representing American Airlines Group Inc's reservations and gate agents approved a new five-year contract that includes an immediate 30 percent average wage hike.",
        "date": "11302015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-American Airlines  union reach deal to hike agents' pay "
    },
    {
        "content": "BUENOS AIRES  Nov 25 American Airlines  has stopped accepting Argentine pesos to pay for tickets due to currency controls that make it hard to convert receipts into U.S. dollars  local media and one of the airline's sales agents said on Wednesday.",
        "date": "11252015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines stops accepting payments in Argentine pesos "
    },
    {
        "content": " ",
        "date": "11252015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 2-American Airlines stops accepting payments in Argentine pesos "
    },
    {
        "content": "Nov 17 American Airlines Group Inc on Tuesday said it will change its loyalty program in the second half of next year so customers earn frequent-flier miles based on the fares they pay rather than the distance they fly.",
        "date": "11182015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "CORRECTED-UPDATE 1-American Airlines to reward fliers for money spent  not mileage flown "
    },
    {
        "content": "Nov 17 American Airlines Group Inc on Tuesday said it will change its loyalty program in the second half of next year so customers earn frequent-flier miles based on the fares they pay rather than the distance they fly.",
        "date": "11172015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines to reward fliers for money spent  not mileage flown "
    },
    {
        "content": "Nov 17 American Airlines Group Inc on Tuesday said it will change its loyalty program in the second half of next year so customers earn frequent-flier miles based on the fares they pay rather than the distance they fly.",
        "date": "11172015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-American Airlines to reward fliers for money spent  not mileage flown "
    },
    {
        "content": "NEW YORK  Nov 13 American Airlines Group   the world's biggest carrier by passenger traffic  said on Friday it was delaying flights to Paris in response to the explosions and shooting attacks there  even though French airports remained open.",
        "date": "11142015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines delays Paris flights; United operates as planned "
    },
    {
        "content": "NEW YORK  Nov 13 American Airlines Group   the world's biggest carrier by passenger traffic  said on Friday it was delaying flights to Paris in response to the explosions and shooting attacks there  even though French airports remained open.",
        "date": "11142015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 2-American Airlines delays Paris flights; United operates as planned "
    },
    {
        "content": "* American Airlines Group Inc expects 4Q system capacity to be up about 1 percent year over year - CFO",
        "date": "10232015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines expects its capacity will be up 2 to 3 pct in 2016 "
    },
    {
        "content": "Oct 23 American Airlines Group Inc on Friday reported third-quarter profit above analysts' expectations  as cheap fuel continued to help its bottom line.",
        "date": "10232015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines profit jumps  beats expectations "
    },
    {
        "content": "DALLAS  Oct 15 An American Airlines flight was delayed for more than hour by bees that were swarming under a plane wing when it was parked at  Dallas/Fort Worth International Airport  the company said on Thursday.",
        "date": "10152015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines flight delayed in Texas by swarming bees "
    },
    {
        "content": "TORONTO/PARIS Canada's Bombardier Inc  said on Friday it is in advanced discussions to sell its new CSeries jet to airlines in North America  without identifying the prospective buyers.",
        "date": "10092015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "Bombardier in talks with North American airlines on CSeries jet orders "
    },
    {
        "content": "TORONTO/PARIS  Oct 9 Canada's Bombardier Inc  said on Friday it is in advanced discussions to sell its new CSeries jet to airlines in North America  without identifying the prospective buyers.",
        "date": "10092015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-Bombardier in talks with North American airlines on CSeries jet orders "
    },
    {
        "content": "Oct 9 American Airlines Group Inc on Friday said it expects its pre-tax profit margin to fall within the higher range of prior guidance.",
        "date": "10092015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines narrows profit margin forecast "
    },
    {
        "content": "Oct 9 American Airlines Group Inc on Friday said it expects its pretax profit margin for the third quarter to be within the higher range of its previous forecast.",
        "date": "10092015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-American Airlines narrows profit margin forecast "
    },
    {
        "content": "Oct 5 An overnight flight from Phoenix to Boston was diverted to Syracuse  New York  on Monday morning after one of the pilots fell ill and died  an American Airlines spokeswoman said.",
        "date": "10052015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "Pilot falls ill on American flight from Phoenix to Boston  dies "
    },
    {
        "content": "Sept 30 American Airlines Group Inc said Wednesday that it agreed to a tentative contract with the association representing its reservations and gate agents that provides for \"significant pay raises.\"",
        "date": "09302015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines  union reach tentative deal to hike gate agents' pay "
    },
    {
        "content": "PARIS French aerospace supplier Zodiac Aerospace  confirmed on Friday it was facing court action and the possible loss of some business from American Airlines  over delays in aircraft seat production  sending its shares to a 27-month low.",
        "date": "09252015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Seatmaker Zodiac faces American Airlines suit over delays "
    },
    {
        "content": "PARIS  Sept 25 French aircraft cabin and systems maker Zodiac said on Friday that American Airlines  had filed a petition in a Texas court seeking \"a judicial determination of the contractual situation\" between them over business class seats  which may lead to the sharing of this activity with another supplier.",
        "date": "09252015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Zodiac says legal advisers reviewing American Airlines filing "
    },
    {
        "content": "American Airlines  on Thursday said it was working to get customers in the air after technical problems caused it to halt flights to three of its hub airports.",
        "date": "09172015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines working to recover from flight delays "
    },
    {
        "content": "Sept 17 American Airlines on Thursday said it was working to get customers in the air after technical problems caused it to halt flights to three of its hub airports.",
        "date": "09172015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 2-American Airlines working to recover from flight delays "
    },
    {
        "content": "Sept 17 American Airlines Group Inc said on Thursday that it resolved the connectivity issues that had required it to halt its U.S. domestic flights to Dallas  Chicago and Miami.",
        "date": "09172015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines fixes technical errors  resumes flights "
    },
    {
        "content": "WASHINGTON  Sept 17 The Federal Aviation Administration said American Airlines halted U.S. domestic flights to Dallas-Fort Worth  Chicago O'Hare and Miami international airports on Thursday.",
        "date": "09172015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "CORRECTED-American Airlines flights to Dallas  Chicago  Miami grounded -FAA "
    },
    {
        "content": "China-linked hackers attacked the computer systems of travel reservations distributor Sabre Corp  and American Airlines Group Inc   Bloomberg reported  although the world's largest airline said there was no evidence of such a breach.",
        "date": "08072015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "China-linked hackers attack American Airlines  Sabre systems: Bloomberg "
    },
    {
        "content": "Aug 7 China-linked hackers attacked the computer systems of travel reservations distributor Sabre Corp  and American Airlines Group Inc  Bloomberg reported  although the world's largest airline said there was no evidence of such a breach.",
        "date": "08072015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 2-China-linked hackers attack American Airlines  Sabre systems - Bloomberg "
    },
    {
        "content": "Aug 7 China-linked hackers have breached the computer systems of U.S. airline company American Airline Group Inc and travel reservations platform provider Sabre Corp   Bloomberg reported  citing people familiar with the investigations.",
        "date": "08072015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "China-linked hackers breach American Airlines  Sabre systems - Bloomberg "
    },
    {
        "content": "July 23 At least two U.S. airlines have started hedging their fuel costs after a months-long hiatus. The early result: more losses.",
        "date": "07232015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "U.S. airlines return to fuel hedging  get burned again "
    },
    {
        "content": "American Airlines Group Inc  on Friday said it is facing sharp declines in unit revenue for months to come  sending its stock down nearly 7 percent  even though the company posted its highest profit ever last quarter. | Video ",
        "date": "07242015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines sees no quick end to unit-revenue fall  shares drop "
    },
    {
        "content": "July 24 American Airlines Group Inc on Friday said it is facing sharp declines in unit revenue for months to come  sending its stock down nearly 7 percent  even though the company posted its highest profit ever last quarter.",
        "date": "07242015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 2-American Airlines sees no quick end to unit-revenue fall  shares drop "
    },
    {
        "content": "WASHINGTON/NEW YORK The U.S. Transportation Department is investigating possible price gouging by the five biggest U.S. airlines while train service was disabled between New York and Washington following a deadly Amtrak crash in May  it said on Friday.",
        "date": "07242015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "U.S. probing possible price-gouging by airlines after rail crash "
    },
    {
        "content": "WASHINGTON  July 24 The U.S. Transportation Department on Friday began an investigation of possible price gouging by four American airlines in the aftermath of a deadly Amtrak crash in Philadelphia in May.",
        "date": "07242015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "U.S. investigating possible price-gouging by four U.S. airlines "
    },
    {
        "content": "July 24 American Airlines Group Inc  expects passenger unit revenue likely will continue to decline until the second half of 2016  although the carrier remains bullish about its future as it posts billion-dollar profits despite this.",
        "date": "07242015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines says positive unit revenue unlikely until second half 2016 "
    },
    {
        "content": "July 24 American Airlines Group Inc  expects unit revenue to drop in the third quarter as growing capacity in Dallas continues to pressure fares and as the strong U.S. dollar keeps weighing on travel demand abroad.",
        "date": "07242015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines expects unit revenue drop in third quarter "
    },
    {
        "content": "July 24 American Airlines Group Inc on Friday reported second-quarter profit that topped analysts' expectations and declared a dividend of 10 cents per share.",
        "date": "07242015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines beats 2nd-qtr estimate  declares dividend "
    },
    {
        "content": "July 23 At least two U.S. airlines have started hedging their fuel costs after a months-long hiatus. The early result: more losses.",
        "date": "07242015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "RPT--U.S. airlines return to fuel hedging  get burned again "
    },
    {
        "content": "CARACAS  July 13 American Airlines said on Monday it would restart its Caracas-New York route as of Dec. 17  though it added that it had not repatriated more than half a billion dollars in revenue trapped in Venezuela as a result of currency controls.",
        "date": "07132015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American to resume Caracas-JFK route; currency dispute unresolved "
    },
    {
        "content": "SYDNEY  July 9 Qantas Airways Ltd on Thursday said it will resume flights between Sydney and San Francisco after Australian authorities gave interim approval for an expanded codeshare arrangement with American Airlines Group Inc.",
        "date": "07092015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Australia's Qantas to restart SF direct flights after regulatory backing "
    },
    {
        "content": "July 10 US Airways will become history on Oct. 17  as the carrier's flight reservations move over to American Airlines in one of the last steps in the creation of the world's largest airline.",
        "date": "07102015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "UPDATE 1-American to retire US Airways brand on Oct. 17 "
    },
    {
        "content": "July 10 American Airlines Group Inc on Friday lowered its plans for capacity growth in the United States  seeming to heed investors' calls to slow its expansion in light of weaker-than-expected travel demand.",
        "date": "07102015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines lowers plans for U.S. capacity growth "
    },
    {
        "content": "June 26 A federal appeals court on Friday ordered a union negotiating seniority rights of former US Airways and America West pilots to stop favoring the US Airways pilots  in a divisive decade-old dispute overhanging the 2013 merger that created American Airlines Group Inc.",
        "date": "06262015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Ex-America West pilots win U.S. court ruling on seniority rights "
    },
    {
        "content": "Shares for the top four airline carriers in the United States could rise 15 percent to 50 percent due to less competition and falling fuel costs  according to the June 22 edition of Barron's.",
        "date": "06212015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "Stocks of top U.S. airlines ready to soar: Barron's "
    },
    {
        "content": "NEW YORK  June 15 American Airlines Group  said on Monday that it would wait four to five more years before taking delivery of 35 new Airbus Group  A320neo family jetliners to gain capacity flexibility.",
        "date": "06152015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines pushes back delivery of Airbus A320neo jets "
    },
    {
        "content": "NEW YORK  June 15 American Airlines Group  said on Monday that it would push back delivery of 35 Airbus Group A320neo family jetliners by several years  a move that it said gives it more flexibility to control capacity growth.",
        "date": "06152015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-American Airlines pushes back delivery of Airbus A320neo jets "
    },
    {
        "content": "MIAMI American Airlines Group Inc Chief Executive Doug Parker voiced concern on Sunday about the risk that capacity growth among airlines could depress profits  but told Reuters that in contrast with past cycles  the rise in capacity \"feels different.\"",
        "date": "06072015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines CEO cites capacity growth risks "
    },
    {
        "content": "American Airlines Group Inc  on Tuesday said two key metrics of profitability could be lower this quarter than it previously forecast.",
        "date": "06092015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Air sees turbulence in seat revenue  margins "
    },
    {
        "content": "June 9 American Airlines Group Inc on Tuesday said two key metrics of profitability could be lower this quarter than it previously forecast.",
        "date": "06092015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-American Air sees turbulence in seat revenue  margins "
    },
    {
        "content": "June 9 American Airlines Group Inc said it expected a further decline in consolidated passenger revenue per available seat mile (PRASM) in the current quarter.",
        "date": "06092015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines expects further decline in Q2 PRASM "
    },
    {
        "content": "May 26 A sinkhole has closed a runway at Dallas/Fort Worth International Airport  which may delay flights at one of the largest transit hubs in the United States.",
        "date": "05262015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "UPDATE 1-Sinkhole closes runway at DFW airport "
    },
    {
        "content": "May 11 American Airlines Group raised its estimate for jet fuel costs and cut its margin forecast for the current quarter  reflecting the more than 10 percent  rise in U.S. crude oil prices since the start of the year.",
        "date": "05112015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "UPDATE 1-American Airlines says fuel costs to squeeze margins in 2nd qtr "
    },
    {
        "content": "May 11 American Airlines Group raised its forecast for jet fuel costs for the current quarter  reflecting a recent rise in crude oil prices.",
        "date": "05112015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines sees higher fuel costs in 2nd quarter "
    },
    {
        "content": "May 12 American Airlines said on Tuesday it will begin uniting its reservations platform with US Airways' as early as July  setting a three-month timeframe for a data migration process other merged carriers have struggled with.",
        "date": "05122015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines to begin merging reservations platforms this summer "
    },
    {
        "content": "American Airlines Group Inc  on Friday reported first-quarter profit above analysts' expectations and pleased investors with capacity cuts to match weakening international demand.",
        "date": "04242015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines plans capacity cuts  tops first-quarter expectations "
    },
    {
        "content": "April 24 American Airlines Group Inc on Friday reported first-quarter profit above analysts' expectations and pleased investors with capacity cuts to match weakening international demand.",
        "date": "04242015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 3-American Airlines plans capacity cuts  tops 1st-qtr expectations "
    },
    {
        "content": "April 22 The chief of American Airlines Group Inc has opted to receive his primary pay in stock starting on Wednesday  without a base salary or annual bonus  he said in a letter to employees.",
        "date": "04222015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines CEO opts for shares  no salary "
    },
    {
        "content": "April 24 American Airlines Group Inc  expects its passenger unit revenue to fall four to six percent this quarter with the largest drops in the Pacific and Latin America  Chief Financial Officer Derek Kerr said in an investor call Friday.",
        "date": "04242015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines forecasts passenger unit revenue drop "
    },
    {
        "content": "April 22 The chief of American Airlines Group Inc has opted to receive his primary pay in stock starting on Wednesday  drawing union criticism because he has opposed linking the pay of pilots to the company's performance.",
        "date": "04222015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-American Airlines CEO opts for shares  no salary "
    },
    {
        "content": "April 24 American Airlines Group Inc on Friday reported first-quarter profit above analysts' expectations as cheap fuel continued to help its bottom line.",
        "date": "04242015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines 1st-quarter profit tops expectations "
    },
    {
        "content": "April 15 A U.S. labor regulator said on Wednesday that American Airlines and US Airways constitute a single carrier  bringing parent American Airlines Group Inc  closer to starting contract talks with its mechanics  dispatchers  crew training and fleet service employees.",
        "date": "04152015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines mechanics  dispatchers closer to starting contract talks "
    },
    {
        "content": "April 8 American Airlines and US Airways were given a single operating certificate from U.S. regulators  marking a milestone in their integration since the carriers merged in December 2013  parent American Airlines Group Inc  said.",
        "date": "04082015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "U.S. regulator grants American Airlines  US Airways single certificate "
    },
    {
        "content": "March 27 A U.S. regulator tentatively said Friday that Delta Air Lines Inc can keep a slot at Tokyo's Haneda Airport if it flies there from Seattle daily  upsetting competitors that had asked for Delta's slot to grow their presence in Asia.",
        "date": "03272015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "UPDATE 1-U.S. regulator proposes letting Delta keep contested Tokyo airport slot "
    },
    {
        "content": "March 25 American Airlines and US Airways expect to receive a single operating certificate from U.S. regulators on April 8  marking a milestone since their December 2013 merger  parent American Airlines Group Inc told employees in a newsletter on Wednesday.",
        "date": "03252015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines Group expects merger milestone on April 8 "
    },
    {
        "content": "March 16   * S&P Dow jones indices says American Airlines Group Inc  to replace",
        "date": "03162015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "BRIEF-American Airlines to join S&P 500 "
    },
    {
        "content": "* Indexes: Dow down 0.8 pct  S&P down 0.4 pct  Nasdaq up 0.04 pct   (Updates to afternoon)",
        "date": "03172015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "US STOCKS-Dow  S&P 500 fall on Fed nervousness; Nasdaq inches up "
    },
    {
        "content": "* Indexes down: Dow 0.9 pct  S&P 0.6 pct  Nasdaq 0.2 pct   (Updates to midday)",
        "date": "03172015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "US STOCKS-Wall St declines with energy  materials  caution before Fed "
    },
    {
        "content": "* Indexes down: Dow 0.89 pct  S&P 0.61 pct  Nasdaq 0.35 pct   (Updates to late morning  commentary)",
        "date": "03172015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "US STOCKS-Wall St falls as investors wait for Fed statement "
    },
    {
        "content": "* Indexes down: Dow 0.51 pct  S&P 0.31 pct  Nasdaq 0.12 pct   (Adds market open  updates share prices)",
        "date": "03172015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "US STOCKS-Wall St opens lower ahead of Fed meeting "
    },
    {
        "content": "* Futures down: Dow 41 pts  S&P 4.5 pts  Nasdaq 1 pt   (Adds market moves  commentary)",
        "date": "03172015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "US STOCKS-Wall St was set for lower open ahead of Fed meeting "
    },
    {
        "content": "DENVER  March 4 Passengers and crew aboard an American Airlines flight were safely evacuated by emergency slides on Wednesday after possible smoke was detected inside the cabin after the aircraft landed at Denver International Airport  officials said.",
        "date": "03042015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Passengers  crew evacuate safely from American Airlines flight in Denver "
    },
    {
        "content": "Gogo Inc   an in-flight internet services provider  gave a full-year revenue forecast range that was largely above analysts' average expectation  driven by a surge in demand from commercial and business aviation clients.",
        "date": "02262015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "Gogo expects to benefit from rising demand for in-flight internet "
    },
    {
        "content": "American Airlines Group Inc has canceled 170 flights for Wednesday because of weather conditions in the southern United States  largely affecting its Dallas-Fort Worth hub.",
        "date": "02252015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines cancels 170 Wednesday flights due to storm in U.S. South "
    },
    {
        "content": "American Airlines Group Inc and Delta Air Lines Inc have no plans to rescue Japan's bankrupt Skymark Airlines Inc  the two companies said separately on Monday following a media report on their alleged interest in the budget carrier.",
        "date": "02232015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American and Delta not interested in Skymark Airlines tie-up "
    },
    {
        "content": "Feb 23 American Airlines Group Inc and Delta Air Lines Inc have no plans to rescue Japan's bankrupt Skymark Airlines Inc  the two companies said separately on Monday following a media report on their alleged interest in the budget carrier.",
        "date": "02232015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-American and Delta not interested in Skymark Airlines tie-up "
    },
    {
        "content": "Feb 23 American Airlines Group Inc has decided not to participate in the restructuring of Japan's bankrupt Skymark Airlines Inc at this time  a spokesman said following a media report that said it was considering a tie-up with Skymark.",
        "date": "02232015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines says won't participate in Skymark Airlines restructuring now "
    },
    {
        "content": "Feb 9 American Airlines Group Inc on Monday lowered its forecast for first-quarter profit margins due to the recent rise in oil prices  and its shares fell 3 percent.",
        "date": "02092015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines cuts margin outlook  citing rising fuel costs "
    },
    {
        "content": "Feb 11 American Airlines Group Inc said Wednesday that it will launch newly acquired Boeing Co  787 Dreamliners into service to Beijing  China  and Buenos Aires  Argentina  from its Dallas hub beginning on June 2 and June 4  respectively.",
        "date": "02112015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines says to fly Dreamliner from Dallas to Beijing  Buenos Aires "
    },
    {
        "content": "Jan 30 American Airlines Group pilots have voted to accept a five-year contract that will raise their wages substantially and cement their relationship with the management  the pilots union said Friday.",
        "date": "01302015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines Group pilots approve contract to raise pay "
    },
    {
        "content": "Jan 26 American Airlines Group has canceled all late afternoon and evening flights scheduled for Monday from the New York area  Philadelphia and Boston as a major winter storm bears down on the northeast  spokeswoman Andrea Huguely said.",
        "date": "01262015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines Group canceling flights from major northeast hubs "
    },
    {
        "content": "American Airlines Group Inc  on Tuesday forecast billions of dollars in savings this year from tumbling fuel costs  but said a key measure of revenue will likely decline this quarter  in part from currency headwinds that are pinching foreign travelers' pockets.",
        "date": "01272015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines expects fuel savings  currency headwind in 2015 "
    },
    {
        "content": "American Airlines Group Inc  on Tuesday forecast massive fuel savings in 2015 but negative unit revenue  sending its shares down more than two percent in morning trading.",
        "date": "01272015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines expects big fuel savings  negative first quarter unit revenue "
    },
    {
        "content": "Jan 27 American Airlines Group Inc on Tuesday forecast billions of dollars in savings this year from tumbling fuel costs  but said a key measure of revenue will likely decline this quarter  in part from currency headwinds that are pinching foreign travelers' pockets.",
        "date": "01272015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 2-American Airlines expects fuel savings  currency headwind in 2015 "
    },
    {
        "content": "Jan 27 American Airlines Group Inc on Tuesday forecast massive fuel savings in 2015 but negative unit revenue  sending its shares down more than two percent in morning trading.",
        "date": "01272015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines expects big fuel savings  negative 1st qtr unit revenue "
    },
    {
        "content": "Jan 27 American Airlines Group Inc said on Tuesday that its profit was $597 million last quarter  topping analysts' estimates  and announced a new share buyback program and dividend.",
        "date": "01272015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines beats profit expectations  declares dividend "
    },
    {
        "content": "Jan 23 Union organizers sued American Airlines  on Thursday  alleging that maintenance directors pressured workers to skimp on federal safety procedures and threatened discipline if they reported too many maintenance flaws.",
        "date": "01242015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines sued by mechanics union organizers "
    },
    {
        "content": "NEW YORK  Jan 7 A federal judge has significantly narrowed an antitrust lawsuit in which US Airways Inc  now part of American Airlines Group Inc  accused Sabre Corp  which distributes airfare information  of charging inflated booking fees and suppressing competition.",
        "date": "01072015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "U.S. judge narrows US Airways pricing lawsuit vs Sabre "
    },
    {
        "content": "Jan 5 American Airlines and Hawaiian Airlines formally launched bids Monday to wrest control of a key slot in Tokyo's Haneda Airport from Delta Air Lines  as part of a fight among the carriers to stake out a greater presence in Asia.",
        "date": "01062015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "Airlines bid to take Tokyo airport slot from Delta Air Lines "
    },
    {
        "content": "NEW YORK The union representing American Airlines pilots approved the carrier's final contract offer late Saturday  paving the way for a retroactive 23 percent wage hike if its members concur in a vote this month.",
        "date": "01052015",
        "name": "American Airlines Group Inc",
        "news_type": "topStory",
        "symbol": "AAL",
        "title": "American Airlines pilots union leaders accept tentative contract with 23 percent pay hike "
    },
    {
        "content": "NEW YORK  Jan 4 The union representing American Airlines pilots approved the carrier's final contract offer late Saturday  paving the way for a retroactive 23 percent wage hike if its members concur in a vote this month.",
        "date": "01052015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "UPDATE 1-American Airlines pilots union leaders accept tentative contract with 23 pct pay hike "
    },
    {
        "content": "NEW YORK  Jan 4 The union representing American Airlines pilots approved the carrier's final contract offer late Saturday  paving the way for a retroactive 23 percent wage hike if its members concur in a vote this month.",
        "date": "01042015",
        "name": "American Airlines Group Inc",
        "news_type": "normal",
        "symbol": "AAL",
        "title": "American Airlines pilots union calls for vote on proposed contract "
    }
]