[
    {
        "content": "* Advance Auto Parts reports fiscal third quarter 2017 results",
        "date": "11142017",
        "name": "Advance Auto Parts Inc",
        "news_type": "topStory",
        "symbol": "AAP",
        "title": "BRIEF-Advance Auto Parts reports Q3 adjusted EPS $1.43 "
    },
    {
        "content": "* Advance Auto Parts reports second quarter fiscal 2017 results",
        "date": "08152017",
        "name": "Advance Auto Parts Inc",
        "news_type": "topStory",
        "symbol": "AAP",
        "title": "BRIEF-Advance Auto Parts Q2 GAAP earnings per share $1.17 "
    },
    {
        "content": "* Advance Auto Parts Inc - CEO Thomas R. Greco's 2016 total compensation was $22.8 million - sec filing",
        "date": "04062017",
        "name": "Advance Auto Parts Inc",
        "news_type": "topStory",
        "symbol": "AAP",
        "title": "BRIEF-Advance Auto Parts CEO Thomas Greco's 2016 total compensation was $22.8 mln "
    },
    {
        "content": "* Advance Auto Parts Inc - CEO Thomas Greco's FY 2016 total compensation was $22.8 million - SEC filing",
        "date": "03232017",
        "name": "Advance Auto Parts Inc",
        "news_type": "topStory",
        "symbol": "AAP",
        "title": "BRIEF-Advance Auto Parts CEO Greco's 2016 total compensation $22.8 mln "
    },
    {
        "content": "* Accelerating growth and plans to open 75 to 85 new stores in 2017",
        "date": "03062017",
        "name": "Advance Auto Parts Inc",
        "news_type": "topStory",
        "symbol": "AAP",
        "title": "BRIEF-Advance Auto Parts is accelerating growth and plans to open new stores in 2017 "
    },
    {
        "content": "* Advance auto parts announces multi-year partnership with the mexican national team",
        "date": "03022017",
        "name": "Advance Auto Parts Inc",
        "news_type": "topStory",
        "symbol": "AAP",
        "title": "BRIEF-Advance auto parts announces multi-year partnership with mexican national team "
    },
    {
        "content": "* Advance Auto Parts names Jeffrey Shepherd chief accounting officer  Source text for Eikon:  Further company coverage:",
        "date": "03012017",
        "name": "Advance Auto Parts Inc",
        "news_type": "topStory",
        "symbol": "AAP",
        "title": "BRIEF-Advance Auto Parts names Jeffrey Shepherd chief accounting officer "
    },
    {
        "content": "* Advance Auto Parts -  In conjunction with entering into credit facilit Advance Stores Co  terminated credit agreement dated as of Dec 5  2013",
        "date": "02062017",
        "name": "Advance Auto Parts Inc",
        "news_type": "topStory",
        "symbol": "AAP",
        "title": "BRIEF-Advance Auto Parts in conjunction with entering into credit facilit Advance Stores Co  terminated credit agreement dated as of Dec 5  2013 "
    },
    {
        "content": "Jan 23 Shares of U.S. auto part retailers fell sharply on Monday following a report that Amazon.com Inc  had set its sights on the $50 billion do-it-yourself after-market auto parts business.",
        "date": "01232017",
        "name": "Advance Auto Parts Inc",
        "news_type": "normal",
        "symbol": "AAP",
        "title": "U.S. auto parts sellers skid after report on Amazon's entry "
    },
    {
        "content": "* Q3 earnings per share view $1.70 -- Thomson Reuters I/B/E/S",
        "date": "11142016",
        "name": "Advance Auto Parts Inc",
        "news_type": "topStory",
        "symbol": "AAP",
        "title": "BRIEF-Advance Auto Parts reports Q3 adj. share of $1.73 excluding items "
    },
    {
        "content": "* Okray will succeed Mike Norona  who will remain with company in an advisory role until end of year",
        "date": "10052016",
        "name": "Advance Auto Parts Inc",
        "news_type": "topStory",
        "symbol": "AAP",
        "title": "BRIEF-Advance Auto Parts names Thomas Okray CFO "
    },
    {
        "content": "U.S. auto parts retailer Advance Auto Parts Inc  reported a 4.8 percent fall in quarterly revenue as it grapples with \"service shortfalls\" and the unavailability of parts  sending the company's shares down more than 6 percent premarket.",
        "date": "08162016",
        "name": "Advance Auto Parts Inc",
        "news_type": "topStory",
        "symbol": "AAP",
        "title": "Advance Auto Parts quarterly revenue falls 4.8 percent "
    },
    {
        "content": "* Q2 earnings per share view $2.12 -- Thomson Reuters I/B/E/S",
        "date": "08162016",
        "name": "Advance Auto Parts Inc",
        "news_type": "normal",
        "symbol": "AAP",
        "title": "BRIEF-Advance Auto Parts Q2 GAAP earnings per share $1.68 "
    },
    {
        "content": "Aug 16 U.S. auto parts retailer Advance Auto Parts Inc reported a 4.8 percent fall in quarterly revenue due to store closures last year and as it consolidates its Carquest stores.",
        "date": "08162016",
        "name": "Advance Auto Parts Inc",
        "news_type": "normal",
        "symbol": "AAP",
        "title": "Advance Auto Parts quarterly revenue falls 4.8 pct "
    },
    {
        "content": "* George Sherman will remain with company to assist with an orderly transition through end of year",
        "date": "07292016",
        "name": "Advance Auto Parts Inc",
        "news_type": "topStory",
        "symbol": "AAP",
        "title": "BRIEF-Advance Auto Parts announces departure of president George Sherman "
    },
    {
        "content": "* Mike norona  chief financial officer  will be leaving company",
        "date": "05192016",
        "name": "Advance Auto Parts Inc",
        "news_type": "topStory",
        "symbol": "AAP",
        "title": "BRIEF-Advance Auto Parts Q1 adj cash EPS $2.51 "
    },
    {
        "content": "May 6 Wall Street securities analysts revised their ratings and price targets on several U.S.-listed companies  including Total System Services  Ubiquiti Networks and Advance Auto Parts  on Friday.                HIGHLIGHTS      * United Rentals Inc        : Goldman Sachs cuts to sell from neutral        * Weatherford International        : Seaport Global Securities raises to buy from neutral        * Endo International Plc         : Mizuho Securities cuts to underperform from neutra",
        "date": "05062016",
        "name": "Advance Auto Parts Inc",
        "news_type": "topStory",
        "symbol": "AAP",
        "title": "U.S. RESEARCH ROUNDUP-Weatherford  General Motors  Endo International "
    },
    {
        "content": "* LKQ's shares rise as much as 5.2 pct   (Adds details from conference call and source  shares)",
        "date": "12222015",
        "name": "Advance Auto Parts Inc",
        "news_type": "normal",
        "symbol": "AAP",
        "title": "UPDATE 3-LKQ to buy Italy's Rhiag to boost Europe auto spares business "
    },
    {
        "content": "Dec 15 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Tuesday:",
        "date": "12152015",
        "name": "Advance Auto Parts Inc",
        "news_type": "topStory",
        "symbol": "AAP",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Dec 15 U.S. auto parts retailer Advance Auto Parts Inc is exploring a potential sale after being approached by at least one possible suitor  StreetInsider reported on Tuesday.",
        "date": "12152015",
        "name": "Advance Auto Parts Inc",
        "news_type": "normal",
        "symbol": "AAP",
        "title": "Advance Auto Parts explores sale - StreetInsider "
    },
    {
        "content": "Auto parts retailer Advance Auto Parts Inc  reported lower-than-expected quarterly results  hurt by a stronger dollar  and the company cut its 2015 profit forecast.",
        "date": "11122015",
        "name": "Advance Auto Parts Inc",
        "news_type": "topStory",
        "symbol": "AAP",
        "title": "Advance Auto Parts third-quarter profit misses Street  shares fall "
    },
    {
        "content": "Nov 12 Auto parts retailer Advance Auto Parts Inc reported lower-than-expected quarterly results  hurt by a stronger dollar  and the company cut its 2015 profit forecast.",
        "date": "11122015",
        "name": "Advance Auto Parts Inc",
        "news_type": "normal",
        "symbol": "AAP",
        "title": "UPDATE 1-Advance Auto Parts Q3 profit misses Street  shares fall "
    },
    {
        "content": "Nov 12 Auto parts retailer Advance Auto Parts Inc appointed activist investor Starboard Value LP's chief executive to its board  taking the total member count to 13.",
        "date": "11122015",
        "name": "Advance Auto Parts Inc",
        "news_type": "normal",
        "symbol": "AAP",
        "title": "Advance Auto Parts adds Starboard CEO to its board "
    },
    {
        "content": "Activist investor Starboard Value LP disclosed a 3.7 percent stake in automotive parts retailer Advance Auto Parts Inc on Wednesday and urged the company consider steps including a \"substantial\" dividend or buyback.",
        "date": "09302015",
        "name": "Advance Auto Parts Inc",
        "news_type": "topStory",
        "symbol": "AAP",
        "title": "Starboard takes stake in Advance Auto  urges changes "
    },
    {
        "content": "Sept 30 Activist investor Starboard Value LP disclosed a 3.7 percent stake in automotive parts retailer Advance Auto Parts Inc on Wednesday and urged the company consider steps including a \"substantial\" dividend or buyback.",
        "date": "09302015",
        "name": "Advance Auto Parts Inc",
        "news_type": "normal",
        "symbol": "AAP",
        "title": "UPDATE 2-Starboard takes stake in Advance Auto  urges changes "
    },
    {
        "content": "Sept 30 Activist investor Starboard Value LP said it has bought a 3.7 percent stake in automotive parts retailer Advance Auto Parts Inc.",
        "date": "09302015",
        "name": "Advance Auto Parts Inc",
        "news_type": "normal",
        "symbol": "AAP",
        "title": "Starboard takes 3.7 pct stake in Advance Auto Parts "
    },
    {
        "content": "Sept 30 Activist investor Starboard Value LP has built a 3.7 percent stake in automotive parts maker Advance Auto Parts Inc  the Wall Street Journal reported.",
        "date": "09302015",
        "name": "Advance Auto Parts Inc",
        "news_type": "normal",
        "symbol": "AAP",
        "title": "Activist investor Starboard builds 3.7 pct stake in Advance Auto-WSJ "
    }
]