[
    {
        "content": " (Company corrects to remove reference to transformer repair business shifting to Germany in this November 6 story)",
        "date": "11072017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "Swiss engineering firm ABB cutting 100 jobs at Geneva factory "
    },
    {
        "content": "ZURICH  Nov 6 Swiss engineering group ABB is axing 100 jobs from its Secheron plant in Geneva and shifting production to a site in Poland  the company said on Monday.",
        "date": "11072017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "CORRECTED (OFFICIAL)-Swiss engineering firm ABB cutting 100 jobs at Geneva factory "
    },
    {
        "content": "ZURICH ABB  is reorganizing part of its global power grids operations as the Swiss engineering group responds to the division's sluggish profitability and falling orders.",
        "date": "11062017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB overhauls Power Grids  cuts U.S. and Swiss production "
    },
    {
        "content": "ZURICH  Nov 6 ABB is reorganising part of its global power grids operations as the Swiss engineering group responds to sluggish profitability and falling orders in the business.",
        "date": "11062017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB overhauls global Power Grids business  halts production at U.S  Swiss plants "
    },
    {
        "content": "ZURICH/KHOBAR  Saudi Arabia Swiss engineering conglomerate ABB  is putting its turnkey projects arm for the oil and gas industry into a joint venture majority owned by Saudi Arabia's Arkad Engineering & Construction  as ABB seeks to \"optimise\" its business portfolio  the company said on Monday.",
        "date": "11062017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB teams up with Saudi firm Arkad for turnkey oil and gas projects "
    },
    {
        "content": "ZURICH/KHOBAR  Saudi Arabia  Nov 6 Swiss engineering conglomerate ABB is putting its turnkey projects arm for the oil and gas industry into a joint venture majority owned by Saudi Arabia's Arkad Engineering & Construction  as ABB seeks to \"optimise\" its business portfolio  the company said on Monday.",
        "date": "11062017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "UPDATE 1-ABB teams up with Saudi firm Arkad for turnkey oil and gas projects "
    },
    {
        "content": "* Says well-placed to win orders from Saudi NEOM project (rewrites throughout  adding CEO comments  analysts  stock reaction)",
        "date": "10262017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "UPDATE 2-ABB aims to win Saudi projects after Q3 orders rise strongly "
    },
    {
        "content": "* ABB CEO says  we see chf35 as a possible share price  this is what we need to aim for",
        "date": "10262017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB has capacity for bolt-on acquisitions but no large purchases in next two quarters "
    },
    {
        "content": "* ABB CEO says confident that ambition to accelerate growth will pay off in 2018",
        "date": "10262017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB CEO says company well positioned to take part in $500b Saudi mega city project "
    },
    {
        "content": "ZURICH  Oct 19 ABB has won an order worth around $130 million to provide infrastructure for Hinkley Point C  the first new nuclear power plant to be built in Britain for decades  the Swiss engineering group said on Thursday.",
        "date": "10192017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB wins $130 mln order for Hinkley Point nuclear plant in UK "
    },
    {
        "content": "General Electric Co  is nearing a deal to sell its industrial solutions unit to Swiss engineering company ABB Ltd  in a deal valued at $2.5 billion to $3 billion  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "09222017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "GE nears sale of its industrial unit to ABB: Bloomberg "
    },
    {
        "content": "* ABB ltd. - abb wins record order in turkey for inline ii fuse switch disconnector technology",
        "date": "09272017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "BRIEF-ABB wins record order in Turkey for switch fuse disconnectors "
    },
    {
        "content": "(The following statement was released by the rating agency) BARCELONA/LONDON  September 26 (Fitch) Fitch Ratings says ABB Ltd's (A-/Stable) ratings are not affected by the Swiss engineering group's USD2.6 billion acquisition of US-based General Electric Industrial Solutions. Fitch believes ABB's leverage metrics will remain commensurate with the current rating levels  driven by EBIT margins of around 8%-9% and additional cash buffer coming from USD 3 billion share buyback programme being put on ",
        "date": "09262017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "Fitch: No Rating Impact on ABB from GE Industrial Solutions Acquisition "
    },
    {
        "content": "ZURICH Power grids maker ABB  is buying General Electric's Industrial Solutions business for $2.6 billion in a bet it can improve the division's lackluster margins over the next five years  the Swiss engineering company said on Monday.",
        "date": "09252017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB buys GE business for $2.6 billion in bet it can boost margins "
    },
    {
        "content": "Sept 22 General Electric Co has neared the sale of its industrial solutions unit to ABB Ltd for $2.5 billion to $3 billion  Bloomberg reported on Friday.",
        "date": "09222017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "GE nears sale of its industrial unit to ABB - Bloomberg "
    },
    {
        "content": "* Abb and Northvolt sign memorandum of understanding for a wide-ranging supply and technology partnership  including products and services for northvolt lithimum-ion battery factory",
        "date": "09262017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB and Northvolt sign MOU regarding battery factory "
    },
    {
        "content": "* ABB suspends share buyback programme (Adds comment from ABB CEO from call  analyst comment)",
        "date": "09252017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "UPDATE 2-ABB buys GE business for $2.6 bln in bet it can boost margins "
    },
    {
        "content": "* CEO Ulrich Spiesshofer says expects integration costs of $400 million amid 'footprint' optimisation Source text for Eikon: Further company coverage: (Reporting by John Miller)",
        "date": "09252017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB CEO expects $400 mln integration costs from GE deal "
    },
    {
        "content": "* GE is said to near industrial-solutions unit sale to ABB - Bloomberg  citing sources Source text : https://bloom.bg/2fF3RBq",
        "date": "09222017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-General Electric said to near industrial-solutions unit sale to ABB- Bloomberg "
    },
    {
        "content": "* Says has put share buyback programme on hold given GE transaction Source text for Eikon: Further company coverage: (Reporting By Zurich newsroom)",
        "date": "09252017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB puts share buyback on hold given GE transaction "
    },
    {
        "content": "ZURICH  Sept 25 ABB is buying General Electric's Industrial Solutions unit for $2.6 billion to expand its reach in North American markets  the Swiss engineering company said on Monday.",
        "date": "09252017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB buys GE unit for $2.6 bln to boost North American business "
    },
    {
        "content": "DETROIT  Sept 6 ABB Ltd plans to expand its U.S. industrial robot factory in Michigan  the company's chief executive officer said on Wednesday  while declining to comment on reports that he is weighing the purchase of a unit of rival General Electric Co.",
        "date": "09062017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB plans expansion in U.S.  scouting for acquisitions  CEO says "
    },
    {
        "content": "* ABB says market dynamics improving but 2017 still transition year - slides",
        "date": "09062017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB confirms 2020 targets at innovation day - slides "
    },
    {
        "content": "* says Wartsila and ABB have signed an agreement to expand their cooperation in lifecycle service offerings",
        "date": "08242017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "BRIEF-Wartsila  ABB expand cooperation in services "
    },
    {
        "content": "General Electric Co  has resumed negotiations to sell its industrial solutions business to Swiss engineering company ABB Ltd   after the U.S. industrial conglomerate moderated its price expectations  people familiar with the matter said.",
        "date": "08232017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "GE  ABB restart talks over industrial solutions deal: sources "
    },
    {
        "content": "Aug 23 General Electric Co has resumed negotiations to sell its industrial solutions business to Swiss engineering company ABB Ltd  after the U.S. industrial conglomerate moderated its price expectations  people familiar with the matter said.",
        "date": "08232017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "GE  ABB restart talks over industrial solutions deal -sources "
    },
    {
        "content": "* FULCRUM FIZ AND MEZZO CAPITAL SIGNS AGREEMENT TO START ACCELERATED BOOK BUILDING PROCESS TO SELL 14.0 MILLION SHARES OF CO Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "08182017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "BRIEF-Shareholders sign deal to start ABB to sell 14.0 mln Fachowcy.pl Ventures shares "
    },
    {
        "content": "* ABB CFO says  expects commodity prices to have less of an impact in q3  q4",
        "date": "07202017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "BRIEF-ABB expects commodity price rises to have less of an impact in rest of year "
    },
    {
        "content": "ZURICH ABB  Chief Executive Ulrich Spiesshofer faces pressure to tackle lower profitability at the Swiss engineering company  after higher raw material prices and overcapacity issues dented its quarterly earnings.",
        "date": "07202017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB CEO faces pressure to improve profitability "
    },
    {
        "content": "* Clock ticking for CEO to deliver improvements (Adds CEO comments  analysts  share price reaction)",
        "date": "07202017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "UPDATE 2-ABB CEO faces pressure to improve profitability "
    },
    {
        "content": "* ABB CEO says  there could be acquisitions  in the future but only in a disciplined way",
        "date": "07202017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB CEO says Cevian relationship is very good "
    },
    {
        "content": "* ABB CEO says  sees more opportunity to take action on overcapacity side",
        "date": "07202017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB CEO says company will take action to tackle overcapacity "
    },
    {
        "content": "* ABB Ltd says order backlog at end of june 2017 amounted to $23.6 billion Source text for Eikon: Further company coverage:",
        "date": "07202017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB says order backlog at end of June 2017 amounted to $23.6 billion "
    },
    {
        "content": "BRUSSELS  July 4 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "07042017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "EU mergers and takeovers (July 4) "
    },
    {
        "content": "ZURICH  July 3 Electrical products maker ABB said on Monday it had bought a communications networks business from Germany's Keymile for an undisclosed price to beef up its Power Grids division that investors had once demanded be sold.",
        "date": "07032017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB buys German communications business to boost Power Grids "
    },
    {
        "content": "* ITS SHAREHOLDERS START ABB (ACCELERATED BOOK BUILDING) PROCEDURE CONCERNING SALE OF 4.11 PERCENT STAKE OF CO Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "06272017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "BRIEF-Shareholders start ABB procedure for 4.11 pct stake of Rainbow Tours "
    },
    {
        "content": "BRUSSELS  June 7 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "06072017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "EU mergers and takeovers (June 7) "
    },
    {
        "content": "ZURICH Swiss power transmission and industrial automation company ABB plans to switch auditors to KPMG from Ernst & Young  it said on Monday.",
        "date": "05222017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB plans to switch auditors to KPMG from EY "
    },
    {
        "content": "ZURICH  May 22 Swiss power transmission and industrial automation company ABB plans to switch auditors to KPMG from Ernst & Young  it said on Monday.",
        "date": "05222017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "CORRECTED-UPDATE 1-ABB plans to switch auditors to KPMG from EY "
    },
    {
        "content": "ZURICH  May 22 Swiss power transmission and industrial automation company ABB plans to switch auditors to KPMG from Ernst & Young  it said on Monday.",
        "date": "05222017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "CORRECTED-ABB says plans to switch auditors to KPMG from EY "
    },
    {
        "content": "* ABB Ltd - has priced eur 750 million 7- year bond transaction",
        "date": "05092017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "BRIEF-ABB Ltd has priced EUR 750 million 7- year bond transaction "
    },
    {
        "content": "ZURICH  May 4 ABB has won a $30 million order to upgrade a electricity transmission link in the Democratic Republic of Congo  part of the Swiss engineering company's push into Africa  it said on Thursday.",
        "date": "05042017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB wins $30 mln Congo order for power link upgrade "
    },
    {
        "content": "JOHANNESBURG  May 3 Swiss engineering group ABB will supply its first batch of traction transformer units for 240 Bombardier  electric locomotives  the company said on Wednesday after opening a production plant in South Africa.",
        "date": "05032017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB expands deeper into South Africa with traction transformer plant "
    },
    {
        "content": "HANOVER  Germany  April 25 Swiss transmission and industrial automation company ABB has a strong pipeline of orders in power grids  the head of that business told reporters on Tuesday.",
        "date": "04252017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB says power grids project pipeline is healthy "
    },
    {
        "content": "ZURICH  April 25 ABB has sealed a collaboration agreement with International Business Machines Corp  the Swiss engineering company said on Tuesday  the latest step in its efforts to ramp up its presence in digital technology and the internet of things.",
        "date": "04252017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB  IBM team up on industrial artificial intelligence "
    },
    {
        "content": "ZURICH  April 25 ABB has sealed a collaboration agreement with International Business Machines Corp  the Swiss engineering company said on Tuesday  the latest step in its efforts to ramp up its presence in digital technology and the internet of things.",
        "date": "04252017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "UPDATE 1-ABB  IBM team up on industrial artificial intelligence "
    },
    {
        "content": "European engineering groups ABB Ltd  and Schneider Electric SE  are competing for General Electric Co's  industrial solutions division  which could fetch as much as $3 billion  according to people familiar with the matter.",
        "date": "04212017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB  Schneider Electric bid for General Electric unit: sources "
    },
    {
        "content": "* Sees early signs of recovery in sectors hit by energy downturn",
        "date": "04202017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "UPDATE 2-ABB sees growth in small orders and some signs of recovery "
    },
    {
        "content": "April 21 European engineering groups ABB Ltd and Schneider Electric SE are competing for General Electric Co's industrial solutions division  which could fetch as much as $3 billion  according to people familiar with the matter.",
        "date": "04212017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB  Schneider Electric bid for General Electric unit -sources "
    },
    {
        "content": "* CEO Ulrich Spiesshofer says european political uncertainty having a dampening effect on economy",
        "date": "04202017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB CEO says European political uncertainty is dragging on the economy "
    },
    {
        "content": "* CEO Ulrich Spiesshofer says looking at m&a opportunities in electrification products  bolt ons in robotics and motion",
        "date": "04202017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB CEO says has active  constructive dialogue with investor Cevian "
    },
    {
        "content": "ZURICH  April 20 ABB said on Thursday it expected 2017 to be a transitional year  with the first signs of a recovery in some industries  as the engineering company reported better-than-expected earnings during the first three months of the year.",
        "date": "04202017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB sees early signs of market stabilising after Q1 earnings beat "
    },
    {
        "content": "ZURICH  April 11 Swiss power and automation group ABB on Tuesday named China managing director Chun-Yuan Gu president of its AMEA region and appointed Frank Duggan president of its Europe region.",
        "date": "04112017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB names heads of AMEA  Europe regions "
    },
    {
        "content": "ZURICH  April 7 Power group ABB has won an order worth around 270 million euros ($287.5 million) from British grid operator National Grid and Reseau de Transport d'Electricite (RTE)  the French network owner and operator  to connect electricity networks of France and the UK  it said on Friday. ($1 = 0.9392 euros) (Reporting by Michael Shields)",
        "date": "04072017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB wins 270 mln euro order for Britain-France power link "
    },
    {
        "content": "ZURICH Swiss engineering group ABB  has bought Austrian industrial automation company Bernecker & Rainer  a move that fits in with its strategy of expanding its products to better challenge German rival Siemens  on the factory floor.",
        "date": "04042017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB buys B&R to help it challenge Siemens in industrial automation "
    },
    {
        "content": "* ABB's largest buy since $3.9 bln Thomas & Betts deal in 2012",
        "date": "04042017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "UPDATE 3-ABB buys B&R to help it challenge Siemens in industrial automation "
    },
    {
        "content": "* ABB CEO says company will launch share buyback in second half of 2017",
        "date": "04042017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB CEO says will launch share buyback in second half of 2017 "
    },
    {
        "content": "ZURICH  April 4 ABB has bought Austrian group Bernecker + Rainer Industrie-Elektronik  the Swiss engineering company said on Tuesday  beefing up its presence in the automation products used in the plastic  food and automotive industries.",
        "date": "04042017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB buys Austrian automation company Bernecker + Rainer "
    },
    {
        "content": "ZURICH  March 27 Power transmission and industrial automation company ABB has replaced its senior management in South Korea after an executive disappeared from the business with $100 million.",
        "date": "03272017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB replaces South Korean management after $100 million fraud "
    },
    {
        "content": "* Says Jucker will continue to serve as chairman of the board of directors of ABB Germany  Source text for Eikon:  Further company coverage:   (Reporting By Zurich newsroom)",
        "date": "03142017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "BRIEF-ABB says Bernhard Jucker to retire from executive roles "
    },
    {
        "content": "ZURICH  March 13 ABB said on Monday that suspected fraud in South Korea cut its 2016 net income by $64 million in a case that prompted the Swiss power and automation group and its auditor to conclude the company failed to maintain effective internal controls.",
        "date": "03132017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "UPDATE 1-Fraud at ABB trims profit amid failure of internal oversight "
    },
    {
        "content": "BAGHDAD Iraq signed a $500 million agreement with ABB to implement energy projects  Prime Minister Haider al-Abadi's office said in a statement on Sunday.",
        "date": "02262017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "Iraq says it signs $500 million electricity deal with ABB "
    },
    {
        "content": "BAGHDAD  Feb 26 Iraq signed a $500 million agreement with ABB to implement energy projects  Prime Minister Haider al-Abadi's office said in a statement on Sunday.",
        "date": "02262017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "Iraq says it signs $500 mln electricity deal with ABB "
    },
    {
        "content": "BRUSSELS  Feb 27 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02272017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "EU mergers and takeovers (Feb 27) "
    },
    {
        "content": "BRUSSELS  Feb 20 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02202017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "EU mergers and takeovers (Feb 20) "
    },
    {
        "content": "* ABB estimates will take $100 mln charge against 2016 results",
        "date": "02232017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "UPDATE 4-Switzerland's ABB hit by $100 mln South Korean fraud "
    },
    {
        "content": "* UK's SFO - commenced investigation into activities of ABB Ltd's United Kingdom units  their officers  employees and agents for suspected bribery and corruption",
        "date": "02102017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "BRIEF-UK's SFO investigating ABB Ltd's UK units for suspected bribery  corruption "
    },
    {
        "content": "ZURICH Swiss power and automation group ABB  snapped a two-year order decline in the fourth quarter due to improvements in its U.S. and China markets  but said uncertainties in the global market had left it unsure of maintaining the recovery.",
        "date": "02082017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "Swiss power group ABB halts order decline with small fourth-quarter rise "
    },
    {
        "content": "* Shares fall 2.3 pct  trim year rise to less than 5 pct   (Adds background  updates shares)",
        "date": "02082017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "UPDATE 3-Swiss power group ABB halts order decline with small fourth-quarter rise "
    },
    {
        "content": "ZURICH  Feb 8 Power technology and automation group ABB reported an end to its almost two-year decline in order intake by posting a small increase in new business on Wednesday and forecast that 2017 would likely be dominated by market uncertainty.",
        "date": "02082017",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB reverses order decline with small increase in 4Q "
    },
    {
        "content": "ZURICH  Jan 18 Power and industrial automation maker ABB sees 2017 as a transitional year with growth picking up in 2018 in the energy sector  Chief Executive Ulrich Spiesshofer said in an interview with CNBC on Wednesday.",
        "date": "01182017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB CEO says preparing for market return later in 2017 - CNBC "
    },
    {
        "content": "* ABB wins $100 million order to upgrade historic HVDC link in the U.S.",
        "date": "01112017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "BRIEF-ABB says wins $100 mln order to upgrade HVDC link in U.S. "
    },
    {
        "content": "ZURICH  Jan 10 Transformer maker ABB  won a $640 million contract for a 1 830-km (1 137-mile) power link in India to connect thermal and wind power plants with the country's growing urban areas  the Swiss company said in a statement on Tuesday.",
        "date": "01102017",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB wins $640 mln grid contract in India for thermal  wind power "
    },
    {
        "content": "ZURICH/MUNICH  Oct 27 ABB's orders slipped for a sixth quarter and are not forecast to rise soon as Brexit  the U.S. elections and July's attempted Turkish coup compounded hesitation among customers of its Power Grids business  knocking its shares.",
        "date": "10272016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "UPDATE 4-Brexit dents Swiss engineer ABB's orders and outlook "
    },
    {
        "content": "* Task to reach share price of chf 35 has become more difficult after today's report",
        "date": "10272016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-Sweden's Cevian: ABB should rethink plan to keep Power Grids unit "
    },
    {
        "content": "* CFO departs as ABB opts for 'new talent'   (Adds analyst comment  updates shares)",
        "date": "10272016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "UPDATE 3-Brexit dents Swiss engineer ABB's orders and outlook "
    },
    {
        "content": "* CEO Ulrich Spiesshofer says expects Power Grids orders to resume following hesitation  'definitely not have another of these developments' going forward",
        "date": "10272016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB says China demand recovering after 'massive slowdown' "
    },
    {
        "content": "ZURICH ABB  will keep its Power Grids business in a rejection of demands from an activist investor to spin it off and the Swiss engineering group has also unveiled plans for a $3 billion share buy back from next year.",
        "date": "10042016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB rejects shareholder calls to spin off Power Grids "
    },
    {
        "content": "* ABB sees profit potential in software  consulting   (Adds comments from shareholder Nordea  updates shares)",
        "date": "10042016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "UPDATE 3-ABB rejects shareholder calls to spin off Power Grids "
    },
    {
        "content": "* Global strategic alliance for execution of large turnkey engineering  procurement  construction (EPC) electrical substation projects",
        "date": "10042016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-Fluor Corp and ABB form alliance to deliver large EPC substation projects globally "
    },
    {
        "content": "ZURICH Cevian Capital  ABB's  second-biggest shareholder  on Tuesday criticized the Swiss engineering group's decision to keep its Power Grids division.",
        "date": "10042016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "Cevian says ABB keeping Power Grids is 'unfortunate decision' "
    },
    {
        "content": "* CFO (not CEO) says cash priority is organic growth  then  dividend  then acquisitions and buyback",
        "date": "10042016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB CEO says can reach share price of 35 Sfr "
    },
    {
        "content": "* ABB shareholder Investor AB's CEO says in statement that believes today's announcements by ABB are the right ones for the company and its shareholders",
        "date": "10042016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-Investor says supports conclusions of ABB strategic review "
    },
    {
        "content": "ZURICH  Oct 4 Cevian Capital  ABB's  second-biggest shareholder  on Tuesday criticised the Swiss engineering group's decision to keep its Power Grids division.",
        "date": "10042016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "Cevian says ABB keeping Power Grids is \"unfortunate decision\" "
    },
    {
        "content": "* CEO says company will continue active portfolio management  continuously review portfolio -media call",
        "date": "10042016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB CEO says will consider M&A in Power Grids "
    },
    {
        "content": "ZURICH ABB looks likely to tell investors next week that it wants to hang on to its Power Grids business  putting the Swiss engineering group at odds with some shareholders who want it to be spun off.",
        "date": "09292016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB likely to clash with shareholder over Power Grids decision "
    },
    {
        "content": "ZURICH  Sept 29 ABB looks likely to tell investors next week that it wants to hang on to its Power Grids business  putting the Swiss engineering group at odds with some shareholders who want it to be spun off.",
        "date": "09292016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "REFILE-ABB likely to clash with shareholder over Power Grids decision "
    },
    {
        "content": "VIENNA  Sept 18 ** Swiss engineering group ABB  has decided to keep its Power Grids division  which was put under review last year  weekly SonntagsZeitung said on Sunday citing a source at the company's headquarters.",
        "date": "09182016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB to keep its Power Grids business -Sonntagszeitung "
    },
    {
        "content": "ZURICH ABB  is selling its high-voltage cabling business to NKT Cables  in a deal worth 836 million euros ($932 million)  the first fruit of the Swiss power and automation company's review of its massive Power Grids division.",
        "date": "09212016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB sells Power Grid's cable business to NKT in $932 million deal "
    },
    {
        "content": "ZURICH  Sept 21 ABB is selling its high-voltage cabling business to NKT Cables in a deal worth 836 million euros ($932 million)  the first fruit of the Swiss power and automation company's review of its massive Power Grids division.",
        "date": "09212016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "UPDATE 1-ABB sells Power Grid's cable business to NKT in $932 mln deal "
    },
    {
        "content": "ZURICH  Sept 21 Swiss power and automation group ABB is selling its high-voltage cable business to NKT Cables in a deal with an enterprise value of 836 million euros ($930 million)  part of a strategic review of its Power Grids division.",
        "date": "09212016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB sells Power Grid's cable business to NKT in 836 mln euro deal "
    },
    {
        "content": "ZURICH  Sept 16 ABB's board will discuss the future of its Power Grids division next week as investors ramp up pressure on the Swedish-Swiss technology group to spin off the $11.6 billion business.",
        "date": "09162016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB board to discuss future of Power Grids business next week "
    },
    {
        "content": "ZURICH  Sept 13 ABB spinning off its Power Grids unit into a separate business with its own listing would increase the value of shareholder's investment by more than 60 percent  a spokesman for activist shareholder Cevian Capital said on Tuesday.",
        "date": "09132016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "Cevian says ABB Power Grid spin-off would up value of shareholders' investment "
    },
    {
        "content": "STOCKHOLM  Sept 15 ABB must come up with convincing reasons to keep the company's power grids division when it updates shareholders on the business next month  another of the group's largest investors said  adding to pressure on the group to break up.",
        "date": "09152016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "Nordea wants reasons for ABB to keep Power Grids business "
    },
    {
        "content": "ZURICH/NEW YORK  Sept 14 Pressure on ABB Group  to turn around its performance grew on Wednesday  as another investor said the Swedish-Swiss conglomerate should separate one of its divisions.",
        "date": "09142016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "UPDATE 2-ABB investors ramp up pressure for Power Grids spinoff "
    },
    {
        "content": "NEW YORK  Sept 14 Another shareholder of Zurich-based conglomerate ABB has called for the company to spin off its Power Grids division  in an effort to streamline the company to improve its stock price.",
        "date": "09142016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB shareholder Artisan pushes for spin-off of Power Grids "
    },
    {
        "content": "ZURICH  Sept 14 Cevian's stake in ABB  has risen to 6.2 percent  according to a filing to the U.S Securities and Exchange Commission  as the activist investor steps up its campaign for the Swiss company to separate its Power Grids business.",
        "date": "09142016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "Activist investor Cevian's ABB stake rises to 6.2 percent "
    },
    {
        "content": "The following stocks may be affected by newspaper reports and other factors on Wednesday:",
        "date": "09072016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "NORDIC STOCKS - Factors to watch on Sept 7 "
    },
    {
        "content": "ZURICH ABB has appointed Guido Jouret as its first chief digital officer  a move designed to ramp up the Swiss power and automation company's efforts in digital technology and the internet of things.",
        "date": "09052016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB names Nokia executive Jouret first chief digital officer "
    },
    {
        "content": "ZURICH  Sept 5 ABB has appointed Guido Jouret as its first chief digital officer  a move designed to ramp up the Swiss power and automation company's efforts in digital technology and the internet of things.",
        "date": "09052016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "UPDATE 1-ABB names Nokia exec Jouret first chief digital officer "
    },
    {
        "content": "ZURICH  Sept 5 ABB said on Monday it was appointing Guido Jouret as its first chief digital officer  a move designed to ramp up the power and automation company's efforts in digital technology and the internet of things.",
        "date": "09052016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB appoints Guido Jouret as its first chief digital officer "
    },
    {
        "content": "* Says wins orders of over $300 million for world's first 1 100 kv uhvdc power link in china  Source text for Eikon:  Further company coverage:    (Reporting By Zurich newsroom)",
        "date": "07192016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "BRIEF-ABB wins over $300 mln orders for power link in China "
    },
    {
        "content": "ZURICH Swiss engineering group ABB  is making good progress with its turnaround plan  it said on Thursday  although the environment remains challenging and sales and new orders fell in the second quarter.",
        "date": "07212016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB makes progress on turnaround plan in challenging environment "
    },
    {
        "content": "* Analysts highlight improvement in profitability  shares rise   (Adds detail  analyst comments  share price reaction)",
        "date": "07212016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "UPDATE 2-ABB makes progress on turnaround plan in challenging environment "
    },
    {
        "content": "* ABB CEO Spiesshofer says brexit  turkey  france have dampened european momentum",
        "date": "07212016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB CEO says will deliver result of powergrid review in 2016 "
    },
    {
        "content": "ZURICH  July 21 Industrial robot maker ABB  on Thursday reported earnings in line with expectations during its second quarter as the power equipment and automation company pressed ahead with its turnaround plan.",
        "date": "07212016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB Q2 profit in line  sees uncertain markets "
    },
    {
        "content": "ZURICH Power and automation company ABB Ltd  has dismissed reports it could buy German robot maker Kuka   the Swiss company's chief executive  Ulrich Spiesshofer  wrote in a memo to staff.",
        "date": "06242016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "Talk of ABB bid for Kuka 'pure speculation': CEO memo "
    },
    {
        "content": "ZURICH  June 24 Power and automation company ABB Ltd has dismissed reports it could buy German robot maker Kuka  the Swiss company's chief executive  Ulrich Spiesshofer  wrote in a memo to staff.",
        "date": "06242016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "Talk of ABB bid for Kuka \"pure speculation\" - CEO memo "
    },
    {
        "content": "ZURICH Switzerland's ABB Ltd  has hired a former Siemens  executive to run a division that makes robots  motors and generators and whose profit margins have shrunk for five straight quarters amid sluggish demand for its products.",
        "date": "06132016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB hires ex-Siemens man to lead automation division "
    },
    {
        "content": "ZURICH  June 13 Switzerland's ABB Ltd  has hired a former Siemens executive to run a division that makes robots  motors and generators and whose profit margins have shrunk for five straight quarters amid sluggish demand for its products.",
        "date": "06132016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "UPDATE 3-ABB hires ex-Siemens man to lead automation division "
    },
    {
        "content": "ZURICH  June 13 ABB Ltd poached a Siemens executive as it shakes up its automation division  where profit margins have shrunk amid sluggish demand for the unit's motors  drives and factory robots.",
        "date": "06132016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB poaches Siemens exec in shake-up at robotics division "
    },
    {
        "content": "* Says Eric Varvel appointed global head of asset management at Credit Suisse",
        "date": "05102016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "BRIEF-Credit Suisse appoints Eric Varvel as Head of Asset Management "
    },
    {
        "content": "* Says has priced the 700 million euro 7-year bond transaction it launched earlier today",
        "date": "04252016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "BRIEF-ABB says bonds carry a coupon of 0.625 percent "
    },
    {
        "content": "* Says ABB and Aker Solutions join forces to propel and power subsea production",
        "date": "04272016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "BRIEF-Abb says join forces with Aker for subsea production "
    },
    {
        "content": "* Chairman Peter Voser says the company will present a 'first-draft' of its concept for Power Grids on Oct. 4  after a strategic review that the company has said could result in its sale  listing on a stock exchange  or potentially retaining the business while selling parts of it.  Source text for Eikon:  Further company coverage:    (Reporting by John Miller)",
        "date": "04212016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "BRIEF-Abb chairman says to present 'first-draft' of Power Grids concept on Oct 4 "
    },
    {
        "content": "* Says wins orders worth more than $300 million to supply advanced converter transformers for two long-distance ultra-high-voltage direct current (UHVDC) transmission links capable of transporting up to 10 000 MW of power at the 800 kV voltage level  setting a new world record in terms of capacity",
        "date": "04182016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "BRIEF-ABB says wins orders worth over $300 million for China's power grid "
    },
    {
        "content": "VIENNA  April 23 The Power Grids unit of Swiss engineer ABB  which currently is under strategic review  had been \"brought into shape\" and was \"back within the margin target corridor\"  chairman Peter Voser said in an interview published by daily Neue Zuercher Zeitung on Saturday.",
        "date": "04232016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "REFILE-ABB chairman says Power Grids unit back in shape "
    },
    {
        "content": "ZURICH  April 20 Three shareholder advisory firms oppose plans by ABB to appoint Frederico Fleury Curado to its board  saying his existing positions at listed companies would leave him too little time to devote to the Swiss engineer.",
        "date": "04202016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "Three shareholder advisory firms oppose ABB board candidate Curado "
    },
    {
        "content": "ZURICH  April 21 Shareholders of Swiss electrical engineering group ABB elected Brazilian executive Frederico Fleury Curado to the board of directors on Thursday despite opposition from three shareholder advisory firms.",
        "date": "04212016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB shareholders elect Curado to board member despite opposition "
    },
    {
        "content": "* CEO Ulrich Spiesshofer says aims to get as close as possible to revenue growth targets this year of 3-6 percent growth in local currencies",
        "date": "04202016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB CEO says Brexit has not hit orders  sticks to growth target "
    },
    {
        "content": "* Shares rise 4 percent   (Recasts story to focus on Europe  cost cuts)",
        "date": "04202016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "UPDATE 2-ABB says Europe demand helping to offset China slump "
    },
    {
        "content": "* Chief Executive Officer Ulrich Spiesshofer says does not see changes in China market conditions 'for better or for worse'",
        "date": "04202016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "BRIEF-ABB CEO says Brazil remains a 'very difficult market' "
    },
    {
        "content": "ZURICH  April 20 Power grids maker ABB  said first-quarter net profit fell less than analysts had forecast as the company's automation products and services weathered a slump amid low oil prices and weak demand from China.",
        "date": "04202016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "ABB Q1 net beats forecast  to make Power Grids review in October "
    },
    {
        "content": "ZURICH  March 31 Swiss technology group ABB  has won an order worth more than $250 million from Danish energy company DONG Energy to deliver a high-voltage cable system connecting the Hornsea Project One offshore wind farm in the North Sea to Britain's mainland grid  it said on Thursday.",
        "date": "03312016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "ABB wins $250 mln order to link offshore wind farm to UK grid "
    },
    {
        "content": "BEIJING  March 31 China's biggest power transmission company has signed deals with three Asia-Pacific investors to help push its ambition to build a cross-border energy super grid that will help combat climate change  integrate renewable energy sources and boost exports.",
        "date": "03312016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "China eyes export opportunities for global super grid "
    },
    {
        "content": "ZURICH ABB's  second-biggest shareholder  activist investor Cevian  has hired Boston Consulting Group to study a potential break-up of the Swiss engineering group  turning up the pressure for a revamp  Germany's Manager Magazin reported.",
        "date": "03162016",
        "name": "ABB Ltd",
        "news_type": "topStory",
        "symbol": "ABB",
        "title": "Cevian asks consultant to study potential ABB break-up: Manager Magazin "
    },
    {
        "content": "ZURICH  March 16 ABB's second-biggest shareholder  activist investor Cevian  has hired Boston Consulting Group to study a potential break-up of the Swiss engineering group  turning up the pressure for a revamp  Germany's Manager Magazin reported.",
        "date": "03162016",
        "name": "ABB Ltd",
        "news_type": "normal",
        "symbol": "ABB",
        "title": "CORRECTED-Cevian asks consultant to study potential ABB break-up -Manager Magazin "
    }
]