[
    {
        "content": "AbbVie Inc on Thursday renewed a motion asking a federal judge to throw out a $140 million jury verdict in a lawsuit alleging the company misrepresented the risk of its testosterone drug AndroGel.",
        "date": "11042017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie continues to push for reversal of latest AndroGel verdict "
    },
    {
        "content": "* AbbVie Inc says ‍Health Canada has approved inclusion of Nail Psoriasis data in Humira product monograph​ Source text for Eikon: Further company coverage:",
        "date": "10252017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie says ‍Health Canada approved inclusion of nail Psoriasis data in humira product monograph​ "
    },
    {
        "content": "* Cerveau Technologies Inc signs license and supply agreement with AbbVie for Novel Tau imaging agent",
        "date": "10232017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Cerveau Technologies signs agreement with AbbVie for Novel Tau imaging agent "
    },
    {
        "content": "Oct 24 U.S. drugmaker AbbVie is betting on the potential of the body's immune system to fight Alzheimer's by signing a drug development deal worth more than $200 million with unlisted biotech company Alector.",
        "date": "10242017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie bets on Alzheimer's immunotherapy with big biotech deal "
    },
    {
        "content": "* Alector and AbbVie announce collaboration to advance a novel class of immune therapies for patients with Alzheimer's disease",
        "date": "10242017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Alector and AbbVie announce collaboration "
    },
    {
        "content": "* AbbVie CEO  on conf call  says we need to see HCV market sort itself out",
        "date": "10272017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie  on conf call  says we need to see HCV market sort itself out "
    },
    {
        "content": "* Abbvie and Harpoon Therapeutics announce immuno-oncology research collaboration",
        "date": "10182017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie and harpoon therapeutics announce immuno-oncology research collaboration "
    },
    {
        "content": "AbbVie Inc  forecast its flagship drug Humira to bring $21 billion in sales by 2020  about $3 billion higher than its expectation two years ago  driving the U.S. drugmaker's shares up 4 percent on Friday.",
        "date": "10272017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie says Humira sales will balloon to $21 billion in 2020  shares rise "
    },
    {
        "content": "* Shares up 4 percent (Adds analyst comment  updates share price)",
        "date": "10272017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 2-AbbVie says Humira sales will balloon to $21 bln in 2020  shares rise "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.71 per share Source text for Eikon: Further company coverage:",
        "date": "10272017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie increases quarterly dividend by 11 percent "
    },
    {
        "content": "Oct 27 AbbVie Inc on Friday forecast its flagship drug Humira to bring $21 billion in sales by 2020  about $3 billion higher than its expectation two years ago.",
        "date": "10272017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie says Humira sales will balloon to $21 bln in 2020 "
    },
    {
        "content": "* Abbvie receives U.S. FDA priority review for Investigational Oral Treatment Elagolix for the management of Endometriosis with associated pain",
        "date": "10272017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie receives U.S. FDA priority review for investigational Oral Treatment Elagolix "
    },
    {
        "content": "* AbbVie and Turnstone Biologics announce global collaboration on viral immunotherapies in oncology",
        "date": "10102017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie and Turnstone Biologics announce global collaboration on viral immunotherapies in oncology "
    },
    {
        "content": "A federal appeals court on Thursday upheld the dismissal of a class action lawsuit accusing AbbVie Inc and Abbott Laboratories of violating federal racketeering laws by promoting the drug Depakote for off-label uses.",
        "date": "10122017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie  Abbott duck Depakote off-label marketing case on appeal "
    },
    {
        "content": "Oct 12 The Trump Administration threw its support behind a public-private partnership with 11 drug companies to advance a new class of drugs that uses the body's immune system to fight cancer.",
        "date": "10122017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "REFILE-UPDATE 1-US NIH  11 drugmakers partner to accelerate cancer therapy research "
    },
    {
        "content": "A U.S. jury on Thursday ordered AbbVie Inc to pay more than $140 million to a man who claimed the company misrepresented the risks of its testosterone replacement drug AndroGel  causing him to suffer a heart attack  the plaintiff's lawyer said in a statement.",
        "date": "10052017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Second U.S. jury finds AbbVie misrepresented risks of AndroGel "
    },
    {
        "content": "Oct 5 A U.S. jury on Thursday ordered AbbVie Inc to pay more than $140 million to a man who claimed the company misrepresented the risks of its testosterone replacement drug AndroGel  causing him to suffer a heart attack  the plaintiff's lawyer said in a statement.",
        "date": "10052017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-Second U.S. jury finds AbbVie misrepresented risks of AndroGel "
    },
    {
        "content": "Oct 5 A U.S. jury on Thursday ordered AbbVie Inc to pay more than $140 million to a man who claimed the company misrepresented the risks of its testosterone replacement drug AndroGel  causing him to suffer a heart attack  the plaintiff's lawyer said in an emailed statement.",
        "date": "10052017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie hit with $140 mln verdict in AndroGel trial -lawyer "
    },
    {
        "content": "* Enanta announces that Abbvie’s Maviret (glecaprevir/pibrentasvir) received approval in Japan for the treatment of all major genotypes (GT1-6) of chronic hepatitis c",
        "date": "09272017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Enanta says Abbvie’s Maviret approved in Japan for the treatment of all major genotypes of chronic hepatitis c "
    },
    {
        "content": "* AbbVie announces approval of Maviret (glecaprevir/pibrentasvir) for the treatment of chronic hepatitis C in all major genotypes (GT1-6) in Japan",
        "date": "09272017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie announces approval of Maviret for chronic hepatitis C treatment in Japan "
    },
    {
        "content": "Amgen Inc has reached a settlement with AbbVie Inc that will delay the U.S. launch of Amgen's cheaper biosimilar version of AbbVie's cash cow  the blockbuster rheumatoid arthritis drug Humira  until Jan. 31  2023.",
        "date": "09282017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie  Amgen settlement sets Humira U.S. biosimilar launch for 2023 "
    },
    {
        "content": "* AbbVie and Bristol-Myers Squibb announce clinical research collaboration to evaluate a therapeutic regimen in advanced solid tumors",
        "date": "09222017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie and Bristol-Myers Squibb announce clinical research collaboration to evaluate a therapeutic regimen in advanced solid tumors "
    },
    {
        "content": "* Amgen and AbbVie agree to settlement allowing commercialization of Amgevita",
        "date": "09282017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Amgen and AbbVie agree to settlement allowing commercialization of Amgevita "
    },
    {
        "content": "* adds to aa  british land  ip group   lloyds-monthly update Further company coverage:",
        "date": "09152017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Woodford equity income fund sells Abbvie holding-monthly update "
    },
    {
        "content": "The Federal Trade Commission on Friday cleared a major hurdle in its civil antitrust case alleging Abbvie Inc used frivolous lawsuits to block generic versions of its testosterone gel AndroGel from getting to market.",
        "date": "09192017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "FTC clears hurdle in antitrust case against Abbvie over 'pay for delay' deal "
    },
    {
        "content": "* AbbVie announces positive topline results from phase 3 trial evaluating Venclexta™/Venclyxto™ (Venetoclax) tablets in combination with Rituxan® (Rituximab) for the treatment of patients with relapsed/refractory chronic lymphocytic Leukemia",
        "date": "09182017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie announces positive topline results from phase 3 trial evaluating Venclexta/Venclyxto tablets in combination with Rituxan "
    },
    {
        "content": "AbbVie Inc said on Monday two patients died in a late-stage trial of its rheumatoid arthritis drug but that the deaths were not linked to the drug  which met the study's main goals.",
        "date": "09112017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie says deaths in arthritis trial not linked to drug "
    },
    {
        "content": "* Says ‍board of directors of Abbvie Inc declared a quarterly cash dividend of $0.64 per share​",
        "date": "09082017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie Inc says sets quarterly cash dividend of $0.64/shr "
    },
    {
        "content": "* Abbvie submits new drug application to U.S. FDA for investigational oral treatment Elagolix for the management of endometriosis with associated pain",
        "date": "09062017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie submits NDA to U.S. FDA for investigational oral treatment Elagolix for management of endometriosis with associated pain "
    },
    {
        "content": "* Coherus Biosciences provides update on ‘619 IPR institution decision",
        "date": "09072017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Coherus Biosciences says ‍PTAB denied 4 petitions for inter partes review of Abbvie's patent "
    },
    {
        "content": "Sept 11 AbbVie Inc said on Monday two patients died in a late-stage trial of its rheumatoid arthritis drug but that the deaths were not linked to the drug  which met the study's main goals.",
        "date": "09112017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 2-AbbVie says deaths in arthritis trial not linked to drug "
    },
    {
        "content": "Sept 7 AbbVie Inc said on Thursday its experimental drug to treat adults with moderate-to-severe eczema met the main goal in a mid-stage study  dragging down shares of rival U.S. biotech firm Regeneron Pharmaceuticals Inc.",
        "date": "09072017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie's positive eczema study drags down Regeneron's shares "
    },
    {
        "content": "Sept 11 AbbVie Inc said on Monday two patients died in a late-stage trial testing its drug to treat patients with moderate to severe rheumatoid arthritis.",
        "date": "09112017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie reports two patient deaths in rheumatoid arthritis study "
    },
    {
        "content": "* Abbvie's upadacitinib (abt-494) meets primary endpoint in phase 2b study in atopic dermatitis",
        "date": "09072017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie's upadacitinib meets primary endpoint in phase 2b study in atopic dermatitis "
    },
    {
        "content": "* AbbVie's upadacitinib (ABT-494) meets all primary and ranked secondary endpoints in second phase 3 study in rheumatoid arthritis",
        "date": "09112017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie's upadacitinib meets all primary and ranked secondary endpoints "
    },
    {
        "content": "* INVENTIVA AND ABBVIE EXTEND AGREEMENT TO DISCOVER NEW POTENT ORALLY-AVAILABLE SMALL MOLECULE RORΓ INVERSE AGONIST DRUG CANDIDATES",
        "date": "09042017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Inventiva and AbbVie extend agreement "
    },
    {
        "content": "* Abbvie Inc - HUMIRA will now be reimbursed in British Columbia  Ontario  New Brunswick  Newfoundland and Labrador  Saskatchewan and Yukon",
        "date": "08292017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie says HUMIRA will now be reimbursed in British Columbia  Ontario  New Brunswick  Newfoundland  Labrador  Saskatchewan  Yukon "
    },
    {
        "content": "Aug 24 Biogen Inc's version of AbbVie Inc's blockbuster arthritis drug Humira has been approved by European Union regulators  Biogen and joint venture partner Samsung Biologics said on Thursday.",
        "date": "08252017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "Samsung  Biogen version of AbbVie's Humira approved in Europe "
    },
    {
        "content": "Aug 24 A biosimilar version of AbbVie Inc's blockbuster arthritis drug Humira  produced by a joint venture of Biogen Inc and Samsung Biologics   was approved by European Union regulators  the partners said on Thursday.",
        "date": "08252017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-Samsung  Biogen version of AbbVie's Humira approved in Europe "
    },
    {
        "content": "* Abbvie's Maviret approved by Health Canada for the treatment of chronic hepatitis C in all major genotypes Source text for Eikon: Further company coverage:",
        "date": "08172017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie's Maviret approved by Health Canada for the treatment of chronic hepatitis C in all major genotypes "
    },
    {
        "content": "The U.S. Food and Drug Administration on Thursday approved AbbVie Inc's drug to treat certain adults with chronic hepatitis C.",
        "date": "08032017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "FDA approves AbbVie's hepatitis C drug "
    },
    {
        "content": "* This request has been approved by the Board of Directors of Euronext Paris SA",
        "date": "07312017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "REFILE-BRIEF-AbbVie to delist from Euronext Paris "
    },
    {
        "content": "* U.S. FDA- FDA granted the application priority review  breakthrough therapy designations  granted approval of Mavyret to Abbvie Inc ‍​ Source text : (http://bit.ly/2vxrKo3) Further company coverage:",
        "date": "08032017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-U.S. FDA says approved Abbvie's Mavyret for Hepatitis C "
    },
    {
        "content": "July 26 Gilead Sciences Inc on Wednesday reported lower second-quarter profits as use of its flagship hepatitis C drugs continued to decline  but the results still beat Wall Street estimates and the company raised its full-year sales outlook.",
        "date": "07262017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 2-Gilead Sciences profit falls  but beats Wall Street estimates "
    },
    {
        "content": "July 28 AbbVie Inc said on Friday it had received European approval to market its drug for treatment of all six major forms of hepatitis C.",
        "date": "07282017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie's drug for all types of hepatitis C wins EU approval "
    },
    {
        "content": "NEW YORK A federal jury in Chicago on Monday found AbbVie Inc fraudulently misrepresented the risks of its testosterone replacement drug AndroGel and ordered the drugmaker to pay $150 million in punitive damages.",
        "date": "07242017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "U.S. jury finds AbbVie liable for misrepresentation in AndroGel verdict "
    },
    {
        "content": "* European Commission grants Abbvie's Maviret (glecaprevir/pibrentasvir) marketing authorization for the treatment of Chronic Hepatitis C in all major genotypes (GT1-6)",
        "date": "07282017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-EC grants Abbvie's Maviret marketing authorization for treatment of Chronic Hepatitis C "
    },
    {
        "content": "NEW YORK  July 24 A federal jury in Chicago on Monday found AbbVie Inc fraudulently misrepresented the risks of its testosterone replacement drug AndroGel and ordered the drugmaker to pay $150 million in punitive damages.",
        "date": "07242017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 2-U.S. jury finds AbbVie liable for misrepresentation in AndroGel verdict "
    },
    {
        "content": "AbbVie Inc's  said it would be cautious with drug pricing  especially for Humira  the world's biggest selling drug  sending its shares down 2 percent  despite the drugmaker's quarterly profit narrowly beating estimates.",
        "date": "07282017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie to remain cautious on drug pricing  shares fall "
    },
    {
        "content": "NEW YORK  July 24 A federal jury in Chicago on Monday found AbbVie Inc fraudulently misrepresented the risks of its testosterone replacement drug AndroGel and ordered the drugmaker to pay $150 million in punitive damages.",
        "date": "07242017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "U.S. jury finds AbbVie liable for misrepresentation in first AndroGel verdict "
    },
    {
        "content": "* Co reiterates 2017 adjusted profit forecast (Adds conference call details  shares)",
        "date": "07282017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 3-AbbVie to remain cautious on drug pricing  shares fall "
    },
    {
        "content": "A federal judge has rejected AbbVie Inc's bid to overturn a $15 million verdict for a 10-year-old boy whose mother blamed his birth defect on its bipolar disorder drug Depakote  which she took while she was pregnant.",
        "date": "07202017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie loses bid to overturn $15 million Depakote injury verdict "
    },
    {
        "content": "* Abbvie CFO: humira u.s. Sales increased 18 percent compared to the prior year  driven by low double-digit prescription growth plus price.",
        "date": "07282017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie CEO says \"big\" M&A is something that is not fundamental to their strategy "
    },
    {
        "content": "ZURICH  July 28 Roche Holding AG's Venclexta has won breakthrough therapy designation in acute myeloid leukaemia (AML) from the U.S. Food and Drug Administration  the Swiss drugmaker said on Friday.",
        "date": "07282017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "Roche leukaemia drug gets FDA breakthrough therapy designation "
    },
    {
        "content": "July 28 U.S. drugmaker AbbVie Inc reported an 18.9 percent rise in quarterly profit on Friday on strong demand for its flagship rheumatoid arthritis drug  Humira.",
        "date": "07282017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie's profit rises 19 pct on Humira demand "
    },
    {
        "content": "* CytomX achieves development milestone in strategic oncology collaboration with AbbVie for CD71-targeting probody drug conjugate",
        "date": "06292017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-CytomX achieves development milestone in collaboration with AbbVie "
    },
    {
        "content": "* Abbvie Inc says declared a quarterly cash dividend of $0.64 per share Source text for Eikon: Further company coverage:",
        "date": "06222017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie sets quarterly cash dividend of $0.64 per share "
    },
    {
        "content": "* EU Medicines Agency recommends approval of Merck KGAA multiple sclerosis drug",
        "date": "06232017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-EU medicines agency recommends approval of Aveo's kidney cancer drug "
    },
    {
        "content": "* Enanta announces that abbvie receives chmp positive opinion for maviret™ (glecaprevir/pibrentasvir) for the treatment of chronic hepatitis c in all major genotypes (gt1-6)",
        "date": "06232017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Enanta announces that AbbVie receives CHMP positive opinion for MAVIRET "
    },
    {
        "content": "* EU Medicines Agency recommends approval of Merck KGAA multiple sclerosis drug",
        "date": "06232017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-EMA recommends approval of Merck's multiple sclerosis drug "
    },
    {
        "content": "* AbbVie and Principia announce collaboration on oral immunoproteasome inhibitors",
        "date": "06132017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie and Principia to collaborate on oral immunoproteasome inhibitors "
    },
    {
        "content": "A mistrial was declared on Monday in the first case to go to trial out of thousands of lawsuits claiming AbbVie Inc failed to warn of the risk that its testosterone-replacement therapy AndroGel could cause heart attacks  strokes and other injuries.",
        "date": "06122017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "First bellwether over AbbVie's AndroGel ends in mistrial "
    },
    {
        "content": "A federal jury on Friday awarded $15 million to a 10-year-old boy whose mother blamed his birth defect on AbbVie Inc's  bipolar disorder drug Depakote that she took while pregnant  in the latest trial among hundreds of lawsuits over the product.",
        "date": "06092017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie must pay $15 million in Depakote birth-defect trial: jury "
    },
    {
        "content": "June 9 A federal jury on Friday awarded $15 million to a 10-year-old boy whose mother blamed his birth defect on AbbVie Inc's bipolar disorder drug Depakote that she took while pregnant  in the latest trial among hundreds of lawsuits over the product.",
        "date": "06092017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 2-AbbVie must pay $15 mln in Depakote birth-defect trial: jury "
    },
    {
        "content": "A federal jury on Friday awarded $15 million to a California woman who blamed her son's birth defects on AbbVie Inc's bipolar disorder drug Depakote  in the latest trial to spill out of lawsuits over the product.",
        "date": "06092017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "Woman awarded $15 mln from AbbVie after suing over Depakote drug "
    },
    {
        "content": "AbbVie Inc said on Wednesday its oral rheumatoid arthritis drug succeeded in a late-stage study on patients who had not adequately responded to standard treatments.",
        "date": "06072017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie's rheumatoid arthritis drug succeeds in trial "
    },
    {
        "content": "June 9 A federal jury on Friday awarded $15 million to a California woman who blamed her son's birth defects on AbbVie Inc's bipolar disorder drug Depakote  in the latest trial to spill out of hundreds of lawsuits over the drug.",
        "date": "06092017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie suffers $15 million loss in Depakote birth-defect trial "
    },
    {
        "content": "* Upadacitinib  a JAK inhibitor  more effective than a placebo",
        "date": "06072017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "CORRECTED-UPDATE 3-AbbVie's rheumatoid arthritis drug succeeds in trial "
    },
    {
        "content": "* Synlogic says has completed first phase of its ongoing collaboration with AbbVie",
        "date": "06072017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Synlogic says has completed 1st phase of AbbVie collaboration "
    },
    {
        "content": "* Long-term Imbruvica (Ibrutinib) efficacy and safety data at ASCO 2017 show sustained survival rates in up to four years in previously-treated chronic lymphocytic leukemia/small lymphocytic lymphoma (CLL/SLL) patients  including those with high-risk disease",
        "date": "06052017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie presents long-term data on cancer drug Imbruvica at ASCO "
    },
    {
        "content": "AbbVie Inc is set to face its first trial in thousands of lawsuits pending in federal court claiming the company failed to warn of the risk that its testosterone-replacement therapy AndroGel could cause heart attacks  strokes and other injuries.",
        "date": "06022017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie faces first trial in federal AndroGel injury litigation "
    },
    {
        "content": "* AbbVie's upadacitinib (ABT-494) meets all primary and ranked secondary endpoints in phase 3 study in rheumatoid arthritis",
        "date": "06072017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie's upadacitinib meets all primary  ranked secondary endpoints in phase 3 study "
    },
    {
        "content": "June 7 U.S. drugmaker AbbVie Inc said on Wednesday its drug to treat moderate-to-severe rheumatoid arthritis met the main goal in a late-stage study.",
        "date": "06072017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie's rheumatoid arthritis drug succeeds in late-stage trial "
    },
    {
        "content": "* Says received U.S. Food & drug administration (FDA) approval for fenofibric acid delayed-release capsules Source text for Eikon: Further company coverage:",
        "date": "05152017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Alembic Pharma gets FDA nod for generic version of Abbvie's Trilipix "
    },
    {
        "content": "* Aquinnah Pharmaceuticals receives $10 million investment from Pfizer and Abbvie to research breakthrough approach to neurodegenerative disease",
        "date": "04252017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Aquinnah receives $10 mln investment from Pfizer  Abbvie "
    },
    {
        "content": "AbbVie Inc reported a bigger-than-expected quarterly profit  lifted by demand for its flagship drug  Humira  and called President Donald Trump's tax plan \"encouraging\".",
        "date": "04272017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie profit beats on Humira demand; cheers Trump tax plan "
    },
    {
        "content": "* Shares rise as much as 3.8 pct (Adds conference call details  analyst comments; updates shares)",
        "date": "04272017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 3- AbbVie profit beats on Humira demand; cheers Trump tax plan "
    },
    {
        "content": "* Reaffirms fy 2017 gaap earnings per share view $4.55 to $4.65",
        "date": "04272017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie Q1 adjusted earnings per share $1.28 "
    },
    {
        "content": "* Enanta announces eight weeks of treatment with Abbvie's investigational  pan-genotypic  ribavirin-free HCV regimen of glecaprevir/pibrentasvir (g/p) achieved high SVR rates in challenging-to-treat genotype 3 chronic HCV patients",
        "date": "04212017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Enanta announces eight weeks of treatment with Abbvie's investigational drug achieved high SVR rates in challenging-to-treat genotype 3 chronic HCV patients "
    },
    {
        "content": "April 27 AbbVie Inc reported a 26.4 percent jump in quarterly profit on Thursday  helped by higher demand for its top-selling treatment  Humira.",
        "date": "04272017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "Drugmaker AbbVie's profit rises 26.4 pct "
    },
    {
        "content": "April 19 AbbVie Inc said on Wednesday that its cancer drug  veliparib  failed to meet the main goals of two late-stage studies.",
        "date": "04192017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie cancer drug fails two late-stage trials "
    },
    {
        "content": "April 19 AbbVie Inc said on Wednesday that its experimental cancer drug  veliparib  failed to meet the main goals of two late-stage studies.",
        "date": "04192017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-AbbVie cancer drug fails two late-stage trials "
    },
    {
        "content": "* Receives first preclinical milestone payment in abbvie collaboration",
        "date": "04132017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Argen X receives first preclinical milestone payment in Abbvie collaboration "
    },
    {
        "content": "AbbVie Inc has urged a federal appeals court to uphold a lower court order banning sales of Sanofi SA and Regeneron Pharmaceuticals Inc's cholesterol drug Praluent after Amgen Inc won a patent lawsuit against them.",
        "date": "03312017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie urges court to uphold ban on cholesterol drug sales "
    },
    {
        "content": "* U.S. FDA approves addition of moderate to severe fingernail psoriasis data to Abbvie's Humira (adalimumab) prescribing information",
        "date": "03302017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-U.S. FDA approves addition of moderate to severe fingernail psoriasis data to Abbvie's humira "
    },
    {
        "content": "* Abbvie and M2Gen announce new collaboration for the oncology research information exchange network® (orien) avatar research program  Source text for Eikon:  Further company coverage:",
        "date": "03282017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie and M2Gen announce new collaboration "
    },
    {
        "content": "* Abbvie granted priority review in Japan for its investigational regimen of Glecaprevir/Pibrentasvir (G/P) for the treatment of all major genotypes of chronic hepatitis c",
        "date": "03142017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie granted priority review in Japan for its investigational regimen of Glecaprevir "
    },
    {
        "content": "* CEO Richard Gonzalez's FY 2016 total compensation  was $21.0 million versus $20.8 million in FY 2015 - sec filing",
        "date": "03202017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie CEO Richard Gonzalez's FY 2016 total compensation was $21 mln "
    },
    {
        "content": "* Shares rise as much as nearly 117 pct to $11.60   (Adds details  updates shares)",
        "date": "03062017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 3-TG Therapeutics' leukemia drug clears key study  shares pop "
    },
    {
        "content": "* CEO Richard Gonzalez's total 2016 compensation was $21 million versus $20.8 million in 2015 - sec filing",
        "date": "03082017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie CEO Richard Gonzalez's total 2016 compensation was $21 mln vs. $20.8 mln in 2015 "
    },
    {
        "content": "* CFO William Chase's 2016 total compensation was $8.8 million versus $7.6 million in 2015",
        "date": "03082017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie's CEO total 2016 compensation was $21 mln - SEC filing "
    },
    {
        "content": "* Enanta announces CHMP grants positive opinion for an eight-week treatment option with Abbvie's Viekirax® (ombitasvir/paritaprevir/ritonavir tablets) + exviera® (dasabuvir tablets) for patients with genotype 1b chronic hepatitis c",
        "date": "02272017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Enanta says CHMP gives positive opinion for AbbVie's hep C treatment for patients with genotype 1B "
    },
    {
        "content": "* Abbvie receives CHMP positive opinion for eight-week treatment option with Viekirax (ombitasvir/paritaprevir/ritonavir tablets) + Exviera (dasabuvir tablets) for patients with genotype 1b chronic hepatitis c",
        "date": "02272017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie receives CHMP positive opinion for eight-week treatment option with Viekirax "
    },
    {
        "content": "* Abbvie announces $5 billion increase to stock repurchase program  Source text for Eikon:  Further company coverage:",
        "date": "02172017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie announces $5 bln increase to stock repurchase program "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.64 per share  Source text for Eikon:  Further company coverage:",
        "date": "02162017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie sets quarterly cash dividend of $0.64 per share "
    },
    {
        "content": "A federal jury in Ohio on Thursday found that drug manufacturers Abbott Laboratories Inc and AbbVie Inc were not responsible for birth defects in a boy whose mother took their antiepileptic drug Depakote while pregnant.",
        "date": "02042017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Jury clears Abbott and AbbVie in Depakote birth defect trial "
    },
    {
        "content": "* Health Canada grants priority review to Abbvie's investigational regimen of Glecaprevir/Pibrentasvir (G/P) for the treatment of chronic hepatitis c in all major genotypes (GT1-6)  Source text for Eikon:  Further company coverage:",
        "date": "02012017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Health Canada grants priority review to Abbvie's investigational regimen of Glecaprevir "
    },
    {
        "content": "* Abbvie initiates phase 2 clinical trial programs for ABBV-8e12  an investigational anti-tau antibody  in early alzheimer's disease and progressive supranuclear palsy  Source text for Eikon:  Further company coverage:",
        "date": "01252017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie initiates phase 2 clinical trial programs for ABBV-8e12 "
    },
    {
        "content": "AbbVie Inc  reported quarterly adjusted revenue that missed analysts' estimates as weaker-than-expected sales of its hepatitis C treatment and cancer therapy overshadowed strong U.S. demand for its flagship drug  Humira.",
        "date": "01272017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie's revenue miss clouds strong Humira U.S. sales "
    },
    {
        "content": "* Says EMA grants accelerated assessment for Abbvie's investigational HCV Regimen Of Glecaprevir/Pibrentasvir",
        "date": "01242017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Enanta pharmaceuticals says EMA grants accelerated assessment for Abbvie's investigational HCV regimen of Glecaprevir/Pibrentasvir "
    },
    {
        "content": "* Shares fall as much as 2.86 pct   (Adds conference call details  analyst comment; updates shares)",
        "date": "01272017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 3-AbbVie's revenue miss clouds strong Humira U.S. sales "
    },
    {
        "content": "* AbbVie says continues to see good Humira growth in international markets despite indirect biosimilar competition: Conf Call",
        "date": "01272017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie says continues to see good Humira growth in international markets despite indirect biosimilar competition - Conf Call "
    },
    {
        "content": "Jan 27 AbbVie Inc reported a 6.2 percent rise in quarterly net revenue  helped by demand for its flagship $15 billion-a-year arthritis treatment  Humira.",
        "date": "01272017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie revenue rises 6.2 pct "
    },
    {
        "content": "* Abbvie reports full-year and fourth-quarter 2016 financial results",
        "date": "01272017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie Inc reports Q4 GAAP earnings per share $0.85 "
    },
    {
        "content": "NEW YORK  Jan 12 Investors in large U.S. pharmaceutical and biotech companies are counting on strong dividends  reasonable stock valuations and new products to help ride out a storm of political uncertainty as the incoming Trump administration dives into healthcare policy.",
        "date": "01122017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "Investors in big pharma  biotech look to ride out Trump storm "
    },
    {
        "content": "AbbVie Inc Chief Executive Richard Gonzalez on Wednesday promised to keep all drug price increases in 2017 under 10 percent  becoming the third global drugmaker to publicly make that pledge.",
        "date": "01112017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie vows to keep drug price increases below 10 percent "
    },
    {
        "content": "Jan 11 AbbVie Inc Chief Executive Richard Gonzalez on Wednesday promised to keep all drug price increases in 2017 under 10 percent  becoming the third global drugmaker to publicly make that pledge.",
        "date": "01112017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie vows to keep drug price increases below 10 pct "
    },
    {
        "content": "* Zebra Biologics Inc. to collaborate with AbbVie to discover new antibody therapeutics.",
        "date": "01092017",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Zebra Biologics Inc. to collaborate with AbbVie to discover new antibody therapeutics "
    },
    {
        "content": "* Abbvie sees 2017 adjusted EPS growth of 13-15 percent - JP Morgan Healthcare Conference",
        "date": "01112017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie sees 2017 adjusted EPS growth 13-15 percent "
    },
    {
        "content": "* Emergent says Pure MHC  AbbVie will embark on research  license deal to discover peptide targets for use with t-cell receptor therapeutics in cancers  Source text for Eikon:  Further company coverage:",
        "date": "01092017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Emergent Tech says Pure MHC  AbbVie to embark on research  license deal "
    },
    {
        "content": "* Abbvie Inc - announced four new collaborations and investments with healthcare companies  Source text for Eikon:  Further company coverage:",
        "date": "01092017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie announces four new collaborations and investments with healthcare companies "
    },
    {
        "content": "* Abbvie - Co  Genomics Medicine Ireland  WuXi NextCODE announce Population Genomics alliance;  financial terms were not disclosed  Source text for Eikon:  Further company coverage:",
        "date": "01092017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie  Genomics Medicine and WuXi NextCODE announce Population Genomics alliance "
    },
    {
        "content": "* Eight weeks of treatment with abbvie's investigational  pan-genotypic  ribavirin-free regimen of glecaprevir/pibrentasvir (G/P) for chronic hepatitis C achieved high SVR rates in genotype 1 Japanese patients",
        "date": "01092017",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie says announces high SVR(12) rates with 8 weeks of treatment with its investigational drug "
    },
    {
        "content": "U.S. biotech Momenta Pharmaceuticals Inc said on Tuesday its experimental biosimilar version of AbbVie Inc's top-selling autoimmune drug  Humira  met the main goal in a late-stage trial involving patients with a form of psoriasis.",
        "date": "11292016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Momenta's Humira biosimilar succeeds in key psoriasis study "
    },
    {
        "content": "Nov 29 U.S. biotech Momenta Pharmaceuticals Inc  said on Tuesday its experimental biosimilar version of AbbVie Inc's top-selling autoimmune drug  Humira  met the main goal in a late-stage trial involving patients with a form of psoriasis.",
        "date": "11292016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-Momenta's Humira biosimilar succeeds in key psoriasis study "
    },
    {
        "content": "* Entered into an underwriting agreement as of November 14 pursuant to which Abbvie has agreed to issue notes to underwriters",
        "date": "11172016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie entered into an underwriting agreement pursuant to which Abbvie has agreed to issue notes to underwriters "
    },
    {
        "content": "* Abbvie's Humira receives CHMP positive opinion to treat adolescents with Hidradenitis Suppurativa  a chronic inflammatory skin disease",
        "date": "11142016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie's Humira\u007f (adalimumab) receives CHMP positive opinion to treat adolescents with Hidradenitis Suppurativa "
    },
    {
        "content": "Nov 11 Drugmaker AbbVie Inc said on Friday its experimental fixed-dose combination to treat certain hepatitis C virus patients achieved high sustained viral response (SVR) rates after eight weeks of treatment.",
        "date": "11112016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie's hepatitis C treatment shows promise "
    },
    {
        "content": "Coherus BioSciences Inc said on Monday the U.S. Patent and Trademark Office denied institution of its petition for a review of the formulation of AbbVie Inc's top-selling Humira rheumatoid arthritis treatment.",
        "date": "11072016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "Coherus says U.S. Patent Office denies Humira patent review "
    },
    {
        "content": "* Coherus biosciences receives decision denying institution of the '166 IPR related to AbbVie's Humira formulation",
        "date": "11072016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Coherus Biosciences receives decision denying institution of '166 IPR related to AbbVie's Humira formulation "
    },
    {
        "content": "* Currently investigating efficacy  safety of Veliparib in combination with chemotherapy or radiation for treatment of advanced Squamous Nsclc",
        "date": "11042016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie receives FDA orphan drug designation for investigational medicine Veliparib "
    },
    {
        "content": "* Abbvie inc - inaugural eur-denominated senior unsecured multi-tranche benchmark transaction to refinance indebtedness will follow",
        "date": "11022016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie announces European fixed income investor meetings "
    },
    {
        "content": "A slowdown in sales of AbbVie Inc's  Humira arthritis treatment sent the drugmaker's shares 6 percent lower on Friday  highlighting the company's heavy reliance on the $15 billion-a-year medicine.",
        "date": "10282016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie's Humira loses momentum  shares plunge "
    },
    {
        "content": "Oct 28 A slowdown in sales of AbbVie Inc's  Humira arthritis treatment sent the drugmaker's shares 6 percent lower on Friday  highlighting the company's heavy reliance on the $15 billion-a-year medicine.",
        "date": "10282016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 3-AbbVie's Humira loses momentum  shares plunge "
    },
    {
        "content": "Oct 28 AbbVie Inc's quarterly revenue jumped 8.2 percent  fueled by higher demand for its flagship treatment  Humira.",
        "date": "10282016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie quarterly revenue rises 8.2 percent "
    },
    {
        "content": "* AbbVie announces positive pivotal phase 3 data demonstrating investigational medicine elagolix reduces menstrual and non-menstrual pelvic pain associated with endometriosis at the American Society for reproductive medicine scientific congress",
        "date": "10192016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie announces positive pivotal phase 3 data for elagolix "
    },
    {
        "content": "AbbVie Inc won the conditional backing of an advisory committee of the European Medicines Agency (EMA) on Friday for a drug to treat a form of blood cancer.",
        "date": "10142016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "EMA committee conditionally approves AbbVie leukemia drug "
    },
    {
        "content": "Oct 14 AbbVie Inc won the conditional backing of an advisory committee of the European Medicines Agency (EMA) on Friday for a drug to treat a form of blood cancer.",
        "date": "10142016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-EMA committee conditionally approves AbbVie leukaemia drug "
    },
    {
        "content": "Oct 14 AbbVie Inc won the conditional backing of an advisory committee of the European Medicines Agency (EMA) on Friday for a drug to treat a form of blood cancer.",
        "date": "10142016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "EMA committee conditionally approves AbbVie leukaemia drug "
    },
    {
        "content": "* EU Medicines Agency recommends approval of Abbvie Inc'S Venetoclax/Venclexta to treat leukaemia",
        "date": "10142016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-EMA recommends conditional approval of Abbvie leukemia drug "
    },
    {
        "content": "* Abbvie's new oral therapy venclexta now available for Canadians with a difficult-to-treat blood cancer",
        "date": "10052016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie Inc - new oral therapy now available for Canadians "
    },
    {
        "content": "* AbbVie's investigational HCV regimen receives U.S. FDA Breakthrough Therapy Designation  Source text for Eikon:  Further company coverage:    ;))",
        "date": "09302016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie's investigational HCV regimen receives FDA Breakthrough Therapy Designation "
    },
    {
        "content": "Sept 26 Johnson & Johnson said on Monday that the U.S. Food and Drug Administration approved the company's blockbuster psoriasis drug  Stelara  for use in adults with Crohn's disease.",
        "date": "09262016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "FDA approves J&J's autoimmune drug Stelara for Crohn's disease "
    },
    {
        "content": "* Its portfolio company BioArctic enters into collaboration with AbbVie for Parkinson's Disease Research",
        "date": "09202016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Karolinska Development: collaboration with AbbVie for Parkinson's Disease Research "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.57per share  Source text for Eikon:  Further company coverage:",
        "date": "09092016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie sets quarterly cash dividend of $0.57per share "
    },
    {
        "content": "Aug 22 Pfizer Inc  beating out numerous other bidders  said it agreed to buy U.S. cancer drug company Medivation Inc for $14 billion in cash  adding its blockbuster prostate cancer drug Xtandi to the company's growing oncology roster.",
        "date": "08222016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 5-Pfizer boosts cancer drug roster with $14 bln Medivation deal "
    },
    {
        "content": "Aug 5 AbbVie Inc said hedge fund Elliott Associates LP has sued the pharmaceuticals company alleging that it had made misrepresentations and omissions related to a failed attempt to buy Dublin-based Shire Plc .",
        "date": "08052016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Elliott Associates sues AbbVie over failed bid for Shire "
    },
    {
        "content": "AbbVie Inc  posted higher-than-expected quarterly profit and revenue  driven by demand for its flagship drug Humira  and raised its earnings forecast for the year.",
        "date": "07292016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Drugmaker AbbVie bumps up profit forecast on strong Humira sales "
    },
    {
        "content": "July 29 AbbVie Inc posted higher-than-expected quarterly profit and revenue  driven by demand for its flagship drug Humira  and raised its earnings forecast for the year.",
        "date": "07292016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 2-Drugmaker AbbVie bumps up profit forecast on strong Humira sales "
    },
    {
        "content": "* Venetoclax is being developed by abbvie and genentech  a member of roche group",
        "date": "07282016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie initiates late stage study of venetoclax in patients with relapsed or refractory multiple myeloma "
    },
    {
        "content": "July 29 AbbVie Inc's quarterly net revenue jumped 17.8 percent  driven by demand for its top-selling treatment  Humira.",
        "date": "07292016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie revenue jumps 17.8 pct on higher demand for drug Humira "
    },
    {
        "content": "* Abbvie receives U.S. FDA approval of once-daily VIEKIRA XR (dasabuvir  ombitasvir  paritaprevir and ritonavir) for the treatment of genotype 1 chronic Hepatitis C",
        "date": "07252016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie receives U.S. FDA approval of once-daily VIEKIRA XR "
    },
    {
        "content": "SEOUL Biosimilars maker Samsung Bioepis  part of South Korea's top family-run conglomerate Samsung Group [SAGR.UL]  said on Monday it is seeking regulatory approval in Europe to sell its copy of AbbVie Inc's rheumatoid arthritis drug Humira.",
        "date": "07182016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Samsung Bioepis seeks Europe approval for its Humira copy "
    },
    {
        "content": "* European Medicines Agency reviewing Samsung Bioepis' application",
        "date": "07182016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-Samsung Bioepis seeks Europe approval for its Humira copy "
    },
    {
        "content": "Ablynx's hopes for a potential multibillion-dollar drug were boosted on Thursday by strong clinical trial results in rheumatoid arthritis  vindicating a $175 million bet placed on the product by U.S. pharma group AbbVie in 2013.",
        "date": "07072016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Blockbuster hopes grow for Ablynx drug backed by AbbVie "
    },
    {
        "content": "* Biogen and AbbVie's once-monthly zinbryta(tm) (daclizumab) approved in European Union for treatment of multiple sclerosis",
        "date": "07052016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Biogen and AbbVie's drug approved in EU "
    },
    {
        "content": "* Biogen and Abbvie's once-monthly Zinbryta\u007f (Daclizumab) approved in European Union for treatment of multiple sclerosis  Source text for Eikon:  Further company coverage:",
        "date": "07052016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Biogen and Abbvie's multiple sclerosis drug approved in EU "
    },
    {
        "content": "* Abbvie announces fourth breakthrough therapy designation granted by the U.S. Food and drug administration (FDA) for ibrutinib (imbruvica) for chronic graft-versus-host-disease (CGVHD)  a rare condition with limited treatment options",
        "date": "06292016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie announces fourth breakthrough therapy designation granted by FDA "
    },
    {
        "content": "* Abbvie Inc reports 17.93 pct passive stake in Reata Pharmaceuticals Inc as of May 25  2016  -  SEC filing  Source text for Eikon: [ID:(http://1.usa.gov/1PeZcPg )] Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06062016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie reports 17.93 pct passive stake in Reata as of May 25 - SEC filing "
    },
    {
        "content": "* Baa2 rating reflects its large scale with a revenues of about $23 billion  its high margins and its strong cash flow",
        "date": "06012016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Moody's downgrades AbbVie to Baa2; stable outlook "
    },
    {
        "content": "* European commission approves imbruvica (ibrutinib) for first-line treatment of patients with chronic lymphocytic leukemia  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05312016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-European Commission approves AbbVie's imbruvica "
    },
    {
        "content": "* IL-23 inhibitor risankizumab induces remission in phase ii study in patients with moderate-to-severe crohn's disease",
        "date": "05242016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie IL-23 Inhibitor Risankizumab induces remission in Phase II Study "
    },
    {
        "content": "The U.S. Food and Drug Administration on Friday approved a once-monthly injection for multiple sclerosis from Biogen Inc and AbbVie Inc  with a boxed warning.",
        "date": "05272016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Biogen  AbbVie once-monthly MS injection wins U.S. approval "
    },
    {
        "content": "May 27 The U.S. Food and Drug Administration on Friday approved a once-monthly injection for multiple sclerosis from Biogen Inc and AbbVie Inc  with a boxed warning.",
        "date": "05272016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-Biogen  AbbVie once-monthly MS injection wins U.S. approval "
    },
    {
        "content": "* AbbVie's Humira receives CHMP positive opinion to treat certain forms of non-infectious uveitis  a disease that can severely impact vision",
        "date": "05272016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie's Humira receives CHMP positive opinion to treat non-infectious uveitis "
    },
    {
        "content": "* Paulson & Co Inc Dissolves Share Stake In Abbvie Inc - Sec filing",
        "date": "05162016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Paulson & Co dissolves in Abbvie  takes in Expedia "
    },
    {
        "content": "May 17 Coherus BioSciences Inc said on Tuesday the U.S. Patent and Trademark office had agreed to review its petition to make a copy of AbbVie Inc's  top-selling artritis drug Humira.",
        "date": "05172016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "Coherus says U.S. Patent Office to review AbbVie's Humira "
    },
    {
        "content": "* \"we are confident in the validity of our patents and will vigorously defend them\"",
        "date": "05172016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie says Humira protected by many patents covering all aspects of manufacture  formulation and indications "
    },
    {
        "content": "AbbVie Inc placed another big bet on new cancer drugs on Thursday with a $5.8 billion acquisition that could lessen its dependence on arthritis treatment Humira  the world's top selling drug.",
        "date": "04282016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie forges deeper into cancer  as clock ticks for Humira "
    },
    {
        "content": "* Abbvie Inc. Corp. Credit rating lowered to 'A-' from 'A' on new acquisition plan; stable outlook  Source (http://bit.ly/1WteRQW) Further company coverage:",
        "date": "04282016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-S&P says Abbvie Credit rating lowered to 'A-' from 'A' "
    },
    {
        "content": "* Action follows the announcement that AbbVie will acquire privately-held Stemcentrx for approximately $5.8 billion in cash and stock",
        "date": "04282016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Moody's reviews AbbVie's BAA1 for downgrade "
    },
    {
        "content": "* CEO says Stemcentrx deal will give company long-desired strong position in solid tumors",
        "date": "04282016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie says deal gives it strong position in solid tumor drugs "
    },
    {
        "content": "April 28 Drugmaker AbbVie Inc said it would buy privately held oncology company Stemcentrx in a deal valued at $5.8 billion in cash and stock.",
        "date": "04282016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie to buy Stemcentrx in $5.8 bln deal "
    },
    {
        "content": "* Abbvie and cytomx announce strategic collaboration for probody drug conjugates",
        "date": "04212016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie and Cytomx announce strategic collaboration "
    },
    {
        "content": "* Argenx and Abbvie to collaborate on ARGX-115 against novel immuno-oncology target",
        "date": "04212016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Argenx and Abbvie to collaborate on ARGX-115 against novel immuno-oncology target "
    },
    {
        "content": "AbbVie has acquired an option on an early-stage immuno-oncology drug from biotech company Argenx  giving the U.S. drugmaker access to a treatment with the potential to block a biological pathway that allows cancers to grow.",
        "date": "04212016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie gets option on early Argenx cancer drug for $40 million "
    },
    {
        "content": "April 21 AbbVie has acquired an option on an early-stage immuno-oncology drug from biotech company Argenx  giving the U.S. drugmaker access to a treatment with the potential to block a biological pathway that allows cancers to grow.",
        "date": "04212016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie gets option on early Argenx cancer drug for $40 mln "
    },
    {
        "content": "An experimental once-daily combination hepatitis C treatment being developed by AbbVie Inc demonstrated very high cure rates across a wide range of disease genotypes  according to data presented on Saturday  likely giving the company a more competitive product if approved.",
        "date": "04162016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "New AbbVie hepatitis C regimen shows high cure rates: studies "
    },
    {
        "content": "April 16 An experimental once-daily combination hepatitis C treatment being developed by AbbVie Inc  demonstrated very high cure rates across a wide range of disease genotypes  according to data presented on Saturday  likely giving the company a more competitive product if approved.",
        "date": "04162016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "New AbbVie hepatitis C regimen shows high cure rates -studies "
    },
    {
        "content": "WASHINGTON AbbVie Inc won U.S. regulatory approval on Monday for a new drug to treat patients with a rare type of chronic lymphocytic leukemia  a blood cancer.",
        "date": "04112016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie/Roche drug gets U.S. approval for a rare type of leukemia "
    },
    {
        "content": "WASHINGTON  April 11 AbbVie Inc won U.S. regulatory approval on Monday for a new drug to treat patients with a rare type of chronic lymphocytic leukemia  a blood cancer.",
        "date": "04112016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-AbbVie/Roche drug gets U.S. approval for a rare type of leukemia "
    },
    {
        "content": "April 6 U.S. drugmaker Pfizer Inc and Ireland-based Allergan Plc walked away from their $160 billion merger on Wednesday  a major win for President Barack Obama  who has been pushing to curb deals in which companies move overseas to cut taxes.",
        "date": "04062016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 3-Pfizer  Allergan scrap $160 bln deal after U.S. tax rule change "
    },
    {
        "content": "NEW YORK U.S. drug maker Pfizer Inc agreed on Tuesday to terminate its $160 billion agreement to acquire Botox maker Allergan Plc  in a major victory to U.S. President Barack Obama's drive to stop tax-dodging corporate mergers.",
        "date": "04062016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "Obama's inversion curbs kill Pfizer's $160 billion Allergan deal "
    },
    {
        "content": "NEW YORK  April 5 U.S. drug maker Pfizer Inc  agreed on Tuesday to terminate its $160 billion agreement to acquire Botox maker Allergan Plc  in a major victory to U.S. President Barack Obama's drive to stop tax-dodging corporate mergers.",
        "date": "04062016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "REFILE-UPDATE 7-Obama's inversion curbs kill Pfizer's $160 bln Allergan deal "
    },
    {
        "content": "* Abbvie receives CHMP positive opinion for Humira (adalimumab) for the treatment of pediatric patients  from six years of age  with moderately to severely active Crohn's Disease",
        "date": "04042016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie receives CHMP positive opinion for Humira "
    },
    {
        "content": "SEOUL  April 4 Samsung Bioepis Co Ltd  which aims to become a force in the fledgling biosimilar drugs industry  has filed a lawsuit against the originator of the world's best-selling drug  to stop it blocking the launch of its own version.",
        "date": "04032016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Samsung brings in the lawyers for biosimilars push "
    },
    {
        "content": "* Ceo richard a. Gonzalez's 2015 total compensation was $20.8 million versus $22.0 million in 2014 - sec filing  Source text  Further company coverage:    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "03212016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie CEO Gonzalez's 2015 total compensation $20.8 mln "
    },
    {
        "content": "Johnson & Johnson's Stelara psoriasis drug has shown effectiveness against Crohn's disease in a second late-stage trial  the company said on Friday  bolstering prospects of its approval for the additional use.",
        "date": "03182016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "J&J psoriasis drug Stelara eases Crohn's disease in second trial "
    },
    {
        "content": "March 18 Johnson & Johnson's Stelara psoriasis drug has shown effectiveness against Crohn's disease in a second late-stage trial  the company said on Friday  bolstering prospects of its approval for the additional use.",
        "date": "03182016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "J&J psoriasis drug Stelara tames Crohn's disease in second trial "
    },
    {
        "content": "March 7 U.S. drugmaker AbbVie has acquired marketing rights to a promising experimental psoriasis treatment from Germany's Boehringer Ingelheim for an initial upfront payment of $595 million.",
        "date": "03072016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie buys rights to Boehringer psoriasis drug for $595 mln "
    },
    {
        "content": "LONDON  March 2 A new leukaemia drug viewed by industry experts as a future blockbuster has been rejected by Britain's healthcare cost-effectiveness agency NICE  which said it could not be confident the medicine represented an effective use of resources.",
        "date": "03022016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UK cost agency rejects leukaemia drug from J&J and AbbVie "
    },
    {
        "content": "Feb 5 U.S. Food and Drug Administration staff members on Friday said  Celltrion Inc's biosimilar form of Johnson & Johnson's Remicade arthritis drug appeared \"highly similar\" to the widely used branded product.",
        "date": "02092016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "CORRECTED-UPDATE 4-FDA staff backs biosimilar to Remicade; J&J and AbbVie fall "
    },
    {
        "content": "(The Day Ahead is an email and PDF publication that includes the day's major stories and events  analyses and other features. To receive The Day Ahead  Eikon users can register at . Thomson One users can register at RT/DAY/US. All times in ET/GMT)  The Commerce Department issues advance (first estimate) U.S. fourth-quarter gross domestic product data. Economic growth likely braked sharply as businesses doubled down on efforts to reduce an inventory glut and unseasonably warm weather slowed co",
        "date": "01282016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "What to Watch in the Day Ahead - Friday  Jan 29 "
    },
    {
        "content": "AbbVie Inc  on Friday predicted slower growth this year in overseas sales of its blockbuster Humira arthritis drug and cut sales estimate for its new Viekira Pak treatment for hepatitis C  sending shares 4 percent lower.",
        "date": "01292016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie shares fall on sales outlooks for Humira and Viekira Pak "
    },
    {
        "content": "Jan 29 AbbVie Inc on Friday predicted slower growth this year in overseas sales of its blockbuster Humira arthritis drug and cut sales estimate for its new Viekira Pak treatment for hepatitis C  sending shares 4 percent lower.",
        "date": "01292016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 3-AbbVie shares fall on sales outlooks for Humira and Viekira Pak "
    },
    {
        "content": "* Abbvie says has been diffifult to forecast sales of viekira pak  believes $2 billion estimate for 2016 is very reliable",
        "date": "01292016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-AbbVie expects $2 bln sales for Viekira Pak in 2016 "
    },
    {
        "content": "* Says expects mid-single digit percentage sales growth for humira this year in international markets  Source text for Eikon:  Further company coverage:    (Reporting by Ransdell Pierson)",
        "date": "01292016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie expects 2016 mid-single digit growth for Humira outside U.S. "
    },
    {
        "content": "Jan 29 Drugmaker AbbVie Inc reported a 17.4 percent jump in quarterly revenue  driven by higher sales of its arthritis drug  Humira.",
        "date": "01292016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "Drugmaker AbbVie reports higher quarterly revenue "
    },
    {
        "content": "U.S. regulators on Thursday approved a new once-daily pill for the liver-destroying hepatitis C virus made by Merck & Co Inc  which said it will sell the drug at a lower list price than its competitors.",
        "date": "01292016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "FDA approves Merck's new hepatitis C pill "
    },
    {
        "content": "Jan 28 U.S. regulators on Thursday approved a new once-daily pill for the liver-destroying hepatitis C virus made by Merck & Co Inc  which said it will sell the drug at a lower list price than its competitors.",
        "date": "01292016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-U.S. FDA approves Merck's new hepatitis C pill "
    },
    {
        "content": "Jan 14 U.S. patent officials on Thursday denied petitions by Amgen to review two formulation patents on AbbVie's Humira  a potential setback in Amgen efforts to market a biosimilar version of the world's top-selling prescription medicine.",
        "date": "01142016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "U.S. patent office rules against Amgen Humira challenge "
    },
    {
        "content": "* CEO says expects Humira sales of $18 billion in 2020  helped by new indications",
        "date": "01132016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie says expects Humira annual sales of $18 bln by 2020 "
    },
    {
        "content": "ZURICH  Jan 12 Roche said on Tuesday that the U.S. Food and Drug Administration has granted 'priority review' status for its venetoclax drug for the treatment of a blood cancer  which it is developing with partner AbbVie .",
        "date": "01122016",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "UPDATE 4-Roche  AbbVie get U.S. priority review status for leukaemia drug "
    },
    {
        "content": "* Baxalta haemophilia business a potential product risk   (Adds closing share prices  termination fee)",
        "date": "01112016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 4-Drugmaker Shire to buy Baxalta for $32 bln after 6-month pursuit "
    },
    {
        "content": "Jan 14 U.S. patent officials on Thursday denied petitions by Amgen to review two formulation patents on AbbVie's Humira  a potential setback in Amgen efforts to market a biosimilar version of the world's top-selling prescription medicine.",
        "date": "01142016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-U.S. patent office rules against Amgen Humira challenge "
    },
    {
        "content": "ZURICH Roche said on Tuesday that the U.S. Food and Drug Administration has granted 'priority review' status for its venetoclax drug for the treatment of a blood cancer  which it is developing with partner AbbVie.",
        "date": "01122016",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "Roche  AbbVie get U.S. priority review status for leukemia drug "
    },
    {
        "content": "AbbVie Inc has sued Sandoz Inc over its plan to make a generic version of AbbVie's AndroGel testosterone replacement therapy  which it said would infringe 11 of its patents.",
        "date": "12072015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie sues Sandoz over proposed generic AndroGel "
    },
    {
        "content": "* Ceo says imbruvica  second-generation immuno-oncology drugs have potential to exceed long-term company sales expectations  Source text for Eikon:  Further company coverage:",
        "date": "11112015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie ceo says imbruvica  second-generation immuno-oncology drugs have potential to exceed long-term company sales expectations "
    },
    {
        "content": "Pharmacy benefit manager Express Scripts Holding Co said the potential risk of liver injury from AbbVie' hepatitis C treatments will not impact the availability of the treatment for patients for whom it is safe and effective.",
        "date": "10282015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Express Scripts to maintain availability of AbbVie's hep C drug "
    },
    {
        "content": "Oct 28 Pharmacy benefit manager Express Scripts Holding Co said the potential risk of liver injury from AbbVie' hepatitis C treatments will not impact the availability of the treatment for patients for whom it is safe and effective.",
        "date": "10282015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-Express Scripts to maintain availability of AbbVie's hep C drug "
    },
    {
        "content": "* Says \"are well-positioned to deliver robust eps growth in 2015 and beyond\"",
        "date": "10302015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Abbvie reports Q3 adjusted earnings per share $1.13 "
    },
    {
        "content": "Oct 30 AbbVie Inc reported higher quarterly sales and net income on Friday and forecast double-digit growth of earnings per share through 2020  putting the drugmaker in line to beat Wall Street's current expectations.",
        "date": "10302015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie projects double-digit annual earnings growth through 2020 "
    },
    {
        "content": "U.S. health regulators on Thursday issued a warning of potential risk of serious liver injury for certain patients using AbbVie's hepatitis C treatments  Viekira Pak and Technivie  sending the drugmaker's shares down more than 10 percent.",
        "date": "10222015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "FDA warns of serious liver injury risk with AbbVie hep C drugs "
    },
    {
        "content": "Oct 22 U.S. health regulators on Thursday issued a warning of potential risk of serious liver injury for certain patients using AbbVie's hepatitis C treatments  Viekira Pak and Technivie  sending the drugmaker's shares down more than 10 percent.",
        "date": "10222015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 3-FDA warns of serious liver injury risk with AbbVie hep C drugs "
    },
    {
        "content": "AbbVie Inc  said one of its experimental drugs improved symptoms of rheumatoid arthritis in mid-stage studies and scrapped plans to buy rights to a similar treatment from Belgium's Galapagos NV .",
        "date": "09262015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie scraps Galapagos deal to focus on own arthritis drug "
    },
    {
        "content": "AbbVie Inc said one of its experimental drugs improved symptoms of rheumatoid arthritis in mid-stage studies and scrapped plans to buy rights to a similar treatment from Belgium's Galapagos NV.",
        "date": "09252015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie scraps Galapagos deal to focus on own arthritis drug "
    },
    {
        "content": "* Galapagos shares fall 18 percent   (Adds Galapagos comments  details on AbbVie  Galapagos drugs)",
        "date": "09252015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 4-AbbVie scraps Galapagos deal to focus on own arthritis drug "
    },
    {
        "content": "NEW YORK  Sept 22 Mylan NV countersued Perrigo Co on Tuesday over \"serious misstatements\" it made as part of its defense against an unsolicited $27 billion tender offer by the generic and over-the-counter drugmaker.",
        "date": "09222015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-Mylan countersues Perrigo over 'misstatements' about tender offer "
    },
    {
        "content": "Sept 25 AbbVie Inc said its experimental drug improved symptoms of rheumatoid arthritis in patients in two mid-stage studies.",
        "date": "09252015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie's arthritis drug succeeds in two mid-stage studies "
    },
    {
        "content": "Sept 17 Generic and over-the-counter drugmaker Perrigo Co on Thursday urged its shareholders to reject Mylan NV's unsolicited $27 billion tender offer  saying it substantially undervalued the company.",
        "date": "09172015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 3-Perrigo recommends shareholders reject Mylan's tender offer "
    },
    {
        "content": "Sept 16 Henry Gosebruch  a co-head of North America M&A at JPMorgan Chase & Co  is leaving the investment bank to join biopharmaceutical company AbbVie Inc  as chief strategy officer  leaving Anu Aiyengar as sole North America M&A head.",
        "date": "09162015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "MOVES-JPMorgan North America M&A co-head Gosebruch leaving for AbbVie "
    },
    {
        "content": "Sept 16 AbbVie Inc said preliminary results from a mid-stage study showed that its experimental drug reduced heavy menstrual bleeding in women suffering from uterine fibroids.",
        "date": "09162015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie drug reduces bleeding in uterine fibroid patients "
    },
    {
        "content": "AbbVie Inc has bought a priority review voucher from United Therapeutics Corp for $350 million that will allow it to accelerate the review process for one of its drugs.",
        "date": "08192015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie buys special review voucher for $350 million "
    },
    {
        "content": "Aug 19 AbbVie Inc has bought a priority review voucher from United Therapeutics Corp for $350 million that will allow it to accelerate the review process for one of its drugs.",
        "date": "08192015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie buys special review voucher for $350 mln "
    },
    {
        "content": "Aug 12 AbbVie Inc on Wednesday said its experimental treatment for a form of leukemia associated with a gene mutation met its main goal in a mid-stage trial and that the company would seek U.S. approval of the medicine  which analysts have said has blockbuster sales potential.",
        "date": "08122015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "UPDATE 2-AbbVie to seek approval for potential blockbuster leukemia drug "
    },
    {
        "content": "AbbVie Inc on Wednesday said its experimental treatment for a form of leukemia associated with a gene mutation met its primary goal in a mid-stage trial and that the company would seek U.S. approval of the medicine  which analysts have said has blockbuster sales potential.",
        "date": "08122015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie to seek approval for potential blockbuster leukemia drug "
    },
    {
        "content": "Aug 12 AbbVie Inc on Wednesday said its experimental treatment for a form of leukemia associated with a gene mutation met its primary goal in a mid-stage trial and that the company would seek U.S. approval of the medicine  which analysts have said has blockbuster sales potential.",
        "date": "08122015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie to seek FDA approval for leukemia drug after trial success "
    },
    {
        "content": "* Ablynx initiates phase II SLE study with its anti-IL-6R Nanobody  partnered with Abbvie Inc",
        "date": "08042015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Ablynx initiates phase II SLE study with its anti-IL-6R Nanobody "
    },
    {
        "content": "A Delaware judge has dismissed a lawsuit by AbbVie Inc shareholders seeking to clear the way to sue the directors of AbbVie's former parent Abbott Laboratories for their possible roll in promoting off-label use of the cholesterol drug TriCor.",
        "date": "07222015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Judge tosses shareholder case over AbbVie spinoff releases "
    },
    {
        "content": "The U.S. Food and Drug Administration on Friday approved two treatments for less common forms of hepatitis C virus (HCV) infections.",
        "date": "07242015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie  Bristol-Myers get FDA nod for hep C treatments "
    },
    {
        "content": "July 24 The U.S. Food and Drug Administration on Friday approved two treatments for less common forms of hepatitis C virus (HCV) infections.",
        "date": "07242015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "CORRECTED-UPDATE 2-AbbVie  Bristol-Myers get FDA nod for hep C treatments "
    },
    {
        "content": "AbbVie Inc  reported quarterly revenue that missed analysts' estimates for the first time in six quarters  sparking concerns over slowing sales growth for its flagship arthritis drug  Humira.",
        "date": "07242015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie's revenue miss raises concerns over Humira sales "
    },
    {
        "content": "July 24 AbbVie Inc on Friday reported quarterly revenue that missed analysts' estimates for the first time in six quarters  sending its shares down 3 percent in premarket trading.",
        "date": "07242015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "CORRECTED-UPDATE 1-AbbVie reports first revenue miss in six quarters "
    },
    {
        "content": "July 24 AbbVie Inc reported a 24 percent jump in quarterly profit due to higher sales of its arthritis drug  Humira  and the inclusion of sales of Pharmacyclics' blood cancer drug  Imbruvica.",
        "date": "07242015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie profit jumps 24 pct as Humira sales rise "
    },
    {
        "content": "June 24 AbbVie Inc said on Wednesday that all patients in a late-stage study showed a sustained response to its cocktail of hepatitis C treatments  currently sold in the U.S. as Viekira Pak.",
        "date": "06242015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie hepatitis C cocktail succeeds in late-stage study "
    },
    {
        "content": "June 24 AbbVie Inc said on Wednesday that its hepatitis C cocktail Viekira Pak was effective whether or not it was used in combination with the compound ribavirin against the most common form of the disease  according to data from a late-stage study.",
        "date": "06242015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-AbbVie hepatitis C cocktail succeeds in late-stage study "
    },
    {
        "content": "NEW YORK  May 11 (IFR) - Apple  Shell and AbbVie blitzed the US bond market last week with a combined US$34bn of jumbo bond deals in just two days  bringing the week's tally to US$52bn  the fourth-largest of all time.",
        "date": "05112015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Borrowers warned: Don't be fooled by high grade market resilience "
    },
    {
        "content": "U.S. drugmaker AbbVie Inc reported better-than-expected quarterly profit and revenue  driven by strong sales of its arthritis drug  Humira.",
        "date": "04232015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Drugmaker AbbVie's profit beats estimates on strong Humira sales "
    },
    {
        "content": "April 23 U.S. drugmaker AbbVie Inc  reported better-than-expected quarterly profit and revenue  driven by strong sales of its arthritis drug  Humira.",
        "date": "04232015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "CORRECTED-UPDATE 1-Drugmaker AbbVie's profit beats estimates on strong Humira sales "
    },
    {
        "content": "April 23 U.S. drugmaker AbbVie Inc  reported a 4 percent rise in quarterly profit  driven by strong sales of its arthritis drug  Humira.",
        "date": "04232015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "Drugmaker AbbVie profit rises on sales of Humira "
    },
    {
        "content": "An independent panel recommended unblinding a late-stage study testing Pharmacyclics Inc and Johnson & Johnson's Imbruvica  after the treatment was successful against two similar forms of cancer in combination with other drugs.",
        "date": "03162015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Pharmacyclics cancer drug successful as combination therapy: independent panel "
    },
    {
        "content": "* Ablynx initiates the first of two phase IIb RA studies with its anti-il-6r nanobody  partnered with Abbvie",
        "date": "03172015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "BRIEF-Ablynx starts first of phase IIb rheumatoid arthritis study with Abbvie "
    },
    {
        "content": "NEW YORK  March 12 The loan market received another boost this week as drugmaker Abbvie and semiconductor company NXP boosted U.S. M&A volume to $152.7 billion so far this year  including completed and deals in the pipeline.",
        "date": "03122015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "TRLPC: Abbvie and NXP boost M&A volumes "
    },
    {
        "content": "AbbVie Inc  is to buy Pharmacyclics Inc  for about $21 billion  giving it access to what is expected to be one of the world's top-selling cancer drugs and expanding its reach in the profitable oncology field. | Video ",
        "date": "03052015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "AbbVie boosts cancer drug pipeline with $21 billion Pharmacyclics deal "
    },
    {
        "content": "NEW YORK AbbVie Inc chief Richard Gonzalez fought two other drugmakers to \"the bitter end\" to buy Pharmacyclics Inc  for its hot-selling Imbruvica cancer drug  but may have a harder time convincing investors it is worth $21 billion.",
        "date": "03052015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie CEO defends Pharmacyclics deal to skeptical investors "
    },
    {
        "content": "NEW YORK  March 5 AbbVie Inc chief Richard Gonzalez fought two other drugmakers to \"the bitter end\" to buy Pharmacyclics Inc for its hot-selling Imbruvica cancer drug  but may have a harder time convincing investors it is worth $21 billion.",
        "date": "03052015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-AbbVie CEO defends Pharmacyclics deal to skeptical investors "
    },
    {
        "content": "* Indexes up: Dow 0.21 pct  S&P 0.12 pct  Nasdaq 0.32 pct   (Updates to afternoon  adds commentary)",
        "date": "03052015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "US STOCKS-Wall St closes up slightly ahead of jobs report "
    },
    {
        "content": "* Indexes up: Dow 0.2 pct  S&P 0.18 pct  Nasdaq 0.39 pct   (Updates to afternoon  adds commentary)",
        "date": "03052015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "US STOCKS-Wall St up slightly ahead of jobs report "
    },
    {
        "content": "* Deal cuts reliance on Humira; expected to close mid 2015   (Adds Breakingviews link)",
        "date": "03052015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 4-AbbVie boosts cancer drug pipeline with $21 bln Pharmacyclics deal "
    },
    {
        "content": "LONDON AbbVie's $21 billion deal to buy Pharmacyclics shows big pharma's hunger for new drugs at a time when research at smaller biotechnology companies is driving some of the most promising advances in medicine. | Video ",
        "date": "03052015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "Biotech buys get pharma M&A off to flying start in 2015 "
    },
    {
        "content": "* Indexes: Dow up 0.07 pct  S&P off 0.08 pct  Nasdaq up 0.02 pct   (Updates to afternoon  adds comments)",
        "date": "03052015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "US STOCKS-Wall St little changed after 2-day drop  data "
    },
    {
        "content": "An updated experimental form of AbbVie Inc's Humira arthritis drug has clear advantages over the original that could help the company confront looming cheaper biosimilar forms of the blockbuster medication  Chief Executive Richard Gonzalez said in an interview.",
        "date": "03052015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie CEO says new form of Humira could thwart generics "
    },
    {
        "content": "March 5 ABBVIE:  * Interview: AbbVie CEO says experimental version of Humira has \"a fundamental",
        "date": "03052015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "BRIEF-Interview: AbbVie CEO says experimental version of Humira is fundamentally different "
    },
    {
        "content": "Achillion Pharmaceuticals Inc's experimental hepatitis C drug  when used with Gilead Sciences Inc's Sovaldi  eradicated signs of the virus in six weeks  the shortest duration and highest response achieved by any two-drug treatment.",
        "date": "02092015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Promising data bodes well for all-Achillion hep C treatment "
    },
    {
        "content": "* Study shows Achillion's inhibitor looks best-in-class: analyst",
        "date": "02092015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 2-Promising data bodes well for all-Achillion hep C treatment "
    },
    {
        "content": "Feb 3 Pharmacy benefit manager Catamaran Corp  said on Tuesday that it will back Gilead Sciences Inc's  Harvoni and Sovaldi as exclusive hepatitis C treatments on its drug coverage lists.",
        "date": "02032015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "Catamaran backs Gilead's hepatitis C treatment over AbbVie competitor "
    },
    {
        "content": "Jan 28 UnitedHealth Group Inc on Wednesday backed Gilead Sciences Inc's hepatitis C treatment Harvoni on its 2015 commercial drug coverage list over a new competitor  Viekira Pak from AbbVie Inc.",
        "date": "01282015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UnitedHealth backs Gilead's Harvoni as preferred hepatitis C treatment "
    },
    {
        "content": "Jan 30 AbbVie Inc's chief executive said on Friday the company's new oral hepatitis C treatment Viekira Pak has the potential to capture a \"meaningful share\" of the U.S. market  where it is competing against Gilead Sciences .",
        "date": "01302015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "UPDATE 2-AbbVie expects hep C drug sales to top $3 billion per year "
    },
    {
        "content": "Jan 28 UnitedHealth Group Inc  the largest U.S. health insurer  on Wednesday backed Gilead Sciences Inc's Harvoni as the preferred hepatitis C treatment on its 2015 commercial drug coverage list  another victory for Gilead over competitor AbbVie Inc.",
        "date": "01282015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 2-UnitedHealth backs Gilead's Harvoni as preferred hepatitis C treatment "
    },
    {
        "content": "U.S. drugmaker AbbVie Inc's  revenue beat analysts' estimates for the fourth straight quarter as sales of arthritis drug Humira jumped nearly 11 percent.",
        "date": "01302015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "Drugmaker AbbVie beats estimates as Humira sales rise "
    },
    {
        "content": "AbbVie Inc's  chief executive said on Friday the company's new hepatitis C treatment Viekira Pak has the potential to capture a \"meaningful share\" of the U.S. market  where it is competing against Gilead Sciences .",
        "date": "01302015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie expects more than $3 billion in annual hepatitis C drug sales "
    },
    {
        "content": "Jan 30 AbbVie Inc's top executive said on Friday that the company's new hepatitis C treatment Viekira Pak has the potential to capture a \"meaningful share\" of the U.S. market  where it is competing against Gilead Sciences Inc .",
        "date": "01302015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie says it will take meaningful share of hepatitis C market "
    },
    {
        "content": "Jan 26 Pharmacy benefits manager EnvisionRx said on Monday it reached an agreement to provide its customers with Gilead Sciences Inc's hepatitis C drugs on an exclusive basis  the latest Gilead victory in a market share battle with AbbVie over their new treatments for the liver destroying virus.",
        "date": "01262015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "PBM EnvisionRx chooses Gilead hepatitis C drugs for its formulary "
    },
    {
        "content": "Jan 30 U.S. drugmaker AbbVie Inc's  revenue beat analysts' estimates for the fourth straight quarter as sales of arthritis drug Humira jumped nearly 11 percent.",
        "date": "01302015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-Drugmaker AbbVie beats estimates as Humira sales rise "
    },
    {
        "content": "Jan 30 U.S. drugmaker AbbVie Inc  reported a better-than-expected quarterly adjusted profit due to higher sales of its autoimmune disease drug Humira.",
        "date": "01302015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie profit beats estimates on higher Humira sales "
    },
    {
        "content": "NEW YORK Gilead Sciences Inc and AbbVie Inc are in a price war over their hepatitis C treatments that is driving costs lower and has changed the way drugmakers price new medicines  a top executive for pharmacy benefit manager Express Scripts said on Thursday.",
        "date": "01222015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Express Scripts' Miller says hepatitis C price war to save billions "
    },
    {
        "content": "Shares of Gilead Sciences Inc closed down 6 percent on Tuesday  after a pharmacy benefit manager said it would cover both Gilead and rival AbbVie Inc's hepatitis C offering  renewing concerns of pricing pressure.",
        "date": "01132015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Gilead  AbbVie hit by fresh concerns on Hep C discounting "
    },
    {
        "content": "BOSTON Hedge fund Mason Capital lost 12 percent in 2014  making for one of the industry's biggest declines  after the New York-based firm was hit by a failed merger of pharmaceuticals companies Shire and AbbVie  a person familiar with the firm said in Monday.",
        "date": "01122015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "Exclusive: Hedge fund Mason Capital ends 2014 down 12 percent - source "
    },
    {
        "content": "The U.S. Food and Drug Administration approved AbbVie Inc's treatment for Parkinson's disease.",
        "date": "01122015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie wins U.S. approval for Parkinson's treatment "
    },
    {
        "content": "Jan 12 The U.S. Food and Drug Administration approved AbbVie Inc's treatment for Parkinson's disease.",
        "date": "01122015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "CORRECTED-UPDATE 1-AbbVie wins U.S. approval for Parkinson's treatment "
    },
    {
        "content": "* Futures off: Dow 61 pts  S&P 7.25 pts  Nasdaq 8.5 pts   (Adds premarket actives)",
        "date": "01092015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "US STOCKS-Futures dip after two-day run  ahead of payrolls "
    },
    {
        "content": "Jan 8 AbbVie Inc forecast 2015 earnings largely above analysts' average estimate  betting on its recently approved hepatitis C drug and growth in its auto-immune disease treatment  Humira.",
        "date": "01082015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie forecasts 2015 earnings largely above analysts' estimate "
    },
    {
        "content": "Jan 12 The U.S. Food and Drug Administration approved AbbVie Inc's treatment for Parkinson's disease.",
        "date": "01122015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "CORRECTED-AbbVie wins U.S. approval for Parkinson's treatment "
    },
    {
        "content": "NEW YORK  Jan 9 U.S. stock index futures were lower on Friday  after a two-day rally in equities put the S&P 500 back in positive territory for the new year and ahead of a key report on the labor market.",
        "date": "01092015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "US STOCKS-Futures lower after two-day run; payrolls on tap "
    },
    {
        "content": "Jan 8 AbbVie Inc forecast 2015 earnings largely above analysts' average estimate  betting on its recently approved hepatitis C drug and growth in its auto-immune disease treatment  Humira.",
        "date": "01082015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-AbbVie forecasts 2015 earnings largely above analysts' estimate "
    },
    {
        "content": "Jan 8 An experimental drug being developed by AbbVie Inc and Neurocrine Biosciences Inc  successfully reduced symptoms of endometriosis in premenopausal women in the first of two late-stage studies.",
        "date": "01082015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "AbbVie  Neurocrine drug successful in endometriosis trial "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Shire is gambling its AbbVie break fee on risky M&A. The Dublin-based pharma group has agreed to buy U.S. peer NPS to expand in lucrative rare drugs. The 51 percent premium is covered almost entirely by compensation from the collapse of Shire's sale to larger American rival AbbVie last year. That doesn't much mitigate the risk of doing a deal ahead of a key regulatory ruling.",
        "date": "01122015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "Breakingviews: Shire gambles AbbVie break fee on risky $5 bln deal "
    },
    {
        "content": "Jan 8 An experimental drug being developed by AbbVie Inc and Neurocrine Biosciences Inc  successfully reduced symptoms of endometriosis in pre-menopausal women in the first of two late-stage studies.",
        "date": "01082015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-AbbVie  Neurocrine drug successful in endometriosis trial "
    },
    {
        "content": "CVS Health Corp  one of the largest U.S. managers of drug benefits  said it would give preferred status to the hepatitis C treatments from Gilead Sciences and cover a new competing treatment from AbbVie Inc only as an exception.",
        "date": "01052015",
        "name": "AbbVie Inc",
        "news_type": "topStory",
        "symbol": "ABBV",
        "title": "CVS to cover Gilead hepatitis C treatment over AbbVie regimen "
    },
    {
        "content": "(Recasts with attribution from CVS; adds Express Scripts  analyst comment  background)",
        "date": "01052015",
        "name": "AbbVie Inc",
        "news_type": "normal",
        "symbol": "ABBV",
        "title": "UPDATE 1-CVS to cover Gilead hepatitis C treatment over AbbVie regimen "
    }
]