[
    {
        "content": "SAO PAULO  Oct 26 Ambev SA  the Latin American unit of beverage company Anheuser Busch Inbev NV   reported mixed quarterly results on Thursday as sharp price hikes offset weaker volumes  leading some analysts to flag the risk of slipping market share.",
        "date": "10262017",
        "name": "Ambev SA",
        "news_type": "topStory",
        "symbol": "ABEV",
        "title": "UPDATE 1-Ambev results mixed on higher pricing  weak volumes "
    },
    {
        "content": "SAO PAULO/BRASILIA  Oct 26 Ambev SA  the Latin American unit of Anheuser Busch Inbev NV  on Thursday reported a third-quarter adjusted net income of 3.24 billion reais  ($1 billion)  up 1.2 percent from a year earlier.",
        "date": "10262017",
        "name": "Ambev SA",
        "news_type": "normal",
        "symbol": "ABEV",
        "title": "Brazil's Ambev beats Q3 profit estimates "
    },
    {
        "content": "SAO PAULO  May 4 Stable Latin American currencies and increased hedging against commodity price swings should help Ambev SA slow cost growth to single-digits by year-end  as the region's biggest beer maker wrestles with the lowest annual profit in four years.",
        "date": "05042017",
        "name": "Ambev SA",
        "news_type": "topStory",
        "symbol": "ABEV",
        "title": "UPDATE 3-Ambev sees cost pressure easing in weak Brazil market "
    },
    {
        "content": "SAO PAULO  May 4 Ambev SA will continue to keep sales  general and administrative expenses in check while taking steps to grow faster in premium beer brands  as sales volumes at Latin America's largest beer maker reels from a steep recession in Brazil  Chief Executive Officer Bernardo Paiva said on Thursday.",
        "date": "05042017",
        "name": "Ambev SA",
        "news_type": "normal",
        "symbol": "ABEV",
        "title": "Ambev's Paiva pledges to curb expenses  bolster premium brands "
    },
    {
        "content": "SAO PAULO  May 4 Ambev SA  the Latin American unit of Anheuser Busch Inbev NV  missed first-quarter profit estimates on Thursday  reflecting rapid growth in costs that offset a decline in financial expenses and higher volumes.",
        "date": "05042017",
        "name": "Ambev SA",
        "news_type": "normal",
        "symbol": "ABEV",
        "title": "Brazil's Ambev misses estimates as cost pressure bites "
    },
    {
        "content": "SAO PAULO  March 2 Shares of Ambev SA tumbled on Thursday after the drinks company reported weak quarterly earnings  hit by declining sales and rising costs in its main market of Brazil  where it hopes for a rebound as economic conditions improve.",
        "date": "03022017",
        "name": "Ambev SA",
        "news_type": "topStory",
        "symbol": "ABEV",
        "title": "UPDATE 2-Weak Brazil beer sales hit Ambev earnings  shares down "
    },
    {
        "content": "SAO PAULO  March 2 Ambev SA reported a 13.5 percent increase in fourth-quarter net income from the year before to 4.834 billion reais ($1.6 billion)  the Brazilian beverages company said on Thursday.",
        "date": "03022017",
        "name": "Ambev SA",
        "news_type": "normal",
        "symbol": "ABEV",
        "title": "Brazil's Ambev posts $1.6 bln net income in fourth quarter "
    },
    {
        "content": "SAO PAULO Coca-Cola Co   Ambev SA  and Britvic Plc  have shown preliminary interest in buying a stake in Brazilian juice maker Natural One SA  as global beverage giants seek to grow their platform of healthy drink choices  according to two people familiar with the matter.",
        "date": "11012016",
        "name": "Ambev SA",
        "news_type": "topStory",
        "symbol": "ABEV",
        "title": "Exclusive: Coca-Cola  Ambev eye Brazil juice maker  sources say "
    },
    {
        "content": "SAO PAULO  Oct 28 Ambev SA expects no net revenue growth this year and will cut investments  reflecting the challenges facing Latin America's largest beverage maker as the harshest Brazilian recession in eight decades and rising unemployment weigh down beer sales.",
        "date": "10282016",
        "name": "Ambev SA",
        "news_type": "topStory",
        "symbol": "ABEV",
        "title": "UPDATE 1-Ambev cuts guidance as Brazil recession weighs on beer sales "
    },
    {
        "content": "SAO PAULO  Oct 28 Ambev SA expects no net revenue growth this year and will cut investments  reflecting the challenges facing Latin America's largest beverage maker as the harshest Brazilian recession in eight decades and rising unemployment weigh down beer sales.",
        "date": "10282016",
        "name": "Ambev SA",
        "news_type": "normal",
        "symbol": "ABEV",
        "title": "AmBev cuts guidance as Brazil recession weighs on beer sales "
    },
    {
        "content": "RIO DE JANEIRO Ambev SA  a subsidiary of beverage company Anheuser Busch Inbev SA  missed quarterly profit estimates and gave up on expanding sales in Brazil this year  sending its shares to their lowest point in nearly seven months.",
        "date": "07292016",
        "name": "Ambev SA",
        "news_type": "topStory",
        "symbol": "ABEV",
        "title": "Ambev profit misses  Brazil revenue outlook flat; shares fall "
    },
    {
        "content": "RIO DE JANEIRO  July 29 Ambev SA  a subsidiary of beverage company Anheuser Busch Inbev SA  missed quarterly profit estimates and gave up on expanding sales in Brazil this year  sending its shares to their lowest point in nearly seven months.",
        "date": "07292016",
        "name": "Ambev SA",
        "news_type": "normal",
        "symbol": "ABEV",
        "title": "UPDATE 2-Ambev profit misses  Brazil revenue outlook flat; shares fall "
    },
    {
        "content": "SAO PAULO  July 29 Ambev <SA ABEV3.SA>  a subsidiary of beverage giant Anheuser Busch Inbev SA  will launch a returnable bottles campaign nationwide in Brazil to help raise sales volumes  executives said on Friday.",
        "date": "07292016",
        "name": "Ambev SA",
        "news_type": "normal",
        "symbol": "ABEV",
        "title": "Brazil's Ambev to launch returnable bottles campaign to raise sales "
    },
    {
        "content": "RIO DE JANEIRO  July 29 Ambev SA  a subsidiary of beverage giant Anheuser Busch Inbev SA  booked a weaker second-quarter profit on Friday and gave up on expanding Brazilian sales this year as demand stagnates in Latin America's largest economy.",
        "date": "07292016",
        "name": "Ambev SA",
        "news_type": "normal",
        "symbol": "ABEV",
        "title": "Brazil's Ambev reports 18 pct drop in 2nd quarter profit "
    },
    {
        "content": "SAO PAULO  May 12 Brazilian drinks company Ambev SA agreed to hand off operations in Peru  Colombia and Ecuador to its parent company Anheuser-Busch InBev SA   according to a securities filing on Thursday.",
        "date": "05122016",
        "name": "Ambev SA",
        "news_type": "topStory",
        "symbol": "ABEV",
        "title": "Brazil's Ambev passes Peru  Colombia  Ecuador ops to AB InBev "
    },
    {
        "content": "SAO PAULO Brazil's beer and soda producer Ambev SA   a company controlled by Anheuser-Busch InBev  said on Monday it is acquiring local juice producer Do Bem for an undisclosed amount.",
        "date": "04262016",
        "name": "Ambev SA",
        "news_type": "topStory",
        "symbol": "ABEV",
        "title": "Brazil's Ambev to acquire local juice producer Do Bem "
    },
    {
        "content": "SAO PAULO  April 25 Brazil's beer and soda producer Ambev SA  a company controlled by Anheuser-Busch InBev  said on Monday it is acquiring local juice producer Do Bem for an undisclosed amount.",
        "date": "04252016",
        "name": "Ambev SA",
        "news_type": "topStory",
        "symbol": "ABEV",
        "title": "UPDATE 1-Brazil's Ambev to acquire local juice producer Do Bem "
    },
    {
        "content": "SAO PAULO  April 25 Brazil's beer and soda producer Ambev SA  a company controlled by Anheuser-Busch InBev  said on Monday it is acquiring local juice producer Do Bem for an undisclosed amount.",
        "date": "04252016",
        "name": "Ambev SA",
        "news_type": "normal",
        "symbol": "ABEV",
        "title": "Brazil's Ambev to acquire local juice producer Do Bem "
    }
]