[
    {
        "content": "* Abbott's mitraclip approved as first transcatheter mitral valve repair device in Japan Source text for Eikon: Further company coverage:",
        "date": "11062017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott's mitraclip approved as first transcatheter mitral valve repair device in Japan "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 02 (Fitch) Fitch Ratings has chosen to withdraw the ratings of Abbott Laboratories and St. Jude Medical  Inc. for commercial reasons. RATING SENSITIVITIES Ratings sensitivities are no longer relevant given today's withdrawal. FULL LIST OF RATING ACTIONS Fitch has affirmed and subsequently withdrawn the following ratings. Abbott Laboratories --Long-Term Issuer Default Rating 'BBB'  Outlook Stable; --Senior unsecured ban",
        "date": "11022017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Fitch Withdraws Abbott Laboratories' Ratings "
    },
    {
        "content": "* Abbott announces FDA clearance for its Alinity ci-series next-generation diagnostic systems",
        "date": "10312017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott gets FDA clearance for its Alinity ci-series instruments "
    },
    {
        "content": "* Abbott - ‍secured FDA clearance for confirm Rx Insertable Cardiac Monitor​ Source text for Eikon: Further company coverage:",
        "date": "10232017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott says ‍secured FDA clearance for confirm Rx Insertable Cardiac Monitor​ "
    },
    {
        "content": "* Abbott CFO says Alere  is expected to contribute around $475 million to reported sales  and  forecast a neutral impact on adjusted earnings per share this year -  Conf Call",
        "date": "10182017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott CFO says Alere is expected to contribute around $475 mln to reported sales this year "
    },
    {
        "content": "Abbott Laboratories'  quarterly results beat estimates and the company raised the top end of its full-year earnings forecast range on Wednesday  as a string of recent deals and medical device approvals help spur growth in its largest unit.",
        "date": "10182017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott's recent deals  medical device pipeline to fuel growth "
    },
    {
        "content": "* Shares up 2.8 pct to record high (Adds conference call details  updates shares)",
        "date": "10182017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 3-Abbott's recent deals  medical device pipeline to fuel growth "
    },
    {
        "content": "* Sees FY 2017 gaap earnings per share $0.97 to $0.99 from continuing operations",
        "date": "10182017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott Q3 adjusted EPS $0.66 from continuing operations "
    },
    {
        "content": "Oct 18 Diversified healthcare company Abbott Laboratories on Wednesday reported a quarterly profit compared with a loss in the year-ago quarter  helped by strong sales in its medical devices and generics businesses.",
        "date": "10182017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott Labs posts quarterly profit vs. year-ago loss "
    },
    {
        "content": "A federal appeals court on Thursday upheld the dismissal of a class action lawsuit accusing AbbVie Inc and Abbott Laboratories of violating federal racketeering laws by promoting the drug Depakote for off-label uses.",
        "date": "10122017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "AbbVie  Abbott duck Depakote off-label marketing case on appeal "
    },
    {
        "content": "* Abbott completes cash tender offer for Series B Convertible Perpetual Preferred Stock of Alere Inc. Source text for Eikon: Further company coverage:",
        "date": "10042017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott completes cash tender offer for Series B Convertible Perpetual Preferred Stock of Alere Inc "
    },
    {
        "content": "* Abbott announces extension of cash tender offer for all outstanding shares of Series B convertible perpetual preferred stock of Alere Inc.",
        "date": "10022017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott extends previous cash tender offer for outstanding Series B shares of Alere Inc "
    },
    {
        "content": "Sept 27 The U.S. Food and Drug Administration on Wednesday approved Abbott Laboratories' glucose monitoring device for adults with diabetes  allowing millions of people to track their blood sugar levels without having to prick their fingers.",
        "date": "09272017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "FDA approves Abbott's blood glucose monitoring device "
    },
    {
        "content": "Sept 27 The U.S. Food and Drug Administration said it approved Abbott Laboratories' glucose monitoring device for adults with diabetes  allowing millions of people to track their blood sugar levels without having to prick their fingers.",
        "date": "09272017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 1-FDA approves Abbott's blood glucose monitoring device "
    },
    {
        "content": "WASHINGTON  Sept 28 Abbott Laboratories has won U.S. antitrust approval to buy Alere Inc on condition that it sell certain assets  the Federal Trade Commission said on Thursday.",
        "date": "09282017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott wins U.S. antitrust approval to buy Alere with conditions "
    },
    {
        "content": "WASHINGTON  Sept 28 Abbott Laboratories has won U.S. antitrust approval to buy Alere Inc on condition that it sell two point-of-care medical testing businesses  the Federal Trade Commission said on Thursday.",
        "date": "09282017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 2-Abbott wins U.S. antitrust approval to buy Alere with conditions "
    },
    {
        "content": "* Canadian Competition Bureau clears Abbott Laboratories' proposed takeover of Alere; for deal to go ahead  Alere must sell units to Siemens and Quidel Further company coverage: (Reporting by David Ljunggren)",
        "date": "09282017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Canadian Competition Bureau clears Abbott Laboratories' takeover of Alere "
    },
    {
        "content": "* Abbott acquisition of Alere set to close on Tuesday  October 3  2017",
        "date": "09292017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott acquisition of Alere set to close on October 3  2017 "
    },
    {
        "content": "* Abbott secures FDA approval for MRI-compatibility for the company's Ellipse ICD Source text for Eikon: Further company coverage:",
        "date": "09222017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott secures FDA approval for MRI-compatibility for the co's Ellipse ICD "
    },
    {
        "content": "* Alere announces intent to voluntarily delist Series B Convertible Perpetual Preferred Stock from the NYSE conditioned upon the completion of its acquisition by Abbott",
        "date": "09192017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Alere announces intent to voluntarily delist Series B Convertible Perpetual Preferred Stock from the NYSE "
    },
    {
        "content": "* Abbott announces extension of cash tender offer for all outstanding shares of series B convertible perpetual preferred stock of Alere Inc.",
        "date": "09182017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott announces extension of cash tender offer "
    },
    {
        "content": "* Sets quarterly dividend of $0.265 per share Source text for Eikon: Further company coverage:",
        "date": "09142017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott sets quarterly dividend of $0.265 per share "
    },
    {
        "content": "* Abbott Laboratories - ‍NHS Business Services Authority approved listing on Drug Tariff for FreeStyle Libre system for people with diabetes using insulin​",
        "date": "09132017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott Laboratories says ‍NHS Business Services Authority approved listing on Drug Tariff for FreeStyle Libre system "
    },
    {
        "content": "* Abbott announces extension of cash tender offer for all outstanding shares of series B convertible perpetual preferred stock of Alere",
        "date": "09012017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott extends cash tender offer for all outstanding shares of series B convertible perpetual preferred stock of Alere "
    },
    {
        "content": "* Abbott initiates ground-breaking U.S. pivotal study of AMPLATZER device to correct common congenital heart defect in newborns",
        "date": "08302017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott initiates study of AMPLATZER device to correct congenital heart defect in newborns "
    },
    {
        "content": "NEW YORK  Aug 29 Abbott Laboratories said on Tuesday it will issue updates to reduce the risk of its St. Jude heart implants being hacked and to warn patients that the devices' batteries may run down earlier than expected.",
        "date": "08292017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott releases new round of cyber updates for St. Jude pacemakers "
    },
    {
        "content": "NEW YORK  Aug 29 Abbott Laboratories said on Tuesday it would issue updates to reduce the risk of its St. Jude heart implants being hacked and to warn patients that the devices' batteries may run down earlier than expected.",
        "date": "08292017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 2-Abbott releases new round of cyber updates for St. Jude pacemakers "
    },
    {
        "content": "* Abbott Laboratories- Co & North West London Pathology signed a $252 million managed equipment services contract",
        "date": "08152017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott Laboratories says co & North West London Pathology signed a $252 mln managed equipment services contract "
    },
    {
        "content": "* Abbott announces extension of cash tender offer for all outstanding shares of series B convertible perpetual preferred stock of Alere Inc",
        "date": "08142017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott announces extension of cash tender offer for all outstanding shares of series B convertible perpetual preferred stock of Alere Inc "
    },
    {
        "content": "* Enzo Biochem says ‍a federal judge in a U.S. Court has entered an order in action entitled Enzo Life Sciences  Inc. v. Abbott Laboratories - sec filing​",
        "date": "08162017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Enzo Biochem says federal judge in a U.S. Court has entered an order in action entitled Enzo Life Sciences v. Abbott Laboratories ​ "
    },
    {
        "content": "* Alleged tipper has been suspended by Royal Bank of Canada (Recasts to add criminal charges  comments  background)",
        "date": "08162017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 2-Seven charged in U.S. insider trading ring "
    },
    {
        "content": "* Roxwood Medical - entered into an exclusive agreement with Abbott for distribution of Roxwood Products in United States Source text for Eikon: Further company coverage:",
        "date": "07252017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Roxwood Medical enters into an exclusive agreement with Abbott for distribution of roxwood products in United States "
    },
    {
        "content": "* Says ‍on July 21  2017  Alere entered into purchase agreement with Siemens Diagnostics Holding II B.V. ​‍​",
        "date": "07212017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Alere Inc enters into purchase agreement with Siemens Diagnostics ​‍​ "
    },
    {
        "content": "Abbott Laboratories  raised its full-year profit forecast as the company benefits from its St. Jude Medical acquisition  and said it was confident that the Alere purchase would close this year  sending its shares to a near two-year high.",
        "date": "07202017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Abbott profit forecast gets a lift from St. Jude integration "
    },
    {
        "content": "* Shares rise as much as 2.8 pct to $50.83 (Adds conference call details; updates shares)",
        "date": "07202017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 3-Abbott profit forecast gets a lift from St. Jude integration "
    },
    {
        "content": "July 20 Diversified healthcare company Abbott Laboratories reported a 55 percent drop in quarterly profit on Thursday  hurt by higher costs.",
        "date": "07202017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott's quarterly profit halves as costs soar "
    },
    {
        "content": "Abbott Laboratories Inc must pay John Hancock Life Insurance Co over $33 million in a long-running dispute over a failed investment the insurer made to support the development of pharmaceutical products  a federal appeals court has ruled.",
        "date": "07132017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Abbott must pay John Hancock $33 million over drug development deal "
    },
    {
        "content": "* Abbott Laboratories and Bigfoot Biomedical enter agreement to develop and commercialize diabetes management systems",
        "date": "07132017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott  Bigfoot Biomedical enter deal to develop diabetes management systems "
    },
    {
        "content": "* Abbott commences cash tender offer for all outstanding shares of series b convertible perpetual preferred stock of Alere Inc",
        "date": "07172017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott says commences tender offer for Series B preferred stock of Alere "
    },
    {
        "content": "* Alere says about 63 million of votes cast at special meeting voted in favor of amended merger  representing over 72.5 percent of alere shares as of may 31 Source text for Eikon: Further company coverage:",
        "date": "07072017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Alere shareholders approve amended merger with Abbott "
    },
    {
        "content": "* ‍abbott Diabetes Care Canada - announced Health Canada license of its freestyle libre flash glucose monitoring system​ Source text for Eikon: Further company coverage:",
        "date": "06302017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-‍Abbott secures Health Canada license for its freestyle libre flash glucose monitoring system​ "
    },
    {
        "content": "* Abbott Laboratories - ‍on June 29  2017  John G. Stratton was named to Abbott Laboratories' board of directors  effective immediately​",
        "date": "06292017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott Laboratories names John Stratton to its board "
    },
    {
        "content": "* Abbott secures Health Canada license for Freestyle Libre system for people with diabetes",
        "date": "06292017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott secures Health Canada license for Freestyle Libre system for people with diabetes "
    },
    {
        "content": "* Sets quarterly dividend of $0.265 per share Source text for Eikon: Further company coverage:",
        "date": "06092017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott sets quarterly dividend of $0.265 per share "
    },
    {
        "content": "* Alere files form 10-k  reports fourth quarter and full year 2016 financial results",
        "date": "06052017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Alere Q4 loss per share $1.38 from continuing operations "
    },
    {
        "content": "A federal appeals court has upheld Abbott Laboratories' trial win in a potentially billion-dollar whistleblower lawsuit over off-label promotion of bile duct stents for use in blood vessels.",
        "date": "06012017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Abbott trial win in stent whistleblower lawsuit upheld on appeal "
    },
    {
        "content": "* Abbott announces CE Mark for tacticath™ contact force ablation catheter  sensor enabled™",
        "date": "05092017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott reports CE Mark for tacticath contact force ablation catheter "
    },
    {
        "content": "* Abbott announces CE mark and first use of the world's first smartphone compatible insertable cardiac monitor",
        "date": "05082017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott announces CE Mark and first use of the world's first smartphone compatible insertable cardiac monitor "
    },
    {
        "content": "BEIJING China's Dalian Wanda Group  controlled by the country's richest man Wang Jianlin  has signed a deal to sponsor races with the world's top organizer  Abbott World Marathon Majors (WMM)  the latest move by Wanda to expand its global sports business.",
        "date": "04262017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "China's richest man deepens sports foray with global marathons deal "
    },
    {
        "content": "BEIJING  April 26 China's Dalian Wanda Group  controlled by the country's richest man Wang Jianlin  has signed a deal to sponsor races with the world's top organizer  Abbott World Marathon Majors (WMM)  the latest move by Wanda to expand its global sports business.",
        "date": "04262017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "CORRECTED-OFFICIAL-China's richest man deepens sports foray with global marathons deal "
    },
    {
        "content": "* Abbott Laboratories -  developed two new science-based nutrition drinks for patients undergoing surgery Source text for Eikon: Further company coverage:",
        "date": "04262017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott Laboratories develops 2 new science-based nutrition drinks for patients undergoing surgery "
    },
    {
        "content": "Abbott Laboratories said it was looking to close the recently revised deal to buy Alere Inc in the coming months  calling the diagnostics company \"a bit of a fixer-upper\".",
        "date": "04192017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Abbott sees Alere as challenging 'fixer-upper' after revised deal "
    },
    {
        "content": "* Closing of new Alere deal is a little unpredictable - CFO (Adds conference call details; Updates shares)",
        "date": "04192017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 3-Abbott sees Alere as challenging \"fixer-upper\" after revised deal "
    },
    {
        "content": "* Abbott CEO says \"the acquisition of Alere will significantly expand our diagnostics presence and leadership in that space\" - Conf Call",
        "date": "04192017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott CFO says \"We're not going to really be in a good position to give a lot of detailed guidance (on Alere) until minimum Q4\" - Conf Call "
    },
    {
        "content": "The U.S. Food and Drug Administration issued a warning letter to Abbott Laboratories  citing manufacturing flaws with a range of cardiovascular devices acquired with its purchase of St. Jude Medical in January for $25 billion.",
        "date": "04132017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "U.S. FDA warns Abbott Labs over heart device problems "
    },
    {
        "content": "April 19 Diversified healthcare company Abbott Laboratories reported a 29.7 percent rise in quarterly sales on Wednesday  driven by its $25 billion acquisition of St. Jude Medical.",
        "date": "04192017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott posts 29.7 pct rise in quarterly sales "
    },
    {
        "content": "* Q1 adjusted earnings per share $0.48 from continuing operations",
        "date": "04192017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott Q1 adjusted earnings per share $0.48 from continuing operations "
    },
    {
        "content": "April 13 The U.S. Food and Drug Administration issued a warning letter to Abbott Laboratories  citing manufacturing flaws with a range of cardiovascular devices acquired with its purchase of St. Jude Medical in January for $25 billion.",
        "date": "04132017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 1-U.S. FDA warns Abbott Labs over heart device problems "
    },
    {
        "content": "* Says raises quality concerns after inspection of St. Jude's Sylmar facility",
        "date": "04132017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-U.S. FDA says issued a warning letter to Abbott Laboratories "
    },
    {
        "content": "Diversified healthcare company Abbott Laboratories  on Friday agreed to buy Alere Inc  at a lower price than it had previously offered  after raising concerns about the accuracy of various representations  warranties and covenants made by Alere in the earlier agreement.",
        "date": "04142017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Abbott agrees to buy Alere at lower price from earlier offer "
    },
    {
        "content": "* Abbott  Alere say they agreed to dismiss respective lawsuits",
        "date": "04142017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 4-Abbott agrees to buy Alere at lower price from earlier offer "
    },
    {
        "content": "* Under amended terms  Abbott will pay $51 per common share to acquire Alere",
        "date": "04142017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott and Alere amend terms of merger agreement "
    },
    {
        "content": "April 14 Abbott Laboratories agreed to buy diagnostic-testing company Alere Inc for $4.4 billion  ending a prolonged legal battle over Abbott's plan to buy the company  the Financial Times reported  citing people close to the matter.",
        "date": "04142017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "RPT-Abbott Laboratories to buy Alere for $4.4 bln - FT "
    },
    {
        "content": "April 14 Abbott Laboratories agreed to buy diagnostic-testing company Alere Inc for $4.4 billion  ending a prolonged legal battle over Abbott's plan to buy the company  the Financial Times reported  citing people close to the matter.",
        "date": "04142017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott Laboratories to buy Alere for $4.4 bln - FT "
    },
    {
        "content": "* Abbott laboratories has ended protracted legal battle over its $5 bln plan to buy alere by agreeing to purchase smaller u.s. Rival at a lower price - FT",
        "date": "04142017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott Laboratories to buy Alere for $51 per share - FT  citing sources "
    },
    {
        "content": "WASHINGTON Patients who received Abbott Laboratories' novel dissolving vascular stent had a significantly higher rate of serious adverse heart events than those treated with the company's widely used Xience drug-coated metal stent two years after implantation  according to data presented on Saturday.",
        "date": "03182017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Higher heart risk seen with Abbott dissolving stent after two years: study "
    },
    {
        "content": "WASHINGTON  March 18 Patients who received Abbott Laboratories' novel dissolving vascular stent had a significantly higher rate of serious adverse heart events than those treated with the company's widely used Xience drug-coated metal stent two years after implantation  according to data presented on Saturday.",
        "date": "03182017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 1-Higher heart risk seen with Abbott dissolving stent after 2 years -study "
    },
    {
        "content": "* Abbott laboratories says chairman and ceo miles white total compensation for 2016 $20.3 million versus. $19.4 million in 2015  Source text for Eikon:  Further company coverage:",
        "date": "03172017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott Laboratories says CEO Miles White total compensation for 2016 $20.3 mln vs. $19.4 mln in 2015 "
    },
    {
        "content": "WASHINGTON  March 18 Patients who received Abbott Laboratories' novel dissolving vascular stent had a significantly higher rate of serious adverse heart events than those treated with the company's widely used Xience drug-coated metal stent two years after implantation  according to data presented on Saturday.",
        "date": "03182017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Higher heart risk seen with Abbott dissolving stent after 2 years -study "
    },
    {
        "content": "* Abbott Laboratories - findings from Lotus I study have potential to have important implications for women undergoing IVF",
        "date": "03082017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott says findings from Lotus I study may have important implications for women undergoing IVF "
    },
    {
        "content": "Alere Inc  said it would delay filing its 2016 annual report  in the latest blow to the diagnostic company engaged in a legal battle with Abbott Laboratories over their deal.",
        "date": "03012017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Diagnostic company Alere to delay filing annual report "
    },
    {
        "content": "March 1 Alere Inc said it would delay filing its 2016 annual report  in the latest blow to the diagnostic company engaged in a legal battle with Abbott Laboratories over their deal.",
        "date": "03012017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 2-Diagnostic company Alere to delay filing annual report "
    },
    {
        "content": "* Approved final order settling charges that Abbott Laboratories’ $25 billion acquisition of St. Jude Medical would likely be anticompetitive",
        "date": "02232017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-FTC approves final order settling charges for Abbott's deal with St. Jude Medical "
    },
    {
        "content": "* Abbott laboratories - Abbott commences exchange offers and consent solicitations for St. Jude Medical LLC notes  Source text for Eikon:  Further company coverage:",
        "date": "02212017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott Laboratories commences exchange offers  consent solicitations for St. Jude Medical notes "
    },
    {
        "content": "* Abbott Laboratories-on Feb 16  amended by-laws to provide that co's board of directors shall consist of 12 persons  effective as of February 16  2017",
        "date": "02172017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott Laboratories says board of directors shall consist of 12 persons from 11 "
    },
    {
        "content": "* SETS QUARTERLY DIVIDEND OF $0.265 PER SHARE  Source text for Eikon:  Further company coverage:",
        "date": "02172017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-ABBOTT SETS QUARTERLY DIVIDEND OF $0.265 PER SHARE "
    },
    {
        "content": "NEW YORK Abbott Laboratories  is likely to see its shares rise again after trading range-bound for nearly a year on the back of its $25 billion acquisition of medical device-maker St. Jude Medical  Barron's said on Sunday.",
        "date": "02122017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Abbott Laboratories may see boost from St. Jude's acquisition: Barron's "
    },
    {
        "content": "* U.S. FDA grants Abbott the first commercial authorization for a molecular test to detect zika virus using whole blood",
        "date": "02022017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-FDA grants Abbott first commercial authorization for molecular test to detect zika virus using whole blood "
    },
    {
        "content": "* Abbott announces U.S. approval for its Assurity Mri\u007f pacemaker  the world's smallest  longest-lasting wireless mri-compatible pacemaker  Source text for Eikon:  Further company coverage:",
        "date": "02012017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott announces U.S. approval for its Assurity Mri pacemaker "
    },
    {
        "content": "Abbott Laboratories  said it planned to focus on slashing its debt and integrating its $25 billion acquisition of St. Jude Medical in 2017  in a break from the hectic pace of dealmaking last year",
        "date": "01252017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Abbott pauses on deals  to focus on St. Jude integration "
    },
    {
        "content": "* Shares fall as much as 2.6 pct   (Adds conference call details  analyst comment; updates shares)",
        "date": "01252017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 3-Abbott pauses on deals  to focus on St. Jude integration "
    },
    {
        "content": "BRUSSELS  Jan 25 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "01252017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "EU mergers and takeovers (Jan 25) "
    },
    {
        "content": "* Alere inc - \"We remain highly confident that merger will close according to terms of agreement\" with Abbott  Source text for Eikon:  Further company coverage:",
        "date": "01252017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-European Commission clears Abbott acquisition of Alere "
    },
    {
        "content": "BRUSSELS  Jan 25 European Union antitrust regulators cleared Abbott Laboratories' proposed $5.8 billion acquisition of diagnostic test maker Alere on Wednesday  subject to the divestment of some of Alere's operations.",
        "date": "01252017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "EU clears Abbott acquisition of Alere subject to divestments "
    },
    {
        "content": "* Abbott says expect challenging conditions in China's nutrition market to continue in the near term: Conf Call",
        "date": "01252017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott CEO says is optimistic about the Trump administration: Conf Call "
    },
    {
        "content": "* Q4 GAAP earnings per share $0.51 from continuing operations",
        "date": "01252017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott reports Q4 sales of $5.3 billion "
    },
    {
        "content": "Jan 25 Abbott Laboratories reported a 2.8 percent rise in quarterly sales  fueled by demand for its medical devices and diagnostic products.",
        "date": "01252017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott Labs' sales rise 2.8 pct "
    },
    {
        "content": "* Abbott announces european launch of the Proclaim\u007f DRG neurostimulation system for the management of chronic neuropathic pain  Source text for Eikon:  Further company coverage:",
        "date": "01182017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott announces European launch of the Proclaim DRG Neurostimulation system "
    },
    {
        "content": "* Abbott Laboratories - new data confirms Abbott's dorsal root ganglion stimulation offers greater treatment success over traditional spinal cord stimulation  Source text for Eikon:  Further company coverage:",
        "date": "01172017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-New Data confirms Abbott's dorsal root ganglion stimulation offers greater treatment success "
    },
    {
        "content": "* Abbott announces u.s. Launch and first commercial use of the new ensite\u007f precision cardiac mapping system  Source text for Eikon:  Further company coverage:",
        "date": "01122017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott announces U.S. launch  first commercial use of new ensite precision cardiac mapping system "
    },
    {
        "content": "* Biogaia has signed an exclusive agreement with Abbott for the rights to commercialize Biogaia products in the area of paediatrics and gastroenterology in Thailand   Further company coverage:    (Reporting by Stockholm Newsroom)",
        "date": "01132017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Biogaia's probiotic to be launched in Thailand "
    },
    {
        "content": "* Abbott announces CE mark for its \"Alinity s\" blood and plasma screening system  Source text for Eikon:  Further company coverage:",
        "date": "01102017",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott announces CE mark for its \"Alinity s\" blood and plasma screening system "
    },
    {
        "content": "Abbott Laboratories  moved to protect patients with its St. Jude heart implants against possible cyber attacks  releasing a software patch on Monday that the firm said will reduce the \"extremely low\" chance of them being hacked.",
        "date": "01092017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "St. Jude releases cyber updates for heart devices after U.S. probe "
    },
    {
        "content": "Jan 9 Abbott Laboratories moved to protect patients with its St. Jude heart implants against possible cyber attacks  releasing a software patch on Monday that the firm said will reduce the \"extremely low\" chance of them being hacked.",
        "date": "01092017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 5-St. Jude releases cyber updates for heart devices after U.S. probe "
    },
    {
        "content": "Jan 9 Abbott Laboratories said on Monday it is releasing cyber security updates for its St. Jude heart devices following a U.S. government investigation into claims the products are vulnerable to potentially life-threatening hacks.",
        "date": "01092017",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott releases cyber updates for St. Jude devices after gov't probe "
    },
    {
        "content": "WASHINGTON Healthcare company Abbott Laboratories  has won U.S. antitrust approval for its proposed $25 billion acquisition of medical device maker St. Jude Medical Inc   the U.S. Federal Trade Commission said on Tuesday. | Video ",
        "date": "12282016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Abbott gets U.S. antitrust approval to buy St. Jude Medical "
    },
    {
        "content": "WASHINGTON U.S. antitrust enforcers are poised to approve health care company Abbott Laboratories'  purchase of medical device maker St. Jude Medical Inc   two sources knowledgeable about the deal said on Thursday.",
        "date": "12222016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Exclusive: U.S. regulator poised to approve Abbott purchase of St Jude - sources "
    },
    {
        "content": "Abbott Laboratories  said on Wednesday that it had moved to terminate its proposed acquisition of Alere Inc   citing a \"substantial loss\" in the value of the diagnostics company since they struck a deal 10 months back.",
        "date": "12082016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Abbott seeks to abort planned acquisition of Alere "
    },
    {
        "content": "BRUSSELS  Nov 23 The European Commission on Wednesday said it has given its conditional approval to U.S. medical device maker Abbott Laboratories' bid for peer St Jude Medical Inc.",
        "date": "11232016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "EU regulator conditionally approves Abbott's purchase of St Jude "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 18 (Fitch) Fitch Ratings has assigned an 'A(EXP)' rating with  a Negative Rating Watch to Abbott Laboratories' (ABT  Abbott) notes offering.  The net proceeds are expected to be used to fund the company's acquisition of  St. Jude Medical Inc. (STJ  St. Jude). Abbott is also in the process of  potentially acquiring Alere Inc. (Alere). Fitch will resolve the Rating Watch as more details regarding the transaction  become ",
        "date": "11182016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Fitch Rates Abbott's Notes Offering 'A(EXP)'; Rating Watch Negative "
    },
    {
        "content": "EU antitrust regulators are expected to give conditional clearance to U.S. medical device maker Abbott Laboratories'  $25 billion bid for rival St. Jude Medical Inc   a person familiar with the matter said on Tuesday.",
        "date": "11152016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Exclusive: EU regulators seen clearing $25 billion Abbott  St Jude deal: source "
    },
    {
        "content": "Nov 15 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Tuesday:",
        "date": "11152016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Deals of the day - Mergers and acquisitions "
    },
    {
        "content": "* Abbott laboratories - japan has approved company's absorb bioresorbable heart stent  Source text for Eikon:  Further company coverage:",
        "date": "11072016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott says Japan approves its absorbable heart stent "
    },
    {
        "content": "The 2nd U.S. Circuit Court of Appeals has rejected two drug wholesalers' appeal of an injunction barring them from selling in the U.S. blood glucose test strips made by Abbott Laboratories for overseas sale.",
        "date": "11032016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "2nd Circuit upholds injunction barring sales of glucose test strips "
    },
    {
        "content": "BRUSSELS  Nov 3 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "11032016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "EU mergers and takeovers (Nov 3) "
    },
    {
        "content": "BRUSSELS Medical device maker Abbott Laboratories  has offered concessions in an attempt to secure EU antitrust approval for its $25 billion bid for St Jude Medical Inc   according to the European Commision.",
        "date": "11032016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott offers EU concessions over $25 billion St. Jude deal "
    },
    {
        "content": "BRUSSELS  Nov 3 Medical device maker Abbott Laboratories has offered concessions in an attempt to secure EU antitrust approval for its $25 billion bid for St Jude Medical Inc  according to the European Commision.",
        "date": "11032016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott offers EU concessions over $25 bln St Jude deal "
    },
    {
        "content": "* Companies continue to expect transaction to close by end of year",
        "date": "10262016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-St. Jude Medical shareholders approve merger with Abbott "
    },
    {
        "content": "* Alere shareholders approve merger with Abbott; over 98 percent of votes cast at a special meeting voted in favor of the merger  Source text for Eikon:  Further company coverage:",
        "date": "10212016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Alere shareholders approve merger with Abbott "
    },
    {
        "content": "Oct 19 Abbott Laboratories said on Wednesday it was pushing ahead to complete its planned purchases of medical device maker St. Jude Medical Inc and diagnostics company Alere Inc despite lingering questions about product safety and government investigations.",
        "date": "10202016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "CORRECTED-UPDATE 3-Abbott moves ahead on St. Jude  Alere deals  but investors fret "
    },
    {
        "content": "* People's Republic of China clears Abbott acquisition of Alere",
        "date": "10202016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-China clears Abbott's acquisition of Alere "
    },
    {
        "content": "WASHINGTON  Oct 17 Omnicare Inc  the largest nursing home pharmacy in the United States  will pay $28.125 million to resolve civil charges that it solicited and received kickbacks from Abbott Laboratories to promote its anti-seizure drug Depakote  the U.S. Justice Department said Monday.",
        "date": "10172016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Omnicare to pay $28 mln to settle charges it got kickbacks from Abbott Labs "
    },
    {
        "content": "Abbott Laboratories said on Wednesday it was pushing ahead to complete its planned purchases of medical device maker St. Jude Medical Inc and diagnostics company Alere Inc despite lingering questions about product safety and government investigations.",
        "date": "10192016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott moves ahead on St. Jude  Alere deals  but investors fret "
    },
    {
        "content": "Abbott Laboratories  which is in the process of buying St. Jude Medical Inc for $25 billion  said the companies would sell some of their medical devices to Japan-based Terumo Corp for about $1.12 billion.",
        "date": "10182016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "St. Jude and Abbott to sell some medical devices for $1.12 billion "
    },
    {
        "content": "* Says continues to believe Alere Inc would be good strategic  long term fit  for Abbott",
        "date": "10192016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott says pursuing all necessary regulatory approvals to buy Alere "
    },
    {
        "content": "Oct 18 Abbott Laboratories  which is in the process of buying St. Jude Medical Inc for $25 billion  said the companies would sell some of their medical devices to Japan-based Terumo Corp for about $1.12 billion.",
        "date": "10182016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 2-St. Jude and Abbott to sell some medical devices for $1.12 bln "
    },
    {
        "content": "Oct 19 St. Jude CEO  in conference call with analysts:",
        "date": "10192016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-St. Jude says Muddy Waters misleading patients for own financial gain "
    },
    {
        "content": "* Q3 earnings per share view $0.58 -- Thomson Reuters I/B/E/S",
        "date": "10192016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott Q3 GAAP loss per share $0.24 from continuing ops "
    },
    {
        "content": "* St. Jude Medical and Abbott to sell portion of vascular closure and electrophysiology businesses to Terumo Corporation",
        "date": "10182016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-St. Jude and Abbott to divest two businesses to Terumo Corp "
    },
    {
        "content": "* Celgene and Agios announce collaborations with Abbott for diagnostic identification of IDH mutations in AML",
        "date": "10122016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Celgene & Agios collaborates with Abbott to develop diagnostic tests for leukemia "
    },
    {
        "content": "Oct 19 Abbott Laboratories  which is in the process of acquiring St. Jude Medical Inc  reported a nearly 3 percent rise in quarterly sales  fueled by strength in its generic drug and medical device businesses.",
        "date": "10192016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott's third-quarter revenue rises nearly 3 percent "
    },
    {
        "content": "Oct 18 Abbott Laboratories and St. Jude Medical Inc   said they would sell some of their medical devices to Japan-based Terumo Corp for about $1.12 billion.",
        "date": "10182016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "St. Jude and Abbott to sell some medical devices for $1.12 bln "
    },
    {
        "content": "* Q3 earnings per share view $1.01 -- Thomson Reuters I/B/E/S",
        "date": "10192016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-St. Jude Medical Q3 earnings per share $0.73 "
    },
    {
        "content": "BRUSSELS  Oct 18 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10182016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "EU mergers and takeovers (Oct 18) "
    },
    {
        "content": "BRUSSELS EU antitrust regulators will decide by Nov. 9 whether to clear U.S. pharmaceuticals company Abbott Laboratories'  $25-billion bid for St. Jude Medical Inc  aimed at helping it better compete with bigger rivals.",
        "date": "10042016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "EU ruling on $25 billion Abbott  St. Jude deal due by November 9 "
    },
    {
        "content": "BRUSSELS  Oct 4 EU antitrust regulators will decide by Nov. 9 whether to clear U.S. pharmaceuticals company Abbott Laboratories' $25-billion bid for St. Jude Medical Inc aimed at helping it better compete with bigger rivals.",
        "date": "10042016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "EU ruling on $25 bln Abbott  St Jude deal due by Nov. 9 "
    },
    {
        "content": "* Terumo Corp is looking to purchase a portion of Abbott Laboratories' medical device business - Nikkei",
        "date": "09292016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Terumo Corp looks to purchase portion of Abbott Laboratories' medical device business - Nikkei "
    },
    {
        "content": "* Abbott receives FDA approval for the FreeStyle Libre Pro System  a revolutionary diabetes sensing technology for healthcare professionals to use with their patients  Source text for Eikon:  Further company coverage:",
        "date": "09282016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott receives FDA approval for the FreeStyle Libre Pro System "
    },
    {
        "content": "* Research Shows Malnutrition Associated With Disease Increases Medical Spending By More Than $1 Billion Yearly In California  New York  Texas Florida",
        "date": "09212016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott says malnutrition adds $15.5 bln annually to direct U.S. medical costs "
    },
    {
        "content": "* Moody's says expectations for Abbott's ratings unchanged following news of medical optics sale  Source text for Eikon:  Further company coverage:",
        "date": "09192016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Moody's says expectations for Abbott's ratings unchanged "
    },
    {
        "content": "Abbott Laboratories  said it would sell its eye care business to Johnson & Johnson  for about $4.33 billion in cash to focus on cardiovascular devices and diagnostics business.",
        "date": "09162016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Abbott to sell its eye care business to J&J for about $4.33 billion "
    },
    {
        "content": "Sept 16 Abbott Laboratories said it would sell its eye care business to Johnson & Johnson  for about $4.33 billion in cash to focus on cardiovascular devices and diagnostics business.",
        "date": "09162016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 3-Abbott to sell its eye care business to J&J for about $4.33 bln "
    },
    {
        "content": "* Net impact of this transaction is not expected to impact Abbott's overall targeted ongoing earnings per share in 2017.",
        "date": "09162016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott to sell Abbott Medical Optics to Johnson & Johnson for $4.325 bln "
    },
    {
        "content": "Sept 16 Abbott Laboratories is in talks to sell its eye-surgery business to Johnson & Johnson  the Wall Street Journal reported  citing sources familiar with the matter.",
        "date": "09162016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott in talks to sell its eye-surgery business to J&J - WSJ "
    },
    {
        "content": "Sept 8 Medical device maker Abbott Laboratories  and Alere Inc agreed on Thursday to work with a mediator to settle their dispute over Abbott's role in obtaining U.S. antitrust clearance for its $5.8 billion takeover of the diagnostics company  but Alere voiced concern about the speed of the process.",
        "date": "09082016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott  Alere agree to mediate merger dispute "
    },
    {
        "content": "NEW YORK/WILMINGTON  Del. A Delaware judge on Friday granted a motion to expedite Alere Inc's lawsuit against Abbott Laboratories  which seeks to ensure that Abbott lives up to the terms of its $5.8 billion takeover of the diagnostics company  representatives for Alere said.",
        "date": "09022016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Delaware judge expedites Alere lawsuit against Abbott "
    },
    {
        "content": "Alere Inc alleges Abbott Laboratories  is trying to stymie its planned $5.8 billion takeover of the diagnostics company by purposefully delaying key submissions to anti-trust regulators  according to a lawsuit made public on Tuesday.",
        "date": "08312016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Alere lawsuit accuses Abbott of 'buyer's remorse' in proposed merger "
    },
    {
        "content": "NEW YORK/WILMINGTON  Del.  Sept 2 A Delaware judge on Friday granted a motion to expedite Alere Inc's  lawsuit against Abbott Laboratories  which seeks to ensure that Abbott lives up to the terms of its $5.8 billion takeover of the diagnostics company  representatives for Alere said.",
        "date": "09022016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 1-Delaware judge expedites Alere lawsuit against Abbott "
    },
    {
        "content": "NEW YORK  Sept 2 A Delaware judge on Friday granted a motion to expedite Alere Inc's lawsuit against Abbott Laboratories  which seeks to ensure that Abbott lives up to the terms of its $5.8 billion takeover of the diagnostics company  representatives for Alere said.",
        "date": "09022016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Delaware Judge expedites Alere lawsuit against Abbott "
    },
    {
        "content": "Aug 31 Alere Inc alleges Abbott Laboratories is trying to stymie its planned $5.8 billion takeover of the diagnostics company by purposefully delaying key submissions to anti-trust regulators  according to a lawsuit made public on Tuesday.",
        "date": "08312016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "CORRECTED-Alere lawsuit accuses Abbott of 'buyer's remorse' in proposed merger "
    },
    {
        "content": "Aug 25 The stock of pacemaker manufacturer St. Jude Medical Inc fell sharply on Thursday after short-selling firm Muddy Waters said it had placed a bet that the shares would fall  claiming its implanted heart devices were vulnerable to cyber attacks.",
        "date": "08252016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 4-St Jude stock shorted on heart device hacking fears; shares drop "
    },
    {
        "content": "Aug 26 One day after a short seller claimed that St. Jude Medical Inc's heart implants are vulnerable to deadly cyber attacks  investors appear most concerned about whether the accusation will derail St. Jude's $24 billion planned deal for Abbott Labs to buy it.",
        "date": "08262016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Whiplashed investors stay skittish about St. Jude "
    },
    {
        "content": "Diagnostic-testing company Alere Inc  said on Friday it sued Abbott Laboratories  in an attempt to force the company to move ahead with its $5.8 billion takeover of Alere.",
        "date": "08262016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Alere sues Abbott over $5.8 billion takeover "
    },
    {
        "content": "Aug 26 Diagnostic-testing company Alere Inc  said on Friday it sued Abbott Laboratories in an attempt to force the company to move ahead with its $5.8 billion takeover of Alere.",
        "date": "08262016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 2-Alere sues Abbott over $5.8 bln takeover "
    },
    {
        "content": "Aug 26 Alere Inc  which has agreed to be bought by Abbott Laboratories  said on Friday it filed a complaint  seeking to compel Abbott to obtain all antitrust approvals required to complete the deal.",
        "date": "08262016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Alere drags Abbott to court over $5.8 bln deal "
    },
    {
        "content": "Abbott Laboratories reported better-than-expected quarterly sales and profit as strong sales in its medical device business more than made up for the hit from an economic turmoil in Venezuela.",
        "date": "07202016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Abbott sales beat on higher demand for medical devices "
    },
    {
        "content": "* Indexes up: Dow 0.24 pct  S&P 0.47 pct  Nasdaq 1.13 pct   (Updates to late afternoon)",
        "date": "07202016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "US STOCKS-Microsoft propels Wall Street to new record highs "
    },
    {
        "content": "* Shares up 2.3 pct   (Adds details about St. Jude  Alere acquisitions and share move)",
        "date": "07202016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 3-Abbott sales beat on higher demand for medical devices "
    },
    {
        "content": "* Q2 total diagnostics sales $1 226 million versus $1 177 million last year",
        "date": "07202016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott reports Q2 2016 GAAP earnings per share $0.40 from continuing operations "
    },
    {
        "content": "July 20 Abbott Laboratories reported a 3.2 percent rise in quarterly sales  helped by strength in its branded generics and medical device businesses.",
        "date": "07202016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott Labs reports 3.2 percent rise in sales "
    },
    {
        "content": "* Health Canada approves Abbott's Absorb bioresorbable stent  the first fully dissolving heart stent",
        "date": "07142016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Health Canada approves Abbott's 'Absorb' bioresorbable stent "
    },
    {
        "content": "* Abbott labs  st. Jude medical each received request for additional information from u.s. Ftc relating to abbott's potential acquisition of st. Jude medical",
        "date": "07122016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-St Jude and Abbott Labs receive request for additional information from U.S. FTC "
    },
    {
        "content": "July 5 U.S. health regulators said on Tuesday they approved a stent by Abbott Laboratories that is the first designed to be absorbed into the bloodstream after it is implanted.",
        "date": "07052016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott wins U.S. approval for stent that absorbs into body "
    },
    {
        "content": "July 5 U.S. health regulators said on Tuesday they approved a stent by Abbott Laboratories that is the first designed to be absorbed into the bloodstream after it is implanted.",
        "date": "07052016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 2-Abbott wins U.S. approval for stent that absorbs into body "
    },
    {
        "content": "* Abbott announces positive results from groundbreaking study of Freestyle Libre system for people with type 1 diabetes",
        "date": "06132016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott announces results from study of Freestyle Libre system for type 1 diabetes "
    },
    {
        "content": "* Sets quarterly dividend of $0.26 per share  Source text for Eikon:  Further company coverage:",
        "date": "06102016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott sets quarterly dividend of $0.26/shr "
    },
    {
        "content": "* Slate Retail REIT announces the purchase of Abbott's village in Georgia",
        "date": "05162016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Slate Retail REIT to acquire Abbott's village in Georgia "
    },
    {
        "content": "* Announces certain developments relating to the pending merger transaction with abbott laboratories",
        "date": "04292016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Alere obtains requisite lender approval for extension to file Form 10 "
    },
    {
        "content": "Abbott Laboratories  said on Thursday that it would buy St. Jude Medical Inc  in a $25 billion deal to expand its heart device business  but investors worried that the acquisition would not pay off as promised.",
        "date": "04282016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Abbott to buy St. Jude for $25 billion to boost heart devices "
    },
    {
        "content": "NEW YORK A US$17.2bn bridge loan that backs Abbott Laboratories’ US$25bn acquisition of medical device maker St. Jude Medical will boost investment grade loan volume that so far this year has been depressed by volatility in equities and global economic uncertainty.",
        "date": "04282016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "LPC: Abbott’s $17.2 billion loan backing St. Jude acquisition set to boost M&A volume "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 28 (Fitch) Fitch Ratings has maintained Abbott Laboratories'  (ABT  Abbott) 'A'/'F1' ratings on Rating Watch Negative. The rating action  follows the announcement of Abbott's intention to acquire St. Jude Medical Inc.  (STJ  St. Jude) and its previously announced agreement from February 2016 to  acquire Alere Inc. (Alere). Fitch will resolve the Rating Watch as more details regarding the transactions  become available. Ho",
        "date": "04282016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Fitch Maintains Abbott on Rating Watch Negative "
    },
    {
        "content": "NEW YORK  April 28 A US$17.2bn bridge loan that backs Abbott Laboratories' US$25bn acquisition of medical device maker St. Jude Medical will boost investment grade loan volume that so far this year has been depressed by volatility in equities and global economic uncertainty.",
        "date": "04282016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 1-LPC: Abbott's US$17.2bn loan backing St. Jude acq. set to boost M&A volume "
    },
    {
        "content": "* Q1 GAAP earnings per share $0.04 from continuing operations",
        "date": "04202016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott reports Q1 GAAP earnings $0.04/shr from continuing operations "
    },
    {
        "content": "NEW YORK  April 28 A US$17.2bn bridge loan that backs Abbott Laboratories' US$25bn acquisition of medical device maker St. Jude Medical will boost investment grade loan volume that so far this year has been depressed by volatility in equities and global economic uncertainty.",
        "date": "04282016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "LPC: Abbott's US$17.2bn loan backing St. Jude acq. set to boost M&A volume "
    },
    {
        "content": "* Abbott Laboratories ratings remain on creditwatch negative on planned acquisition of St. Jude Medical  Source text: (http://bit.ly/21hkyCp)   (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "04282016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-S&P- Abbott Laboratories ratings remain on creditwatch negative on planned acquisition of St. Jude "
    },
    {
        "content": "* Transaction expected to be accretive to abbott's adjusted earnings per share(1) in first full year after closing and increasing thereafter",
        "date": "04282016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott to acquire St. Jude medical "
    },
    {
        "content": "April 28 Abbott Laboratories said it agreed to buy medical device maker St. Jude Medical Inc  for $25 billion.",
        "date": "04282016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott to acquire St. Jude Medical for $25 bln "
    },
    {
        "content": "A Dallas federal court jury has ruled in favor of Abbott Laboratories in a potentially billion-dollar whistleblower lawsuit over off-label promotion of bile duct stents for use in blood vessels.",
        "date": "04082016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Abbott wins defense verdict in fraud case over bile duct stents "
    },
    {
        "content": "* Says CEO Miles White's 2015 total compensation was $19.4 million versus $17.7 million in 2014 - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "03182016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Abbott laboratories announces CEO 2015 total compensation -SEC filing "
    },
    {
        "content": "U.S. government scientists have raised questions about the potential risks to patients of heart attacks and blood clots from Abbott Laboratories' novel coronary stent that dissolves after it is implanted.",
        "date": "03142016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "FDA advisers to weigh risks of Abbott’s dissolving stent "
    },
    {
        "content": "March 15 A medical advisory panel to the U.S. Food and Drug Administration on Tuesday recommended approval of a first-of-its-kind heart stent from Abbott Laboratories  that dissolves after it is implanted.",
        "date": "03152016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "UPDATE 2-U.S. panel backs Abbott stent that dissolves in the body "
    },
    {
        "content": "March 14 U.S. government scientists have raised questions about the potential risks to patients of heart attacks and blood clots from Abbott Laboratories' novel coronary stent that dissolves after it is implanted.",
        "date": "03142016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "FDA advisers to weigh risks of Abbott's dissolving stent "
    },
    {
        "content": "MUMBAI/NEW DELHI An Indian court granted U.S. drugmaker Pfizer   an interim injunction on a ban on its popular cough syrup Corex  days after the government ordered it to be prohibited citing a potential risk to humans.",
        "date": "03142016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Indian court grants Pfizer temporary relief on cough syrup ban "
    },
    {
        "content": "* On separate question of whether there is reasonable assurance that device is efficacious  vote was 10 to 0 in favor",
        "date": "03152016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott's Absorb earns positive review by FDA advisory committee "
    },
    {
        "content": "MUMBAI  March 13 A powerful antibiotic combination that is marketed in India by U.S. pharmaceutical giant Abbott Laboratories is among 344 drug combinations that have been banned by the Indian health authorities.",
        "date": "03132016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Antibiotic combination marketed by Abbott in India on list of banned drugs "
    },
    {
        "content": "A medical advisory panel to the U.S. Food and Drug Administration on Tuesday recommended approval of a first-of-its-kind heart stent from Abbott Laboratories that dissolves after it is implanted.",
        "date": "03152016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "U.S. FDA panel backs Abbott stent that dissolves in the body "
    },
    {
        "content": "* Pfizer says banned syrup brought in $26 mln in Apr-Dec   (Adds statement from Pfizer's India unit)",
        "date": "03142016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 4-Indian court grants Pfizer temporary relief on cough syrup ban "
    },
    {
        "content": "NEW DELHI India has banned the manufacture and sale of more than 300 combination medicines  including two widely used cough syrups  being sold without government approval  a senior health ministry official said on Saturday.",
        "date": "03132016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "India bans more than 300 combination drugs sold illegally "
    },
    {
        "content": "March 15 Alere Inc  which has agreed to be acquired by Abbott Laboratories  said it had received a grand jury subpoena from the U.S. Department of Justice seeking documents relating to its sales practices in Africa  Asia and Latin America.",
        "date": "03152016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Alere receives grand jury subpoena from U.S. DoJ "
    },
    {
        "content": "MUMBAI/NEW DELHI  March 14 An Indian court granted U.S. pharmaceuticals firm Pfizer Inc's   Indian unit a stay order on Monday  pending a further hearing  on a government ban on its popular cough syrup Corex  two lawyers representing the drugmaker told Reuters.",
        "date": "03142016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "CORRECTED-UPDATE 3-Indian court grants Pfizer stay on ban of popular cough syrup "
    },
    {
        "content": "MUMBAI A powerful antibiotic combination that is marketed in India by U.S. pharmaceutical giant Abbott Laboratories is among 344 drug combinations that have been banned by the Indian health authorities.",
        "date": "03142016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Antibiotic combination marketed by Abbott in India on list of banned drugs "
    },
    {
        "content": "NEW DELHI  March 14 U.S.-pharmaceutical giant Abbott Laboratories' India unit  will comply with all legal requirements of a government order that bans more than 300 combination drugs in the country  a company spokesman said on Monday.",
        "date": "03142016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott India says to comply with government order on drugs ban "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 02 (Fitch) Fitch Ratings has placed Abbott Laboratories'  (Abbott) ratings on Negative Rating Watch following its announced intention to  acquire Alere  Inc. (ALR). Abbott had $8.4 billion in outstanding debt at Sept. 30  2015. A full list of  Fitch's ratings actions follows at the end of this release. KEY RATING DRIVERS Sound Acquisition  Increased Leverage: Abbott plans to acquire ALR for roughly  $5.8 billion cash a",
        "date": "02022016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Fitch Places Abbotts's Ratings on Negative Watch "
    },
    {
        "content": "Feb 1 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Monday:",
        "date": "02012016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Abbott Laboratories  said it would buy Alere Inc  for $5.8 billion to become a leader in point-of-care testing  a fast-growing market as physicians increasingly adopt rapid tests that speed up treatment.",
        "date": "02012016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott Labs to buy diagnostics company Alere for $5.8 billion "
    },
    {
        "content": "Feb 1 Abbott Laboratories said it would buy Alere Inc for $5.8 billion and become the leader in point-of-care diagnostic testing  a market that is growing as physicians increasingly adopt rapid tests that speed up treatment.",
        "date": "02012016",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 4-Abbott says to buy diagnostic test maker Alere for $5.8 bln "
    },
    {
        "content": "* Abbott will register and sell house dust mite (HDM) sublingual allergy immunotherapy (SLIT) tablet in 7 new growth markets in SE Asia\u007f",
        "date": "01282016",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "BRIEF-Alk Abello \u007fexpands partnership into South-East Asian growth markets\u007f "
    },
    {
        "content": "CHICAGO  Dec 2 Top medical device makers are investing heavily in a new way to treat leaky mitral heart valves  a serious condition affecting millions of people  but it will be at least four years before the technology reaches the U.S. market.",
        "date": "12022015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Market for new heart valve device could take years to build "
    },
    {
        "content": "NEW DELHI Drugmaker Abbott Healthcare is challenging West Bengal's accusation that a sample of the company's cough syrup contained excessive levels of codeine  the second multinational to question India's regulatory testing regime in recent months.",
        "date": "10272015",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Exclusive - Abbott tangles with Indian regulators over cough syrup complaint "
    },
    {
        "content": "NEW YORK  Oct 23 A former board member of Chile's CFR Pharmaceuticals SA has reached a $13.2 million settlement to resolve charges by a U.S. regulator that he engaged in insider trading ahead of Abbott Laboratories'  $2.9 billion acquisition of the drug company.",
        "date": "10232015",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Chilean in $13.2 mln insider trading accord with U.S. regulators "
    },
    {
        "content": "NEW DELHI Indian regulators are privately pressuring major drug firms to better police how they sell popular codeine-based cough syrups to tackle smuggling and addiction  a move that is reducing supplies of a medicine doctors say is an effective treatment. | Video ",
        "date": "10272015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Exclusive: India battles big pharma over cough syrup abuse  reducing supplies "
    },
    {
        "content": "Abbott Laboratories Inc  reported better-than-expected quarterly sales as demand rose for its generic drugs in emerging markets  including Latin America and China.",
        "date": "10212015",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Abbott sales beat as demand for generic drugs rises "
    },
    {
        "content": "WASHINGTON Nursing home pharmacy PharMerica Corp will pay $9.25 million \"to resolve allegations that it solicited and received kickbacks\" to promote Abbott Labs' psychiatric drug Depakote for nursing home patients  the Department of Justice said on Wednesday.",
        "date": "10072015",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "PharMerica to pay $9.25 million over allegations of kickbacks from Abbott Labs: DOJ "
    },
    {
        "content": "WASHINGTON  Oct 7 Nursing home pharmacy PharMerica Corp will pay $9.25 million \"to resolve allegations that it solicited and received kickbacks\" to promote Abbott Labs' psychiatric drug Depakote for nursing home patients  the Department of Justice said on Wednesday.",
        "date": "10072015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "CORRECTED-(Official) PharMerica to pay $9.25 mln over allegations of kickbacks from Abbott Labs -DOJ "
    },
    {
        "content": "NEW DELHI Drugmaker Abbott Healthcare is challenging an Indian state's accusation that a sample of the company's cough syrup contained excessive levels of codeine  the second multinational to question India's regulatory testing regime in recent months.",
        "date": "09132015",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Exclusive: Abbott tangles with regulators over Indian cough syrup complaint "
    },
    {
        "content": "NEW DELHI Drugmaker Abbott Healthcare is challenging an Indian state's accusation that a sample of the company's cough syrup contained excessive levels of codeine  the second multinational to question India's regulatory testing regime in recent months.",
        "date": "09142015",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Abbott tangles with regulators over Indian cough syrup complaint "
    },
    {
        "content": "NEW DELHI Drugmaker Abbott Healthcare is challenging West Bengal's accusation that a sample of the company's cough syrup contained excessive levels of codeine  the second multinational to question India's regulatory testing regime in recent months.",
        "date": "09142015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Exclusive - Abbott tangles with Indian regulators over cough syrup complaint "
    },
    {
        "content": "Drugmaker Abbott Laboratories   knocking down a report in the Financial Times  denied on Thursday that it was preparing a bid for medical device maker St Jude Medical Inc .",
        "date": "08272015",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Drugmaker Abbott says not pursuing an offer for St Jude Medical "
    },
    {
        "content": "* Indexes up: Dow 2.26 pct  S&P 2.43 pct  Nasdaq 2.48 pct   (Adds details  updates prices)",
        "date": "08272015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "US STOCKS-Wall St surges for second day on strong GDP data "
    },
    {
        "content": "* Indexes up: Dow 1.57 pct  S&P 1.77 pct  Nasdaq 1.86 pct   (Adds details  changes comment  updates prices)",
        "date": "08272015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "US STOCKS-Wall St extends gains after strong GDP data "
    },
    {
        "content": "Aug 27 Drugmaker Abbott Laboratories  knocking down a report in the Financial Times  denied on Thursday that it was preparing a bid for medical device maker St Jude Medical Inc.",
        "date": "08272015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "REFILE-UPDATE 3-Drugmaker Abbott says not pursuing an offer for St Jude Medical "
    },
    {
        "content": "* Indexes up: Dow 1.38 pct  S&P 1.47 pct  Nasdaq 1.58 pct   (Updates to open)",
        "date": "08272015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "US STOCKS-Wall St extends gains  helped by GDP data "
    },
    {
        "content": "* Futures rise: Dow 166 pts  S&P 19 pts  Nasdaq 46 pts   (Adds details  comment  updates prices)",
        "date": "08272015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "US STOCKS-Wall St set to open higher  helped by GDP data "
    },
    {
        "content": "Aug 27 U.S. stock index futures rose sharply on Thursday  a day after Wall Street posted its biggest one-day gain in four years.",
        "date": "08272015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "US STOCKS-Futures rise as Sept rate hike seems less likely "
    },
    {
        "content": "Aug 27 Drugmaker Abbott Laboratories is preparing a bid for St Jude Medical Inc that would value the medical device maker at about $25 billion  the Financial Times reported  citing people familiar with the matter.",
        "date": "08272015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Drugmaker Abbott preparing bid for device maker St Jude - FT "
    },
    {
        "content": "July 30 Abbott Laboratories on Thursday said it would buy a small private company and has invested in another  with an option to buy  as it places bets on the future growth potential of minimally invasive systems to replace diseased heart valves.",
        "date": "07302015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott strikes deals with heart valve replacement companies "
    },
    {
        "content": "July 30 Abbott Laboratories on Thursday said it would buy a small private company and has invested in another  with an option to buy  as it places bets on the future growth potential of minimally invasive systems to replace diseased heart valves.",
        "date": "07302015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 1-Abbott strikes deals with heart valve replacement companies "
    },
    {
        "content": "* Abbott says will acquire the equity of Tendyne that it does not already own for $225 million upfront",
        "date": "07302015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott announces two Mitral valve transactions "
    },
    {
        "content": "* Abbott  GSK  Lupin and Ipca among firms affected   (Adds details on government's position  results of new study )",
        "date": "07162015",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "UPDATE 1-India expands medicine price control list to include 39 more drugs "
    },
    {
        "content": "Mylan NV's  largest stakeholder  Abbott Laboratories   said it would back Mylan's proposed acquisition of Perrigo Co Plc   potentially helping Mylan fend off interest from Teva Pharmaceutical Industries Ltd .",
        "date": "06162015",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Abbott to vote for Mylan's acquisition of Perrigo "
    },
    {
        "content": "June 16 Mylan NV's largest stakeholder  Abbott Laboratories  said it would back Mylan's proposed acquisition of Perrigo Co Plc  potentially helping Mylan fend off interest from Teva Pharmaceutical Industries Ltd .",
        "date": "06162015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "REFILE-UPDATE 1-Abbott to vote for Mylan's acquisition of Perrigo "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 18 (Fitch) Fitch Ratings has downgraded Abbott Laboratories'  (Abbott) long-term Issuer Default Rating (IDR) by one notch to 'A' and revised  the Rating Outlook to Stable from Negative. In addition  the company's  short-term IDR has been affirmed at 'F1'. Abbott had $8.9 billion in outstanding debt at March 31  2015. A full list of  Fitch's ratings actions follows at the end of this release.  KEY RATING DRIVERS -- Fitch exp",
        "date": "05182015",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Fitch Downgrades Abbotts's L-T IDR to 'A'; Outlook Revised to Stable "
    },
    {
        "content": "LONDON  May 13 AstraZeneca is diving deeper into personalised healthcare with two projects that move the concept beyond cancer into respiratory disorders and heart disease.",
        "date": "05122015",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "AstraZeneca digs into precision medicine with lung  heart deals "
    },
    {
        "content": "May 5 Generic drugmaker Mylan NV  at the center of a high-stakes  three-way takeover battle  on Tuesday reported slightly higher-than-expected first-quarter profit and said it was \"steadfast\" in its commitment to acquire Ireland-based Perrigo Co.",
        "date": "05052015",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Mylan reports profit  maintains commitment to acquire Perrigo "
    },
    {
        "content": "Abbott Laboratories  on Wednesday said its initial proceeds of $5.3 billion from the recent sale to Mylan  of part of its generic drug business were now worth more than $7 billion because of appreciation of the stock it obtained in the deal.",
        "date": "04222015",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "Abbott says its payoff from Mylan deal surged "
    },
    {
        "content": "April 22 Abbott Laboratories on Wednesday said its initial proceeds of $5.3 billion from the recent sale to Mylan of part of its generic drug business were now worth more than $7 billion because of appreciation of the stock it obtained in the deal.",
        "date": "04222015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 1-Abbott says its payoff from Mylan deal surged "
    },
    {
        "content": "April 22 Abbott Laboratories on Wednesday said its initial proceeds of $5.3 billion from the recent sale to Mylan of part of its generic drug business were now worth more than $7 billion because of appreciation of the stock it obtained in the deal.",
        "date": "04222015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "CORRECTED-Abbott says payoff from Mylan deal surges  as Mylan shares leap "
    },
    {
        "content": "Abbott Laboratories  reported a better-than-expected adjusted quarterly profit  driven by its branded generics  international nutrition and diagnostics divisions.",
        "date": "04222015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott profit beats expectations  sales of branded generics jump "
    },
    {
        "content": "April 22 Abbott Laboratories reported a better-than-expected adjusted quarterly profit  driven by its branded generics  international nutrition and diagnostics divisions.",
        "date": "04222015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 1-Abbott profit beats expectations  sales of branded generics jump "
    },
    {
        "content": "April 22 Abbott Laboratories' net earnings from continuing operations more than doubled in the first quarter  with strong performance in its branded generics  international nutrition and diagnostics divisions.",
        "date": "04222015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott Labs profit from continuing operations more than doubles "
    },
    {
        "content": "March 2 U.S. generic drug maker Mylan Inc  is still on the prowl for more deals  after completing the multibillion-dollar acquisition of some of Abbott Laboratories' non-U.S. businesses just last week.",
        "date": "03032015",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "UPDATE 1-Mylan still on the prowl for deals  perhaps one by end 2015 "
    },
    {
        "content": "* Shares in Adcock jump more than four percent   (Adds analyst comment)",
        "date": "02232015",
        "name": "Abbott Laboratories",
        "news_type": "topStory",
        "symbol": "ABT",
        "title": "UPDATE 3-Bidvest makes $515 million bid for rest of Adcock Ingram "
    },
    {
        "content": "Jan 29 Abbott Laboratories' chief executive officer is not worried about the stronger dollar  telling analysts on Thursday his company will better withstand its painful effects than rivals due to its European factories and growing sales of nutritional products  medical diagnostics and medical optics.",
        "date": "01292015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott CEO losing no sleep over stronger dollar "
    },
    {
        "content": "Jan 29 Abbott Laboratories :  * CEO says company sees \"good positive underlying momentum in our businesses\"",
        "date": "01292015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "BRIEF-Abbott says sees positive underlying momentum going into 2015 "
    },
    {
        "content": "Abbott Laboratories  forecast full-year profit largely in line with analysts' estimates even as other large drugmakers have warned of a stronger dollar hurting their results.",
        "date": "01292015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "Abbott Labs 2015 outlook largely in line with estimates "
    },
    {
        "content": "Jan 29 Abbott Laboratories forecast full-year profit largely in line with analysts' estimates even as other large drugmakers have warned of a stronger dollar hurting their results.",
        "date": "01292015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "UPDATE 1-Abbott Labs 2015 outlook largely in line with estimates "
    },
    {
        "content": "BRUSSELS  Jan 28 The European Commission approved on Wednesday the acquisition of Abbot Laboratories'  non-U.S. Developed Markets Specialty and Branded Generics Business (Abbott EPD-DM) by the U.S. based producer of generic pharmaceuticals Mylan Inc  subject to conditions.",
        "date": "01282015",
        "name": "Abbott Laboratories",
        "news_type": "normal",
        "symbol": "ABT",
        "title": "EU approves Mylan purchase of Abbot generics  subject to conditions "
    }
]