[
    {
        "content": "VANCOUVER Barrick Gold Corp  said on Wednesday it would work with the government of Tanzania to find a way for a gold export ban to be lifted on its Acacia Mining  unit and was aiming for a final agreement in the first half of 2018.",
        "date": "10262017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick Gold aims for final Tanzania deal by mid-2018 "
    },
    {
        "content": "VANCOUVER  Oct 26 Barrick Gold Corp said on Wednesday it would work with the government of Tanzania to find a way for a gold export ban to be lifted on its Acacia Mining unit and was aiming for a final agreement in the first half of 2018.",
        "date": "10262017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 3-Barrick Gold aims for final Tanzania deal by mid-2018 "
    },
    {
        "content": "* Barrick Gold Corp - ‍narrowed full-year gold production guidance to 5.3-5.5 million ounces​",
        "date": "10252017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Barrick Gold reports Q3 loss per share $0.01 "
    },
    {
        "content": "VANCOUVER  Oct 25 Barrick Gold Corp  the world's largest gold miner by production  reported a third-quarter net loss on Wednesday  reflecting lower production and a weaker gold price as well as the impact of an export ban on its Tanzanian unit.",
        "date": "10252017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold reports net loss  Tanzania export ban hurts "
    },
    {
        "content": "VANCOUVER  Oct 25 Some mining investors are criticizing Barrick Gold for agreeing to Tanzanian demands in its proposed settlement of a dispute between its Acacia Mining unit and the Tanzanian government  saying this could embolden other host nations to press for bigger concessions from miners.",
        "date": "10252017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold's Tanzania deal may set expensive precedent - shareholders "
    },
    {
        "content": " (Recasts with Barrick statement  adds analyst and Barrick spokesman's comments  background  updates stock prices  changes byline)     By Susan Taylor and Zandi Shabalala     TORONTO/LONDON  Oct 20 Barrick Gold          said on Friday a proposed mining settlement it negotiated with Tanzania for its Acacia Mining          unit was not under threat  even though Acacia said it could not immediately make a $300 million payment included in the deal.     Barrick  which owns 63.9 percent of",
        "date": "10202017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 3-Acacia-Tanzania proposed settlement on track -Barrick "
    },
    {
        "content": "DAR ES SALAAM/TORONTO  Oct 19 Barrick Gold said on Thursday that its African subsidiary Acacia Mining would pay $300 million and split 'economic benefits' from operations with Tanzania under a deal proposed to resolve a months-long dispute.",
        "date": "10192017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 3-Barrick strikes deal with Tanzania to settle tax dispute "
    },
    {
        "content": "* Interserve gets boost from contract win (Releads with closing prices  adds Brexit talk developments  Fresnillo)",
        "date": "10202017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-FTSE closes flat as sterling bounces back on Brexit hopes "
    },
    {
        "content": "DAR ES SALAAM  Oct 19 Barrick Gold has agreed that Tanzania will own a 16 percent stake in three gold mines operated by Barrick's Acacia Mining Plc  the company and a government minister announced on Thursday.",
        "date": "10192017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold and Tanzania reach agreement  govt to take stake in mines "
    },
    {
        "content": "LONDON  Oct 20 A recovery in financials and basic resource stocks boosted Britain's FTSE on Friday after the previous session's losses  as U.S. progress on plans to cut taxes and stronger metals prices helped support banks and miners.",
        "date": "10202017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "FTSE flirts with record levels as miners  banks boost "
    },
    {
        "content": "Canada's Barrick Gold Corp  the world's largest gold miner  estimated a decline in third-quarter gold production amid pressure from the Tanzanian government on its Acacia Mining unit.",
        "date": "10122017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick Gold sees drop in production as Tanzanian troubles drag "
    },
    {
        "content": "Oct 12 Canada's Barrick Gold Corp  the world's largest gold miner  estimated a decline in third-quarter gold production amid pressure from the Tanzanian government on its Acacia Mining unit.",
        "date": "10122017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 2- Barrick Gold sees drop in production as Tanzanian troubles drag "
    },
    {
        "content": "Oct 12 Canada's Barrick Gold Corp  the world's largest gold miner  said on Thursday its gold production fell in the third quarter  hurt by low output at majority owned Acacia Mining.",
        "date": "10122017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-Canada's Barrick Gold reports drop in Q3 gold production "
    },
    {
        "content": "* Barrick reports preliminary third quarter production results",
        "date": "10122017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick reports preliminary third quarter production results "
    },
    {
        "content": "Oct 12 Canada's Barrick Gold Corp  the world's largest gold miner  said its gold production fell in the third quarter  hurt by low production at majority owned Acacia Mining.",
        "date": "10122017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Canada's Barrick Gold estimates drop in Q3 gold production "
    },
    {
        "content": "LONDON  Oct 12 London-listed gold miner Acacia Mining reported on Thursday a drop in production over the last three months  hit by work permit issues and reduced operations at its main Tanzanian mines.",
        "date": "10122017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-Acacia's gold production hit by Tanzania's export ban "
    },
    {
        "content": "Sept 26 New York-based Paulson & Co  led by longtime gold bull John Paulson  called on Tuesday for the world's biggest investors in  gold-mining stocks to form a coalition to tackle miners' \"dreadful\" performance.",
        "date": "09262017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-Hedge fund Paulson & Co declares war on poor gold mining returns "
    },
    {
        "content": "Sept 26 New York-based Paulson & Co  led by longtime gold bull John Paulson  called on Tuesday for the world's biggest investors in  gold-mining stocks to form a coalition to tackle miners' \"dreadful\" performance as it launched a blistering attack on the industry's track record.",
        "date": "09262017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Hedge fund Paulson & Co calls for joint shareholder action vs gold miners "
    },
    {
        "content": "LUSAKA  Sept 11 Zambia's copper production is expected to inch lower this year mainly due to lower output from Konkola Copper Mines  a subsidiary of London-listed Vedanta Resource  the mines ministry said on Monday.",
        "date": "09112017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-Zambia sees copper output easing slightly this year "
    },
    {
        "content": "* Williamson mine employs 1 400 workers (Updates share price  adds analyst  detail)",
        "date": "09112017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 2-Petra Diamonds suspends work at Tanzanian mine after diamonds seizure "
    },
    {
        "content": "Sept 6 Gold miner Acacia  which is locked in a dispute with the Tanzanian government  said it has bought put options covering 210 000 ounces of gold at $1 300 per ounce.",
        "date": "09062017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Gold miner Acacia buys put options at $1 300 per ounce "
    },
    {
        "content": "** Gold miner Acacia (-10.7 pct) at the bottom of the FTSE Midcap Index",
        "date": "09042017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BUZZ-Acacia: to reduce Tanzania operations  cut jobs "
    },
    {
        "content": "TORONTO  Aug 9 With a plump $3.1 billion pile of cash  Newmont Mining Corp is mulling a sweeter dividend to attract a broader shareholder base  a move that makes it an outlier in the still recovering gold sector.",
        "date": "08092017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Cash-rich Newmont Mining mulls boosting dividend as peers pursue debt reduction "
    },
    {
        "content": "* Skeena Resources Ltd - exercised its option to acquire a 100 percent interest in past-producing  high-grade Snip Gold Property from BARRICK GOLD Corp",
        "date": "07312017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Skeena exercises option to acquire Snip "
    },
    {
        "content": "DAR ES SALAAM The Tanzanian government and Barrick Gold have started talks to resolve a tax dispute involving the Canadian company's subsidiary Acacia Mining  the president's office said on Monday.",
        "date": "07312017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Tanzania and Barrick start talks to resolve Acacia row "
    },
    {
        "content": "TORONTO Barrick Gold Corp  the world's largest gold miner by production  has an \"open mind\" and is \"very positive\" about talks getting underway with Tanzania to resolve an export ban  President Kelvin Dushnisky told Reuters on Thursday.",
        "date": "07272017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick president says 'very positive' on Tanzania talks over ban "
    },
    {
        "content": "TORONTO  July 27 Barrick Gold Corp  the world's largest gold miner by production  has an \"open mind\" and is \"very positive\" about talks getting underway with Tanzania to resolve an export ban  President Kelvin Dushnisky told Reuters on Thursday.",
        "date": "07272017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-Barrick president says 'very positive' on Tanzania talks over ban "
    },
    {
        "content": "Barrick Gold Corp  the world's largest gold miner by production  reported better-than-expected quarterly earnings on Wednesday as its mining costs fell and said it would begin talks with the Tanzanian government next week about an export ban.",
        "date": "07262017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick says will start Tanzania talks next week as earnings beat "
    },
    {
        "content": "TORONTO  July 27 Barrick Gold Corp  the world's largest gold miner by production  has an \"open mind\" and is \"very positive\" about talks getting underway with Tanzania to resolve an export ban  President Kelvin Dushnisky told Reuters on Thursday.",
        "date": "07272017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick president: 'very positive' on Tanzania talks to resolve ban "
    },
    {
        "content": "July 26 Barrick Gold Corp  the world's largest gold miner by production  reported better-than-expected quarterly earnings on Wednesday as its mining costs fell and said it would begin talks with the Tanzanian government next week about an export ban.",
        "date": "07262017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 2-Barrick says will start Tanzania talks next week as earnings beat "
    },
    {
        "content": "TORONTO  July 27 Canada's main stock index gained on Thursday as major gold miner Barrick Gold Corp and a string of other companies reported better-than-expected earnings and oil producer Cenovus Energy Inc turned a profit.",
        "date": "07272017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "CANADA STOCKS-TSX rises as Barrick earnings soar  Cenovus turns profit "
    },
    {
        "content": "* Sets quarterly dividend of $0.03 per share Source text for Eikon: Further company coverage:",
        "date": "07262017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick Gold sets quarterly dividend of $0.03 per share "
    },
    {
        "content": "* Barrick's second-half 2017 gold production will be weighted toward fourth quarter - Chief Operating Officer",
        "date": "07272017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick gold output seen heavier in fourth-quarter -COO "
    },
    {
        "content": "TORONTO  July 24 Canada's main stock index fell on Monday  as gold miners broadly weighed and Barrick Gold Corp lost nearly 5 percent after a company it majority owns  Acacia Mining  was hit with a bill for $190 billion in unpaid taxes in Tanzania.",
        "date": "07242017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "CANADA STOCKS-TSX falls  weighed by Barrick and other gold miners "
    },
    {
        "content": "VANCOUVER  July 26 Barrick Gold Corp  the world's largest gold miner by production  reported a big jump in second-quarter profit on Wednesday  reflecting gains related to the sales of stakes in its Veladero gold mine in Argentina and a project in Chile.",
        "date": "07262017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick profit jumps on gains from sales of mine  project stakes "
    },
    {
        "content": "TORONTO  July 24 Canada's main stock index ended lower on Monday  with Barrick Gold Corp falling nearly 5 percent after a company it majority owns  Acacia Mining  was hit by a bill for $190 billion in unpaid taxes in Tanzania.",
        "date": "07242017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "CANADA STOCKS-TSX ends down as Barrick falls on tax bill for Acacia "
    },
    {
        "content": "SANTIAGO  July 13 Workers at the Zaldivar copper mine in Chile  owned by Antofagasta Plc and Barrick Gold Corp  will resume talks with Antofagasta after voting to strike earlier this week  the union said on Thursday.",
        "date": "07142017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Workers at Chile's Zaldivar copper mine to resume labor talks "
    },
    {
        "content": "MELBOURNE  July 14 London copper and aluminium were marking time near recent highs on Friday  underpinned by encouraging economic reports from China and the prospect of aluminium production cuts.",
        "date": "07142017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "CORRECTED-METALS-London copper  aluminium supported by China demand hopes "
    },
    {
        "content": "July 14 Britain's FTSE 100 index is seen opening 11 points higher at 7 424.7 on Friday  according to financial bookmakers  with futures up 0.10 percent ahead of the cash market open.",
        "date": "07142017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-UK Stocks-Factors to watch on July 14 "
    },
    {
        "content": "    July 14 Britain's FTSE 100 index is seen opening 11 points higher at 7 424.7 on Friday  according to financial bookmakers.          * SKY/Twenty-First Century Fox: Rupert Murdoch is unlikely to offer any new concessions to protect the editorial independence of Sky  increasing the chance that the $15 billion takeover deal goes to a lengthy investigation  a person familiar with the situation said.     * ANTOFAGASTA: Workers at the Zaldivar copper mine in Chile  owned by Antofagasta",
        "date": "07142017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UK Stocks-Factors to watch on July 14 "
    },
    {
        "content": "MELBOURNE  July 14 London copper was marking time on Friday at the top of its recent range  with encouraging import data from China and improved prospects for the global economy supporting prices.",
        "date": "07142017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "METALS-London copper supported by China imports "
    },
    {
        "content": "July 11 Britain's FTSE 100 index is seen opening 2 points higher on Tuesday  according to financial bookmakers  with futures up 0.14 percent ahead of the cash market open.",
        "date": "07112017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-UK Stocks-Factors to watch on July 11 "
    },
    {
        "content": "    July 11 Britain's FTSE 100 index is seen opening 2 points higher on Tuesday  according to financial bookmakers.               * ANTOFAGASTA: Workers at the Zaldivar copper mine in Chile  owned by Antofagasta and Barrick Gold Corp  voted to approve a strike on Monday after talks with the company failed  a union leader told Reuters.     * WAITROSE/SAINSBURY'S: British supermarket Waitrose said it is extending its commitment to using the Fairtrade logo on its teas  days after rival ",
        "date": "07112017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UK Stocks-Factors to watch on July 11 "
    },
    {
        "content": "SYDNEY  July 11 Copper held largely steady in Asia on Tuesday amid modest support from investors after losing ground overnight on fresh signs of oversupply.",
        "date": "07112017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "METALS-Copper steady after overnight exit on supply signs "
    },
    {
        "content": "SANTIAGO Workers at the Zaldivar copper mine in Chile  owned by Antofagasta  and Barrick Gold Corp   voted to approve a strike on Monday after talks with the company failed  a union leader told Reuters.",
        "date": "07102017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Workers at Zaldivar copper mine in Chile approve strike "
    },
    {
        "content": " (Adds comment  detail  updates prices)     By Melanie Burton     SYDNEY  July 12 Copper prices climbed in Asia to the highest in more than one week on Wednesday amid a weaker U.S. dollar and concerns about industrial action that could further crimp mine supply.      The dollar fell to a more than one-week low against a basket of major currencies on Tuesday  after U.S. President Donald Trump's eldest son released an email chain citing Russian support for his father before last year's",
        "date": "07122017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "METALS-Weaker dollar  supply worries underpin copper "
    },
    {
        "content": "DAR ES SALAAM Tanzania put more pressure on foreign mining companies on Tuesday by amending mining and tax laws to make it mandatory for the state to own at least 16 percent of mining projects  while also raising export royalties.",
        "date": "07042017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Tanzania turns up heat on overseas miners with state stake law "
    },
    {
        "content": "* Acacia seeks international arbitration (Updates with quotes  context)",
        "date": "07042017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-Tanzania turns up heat on overseas miners with state stake law "
    },
    {
        "content": "* Barrick and Shandong complete formation of joint venture at Veladero mine Source text for Eikon: Further company coverage:",
        "date": "06302017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Barrick and Shandong complete formation of joint venture at Veladero mine "
    },
    {
        "content": "* Tanzania in drive to increase domestic earnings from mining",
        "date": "07042017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Acacia seeks arbitration after Tanzania tears up mining contracts "
    },
    {
        "content": "* Barrick and Novagold to advance ongoing donlin gold project optimization with approved $8-million drill program",
        "date": "06222017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Barrick  Novagold to advance ongoing Donlin gold project optimization "
    },
    {
        "content": "* Says it gets approval from China's commerce ministry to acquire 50 percent stake in Veladero gold mine in Argentina from Barrick Gold",
        "date": "06162017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Shandong Gold gets approval from China's commerce ministry to acquire stake in Argentina mine from Barrick Gold "
    },
    {
        "content": "BUENOS AIRES/TORONTO Authorities in the Argentine province of San Juan lifted restrictions on leaching operations at Barrick Gold Corp's Veladero mine on Thursday  but the world's biggest gold producer said it would not immediately resume full operations.",
        "date": "06152017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Argentina lifts curbs on Barrick mine; full operations lag "
    },
    {
        "content": "BUENOS AIRES/TORONTO  June 15 Authorities in the Argentine province of San Juan lifted restrictions on leaching operations at Barrick Gold Corp's Veladero mine on Thursday  but the world's biggest gold producer said it would not immediately resume full operations.",
        "date": "06152017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 2-Argentina lifts curbs on Barrick mine; full operations lag "
    },
    {
        "content": "* Acacia shares jump as much as 11 pct (Adds wider sector shakeup  Magafuli quote)",
        "date": "06142017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 4-Barrick Gold to hold talks with Tanzania over export row "
    },
    {
        "content": "* Barrick comments on release of second presidential committee report on concentrate exports in Tanzania",
        "date": "06122017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Barrick comments on release of second presidential committee report on concentrate exports in Tanzania "
    },
    {
        "content": "SINGAPORE  June 2 Shandong Gold Mining Co Ltd plans to apply for loans worth up to $1.26 billion via its unit to fund the acquisition of a stake in Barrick Gold Corp's mine in Argentina  the Chinese precious metal producer said on Friday.",
        "date": "06022017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "China's Shandong Gold Mining to seek loans to buy Barrick mine stake "
    },
    {
        "content": "* CEO says getting support from parent barrick gold to resolve export ban in Tanzania",
        "date": "06022017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Acacia getting support from parent Barrick Gold to resolve Tanzania export ban -CEO "
    },
    {
        "content": "BUENOS AIRES  May 29 A strike by one of the labor unions at Barrick Gold Corp's  Veladero mine in Argentina  the site of three cyanide solution spills in 18 months  has ended  the company said on Monday.",
        "date": "05292017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 4-Barrick says strike ends at Veladero mine in Argentina "
    },
    {
        "content": "* Barrick reports end of Veladero work stoppage  formal dialogue with union underway",
        "date": "05292017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick Gold reports end of Veladero work stoppage  formal dialogue with union underway "
    },
    {
        "content": "TORONTO  May 25 Barrick Gold said on Thursday that two mines at its majority-held Acacia Mining   which account for some 6 percent of Barrick's 2017 production guidance  are impacted by Tanzania's current concentrate export ban.",
        "date": "05252017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick flags potential impact from Tanzania export ban "
    },
    {
        "content": "* Says it scraps share private placement plan to fund acquisition of Barrick Gold Corp's Veladero mine",
        "date": "05162017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Shandong Gold scraps placement plan aimed at funding acquisition of Barrick Gold's mine "
    },
    {
        "content": "SAN JUAN  ArgentinaBarrick Gold Corp failed to complete improvements to the Veladero mine in Argentina that could have prevented the third spill of cyanide solution in 18 months  leading to eventual sanctions for the world's biggest gold miner  a judge told Reuters.",
        "date": "05082017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Exclusive: Barrick faces sanctions for Argentina cyanide spills  judge says "
    },
    {
        "content": "LIMA  May 5 Peruvian miners voted on Friday to approve a national strike in June to protest \"anti-labor\" government proposals  Ricardo Juarez  secretary general of the National Federation of Miners  Metallurgists and Steelworkers  told Reuters.",
        "date": "05052017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-Peru mine workers vote to approve June nationwide strike "
    },
    {
        "content": "Barrick Gold gave details on Tuesday of $500 million worth of improvements and expansions it is planning at its Veladero mine in Argentina over the next five years  on a day when its stock price sank 11 percent on disappointing earnings.",
        "date": "04252017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick outlines Argentina mine repair plan as stock dives 11 percent "
    },
    {
        "content": "Barrick Gold reported weaker-than-expected quarterly earnings on Monday and also slashed its forecast for output and hiked costs at its gold mine in Argentina  where cyanide solution spilled recently for the third time in 18 months.",
        "date": "04242017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick Gold slashes Argentina mine output forecast after spill "
    },
    {
        "content": "* Sets quarterly dividend of $0.03 per share Source text for Eikon: Further company coverage:",
        "date": "04252017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick Gold sets quarterly dividend of $0.03 per share "
    },
    {
        "content": "April 25 Barrick Gold Corp has earmarked $500 million over five years for upgrades and expansions to its Veladero mine in Argentina  chief operating officer Richard Williams said on Tuesday  four weeks after a third cyanide solution spill at the mine.",
        "date": "04252017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick earmarks $500 mln for Argentina mine after spill "
    },
    {
        "content": "April 24 Barrick Gold reported weaker-than-expected quarterly earnings on Monday and also slashed its forecast for output and hiked costs at its gold mine in Argentina  where cyanide solution spilled recently for the third time in 18 months.",
        "date": "04242017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 2-Barrick Gold slashes Argentina mine output forecast after spill "
    },
    {
        "content": "* President Dushnisky: third cyanide solution spill in 18 months at Barrick Veladero mine in Argentina was \"completely unacceptable to us\"",
        "date": "04252017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick Argentina cyanide spill \"unacceptable\" - company president "
    },
    {
        "content": "* Barrick Gold Corp says  total debt was reduced by $178 million in Q1",
        "date": "04242017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick Gold Corp reports Q1 earnings per share $0.58 "
    },
    {
        "content": "April 24 Barrick Gold Corp  the world's largest gold miner  reported a first-quarter profit on Monday compared to a loss a year ago helped by the reversal of impairment charges related to its Cerro Casale gold-copper project in Chile after the recent sale of a 25-percent stake in it. The Toronto-based miner said its net earnings for the quarter were $679 million  or 58 cents a share  compared with a net loss of $83 million  or 7 cents a share in the three-month period a year ago. (Re",
        "date": "04242017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold reports first quarter profit vs loss a year ago "
    },
    {
        "content": "    April 24 Gold fell nearly 1 percent on Monday to its weakest in two weeks after centrist Macron led the first round of voting in the French presidential election  boosting stocks and triggering a sell-off of safe-haven bullion.          FUNDAMENTALS     * Spot gold        was down 0.9 percent to $1 273.15 per ounce by 0057 GMT. Bullion prices touched a low of $1 265.90 earlier in the session  the lowest since April 11.     * U.S. gold futures         were down 1.1 percent at $1 2",
        "date": "04242017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "PRECIOUS-Gold falls as stocks gain after French election result "
    },
    {
        "content": "BUENOS AIRES Barrick Gold Corp and its new Chinese partner presented a $500 million plan on Friday to make safety and environmental improvements to the Veladero gold mine in Argentina after a third cyanide spill in 18 months  a company executive said.",
        "date": "04212017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Argentina mulls $500 million safety plan for Barrick's Veladero mine "
    },
    {
        "content": "BUENOS AIRES  April 21 Barrick Gold Corp and its new Chinese partner presented a $500 million plan on Friday to make safety and environmental improvements to the Veladero gold mine in Argentina after a third cyanide spill in 18 months  a company executive said.",
        "date": "04212017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 3-Argentina mulls $500 mln safety plan for Barrick's Veladero mine "
    },
    {
        "content": "TORONTO  April 19 Shanghai-listed Shandong Tyan Home said on Wednesday its negotiations with Barrick Gold Corp to buy a 50-percent stake of the Canadian operator's Kalgoorlie mine have ended without a deal  citing new capital and acquisition rules in China.",
        "date": "04192017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "China's Shandong Tyan says talks over on bid for Barrick's Kalgoorlie "
    },
    {
        "content": "TORONTO  April 19 Shanghai-listed Shandong Tyan Home said on Wednesday its negotiations with Barrick Gold Corp to buy the Canadian operator's 50-percent stake in Kalgoorlie mine have ended without a deal  citing new capital and acquisition rules in China.",
        "date": "04192017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-China's Shandong Tyan says talks over on bid for Barrick's Kalgoorlie "
    },
    {
        "content": "* Says it has had contact with Barrick Gold Corp on investing in Australia's Kalgoorlie gold mine but did not continue negotiation due to recent capital outflow curb and tightened review of overseas acquisition",
        "date": "04192017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Shandong Tyan Home calls off Kalgoorlie deal due to capital curb "
    },
    {
        "content": "TORONTO Barrick Gold must take steps to safeguard investor confidence by ensuring there are no more operating mishaps at its mines after a third incident in 18 months at its big Argentina mine  analysts said.",
        "date": "04122017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick needs to reassure investors after Veladero mine mishaps "
    },
    {
        "content": "* Atac Resources Ltd. announces property earn-in agreement with Barrick Gold Corporation",
        "date": "04102017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Atac Resources announces property earn-in agreement with Barrick Gold Corp "
    },
    {
        "content": "Shares of Barrick Gold  could rise 30 percent in the next year as the gold-mining company  which began restructuring three years ago  develops new projects and increases production  according to the April 10 edition of Barron's.",
        "date": "04092017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Shares of Barrick Gold could rise 30 percent: Barron's "
    },
    {
        "content": "BUENOS AIRES/TORONTO Argentina mining officials told Barrick Gold Corp it must overhaul environmental and operating processes at its Veladero mine  following last week's cyanide solution spill  while the country's environment ministry asked for a total suspension of operations  according to statements on Friday.",
        "date": "04072017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Argentina tells Barrick to overhaul Veladero gold mine "
    },
    {
        "content": "BUENOS AIRES/TORONTO  April 7 Argentina mining officials told Barrick Gold Corp it must overhaul environmental and operating processes at its Veladero mine  following last week's cyanide solution spill  while the country's environment ministry asked for a total suspension of operations  according to statements on Friday.",
        "date": "04072017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 3-Argentina tells Barrick to overhaul Veladero gold mine "
    },
    {
        "content": "* Says it buys 50 percent stake in Barrick Gold's Veladero gold mine in Argentina for $960 million",
        "date": "04062017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Shandong Gold Mining buys stake in Barrick Gold's Veladero mine "
    },
    {
        "content": "TORONTO Barrick Gold Corp's  near billion-dollar deal with Shandong Gold Mining Co Ltd  represents a rich premium for the Canadian miner  while making good on a long-promised plan to forge deep  long-lasting partnerships with China.",
        "date": "04072017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick's Shandong deal cements chairman's China strategy "
    },
    {
        "content": "SHANGHAI China's Shandong Gold Mining Co Ltd  will pay $960 million for a 50 percent stake in Barrick Gold Corp's  Veladero gold mine in Argentina  the Canadian miner said in a press release on Thursday.",
        "date": "04062017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "China's Shandong Gold in $960 million deal for half of Barrick's Veladero mine "
    },
    {
        "content": "SHANGHAI  April 6 China's Shandong Gold Mining Co Ltd will pay $960 million for a 50 percent stake in Barrick Gold Corp's Veladero gold mine in Argentina  the Canadian miner said in a press release on Thursday.",
        "date": "04062017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "China's Shandong Gold in $960 mln deal for half of Barrick's Veladero mine "
    },
    {
        "content": "* Reports restrictions at Veladero mine's heap leach facility",
        "date": "03312017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Barrick reports restrictions at Veladero mine heap leach facility "
    },
    {
        "content": "TORONTO/VANCOUVER China's Shandong Gold Mining Co Ltd is in advanced talks to buy a 50 percent stake in Barrick Gold Corp's Veladero gold mine in Argentina  in a deal that could fetch more than $1 billion  people familiar with the process told Reuters.",
        "date": "04052017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Shandong in advanced talks to buy half Barrick's Veladero mine -sources "
    },
    {
        "content": "* Barrick announces strategic cooperation agreement with Shandong Gold",
        "date": "04062017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick announces strategic cooperation agreement with Shandong Gold Group "
    },
    {
        "content": "TORONTO/VANCOUVER China's Shandong Gold Mining Co Ltd  is in advanced talks to buy a 50 percent stake in Barrick Gold Corp's   Veladero gold mine in Argentina  people familiar with the process told Reuters even as the Canadian miner grappled with a pipe rupture at the site.",
        "date": "04052017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "China's Shandong in advanced talks to buy half of Barrick's Veladero mine: sources "
    },
    {
        "content": "TORONTO/VANCOUVER  April 5 China's Shandong Gold Mining Co Ltd is in advanced talks to buy a 50 percent stake in Barrick Gold Corp's  Veladero gold mine in Argentina  people familiar with the process told Reuters even as the Canadian miner grappled with a pipe rupture at the site.",
        "date": "04052017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 3-China's Shandong in advanced talks to buy half of Barrick's Veladero mine: sources "
    },
    {
        "content": "TORONTO/VANCOUVER  April 5 China's Shandong Gold Mining Co Ltd is in advanced talks to buy a 50 percent stake in Barrick Gold Corp's Veladero gold mine in Argentina  in a deal that could fetch more than $1 billion  people familiar with the process told Reuters.",
        "date": "04052017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "China's Shandong in advanced talks to buy half Barrick's Veladero mine-sources "
    },
    {
        "content": "BUENOS AIRES/TORONTO Argentina's San Juan province ordered Barrick Gold Corp to suspend some activities at its Veladero mine after a pipe carrying gold-bearing solution ruptured on the leach pad  state-run news agency Telam reported on Thursday.",
        "date": "03302017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Argentine province to suspend some Barrick activities: report "
    },
    {
        "content": "* Has reached an agreement with Goldcorp Inc to form a new partnership at cerro casale project in Chile",
        "date": "03282017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Barrick Gold to form new partnership with Goldcorp "
    },
    {
        "content": "BUENOS AIRES  March 29 The decoupling of a pipeline at Barrick Gold Corp's Veladero mine in Argentina on Tuesday posed no threat to the environment  the company said in a statement on Wednesday while local authorities investigated the incident.",
        "date": "03292017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 1-Pipe rupture being repaired at Barrick mine in Argentina "
    },
    {
        "content": "BUENOS AIRES/TORONTO  March 30 Argentina's San Juan province ordered Barrick Gold Corp  to suspend some activities at its Veladero mine after a pipe carrying gold-bearing solution ruptured on the leach pad  state-run news agency Telam reported on Thursday.",
        "date": "03302017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-Argentine province to suspend some Barrick activities -report "
    },
    {
        "content": "BUENOS AIRES  March 30 Argentina's San Juan province ordered Barrick Gold Corp's Veladero mine to suspend some activities after a pipe became decoupled  state-run news agency Telam reported on Thursday.",
        "date": "03302017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Argentina provincial gov't to suspend some Barrick operations-report "
    },
    {
        "content": "VANCOUVER  March 28 Barrick Gold Corp and Goldcorp Inc  the world's No. 1 and No. 3 gold miners by value  have agreed to team up to  potentially develop gold projects in northern Chile  Goldcorp said on Tuesday  as the industry starts to put money into growth again.",
        "date": "03282017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Goldcorp  Barrick  team up on Chile gold mine projects "
    },
    {
        "content": "TORONTO Acacia Mining is losing more than $1 million in revenue each day at two mines in Tanzania because of the country's ban on exports of gold and copper concentrates  the London-listed company said on Friday.",
        "date": "03242017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Acacia Mining: Tanzania ban costs $1 mln daily in revenue "
    },
    {
        "content": "TORONTO  March 24 Acacia Mining is losing more than $1 million in revenue each day at two mines in Tanzania because of the country's ban on exports of gold and copper concentrates  the London-listed company said on Friday.",
        "date": "03242017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 2-Acacia Mining: Tanzania ban costs $1 mln daily in revenue "
    },
    {
        "content": "March 24 Gold miner Acacia Mining said it was incurring an average daily loss of more than $1 million in revenue at its two mines in Tanzania due to a local government directive banning exports of gold and copper concentrate from the country.",
        "date": "03242017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Acacia says Tanzania ore export ban costing over $1 mln in daily revenue "
    },
    {
        "content": "Canadian gold miner Endeavour Mining Corp said on Tuesday it had ended discussions with London-based Acacia Mining Plc regarding a potential merger.",
        "date": "03212017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Canada's Endeavour Mining ends merger talks with Acacia "
    },
    {
        "content": "TORONTO Barrick Gold Corp  the world's biggest gold producer  is exploring options for its Lagunas Norte mine in Peru  including the sale of part or all of the asset  three people with knowledge of the matter told Reuters.",
        "date": "03162017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Exclusive: Barrick Gold explores sale  joint venture for Peru mine - sources "
    },
    {
        "content": "* Six of the TSX's 10 main groups were higher   (Updates to close  adds analyst comment  byline)",
        "date": "02162017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "CANADA STOCKS-TSX ekes out record close with Barrick's help "
    },
    {
        "content": "OTTAWA  Feb 16 Canada's main stock index ended slightly higher on Thursday as Barrick Gold Corp jumped on the company's better-than-expected profits  though that was offset by a drop in Sun Life  which reported a decline in earnings.",
        "date": "02162017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "CANADA STOCKS-TSX edges up on Barrick Gold  materials shares "
    },
    {
        "content": "NEW YORK  Feb 14 Soros Fund Management LLC eliminated its shares in Barrick Gold Corp in the fourth quarter of 2016  13F-HR filings with the U.S. Securities and Exchange Commission showed on Tuesday.",
        "date": "02142017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Soros liquidated Barrick Gold shares in Q4 2016 -filing "
    },
    {
        "content": "* Barrick Gold Corp files for mixed shelf of up to $4 billion  - SEC filing  Source text: (http://bit.ly/2kO39C5)",
        "date": "02162017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick Gold Corp files for mixed shelf of up to $4 bln "
    },
    {
        "content": "OTTAWA  Feb 16 Canada's main stock index was little changed on Thursday after touching a record high as Barrick Gold Corp jumped on the company's better-than-expected profits  but that was offset by a drop in Sun Life  which reported a decline in earnings.",
        "date": "02162017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "CANADA STOCKS-TSX little changed as Barrick helps it touch record "
    },
    {
        "content": "* Barrick Gold to unify Cortez and Goldstrike operations in Nevada into single business unit in 2017 -President Kelvin Dushnisky",
        "date": "02162017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick to consolidate Nevada mines  aim to cut costs "
    },
    {
        "content": "* Barrick - Initiated a prefeasibility study to evaluate construction of an underground mine at Lama  on Argentinean side of Pascua-Lama Project",
        "date": "02152017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Barrick reports progress on projects "
    },
    {
        "content": "TORONTO Barrick Gold Corp reported better-than-expected profits and ambitious debt reduction plans on Wednesday  saying its balance sheet is now healthy enough to boost dividends and exploration spending.",
        "date": "02162017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick posts market-beating profit  boosts spending "
    },
    {
        "content": "* Barrick Gold Corp - Increase in company's quarterly dividend from $0.02 cents per share to $0.03 per share.  Source text for Eikon:  Further company coverage:",
        "date": "02152017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick announces dividend increase "
    },
    {
        "content": "* Barrick Gold Corp - for 2017  production guidance is 5.60-5.90 million ounces of gold  at a cost of sales applicable to gold of $780-$820 per ounce",
        "date": "02152017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick reports Q4 adjusted earnings per share $0.22 "
    },
    {
        "content": "TORONTO  Feb 15 Barrick Gold Corp  reported better-than-expected profits and ambitious debt reduction plans on Wednesday  saying its balance sheet is now healthy enough to boost dividends and exploration spending.",
        "date": "02162017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 2-Barrick posts market-beating profit  boosts spending "
    },
    {
        "content": "TORONTO  Feb 15 Barrick Gold Corp said on Wednesday that fourth-quarter profits rose from last year  reflecting further cost cuts and a rise in metal prices  as the world's largest gold miner increased its dividend and planned to further pare its debt.",
        "date": "02152017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick profit climbs on lower costs  higher gold prices "
    },
    {
        "content": "NEW YORK Soros Fund Management LLC eliminated its shares in Barrick Gold Corp  in the fourth quarter of 2016  13F-HR filings with the U.S. Securities and Exchange Commission showed on Tuesday.",
        "date": "02152017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Soros liquidated Barrick Gold shares in fourth quarter 2016: filing "
    },
    {
        "content": "Canadian miner Barrick Gold Corp  on Wednesday estimated its gold production in 2016 fell 9.8 percent to 5.52 million ounces.",
        "date": "01252017",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick Gold estimates gold output dropped 9.8 percent in 2016 "
    },
    {
        "content": "Jan 25 Canadian miner Barrick Gold Corp  on Wednesday estimated its gold production in 2016 fell 9.8 percent to 5.52 million ounces.",
        "date": "01252017",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold estimates gold output dropped 9.8 pct in 2016 "
    },
    {
        "content": "SANTIAGO/TORONTO Chile has rejected an attempt by local communities to block modifications needed to keep Barrick Gold Corp's  controversial Pascua Lama project alive  a resolution by the ministerial committee involved showed on Wednesday.",
        "date": "12072016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Chile rejects attempt to block modified Barrick Gold mine project "
    },
    {
        "content": "Latin America will play an increasingly important role in Barrick Gold's growth strategy  the world's biggest gold miner said on Tuesday as it named a new director with decades of mining experience in that region.",
        "date": "12062016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick Gold says Latam key to growth as it adds director "
    },
    {
        "content": "TORONTO Barrick Gold is reviewing the financial backing behind an approximately $1.3 billion bid for its stake in Australia's Kalgoorlie mine by Minjar Gold  a unit of Shanghai-listed Shandong Tyan Home  two sources told Reuters.",
        "date": "11242016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick mulls Kalgoorlie bid of roughly $1.3 billion by China's Minjar: sources "
    },
    {
        "content": "TORONTO  Nov 24 Barrick Gold is reviewing the financial backing behind an approximately $1.3 billion bid for its stake in Australia's Kalgoorlie mine by Minjar Gold  a unit of Shanghai-listed Shandong Tyan Home   two sources told Reuters.",
        "date": "11242016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 2-Barrick mulls Kalgoorlie bid of roughly $1.3 bln by China's Minjar-sources "
    },
    {
        "content": "TORONTO  Nov 24 Barrick Gold is reviewing the financial backing behind an approximately $1.3 billion bid for its stake in Australia's Kalgoorlie mine by Minjar Gold  a unit of Shanghai-listed Shandong Tyan Home   two sources told Reuters.",
        "date": "11242016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick mulls Kalgoorlie bid of roughly $1.3 bln by China's Minjar-sources "
    },
    {
        "content": "* Soros Fund Management dissolves share stake in Delta Air Lines Inc",
        "date": "11142016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Soros Fund Management dissolves stake in Delta Air Lines  Comcast  Time Warner "
    },
    {
        "content": "* Barrick and Novagold announce the appointment of Andy Cole as general manager of the Donlin gold project in Alaska  Source text for Eikon:  Further company coverage:",
        "date": "11142016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick  Novagold appoints Andy Cole as general manager of the Donlin Gold Project in Alaska "
    },
    {
        "content": "* Carlin Gold signs $5 million exploration agreement with Barrick at Cortez summit and announces $500 000 private placement financing  Source text for Eikon:  Further company coverage:",
        "date": "11102016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Carlin Gold signs $5 million exploration agreement with Barrick at Cortez summit "
    },
    {
        "content": "* Barrick Gold Corp - co and Barrick North America Finance LLC are offering to purchase series of notes for aggregate purchase price of up to $350 million  Source text for Eikon:  Further company coverage:",
        "date": "11022016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Barrick Gold announces debt tender offer "
    },
    {
        "content": "TORONTO Barrick Gold Corp  hopes to develop a \"steady stream\" of projects on its land in the El Indio belt in Argentina  making it the likeliest candidate for a partnership deal  a top executive said in an interview on Thursday.",
        "date": "10272016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick Argentina projects likeliest for partnerships: exec "
    },
    {
        "content": "TORONTO  Oct 27 Barrick Gold Corp hopes to develop a \"steady stream\" of projects on its land in the El Indio belt in Argentina  making it the likeliest candidate for a partnership deal  a top executive said in an interview on Thursday.",
        "date": "10272016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-Barrick Argentina projects likeliest for partnerships- exec "
    },
    {
        "content": "TORONTO  Oct 27 Barrick Gold Corp will consider offers to buy all or some of its five major mines  including Veladero in Argentina  a top executive said on Thursday  after Reuters reported the company held talks with Chinese miners.",
        "date": "10272016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick says it's open to offers for core mines  including Veladero "
    },
    {
        "content": "TORONTO/VANCOUVER China's Zijin Mining Group Co Ltd and Shandong Gold Mining Co Ltd have held separate talks with Barrick Gold Corp to buy a 50 percent stake in its Veladero gold mine in Argentina  according to four sources with knowledge of the process.",
        "date": "10252016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Exclusive: Chinese miners in talks for stake in Barrick's Veladero mine - sources "
    },
    {
        "content": "TORONTO  Oct 25 Canada's main stock index fell on Tuesday in a broad retreat led by energy stocks as oil prices weakened  while gold miners offset the losses as bullion hit a near three-week high.",
        "date": "10252016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "CANADA STOCKS-Energy losses lead TSX lower  gold miners limit fall "
    },
    {
        "content": "TORONTO  Oct 5 Canada's main stock index ended higher on Wednesday  boosted by solid gains for energy stocks as oil prices jumped  while Barrick Gold Corp rose after it resumed operations at a mine in Argentina.",
        "date": "10052016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "CANADA STOCKS-TSX rises as oil jump boosts energy stocks; Barrick gains "
    },
    {
        "content": "Oct 4 Barrick Gold Corp said on Tuesday normal operations had resumed at its Veladero mine in Argentina following approval from local authorities after processing solution containing cyanide spilled last month.",
        "date": "10042016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 2-Barrick Gold's Argentina mine resumes operations after spill "
    },
    {
        "content": "Oct 4 Barrick Gold Corp said on Tuesday normal operations had resumed at its Veladero mine in Argentina following approval from local authorities after processing solution containing cyanide spilled last month.",
        "date": "10042016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "CORRECTED-UPDATE 1-Barrick Gold's Argentina mine resumes operations after spill "
    },
    {
        "content": "* Barrick announces resumption of operations at Veladero Mine",
        "date": "10042016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick Gold announces resumption of operations at Veladero Mine "
    },
    {
        "content": "BUENOS AIRES/TORONTO  Sept 30 A judge in Argentina ruled that Barrick Gold Corp's operations at its Veladero mine would remain suspended  saying repairs were insufficient to reopen it after a leak of processing solution containing cyanide earlier this month.",
        "date": "09302016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 2-Argentina judge rules Barrick mine to remain suspended "
    },
    {
        "content": "BUENOS AIRES  Sept 30 A judge in Argentina ruled on Friday to keep Barrick Gold Corp's operations at Veladero mine suspended  saying repairs were not sufficient to reopen it after a leak of processing solution containing cyanide earlier this month.",
        "date": "09302016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Argentina judge rules Barrick mine to remain suspended "
    },
    {
        "content": "DENVER Barrick Gold expects to be able to reach its target of reducing debt by $2 billion by year-end even without selling any assets  company President Kelvin Dushnisky said on Monday.",
        "date": "09192016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick could meet 2016 debt cut target from cash flow: president "
    },
    {
        "content": "DENVER  Sept 19 Barrick Gold expects to be able to reach its target of reducing debt by $2 billion by year-end even without selling any assets  company President Kelvin Dushnisky said on Monday.",
        "date": "09192016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-Barrick could meet 2016 debt cut target from cash flow -president "
    },
    {
        "content": "* To acquire a 3.75% net value royalty of Barrick Gold Corp's Cortez gold mine  including Crossroads deposit from private party seller",
        "date": "09192016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Royal Gold increases royalty interests at Cortez Crossroads "
    },
    {
        "content": "DENVER  Sept 19 Barrick Gold expects to be able to reach its target of reducing debt by $2 billion by year-end even without selling any assets  company President Kelvin Dushnisky said on Monday.",
        "date": "09192016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick could meet 2016 debt cut target from cash flow -president "
    },
    {
        "content": "TORONTO Barrick Gold Corp said on Thursday that operations at its Veladero mine in Argentina were temporarily suspended by the government after a \"small quantity\" of processing solution that contains cyanide leaked outside a processing area.",
        "date": "09152016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick's Argentina mine suspended after cyanide spill "
    },
    {
        "content": "TORONTO  Sept 15 Barrick Gold Corp said on Thursday that operations at its Veladero mine in Argentina were temporarily suspended by the government after a \"small quantity\" of processing solution that contains cyanide leaked outside a processing area.",
        "date": "09152016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-Barrick's Argentina mine suspended after cyanide spill "
    },
    {
        "content": "Sept 15 Barrick Gold Corp  the world's largest gold producer  said on Thursday Argentina's San Juan province announced a temporary suspension of operations at the company's Veladero mine.",
        "date": "09152016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick to suspend operations at Argentina mine "
    },
    {
        "content": "* Barrick gold corporation: temporary suspension of operations at Veladero mine",
        "date": "09152016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick Gold suspends operations at Veladero mine "
    },
    {
        "content": "VANCOUVER Barrick Gold Corp   the world's biggest gold producer  said on Monday it would partner with Cisco Systems  to incorporate digital technology in all aspects of its mining business  aiming to improve productivity and reduce costs.",
        "date": "09122016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick Gold partners with Cisco in bid to boost productivity "
    },
    {
        "content": "* Barrick announces appointment of mark hill as chief investment officer  Source text for Eikon:  Further company coverage:",
        "date": "08302016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Barrick appoints Mark Hill as chief investment officer "
    },
    {
        "content": "TORONTO  Sept 1 Barrick Gold Corp  the world's largest gold miner  said Thursday it has brought back a former executive to advance a scaled-back development plan for its suspended Pascua-Lama project that will first focus on Argentina.",
        "date": "09012016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick to focus on scaled-back Pascua-Lama project in Argentina "
    },
    {
        "content": "CARACAS  Aug 26 Venezuela has signed over $5.5 billion in mining deals with companies including Canada's Barrick Gold Corp and China's Shandong Gold  President Nicolas Maduro said on Friday.",
        "date": "08262016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 1-Venezuela says signs $5.5 bln mining deals with companies "
    },
    {
        "content": "* Moody's affirms barrick's baa3 rating; outlook revised to stable",
        "date": "08192016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Moody's affirms Barrick's Baa3 rating  outlook revised to stable "
    },
    {
        "content": "JOHANNESBURG  Aug 17 Harmony Gold's  chief executive said on Wednesday that the South African gold producer  which plans to expand in Africa  could assess Barrick Gold's assets in Acacia.",
        "date": "08172016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "South Africa's Harmony will consider Barrick's Acacia stake - CEO "
    },
    {
        "content": "VANCOUVER/TORONTO  Aug 3 Barrick Gold Corp's  sale of its stake in Australia's Kalgoorlie mine should attract a string of suitors  but its  partner Newmont Mining  may have an advantage over other bidders in the sale process  industry sources say.",
        "date": "08032016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "DEALTALK-Newmont seen in strong position in Barrick Australian mine sale "
    },
    {
        "content": "VANCOUVER/TORONTO Barrick Gold Corp's  sale of its stake in Australia's Kalgoorlie mine should attract a string of suitors  but its  partner Newmont Mining  may have an advantage over other bidders in the sale process  industry sources say.",
        "date": "08032016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Newmont seen in strong position in Barrick Australian mine sale "
    },
    {
        "content": "* Says in near-term it is focused on debt reduction versus dividend increase-President",
        "date": "07282016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Barrick keeps focus on debt reduction-President "
    },
    {
        "content": "July 28 Canada's main stock index was set to open lower on Thursday as oil prices slipped to 3-month lows a day after data showed a surprise rise in U.S. crude and gasoline inventories.",
        "date": "07282016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "CANADA STOCKS-Weak oil prices weigh on futures "
    },
    {
        "content": "* Offering to purchase for cash series of notes for an aggregate purchase price of up to $650 million",
        "date": "11172016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Barrick announces pricing for debt tender offer "
    },
    {
        "content": "WESTONARIA  South Africa  July 28 South Africa's Sibanye Gold does not intend to make make an offer for the assets of Barrick Gold's African unit Acacia Mining   it said on Thursday.",
        "date": "07282016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-South Africa's Sibanye Gold says no intention to bid for Acacia assets "
    },
    {
        "content": "TORONTO/VANCOUVER Barrick Gold Corp  the world's largest gold producer  is weighing a sale of its majority stake in African unit Acacia Mining Plc and has approached several South African miners  according to sources familiar with the situation.",
        "date": "07262016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Exclusive: Barrick Gold weighs sale of $1.9 billion Acacia stake - sources "
    },
    {
        "content": "TORONTO Barrick Gold Corp  the world's largest gold producer  reported a rise in second-quarter profit on Wednesday and said it plans to sell its 50 percent stake in a western Australia mine to carve more from its debt.",
        "date": "07272016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick Gold profit lifts  plans Australian mine sale "
    },
    {
        "content": "TORONTO/VANCOUVER  July 26 Barrick Gold Corp   the world's largest gold producer  is weighing a sale of its majority stake in African unit Acacia Mining Plc  and has approached several South African miners  according to sources familiar with the situation.",
        "date": "07262016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "EXCLUSIVE-Barrick Gold weighs sale of $1.9 bln Acacia stake - sources "
    },
    {
        "content": "* Reduced total debt by $968 million year-to-date  and remain on track to achieve $2 billion debt reduction target for year",
        "date": "07272016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick Gold Q2 adj EPS $0.14 "
    },
    {
        "content": "TORONTO  July 27 Barrick Gold Corp  the world's largest gold producer  reported a rise in second-quarter profit on Wednesday and said it plans to sell its 50 percent stake in a western Australia mine to carve more from its debt.",
        "date": "07272016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 2-Barrick Gold profit lifts  plans Australian mine sale "
    },
    {
        "content": "* Board of directors has declared a dividend for quarter of $0.02 per share  payable on September 15  2016  Source text for Eikon:  Further company coverage:    (Bangalore Newsroom : +1 646 223 8780)",
        "date": "07272016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick Gold declares qtrly dividend of $0.02/shr "
    },
    {
        "content": "TORONTO  July 27 Barrick Gold Corp  the world's largest gold producer  reported a bigger second-quarter profit on Wednesday  compared with the same period last year  as gold prices rose and costs fell.",
        "date": "07272016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold reports bigger second-quarter profit "
    },
    {
        "content": "TORONTO Barrick Gold Corp   the world's largest producer of bullion  reported a bigger quarterly profit on Wednesday  reflecting higher gold prices and lower costs  while cutting its 2016 production costs and lifting its output.",
        "date": "10262016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick earnings climb but miner keeps lid on costs "
    },
    {
        "content": "TORONTO  Oct 26 Barrick Gold Corp  the world's largest producer of bullion  reported a bigger quarterly profit on Wednesday  reflecting higher gold prices and lower costs  while cutting its 2016 production costs and lifting its output.",
        "date": "10262016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 2-Barrick earnings climb but miner keeps lid on costs "
    },
    {
        "content": "* Barrick gold corp - increased our gold production guidance for 2016 to 5.25-5.55 million ounces  up from our original range of 5.00-5.50 million ounces",
        "date": "10262016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick gold reports Q3 earnings per share of $0.15 "
    },
    {
        "content": "TORONTO  Oct 26 Barrick Gold Corp  the world's largest producer of bullion  reported a bigger third-quarter profit on Wednesday  reflecting higher prices for the metal and lower costs  and raised its output forecast for the year.",
        "date": "10262016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Miner Barrick Gold posts higher earnings  lifts output forecast "
    },
    {
        "content": "* Sets quarterly dividend of $0.02per share  Source text for Eikon:  Further company coverage:",
        "date": "10262016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "BRIEF-Barrick Gold sets quarterly dividend of $0.02/share "
    },
    {
        "content": "Oct 26 The following bids  mergers  acquisitions and disposals were reported by 1950 GMT on Wednesday:",
        "date": "10262016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Acquired 100% of issued and outstanding common shares of Barrick subsidiary for nominal cash consideration",
        "date": "06012016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Rugby Mining acquires gold portfolio in Colombia "
    },
    {
        "content": "NEW YORK Barrick Gold Corp has agreed to pay $140 million to resolve a U.S. lawsuit accusing the gold producer of concealing problems at a South American mine and of fraudulently inflating the company's market value  according to court papers.",
        "date": "05312016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick Gold reaches $140 mln accord in U.S. investor lawsuit "
    },
    {
        "content": "NEW YORK Barrick Gold Corp  has agreed to pay $140 million to resolve a U.S. lawsuit accusing the gold producer of concealing problems at a South American mine and of fraudulently inflating the company's market value  according to court papers.",
        "date": "05312016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold reaches $140 million accord in U.S. investor lawsuit "
    },
    {
        "content": "NEW YORK  May 31 Barrick Gold Corp has agreed to pay $140 million to resolve a U.S. lawsuit accusing the gold producer of concealing problems at a South American mine and of fraudulently inflating the company's market value  according to court papers.",
        "date": "05312016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-Barrick Gold reaches $140 mln accord in U.S. investor lawsuit "
    },
    {
        "content": "NEW YORK  May 31 Barrick Gold Corp has agreed to pay $140 million to resolve a U.S. lawsuit accusing the gold producer of concealing problems at a South American mine and of fraudulently inflating the company's market value  lawyers for the plaintiffs said on Tuesday.",
        "date": "05312016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold to pay $140 mln to resolve U.S. investor lawsuit "
    },
    {
        "content": "Soros Fund Management LLC returned to gold investments in the first quarter after staying away for two quarters  a filing with the U.S. Securities and Exchange Commission showed on Monday as the metal saw its biggest quarterly rally in nearly three decades.",
        "date": "05162016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Soros returns to gold investments in first quarter: 13F filing "
    },
    {
        "content": "May 16 Soros Fund Management LLC returned to gold investments in the first quarter after staying away for two quarters  a filing with the U.S. Securities and Exchange Commission showed on Monday as the metal saw its biggest quarterly rally in nearly three decades.",
        "date": "05162016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Soros returns to gold investments in Q1 - 13F filing "
    },
    {
        "content": "* Sets quarterly dividend of $0.02 per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04262016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Barrick Gold sets quarterly dividend of $0.02/share "
    },
    {
        "content": "VANCOUVER/TORONTO Barrick Gold Corp   the world's largest gold producer  on Tuesday reported first-quarter adjusted earnings that rose sharply  topping market expectations  pushing its shares higher.",
        "date": "04262016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold adjusted earnings top forecasts; shares rise "
    },
    {
        "content": "VANCOUVER/TORONTO April 26 Barrick Gold Corp   the world's largest gold producer  on Tuesday reported first-quarter adjusted earnings that rose sharply  topping market expectations  pushing its shares higher.",
        "date": "04262016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 3-Barrick Gold adjusted earnings top forecasts; shares rise "
    },
    {
        "content": "TORONTO  April 26 Barrick Gold Corp's  shareholders at the company's annual shareholder meeting on Tuesday gave their backing to the gold miner's executive compensation plan  in a reversal from a year ago when they overwhelmingly voted down the scheme.",
        "date": "04262016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick shareholders vote in favor of company's executive pay plan "
    },
    {
        "content": "April 26 Barrick Gold Corp  the world's largest gold producer  reported a quarterly loss  compared with a year-earlier profit  as asset sales weighed on production and realized prices fell.",
        "date": "04262016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold Corp reports a quarterly loss "
    },
    {
        "content": "VANCOUVER  April 19 Barrick Gold Corp  looks set next week to win shareholder approval for its executive compensation  a reversal from last year when angry investors voted against what they said was excessive pay  after the miner's chairman forfeited his bonus.",
        "date": "04192016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Shareholders seen backing Barrick's say-on-pay vote this year "
    },
    {
        "content": "BUENOS AIRES Barrick Gold Corp's Veladero mine in Argentina had three cyanide leaks between 2011 and 2012 that were contained by the mine's  control system  a spokesman told Reuters on Sunday after local media published a government document describing the spills.",
        "date": "03282016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick says 2011-12 Argentine mine cyanide leaks were contained "
    },
    {
        "content": "March 24 A federal judge on Wednesday granted class certification for a U.S. class-action lawsuit filed against Barrick Gold Corp claiming Barrick misstated facts of its now halted Pascua-Lama gold-mine project on the border of Argentina and Chile.",
        "date": "03242016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold to face US group lawsuit over LatAm mine "
    },
    {
        "content": "A federal judge on Wednesday granted class certification for a U.S. class-action lawsuit filed against Barrick Gold Corp claiming Barrick misstated facts of its now halted Pascua-Lama gold-mine project on the border of Argentina and Chile.",
        "date": "03242016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold to face U.S. group lawsuit over LatAm mine "
    },
    {
        "content": "* Skeena secures option to acquire Snip Property from Barrick",
        "date": "03232016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Skeena Resources Ltd secures option to acquire Snip Property from Barrick Gold "
    },
    {
        "content": "* Barrick Gold   co's largest shareholder  nominated Robert Krcmarov to board of directors",
        "date": "03222016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Barrick Gold nominates Rob Krcmarov to Nulegacy's board "
    },
    {
        "content": "TORONTO  March 16 Barrick Gold said on Wednesday that its chief financial officer  Shaun Usmar  is leaving the company to lead a new mine financing venture in Toronto backed by U.S. hedge fund Elliott Management.",
        "date": "03162016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick Gold finance head departing to lead new venture "
    },
    {
        "content": "BUENOS AIRES  March 11 Argentina's San Juan province fined Barrick Gold Corp 145.7 million pesos ($9.82 million) on Friday for mining code breaches that led to a cyanide spill at the company's Veladero mine in September  a provincial government statement said.",
        "date": "03112016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Argentine province fines Barrick $9.8 mln for cyanide spill "
    },
    {
        "content": "Barrick Gold Corp    the world's largest gold miner  estimated spending of about $2 billion if it decides to proceed with projects in Nevada and Peru.",
        "date": "02222016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick estimates $2 billion costs if Nevada  Peru projects proceed "
    },
    {
        "content": "Feb 22 Barrick Gold Corp   the world's largest gold miner  estimated spending of about $2 billion if it decides to proceed with projects in Nevada and Peru.",
        "date": "02222016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "CORRECTED-Barrick estimates $2 bln costs if Nevada  Peru projects proceed "
    },
    {
        "content": "Feb 17 Barrick Gold Corp   the world's largest gold producer  reported a smaller quarterly loss as sale of its non-core assets helped offset a continued slump in gold prices.",
        "date": "02172016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick Gold posts smaller quarterly loss "
    },
    {
        "content": " (The story headline and paragraph 1 were corrected to say company set production and debt-reduction targets for 2016  not cut forecast and costs)",
        "date": "02182016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick Gold aims to cut at least $2 billion in debt this year (Feb. 17) "
    },
    {
        "content": "Feb 17 Barrick Gold Corp   the world's largest gold producer  on Wednesday forecast 2016 gold production of 5.0-5.5 million ounces and a debt reduction target of at least $2 billion for the year.",
        "date": "02182016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "RPT-CORRECTED-UPDATE 1-Barrick Gold aims to cut at least $2 bln in debt this year (Feb. 17) "
    },
    {
        "content": "Feb 17 Barrick Gold Corp   the world's largest gold producer  on Wednesday forecast 2016 gold production of 5.0-5.5 million ounces and a debt reduction target of at least $2 billion for the year.",
        "date": "02182016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "CORRECTED-UPDATE 1-Barrick Gold aims to cut at least $2 bln in debt this year "
    },
    {
        "content": "Barrick Gold Corp   the world's biggest gold producer   said it expects to take charges of up to $3 billion following an annual accounting impairment review.",
        "date": "01212016",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick expects to take up to $3 billion in impairment charges "
    },
    {
        "content": "Jan 21 Barrick Gold Corp  the world's biggest gold producer   said it expects to take charges of up to $3 billion following an annual accounting impairment review.",
        "date": "01212016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-Barrick expects to take up to $3 bln in impairment charges "
    },
    {
        "content": "Jan 21 Barrick Gold Corp  the world's biggest gold producer   said on Thursday it expects to take a goodwill and asset impairment charge of as much as $3 billion.",
        "date": "01212016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick expects to take as much as $3 bln of impairment charges "
    },
    {
        "content": "Jan 13 Star dealmaker and former Citigroup Inc  executive Michael Klein  the lead adviser to Dow Chemical Co on its $130 billion merger with DuPont  has quietly tripled the size of his advisory firm in the last 18 months.",
        "date": "01132016",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Wall Street rainmaker Michael Klein no longer a one-man show "
    },
    {
        "content": "DUBAI  Dec 31 Saudi Arabian Mining Co  (Ma'aden) has began initial production of copper at its joint venture affiliate with Canada's Barrick Gold Corp  the Gulf's largest miner said in a bourse statement on Thursday.",
        "date": "12312015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Saudi's Ma'aden says begins initial production at Barrick copper JV "
    },
    {
        "content": "Nov 23 Barrick Gold Corp lowered its 2015 production forecast range on Monday due to a mechanical problem at its jointly owned mine in Dominican Republic  resulting in reduced production at the operation until mid-January 2016.",
        "date": "11242015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 2-Barrick trims 2015 gold output forecast on Dominican mine issue "
    },
    {
        "content": "Nov 23 Barrick Gold Corp lowered its 2015 production forecast range on Monday due to a mechanical issue at its jointly owned Dominican Republic-based mine that will result in reduced production at the operation until mid-January 2016.",
        "date": "11232015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 1-Barrick trims 2015 gold output forecast on Dominican mine issue "
    },
    {
        "content": "Nov 23 Barrick Gold Corp lowered its 2015 production forecast range on Monday due to a mechanical issue at its jointly owned Dominican Republic-based mine that will result in reduced production until mid-January 2016.",
        "date": "11232015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick trims 2015 gold output forecast on Dominican mine issue "
    },
    {
        "content": "TORONTO  Nov 12 Barrick Gold Corp said on Thursday it will sell its stake in four non-core assets in Nevada for $720 million  putting the Canadian mining firmly on track to meet its 2015 debt-reduction target amid a multi-year slump in gold prices.",
        "date": "11122015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 3-Barrick raises $720 mln from sale of stakes in Nevada assets "
    },
    {
        "content": "TORONTO Barrick Gold Corp  said on Thursday it will sell its stakes in four non-core assets to two parties for a total of $720 million  putting it on track to meet its debt-reduction target this year amid a multi-year slump in gold prices.",
        "date": "11122015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick sells stakes in four non-core assets for $720 million "
    },
    {
        "content": "TORONTO  Nov 12 Barrick Gold Corp said on Thursday it has agreed to sell its stakes in four non-core assets to two parties for a total of $720 million  as the world's largest gold producer works to trim  its debt load as gold prices have weakened.",
        "date": "11122015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick sells stakes in four assets for $720 million "
    },
    {
        "content": "TORONTO  Oct 29 Barrick Gold will increase its focus on productivity and efficiency gains in 2016 to further improve its balance sheet  the world's biggest gold producer said on Thursday.",
        "date": "10292015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 1-Barrick to push harder for productivity gains in 2016 "
    },
    {
        "content": "TORONTO  Oct 29 Barrick Gold  the world's biggest gold producer  said on Thursday that it has just begun a second round in the sales process for six U.S. gold assets that it wants to divest and expects to sign at least one agreement before year-end.",
        "date": "10292015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold expects agreements on asset sales before year-end "
    },
    {
        "content": "Oct 28 Barrick Gold Corp  the world's biggest gold producer  reported lower quarterly adjusted earnings on Wednesday due to weaker gold and copper prices but results were better than the market expected.",
        "date": "10282015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 1-Barrick earnings beat market expectations  cuts debt "
    },
    {
        "content": "Oct 28 Barrick Gold Corp swung to a third-quarter net loss on Wednesday as it took $455 million in impairment charges related primarily to the reclassification of its Zaldivar copper mine in Chile as \"held-for-sale.\"",
        "date": "10282015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick swings to third-quarter net loss on Zaldivar charge "
    },
    {
        "content": "SYDNEY  Oct 19 Operations at the Porgera gold mine in Papua New Guinea have been suspended due to drought conditions  part owner Barrick Gold said on Monday  the latest mine in the Asia-Pacific to be disrupted by El Nino-induced dry weather.",
        "date": "10192015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "El Nino halts Papua New Guinea gold mine-Barrick "
    },
    {
        "content": "Oct 6 Gold miner Acacia Mining Plc said that its third-quarter production was lower than expected due to lower-grade ores mined at its Bulyanhulu and Buzwagi mines in Tanzania.",
        "date": "10062015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "CORRECTED-Acacia Mining says third-quarter production below expectations "
    },
    {
        "content": "BUENOS AIRES  Oct 1 A cyanide solution spill at Barrick Gold Corp's Veladero mine in western Argentina did not contaminate local water supplies  preliminary tests by U.N. investigators showed.",
        "date": "10012015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Water not contaminated after cyanide spill at Barrick's Veladero-UN "
    },
    {
        "content": "SYDNEY  Oct 1 Barrick Gold Corp has not had talks over a sale of its 50 percent stake in Australia's Super Pit gold mine to its partner Newmont Mining Corp  Barrick adviser and ex-president Jim Gowans said on Thursday.",
        "date": "10012015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick not in talks with Newmont on sale in gold mine stake  - adviser "
    },
    {
        "content": "BUENOS AIRES  Sept 24 An Argentine judge on Thursday lifted his order forbidding Barrick Gold Corp's  from pumping cyanide solution for the leaching process in its Veladero mine  saying a leak had not contaminated water in the surrounding area.",
        "date": "09242015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Argentine judge lifts order against Barrick Gold's Veladero mine "
    },
    {
        "content": "TORONTO  Sept 18 Barrick Gold Corp will close its Salt Lake City  Utah office by the end of November and dissolve a standalone copper unit  as the world's biggest gold producer by output continues to cut costs to help pare its debt.",
        "date": "09182015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick to shut Utah office  dissolve copper unit  to cut costs "
    },
    {
        "content": "There has been strong interest in a package of six U.S. gold assets that Barrick Gold Corp  wants to sell  a senior Barrick executive said on Sunday  adding that he expects a deal to close before year end.",
        "date": "09212015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick says strong interest in U.S. gold asset sale "
    },
    {
        "content": "DENVER  Sept 22 Newmont Mining Corp is not interested in buying the U.S. assets Barrick Gold  has put up for sale  but would be keen on Barrick's 50 percent stake in an Australian mine at the right price  Newmont Chief Executive Gary Goldberg said on Tuesday.",
        "date": "09222015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Newmont not interested in Barrick's U.S. assets  eyes Australia "
    },
    {
        "content": "BUENOS AIRES  Sept 17 An Argentine judge on Thursday said he ordered a five-day suspension of the gold leaching process at Barrick Gold Corp's Veladero mine to check if there was any environmental damage from a cyanide leak triggered by a faulty valve.",
        "date": "09172015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 1-Argentina suspends gold leaching at Barrick mine after cyanide leak "
    },
    {
        "content": "BUENOS AIRES  Sept 17 An Argentine judge on Thursday said he ordered a five-day suspension of the gold leaching process at Barrick Gold Corp's Veladero mine to check if there was any environmental damage from a cyanide leak triggered by a faulty valve.",
        "date": "09172015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Argentina suspends production at Barrick gold mine after cyanide leak "
    },
    {
        "content": "BUENOS AIRES  Sept 14 A pipe carrying cyanide at Barrick Gold Corp's Veladero gold mine suffered a valve failure and small leak that led to a brief disruption to operations  the company said on Monday.",
        "date": "09142015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick suffers small cyanide spill at Veladero mine in Argentina "
    },
    {
        "content": "TORONTO  Aug 17 Barrick Gold Corp said on Monday that Jim Gowans  a veteran miner and one of its co-presidents  was retiring and that he would not be replaced  as the miner moves to thin out its ranks and create a leaner operating structure.",
        "date": "08172015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 2-Barrick scraps co-president structure in management shuffle "
    },
    {
        "content": "TORONTO  Aug 17 Barrick Gold said on Monday Jim Gowans  a veteran mining hand and one of its co-presidents  was retiring from the company.",
        "date": "08172015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick makes management changes  moves away from co-president structure "
    },
    {
        "content": "NEW YORK  Aug 14 Soros Fund Management LLC kept its stake unchanged in the Market Vectors Gold Miners exchange-traded fund in the second quarter of 2015  and added a stake in Barrick Gold Corp  a filing with the U.S. Securities and Exchange Commission showed on Friday.",
        "date": "08142015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Soros' stake unchanged in Gold Miners  adds stake in Barrick Gold "
    },
    {
        "content": "Aug 5 Barrick Gold Corp said on Wednesday it has entered into a gold and silver \"streaming\" agreement with Royal Gold Inc for production linked to Barrick's 60 percent stake in the Pueblo Viejo mine in the Dominican Republic.",
        "date": "08052015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick Gold agrees gold  silver \"streaming\" deal on Dominican mine "
    },
    {
        "content": "LONDON  July 31 Barrick Gold Corp's  sale of half of its Zaldivar copper mine in Chile to Antofagasta  for what analysts say is a pricey $1 billion hit Antofagasta's shares on Friday  but could help Anglo American  in its own copper assets sale.",
        "date": "07312015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Zaldivar mine deal hits Antofagasta shares  bodes well for Anglo "
    },
    {
        "content": "LONDON  July 31 European shares fell slightly after hitting a one-week high on Friday  with commodity stocks leading the market lower after prices of crude oil and major industrial metals dropped on supply-demand concerns.",
        "date": "07312015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "European shares edge lower  commodity stocks weigh "
    },
    {
        "content": "July 30 Barrick Gold Corp agreed on Thursday to sell 50 percent of its Zaldivar copper mine in Chile to copper miner Antofagasta Plc for $1 billion in cash  and both parties stressed that this was just the start of more cooperation.",
        "date": "07302015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 2-Antofagasta to buy Barrick Chile mine  eye more partnerships "
    },
    {
        "content": "July 30 Barrick Gold Corp said on Thursday it has reached an agreement to sell 50 percent of its Zaldivar copper mine in Chile to Chile-focused miner Antofagasta Plc for just over $1 billion in cash.",
        "date": "07302015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold to sell 50 pct stake in Chile mine to Antofagasta "
    },
    {
        "content": "LUSAKA  July 28 Power cuts in north-western Zambia  Africa's second-biggest copper producer  have affected production at mines run by Canada's First Quantum Minerals  and Barrick Gold  an industry body said on Tuesday.",
        "date": "07282015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 1-Zambia power cuts hit Canada's First Quantum  Barrick "
    },
    {
        "content": "TORONTO Barrick Gold Corp  the world's largest bullion producer  said on Thursday that Ned Goodman has resigned from its board to focus on a new business in the resource sector.",
        "date": "07232015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick Gold director Goodman quits to avoid conflicts "
    },
    {
        "content": "TORONTO  July 23 Barrick Gold Corp  the world's largest bullion producer  said on Thursday that Ned Goodman has resigned from its board to focus on a new business in the resource sector.",
        "date": "07232015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-Barrick Gold director Goodman quits to avoid conflicts "
    },
    {
        "content": "TORONTO  July 23 Barrick Gold Corp  the world's largest bullion producer  said on Thursday that Ned Goodman has resigned from its board to focus on a new resources business.",
        "date": "07232015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold director Goodman quits board "
    },
    {
        "content": "TORONTO  July 20 The plunging gold price poses more challenges for Barrick Gold  the world's largest gold producer  which is already shopping its assets and raising money to try to trim debt levels that stand well above those of its North American peers.",
        "date": "07202015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Gold's tumble poses problems for debt-laden Barrick "
    },
    {
        "content": "June 17 Former Xstrata boss Mick Davis' X2 Resources  long considered a front runner  is out of the race for a stake in Barrick Gold's Zaldivar copper mine in Chile after it was outbid in the first round of the sale process  according to three sources close to the matter.",
        "date": "06172015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Mick Davis' X2 out as bidder for Barrick Chile copper mine -sources "
    },
    {
        "content": "* Deal will boost Evolution's gold output to 800 000 ounce/year",
        "date": "05252015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 2-Barrick sells Australian Cowal gold mine to Evolution for $550 mln "
    },
    {
        "content": "VANCOUVER/TORONTO May 26 Barrick Gold Corp's  first step to long-promised partnerships with China  as well as progress in reaching an ambitious debt-cutting goal  are turning skeptical investors warmer toward the world's biggest gold miner.",
        "date": "05262015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick investors welcome Chinese tie-up  debt reduction moves "
    },
    {
        "content": "NEW YORK  May 24 Barrick Gold Corp said on Sunday that it had reached an agreement to sell 100 percent of the Cowal mine in New South Wales  Australia to Evolution Mining for $550 million.",
        "date": "05252015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick agrees to sell Cowal mine for $550 mln "
    },
    {
        "content": "TORONTO  May 26 Barrick Gold Corp   said on Tuesday it has forged a strategic tie-up with Zijin Mining Group Co and agreed to sell the Chinese miner a stake in a mine in Papua New Guinea as a first step toward further collaboration.",
        "date": "05262015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 2-Barrick boosts ties with China's Zijin via New Guinea mine stake sale "
    },
    {
        "content": "May 26 Canadian miner Barrick Gold Corp  said it would sell 50 percent stake in its unit that manages the Porgera gold mine in Papua New Guinea to China's Zijin Mining Group Co Ltd for $298 million in cash.",
        "date": "05262015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "REFILE-Barrick to sell 50 pct in Papua New Guinea unit to China's Zijin "
    },
    {
        "content": "* Follows rebellions at companies from Sanofi to Barrick Gold   (Adds detail from statement  quote from company)",
        "date": "05082015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 1-Hedge fund firm Man Group feels investor backlash on pay "
    },
    {
        "content": "April 27 Barrick Gold Corp reported weaker-than-expected first-quarter earnings on Monday on the back of a lower gold price and sales and announced that it has started a process to sell a stake in its Zaldivar copper mine in Chile.",
        "date": "04272015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 1-Barrick to sell stake in Zaldivar copper mine  earnings fall "
    },
    {
        "content": "TORONTO  April 29 Yamana Gold Inc will change its executive pay plan to better reflect performance  the mid-tier miner told shareholders on Wednesday after they voted against the plan  a day after industry leader Barrick Gold Corp  made the same promise to its unhappy investors.",
        "date": "04292015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Yamana Gold pledges to fix executive pay plan after investors vote 'no' "
    },
    {
        "content": "April 27 Barrick Gold Corp reported lower first-quarter earnings on Monday on the back of lower gold prices and sales and announced that it has started a process to sell a stake in the Zaldivar copper mine in Chile.",
        "date": "04272015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick earnings fall  to sell stake in Zaldivar copper mine "
    },
    {
        "content": "The Federal Open Market Committee begins a two-day meeting on interest rate policy. The Fed has already ruled out an April rate hike  so not much is expected from this meeting. Investors will watch for signs that the Fed is getting more comfortable with inflation data.",
        "date": "04272015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "What to Watch in the Day Ahead - Tuesday  April 28 "
    },
    {
        "content": "SYDNEY  April 29 Canada's Barrick Gold  will relinquish some management duties at Australia's Super Pit gold mine to partner Newmont Mining  in a further pull-back from operations in the Southern Hemisphere",
        "date": "04292015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold takes backseat at Australia's Super Pit "
    },
    {
        "content": "April 28 Barrick Gold Corp is targeting the sale of up to a 50 percent stake in its Zaldivar copper mine in Chile but would consider selling a bigger stake if it got a \"knock-out\" offer  company co-president Kelvin Dushnisky said.",
        "date": "04282015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 1-Barrick Gold looking to sell up to 50 pct of Chile copper mine "
    },
    {
        "content": "TORONTO  May 1 Barrick Gold Corp on Friday named Catherine Raw  a BlackRock executive and co-manager of one of its flagship mining funds  as head of business performance.",
        "date": "05012015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick names BlackRock exec as head of business performance "
    },
    {
        "content": "April 28 Barrick Gold Corp is targeting the sale of a 50 percent stake in its Zaldivar copper mine in Chile but would be prepared to sell more if it got a \"knock-out\" offer  company co-president Kelvin Dushnisky said.",
        "date": "04282015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold looking to sell 50 pct of Chile copper mine "
    },
    {
        "content": "TORONTO  April 28 Barrick Gold Corp   Chairman John Thornton promised to fix the miner's executive compensation plan  especially his own package  on Tuesday after shareholders voted overwhelmingly to reject it  the second such rejection in three years.",
        "date": "04282015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 2-Barrick vows to fix executive pay plan after investor rejection "
    },
    {
        "content": "April 28 All 13 director nominees have been appointed to Barrick Gold Corp's board  the gold miner said on Tuesday.",
        "date": "04282015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "All Barrick Gold director nominees appointed to company board "
    },
    {
        "content": "TORONTO  April 28 Barrick Gold Corp's  shareholders have voted to reject the gold miner's controversial executive compensation plan  Barrick Executive Chairman John Thornton said on Tuesday.",
        "date": "04282015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick shareholders reject executive compensation plan - chairman "
    },
    {
        "content": "* Vedanta's Zambia copper unit will still lose money -CEO   (Adds confirmation from Barrick  statement from co-president)",
        "date": "04232015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 3-Barrick will not suspend copper mine as Zambia backs down on royalties "
    },
    {
        "content": "LONDON/TORONTO Barrick Gold Corp is being advised on options for its Zaldivar copper mine in Chile by the boutique firm of mining rainmaker Michael Klein  in a deal potentially worth around $2 billion  three sources familiar with the matter said on Monday.",
        "date": "04202015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick taps Michael Klein as advisor on Zaldivar mine options: sources "
    },
    {
        "content": "LUSAKA  April 23 Zambia's Lumwana open pit copper mine  owned by Barrick Gold Corp.  has rescinded its decision to suspend operations after the cabinet reduced mining royalties  a senior government official said on Thursday.",
        "date": "04232015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Zambia's Lumwana mine overturns decision to halt operations - official "
    },
    {
        "content": "LONDON/TORONTO  April 20 Barrick Gold Corp  is being advised on options for its Zaldivar copper mine in Chile by the boutique firm of mining rainmaker Michael Klein  in a deal potentially worth around $2 billion  three sources familiar with the matter said on Monday.",
        "date": "04202015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick taps Michael Klein as advisor on Zaldivar mine options-sources "
    },
    {
        "content": "SANTIAGO  April 22 Chile's environmental regulator SMA said on Wednesday it will seek new sanctions against Barrick Gold Corp's massive Pascua-Lama gold and silver project  further complicating the possibility that the suspended mine might resume construction.",
        "date": "04222015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 1-Chile regulator seeks new sanctions against Barrick's Pascua-Lama "
    },
    {
        "content": "SANTIAGO  April 22 Chile's environmental regulator said on Wednesday it will seek new sanctions against Barrick Gold Corp's massive Pascua-Lama gold and silver project for non-compliance with certain obligations.",
        "date": "04222015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Chile regulator seeks new sanctions against Barrick's Pascua-Lama "
    },
    {
        "content": "TORONTO  April 24 The Canada Pension Plan Investment Board  the country's largest pension fund manager  on Friday joined other investors opposing Barrick Gold Corp's  executive compensation schemes  arguing the company's pay awards were \"outsize\" and unrelated to  performance.",
        "date": "04242015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 2-CPPIB joins chorus against Barrick's executive pay structure "
    },
    {
        "content": "TORONTO  April 24 The Canada Pension Plan Investment Board  the country's largest pension fund manager  on Friday joined a slew of other investors opposing Barrick Gold Corp's executive pay structure.",
        "date": "04242015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "CPPIB joins chorus against Barrick's executive pay structure "
    },
    {
        "content": "TORONTO  April 17 Barrick Gold Corp  faces a fresh backlash over executive pay at its shareholder meeting this month  with some big institutions planning to vote against its compensation plan and withhold votes for directors to express their unhappiness.",
        "date": "04172015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick Gold's board faces backlash over executive pay at AGM "
    },
    {
        "content": "TORONTO  April 9 Influential proxy advisory firm Glass Lewis is recommending that shareholders vote against Barrick Gold Corp's executive compensation plan  while flagging \"serious concerns\" with the executive chairman's pay.",
        "date": "04092015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 1-Proxy firm advises Barrick shareholders to reject pay plan "
    },
    {
        "content": "TORONTO  April 9 The influential proxy advisory firm Glass Lewis is recommending that shareholders vote against Barrick Gold Corp's executive compensation plan  while flagging \"serious concerns\" with the executive chairman's pay.",
        "date": "04092015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Proxy firm advises Barrick shareholders to reject pay plan "
    },
    {
        "content": "March 28 Barrick Gold Corp  which last year implemented a new executive compensation plan after an outcry from shareholders  paid Executive Chairman John Thornton $12.9 million in 2014   a third more than in 2013.",
        "date": "03282015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Barrick Chairman Thornton gets nearly $13 mln in 2014 compensation "
    },
    {
        "content": "TORONTO  March 27 Barrick Gold Corp    the world's biggest gold producer by output  will continue operating its Lumwana copper mine in Zambia while awaiting changes to the country's mineral royalty tax  the company said on Friday.",
        "date": "03272015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 1-Barrick to keep operating Zambia copper mine  pending royalty change "
    },
    {
        "content": "TORONTO  April 1 Canada's main stock index gained on Wednesday as rising prices for commodities such as oil and bullion bolstered the energy and mining sectors  which together make up almost a third of the index.",
        "date": "04012015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "CANADA STOCKS-Oil and gold price rallies boost TSX resource stocks "
    },
    {
        "content": "March 27 Barrick Gold Corp's   Zaldivar copper mine in Chile is closed for \"safety reasons\" after heavy rains swept across the country's northern desert region this week  a spokesman said on Friday.",
        "date": "03272015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick's Zaldivar Chile copper mine closed due to rains-spokesman "
    },
    {
        "content": "NEW YORK  April 1 Barrick Gold Corp  lost its bid to dismiss a U.S. lawsuit accusing the world's largest gold producer of concealing problems at a troubled South American mine  and fraudulently inflated its market value by tens of billions of dollars.",
        "date": "04012015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold must face U.S. lawsuit over mothballed mine "
    },
    {
        "content": "NEW YORK  April 1 Barrick Gold Corp has lost its bid to dismiss a U.S. lawsuit that accuses the world's largest gold producer of concealing problems at a troubled South American mine and of fraudulently inflating the company's market value by billions of dollars.",
        "date": "04012015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-Barrick Gold must face U.S. lawsuit over mothballed mine "
    },
    {
        "content": "TORONTO  April 1 Canada's main stock index was little changed on Wednesday as strength in the price of commodities such as oil and bullion helped drive gains in the energy and mining sectors  offsetting weakness in the financial sector.",
        "date": "04012015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "CANADA STOCKS-TSX steady as a resource gains offset by banks "
    },
    {
        "content": "Chile's Environmental Court ruled on Monday that Barrick Gold Corp's halted Pascua-Lama gold and silver project has not damaged glaciers within its \"area of influence \" the Toronto-based gold producer said.",
        "date": "03232015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Chile environmental court rules Barrick project did not harm glaciers "
    },
    {
        "content": "March 23 Chile's Environmental Court ruled on Monday that Barrick Gold Corp's halted Pascua-Lama gold and silver project has not damaged glaciers within its \"area of influence \" the Toronto-based gold producer said.",
        "date": "03232015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 1-Chile environmental court rules Barrick project did not harm glaciers "
    },
    {
        "content": "March 23 Chile's Environmental Court ruled on Monday that Barrick Gold Corp's Pascua-Lama gold and silver project has not damaged glaciers within its \"area of influence\"  the Toronto-based gold producer said.",
        "date": "03232015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Chile's environmental court says Barrick project did not harm glaciers "
    },
    {
        "content": "March 19 Canadian gold producer Agnico Eagle Mines Ltd  said it appointed Ammar Al-Joundi  former chief financial officer of Barrick Gold Corp    president as it grooms him as a potential chief executive.",
        "date": "03192015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Agnico hires former Barrick Gold CFO Ammar Al-Joundi as president "
    },
    {
        "content": "LUSAKA  Feb 24 Workers at Barrick Gold's  Lumwana Copper Mine in Zambia called off their strike on Tuesday after the government said they would not lose their jobs  an official said.",
        "date": "02242015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 1-Workers end strike at Zambia's Barrick Gold copper mine "
    },
    {
        "content": "LUSAKA  Feb 24 Workers at Barrick Gold's  Lumwana Copper Mine in Zambia called off their strike on Tuesday after the government said they would not lose their jobs  a government official said.",
        "date": "02242015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Workers end strike at Zambia's Barrick Gold copper mine "
    },
    {
        "content": "* Zambia trying to end rows over royalties  taxes   (Adds Barrick comment)",
        "date": "02232015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "UPDATE 4-Zambia's president vows to prevent job losses at Barrick mine "
    },
    {
        "content": "LUSAKA  Feb 23 President Edgar Lungu said on Monday his government would not allow mining jobs to be lost at Barrick Gold's Zambian copper mine after the company said it plans to close the business due to high royalties.",
        "date": "02232015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Zambia president says to prevent job losses at Barrick Gold's mine "
    },
    {
        "content": "LUSAKA  Feb 23 Over 2 000 unionised workers at the Lumwana copper mine owned by Barrick Gold Corp.  downed tools on Monday demanding an explanation of their fate when the company closes the operation  a senior government official said.",
        "date": "02232015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Over 2 000 workers strike at Barrick Gold Zambia copper mine "
    },
    {
        "content": "Feb 19 Barrick Gold Corp :  * Executive chair thornton says \"our thesis is that when companies falter  it",
        "date": "02192015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "BRIEF-Barrick comments from conference call "
    },
    {
        "content": "Feb 18 Barrick Gold Corp said on Wednesday it will sell its Porgera mine in Papua New Guinea and its Cowal mine in Australia to help reduce net debt by at least $3 billion by year-end  giving investors a long-awaited glimpse into its strategy.",
        "date": "02192015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "UPDATE 2-Barrick Gold to sell two mines  reduce debt by $3 bln "
    },
    {
        "content": "Feb 18 Barrick Gold Corp on Wednesday reported a net loss in the fourth quarter as it booked $2.8 billion in after-tax impairment charges related mostly to its Lumwana mine in Zambia and its Cerro Casale project in Chile.",
        "date": "02192015",
        "name": "Barrick Gold Corporation",
        "news_type": "normal",
        "symbol": "ABX",
        "title": "Barrick Gold posts quarterly loss on charges at Zambia  Chile mines "
    },
    {
        "content": "LUSAKA  Feb 3 Newly-elected Zambian President Edgar Lungu has directed the government to \"promptly resolve\" a row with mining companies over new royalties and VAT refunds  the presidency said in a statement on Tuesday.",
        "date": "02032015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "CORRECTED-UPDATE 1-Zambian president seeks to end mining tax rows "
    },
    {
        "content": "TORONTO  Jan 27 Canada's main stock index extended its gains to a fifth straight session on Tuesday as weakness in the U.S. dollar helped drive up prices of commodities such as oil and gold  boosting shares of natural resource producers.",
        "date": "01272015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "CANADA STOCKS-TSX gains for fifth session as resources climb "
    },
    {
        "content": "TORONTO  Jan 26 TD Securities boosted its mining M&A team on Monday by bringing in former Barrick Gold Corp  head of corporate development Rick McCreary  who steered Barrick through a portfolio re-jig over the last three years.",
        "date": "01262015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "TD boosts mining M&A team with former top Barrick banker "
    },
    {
        "content": "SANTIAGO  Jan 21 Chile's environmental regulator is re-evaluating penalties on Barrick Gold Corp's  Pascua-Lama project  a process that could include cancelling the embattled mine's permit  the head of the government body told a local daily newspaper.",
        "date": "01212015",
        "name": "Barrick Gold Corporation",
        "news_type": "topStory",
        "symbol": "ABX",
        "title": "Chile regulator says could cancel permit for Barrick's Pascua-Lama "
    }
]