[
    {
        "content": "* Acadia Pharmaceuticals reports third quarter 2017 financial results",
        "date": "11072017",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ACAD",
        "title": "BRIEF-Acadia Pharmaceuticals posts Q3 loss of $0.53 per share "
    },
    {
        "content": "* Acadia Pharmaceuticals initiates phase III study of Pimavanserin in dementia-related psychosis",
        "date": "10042017",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ACAD",
        "title": "BRIEF-Acadia Pharmaceuticals initiates phase III study of Pimavanserin "
    },
    {
        "content": "NEW YORK Several big-name hedge fund investors trimmed their stakes in healthcare companies in the second quarter as the sector led the broad U.S. stock market higher  rallying amid a Republican effort to repeal and replace President Obama's signature healthcare law.",
        "date": "08142017",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ACAD",
        "title": "Big-name U.S. hedge funds shed healthcare stocks during the rally in second-quarter "
    },
    {
        "content": "* Acadia pharmaceuticals reports second quarter 2017 financial results",
        "date": "08082017",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ACAD",
        "title": "BRIEF-Acadia pharmaceuticals Q2 loss per share $0.55 "
    },
    {
        "content": "* ACADIA Pharmaceuticals Inc - ‍expects that full-year NUPLAZID net sales for 2017 will be between $105 million and $115 million​",
        "date": "08082017",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ACAD",
        "title": "BRIEF-ACADIA Pharmaceuticals Q2 loss per share $0.55 "
    },
    {
        "content": "* Acadia Pharmaceuticals reports financial results for the fourth quarter and year ended december 31  2016",
        "date": "02282017",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ACAD",
        "title": "BRIEF-Acadia Pharmaceuticals Q4 loss per share $0.65 "
    },
    {
        "content": "NEW YORK  Feb 14 Several big-name U.S. hedge fund investors in the fourth quarter moved significant parts of their portfolios into financial and pharmaceutical stocks that are expected to benefit under the Trump administration  helping to power the sector to its best January performance in four years.",
        "date": "02142017",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ACAD",
        "title": "Bets on financials  pharma power U.S. hedge funds' strong start to year "
    },
    {
        "content": "Acadia Pharmaceuticals Inc said on Tuesday its drug to treat psychosis in patients suffering from Alzheimer's disease met its main goal in a mid-stage study  sending its shares up as much as 18.5 percent.",
        "date": "12202016",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ACAD",
        "title": "Acadia says Alzheimer's psychosis drug clears mid-stage study "
    },
    {
        "content": "* Acadia Pharmaceuticals initiates phase II trial of Pimavanserin for adjunctive treatment in patients with negative symptoms of schizophrenia  Source text for Eikon:  Further company coverage:",
        "date": "11152016",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ACAD",
        "title": "BRIEF-Acadia Pharmaceuticals initiates phase II trial of Pimavanserin "
    },
    {
        "content": "Nov 10 UK's Competition and Markets Authority (CMA):",
        "date": "11102016",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ACAD",
        "title": "BRIEF-UK's CMA says accepted proposals in Acadia's Priory Group deal "
    },
    {
        "content": "* Acadia Pharmaceuticals initiates phase iii trial of pimavanserin for adjunctive treatment in patients with Schizophrenia  Source text for Eikon:  Further company coverage:",
        "date": "11032016",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ACAD",
        "title": "BRIEF-Acadia Pharmaceuticals initiates phase III trial of pimavanserin for adjunctive treatment in patients with Schizophrenia "
    },
    {
        "content": "* Acadia Pharmaceuticals initiates phase II study of pimavanserin in Alzheimer's disease agitation  Source text for Eikon:  Further company coverage:",
        "date": "10312016",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ACAD",
        "title": "BRIEF-Acadia Pharmaceuticals initiates phase II study of pimavanserin in Alzheimer's disease agitation "
    },
    {
        "content": "General Motors said it would add a third shift and 650 jobs at its factory in Spring Hill  Tennessee to meet higher demand for its recently launched Cadillac XT5 and GMC Acadia crossover SUVs.",
        "date": "10112016",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ACAD",
        "title": "GM to add 650 jobs at Spring Hill factory to meet SUV demand "
    },
    {
        "content": "Allergan Plc  CEO Brent Saunders calls them \"stepping stones\" - small  bolt-on acquisitions  as opposed to the mega-deals common in the drug industry. And they're expected to boost dealmaking in sectors ranging from neurology to skin care.",
        "date": "09202016",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ACAD",
        "title": "Allergan pays top dollar for 'stepping stones' from neurology to dermatology "
    },
    {
        "content": "* Acadia Pharmaceuticals reports second quarter 2016 financial results",
        "date": "08042016",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ACAD",
        "title": "BRIEF-Acadia Pharmaceuticals reports Q2 2016 financial results "
    },
    {
        "content": "* Nuplazid (pimavanserin) now available for treatment of hallucinations and delusions associated with Parkinson's disease psychosis  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05312016",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ACAD",
        "title": "BRIEF-Acadia's Nuplazid available for treatment of hallucinations  delusions associated with Parkinson's "
    },
    {
        "content": "* Acadia pharmaceuticals reports first quarter 2016 financial results",
        "date": "05052016",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ACAD",
        "title": "BRIEF-Acadia Pharmaceuticals reports Q1 loss per share $0.45 "
    },
    {
        "content": "Acadia Pharmaceuticals Inc's drug for psychosis linked to Parkinson's disease was approved in the United States on Friday  becoming the first treatment for the condition to get a nod in the country.",
        "date": "04292016",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ACAD",
        "title": "U.S. approves first drug for psychosis linked to Parkinson's "
    },
    {
        "content": "April 28 An imminent ruling on Acadia Pharmaceuticals Inc's drug for Parkinson's disease psychosis is being closely watched by a Bermuda-based company with a similar treatment for dementia.",
        "date": "04282016",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ACAD",
        "title": "Acadia drug approval could clear way for Axovant dementia therapy "
    },
    {
        "content": "An advisory panel to the U.S. Food and Drug Administration backed an approval for Acadia Pharmaceuticals Inc's drug for psychosis related to Parkinson's disease.",
        "date": "03292016",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ACAD",
        "title": "FDA panel backs Acadia drug for psychosis linked to Parkinson's "
    },
    {
        "content": "March 29 An advisory panel to the U.S. Food and Drug Administration backed an approval for Acadia Pharmaceuticals Inc's drug for psychosis related to Parkinson's disease.",
        "date": "03292016",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ACAD",
        "title": "UPDATE 2-FDA panel backs Acadia drug for psychosis linked to Parkinson's "
    },
    {
        "content": "* Fda advisory committee votes 12 to 2 that benefits of acadia pharmaceuticals' nuplazid(tm) (pimavanserin) for the treatment of psychosis associated with parkinson's disease outweigh the risks  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "03292016",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ACAD",
        "title": "BRIEF-Acadia Pharma says FDA panel votes 12 to 2 on benefit-risk profile of its drug for Parkinson's Disease psychosis "
    },
    {
        "content": "Acadia Pharmaceuticals Inc said it had delayed submitting a U.S. marketing application for its lead drug  nuplazid  and that its chief executive was retiring.",
        "date": "03112015",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ACAD",
        "title": "Acadia delays U.S. application to market lead drug  CEO retires "
    },
    {
        "content": "March 11 Acadia Pharmaceuticals Inc  said it had delayed submitting a U.S. marketing application for its lead drug  nuplazid  and that its chief executive was retiring.",
        "date": "03112015",
        "name": "ACADIA Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ACAD",
        "title": "UPDATE 1-Acadia delays U.S. application to market lead drug  CEO retires "
    }
]