[
    {
        "content": "BEIJING Aluminum Corp of China Ltd   on Wednesday said it had agreed a debt financing plan  worth up to 10 billion yuan ($1.53 billion)  with China Pacific Insurance Group Co  to help fund construction of key projects.",
        "date": "09132017",
        "name": "Aluminum Corporation of China Limited",
        "news_type": "topStory",
        "symbol": "ACH",
        "title": "Chalco agrees $1.5 billion debt financing plan with China Pacific Insurance "
    },
    {
        "content": "BEIJING  Sept 13 Aluminum Corp of China Ltd on Wednesday said it had agreed a debt financing plan  worth up to 10 billion yuan ($1.53 billion)  with China Pacific Insurance Group Co to help fund construction of key projects.",
        "date": "09132017",
        "name": "Aluminum Corporation of China Limited",
        "news_type": "normal",
        "symbol": "ACH",
        "title": "Chalco agrees $1.5 bln debt financing plan with China Pacific Insurance "
    },
    {
        "content": "BEIJING Aluminum Corp of China Limited (Chalco) said on Thursday its six-month net profit rose more than tenfold year-on-year as it cashed in sky-high aluminum prices.",
        "date": "08172017",
        "name": "Aluminum Corporation of China Limited",
        "news_type": "topStory",
        "symbol": "ACH",
        "title": "Chalco profit surges tenfold year-on-year in first half "
    },
    {
        "content": "SHANGHAI  Aug 17 Industrial and materials stocks lifted China stocks on Thursday  which some analysts said was aided by hopes there will be  significant changes to open up the economy more widely to foreign investors.",
        "date": "08172017",
        "name": "Aluminum Corporation of China Limited",
        "news_type": "normal",
        "symbol": "ACH",
        "title": "China stocks rise after promise to widen role for foreign investors "
    },
    {
        "content": "CONAKRY Chinalco has asked Guinea to let it take over the whole of the troubled Simandou iron ore mine project  sources familiar with the matter say  as Beijing pursues a global strategy to secure key resources for its vast economy for decades to come.",
        "date": "05152017",
        "name": "Aluminum Corporation of China Limited",
        "news_type": "topStory",
        "symbol": "ACH",
        "title": "Exclusive: Chinalco proposes taking entire Guinea Simandou iron ore mine "
    },
    {
        "content": "CONAKRY Guinea will not accept any major changes to the terms of the Simandou iron ore project that Chinalco bought from Rio Tinto  including building a 650-km railway rather than taking a shorter route via its neighbors  the mines minister said on Wednesday.",
        "date": "04262017",
        "name": "Aluminum Corporation of China Limited",
        "news_type": "topStory",
        "symbol": "ACH",
        "title": "Guinea will not accept any big changes to Chinalco iron ore deal "
    },
    {
        "content": "SINGAPORE  March 23 Aluminum Corporation of China Ltd's (Chalco)   net profit more than doubled in 2016  marking a second straight year of profitability thanks to recovering non-ferrous metal prices and cuts in production costs.",
        "date": "03232017",
        "name": "Aluminum Corporation of China Limited",
        "news_type": "topStory",
        "symbol": "ACH",
        "title": "Chinese aluminium giant Chalco's net profit more than doubles in 2016 "
    },
    {
        "content": "HONG KONG  Oct 20 China's state-owned Aluminum Corporation of China Ltd (Chalco)    swung back to profitability in the first nine months  buoyed by higher metal prices and continued cost-cutting efforts  the company said on Thursday.",
        "date": "10202016",
        "name": "Aluminum Corporation of China Limited",
        "news_type": "topStory",
        "symbol": "ACH",
        "title": "China's aluminium producer Chalco returns to profit in Jan-Sept "
    },
    {
        "content": "SINGAPORE Aluminum Corporation of China Ltd (Chalco)    posted a sharp rise in profit in the first half of the year due to a general recovery in aluminum prices  the company said on Thursday.",
        "date": "08252016",
        "name": "Aluminum Corporation of China Limited",
        "news_type": "topStory",
        "symbol": "ACH",
        "title": "Aluminium producer Chalco's first one net profit up sharply on price recovery "
    },
    {
        "content": "SINGAPORE  Aug 25 Aluminum Corporation of China Ltd (Chalco)   posted a sharp rise in profit in the first half of the year due to a general recovery in aluminium prices  the company said on Thursday.",
        "date": "08252016",
        "name": "Aluminum Corporation of China Limited",
        "news_type": "normal",
        "symbol": "ACH",
        "title": "Aluminium producer Chalco's H1 net profit up sharply on price recovery "
    },
    {
        "content": "HONG KONG Aluminum Corp of China (Chinalco)  the country's top producer of the metal  plans to shut down its biggest smelter - accounting for about an eighth of its total capacity - due to low prices  an industry body said.",
        "date": "10162015",
        "name": "Aluminum Corporation of China Limited",
        "news_type": "topStory",
        "symbol": "ACH",
        "title": "Chinalco plans shutdown of biggest aluminum smelter: report "
    },
    {
        "content": "HONG KONG  April 28 Aluminum Corp of China Ltd (Chalco)  swung to a profit in the first quarter of 2015 after domestic prices of the metal in the world's top consumer rose.",
        "date": "04282015",
        "name": "Aluminum Corporation of China Limited",
        "news_type": "topStory",
        "symbol": "ACH",
        "title": "China's top aluminium producer Chalco swings to profit in Q1 "
    }
]