[
    {
        "content": "* Accenture - ‍formed a strategic alliance with and made a minority investment in Paxata​",
        "date": "11132017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture makes minority investment in Paxata​ "
    },
    {
        "content": "* Accenture Plc - ‍announced an expanded strategic alliance partnership with Vlocity Inc​ Source text for Eikon: Further company coverage: ( Bangalore.newsroom@thomsonreuters.com )",
        "date": "11072017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture expands strategic alliance with Vlocity Inc​ "
    },
    {
        "content": "* Accenture appoints Natalie Heisler as managing director  Accenture Analytics lead for Canada Source text for Eikon: Further company coverage:",
        "date": "11082017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture appoints Natalie Heisler as managing director for Accenture Analytics in Canada "
    },
    {
        "content": "* Accenture names John Goodman chief executive of Accenture Federal Services",
        "date": "11072017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "BRIEF-Accenture names John Goodman chief executive of Accenture Federal Services "
    },
    {
        "content": "* Accenture - ‍Accenture ventures has made a minority investment in Ncino​ Source text for Eikon: Further company coverage:",
        "date": "10252017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture Ventures has made a minority investment in Ncino​ "
    },
    {
        "content": "* Accenture announces intention to acquire French digital commerce agency Altima",
        "date": "10172017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture announces intention to acquire France-based Altima "
    },
    {
        "content": "NEW YORK  Oct 12 U.S. consulting company Accenture said on Thursday it has been appointed by the Monetary Authority of Singapore (MAS) and the Association of Banks in Singapore (ABS) to manage and develop a blockchain-based platform for interbank payments.",
        "date": "10122017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "Singapore central bank  bank association  Accenture in blockchain tie-up "
    },
    {
        "content": "* Accenture acquires IBB Consulting to expand strategy capabilities for communications  media & technology clients",
        "date": "10092017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture acquires IBB Consulting "
    },
    {
        "content": "Oct 9 Delta Partners  an advisory and investment firm specializing in the telecoms  media and digital space  appointed Mark Fleming as a partner  based in its New York office.",
        "date": "10092017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "MOVES-Delta Partners appoints Mark Fleming as partner "
    },
    {
        "content": "Oct 2 International Paper Co  a fiber-based packaging  pulp and paper producer  said on Monday it would transfer $1.3 billion in pension obligations to No. 2 U.S. life insurer Prudential Financial.",
        "date": "10022017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "UPDATE 1-International Paper unloads $1.3 bln in pension liabilities "
    },
    {
        "content": "Accenture Plc's  bets on digital and cloud service businesses are paying off  the consulting and outsourcing giant's results showed on Thursday  although it again warned of problems from political wrangling over Obamacare.",
        "date": "09282017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "Accenture acquisitions working  U.S. worries persist "
    },
    {
        "content": "Sept 28 Accenture Plc's bets on digital and cloud service businesses are paying off  the consulting and outsourcing giant's results showed on Thursday  although it again warned of problems from political wrangling over Obamacare.",
        "date": "09282017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "UPDATE 2-Accenture acquisitions working  U.S. worries persist "
    },
    {
        "content": "* Accenture reports strong fourth-quarter and full-year fiscal 2017 results",
        "date": "09282017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "BRIEF-Accenture reports Q4 GAAP earnings per share $1.48 "
    },
    {
        "content": "Sept 28 Accenture Plc reported a 7.5 percent rise in quarterly revenue  as the consulting and outsourcing services provider reaped benefits from its investments in fast-growing digital and cloud service offerings.",
        "date": "09282017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "Accenture reports 7.5 pct rise in quarterly revenue "
    },
    {
        "content": "* ‍ANNOUNCES THAT IT HAS ENTERED INTO AN AGREEMENT WITH ACCENTURE  ADVISERS TO MICHAEL KORS​ Source text for Eikon: Further company coverage: (Bangalore.newsroom@thomsonreuters.com)",
        "date": "09222017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Jimmy Choo says entered into an agreement with Accenture "
    },
    {
        "content": "* Accenture Plc - ‍collaborating through a multi-year  multi-million-dollar agreement to develop cyber defense solutions​ Source text for Eikon: Further company coverage:",
        "date": "09262017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture  Microsoft and Avanade expand strategic alliance to offer advanced cybersecurity solutions "
    },
    {
        "content": "SAO PAULO Bank's services fees face \"secular downward\" pressure in the long run  which will drive lenders back toward credit transactions whose margins are resilient to competition and new technologies  a senior executive at management consultants Accenture Plc  said.",
        "date": "09152017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "Accenture sees 'secular downward' trend in bank fees "
    },
    {
        "content": "* Accenture to acquire IBB Consulting to expand Accenture strategy capabilities in communications  media & technology industry",
        "date": "09062017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture to acquire IBB Consulting "
    },
    {
        "content": "* Says ‍Apple & Accenture partner to create IOS business solutions​",
        "date": "08292017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-‍Apple & Accenture partner to create IOS business solutions​ "
    },
    {
        "content": "Aug 29 Technology company Apple Inc and professional services company Accenture PLC said Tuesday they will team up to help businesses build better applications for iOS  the operating system that powers Apple's iPhone and iPad.",
        "date": "08292017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "Apple  Accenture team up on iPhone  iPad apps for businesses "
    },
    {
        "content": "* Accenture acquires Verax  enhancing its banking technology capabilities in Canada",
        "date": "08242017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture acquires Verax "
    },
    {
        "content": "* Accenture acquires marketing agency Wire Stone to deliver connected customer experiences",
        "date": "08092017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture acquires marketing agency Wire Stone‍​ "
    },
    {
        "content": "* Accenture acquires Search Technologies to expand its content analytics and enterprise search capabilities",
        "date": "08032017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture says acquires Search Technologies "
    },
    {
        "content": "* Company ‍will expand its New York City innovation hub with a move to brand-new Hudson Yards district in 2020​",
        "date": "08022017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture to expand New York City innovation hub "
    },
    {
        "content": "* Accenture appoints Tracey T. Travis  CFO of the Estée Lauder companies  to board of directors",
        "date": "07202017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture appoints Tracey Travis to board of directors "
    },
    {
        "content": "* Accenture acquires Intrepid  expands capabilities to help brands transform mobile user experiences as connected devices soar",
        "date": "06282017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture acquires Intrepid  expands capabilities to help brands transform mobile user experiences as connected devices soar "
    },
    {
        "content": "NEW YORK  June 19 Accenture Plc and Microsoft Corp are teaming up to build a digital ID network using blockchain technology  as part of a United Nations-supported project to provide legal identification to 1.1 billion people worldwide with no official documents.",
        "date": "06192017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "Accenture  Microsoft team up on blockchain-based digital ID network "
    },
    {
        "content": "Consulting and outsourcing services provider Accenture Plc  said on Friday it would transfer $1.6 billion in pension obligations to insurers American International Group Inc  and MassMutual.",
        "date": "06232017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "Accenture unloads $1.6 billion in pension liabilities to AIG  MassMutual "
    },
    {
        "content": "June 23 Consulting and outsourcing services provider Accenture Plc said on Friday it would transfer $1.6 billion in pension obligations to insurers American International Group Inc and MassMutual.",
        "date": "06232017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "Accenture unloads $1.6 bln in pension liabilities to AIG  MassMutual "
    },
    {
        "content": "* Accenture reduces U.S. pension obligations by $1.6 billion through previously announced plan termination  following asset transfer to AIG and MassMutual",
        "date": "06232017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "BRIEF-Accenture reduces U.S. pension obligations by $1.6 billion "
    },
    {
        "content": "* Accenture - based on current and projected future demand  increased headcount to about 411 000 as of May 31 versus about 375 000 as of May 31  2016 - SEC filing",
        "date": "06222017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture increases headcount to about 411 000 as of May 31 "
    },
    {
        "content": "Accenture Plc  trimmed its annual revenue forecast on Thursday  triggering concerns that uncertainty around U.S. healthcare policy may be weighing on the company's flagship consulting business.",
        "date": "06222017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "Accenture trims revenue forecast amid US healthcare uncertainty "
    },
    {
        "content": "* 3rd-qtr revenue beats estimates (Adds details  shares  CEO and analyst comment)",
        "date": "06222017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "UPDATE 2-Accenture trims revenue forecast amid US healthcare uncertainty "
    },
    {
        "content": "* Q3 earnings per share view $1.52 -- Thomson Reuters I/B/E/S",
        "date": "06222017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "BRIEF-Accenture reports Q3 earnings per share $1.05 "
    },
    {
        "content": "June 22 Consulting and outsourcing services provider Accenture Plc reported a 5.1 percent increase in quarterly net revenue on Thursday  as the company's investments to boost its digital and cloud service offerings pay off.",
        "date": "06222017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "Accenture's net revenue rises 5.1 pct "
    },
    {
        "content": "* Accenture to acquire Phase One  further enhancing its salesforce capabilities and client innovation in the cloud for federal market",
        "date": "06072017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture Plc to acquire Phase One "
    },
    {
        "content": "* Accenture acquires solutionsiq  adds leading agile transformation expertise and services",
        "date": "06022017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture acquires SolutionsIQ "
    },
    {
        "content": "* Accenture to acquire LabAnswer  expanding its life sciences and cross-industry research and laboratory informatics capabilities",
        "date": "06012017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture to acquire LabAnswer "
    },
    {
        "content": "* Accenture Plc - has taken a minority position in and formed a strategic alliance with Nomis Solution",
        "date": "05232017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture takes minority position in and forms strategic alliance with Nomis Solution "
    },
    {
        "content": "* Accenture acquires Media Hive to expand its commerce capabilities",
        "date": "05152017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture says acquires Media Hive "
    },
    {
        "content": "* Accenture acquires creative and design agencies The Monkeys and Maud to expand its customer experience capabilities in Australia and New Zealand",
        "date": "05072017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture acquires creative  design agencies The Monkeys and Maud "
    },
    {
        "content": "* Accenture federal services has been awarded a contract by transportation security administration",
        "date": "04252017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture federal services awarded contract by TSA "
    },
    {
        "content": "* Accenture completes acquisition of 62% majority shareholding in SinnerSchrader AG  expands customer experience offering in Germany",
        "date": "04122017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture completes acquisition of 62 pct shareholding in SinnerSchrader AG "
    },
    {
        "content": "* Accenture and Biocelerate collaborate to advance biopharmaceutical innovation through increased insights in research & development Source text for Eikon: Further company coverage:",
        "date": "04102017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture and Biocelerate collaborate to advance biopharmaceutical innovation "
    },
    {
        "content": "* Management board and supervisory board recommend to accept the takeover offer of Accenture in their joint statement Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "04062017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Sinnerschrader: management and supervisory boards recommend to accept takeover offer "
    },
    {
        "content": "TORONTO  April 6 The Toronto Stock Exchange operator  TMX Group Ltd  said on Thursday it has developed a blockchain-based prototype for electronic shareholder voting  the latest effort by an exchange operator to leverage the technology to try to solve an industry problem.",
        "date": "04062017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "Exchange operator TMX develops proxy voting prototype using blockchain "
    },
    {
        "content": "* Accenture acquires Genfour  expands its capabilities in intelligent automation services",
        "date": "04032017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture acquires Genfour "
    },
    {
        "content": "LONDON Artificial intelligence (AI) will become the primary way banks interact with their customers within the next three years  according to three quarters of bankers surveyed by consultancy Accenture  in a new report.",
        "date": "03282017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "AI to become main way banks interact with customers within three years: Accenture "
    },
    {
        "content": "LONDON  March 28 Artificial intelligence (AI) will become the primary way banks interact with their customers within the next three years  according to three quarters of bankers surveyed by consultancy Accenture in a new report.",
        "date": "03282017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "REFILE-AI to become main way banks interact with customers within 3 yrs-Accenture "
    },
    {
        "content": "* Accenture awarded $232 million contract by GSA Fedsim for U.S. marshals' mission modernization program  Source text for Eikon:  Further company coverage:",
        "date": "03282017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "BRIEF-Accenture awarded $232 million contract by GSA Fedsim "
    },
    {
        "content": "Consulting and outsourcing services provider Accenture Plc slightly raised its full-year profit forecast  but the revised outlook was still largely below market expectations  sending the company's shares down as much as 4.5 percent.",
        "date": "03232017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "Accenture's full-year profit forecast disappoints  shares fall "
    },
    {
        "content": "* 2nd-qtr profit $1.33/shr vs est. $1.30   (Adds details  updates shares)",
        "date": "03232017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "UPDATE 3-Accenture's full-year profit forecast disappoints  shares fall "
    },
    {
        "content": "* Accenture to acquire First Annapolis  enhancing its consulting and advisory capabilities in payments",
        "date": "03232017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "BRIEF-Accenture to buy First Annapolis "
    },
    {
        "content": "* Accenture reports strong second-quarter fiscal 2017 results",
        "date": "03232017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "BRIEF-Accenture reports Q2 earnings per share of $1.33 "
    },
    {
        "content": "* Accenture says set a new goal to grow percentage of its women in u.s. From 36 percent to 40 percent by 2020  Source text for Eikon:  Further company coverage:",
        "date": "03092017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture sets new goal to grow percentage of women in workplace in U.S. "
    },
    {
        "content": "* Accenture and Avanade strengthen Microsoft alliance to expand capabilities in cloud and digital transformation; Debbie Polishook appointed to Avanade board of directors  Source text for Eikon:  Further company coverage:",
        "date": "03082017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture and Avanade strengthen Microsoft alliance "
    },
    {
        "content": "TOKYO  Feb 28 Global investment in financial technology venture firms grew 10 percent last year to $23.2 billion  consultancy firm Accenture said on Tuesday  fuelled by huge investor appetite in China and Japan.",
        "date": "02282017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "Global fintech investment up 10 pct in 2016  driven by China - Accenture "
    },
    {
        "content": "Accenture Plc said on Friday it would create 15 000 \"highly skilled\" new jobs in the United States  as IT services firms brace for a more protectionist U.S. technology visa program under President Donald Trump.",
        "date": "02172017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "Accenture to create 15 000 jobs in U.S. "
    },
    {
        "content": "Feb 17 Accenture Plc said on Friday it would create 15 000 \"highly skilled\" new jobs in the United States  as IT services firms brace for a more protectionist U.S. technology visa program under President Donald Trump.",
        "date": "02172017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "UPDATE 1-Accenture to create 15 000 jobs in US "
    },
    {
        "content": "Feb 17 Accenture Plc said on Friday it would create 15 000 jobs in the United States  as IT services firms brace for a more protectionist U.S. technology visa program under President Donald Trump.",
        "date": "02172017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "CORRECTED-Accenture to create 15 000 jobs in US "
    },
    {
        "content": "* Accenture to acquire iDefense Security Intelligence services  a cyber threat intelligence business",
        "date": "02092017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture to acquire iDefense Security Intelligence Services "
    },
    {
        "content": "* By end of 2020  co will open 10 new innovation hubs in key cities in U.S",
        "date": "02172017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "BRIEF-Accenture says will invest $1.4 bln in training in the U.S. "
    },
    {
        "content": "NEW YORK  Feb 8 Accenture Plc has developed new technology that it says can help make blockchain applications more secure and could speed up their deployment in sectors such as finance.",
        "date": "02082017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "Accenture beefs up blockchain security "
    },
    {
        "content": "* Accenture hires Madeleine Chenette as office managing director  Montreal",
        "date": "02012017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture hires office managing director  Montreal "
    },
    {
        "content": "* Accenture to acquire InvestTech Systems Consulting  further expanding its asset-management consulting capabilities",
        "date": "01312017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture to acquire InvestTech Systems Consulting "
    },
    {
        "content": "* Accenture acquires solid servision to significantly expand servicenow capabilities",
        "date": "01252017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture acquires solid servision to significantly expand servicenow capabilities "
    },
    {
        "content": "* Accenture to expand its aviation capabilities with acquisition of Seabury Group's corporate advisory and aviation consulting business",
        "date": "01192017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture says acquisition of Seabury Group's corporate advisory and aviation consulting business "
    },
    {
        "content": "* Accenture acquires product design and innovation firm Altitude  enhancing ability to help companies harness the internet of things to create new business models  Source text for Eikon:  Further company coverage:",
        "date": "01092017",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture buys Altitude "
    },
    {
        "content": "TEL AVIV  Jan 9 The venture arms of Microsoft  and Qualcomm have invested in Team8  an Israeli creator of cybersecurity start-ups  as big multinational companies get behind Israel's burgeoning cyber industry in the face of growing threats.",
        "date": "01092017",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "Microsoft  Qualcomm back Israel's Team8 cybersecurity firm "
    },
    {
        "content": "* Accenture acquires Nashco Consulting Ltd.  expanding ServiceNow capabilities in North America",
        "date": "11092016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture acquires Nashco Consulting  expanding ServiceNow capabilities in North America "
    },
    {
        "content": "* With Hainer's appointment  co's board now comprises 14 directors  13 of whom are external and independent",
        "date": "11022016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture appoints Herbert Hainer to board of directors "
    },
    {
        "content": "* Accenture-BP extended agreement by 2 years for co to serve as its global provider of finance and accounting business process services through 2021",
        "date": "11012016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-BP extends agreement with Accenture as its provider of business process services "
    },
    {
        "content": "* Schlumberger expands Accenture finance and accounting business process outsourcing agreement to 2021",
        "date": "10272016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture says Schlumberger expands Accenture finance and accounting business process outsourcing agreement to 2021 "
    },
    {
        "content": "* Accenture acquires 2nd road to strengthen strategy capabilities in Australia and New Zealand  Source text for Eikon:  Further company coverage:",
        "date": "10312016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture acquires 2nd Road to strengthen strategy capabilities in Australia and New Zealand "
    },
    {
        "content": "* Accenture PLC - Co is approved to provide U.S. Federal agencies with human capital  training and other HR services under $11.5 billion award vehicle  Source text for Eikon:  Further company coverage:",
        "date": "10122016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture is approved to provide U.S. Federal agencies with HR services "
    },
    {
        "content": "* Accenture to acquire Defense Point Security LLC to bolster cybersecurity services  increase capabilities to help U.S. Federal agencies maximize their cyber defense",
        "date": "10052016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture to acquire Defense Point Security to bolster cybersecurity services "
    },
    {
        "content": "* Combined group will be led by DayNine CEO and co-founder Tim Ramos",
        "date": "09262016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture to acquire DayNine "
    },
    {
        "content": "Consulting and outsourcing services provider Accenture Plc  reported better-than-expected quarterly revenue and profit as its investments to boost digital and cloud services pay off.",
        "date": "09292016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "Push to digital helps Accenture beat revenue estimate "
    },
    {
        "content": "By Julia Love     Sept 29 Alphabet Inc's Google said on Thursday it renamed its business-to-business cloud computing brand and enhanced some enterprise applications using artificial intelligence  the company's latest gambit to better compete with Amazon.com and Microsoft Corp. in the lucrative cloud business.      Discussing the rebranded Google Cloud  Diane Greene  senior vice president of Google's enterprise business  said the company has made good progress courting customers and i",
        "date": "09292016",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "Google rebrands cloud business  adds more artificial intelligence "
    },
    {
        "content": "Sept 29 Consulting and outsourcing services provider Accenture Plc reported better-than-expected quarterly revenue and profit as its investments to boost digital and cloud services pay off.",
        "date": "09292016",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "UPDATE 3-Push to digital helps Accenture beat revenue estimate "
    },
    {
        "content": "Sept 29 Accenture Plc  a provider of consulting and outsourcing services  reported a 7.6 percent rise in quarterly revenue as its investments to boost digital and cloud services pay off.",
        "date": "09292016",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "Accenture quarterly revenue rises 7.6 percent "
    },
    {
        "content": "Accenture  intends to acquire a 47.7 percent stake in French service consultancy firm Octo Technology   the company said in a statement on Thursday.",
        "date": "09152016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "Accenture intends to acquire Octo Technology at 22.50 euros/share "
    },
    {
        "content": "Sept 15 Accenture intends to acquire a 47.7 percent stake in French service consultancy firm Octo Technology  the company said in a statement on Thursday.",
        "date": "09152016",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "REFILE-Accenture intends to acquire Octo Technology at 22.50 euros/share "
    },
    {
        "content": "* Accenture announces intention to acquire Octo Technology SA to expand digital capabilities in France",
        "date": "09152016",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "BRIEF-Accenture intends to acquire Octo Technology "
    },
    {
        "content": "* Entered into an agreement to acquire New Energy Group  an Italy-based company specializing in salesforce solutions",
        "date": "09082016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture agreed to buy New Energy Group "
    },
    {
        "content": "* Entered into an agreement to acquire Redcore  a privately held Australia-based consulting company  Source text for Eikon:  Further company coverage:",
        "date": "08222016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture to acquire Australian security company Redcore "
    },
    {
        "content": "* Under agreed multi-year agreement  Accenture will extend its provision of application development and maintenance services to business",
        "date": "08182016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture contract with Dixons Carphone extended "
    },
    {
        "content": "* Accenture to manage Oracle Fusion applications for Skanska  drive greater operational efficiency",
        "date": "08102016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture to manage Oracle Fusion applications for Skanska "
    },
    {
        "content": "* Accenture acquires Tecnilógica to scale its open source digital skills in Spain",
        "date": "07282016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture acquires Tecnilógica to scale its digital skills in spain "
    },
    {
        "content": "* Accenture acquires MOBGEN expanding end-to-end digital services",
        "date": "07192016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture buys end-to-end digital services company MOBGEN "
    },
    {
        "content": "* With new appointment  accenture's board now comprises 13 directors  12 of whom are external and independent  Source text for Eikon:  Further company coverage:    )",
        "date": "07132016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture appoints Nancy Mckinstry to board of directors "
    },
    {
        "content": "* Accenture to invest EUR500 000 in robovalley to create new innovations in robotics",
        "date": "07112016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture to invest 500 000 Euros in Robovalley to create new innovations in robotics "
    },
    {
        "content": "July 6 Accenture CEO Pierre Nanterme in letter to employees:",
        "date": "07062016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture CEO says was recently diagnosed with colon cancer "
    },
    {
        "content": "July 6 Consulting and outsourcing company Accenture Plc said Chief Executive Pierre Nanterme was diagnosed with colon cancer and is currently recovering from a surgery.",
        "date": "07062016",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "Accenture CEO diagnosed with colon cancer  recovering from surgery "
    },
    {
        "content": "Accenture Plc posted better-than-expected quarterly net revenue  driven by demand for its digital services like cloud and security  particularly in its consulting unit.",
        "date": "06232016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "Accenture revenue beats on strong demand for digital services "
    },
    {
        "content": "* 3rd-qtr consulting revenue rises 12.4 pct   (Adds analyst  CEO comment)",
        "date": "06232016",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "UPDATE 2-Accenture revenue beats on strong demand for digital services "
    },
    {
        "content": "June 23 Accenture Plc posted a better-than-expected 8.6 percent rise in quarterly net revenue  driven by demand for consulting services  particularly from customers in North America.",
        "date": "06232016",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "CORRECTED-UPDATE 1-Accenture revenue rises on demand for consulting services "
    },
    {
        "content": "June 23 Consulting and outsourcing company Accenture Plc reported an 8.6 percent rise in quarterly net revenue  driven by higher demand from customers in North America.",
        "date": "06232016",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "Accenture net revenue rises 8.6 percent "
    },
    {
        "content": "TEL AVIV  June 20 Seeking to shore up the cybersecurity services it provides to customers  Accenture Plc  has acquired an Israeli company and is establishing a research and development centre in the country.",
        "date": "06202016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "Accenture looks to Israel to boost cybersecurity portfolio "
    },
    {
        "content": "* Says wins major contract from thames water joinly with Accenture  Deloitte  IBM",
        "date": "05202016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Bilfinger wins Thames Water contract with Accenture  Deloitte  IBM "
    },
    {
        "content": "* To Acquire OPS Rules To Expand Its Machine Learning And Operations Analytics Capabilities That Help Deliver Data Driven transformation  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "05092016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture to acquire OPS Rules "
    },
    {
        "content": "* Accenture appoints Greg Kaplan as lead creative director  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04282016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture appoints Greg Kaplan as lead creative director "
    },
    {
        "content": "* Accenture PLC files for stock shelf  size undisclosed - SEC Filing",
        "date": "04222016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture Plc files for stock shelf  size undisclosed - SEC Filing "
    },
    {
        "content": "* Accenture and Apax Partners to form joint venture to drive digital innovation in insurance software",
        "date": "04182016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Accenture and Apax Partners to form joint venture "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 20 (Fitch) Fitch Ratings has affirmed the ratings for Accenture  plc (Accenture) and subsidiaries  including Accenture's Long-Term Issuer Default  Rating (IDR) at 'A+'/Stable Outlook. Fitch's actions affect approximately $1  billion of debt  including the undrawn revolving credit facility (RCF). A full  list of ratings follows at the end of this release. KEY RATING DRIVERS Negligible Debt: Fitch expects that Accenture's d",
        "date": "04202016",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "Fitch Affirms Accenture's IDR at 'A+'; Outlook Stable "
    },
    {
        "content": "* Sees FY total non-IFRS revenue growth of 20.5 percent to 24.5 percent(implying non-IFRS revenue of $536 million to $553 million  up from $526 million to $548 million)",
        "date": "09112015",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Temenos Group signs Nordea core banking replacement and upgrades guidance "
    },
    {
        "content": "* Consortium led by Leidos Inc and Accenture Federal has just been officially awarded a major contract with US federal government",
        "date": "08102015",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Assima confirms financial guidance following deal with DoD "
    },
    {
        "content": "* Has signed a 5-year Business Process Outsourcing (BPO) contract with Accenture   Further company coverage:    (Gdynia Newsroom)",
        "date": "07012015",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-TNT signs BPO contract with Accenture "
    },
    {
        "content": "Accenture Plc  raised its full-year revenue forecast for the third time  reflecting continued strong demand for the company's consulting and outsourcing services.",
        "date": "06252015",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "Accenture raises revenue forecast for the third time "
    },
    {
        "content": "* Accenture and Alcatel-Lucent announce four-year agreement with Telefonica to deploy Alcatel-Lucent's motive customer experience management software",
        "date": "04072015",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-Alcatel-Lucent and Accenture announce four-year agreement with Telefonica "
    },
    {
        "content": "* Indexes off: Dow 0.23 pct  S&P 0.24 pct  Nasdaq 0.27 pct   (Updates prices  changes comment  byline)",
        "date": "03262015",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "US STOCKS-Wall St ends down in choppy session  but off lows "
    },
    {
        "content": "Consulting and outsourcing company Accenture Plc raised its full-year revenue growth forecast for the second time as it won more business from companies looking to cut costs and improve efficiency in a tough economic environment.",
        "date": "03262015",
        "name": "Accenture plc",
        "news_type": "normal",
        "symbol": "ACN",
        "title": "Accenture raises revenue growth forecast for second time "
    },
    {
        "content": "NEW YORK - U.S. stocks fell for a fourth straight session on Thursday but indexes ended well off session lows with support from economic data and earnings  including Accenture's.",
        "date": "03272015",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "India Morning Call-Global Markets "
    },
    {
        "content": "March 3 Industrial and Financial Systems (IFS) AB",
        "date": "03032015",
        "name": "Accenture plc",
        "news_type": "topStory",
        "symbol": "ACN",
        "title": "BRIEF-IFS signs Nordic cooperation agreement with Accenture "
    }
]