[
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 17 (Fitch) Fitch Ratings has withdrawn the 'D' Long-Term Issuer Default Ratings (IDRs) for Toys 'R' Us  Inc.  Toys 'R' Us-Delaware  Inc.  Toys 'R' Us Property Co. I  LLC  and TRU Taj LLC. Given Toys' Chapter 11 filing on Sept. 18  2017  Fitch will no longer provide ratings or analytical coverage for the company. RATING SENSITIVITIES Rating sensitivities are not applicable in light of the ratings being withdrawn. Conta",
        "date": "11172017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Fitch Withdraws Toys 'R' Us IDR "
    },
    {
        "content": "Photoshop maker Adobe Systems Inc forecast better-than-expected revenue and profit for fiscal 2018 due to growth in its cloud business  sending its shares up 8 percent in extended trading.",
        "date": "10182017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Adobe forecasts FY18 profit above estimates  shares surge "
    },
    {
        "content": "Oct 18 Photoshop maker Adobe Systems Inc forecast better-than-expected revenue and profit for fiscal 2018 on growth in its cloud business  sending its shares up 5 percent in extended trading.",
        "date": "10182017",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Adobe forecasts fiscal 2018 revenue  profit above expectations "
    },
    {
        "content": "* Adobe Systems Inc - ‍reaffirming its current Q4 fiscal year 2017 revenue and earnings per share targets​",
        "date": "10182017",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "BRIEF-Adobe Systems ‍reaffirms its current Q4 fiscal year 2017 revenue and earnings per share targets​ "
    },
    {
        "content": "TORONTO Adobe Systems Inc  warned on Monday that hackers are exploiting vulnerabilities in its Flash multimedia software platform in web browsers  and the company urged users to quickly patch their systems to prevent such attacks.",
        "date": "10162017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Adobe warns that hackers are exploiting its Flash software "
    },
    {
        "content": "* The Kaspersky Lab says its advanced exploit prevention system identified \"new Adobe Flash zero day exploit\"  used in an attack on October 10",
        "date": "10162017",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "BRIEF-The ‍Kaspersky Lab reports \"vulnerability\" to Adobe "
    },
    {
        "content": "TORONTO  Oct 16 Adobe Systems Inc warned on Monday that hackers are exploiting vulnerabilities in its Flash multimedia software platform in web browsers  and the company urged users to quickly patch their systems to prevent such attacks.",
        "date": "10162017",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "UPDATE 1-Adobe warns that hackers are exploiting its Flash software "
    },
    {
        "content": "Oct 16 Cyber security firm Kaspersky Lab Inc said on Monday it identified a vulnerability in Adobe Flash that could be used to deploy a surveillance malware through a Microsoft Word document.",
        "date": "10162017",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Kaspersky finds bug in Adobe Flash "
    },
    {
        "content": "* Adobe says released security update for adobe flash player for windows  macintosh  linux  chrome os to address a critical type confusion vulnerability Source text: (https://adobe.ly/2hJDgTT) Further company coverage:",
        "date": "10162017",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "BRIEF-Adobe releases security update for Flash player to address vulnerability "
    },
    {
        "content": "Adobe Systems Inc  on Tuesday reported better-than-expected quarterly revenue  driven by subscriber additions to Creative Cloud  a package of software tools that houses Photoshop.",
        "date": "09192017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Adobe revenue beats; shares fall after in-line forecast "
    },
    {
        "content": "* Disappointed with Experience Cloud bookings in Q3 - CEO (Adds conference call details  updates share price)",
        "date": "09192017",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "UPDATE 2-Adobe revenue beats; shares fall after in-line forecast "
    },
    {
        "content": "* Q4 earnings per share view $1.10  revenue view $1.95 billion -- Thomson Reuters I/B/E/S",
        "date": "09192017",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "BRIEF-Adobe Systems sees Q4 earnings per share to be about $0.86 "
    },
    {
        "content": "Sept 19 Adobe Systems Inc reported a 25.8 percent rise in quarterly revenue  as it added more subscribers to Creative Cloud  a package of software tools  which houses Photoshop.",
        "date": "09192017",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Adobe reports 25.8 percent rise in quarterly revenue "
    },
    {
        "content": "* Adobe and Microsoft expand strategic partnership to drive e-signatures and collaboration among teams in the cloud",
        "date": "09072017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "BRIEF-Adobe  Microsoft expand partnership on e-commerce signatures "
    },
    {
        "content": "* Hootsuite and Adobe collaborate to unlock the value of creative content across social Source text for Eikon: Further company coverage:",
        "date": "08222017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "BRIEF-Hootsuite annoucnes integration with Adobe products "
    },
    {
        "content": "* Adobe Systems Inc - to open up its data science and algorithmic optimization capabilities in Adobe Target  personalization engine of Adobe Marketing Cloud. Source text for Eikon: Further company coverage:",
        "date": "07272017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "BRIEF-Adobe Systems to open up data science and algorithmic optimization capabilities in Adobe Target "
    },
    {
        "content": "SAN FRANCISCO Adobe Systems Inc's Flash  a once-ubiquitous technology used to power most of the media content found online  will be retired at the end of 2020  the software company announced Tuesday.",
        "date": "07252017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Adobe to pull plug on Flash  ending an era "
    },
    {
        "content": "ADOBE SYSTEMS WILL END SUPPORT FOR WIDELY USED FLASH MULTIMEDIA SOFTWARE BY 2020",
        "date": "07252017",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "ADOBE SYSTEMS WILL END SUPPORT FOR WIDELY USED FLASH MULTIMEDIA SOFTWARE BY 2020 "
    },
    {
        "content": "* Adobe Systems Inc- announced it has acquired all Skybox Technology from Mettle",
        "date": "06212017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "BRIEF-Adobe Systems Inc says it has acquired all Skybox Technology from Mettle "
    },
    {
        "content": "Adobe Systems Inc  reported a better-than-expected quarterly profit and forecast current-quarter above analysts' estimates  as the software maker benefits from a rapid switch to the cloud.",
        "date": "06202017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Adobe's cloud push fuels profit beat  shares surge "
    },
    {
        "content": "Starting today Reuters video and photography content is available across Adobe products through Adobe Stock’s new editorial offerings. Reuters archive of award-winning photography and video clips will be available in addition to new photo and video content added daily.",
        "date": "06132017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Reuters photo and video content now available on Adobe Stock "
    },
    {
        "content": "* Adobe Stock debuts new editorial collection and next gen search capability Source text for Eikon: Further company coverage:",
        "date": "06132017",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "BRIEF-Adobe Stock debuts new editorial collection and next gen search capability "
    },
    {
        "content": "March 20 Microsoft Corp and Adobe Systems Inc are joining to make their respective sales and marketing software products more potent competitors to Salesforce.com Inc and Oracle Corp offerings  the two firms said Monday.",
        "date": "03212017",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Adobe  Microsoft team up to share sales and marketing data "
    },
    {
        "content": "Wall Street drifted lower on Monday as investors worried that President Donald Trump's plan to cut taxes and boost the economy could take longer than previously expected. | Video ",
        "date": "03202017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Wall Street drifts lower; investors worry about tax-cut delay "
    },
    {
        "content": "NEW YORK U.S. stocks dipped on Friday as bank shares fell alongside Treasury yields while Adobe helped buoy the S&P tech sector and the Nasdaq Composite. | Video ",
        "date": "03172017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Wall St. flat as banks  Amgen weigh; Adobe rallies "
    },
    {
        "content": "* Dow down 0.1 pct  S&P 500 down 0.13 pct  Nasdaq flat   (Updates to market close  changes comment  byline)",
        "date": "03172017",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "US STOCKS-Wall St flat as banks  Amgen weigh; Adobe rallies "
    },
    {
        "content": "Adobe Systems Inc reported better-than-expected quarterly revenue and profit  as the demand for its Creative Cloud package of software tools  which includes Photoshop  continued to rise.",
        "date": "03162017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Adobe's first-quarter beats as Creative Cloud demand rises "
    },
    {
        "content": "* Dow flat  S&P up 0.01 pct  Nasdaq up 0.04 pct   (Adds details  updates prices)",
        "date": "03172017",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "US STOCKS-Wall St flat as tech gains offset weakness in banks "
    },
    {
        "content": "* Shares up 3.6 pct in extended trading   (Adds details  analyst comment  updates shares)",
        "date": "03162017",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "UPDATE 2-Adobe's 1st-qtr beats as Creative Cloud demand rises "
    },
    {
        "content": "March 16 Adobe Systems Inc reported a 21.6 percent rise in quarterly revenue  the twelfth straight quarter of increase  as its Creative Cloud package of software tools  which includes Photoshop  added more subscribers.",
        "date": "03162017",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Adobe reports 21.6 percent rise in quarterly revenue "
    },
    {
        "content": "* Adobe has been in talks to shift some of its business to Google cloud - The Information  citing sources  Source text  - http://bit.ly/2mjm0qm Further company coverage:   (Bengaluru Newsroom)",
        "date": "03082017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "BRIEF-Adobe has been in talks to shift some of its business to Google cloud - The Information  citing sources "
    },
    {
        "content": "* Major update to XML documentation add-on for Adobe experience manager",
        "date": "01312017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "BRIEF-Adobe announces update to XML documentation add-on for Adobe Experience Manager "
    },
    {
        "content": "* Adobe's board of directors elects Adobe CEO Shantanu Narayen as Chairman",
        "date": "02012017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "BRIEF-Adobe's board elects Adobe CEO Shantanu Narayen as Chairman "
    },
    {
        "content": "* Adobe announces program to repurchase $2.5 billion of stock by end of FY2019",
        "date": "01172017",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "BRIEF-Adobe to repurchase $2.5 bln of stock by end of 2019 "
    },
    {
        "content": "Adobe Systems Inc  reported better-than-expected quarterly revenue driven by higher demand for its creative cloud business including Photoshop  Illustrator and InDesign.",
        "date": "12152016",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Adobe revenue beats on creative cloud unit strength "
    },
    {
        "content": "Nov 10 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Thursday:",
        "date": "11102016",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Deals of the day - Mergers and acquisitions "
    },
    {
        "content": "Photoshop software maker Adobe Systems Inc said on Thursday it would buy advertising company TubeMogul Inc  for about $540 million  net of debt and cash  giving it a bigger presence in the rapidly growing online video market.",
        "date": "11102016",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Photoshop maker Adobe to buy video ad firm TubeMogul "
    },
    {
        "content": "Nov 10 Photoshop software maker Adobe Systems Inc said on Thursday it would buy advertising company TubeMogul Inc  for about $540 million  net of debt and cash  giving it a bigger presence in the rapidly growing online video market.",
        "date": "11102016",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "UPDATE 1-Photoshop maker Adobe to buy video ad firm TubeMogul "
    },
    {
        "content": "Nov 10 Photoshop software maker Adobe Systems Inc said on Thursday it would buy advertising company TubeMogul Inc  for about $540 million  giving it a bigger presence in the rapidly growing online video market.",
        "date": "11102016",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Photoshop maker Adobe to buy video ad firm TubeMogul for $540 mln "
    },
    {
        "content": "* Company is providing preliminary financial targets for fiscal year 2017",
        "date": "11022016",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "BRIEF-Adobe provides preliminary financial targets for FY2017 "
    },
    {
        "content": "* Partnering with Adobe to bring Reuters video and photography to Adobe's new editorial offerings for Adobe Stock",
        "date": "11022016",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "BRIEF-Reuters partners with Adobe to bring Reuters video  photography to Adobe Stock "
    },
    {
        "content": "* Adobe predicts record $91 billion in sales this holiday season",
        "date": "10272016",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "BRIEF-Adobe predicts $91 bln in sales this holiday season "
    },
    {
        "content": "Adobe Systems Inc  reported a better-than-expected 20 percent jump in quarterly revenue as its Creative Cloud package of software tools attracted more users.",
        "date": "09202016",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Adobe revenue beats estimates as cloud push gains pace "
    },
    {
        "content": "* Shares on pace to open at record high   (Adds CFO comment from conference call  details; updates shares)",
        "date": "09202016",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "UPDATE 2-Adobe revenue beats estimates as cloud push gains pace "
    },
    {
        "content": "* Says expect to achieve adobe marketing cloud year-over-year revenue growth of approximately 30% in Q4",
        "date": "09202016",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "BRIEF-Adobe Systems sees Q4 revenue of $1.55 bln- $1.60 bln "
    },
    {
        "content": "Sept 20 Adobe Systems Inc reported a 20 percent rise in quarterly revenue  the tenth straight quarter of increase  as its Creative Cloud package of software tools added more subscribers.",
        "date": "09202016",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Adobe's revenue rises for tenth quarter in a row "
    },
    {
        "content": "* Hale has served in senior positions at Linden Lab and Adobe systems",
        "date": "07212016",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "BRIEF-Surveymonkey says appoints Tom Hale as President "
    },
    {
        "content": "* Co-Chairman  John Warnock reports open market sale of 2 000 shares of co's common stock at average price of $98.51/share on July 20  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07212016",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "BRIEF-Adobe co-chairman John Warnock sells 2 000 shares of co's common stock "
    },
    {
        "content": "* Q3 earnings per share view $0.71  revenue view $1.47 billion -- Thomson Reuters I/B/E/S",
        "date": "06212016",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "BRIEF-Adobe expects Q3 earnings per share of $0.46 to $0.52 "
    },
    {
        "content": "June 21 Adobe Systems Inc reported a 20.4 percent rise in second-quarter revenue  as more customers subscribed for its Creative Cloud package of software tools  such as Photoshop.",
        "date": "06212016",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Adobe's revenue rises for ninth quarter in a row "
    },
    {
        "content": "Adobe Systems Inc's  second-quarter revenue and full-year revenue forecast just about met analysts' estimates  disappointing investors hoping demand for the company's Creative Cloud package of software tools would outpace expectations.",
        "date": "06222016",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Adobe's revenue forecast disappoints growth-hungry investors "
    },
    {
        "content": "* Indexes down: Dow 0.2 pct  S&P 0.06 pct  Nasdaq 0.06 pct   (Updates prices  changes byline)",
        "date": "06222016",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "US STOCKS-Wall St flat  all eyes on Brexit vote "
    },
    {
        "content": "* Dow down 0.14 pct  S&P unchanged  Nasdaq down 0.01 pct   (Updates to early afternoon)",
        "date": "06222016",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "US STOCKS-Wall St trims gains as survey adds to Brexit worries "
    },
    {
        "content": "* Indexes up: Dow 0.36 pct  S&P 0.39 pct  Nasdaq 0.48 pct   (Adds details  changes comment  updates prices)",
        "date": "06222016",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "US STOCKS-Healthcare stocks boost Wall St "
    },
    {
        "content": "* Indexes up: Dow 0.18 pct  S&P 0.14 pct  Nasdaq 0.05 pct   (Updates to open)",
        "date": "06222016",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "US STOCKS-Wall St edges up ahead of Brexit vote "
    },
    {
        "content": "* Futures up: Dow 16 pts  S&P 1.75 pts  Nasdaq 7.5 pts   (Adds details  comment; updates prices)",
        "date": "06222016",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "US STOCKS-Wall St set to open flat as investors await Brexit vote "
    },
    {
        "content": "* Livefyre will be part of Adobe Experience Manager and integrated across Adobe Marketing Cloud  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05032016",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "BRIEF-Adobe announces agreement to acquire Livefyre "
    },
    {
        "content": "* Partners with Adobe to power digital rights management for industry-leading multiscreen TV platform   Further company coverage:    (Gdynia Newsroom)",
        "date": "04202016",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "BRIEF-Intertrust partners with Adobe "
    },
    {
        "content": "BOSTON  April 7 Adobe Systems Inc  issued an emergency update on Thursday to its widely used Flash software for Internet browsers after researchers discovered a security flaw that was being exploited to deliver ransomware to Windows PCs.",
        "date": "04082016",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Adobe issues emergency update to Flash after ransomware attacks "
    },
    {
        "content": "BOSTON  April 7 Adobe Systems Inc  issued an emergency update on Thursday to its widely used Flash software for Internet browsers after researchers discovered a security flaw that was being exploited to deliver ransomware to Windows PCs.",
        "date": "04082016",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "UPDATE 1-Adobe issues emergency update to Flash after ransomware attacks "
    },
    {
        "content": "* Valueact Capital Management LP sold 8.73 mln shares of Adobe Systems Inc between 29-31 March 2016 at price of $92.97-$94",
        "date": "03312016",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "BRIEF-Valueact Capital Management Lp now holds 6 000 shares of Adobe Systems as of March 31  2016 "
    },
    {
        "content": "* Shares rise 7.5 percent in extended trading   (Adds forecast  details)",
        "date": "03172016",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "UPDATE 2-Adobe raises revenue  profit forecasts above estimates on cloud momentum "
    },
    {
        "content": "Software maker Adobe Systems Inc did not have knowledge of a patent application made by a New York-based software maker and therefore cannot be liable for infringement  the U.S. Court of Appeals for the Federal Circuit ruled on Tuesday.",
        "date": "02092016",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Adobe escapes patent damages as Federal Circuit clarifies notice requirement "
    },
    {
        "content": "Adobe Systems Inc  reported a profit that topped market expectations for the ninth quarter in a row on strong subscriber growth for its Creative Cloud package of software tools such as Photoshop.",
        "date": "12102015",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Adobe profit beats on strong subscriptions for Creative Cloud "
    },
    {
        "content": "* Shares rise 4.7 pct after hours  set to hit record high   (Adds executive and analyst comments  forecast)",
        "date": "12102015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "UPDATE 2-Adobe profit beats on strong subscriptions for Creative Cloud "
    },
    {
        "content": "Dec 10 Photoshop maker Adobe Systems Inc  reported a 21.7 percent rise in quarterly revenue  helped by strong growth in its cloud-powered graphic design and digital marketing businesses.",
        "date": "12102015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Adobe revenue rises 22 pct "
    },
    {
        "content": "Adobe Systems Inc  reported a profit that topped market expectations for the ninth straight quarter on strong subscriber growth for its Creative Cloud package of software tools  which includes Photoshop. | Video ",
        "date": "12112015",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Adobe profit beats on strong subscriptions for Creative Cloud "
    },
    {
        "content": "* Shares rise 4.7 pct after hours  set to hit record high   (Adds comment from CFO  detail on customers)",
        "date": "12112015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "UPDATE 3-Adobe profit beats on strong subscriptions for Creative Cloud "
    },
    {
        "content": "CHICAGO  Nov 30 Sales on Cyber Monday  the busiest day of the year for internet shopping  were up 14 percent from a year earlier  totalling $490 million between midnight and 10 a.m. ET  according to estimates by Adobe Digital Index.",
        "date": "11302015",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "U.S. Cyber Monday sales up 14 pct  on track for record -Adobe "
    },
    {
        "content": "Adobe Systems Inc lowered its profit forecast for 2016 below analyst estimates partly due to a strong dollar  sending its shares down as much as 13 percent in extended trading.",
        "date": "10062015",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Adobe 2016 forecast disappoints  shares slump "
    },
    {
        "content": "* Shares fall as much as 13 pct after market   (Adds details  analyst quote)",
        "date": "10062015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "UPDATE 2-Adobe 2016 forecast disappoints  shares slump "
    },
    {
        "content": "Oct 6 Adobe Systems Inc forecast 2016 revenue and profit below estimates  sending its shares down 8 percent in after-market trading.",
        "date": "10062015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Adobe forecasts 2016 profit  revenue below estimates "
    },
    {
        "content": "Sept 29 Software management company AppDynamics named David Wadhwani as its chief executive  replacing founder Jyoti Bansal  who will become chairman and chief strategist.",
        "date": "09292015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "AppDynamics names Adobe's David Wadhwani CEO "
    },
    {
        "content": "Adobe Systems Inc's lower-than-expected revenue and profit forecast for the current quarter overshadowed a strong rise in net subscriptions for its Creative Cloud software suite  sending its shares down 3.5 percent in extended trading.",
        "date": "09172015",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Adobe revenue  profit forecast miss estimates  shares slip "
    },
    {
        "content": "* Adds 684 000 net Creative Cloud subscriptions vs est 640 000",
        "date": "09172015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "UPDATE 2-Adobe revenue  profit forecast miss estimates  shares slip "
    },
    {
        "content": "Sept 17 Photoshop maker Adobe Systems Inc's  quarterly revenue and profit beat estimates  helped by better-than-expected net subscriptions to its Creative Cloud software suite.",
        "date": "09172015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "CORRECTED-UPDATE 1-Adobe revenue beats on higher-than-expected subcriptions "
    },
    {
        "content": "Sept 17 Photoshop maker Adobe Systems Inc  reported a 21 percent jump in quarterly revenue  as more customers subscribed to its creative and marketing software products provided over the Internet.",
        "date": "09172015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "CORRECTED-Photoshop maker Adobe's revenue jumps 21 pct on cloud push "
    },
    {
        "content": "NEW YORK Software company Adobe Systems Inc.  said on Monday it is doubling the maternity leave it grants  making it the third company in the U.S. technology industry in a week to give new parents more paid time off.",
        "date": "08102015",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Adobe joins tech industry push in increasing maternity  parental leave "
    },
    {
        "content": "NEW YORK  Aug 10 Software company Adobe Systems Inc. said on Monday it is doubling the maternity leave it grants  making it the third company in the U.S. technology industry in a week to give new parents more paid time off.",
        "date": "08102015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "UPDATE 1-Adobe joins tech industry push in increasing maternity  parental leave "
    },
    {
        "content": "NEW YORK  Aug 10 Software company Adobe Systems Inc. said on Monday it is doubling the maternity leave it grants  making it the third company in the U.S. technology industry in a week to give new parents more paid time off.",
        "date": "08102015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Adobe joins tech industry push in raising maternity  parental leave "
    },
    {
        "content": "Photoshop maker Adobe Systems Inc  reported a better-than-expected profit for the sixth straight quarter  helped by a 12 percent sequential jump in annualized recurring revenue in its digital media segment.",
        "date": "06162015",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Adobe profit beats analysts estimates; forecast disappoints "
    },
    {
        "content": "June 16 Photoshop maker Adobe Systems Inc  reported a better-than-expected profit for the sixth straight quarter  helped by a 12 percent sequential jump in annualized recurring revenue in its digital media segment.",
        "date": "06162015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "UPDATE 1-Adobe profit beats analysts estimates; forecast disappoints "
    },
    {
        "content": "June 16 Photoshop maker Adobe Systems Inc  reported an 8.8 percent rise in quarterly revenue as more customers subscribed to its Creative Cloud and Document Cloud software suites.",
        "date": "06162015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Adobe revenue rises 8.8 pct "
    },
    {
        "content": "June 19 Adobe Systems Inc is leveraging its popular Creative Cloud software suite for its new stock-image service  but will have to dig deeper to woo designers and take on established players such as Shutterstock Inc and Getty Images.",
        "date": "06192015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Volume  variety key for Adobe's stock-image service to click "
    },
    {
        "content": "Photoshop maker Adobe Systems Inc reported a lower-than-expected rise in subscriptions for its Creative Cloud software suite and forecast a second-quarter profit that missed the average analyst estimate.",
        "date": "03172015",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Adobe adds fewer-than-expected Creative Cloud subscribers  shares fall "
    },
    {
        "content": "March 17 Photoshop maker Adobe Systems Inc  reported a lower-than-expected rise in subscriptions for its Creative Cloud software suite and forecast a second-quarter profit that missed the average analyst estimate.",
        "date": "03172015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "UPDATE 2-Adobe adds fewer-than-expected Creative Cloud subscribers  shares fall "
    },
    {
        "content": "March 17 Photoshop maker Adobe Systems Inc  posted an 11 percent rise in quarterly revenue as it sold more subscriptions to its Creative Cloud suite.",
        "date": "03172015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Adobe Systems revenue rises 11 pct helped by subscriber additions "
    },
    {
        "content": "Photoshop maker Adobe Systems Inc  said it would buyback up to $2 billion of its shares through the end of fiscal 2017.",
        "date": "01142015",
        "name": "Adobe Systems Incorporated",
        "news_type": "topStory",
        "symbol": "ADBE",
        "title": "Adobe plans up to $2 billion share buyback "
    },
    {
        "content": "Jan 14 Photoshop maker Adobe Systems Inc  said it would buyback up to $2 billion of its shares through the end of fiscal 2017.",
        "date": "01142015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Adobe plans up to $2 bln share buyback "
    },
    {
        "content": "Jan 12 Walt Disney Co  Sony Corp  and DreamWorks Animation SKG Inc urged a federal judge to throw out a antitrust lawsuit accusing them of conspiring not to poach each other's animators in order to keep wages down.",
        "date": "01122015",
        "name": "Adobe Systems Incorporated",
        "news_type": "normal",
        "symbol": "ADBE",
        "title": "Disney  Sony  DreamWorks seek to throw out anti-poaching lawsuit "
    }
]