[
    {
        "content": "* Archer Daniels Midland Co - ‍declared a cash dividend of 32 cents per share on company's common stock​ Source text for Eikon: Further company coverage:",
        "date": "11022017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels Midland Co ‍declares cash dividend of 32 cents per share on common stock​ "
    },
    {
        "content": "Archer Daniels Midland Co's quarterly earnings tumbled 44 percent on severance and restructuring costs and weaker trading profits due to a global grain glut  and the agricultural trader offered a gloomy 2018 forecast  sending its shares dropping as much as 6.7 percent on Tuesday.",
        "date": "10312017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM says profit tumbles and issues gloomy view; shares drop "
    },
    {
        "content": "* Ag services unit's profit falls more than half (New throughout  adds comments from CEO  CFO  analyst  updates stock price)",
        "date": "10312017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 3-ADM says profit tumbles and issues gloomy view; shares drop "
    },
    {
        "content": "* ADM reports third quarter earnings of $0.34 per share  $0.45 per share on an adjusted basis",
        "date": "10312017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "BRIEF-ADM reports third quarter earnings of $0.34 per share  $0.45 per share on an adjusted basis "
    },
    {
        "content": "Oct 31 U.S. agricultural trader Archer Daniels Midland Co on Tuesday reported a nearly 44 percent fall in quarterly profit  hurt by weak margins from agricultural services and oilseeds processing businesses.",
        "date": "10312017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "Agri trader ADM's profit slumps 44 pct on weaker margins "
    },
    {
        "content": "HAMBURG  Oct 10 U.S. agribusiness group Archer Daniels Midland Co. said it will make further investments to produce more high-protein soymeal free of genetically-modified organisms (GMOs) at its  Straubing crushing plant in Germany.",
        "date": "10102017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM expanding output of GMO-free soymeal in Germany "
    },
    {
        "content": "LONDON  Oct 5 Anglo-Dutch consumer group Unilever has invited private equity bidders to submit tentative offers for its $8 billion margarine and spreads business by a deadline of Oct. 19  two sources close to the matter told Reuters.",
        "date": "10052017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "Unilever spreads whets private equity appetite as deadline nears - sources "
    },
    {
        "content": "    Oct 3 Britain's FTSE 100 index is seen opening 3 points higher on Tuesday  according to financial bookmakers.          * EU TELECOMS: European Union lawmakers have dashed large telecoms companies' hopes for lighter regulation as part of efforts to encourage investment in superfast internet networks.     * UNILEVER: U.S. agricultural trader Archer Daniels Midland Co on Monday denied a report that it was bidding on Unilever Plc's spreads business  which includes Flora and Stork mar",
        "date": "10032017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UK Stocks-Factors to watch on Oct 3 "
    },
    {
        "content": "CHICAGO  Oct 2 U.S. agricultural trader Archer Daniels Midland Co on Monday denied a report that it was bidding on Unilever Plc's spreads business  which includes Flora and Stork margarines.",
        "date": "10022017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM says it's not bidding for Unilever's spreads business "
    },
    {
        "content": "CHICAGO Syngenta AG moved closer to putting a troubled biotech corn seed launch behind it with a $1.5 billion settlement with farmers this week  but grain traders who filed two remaining lawsuits may be less ready to compromise  legal experts said.",
        "date": "09282017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM  Cargill still pursue Syngenta over China GMO corn rejections "
    },
    {
        "content": "CHICAGO  Sept 27 Syngenta AG moved closer to putting a troubled biotech corn seed launch behind it with a $1.5 billion settlement with farmers this week  but grain traders who filed two remaining lawsuits may be less ready to compromise  legal experts said.",
        "date": "09272017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM  Cargill still pursue Syngenta over China GMO corn rejections "
    },
    {
        "content": "Sept 26 Syngenta AG said on Tuesday it agreed to settle U.S. farmer lawsuits stemming from its decision to commercialize a genetically modified (GMO) strain of corn before China approved importing it  and a person familiar with the matter said the payment would be close to $1.5 billion.",
        "date": "09262017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "UPDATE 3-Syngenta agrees to settle U.S. farmer lawsuits over GMO corn "
    },
    {
        "content": "NEW YORK  Aug 29 (Thomson Reuters Foundation) - Food and beverage companies face the risk of forced labor in countries where they obtain sugarcane but most fall short in efforts to tackle the problem that threatens millions of workers  according to a study released on Tuesday.",
        "date": "08292017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 1-Cereal  drinks companies often overlook risk of forced labor in sugarcane - study "
    },
    {
        "content": "CHICAGO  Aug 29 South Texas ranchers are scrambling to relocate cattle from massive flooding spawned by Tropical Storm Harvey  with many hauling livestock up to the north of the state while others rush to move the animals to higher ground nearby.",
        "date": "08292017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "Harvey's floods scatter cattle in Texas  swamp cotton fields "
    },
    {
        "content": "* Archer Daniels Midland Co files for potential mixed shelf  size undisclosed - SEC filing Source text: (http://bit.ly/2u91ETP) Further company coverage:",
        "date": "08042017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels Midland files for potential mixed shelf  size undisclosed - SEC filing "
    },
    {
        "content": "* Sets cash dividend of $0.32 per share Source text for Eikon: Further company coverage:",
        "date": "08032017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels Midland sets cash dividend of $0.32 per share "
    },
    {
        "content": "CHICAGO A U.S. glut of fuel-grade ethanol has major producers  including Green Plains Inc  and industry pioneer Archer Daniels Midland Co   pursuing other markets and idling excess capacity in an effort to rebuild sagging margins.",
        "date": "08012017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "U.S. ethanol makers steer away from fuel  reach for booze "
    },
    {
        "content": "* Archer Daniels Midland - expect to record restructuring  impairment charges of about $80 million to $100 million pre-tax related to actions announced in Q3",
        "date": "08012017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels expects $80 mln -$100 mln restructuring charges "
    },
    {
        "content": "CHICAGO U.S. agricultural trader Archer Daniels Midland Co's second-quarter earnings topped expectations on Tuesday  sending shares higher  as strong sweetener and corn ethanol margins helped offset weak soybean processing results.",
        "date": "08012017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM second-quarter profit beats estimates on strong corn margins "
    },
    {
        "content": "CHICAGO  Aug 1 U.S. agricultural trader Archer Daniels Midland Co's second-quarter earnings topped expectations on Tuesday  sending shares higher  as strong sweetener and corn ethanol margins helped offset weak soybean processing results.",
        "date": "08012017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 3-ADM 2nd-qtr profit beats estimates on strong corn margins "
    },
    {
        "content": "* Adm reports second quarter earnings of $0.48 per share  $0.57 per share on an adjusted basis",
        "date": "08012017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "BRIEF-ADM reports Q2 EPS $0.48 "
    },
    {
        "content": "Aug 1 U.S. agricultural trader Archer Daniels Midland Co on Tuesday reported a 2.8 percent decline in second-quarter earnings  hurt by weak performance in its oilseeds processing business.",
        "date": "08012017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM 2nd-qtr profit dips 2.8 pct "
    },
    {
        "content": "* New facility will have a daily milling capacity of 30 000 cwts  and ability to grind soft and hard wheat varieties",
        "date": "06022017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-ADM to end production at wheat mill in Chicago when new mill in Illinois is operational "
    },
    {
        "content": "WASHINGTON The chief executive officers of two major American companies - retailer Target Corp and agribusiness Archer Daniels Midland Co - offered opposing views in a hearing before U.S. lawmakers on Tuesday on a proposed border adjustment tax.",
        "date": "05232017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "CEOs of Target  ADM offer differing views on U.S. border tax at hearing "
    },
    {
        "content": "WASHINGTON  May 23 The chief executive officers of two major American companies - retailer Target Corp and agribusiness Archer Daniels Midland Co - offered opposing views in a hearing before U.S. lawmakers on Tuesday on a proposed border adjustment tax.",
        "date": "05232017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 3-CEOs of Target  ADM offer differing views on U.S. border tax at hearing "
    },
    {
        "content": "WASHINGTON  May 23 The chief executive officers of two major American companies - retailer Target Corp and agribusiness Archer Daniels Midland Co - will offer countering views in a hearing before U.S. lawmakers on Tuesday on a proposed border adjustment tax.",
        "date": "05232017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "CEOs of Target  ADM to square off on U.S. border tax at hearing "
    },
    {
        "content": "SANTOS  Brazil  May 19 The Brazilian unit of Archer Daniels Midland Co on Friday said it had completed a 33 percent expansion in its Santos port terminal's export capacity  to 8 million tonnes of grains per year.",
        "date": "05192017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "UPDATE 1-ADM Brazil unit completes $85 mln Santos port investment "
    },
    {
        "content": "SANTOS  Brazil  May 19 The Brazilian unit of Archer Daniels Midland Co on Friday said it had completed a 33 percent expansion in its Santos port terminal's export capacity to 8 million tonnes of grains per year.",
        "date": "05192017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM Brazil unit completes $85 mln Santos port investment "
    },
    {
        "content": "SINGAPORE  May 11 Singapore's Wilmar International Ltd  the world's largest palm oil processor  posted a 51 percent rise in its first-quarter profit  helped by its tropical oils as well as oilseeds and grains businesses.",
        "date": "05112017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "Singapore's Wilmar reports 51 pct rise in Q1 profit "
    },
    {
        "content": "CHICAGO Archer Daniels Midland Co   one of the world's largest agricultural merchants  said on Monday it agreed to buy a controlling stake in an Israeli grain trader  as it seeks to expand markets to boost profits that have been hampered by a global oversupply.",
        "date": "05082017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM buys Israeli grains trader  eying new customers "
    },
    {
        "content": "CHICAGO  May 8 Archer Daniels Midland Co   one of the world's largest agricultural merchants  said on Monday it agreed to buy a controlling stake in an Israeli grain trader  as it seeks to expand markets to boost profits that have been hampered by a global oversupply.",
        "date": "05082017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM buys Israeli grains trader  eyeing new customers "
    },
    {
        "content": "CHICAGO U.S. agricultural trader Archer Daniels Midland Co said on Tuesday that massive global grain stocks are making it difficult to turn a profit trading grain internationally  sending its shares plummeting by their most in eight years.",
        "date": "05032017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM shares dive 9 percent after warning about global grain glut "
    },
    {
        "content": "LONDON/HAMBURG U.S. agribusiness Archer Daniels Midland Co  said on Thursday that its operations would expand overall in Europe this year  even as the company restructures parts of its global trading operation.",
        "date": "05052017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "Agribusiness ADM to expand in Europe amid global shake up: company "
    },
    {
        "content": "* Adm expands destination marketing footprint with acquisition of majority stake in israeli merchandiser",
        "date": "05082017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "BRIEF-ADM says reached an agreement to buy controlling interest in Israeli co Industries Centers "
    },
    {
        "content": "CHICAGO  May 2 U.S. agricultural trader Archer Daniels Midland Co said on Tuesday that massive global grain stocks are making it difficult to turn a profit trading grain internationally  sending its shares plummeting by their most in eight years.",
        "date": "05032017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 5-ADM shares dive 9 pct after warning about global grain glut "
    },
    {
        "content": "WASHINGTON/CHICAGO  May 5 The U.S. International Trade Commission voted on Friday to continue a U.S. Commerce Department investigation into alleged dumping and unfair subsidies of biodiesel fuels from Argentina and Indonesia  moving a step closer to punitive U.S. duties.",
        "date": "05052017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 3-U.S. trade panel affirms Argentina  Indonesia biodiesel probe "
    },
    {
        "content": "LONDON/HAMBURG  May 4 U.S. agribusiness Archer Daniels Midland Co said on Thursday that its operations would expand overall in Europe this year  even as the company restructures parts of its global trading operation.",
        "date": "05042017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "UPDATE 1-Agribusiness ADM to expand in Europe amid global shake up -company "
    },
    {
        "content": "* CEO Juan Luciano says expects U.S. ethanol exports to remain strong in Q2  led by good Brazilian demand",
        "date": "05022017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-ADM sees good U.S. ethanol exports continuing  led by Brazil "
    },
    {
        "content": "* ADM  Bunge shares bounce on Thursday after two-day plunge (Adds Bunge CEO comment on industry consolidation paragraph 13  updates stock prices  paragraph 5)",
        "date": "05042017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 1-Huge crops  record storage signal more woes for grain merchants "
    },
    {
        "content": "* Ten incumbent directors were also re-elected  at annual meeting Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "05042017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels Midland sets cash dividend of $0.32 per share "
    },
    {
        "content": "* Adm reports first quarter earnings of $0.59 per share  $0.60 per share on an adjusted basis",
        "date": "05022017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels Midland Q1 adj EPS $0.60 "
    },
    {
        "content": "May 2 U.S. agricultural trader Archer Daniels Midland Co on Tuesday reported a 47 percent jump in first-quarter profit  as higher U.S. exports of corn and soybeans boosted volumes and margins.",
        "date": "05022017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "Agricultural trader ADM's 1st-qtr profit jumps 47 pct "
    },
    {
        "content": "LONDON/CHICAGO  April 28 Archer Daniels Midland Co has hired a chief risk officer from rival CHS Inc   the U.S. agribusiness confirmed on Friday  a further sign of an internal shake-up as a global grain glut pressures its profits.",
        "date": "04282017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM hires chief risk officer from CHS in latest corporate shake-up "
    },
    {
        "content": "BUENOS AIRES/LONDON Archer Daniels Midland Co  is restructuring its operations in Argentina in a move that will include job losses as part of a wider shake-up at the U.S. agribusiness group  three sources familiar with the plans said this week.",
        "date": "04062017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "Exclusive: ADM revamps Argentine grains trading in global shake-up - sources "
    },
    {
        "content": "LONDON  April 5 Archer Daniels Midland Co (ADM) plans to close its South African trading desk  the company said on Wednesday  in a further shake up as the Chicago-based agribusiness grapples with volatile global grain markets.",
        "date": "04052017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM to close South Africa trading desk in further business shake up "
    },
    {
        "content": "* Has been granted exclusivity in relation to proposed purchase of Chamtor  French producer of wheat-based sweeteners  starches  Source text for Eikon: Further company coverage:",
        "date": "03272017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-ADM adds to European sweetener  starch footprint with proposed acquisition of Chamtor "
    },
    {
        "content": "* ADM board of directors nominates Suzan F. Harrison to board",
        "date": "03242017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-Suzan Harrison nominated to Archer Daniels Midland board "
    },
    {
        "content": "* Archer daniels midland co - ceo juan r. Luciano 2016 total compensation $14 million versus. $9.4 million in 2015 - sec filing",
        "date": "03242017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels CEO Juan Luciano 2016 total compensation $14 mln vs. $9.4 mln in 2015 "
    },
    {
        "content": "CHICAGO  March 13 Archer Daniels Midland Co   one of the world's largest agricultural traders  will widen its operations in China to produce fish feed  the company said on Monday  amid increasing global demand for fish from health-conscious consumers.",
        "date": "03132017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM to expand in China; eyes demand for animal and fish feed "
    },
    {
        "content": "* To expand animal nutrition capabilities with new facilities in Xiangtan and Nanjing  China",
        "date": "03132017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels says to expand animal nutrition capabilities with new facilities in China "
    },
    {
        "content": "CHICAGO  March 1 Archer Daniels Midland Co  shut down a grain elevator in Ottawa  Illinois  after it sustained moderate damage in a storm on Tuesday  a company spokeswoman said on Wednesday.",
        "date": "03012017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM grain elevator shut down because of Illinois storm damage "
    },
    {
        "content": "BEIJING  Feb 28 Three senior grain traders at Archer Daniels Midland Co have left the company's China team since the start of the year  people familiar with the matter said  the latest in a series of high-profile exits as the global agricultural merchant struggles with a supply glut and weak prices.",
        "date": "02282017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "Three senior ADM grain traders leave China team - sources "
    },
    {
        "content": "CHICAGO  Feb 24 ADM Investor Services (ADMIS)  a futures commission merchant owned by global grain trader Archer Daniels Midland Co  will begin executing more of its orders electronically beginning on March 1  the company said on Friday.",
        "date": "02242017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM brokerage arm shifts more trades onto computer screens "
    },
    {
        "content": "* Archer daniels midland co - on february 9  2017  board approved an amendment to company's bylaws - sec filing",
        "date": "02132017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels on Feb. 9 board approved an amendment to company's bylaws - SEC filing "
    },
    {
        "content": "CHICAGO U.S. agricultural trader Archer Daniels Midland Co  said on Tuesday it expects to benefit from several major policy changes proposed by President Donald Trump and believes it can adjust to any potential disruptions to trade with key partners such as Mexico.",
        "date": "02072017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM expects lift from Trump reforms  downplays trade concern "
    },
    {
        "content": "CHICAGO  Feb 7 U.S. agricultural trader Archer Daniels Midland Co said  on Tuesday it expects to benefit from several major policy changes proposed by President Donald Trump and believes it can adjust to any potential disruptions to trade with key partners such as Mexico.",
        "date": "02072017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 2-ADM expects lift from Trump reforms  downplays trade concern "
    },
    {
        "content": "* Adm reports fourth quarter earnings of $0.73 per share  $0.75 per share on an adjusted basis",
        "date": "02072017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "BRIEF-ADM Q4 adjusted EPS $0.75 excluding items "
    },
    {
        "content": "* Sets cash dividend of $0.32 per share  Source text for Eikon:  Further company coverage:",
        "date": "02072017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels Midland sets cash dividend of $0.32/share "
    },
    {
        "content": "Feb 7 U.S. agricultural trader Archer Daniels Midland Co reported a 41 percent drop in quarterly profit from a year earlier  when the company recorded one-time gains of nearly $400 million.",
        "date": "02072017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "Archer Daniels Midland's profit falls 41 pct "
    },
    {
        "content": "CHICAGO  Jan 30 U.S. agricultural commodities trader Archer Daniels Midland Co has agreed to sell its Crop Risk Services (CRS) insurance business for $127.5 million to Validus Holdings Ltd  the companies announced on Monday.",
        "date": "01302017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM to sell crop insurance business to Validus Holdings "
    },
    {
        "content": "* Validus Holdings announces agreement with Archer Daniels Midland to acquire ADM crop risk services business",
        "date": "01302017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "BRIEF-Validus Holdings says deal to acquire ADM's crop risk services business "
    },
    {
        "content": "* Archer Daniels Midland Co - expects to record a book gain upon deal closing",
        "date": "01302017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "BRIEF-ADM says agreement for sale of Crop Risk Services business to Validus "
    },
    {
        "content": "* State Farm Mutual Automobile Insurance Co reports 5.94 percent passive stake in Archer Daniels Midland Co as of december 31 - sec filing  Source text : http://bit.ly/2jUvj1a Further company coverage:",
        "date": "01232017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-State Farm Mutual Automobile Insurance Co reports 5.94 pct passive stake in Archer Daniels Midland "
    },
    {
        "content": "SINGAPORE The head of corn trading at Archer Daniels Midland Co  Victor Petzold  has left to join Swiss trader Ameropa AG  two sources with direct knowledge of the matter told Reuters on Wednesday.",
        "date": "01182017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "Leading ADM corn trader leaves to join Ameropa: sources "
    },
    {
        "content": "SINGAPORE  Jan 18 The head of corn trading at Archer Daniels Midland Co  Victor Petzold  has left to join Swiss trader Ameropa AG  two sources with direct knowledge of the matter told Reuters on Wednesday.",
        "date": "01182017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "Leading ADM corn trader leaves to join Ameropa -sources "
    },
    {
        "content": "SINGAPORE/CHICAGO Archer Daniels Midland Co  has become the latest global agricultural trader to undergo senior management changes as the sector grapples with a grain glut that is depressing prices.",
        "date": "01132017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM shakes up global commodities trading business "
    },
    {
        "content": "SINGAPORE/CHICAGO  Jan 13 Archer Daniels Midland Co has become the latest global agricultural trader to undergo senior management changes as the sector grapples with a grain glut that is depressing prices.",
        "date": "01132017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 1-ADM shakes up global commodities trading business "
    },
    {
        "content": "CHICAGO  Jan 6 U.S. soybean export sales slid to their lowest in the current  marketing year last week  the U.S. Department of Agriculture said on Friday  fueling concerns among analysts and traders that formerly sizzling demand is cooling down.",
        "date": "01062017",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 1-Weak U.S. soy export sales fuel fears of demand slowdown "
    },
    {
        "content": "CHICAGO U.S. agricultural commodities trader Archer Daniels Midland Co  has sold its 19.9 percent stake in GrainCorp Ltd  to underwriters UBS just three years after a failed bid to wholly acquire the Australian grain handler  ADM said on Thursday.",
        "date": "12012016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM sells stake in Australia's GrainCorp "
    },
    {
        "content": "* Sets cash dividend of $0.30 per share  Source text for Eikon:  Further company coverage:",
        "date": "11022016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels Midland sets cash dividend of $0.30per share "
    },
    {
        "content": "CHICAGO  Nov 1 U.S. agricultural products trader Archer Daniels Midland Co on Tuesday reported a far better-than-expected third-quarter profit as higher U.S. exports of corn and soybeans boosted volumes and margins  sending shares up sharply.",
        "date": "11012016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "UPDATE 3-ADM profit jumps on higher U.S. grain exports; shares rise "
    },
    {
        "content": "CHICAGO U.S. agricultural products trader Archer Daniels Midland Co  on Tuesday reported a far better-than-expected third-quarter profit on Tuesday as higher U.S. exports of corn and soybeans boosted volumes and margins.",
        "date": "11012016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM third-quarter profit jumps on higher US grain exports; stock rises "
    },
    {
        "content": "* Qtrly revenues $15 832 million versus $16 565 million last year",
        "date": "11012016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels Midland posts Q3 adj EPS $0.59  rev $15.83 bln "
    },
    {
        "content": "Nov 1 U.S. agricultural trader Archer Daniels Midland Co reported a 35.3 percent jump in quarterly profit on Tuesday  largely helped by higher U.S. exports of corn and soybeans.",
        "date": "11012016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "Archer Daniels Midland's quarterly profit jumps 35.3 pct "
    },
    {
        "content": "* Archer daniels midland co says  has purchased assets of caterina foods  Source text for Eikon:  Further company coverage:",
        "date": "09302016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels Midland purchases assets of Caterina Foods "
    },
    {
        "content": "* Archer Daniels Midland Company  and Wilmar International announced that they received all required competition approvals for their agreement",
        "date": "09232016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-Wilmar International Ltd and ADM receive approvals for Olenex joint venture "
    },
    {
        "content": "* Archer daniels midland company announces pricing of $1 billion of 2.50% notes due 2026",
        "date": "08082016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels Midland announces pricing of $1 bln of 2.50 pct notes due 2026 "
    },
    {
        "content": "* Sets cash dividend of $0.30 per share  Source text for Eikon:  Further company coverage:",
        "date": "08032016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels Midland sets cash dividend of $0.30 per share "
    },
    {
        "content": "* Says expects capital expenditures of $1.0 billion during 2016 - SEC Filing  Source - http://bit.ly/2asEVrh Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "08022016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels expects capital expenditures of $1 bln during 2016 "
    },
    {
        "content": "CHICAGO U.S. grain trader Archer Daniels Midland Co  is pulling back in ethanol and exploring sales of its corn dry mills that produce the biofuel  the company said Thursday after reporting a lower second-quarter profit due partly to weak ethanol results.",
        "date": "08022016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM eyes ethanol asset sales as weak margins hit second-quarter profit "
    },
    {
        "content": "CHICAGO  Aug 2 U.S. grain trader Archer Daniels Midland Co is pulling back in ethanol and exploring sales of its corn dry mills that produce the biofuel  the company said Thursday after reporting a lower second-quarter profit due partly to weak ethanol results.",
        "date": "08022016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 3-ADM eyes ethanol asset sales as weak margins hit Q2 profit "
    },
    {
        "content": "* ADM reports second quarter earnings of $0.48 per share  $0.41 per share on an adjusted basis",
        "date": "08022016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "BRIEF-ADM Q2 earnings per share $0.48 "
    },
    {
        "content": "Aug 2 U.S. agricultural trader Archer Daniels Midland Co reported a 26 percent fall in quarterly profit as merchandising and handling earnings declined in its agriculture services unit.",
        "date": "08022016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM reports 26 percent fall in quarterly profit "
    },
    {
        "content": "SYDNEY Shares in GrainCorp fell as much 7 percent on Wednesday after its largest shareholder  Archer Daniels Midland Co  failed to find a buyer to sell its 20 percent stake in Australia's largest listed bulk grain hander.",
        "date": "07272016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "GrainCorp shares dive after ADM cancels stake sale "
    },
    {
        "content": "CHICAGO  July 20 Two horse owners sued Archer Daniels Midland Co this week  accusing the U.S. grain processor and trader of distributing contaminated feed that sickened or killed several of their horses  according to court documents seen by Reuters.",
        "date": "07202016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "U.S. horse owners sue ADM over contaminated equine feed "
    },
    {
        "content": "LONDON U.S. agribusiness Archer Daniels Midland Co has shut its small physical sugar trading operation in London due to tight margins  trade sources said.",
        "date": "07192016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM shuts cash sugar trading operation in London: sources "
    },
    {
        "content": "LONDON  July 19 U.S. agribusiness Archer Daniels Midland Co has shut its small physical sugar trading operation in London due to tight margins  trade sources said.",
        "date": "07192016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM shuts cash sugar trading operation in London- sources "
    },
    {
        "content": "CHICAGO  July 20 Two horse owners sued Archer Daniels Midland Co this week  accusing the U.S. grain processor and trader of distributing contaminated feed that sickened or killed several of their horses  according to court documents seen by Reuters.",
        "date": "07202016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 1-U.S. horse owners sue ADM over contaminated equine feed "
    },
    {
        "content": "SINGAPORE  June 15 Commodities trader Archer Daniels Midland Co (ADM) is raising its stake in Singapore's Wilmar International Ltd to about 22 percent for about S$428.8 million ($316.6 million)  according to a stock exchange filing.",
        "date": "06152016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "Commodities trader ADM to raise stake in Singapore's Wilmar "
    },
    {
        "content": "NEW YORK  June 6 Archer Daniels Midland Co  will be selling stevia and monk fruit sweeteners  alternatives to sugar  in a new partnership  the company said on Monday  as the agribusiness continues its push into higher-margin products.",
        "date": "06062016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM to sell stevia and monk fruit sweeteners in new partnership "
    },
    {
        "content": "KANSAS CITY  Mo.  June 9 Archer Daniels Midland Co and other supporters of biofuels on Thursday said U.S. regulators grossly underestimated the amount of higher-ethanol fuel blends at pumps when requirements for next year's use of renewables were proposed.",
        "date": "06092016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM  biofuel supporters say EPA underestimates use of higher-ethanol fuels "
    },
    {
        "content": "PARIS  June 1 Archer Daniels Midland Co  appointed Pierre Duprat as president of its business in Europe  Middle East and Africa and India  the U.S. agribusiness group said in a statement on Wednesday.",
        "date": "06012016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM appoints Pierre Duprat as president of EMEA "
    },
    {
        "content": "* Had previously owned a 40 percent equity stake in Amazon  Flavors",
        "date": "05162016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-ADM acquires full stake in Amazon Flavors "
    },
    {
        "content": "Across the U.S. Farm Belt  top grain handlers have banned genetically modified crops that are not approved in all major overseas markets  shaking up a decades-old system that used the world's biggest exporting country as a launchpad for new seeds from companies like Monsanto Co.",
        "date": "05062016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "U.S. traders reject GMO crops that lack global approval "
    },
    {
        "content": "* Sets cash dividend of $0.30 per share  Source text for Eikon:  Further company coverage:",
        "date": "05052016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels Midland sets cash dividend of $0.30/shr "
    },
    {
        "content": "May 3 Sharp moves in crop prices caught Archer Daniels Midland Co wrong footed in the first quarter  leaving its global trading team with a loss and contributing to a 53 percent decline in profit  its chief executive officer said on Tuesday.",
        "date": "05032016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "UPDATE 2-ADM trading desk suffers quarterly loss  earnings fall "
    },
    {
        "content": "* Adm reports first quarter adjusted earnings of $0.42 per share",
        "date": "05032016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "BRIEF-ADM Q1 earnings per share $0.39 "
    },
    {
        "content": "May 3 U.S. agribusiness Archer Daniels Midland Co reported a 53.3 percent fall in quarterly profit  hurt by a commodities rout and lower U.S. grain exports.",
        "date": "05032016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM profit plunges on reduced U.S. grain exports "
    },
    {
        "content": "SAO PAULO  April 5 U.S. trader Archer Daniels Midland said on Tuesday it has begun work on expanding its bulk grains terminal and silo space at Brazil's port of Santos.",
        "date": "04052016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM starts expansion of Santos grain terminal in Brazil "
    },
    {
        "content": "CHICAGO  March 31 Archer Daniels Midland Co  has struck a deal to sell a sugarcane ethanol plant in Brazil after searching for a buyer for four years  the agribusiness company said on Thursday.",
        "date": "04062016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "CORRECTED-(OFFICIAL)-Archer Daniels Midland in deal to sell Brazil ethanol plant "
    },
    {
        "content": "CHICAGO Archer Daniels Midland Co  has struck a deal to sell a sugarcane ethanol plant in Brazil after searching for a buyer for four years  the agribusiness company said on Thursday.",
        "date": "03312016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "Archer Daniels Midland in deal to sell Brazil sugar ethanol operations "
    },
    {
        "content": "* CEO J. R. Luciano total compensation of $9.4 million in 2015 versus $9.2 million in 2014",
        "date": "03282016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-Archer Daniels Midland CEO J. R. Luciano 2015 total compensation was $9.4 mln "
    },
    {
        "content": "CHICAGO Archer Daniels Midland Co has filed a lawsuit against Canadian Pacific over service disruptions in 2013 and 2014 at crop-processing plants in North Dakota and Minnesota  alleging they stemmed partly from cost-cutting and the Canadian railroad's pursuit of merger partners.",
        "date": "03232016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM sues Canadian Pacific over 2013-14 rail service disruptions "
    },
    {
        "content": "CHICAGO  March 23 Archer Daniels Midland Co  has filed a lawsuit against Canadian Pacific  over service disruptions in 2013 and 2014 at crop-processing plants in North Dakota and Minnesota  alleging they stemmed partly from cost-cutting and the Canadian railroad's pursuit of merger partners.",
        "date": "03232016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 2-ADM sues Canadian Pacific over 2013-14 rail service disruptions "
    },
    {
        "content": "CHICAGO Archer Daniels Midland Co has filed a lawsuit against Canadian Pacific over service disruptions in 2013 and 2014 at crop-processing plants in North Dakota and Minnesota  alleging they stemmed in part from cost-cutting and the Canadian railroad's pursuit of merger partners.",
        "date": "03232016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM sues Canadian Pacific over service disruptions "
    },
    {
        "content": "PARIS  March 11 French cooperative Axereal has appointed Nicolas Poyade  previously head of Archer Daniels Midland Co's cocoa business in Ghana  as its new director of grain trading  Axereal said on Friday.",
        "date": "03112016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "MOVES-France's Axereal picks ADM cocoa manager to head grain trading "
    },
    {
        "content": "CHICAGO  Feb 26 U.S. grain merchant Gavilon on Friday named a former Archer Daniels Midland Co  executive as its new chief executive officer  following the departures of senior leaders.",
        "date": "02262016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "Gavilon names former Archer Daniels Midland executive as new CEO "
    },
    {
        "content": "CHICAGO  Feb 19 U.S. agribusiness company Archer Daniels Midland Co does not expect to restart its sugarcane ethanol plant in Brazil after a seasonal shutdown this year  the company said in a U.S. regulatory filing on Friday  as a broad review of its operations continues.",
        "date": "02192016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM expects to idle Brazil sugar ethanol plant this year "
    },
    {
        "content": "CHICAGO Archer Daniels Midland Co   the U.S. agribusiness group  said it would buy a corn wet mill in Morocco from Tate & Lyle  in the latest effort to boost its footprint in the sweetener and starch market after expanding in Eastern Europe last year.",
        "date": "02082016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM to buy Moroccan corn mill to boost sweetener footprint "
    },
    {
        "content": "CHICAGO  Feb 8 Archer Daniels Midland Co   the U.S. agribusiness group  said it would buy a corn wet mill in Morocco from Tate & Lyle in the latest effort to boost its footprint in the sweetener and starch market after expanding in Eastern Europe last year.",
        "date": "02082016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 1-ADM to buy Moroccan corn mill to boost sweetener footprint "
    },
    {
        "content": "* Announces it has signed an agreement to sell its small  wholly owned corn wet mill in Casablanca  Morocco to Archer Daniels Midland company\u007f\u007f",
        "date": "02082016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "BRIEF-Tate & Lyle sells one Morocco corn mill to Archer Daniels "
    },
    {
        "content": "CHICAGO  Feb 4 Cargill Inc has slowed the crush at its soybean processor in Indiana and instead bought soymeal from rival Archer Daniels Midland Co to ship railcars to feed markets in the southeastern United States  cash traders with knowledge of the deals said on Thursday.",
        "date": "02052016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "RPT-Cargill buys soymeal from ADM  slows Indiana crush -traders "
    },
    {
        "content": "NEW YORK/CHICAGO When Archer Daniels Midland opened two of the country's largest ethanol plants in Nebraska and Iowa six years ago  the biofuels market was on the cusp of a boom with prices and profits on the rise.",
        "date": "02032016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "Ethanol pioneer ADM's struggle reflects deepening industry woes "
    },
    {
        "content": "CHICAGO  Feb 4 Cargill Inc has slowed the crush at its soybean processor in Indiana and instead bought soymeal from rival Archer Daniels Midland Co to ship railcars to feed markets in the southeastern United States  cash traders with knowledge of the deals said on Thursday.",
        "date": "02042016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "Cargill buys soymeal from ADM  slows Indiana crush -traders "
    },
    {
        "content": "CHICAGO U.S. agribusiness Archer Daniels Midland Co  reported a drop in quarterly profit on Tuesday on poor ethanol margins and depressed U.S. grain exports and cautioned that tough market conditions could persist in the year ahead  sending shares tumbling 8 percent.",
        "date": "02022016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM profit down on weak ethanol  exports; shares plunge "
    },
    {
        "content": "CHICAGO  Feb 2 U.S. agribusiness Archer Daniels Midland Co reported a drop in quarterly profit on Tuesday on poor ethanol margins and depressed U.S. grain exports and cautioned that tough market conditions could persist in the year ahead  sending shares tumbling 8 percent.",
        "date": "02022016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 2-ADM profit down on weak ethanol  exports; shares plunge "
    },
    {
        "content": "Feb 2 U.S. agricultural processor Archer Daniels Midland Co is studying \"strategic options\" for its U.S. corn ethanol dry-mills as part of ongoing cost-cutting measures  CEO Juan Luciano said on Tuesday.",
        "date": "02022016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM says exploring \"strategic options\" for dry-mill ethanol plants "
    },
    {
        "content": "CHICAGO  Feb 2 U.S. agribusiness Archer Daniels Midland Co on Tuesday reported a lower adjusted quarterly profit on lower U.S. exports and weak ethanol margins.",
        "date": "02022016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM profit misses analyst view on low exports  weak ethanol "
    },
    {
        "content": "CHICAGO With agricultural lenders fearing a tidal wave of farm bankruptcies as soon as this spring  lawyers in the Midwest say they want U.S. Senator Chuck Grassley of Iowa to raise the debt limit for so-called \"family farmer\" bankruptcies.",
        "date": "01162016",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "Fearing wave of bankruptcies  U.S. corn belt wants new debt cap "
    },
    {
        "content": "Nov 20 Major sugar companies and corn refiners  including Archer Daniels Midland Co  have settled high stakes litigation that probed the health claims of each industry amid falling demand for sweeteners.",
        "date": "11202015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "UPDATE 2-Sugar vs corn syrup lawsuit settles mid-trial "
    },
    {
        "content": "CHICAGO Swiss seed company Syngenta AG has sued top U.S. grain exporters Cargill Inc [CARG.UL] and Archer Daniels Midland Co over losses that U.S. farmers said they suffered from rejections of boatloads of genetically modified corn by China.",
        "date": "11202015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "Syngenta sues Cargill  ADM in GMO corn fight "
    },
    {
        "content": "CHICAGO  Nov 20 Swiss seed company Syngenta AG  has sued top U.S. grain exporters Cargill Inc  and Archer Daniels Midland Co over losses that U.S. farmers said they suffered from rejections of boatloads of genetically modified corn by China.",
        "date": "11202015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "REFILE-Syngenta sues Cargill  ADM in GMO corn fight "
    },
    {
        "content": "LOS ANGELES  Nov 9 An association of corn refiners spent about $135 million on a campaign to defend high fructose corn syrup from perceived attacks by the U.S. sugar industry  an executive from Archer Daniels Midland Co  testified in court on Monday.",
        "date": "11102015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "Corn group spent about $135 mln on anti-sugar campaign -exec "
    },
    {
        "content": "CHICAGO  Nov 4 Archer Daniels Midland Co  spent about $20 million last month to increase its stake in Wilmar International Ltd  the world's largest palm oil processor  to 18.5 percent  new regulatory filings show.",
        "date": "11042015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "Archer Daniels Midland spent $20 mln to raise Wilmar stake -filing "
    },
    {
        "content": "Nov 4 Big sugar processors are set to take on major corn refiners including Archer Daniels Midland Co  and Cargill Inc before a U.S. jury on Wednesday in a billion-dollar lawsuit that could shape how consumers view two bitter foes in the sweetener market.",
        "date": "11042015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "Sugar  corn syrup face off over 'natural' claims in U.S. lawsuit "
    },
    {
        "content": "CHICAGO Shares of Archer Daniels Midland Co  tumbled more than 8 percent on Tuesday after the agribusiness group reported a lower third-quarter profit due to weak ethanol margins and slumping North American grain exports.",
        "date": "11032015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM shares fall more than 8 percent after earnings miss "
    },
    {
        "content": "CHICAGO  Nov 3 Shares of Archer Daniels Midland Co tumbled more than 8 percent on Tuesday after the agribusiness group reported a lower third-quarter profit due to weak ethanol margins and slumping North American grain exports.",
        "date": "11032015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 2-ADM shares fall more than 8 pct after earnings miss "
    },
    {
        "content": "NEW YORK  Oct 29 Cargill Inc. said on Thursday it will close a cocoa and chocolate plant in Lititz  Pennsylvania  in January as part of a restructuring of its North American cocoa and chocolate operations.",
        "date": "10292015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "Cargill to close chocolate plant in Pennsylvania "
    },
    {
        "content": "CHICAGO  Nov 3 U.S. agribusiness Archer Daniels Midland on Tuesday reported a lower quarterly profit on weak ethanol margins and as a strong dollar and ample South American crop supplies limited grain exports from the United States.",
        "date": "11032015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM profit drops on weak ethanol margins  limited U.S. exports "
    },
    {
        "content": "LONDON Olam International  has completed the acquisition of the global cocoa business of Archer Daniels Midland Co.  in a deal valued at $1.2 billion  the companies said on Friday.",
        "date": "10162015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "Olam completes acquisition of ADM's cocoa business "
    },
    {
        "content": "CHICAGO  Oct 7 A 20 percent quarterly profit jump for global grains trader Cargill Inc suggests recent disappointing quarterly earnings from rival agribusinesses Archer Daniels Midland Co and Bunge Ltd  may be more of a blip than long- term concern  analysts said.",
        "date": "10082015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "All eyes on ADM and Bunge after Cargill profit jumps 20 pct "
    },
    {
        "content": "BRUSSELS  Aug 26 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08262015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "EU mergers and takeovers (Aug 26) "
    },
    {
        "content": "LONDON  Aug 13 London's High Court has issued an arrest order against the owner and a senior officer of a Nicaraguan grains business for failing to pay millions of dollars owed to commodities house Archer Daniels Midland  for rice imports  ADM and court papers said.",
        "date": "08132015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "UK court orders arrest of Nicaraguans for non-payment of ADM rice "
    },
    {
        "content": "NEW YORK  Aug 7 Corn syrup manufacturers Archer Daniels Midland Co and Cargill Inc have kicked off annual negotiations with sweetener buyers by raising prices by some 15 percent  as feedstock supplies fall from record levels.",
        "date": "08072015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "Cargill  ADM kick off corn syrup price talks with increases "
    },
    {
        "content": "CHICAGO Olam International Ltd's  $1.3 billion deal to acquire Archer Daniels Midland Co's  global cocoa business has been delayed for a second time  according to a U.S. regulatory filing.",
        "date": "08062015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "Olam's $1.3 billion deal for ADM's cocoa business hits delays "
    },
    {
        "content": "CHICAGO U.S. agribusiness group Archer Daniels Midland Co  reported a lower-than-expected quarterly profit on Tuesday following declines in ethanol margins and exports from North America.",
        "date": "08042015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM second-quarter profit miss estimates on weaker ethanol margins "
    },
    {
        "content": "CHICAGO  Aug 6 Olam International Ltd's  $1.3 billion deal to acquire Archer Daniels Midland Co's global cocoa business has been delayed for a second time  according to a U.S. regulatory filing.",
        "date": "08062015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "Olam's $1.3 bln deal for ADM's cocoa business hits delays "
    },
    {
        "content": "CHICAGO  Aug 4 U.S. agribusiness group Archer Daniels Midland Co reported a lower-than-expected quarterly profit on Tuesday following declines in ethanol margins and exports from North America.",
        "date": "08042015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 2-ADM 2nd-qtr profit miss estimates on weaker ethanol margins "
    },
    {
        "content": "SAO PAULO  Aug 3 Archer Daniels Midland Co  expects average profit margins in Brazil's 2015/16 soy production to fall 77 percent from the previous season after two years of falling soybean prices  the company's South America president said on Monday.",
        "date": "08032015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "UPDATE 2-ADM says Brazil soy profit margin to fall sharply in 2015/16 "
    },
    {
        "content": "CHICAGO Archer Daniels Midland Co's  plans to acquire a privately held sweetener manufacturer in central China have fallen through  the U.S. agribusiness company's chief executive officer said on Tuesday.",
        "date": "08042015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM deal for sweetener manufacturer in China falls through: CEO "
    },
    {
        "content": "SAO PAULO  Aug 3 Archer Daniels Midland Co  expects profit margin in Brazil's soy production to fall to 122.20 reais ($35.42) per hectare in the upcoming 2015/16 season from 539.03 reais in 2014/15  the company's South America President Valmor Schaffer said at an event in Sao Paulo on Monday.",
        "date": "08032015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM says expects soy profit margin to fall in Brazil "
    },
    {
        "content": "CHICAGO  Aug 4 Archer Daniels Midland Co's  plans to acquire a privately held sweetener manufacturer in central China have fallen through  the U.S. agribusiness company's chief executive officer said on Tuesday.",
        "date": "08042015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM deal for sweetener manufacturer in China falls through -CEO "
    },
    {
        "content": "CHICAGO  Aug 4 U.S. agribusiness Archer Daniels Midland Co on Tuesday reported a lower-than-expected quarterly profit due to reduced exports of crops from North America and weaker margins in ethanol production.",
        "date": "08042015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM earnings miss analysts' estimates on weaker ethanol margins "
    },
    {
        "content": "BRUSSELS  July 20 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "07202015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "EU mergers and takeovers (July 20) "
    },
    {
        "content": "BRUSSELS  July 17 The European Commission said on Friday that it had approved Cargill's $440 million acquisition of rival Archer Daniels Midland Co's global chocolate business  subject to conditions.",
        "date": "07172015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "EU conditionally clears Cargill purchase of ADM chocolate business "
    },
    {
        "content": "KANSAS CITY  Kansas  June 25 Archer Daniels Midland Co and ethanol supporters on Thursday challenged a U.S. government plan for biofuels use  saying it will not push past the \"blend wall\" because of a niche market for biofuels credits.",
        "date": "06262015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM  biofuels supporters challenge U.S. ethanol 'blend wall' "
    },
    {
        "content": "BRUSSELS  June 12 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "06122015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "EU mergers and takeovers (June 12) "
    },
    {
        "content": "LONDON The European Commission said on Thursday it had approved the acquisition of Archer Daniels Midland Co's (ADM) cocoa business by Olam International Ltd.",
        "date": "06112015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "EU okays acquisition of ADM cocoa business by Olam "
    },
    {
        "content": "* Will source over 20 percent of total bean output   (Adds details throughout)",
        "date": "06112015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 1-EU okays acquisition of ADM cocoa business by Olam "
    },
    {
        "content": "LONDON  June 11 The European Commission said in a statement on Thursday it had approved the acquisition of Archer Daniels Midland Co's (ADM) cocoa business by commodities firm Olam International Ltd.   (Reporting by David Brough; Editing by Mark Potter)",
        "date": "06112015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "EU Commission okays acquisition of ADM cocoa business by Olam "
    },
    {
        "content": "HAMBURG  June 2 U.S. agribusiness giant Archer Daniels Midland Co. is temporarily halting production at its biodiesel plant in Leer in Germany because of uncertainty about the future of biodiesel in the country  it said on Tuesday.",
        "date": "06022015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM suspends German biodiesel plant output on uncertain demand "
    },
    {
        "content": "CHICAGO  May 21 U.S. agribusiness Archer Daniels Midland Co said on Thursday it is expanding grain export capacity at an Argentine port to help boost shipments from the world's No. 3 corn and soybean supplier and top exporter of soymeal and soyoil.",
        "date": "05212015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM boosts grain export capacity at Argentine port "
    },
    {
        "content": "CHICAGO  May 22 The world's largest corn processor  Archer Daniels Midland Co  is shifting focus from its long-standing cash generator ethanol into developing new food ingredients as the biofuel boom that underpinned its financial success has cooled.",
        "date": "05222015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "As ethanol boom fades  ADM sees bright future for corn in grocery aisle "
    },
    {
        "content": "LONDON U.S. agribusiness Archer Daniels Midland Co is scaling back its modest-sized sugar trading operations and the London-based head of that business has left after less than four years  trade sources said  a sign of the sugar market's deepening woes.",
        "date": "05222015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM scaling back global sugar trading: sources "
    },
    {
        "content": "LONDON  May 22 U.S. agribusiness Archer Daniels Midland Co is scaling back its modest-sized sugar trading operations and the London-based head of that business has left after less than four years  trade sources said  a sign of the sugar market's deepening woes.",
        "date": "05222015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 1-ADM scaling back global sugar trading - sources "
    },
    {
        "content": "LONDON  May 22 U.S. agribusiness Archer Daniels Midland Co is scaling back its global sugar trading operations and the London-based head of that business  Alberto Peixoto  has left the company  trade sources said.",
        "date": "05222015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM scaling back global sugar trading - sources "
    },
    {
        "content": "May 5 Archer Daniels Midland Co  one of the world's largest grain traders  announced on Tuesday a deal to acquire full ownership of two Romanian export terminals on the Black Sea  bolstering its ability to export grain from Eastern Europe.",
        "date": "05052015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM in deal to take full ownership of Black Sea export terminals "
    },
    {
        "content": "CHICAGO  May 5 U.S. agribusiness Archer Daniels Midland Co on Tuesday reported higher-than-expected quarterly profit on strong oilseed crushing margins and robust global demand for soybean meal.",
        "date": "05052015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 1-ADM 1st-qtr profit jumps on strong oilseed processing results "
    },
    {
        "content": "CHICAGO  May 5 U.S. agribusiness Archer Daniels Midland on Tuesday reported a higher-than-expected quarterly profit on strong oilseed crushing margins and robust global demand for soybean meal.",
        "date": "05052015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM profit jumps on strong oilseed processing results "
    },
    {
        "content": "April 27 Grain-handling and food-processing giant Archer Daniels Midland Co said on Monday that it will add soybean crushing flexibility at its plants at Enderlin  North Dakota  and Windsor  Ontario.",
        "date": "04272015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "UPDATE 1-ADM to add soy crushing at North Dakota  Ontario plants "
    },
    {
        "content": "April 27 Grain-handling and food processing giant Archer Daniels Midland Co said on Monday that it will add soybean crushing flexibility at its plants at Enderlin  North Dakota and Windsor  Ontario.",
        "date": "04272015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM to add soy crushing at North Dakota  Ontario plants "
    },
    {
        "content": "CHICAGO  April 22 Archer Daniels Midland Co  plans to use drones to gather data on crop insurance claims as soon as the summer of 2016  its risk services head told Reuters on Wednesday.",
        "date": "04222015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM could use drones from 2016 to get crop insurance claims data "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 20 (Fitch) Fitch Ratings has affirmed Archer Daniels Midland  Co.'s (ADM) Issuer Default Rating (IDR) at 'A'. The ratings apply to  approximately $5.7 billion of total outstanding debt. The Rating Outlook is  Stable.  See a full list of ratings at the end of this release.  KEY RATING DRIVERS  --EBITDA margin increased significantly to 4.8% in 2014 from 3.4% in 2013  concomitant with a 27% increase in EBITDA as ADM success",
        "date": "04202015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "Fitch Affirms ADM's IDR at 'A'; Outlook Stable "
    },
    {
        "content": "* Transaction includes sales and delivery of lactic acid  sodium lactate  and potassium lactate products",
        "date": "04102015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "BRIEF-Corbion acquires lactic acid business from Archer Daniels Midland "
    },
    {
        "content": "BARCELONA  March 31 (Thomson Reuters Foundation) - Leading agricultural processor and food-ingredient supplier Archer Daniels Midland Company has agreed to stop deforestation due to soy and palm oil production in its global supply chains  according to investors.",
        "date": "03312015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "Crop-product giant ADM to end deforestation in supply chain - TRFN "
    },
    {
        "content": "March 30 Archer Daniels Midland Co is buying AOR NV  a privately held edible oils bottler and distributor based in Antwerp  Belgium  the U.S. grain company said on Monday.",
        "date": "03302015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM buys Belgian vegoils company AOR NV "
    },
    {
        "content": "CHICAGO  March 2 Archer Daniels Midland Co  on Monday said its chief financial officer will assume oversight of business in Asia as the commodity trader looks to expand operations in the fast-growing region.",
        "date": "03022015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM finance chief to oversee Asia business in management shuffle "
    },
    {
        "content": "BRUSSELS  Feb 24 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02242015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "EU mergers and takeovers (Feb 24) "
    },
    {
        "content": "WINNIPEG/NEW YORK  Feb 25 Archer Daniels Midland   one of the world's top biofuels producers  has slowed North American biodiesel output  the latest sign the industry is battling uncertainty over U.S. renewable fuel policy while the oil rout curbs demand.",
        "date": "02252015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM cuts biodiesel output as industry hit by weak margins "
    },
    {
        "content": "BRUSSELS/CHICAGO The European Commission said on Monday it had opened an in-depth investigation into Cargill Inc's planned acquisition of Archer Daniels Midland Co's  chocolate business  citing concerns the deal could lead to higher prices.",
        "date": "02232015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "EU probes Cargill's plan to buy ADM chocolate unit "
    },
    {
        "content": "BRUSSELS/CHICAGO  Feb 23 The European Commission said on Monday it had opened an in-depth investigation into Cargill Inc's planned acquisition of Archer Daniels Midland Co's chocolate business  citing concerns the deal could lead to higher prices.",
        "date": "02232015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 1-EU probes Cargill's plan to buy ADM chocolate unit "
    },
    {
        "content": "BRUSSELS  Feb 23 The European Commission said on Monday it had opened an in-depth investigation into Cargill Inc's planned acquisition of the industrial chocolate business of rival Archer Daniels Midland Co.",
        "date": "02232015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "EU opens in-depth study of Cargill's planned buy of ADM chocolate unit "
    },
    {
        "content": "BRUSSELS  Feb 23 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02232015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "EU mergers and takeovers (Feb 23) "
    },
    {
        "content": "CHICAGO Plans by commodities trading rivals Archer Daniels Midland Co and Glencore PLC to jointly develop an export terminal in northern Brazil promise to shift grain flows both within South America's largest producer and to Asian importers.",
        "date": "02042015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "ADM-Glencore grain port venture to shuffle Brazil grain flows "
    },
    {
        "content": "NEW YORK  Feb 3 U.S. agribusiness Archer Daniels Midland Co on Tuesday said ethanol producers will have to cut output amid high stocks and stagnating demand  as the industry's woes deepen with the oil rout and squeezed margins.",
        "date": "02032015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "U.S. ethanol makers need to curb output as margins tumble -ADM exec "
    },
    {
        "content": "CHICAGO  Feb 3 Plans by commodities trading rivals Archer Daniels Midland Co and Glencore PLC  to jointly develop an export terminal in northern Brazil promise to shift grain flows both within South America's largest producer and to Asian importers.",
        "date": "02032015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM-Glencore grain port venture to shuffle Brazil grain flows "
    },
    {
        "content": "U.S. agribusiness company Archer Daniels Midland Co  has agreed to sell a 50-percent stake in its Barcarena grain export terminal in northern Brazil to commodities trader Glencore PLC   the company said during an analyst call on Tuesday.",
        "date": "02032015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM to sell 50 percent stake in Brazil export terminal to Glencore "
    },
    {
        "content": "Feb 3 U.S. agribusiness company Archer Daniels Midland Co has agreed to sell a 50-percent stake in its Barcarena grain export terminal in northern Brazil to commodities trader Glencore PLC  the company said during an analyst call on Tuesday.",
        "date": "02032015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM to sell 50 pct stake in Brazil export terminal to Glencore "
    },
    {
        "content": "CHICAGO U.S. agribusiness Archer Daniels Midland Co  on Tuesday reported higher quarterly earnings as a record-large U.S. harvest boosted grain volumes and supported strong exports  though revenue fell short of expectations.",
        "date": "02032015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM profit jumps as big U.S. harvest boosts ag services "
    },
    {
        "content": "CHICAGO  Feb 3 U.S. agribusiness Archer Daniels Midland Co on Tuesday reported higher quarterly earnings as a record-large U.S. harvest boosted grain volumes and supported strong exports  though revenue fell short of expectations.",
        "date": "02032015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "UPDATE 2-ADM profit jumps as big U.S. harvest boosts ag services "
    },
    {
        "content": "CHICAGO  Feb 3 U.S. agribusiness Archer Daniels Midland Co on Tuesday reported higher quarterly earnings on strong grain exports following a record-large U.S. harvest and good soy processing margins in North America and Europe.",
        "date": "02032015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "normal",
        "symbol": "ADM",
        "title": "ADM profit rises as big U.S. harvest boosts ag services results "
    },
    {
        "content": "Jan 21 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Wednesday:",
        "date": "01212015",
        "name": "Archer-Daniels-Midland Company",
        "news_type": "topStory",
        "symbol": "ADM",
        "title": "Deals of the day- Mergers and acquisitions "
    }
]