[
    {
        "content": "* Pershing Square Capital Management raises sole share stake in Automatic Data Processing Inc to 8.8 million shares from 1.8 million shares - SEC Filing‍​",
        "date": "11142017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-Pershing Square Capital Management raises sole share stake in ADP  dissolves in Nomad Foods "
    },
    {
        "content": "OTTAWA  Nov 16 The Canadian labor market lost momentum in October  a new report showed on Thursday  though traders panned the data and analysts said it did not change their outlook for job growth  which has been strong this year.",
        "date": "11162017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "WRAPUP 1-New ADP report shows Canada shed jobs in October; markets unfazed "
    },
    {
        "content": "ROSELAND  N.J. William Ackman got what Automatic Data Processing Inc's  chief executive called an \"ass-whipping\" on Tuesday as the activist hedge fund manager lost an acrimonious fight to win seats on the payroll company's board. | Video ",
        "date": "11072017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Billionaire investor Ackman loses bitter ADP proxy battle "
    },
    {
        "content": "PARIS  Nov 8 The French government has not made a decision about its stake in airport operator ADP after a press report said a bank had been chosen to handle the deal  a spokeswoman for state holding body Agence des Participations de l'Etat (APE) said on Wednesday.",
        "date": "11082017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "No French government decision yet on ADP stake - APE "
    },
    {
        "content": "ROSELAND  N.J.  Nov 7 William Ackman got what Automatic Data Processing Inc's chief executive called an \"ass-whipping\" on Tuesday as the activist hedge fund manager lost an acrimonious fight to win seats on the payroll company's board.",
        "date": "11072017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 3-Billionaire investor Ackman loses bitter ADP proxy battle "
    },
    {
        "content": "* ‍Pershing Square Capital Management comments on today's ADP shareholder vote​",
        "date": "11072017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-‍Pershing Square comments on today's ADP shareholder vote​ "
    },
    {
        "content": "* ADP CEO Carlos Rodriguez‍​ on CNBC says proxy battle was not a great use of time",
        "date": "11072017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-ADP CEO Carlos Rodriguez‍​ says he hopes Bill Ackman \"will move on\" "
    },
    {
        "content": "* Bill Ackman on CNBC says he will keep ADP shares if he wins or loses the vote on Tuesday‍​",
        "date": "11062017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-Bill Ackman says he will keep ADP shares if he wins or loses the vote on Tuesday‍​- CNBC "
    },
    {
        "content": "Automatic Data Processing Inc rejected as \"false and misleading\" on Tuesday the accusation by billionaire investor William Ackman that the company gave proxy adviser Institutional Shareholder Services non-publicly disclosed information.",
        "date": "10312017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "ADP  ISS reject Ackman's claims they exchanged non-public data "
    },
    {
        "content": "Payroll processor Automatic Data Processing Inc  on Thursday reported a better-than-expected quarterly profit and raised its full-year revenue growth forecast amid its ongoing proxy war with billionaire investor William Ackman.",
        "date": "11022017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "ADP beats profit estimate  raises revenue growth forecast "
    },
    {
        "content": "BOSTON Billionaire investor William Ackman on Monday accused Automatic Data Processing Inc  of providing misleading and incorrect claims to Institutional Shareholder Services and asked the proxy advisory firm to reconsider its shareholder recommendations.",
        "date": "10302017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Ackman says ADP provided 'misleading' claims to ISS: filing "
    },
    {
        "content": "* ADP shareholders re-elect all 10 ADP directors at 2017 annual meeting",
        "date": "11072017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-ADP shareholders re-elect all 10 ADP directors "
    },
    {
        "content": "BOSTON  Nov 6 Billionaire hedge fund manager William Ackman faces a crucial shareholder vote on Tuesday that will decide his months-long battle with Automatic Data Processing Inc to get three seats on the payroll company's board.",
        "date": "11062017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Ackman investors wonder if ADP bet will deliver their paychecks "
    },
    {
        "content": "Oct 31 Automatic Data Processing Inc rejected as \"false and misleading\" on Tuesday the accusation by billionaire investor William Ackman that the company gave proxy adviser Institutional Shareholder Services non-publicly disclosed information.",
        "date": "10312017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 2-ADP  ISS reject Ackman's claims they exchanged non-public data "
    },
    {
        "content": "Oct 31 Automatic Data Processing Inc rejected as \"false and misleading\" on Tuesday the accusation by billionaire investor William Ackman that the company had made incorrect statements to a proxy adviser.",
        "date": "10312017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "ADP says Ackman's claims it misled ISS are false "
    },
    {
        "content": "Nov 2 Payroll processor Automatic Data Processing Inc on Thursday reported a better-than-expected quarterly profit and raised its full-year revenue growth forecast amid its ongoing proxy war with billionaire investor William Ackman.",
        "date": "11022017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 2-ADP beats profit estimate  raises revenue growth forecast "
    },
    {
        "content": "BOSTON  Oct 30 Billionaire investor William Ackman on Monday accused Automatic Data Processing Inc of providing misleading and incorrect claims to Institutional Shareholder Services and asked the proxy advisory firm to reconsider its shareholder recommendations.",
        "date": "10302017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 2-Ackman says ADP provided 'misleading' claims to ISS -filing "
    },
    {
        "content": "BOSTON  Oct 30 Billionaire investor William Ackman on Monday accused Automatic Data Processing of having provided misleading and incorrect data to Institutional Shareholder Services and asked the proxy advising firm to reconsider its recommendations.",
        "date": "10302017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Ackman says ADP provided 'misleading' data to ISS -filing "
    },
    {
        "content": "* ADP increases cash dividend; marks 43rd consecutive year of dividend increases",
        "date": "11072017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-ADP raises qtrly cash dividend "
    },
    {
        "content": "U.S. companies added the most workers in seven months in October as hiring rebounded from an 11-month low set in September stemming from Hurricanes Harvey and Irma  a report by a payrolls processor showed on Wednesday.",
        "date": "11012017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "U.S. companies add most workers in 7 months as storm effect fades: ADP "
    },
    {
        "content": "* Q1 earnings per share view $0.85 -- Thomson Reuters I/B/E/S",
        "date": "11022017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-ADP reports Q1 adjusted earnings per share of $0.91 "
    },
    {
        "content": "* ‍ADP Chairman John Jones sends letter to stockholders; urges them to vote to re-elect all of co's 10 directors at annual meeting​ Source text for Eikon: Further company coverage:",
        "date": "10302017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-ADP Chairman John Jones sends letter to stockholders "
    },
    {
        "content": "* Bill Ackman loses bid for ADP board seats - CNBC  citing DJ Further company coverage: (Bengaluru Newsroom)",
        "date": "11072017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-Bill Ackman loses bid for ADP board seats - CNBC  citing DJ "
    },
    {
        "content": "* Pershing Square sends letter to ADP's board Source text for Eikon: Further company coverage:",
        "date": "11012017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-Pershing Square sends letter to ADP's board "
    },
    {
        "content": "Nov 2 Automatic Data Processing Inc reported a 5.6 percent rise in quarterly revenue on Thursday  helped by strong business from its professional employer organization services unit.",
        "date": "11022017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "ADP quarterly revenue rises 5.6 percent "
    },
    {
        "content": "* ‍pershing Square Capital Management LP published a letter to ADP shareholders​ on Friday Source text for Eikon:",
        "date": "10272017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-Pershing Square publishes letter to ADP shareholders "
    },
    {
        "content": "ROSELAND  N.J.  Nov 7 The fierce proxy battle between activist hedge fund manager William Ackman and the leadership of Automatic Data Processing Inc will come to a close on Tuesday when an official vote tally is announced at the payroll processor's annual shareholder meeting.",
        "date": "11072017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Ackman's ADP proxy battle nears climax with investor vote tally "
    },
    {
        "content": "* Automatic Data Processing - ‍sending letter to stockholders urging them to re-elect all of co's 10 directors at Nov. 7 annual meeting​ Source text for Eikon: Further company coverage:",
        "date": "10262017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-Automatic Data Processing ‍sends letter to stockholders "
    },
    {
        "content": "* Proxy advisory firm ISS recommends ADP shareholders elect Pershing Square's Bill Ackman to ADP's board Source text for Eikon: Further company coverage:",
        "date": "10252017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-Proxy advisory firm ISS recommends ADP shareholders elect Pershing Square's Bill Ackman to ADP's board "
    },
    {
        "content": "* Proxy advisory firm Egan-Jones joins Glass Lewis in recommending ADP shareholders vote for all three of Pershing Square’s nominees for ADP’s transformation on the gold proxy card",
        "date": "10242017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-Egan-Jones recommends ADP shareholders to vote for all three of Pershing Square’s nominees "
    },
    {
        "content": "BOSTON  Oct 23 Proxy advisory firm Glass Lewis said on Monday that it recommends Automatic Data Processing shareholders vote for all three dissident directors  giving activist investor Bill Ackman a boost in a bitter proxy battle with the company.",
        "date": "10232017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Glass Lewis recommends ADP investors vote for Ackman's slate "
    },
    {
        "content": "BOSTON  Oct 26 Proxy advisory firm ISS on Wednesday recommended that shareholders largely vote for directors recommended by the board of Automatic Data Processing Inc  but also supported the election of hedge fund manager William Ackman.",
        "date": "10262017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "RPT-Proxy firm ISS supports ADP management but recommends Ackman to board "
    },
    {
        "content": "BOSTON  Oct 26 Billionaire investor William Ackman on Wednesday said that Automatic Data Processing Inc will probably employ more people if management listens to his plans for beefing up the company's earnings and product offerings.",
        "date": "10262017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "RPT-Ackman says his plan will not slash jobs as ADP CEO claims "
    },
    {
        "content": "BOSTON  Oct 25 Proxy advisory firm ISS on Wednesday largely threw its weight behind Automatic Data Processing Inc  recommending that shareholders vote for management's directors because activist investor William Ackman failed to make a case to replace three directors.",
        "date": "10252017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "ISS largely throws weight behind ADP in proxy battle with Ackman "
    },
    {
        "content": "NEW YORK Short-sellers who had targeted Chipotle Mexican Grill Inc  logged a nearly quarter billion dollar paper profit on Wednesday  a day after the burrito chain reported weaker-than-expected sales that sent its shares into a swoon.",
        "date": "10252017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Short-sellers taste profits as Chipotle shares plunge "
    },
    {
        "content": "BOSTON  Oct 23 Proxy advisory firm Glass Lewis recommended on Monday that Automatic Data Processing Inc shareholders vote for all three dissident directors proposed by activist investor Bill Ackman.",
        "date": "10232017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 2-Glass Lewis recommends ADP investors vote for Ackman's slate "
    },
    {
        "content": "* Automatic Data Processing ‍issues statement in response to report by Glass Lewis regarding election of directors to ADP's board at 2017 annual meeting",
        "date": "10232017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-ADP ‍issues statement on Glass Lewis' recommendation "
    },
    {
        "content": "BOSTON Proxy advisory firm ISS on Wednesday recommended that shareholders largely vote for directors recommended by the board of Automatic Data Processing Inc  but also supported the election of hedge fund manager William Ackman.",
        "date": "10262017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Proxy firm ISS supports ADP management but recommends Ackman to board "
    },
    {
        "content": "BOSTON  Oct 25 Billionaire investor William Ackman on Wednesday said that Automatic Data Processing Inc will probably employ more people if management listens to his plans for beefing up the company's earnings and product offerings.",
        "date": "10262017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Ackman says his plan will not slash jobs as ADP CEO claims "
    },
    {
        "content": "BOSTON  Oct 25 Billionaire investor William Ackman on Wednesday said that Automatic Data Processing Inc will probably employ more people if management listens to his plans for beefing up the company's earnings and product offerings.",
        "date": "10262017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 1-Ackman says his plan will not slash jobs as ADP CEO claims "
    },
    {
        "content": "BOSTON  Oct 25 Proxy advisory firm ISS on Wednesday recommended that shareholders largely vote for directors recommended by the board of Automatic Data Processing Inc  but also supported the election of hedge fund manager William Ackman.",
        "date": "10262017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 3-Proxy firm ISS supports ADP management but recommends Ackman to board "
    },
    {
        "content": "BOSTON  Oct 19 Activist investor William Ackman  currently battling for board seats at Automatic Data Processing Inc  on Thursday said the human resource software company should buy rival Ceridian  in a move that could woo customers with a better product.",
        "date": "10202017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Ackman urges ADP to consider acquiring Ceridian amid proxy fight "
    },
    {
        "content": "NEW YORK Automatic Data Processing Inc is already making many of the changes activist shareholder William Ackman is advocating  but it will take time to see results  Chief Executive Officer Carlos Rodriguez said in an interview on Wednesday.",
        "date": "10192017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "ADP is already making changes Ackman wants: CEO "
    },
    {
        "content": "NEW YORK  Oct 18 Automatic Data Processing Inc is already making many of the changes activist shareholder William Ackman is advocating  but it will take time to see results  Chief Executive Officer Carlos Rodriguez said in an interview on Wednesday.",
        "date": "10192017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 1-ADP is already making changes Ackman wants -CEO "
    },
    {
        "content": "* Automatic Data Processing Inc - ‍\"urges\" stockholders to re-elect ADP's board by voting white proxy card Source text for Eikon: Further company coverage: (Bangalore.newsroom@thomsonreuters.com)",
        "date": "10182017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-Automatic Data Processing Inc - ‍\"urges\" stockholders to re-elect ADP's board by voting white proxy card "
    },
    {
        "content": "Oct 17 Activist investor William Ackman's dissident director candidates for board seats at Automatic Data Processing Inc will answer questions about their plans for the company on Thursday ahead of November's proxy vote.",
        "date": "10182017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Ackman  ADP board nominees to discuss plans for company Thursday "
    },
    {
        "content": "BOSTON  Oct 10 Billionaire investor William Ackman took his fight for board seats at Automatic Data Processing Inc to retail investors on Tuesday in an unusually public format where he detailed his successes and failures and urged all to cast their votes.",
        "date": "10112017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Ackman reaches out to ADP retail investors  softens image "
    },
    {
        "content": "Oct 10 Retail investors in U.S. human resources firm Automatic Data Processing Inc will have a chance to grill billionaire shareholder William Ackman on Tuesday  an innovative bid by the hedge fund manager to seek support in his quest for board seats.",
        "date": "10102017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "ADP retail investors to get a chance to grill Ackman "
    },
    {
        "content": "* Bill Ackman on CNBC says would like to see Automatic Data Processing's margins improve",
        "date": "10042017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-Bill Ackman on CNBC says would like to see ADP's margins improve "
    },
    {
        "content": "* U.S. services sector expands at quickest pace since 2005 -ISM (Recasts  adds quote  market action)",
        "date": "10042017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "WRAPUP 1-Hurricanes hit U.S. hiring in September  services sector resilient "
    },
    {
        "content": "U.S. private employers added 135 000 jobs in September  topping economists' expectations even as Hurricane Harvey and Irma \"significantly impacted smaller retailers \" a report by a payrolls processor showed on Wednesday.",
        "date": "10042017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 135 000 jobs in September: ADP "
    },
    {
        "content": "* Pershing Square Capital Management sends letter to shareholders in relation to ADP​ Source text for Eikon: Further company coverage:",
        "date": "09282017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-Pershing Square sends letter to shareholders in relation to ADP​ "
    },
    {
        "content": "* ADP acquires Global Cash Card  solidifies leadership position in employee payments and extends payroll differentiation with acquisition of proprietary digital payments processing platform",
        "date": "10052017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-ADP acquires Global Cash Card "
    },
    {
        "content": "BOSTON Billionaire hedge fund manager William Ackman  whose firm has a 2 percent voting stake in Automatic Data Processing Inc   is turning up the heat in his proxy war for the human resources outsourcing company by targeting an often-ignored but influential group of people - retail investors.",
        "date": "09222017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Ackman targets retail investors in ADP proxy contest "
    },
    {
        "content": "BOSTON  Sept 20 Billionaire hedge fund manager William Ackman  whose firm owns an 8.3 percent stake in Automatic Data Processing Inc  is turning up the heat in his proxy war for the human resources outsourcing company by targeting an often-ignored but influential group of people - retail investors.",
        "date": "09212017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "RPT-UPDATE 2-Ackman targets retail investors in ADP proxy contest "
    },
    {
        "content": "BOSTON Billionaire hedge fund manager William Ackman  whose firm owns an 8.3 percent stake in Automatic Data Processing Inc   is turning up the heat in his proxy war for the human resources outsourcing company by targeting an often-ignored but influential group of people - retail investors.",
        "date": "09202017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Ackman targets retail investors in ADP proxy contest "
    },
    {
        "content": "BOSTON  Sept 22 Billionaire hedge fund manager William Ackman  whose firm has a 2 percent voting stake in Automatic Data Processing Inc  is turning up the heat in his proxy war for the human resources outsourcing company by targeting an often-ignored but influential group of people - retail investors.",
        "date": "09222017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "CORRECTED-RPT-Ackman targets retail investors in ADP proxy contest "
    },
    {
        "content": "BOSTON  Sept 20 Billionaire hedge fund manager William Ackman  whose firm owns an 8.3 percent stake in Automatic Data Processing Inc  is turning up the heat in his proxy war for the human resources outsourcing company by targeting an often-ignored but influential group of people - retail investors.",
        "date": "09202017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 2-Ackman targets retail investors in ADP proxy contest "
    },
    {
        "content": "BOSTON  Sept 22 Billionaire hedge fund manager William Ackman  whose firm has a 2 percent voting stake in Automatic Data Processing Inc  is turning up the heat in his proxy war for the human resources outsourcing company by targeting an often-ignored but influential group of people - retail investors.",
        "date": "09222017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "CORRECTED-UPDATE 2-Ackman targets retail investors in ADP proxy contest "
    },
    {
        "content": "Sept 22 Automatic Data Processing Inc rejected billionaire hedge fund manager William Ackman's request to use a universal proxy card during the human resources outsourcing company's annual shareholder meeting.",
        "date": "09222017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "CORRECTED-UPDATE 1-ADP rejects Ackman's request to use universal proxy card "
    },
    {
        "content": "BOSTON  Sept 20 Billionaire hedge fund manager William Ackman on Wednesday spoke to Main Street stockholders  asking this less affluent but hugely influential group to help him win a proxy contest at human resources outsourcing company Automatic Data Processing Inc.",
        "date": "09202017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Ackman asks ADP's retail investors to back him in new video "
    },
    {
        "content": "Sept 22 Automatic Data Processing Inc rejected billionaire hedge fund manager William Ackman's request to use a universal proxy card during the human resources outsourcing company's annual shareholder meeting.",
        "date": "09222017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "CORRECTED-ADP rejects Ackman's request to use universal proxy card "
    },
    {
        "content": "* ‍Sent a letter to stockholders urging them to vote white proxy card \"for\" co's 10 director nominees​ Source text for Eikon: Further company coverage:",
        "date": "09142017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-ADP sends letter to stockholders "
    },
    {
        "content": "* Pershing Square says ‍urges ADP shareholders not to vote white proxy card or voting instruction forms received from adp​ Source text for Eikon: Further company coverage:",
        "date": "09132017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-Pershing Square responds to ADP Presentation "
    },
    {
        "content": "* Ackman owns 2 percent of ADP common shares - CNBC  citing sources Further company coverage:",
        "date": "09112017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-Pershing Square's Ackman owns 2 pct of ADP common shares - CNBC "
    },
    {
        "content": "* ADP comments on letter from Pershing Square and previous meeting with ADP board",
        "date": "09072017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-Adp comments on letter from Pershing Square and previous meeting with ADP board "
    },
    {
        "content": "* Pershing Square files Definitive Proxy Materials for ADP 2017 annual meeting",
        "date": "09052017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-Pershing Square files Definitive Proxy Materials for ADP 2017 annual meeting "
    },
    {
        "content": "NEW YORK U.S. private-sector employers hired 237 000 workers in August for the biggest monthly increase in five months  beating economists' expectations  a report by a payrolls processor showed on Wednesday.",
        "date": "08302017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "U.S. private sector added most workers in five months in August: ADP "
    },
    {
        "content": " (Adds background  table)     NEW YORK  Aug 30 U.S. private-sector employers hired 237 000 workers in August for the biggest monthly increase in five months  beating economists' expectations  a report by a payrolls processor showed on Wednesday.     Economists surveyed by Reuters had forecast the ADP National Employment Report would show a gain of 183 000 jobs.     July's private payrolls increase was revised up to 201 000 from the previously reported 178 000.      The report is join",
        "date": "08302017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 1-U.S. private sector added most workers in five months in August -ADP "
    },
    {
        "content": "BOSTON Billionaire investor William Ackman said he was not eager for a proxy contest with Automatic Data Processing  and suggested that the board add his three nominees  a settlement proposal that was rejected  a new filing shows.",
        "date": "08282017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Pershing Square's Ackman made settlement offer to ADP: filing "
    },
    {
        "content": "BOSTON  Aug 28 Billionaire investor William Ackman said he was not eager for a proxy contest with Automatic Data Processing and suggested that the board add his three nominees  a settlement proposal that was rejected  a new filing shows.",
        "date": "08282017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 1-Pershing Square's Ackman made settlement offer to ADP -filing "
    },
    {
        "content": "BOSTON  Aug 28 Billionaire investor William Ackman made a settlement proposal to Automatic Data Processing two weeks ago by suggesting that the board add his three nominees to avoid fighting an expensive and disruptive proxy battle  a new filing shows.",
        "date": "08282017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Pershing Square's Ackman made settlement offer to ADP - filing "
    },
    {
        "content": "Aug 21 Automatic Data Processing Inc on Monday rejected billionaire investor William Ackman's three proposed board candidates  sparking more criticism from the hedge fund manager who is trying to shake up the human resources outsourcing firm.",
        "date": "08212017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "ADP rejects new board candidates  Ackman fires back "
    },
    {
        "content": "The planned Sept. 5 meeting might give Ackman and ADP a second chance to find common ground following the billionaire investor's call for changes to ADP's board  which the company has rejected.",
        "date": "08242017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Billionaire investor Ackman to meet with ADP board on September 5 "
    },
    {
        "content": "* ADP board rejects Pershing Square nominees for 2017 annual meeting",
        "date": "08212017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-Automatic Data Processing ‍plans to file its preliminary proxy statement with SEC this week​ "
    },
    {
        "content": "Aug 24 Activist investor William Ackman  who has been urging Automatic Data Processing Inc to cut costs  will meet with the board of the U.S. human resources outsourcing firm next month  a regulatory filing showed on Thursday. (http://bit.ly/2xw2n2U)",
        "date": "08242017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Billionaire investor Ackman to meet with ADP board on Sept. 5 "
    },
    {
        "content": "* William Ackman sends letter to Automatic Data Processing Inc CEO Carlos Rodriguez and and non-executive chairman John Jones - SEC filing",
        "date": "08242017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-Ackman writes to ADP on Sept 5 meeting with co's board "
    },
    {
        "content": "BOSTON/NEW YORK  Aug 17 Billionaire activist investor William Ackman on Thursday said Automatic Data Processing Inc's stock price could double in the next five years if the human resources outsourcing company cuts costs  streamlines its business and invests in technology upgrades.",
        "date": "08172017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "UPDATE 3-Ackman's Pershing Square says ADP needs to streamline  modernize "
    },
    {
        "content": "* ‍\"Strongly disagree with many of assertions made by Mr. Ackman\" in Aug. 17 presentation​ Source text for Eikon: Further company coverage:",
        "date": "08172017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-Automatic Data Processing comments on Pershing Square investor presentation "
    },
    {
        "content": "* Chapman says he is \"short\" on Automatic Data Processing - CNBC",
        "date": "08172017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-Hedge fund manager Robert Chapman says he is \"short\" on Automatic Data Processing - CNBC "
    },
    {
        "content": "Aug 14 Activist investor Pershing Square Capital Management LP said on Monday the chief executive of Automatic Data Processing Inc had \"unfairly characterized\" their interactions in an effort to make the hedge fund's requests \"appear unreasonable\".",
        "date": "08142017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Pershing Square says ADP CEO misled board on talks with hedge fund "
    },
    {
        "content": "BOSTON/NEW YORK  Aug 17 Activist investor William Ackman laid out his case for changes at Automatic Data Processing Inc on Thursday  saying the payroll processor needs to improve its profit margins and integrate its business lines.",
        "date": "08172017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Pershing Square's Ackman says ADP needs to streamline "
    },
    {
        "content": "BOSTON/NEW YORK Billionaire activist investor William Ackman on Thursday said Automatic Data Processing Inc's  stock price could double in the next five years if the human resources outsourcing company cuts costs  streamlines its business and invests in technology upgrades. | Video ",
        "date": "08182017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Ackman's Pershing Square says ADP needs to streamline  modernize "
    },
    {
        "content": "Pershing Square Capital Management LP proposed three nominees on Monday  including its Chief Executive Officer William Ackman  to serve on the board of Automatic Data Processing Inc  setting the stage for a proxy contest with the human resources outsourcing company.",
        "date": "08072017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Ackman's Pershing Square nominates three ADP board directors "
    },
    {
        "content": "NEW YORK The CEO of Automatic Data Processing Inc slammed investor William Ackman on Thursday  likening the hedge fund manager to a \"spoiled brat\" and skewering the billionaire's research efforts into the payroll processor.",
        "date": "08102017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "ADP CEO slams Ackman's research and 'spoiled brat' antics "
    },
    {
        "content": "Aug 7 Pershing Square Capital Management LP proposed three nominees on Monday  including its Chief Executive Officer William Ackman  to serve on the board of Automatic Data Processing Inc  setting the stage for a proxy contest with the human resources outsourcing company.",
        "date": "08072017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 2-Ackman's Pershing Square nominates three ADP board directors "
    },
    {
        "content": "NEW YORK  Aug 10 The CEO of Automatic Data Processing Inc slammed investor William Ackman on Thursday  likening the hedge fund manager to a \"spoiled brat \" and skewering the billionaire's research efforts into the payroll processor.",
        "date": "08102017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 2-ADP CEO slams Ackman as 'spoiled brat' using shoddy research "
    },
    {
        "content": "* Automatic Data Processing says nominating corporate governance committee of board will evaluate Ackman's nominees​",
        "date": "08072017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-ADP comments on Pershing Square Capital Management's nomination of directors "
    },
    {
        "content": "NEW YORK  Aug 10 Automatic Data Processing chief executive and president  Carlos Rodriguez  told CNBC on Thursday that Pershing Square's William Ackman does not understand the company and has acted like a \"spoiled brat\" in his effort to get the company to extend its board nomination deadline.",
        "date": "08102017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Investor Ackman does not understand ADP  company CEO tells CNBC "
    },
    {
        "content": "* Pershing Square announces nominees for election to the board of directors of ADP",
        "date": "08072017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-Pershing Square announces nominees for election to ADP board "
    },
    {
        "content": "* ‍PERSHING SQUARE CAPITAL MANAGEMENT SAYS HAS ACQUIRED AN 8% STAKE IN ADP  MAKING IT PERSHING SQUARE'S LARGEST INVESTMENT​",
        "date": "08072017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-Pershing Square Holdings buys 8 pct stake in ADP "
    },
    {
        "content": "BOSTON Billionaire investor William Ackman on Friday said his Pershing Square Capital Management hedge fund plans to nominate directors to  but not try to control  the 10-person board at payroll services company Automatic Data Processing Inc .",
        "date": "08052017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Ackman's Pershing Square says it plans to nominate directors at ADP "
    },
    {
        "content": "NEW YORK U.S. private employers added 178 000 jobs in July  below economists' expectations  a report by a payrolls processor showed on Wednesday.",
        "date": "08022017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "U.S. private sector adds 178 000 jobs in July: ADP "
    },
    {
        "content": "Billionaire investor William Ackman on Friday said his hedge fund had taken an 8 percent stake in Automatic Data Processing Inc  and plans to ask for board seats so he can push the U.S. human resources outsourcing company to cut costs and improve its returns.",
        "date": "08042017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Activist Ackman looks for board seats  better returns at payroll firm ADP "
    },
    {
        "content": "Aug 4 Billionaire investor William Ackman on Friday said his hedge fund had taken an 8 percent stake in Automatic Data Processing Inc and plans to ask for board seats so he can push the U.S. human resources outsourcing company to cut costs and improve its returns.",
        "date": "08042017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 3-Activist Ackman looks for board seats  better returns at payroll firm ADP "
    },
    {
        "content": "BOSTON  Aug 4 Billionaire investor William Ackman on Friday said his Pershing Square Capital Management hedge fund plans to nominate directors to  but not try to control  the 10-person board at payroll services company Automatic Data Processing Inc.",
        "date": "08042017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Ackman's Pershing Square says it plans to nominate directors at ADP "
    },
    {
        "content": "* Bill Ackman bought even more Automatic Data Processing stock on Friday- CNBC Source http://cnb.cx/2vp4vMj",
        "date": "08042017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-Bill Ackman bought even more Automatic Data Processing stock on Friday- CNBC "
    },
    {
        "content": "Aug 4 Automatic Data Processing Inc said hedge fund Pershing Square Capital Management is seeking effective control of the HR services provider by nominating five directors to its board.",
        "date": "08042017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "ADP says Ackman's Pershing Square seeking control of company "
    },
    {
        "content": "* Shares fall but Vinci still outperforming this year (Recasts with CEO comments on ADP)",
        "date": "07282017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "UPDATE 2-France's Vinci ready to invest more in Paris airports "
    },
    {
        "content": "* ADP says Pershing Square Capital Management seeking control of ADP",
        "date": "08042017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-ADP says Pershing Square Capital Management seeking control of ADP "
    },
    {
        "content": "July 28 Vinci CEO Xavier Huillard tells a news conference:",
        "date": "07282017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-Vinci will try to play a role if opportunity arises on ADP- CEO "
    },
    {
        "content": "Billionaire investor William Ackman is buying a large stake in Automatic Data Processing Inc   two people familiar with the matter said on Thursday  a move that sent the U.S. payroll company's stock up 16.5 percent to a record high.",
        "date": "07272017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Ackman's Pershing Square bets on ADP  sends stock to record high "
    },
    {
        "content": "July 27 Billionaire investor William Ackman is buying a large stake in Automatic Data Processing Inc  two people familiar with the matter said on Thursday  a move that sent the U.S. payroll company's stock up 16.5 percent to a record high.",
        "date": "07272017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 2-Ackman's Pershing Square bets on ADP  sends stock to record high "
    },
    {
        "content": "July 27 Billionaire investor Bill Ackman's Pershing Square Capital Management has built a stake in business outsourcing company Automatic Data Processing Inc  Bloomberg reported on Thursday.",
        "date": "07272017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Ackman's Pershing Square builds stake in outsourcing company ADP - BBG "
    },
    {
        "content": "* ADP reports fourth quarter and fiscal 2017 results; provides fiscal 2018 outlook",
        "date": "07272017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-ADP Q4 adjusted EPS $0.66 from continuing operations "
    },
    {
        "content": "* RAVINALA AIRPORTS FORMED BY GROUPE ADP  BOUYGUES BÂTIMENT INTERNATIONAL  COLAS AND MERIDIAM AFRICA  FINALISES ITS FUNDING ARRANGEMENTS AND BEGINS WORK Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "07052017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-ADP's Ravinala Airports finalises its funding arrangements and begins work "
    },
    {
        "content": "* Euro finds support as bond yields rise after ECB minutes (Updates prices  adds comments)",
        "date": "07062017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "FOREX-Dollar retreats after soft U.S. labor market data "
    },
    {
        "content": "* Indexes down: Dow 0.42 pct  S&P 0.58 pct  Nasdaq 0.88 pct (Adds details  changes comment  updates prices)",
        "date": "07062017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St falls on weak ADP jobs data  North Korea tensions "
    },
    {
        "content": "NEW YORK  July 6 The dollar fell on Thursday after a round of weaker-than-expected U.S. labor market data  affirming a gradual pace for raising interest rates by the Federal Reserve.",
        "date": "07062017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "FOREX-Dollar slides after softer-than-expected U.S. private sector jobs data "
    },
    {
        "content": "* Indexes down: Dow 0.25 pct  S&P 0.35 pct  Nasdaq 0.57 pct (Updates to open)",
        "date": "07062017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Tepid ADP jobs data drags down Wall Street "
    },
    {
        "content": "NEW YORK U.S. private employers added 158 000 jobs in June  below economists' expectations  a report by a payrolls processor showed on Thursday.",
        "date": "07062017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 158 000 jobs in June: ADP "
    },
    {
        "content": "LONDON  July 6 The dollar's bounce faded on Thursday after the U.S. Federal Reserve's policy minutes failed to provide a clear picture of future interest rate increases  although investors were reluctant to add bearish bets before some key data.",
        "date": "07062017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "FOREX- Dollar's bounce falls flat before data; euro drifts up "
    },
    {
        "content": "* Graphic of French state holdings: http://reut.rs/2oR8i0P (Updates with more banker comments)",
        "date": "06092017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "UPDATE 1-France's Macron seen launching privatisation drive with airports "
    },
    {
        "content": "French airport operator ADP  said on Friday it plans to increase its stake in Turkish airport operator TAV Airports  to 46 percent.",
        "date": "06092017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "ADP to buy additional stake in Turkey's TAV for $160 million "
    },
    {
        "content": "* TAV expects no negative impact in Saudi Arabia and Qatar (Adds details  executive quotes)",
        "date": "06092017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 2-France's ADP increases stake in Turkish airport operator "
    },
    {
        "content": "PARIS  June 9 The government of new French President Emmanuel Macron looks likely to start a planned privatisation programme with airports operator ADP  according to three financial industry sources with knowledge of the matter.",
        "date": "06092017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "France's Macron seen launching privatisation drive with airports "
    },
    {
        "content": "U.S. companies in May hired more workers than anticipated by a wide margin to rebound from a six-month low in the prior month  while a tightening labor market should point to increasing wage growth.",
        "date": "06012017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "U.S. companies add 253 000 jobs in May: ADP "
    },
    {
        "content": "    June 1 U.S. private employers added 253 000 jobs in May  above economists' expectations  a report by a payrolls processor showed on Thursday.     Economists surveyed by Reuters had forecast the ADP National Employment Report would show a gain of 185 000 jobs  with estimates ranging from 155 000 to 240 000.     Private payroll gains in the month earlier were revised down to 174 000 from an originally reported 177 000 increase.     The report is jointly developed with Moody's Analy",
        "date": "06012017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 253 000 jobs in May -ADP "
    },
    {
        "content": "* New orders in services sector highest since 2005 - ISM (Update with Fed statement after FOMC meeting  market action)",
        "date": "05032017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "WRAPUP 2-U.S. private hiring slows  services growth speeds up in April "
    },
    {
        "content": "NEW YORK  May 3 The dollar clung to modest gains against a basket of currencies on Wednesday after payroll processor ADP said U.S. companies hired 177 000 workers in April  close to the median estimate of an 175 000 gain among economists polled by Reuters.",
        "date": "05032017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "FOREX-Dollar index holds gains after in-line ADP U.S. jobs data "
    },
    {
        "content": "    May 3 U.S. private employers added 177 000 jobs in April  slightly above economists' expectations  a report by a payrolls processor showed on Wednesday.     Economists surveyed by Reuters had forecast the ADP National Employment Report would show a gain of 175 000 jobs  with estimates ranging from 140 000 to 236 000.     Private payroll gains in the month earlier were revised down to 255 000 from an originally reported 263 000 increase.     The report is jointly developed with Mo",
        "date": "05032017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 177 000 jobs in April -ADP "
    },
    {
        "content": "* Q3 earnings per share view $1.23 -- Thomson Reuters I/B/E/S",
        "date": "05032017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-ADP reports Q3 earnings per share $1.31 from continuing operations "
    },
    {
        "content": "NEW YORK  April 5 U.S. stocks turned negative and the dollar slipped on Wednesday after minutes from the Federal Reserve showed planned changes in its bond investment policy  reversing a rally spurred by a strong jobs report earlier in the day.",
        "date": "04052017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "GLOBAL MARKETS-Stocks  dollar turn negative after Fed minutes "
    },
    {
        "content": "NEW YORK  April 5 U.S. stocks rose on Wednesday  with the Nasdaq hitting a fresh all-time high on strong U.S. private sector-jobs data  which also lifted the dollar as it backed forecasts for at least two more interest rate hikes by the Federal Reserve this year.",
        "date": "04052017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "GLOBAL MARKETS-Stocks  dollar gain on strong private jobs report "
    },
    {
        "content": "U.S. companies added 263 000 workers in March  the most since December 2014  suggesting further tightening of the labor market  payrolls processor ADP said on Wednesday.",
        "date": "04052017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. companies hire most workers in over two years: ADP "
    },
    {
        "content": "* Expectations of strong U.S. payrolls after blockbuster ADP data",
        "date": "03092017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "GLOBAL MARKETS-Dollar firm in Asia  resource shares on the run "
    },
    {
        "content": "    * U.S. companies hire most workers since Dec 2015 -ADP     * Strong 10-year note auction renew bids for Treasuries     * U.S. 2-year yield hits highest since August 2009     * Some investors await clues on ECB's bond purchases   (Update market action  add quote)     By Richard Leong     NEW YORK  March 8 U.S. Treasury yields jumped on Wednesday  with the two-year yield hitting its highest levels in more than 7-1/2 years  as a strong gain in U.S. private-sector jobs in February ce",
        "date": "03082017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "TREASURIES-U.S. bond yields rise on stellar ADP jobs data "
    },
    {
        "content": "TOKYO  March 9 The dollar stood tall on higher U.S. Treasury yields on Thursday  after a surge in U.S. private-sector jobs in February cemented expectations the Federal Reserve will raise rates next week.",
        "date": "03092017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "FOREX-Dollar holds gains on higher Treasury yields  upbeat U.S. ADP jobs data "
    },
    {
        "content": " (Refiles to correct word order in headline)     * U.S. companies hire most workers since Dec 2015 -ADP     * Futures imply rate hike next week nearly priced in     * U.S. to sell $20 billion 10-year notes at 1 p.m. (1800 GMT)     * U.S. 2-year yield hits highest since August 2009      By Richard Leong     NEW YORK  March 8 U.S. Treasury yields jumped on Wednesday  with benchmark yields hitting their highest levels since December as a strong gain in U.S. private-sector jobs in Februa",
        "date": "03082017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "REFILE-TREASURIES-Robust ADP jobs data lift U.S. bond yields "
    },
    {
        "content": "NEW YORK  March 8 U.S. interest rates futures added to earlier losses on Wednesday as traders raised their expectations on the number of U.S. rate increases in 2017 following a stronger-than-forecast February reading on private jobs growth from payroll processor ADP.",
        "date": "03082017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "MONEY MARKETS-Traders strengthen U.S. rate hike view after ADP jobs data "
    },
    {
        "content": "NEW YORK U.S. private employers added 298 000 jobs in February  well above economists' expectations  a report by a payrolls processor showed on Wednesday.",
        "date": "03082017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 298 000 jobs in February: ADP "
    },
    {
        "content": "* Dollar index rises from more than seven-week low hit Tuesday",
        "date": "02012017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "FOREX-Dollar recovers ground on strong U.S. jobs  factory data "
    },
    {
        "content": "* ADP jobs data beats expectations     * Fed meeting statement in focus     * Treasury to sell $62 bln notes  bonds next week      By Karen Brettell     NEW YORK  Feb 1 U.S. Treasury yields jumped on Wednesday after data from payrolls processor ADP showed stronger-than-expected jobs gains in January  raising expectations that Friday's closely watched government employment report will also show strong growth.     U.S. private employers added 246 000 jobs in January  ADP said  higher t",
        "date": "02012017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "TREASURIES-Yields jump on strong jobs data  before Fed "
    },
    {
        "content": "U.S. private employers added 246 000 jobs in January  above economists' expectations  a report by a payrolls processor showed on Wednesday.",
        "date": "02012017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 246 000 jobs in January  topping estimates: ADP "
    },
    {
        "content": "PARIS  Jan 16 Authorities have searched the offices of Paris airport operator ADP and the house of ADP's head Augustin de Romanet as part of an inquiry into contracts between French state bank Caisse des Depots and a well-known criminologist.",
        "date": "01162017",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "Searches carried out at airport group ADP in probe over CDC contracts "
    },
    {
        "content": "* ADP acquires the Marcus Buckingham company to expand talent portfolio  Source text for Eikon:  Further company coverage:",
        "date": "01172017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-ADP acquires The Marcus Buckingham Company to expand talent portfolio "
    },
    {
        "content": "U.S. private employers added 153 000 jobs in December  fewer than in November  but the labor market remained solid  a report by a payrolls processor showed on Thursday.",
        "date": "01052017",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Private hiring slows in December  jobs market still solid "
    },
    {
        "content": "NEW YORK The dollar index briefly added to earlier gains on Wednesday after payroll processor ADP said U.S. companies hired 216 000 workers in November  more than the 165 000 forecast among economists polled by Reuters.",
        "date": "11302016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Dollar index adds gains after ADP U.S. jobs data "
    },
    {
        "content": "U.S. private employers added 216 000 jobs in November  well above economists' expectations  a report by a payrolls processor showed on Wednesday.",
        "date": "11302016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 216 000 jobs in November: ADP "
    },
    {
        "content": "* ADP increases cash dividend; marks 42nd consecutive year of dividend increases",
        "date": "11082016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-Automatic Data Processing increases cash dividend to $0.57/share "
    },
    {
        "content": "* WageWorks Inc - as consideration for transaction with co  ADP will receive approximately $235 million in cash - SEC filing  Source text: (http://bit.ly/2fsLIJd) Further company coverage:",
        "date": "11012016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-WageWorks says as consideration for deal  ADP will receive about $235 mln in cash - SEC filing "
    },
    {
        "content": "NEW YORK U.S. private employers added 147 000 jobs in October  below economists' expectations  a report by a payrolls processor showed on Wednesday.",
        "date": "11022016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "U.S. private sector adds 147 000 jobs in October: ADP "
    },
    {
        "content": "* Automatic Data Processing Inc - recorded pre-tax restructuring charge of $40 million in quarter related to previously announced service alignment initiative",
        "date": "11022016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-ADP posts profit from continuing operations of $0.81/share "
    },
    {
        "content": "* Aéroports de Paris announces completion of sale of its equity interest in Mexican airport operator OMA.",
        "date": "10102016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-ADP completes sale of its stake in Mexican airport operator OMA "
    },
    {
        "content": "(Recasts with market move  adds details on data; quotes  updates prices)     * Friday's September payrolls report in focus     * Payrolls expectations boosted by ISM hiring data     * ADP jobs data weaker than expected      By Karen Brettell     NEW YORK  Oct 5 U.S. Treasury yields rose on Wednesday after data showing strong hiring in the services sector boosted hiring expectations for Friday's highly anticipated jobs report.     The Institute of Supply Management (ISM) said on We",
        "date": "10052016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "TREASURIES-Yields rise as strong service sector hiring boosts jobs bets "
    },
    {
        "content": "WASHINGTON  Oct 5 U.S. services sector activity rebounded to an 11-month high in September  an encouraging sign for economic growth that may increase the prospect of a Federal Reserve interest rate hike this year.",
        "date": "10052016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "WRAPUP 2-U.S. services sector activity surges to 11-month high "
    },
    {
        "content": "NEW YORK U.S. private employers added 154 000 jobs in September  below economists' expectations  a report by a payrolls processor showed on Wednesday.",
        "date": "10052016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 154 000 jobs in September: ADP "
    },
    {
        "content": "NEW YORK  Oct 5 The dollar added slight losses against a basket of currencies on Wednesday as ADP said U.S. companies hired fewer workers than analysts forecast in September  raising doubts about job gains in the government's payrolls report due later this week.",
        "date": "10052016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "FOREX-Dollar index dips further after ADP U.S. private jobs data "
    },
    {
        "content": "* CEO Carlos Rodriguez's FY 2016 total compensation was $10.9 million versus $8.3 million in FY 2015 - sec filing",
        "date": "09222016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-Automatic Data Processing CEO Carlos Rodriguez's FY 2016 total compensation $10.9 mln "
    },
    {
        "content": "* Yields on 10-year on pace for most monthly gain since June 2015     * Two-year notes on pace for biggest gain since December     * Yields little moved on Wednesday after in-line ADP report   (Updates to afternoon trading  adds June market action)     By Dion Rabouin     NEW YORK  Aug 31 Yields on benchmark U.S. 10-year Treasury notes were little moved on Wednesday but notched their largest monthly gain in more than a year as strong U.S. data and limited volatility reduced the appet",
        "date": "08312016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "TREASURIES-Benchmark yields post biggest monthly rise in over a year "
    },
    {
        "content": "* Weak euro zone inflation adds pressure for more ECB action   (Recasts with market move  adds data details  updates prices)",
        "date": "08312016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "FOREX-Dollar gives up gains  jobs data in focus "
    },
    {
        "content": "* Dollar at 3-week high after data  then turns lower     * Focus now on August payrolls numbers on Friday     * Graphic: 2016 asset returns http://reut.rs/1WAiOSC   (Updates prices; adds comment  second byline  NEW YORK dateline)     By Marcy Nicholson and Jan Harvey     NEW YORK/LONDON  Aug 31 Gold slid to a two-month low on Wednesday after forecast-beating U.S. jobs data stoked speculation that the Federal Reserve would move ahead with plans to raise interest rates  briefly propell",
        "date": "08312016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "PRECIOUS-Gold eases to two-month low after U.S. jobs data "
    },
    {
        "content": "* Yields little moved on Wednesday after in-line ADP report     * Yields on 10-year on pace for most monthly gain since June 2015     * Two-year notes on pace for biggest gain since November     * Solid U.S. data  rate hike expectations hurt Treasury prices      By Dion Rabouin     NEW YORK  Aug 31 Yields on benchmark U.S. 10-year Treasury notes were little moved on Wednesday but on track for their largest monthly gain in more than a year as strong U.S. data has limited volatility an",
        "date": "08312016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "TREASURIES-Benchmark yields headed for best month in over a year "
    },
    {
        "content": "NEW YORK  Aug 31 The U.S. dollar rose to three-week highs against a basket of currencies on Wednesday after data showed that jobs gains in August were roughly in line with expectations  before paring gains on weak manufacturing data.",
        "date": "08312016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "REFILE-FOREX-Dollar hits three-week high on solid jobs data "
    },
    {
        "content": "NEW YORK U.S. private employers added 177 000 jobs in August  above economists' expectations  a report by a payrolls processor showed on Wednesday.",
        "date": "08312016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 177 000 jobs in August: ADP "
    },
    {
        "content": "* Dollar index eases after USD hits 1-month high vs yen     * Coming up: ADP private payrolls data  1215 GMT     * Graphic: 2016 asset returns http://reut.rs/1WAiOSC   (Updates throughout  adds LONDON dateline)     By Jan Harvey     LONDON  Aug 31 Gold edged higher on Wednesday as the dollar softened  but remained on course to snap two months of gains in August on mounting speculation the Federal Reserve could raise interest rates sooner rather than later.     Investors are awaiting ",
        "date": "08312016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "PRECIOUS-Gold edges higher but heads for monthly drop in August "
    },
    {
        "content": "* ADP data reinforces expectations for solid US payrolls report",
        "date": "08042016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "FOREX-Dollar  sterling tread lightly ahead of BOE  US jobs data "
    },
    {
        "content": "NEW YORK  Aug 3 The dollar gained on Wednesday  after hitting six-week lows hit a day earlier  as investors squared positions ahead of Friday's U.S. non-farm payrolls report  which should help determine the timing of the Federal Reserve's next interest rate hike.",
        "date": "08032016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "FOREX -Dollar recoups losses  but investors largely sidelined ahead of jobs "
    },
    {
        "content": "NEW YORK  Aug 3 The dollar gained on Wednesday  recovering from six-week lows hit the previous session  as investors squared positions ahead of Friday's U.S. non-farm payrolls report  data that should help determine the timing of the next interest rate hike.",
        "date": "08032016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "FOREX -Dollar rallies after losses; focus on U.S. non-farm payrolls "
    },
    {
        "content": "NEW YORK U.S. private employers added 179 000 jobs in July  above economists' expectations  a report by a payrolls processor showed on Wednesday.",
        "date": "08032016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 179 000 jobs in July: ADP "
    },
    {
        "content": "* On august 2  board amended and restated co's by-laws to add proxy access procedures for qualifying stockholders",
        "date": "08032016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-Automatic Data Processing says board amended by-laws to add proxy access procedures for qualifying stockholders "
    },
    {
        "content": "* Qtrly adjusted diluted earnings per share from continuing operations increased 25% to $0.69",
        "date": "07282016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-ADP sees 2017 adjusted EPS from cont ops to grow 10-12 pct "
    },
    {
        "content": "* Oil prices fall as report short of expectations   (Updates to close of U.S. trading  adds analyst quote  note on emerging markets stocks)",
        "date": "07072016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "GLOBAL MARKETS-World stocks rise  but Wall St dips with oil ahead of jobs report "
    },
    {
        "content": "* European stocks gain as Brexit fears wane   (Updates with oil  U.S. stocks fall; adds latest U.S. Treasuries data  sterling activity)",
        "date": "07072016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "GLOBAL MARKETS-World stocks up  Wall St drops ahead of jobs report "
    },
    {
        "content": "* Treasury yields rise from historic lows   (Updates to U.S. trading  changes dateline  previous London)",
        "date": "07072016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "GLOBAL MARKETS-Stocks gain on robust U.S. data  Brexit worry wanes "
    },
    {
        "content": "NEW YORK U.S. private employers hired 172 000 workers in June  higher than economists' expectations  a report by a payrolls processor showed on Thursday.",
        "date": "07072016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 172 000 jobs in June: ADP "
    },
    {
        "content": "* On june 15  co entered into $3.25 billion 364-day credit agreement $3.75 billion five-year credit agreement with group of lenders",
        "date": "06162016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "BRIEF-Automatic Data Processing enters into $3.25 bln credit agreement with group of lenders "
    },
    {
        "content": "NEW YORK U.S. private employers added 173 000 jobs in May  below economists' expectations  a report by a payrolls processor showed on Thursday.",
        "date": "06032016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "U.S. private sector adds 173 000 jobs in May: ADP "
    },
    {
        "content": "* Currency trading lighter than usual due to Japan holiday   (Updates market action  adds quote)",
        "date": "05042016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "FOREX-Dollar rises as U.S. data ease some growth worries "
    },
    {
        "content": "Payroll firm Automatic Data Processing Inc said tax and salary data of employees of \"a small number\" of its clients had been stolen.",
        "date": "05032016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Payroll firm ADP says employee data stolen at some clients "
    },
    {
        "content": "NEW YORK U.S. private employers added the fewest workers in three years in April  well below economists' expectations  with signs of weak hiring activity across most sectors  a report by a payrolls processor showed on Wednesday.",
        "date": "05042016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector job growth slows in April: ADP "
    },
    {
        "content": "* Has learned small number of clients whose employees have been victimized by fraudulent registrations through self-service registration portal",
        "date": "05032016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "BRIEF-ADP says has learned small number of clients whose employees have been victimized by fraudulent registrations "
    },
    {
        "content": "* ADP private jobs data misses expectations badly     * Yields fall to lowest since April 20     * U.S. international trade deficit shrinks  pares yields loss      By Dion Rabouin     NEW YORK  May 4 U.s. Treasury yields fell to their lowest level in two weeks on Wednesday after a reading on U.S. jobs data for April missed expectations  posting the weakest gain in three years  but yields pared those losses after an improvement in the U.S. trade balance.     Private employers in the U",
        "date": "05042016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "TREASURIES-Yields fall to 2-week lows after ADP jobs data "
    },
    {
        "content": "(Updates market action  adds quote  changes byline)     * View on gradual U.S. rate hikes spurs curve-steepening trades     * 2-  3-year yields hit 1-month lows after 7-year note auction     * ADP jobs data support view of solid March payrolls report      By Dion Rabouin     NEW YORK  March 30 Shorter-dated U.S. Treasury yields fell on Wednesday as traders piled on bets the Federal Reserve would raise interest rates gradually in the coming months in the wake of dovish comments fro",
        "date": "03302016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "TREASURIES-Short-dated yields fall on gradual rate-hike view "
    },
    {
        "content": "* Indexes up: Dow 0.82 pct  S&P 0.79 pct  Nasdaq 0.96 pct   (Adds details  changes comment  updates prices)",
        "date": "03302016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St rallies as fears of imminent rate hike fade "
    },
    {
        "content": "(Corrects in second bullet to say $28 bln not $27 bln)     * Investors reduce bond holdings in favor of risk assets     * U.S. to sell $28 billion 7-year notes     * ADP jobs data support view of solid March payrolls report      By Richard Leong     NEW YORK  March 30 U.S. Treasury prices fell on Wednesday with benchmark yields rising from four-week lows as remarks about gradual interest rate hikes from Federal Reserve Chair Janet Yellen revived demand for stocks and other risky a",
        "date": "03302016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "CORRECTED-TREASURIES-U.S. bond prices fall on supply  risk appetite "
    },
    {
        "content": "NEW YORK  March 30 U.S. Treasury prices extended their declines on Wednesday with longer-dated maturities hitting session lows  as stronger-than-forecast private domestic jobs data in March from ADP supported the notion of an improving labor market.",
        "date": "03302016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "TREASURIES-U.S. bond prices add losses after ADP jobs data "
    },
    {
        "content": "NEW YORK U.S. private employers added 200 000 jobs in March  above economists' expectations  a report by a payrolls processor showed on Wednesday.",
        "date": "03302016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 200 000 jobs in March: ADP "
    },
    {
        "content": "* Eyes turn to Friday's nonfarm payrolls number   (New throughout  adds quote  updates prices)",
        "date": "03022016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "TREASURIES-U.S. bond yields climb on subsiding concerns about growth "
    },
    {
        "content": "* Indexes down: Dow 0.09 pct  S&P 0.08 pct  Nasdaq 0.27 pct   (Updates to early afternoon)",
        "date": "03022016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St edges lower as materials stocks drag "
    },
    {
        "content": "* Indexes up: Dow 0.03 pct  S&P 0.07 pct  Nasdaq 0.03 pct   (Adds details  changes comment  updates prices)",
        "date": "03022016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St little changed as energy stocks gain "
    },
    {
        "content": "NEW YORK  March 2 U.S. Treasury yields rose on Wednesday on fewer growth jitters as a combination of domestic and foreign data supported the recently revived view that the Federal Reserve will raise interest rates this year  causing traders to sell some safe-haven government debt.",
        "date": "03022016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "TREASURIES-U.S. bond yields rise as growth concerns abate "
    },
    {
        "content": "* Dollar hits more than 2-week high vs yen before turning lower",
        "date": "03022016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "FOREX-Dollar gains against euro on ADP data  dips against yen on oil decline "
    },
    {
        "content": "NEW YORK U.S. private employers added 214 000 jobs in February  above economists' expectations  suggesting solid job growth despite market turmoil and worries about a slowing global economy  a report by a payrolls processor showed on Wednesday.",
        "date": "03022016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 214 000 jobs in February: ADP "
    },
    {
        "content": "NEW YORK  March 2 U.S. private employers added 214 000 jobs in February  above economists' expectations  suggesting solid job growth despite market turmoil and worries about a slowing global economy  a report by a payrolls processor showed on Wednesday.",
        "date": "03022016",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 1-U.S. private sector adds 214 000 jobs in February -ADP "
    },
    {
        "content": "* ACV saw high demand from foreigners in IPO   (Adds comment from ADP)",
        "date": "01202016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "UPDATE 2-Aeroports de Paris leads bids for 20 pct stake in Vietnam airports firm "
    },
    {
        "content": "NEW YORK U.S. private employers added the most new workers in a year in December  well above economists' expectations and an indication that the pace of hiring remains solid despite some signals of slowing economic growth  a report by a payrolls processor showed on Wednesday.",
        "date": "01062016",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "U.S. private sector adds most jobs in a year in December: ADP "
    },
    {
        "content": "* Strong ADP data supports expectations for Dec. Fed rate hike",
        "date": "12022015",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "FOREX-Dollar gains on expected Fed  ECB divergence "
    },
    {
        "content": "NEW YORK U.S. private employers added 217 000 jobs in November  above expectations and the most since June  signaling job growth is likely strong enough to support the first Federal Reserve interest rate hike in nearly a decade when policymakers meet later this month  a report by a payrolls processor showed on Wednesday.",
        "date": "12022015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 217 000 jobs in November: ADP "
    },
    {
        "content": "* Euro zone yields lower after ECB's Draghi stresses need to act Strategists say easing message back in focus",
        "date": "11042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Portuguese bonds rally as opposition talks stumble "
    },
    {
        "content": "NEW YORK U.S. private employers added 182 000 jobs in October  a tick above economists' expectations  a report by a payrolls processor showed on Wednesday.",
        "date": "11042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 182 000 jobs in October: ADP "
    },
    {
        "content": "NEW YORK U.S. companies hired workers at a solid clip in September  but data showed factory activity in the U.S. Midwest contracted  muddying the economic picture for the Federal Reserve on whether to raise interest rates later this year.",
        "date": "09302015",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "U.S. jobs sector gains  Midwest manufacturing stumbles "
    },
    {
        "content": "* ADP data  comments from Fed's Powell kindle skepticism over September rate hike   (Updates prices  adds comments)",
        "date": "08052015",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "TREASURIES-Longer-dated yields rise on Fed rate hike skepticism "
    },
    {
        "content": "* Dow down 0.08 pct  S&P up 0.31 pct  Nasdaq up 0.76 pct   (Updates to early afternoon)",
        "date": "08052015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Nasdaq  S&P 500 higher; Dow dragged down by Walt Disney "
    },
    {
        "content": "* Indexes up: Dow 0.51 pct  S&P 0.82 pct  Nasdaq 1.34 pct   (Adds details  changes comment  updates prices)",
        "date": "08052015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St higher as data eases Sept rate hike worries "
    },
    {
        "content": "* Dollar index hits 3-1/2 month high on Lockhart Tues. interview",
        "date": "08052015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "FOREX-Dollar rises as U.S. services data support rate-hike view "
    },
    {
        "content": "* Nothing decided on timing of rate hike: Fed's Powell to CNBC",
        "date": "08052015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St rises as pvt jobs data eases rate hike worries "
    },
    {
        "content": "* Nothing decided on timing of rate hike: Fed's Powell tells CNBC",
        "date": "08052015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St set to open higher after pvt sector jobs data "
    },
    {
        "content": "WASHINGTON U.S. private employers hired the most workers in six months in June and factory activity picked up  providing fresh evidence the economy was gathering solid momentum after contracting at the start of the year.",
        "date": "07012015",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Bullish U.S. jobs  factory data brighten growth picture "
    },
    {
        "content": "* Indexes up: Dow 0.92 pct  S&P 0.77 pct  Nasdaq 0.84 pct   (Updates to open)",
        "date": "07012015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St rises sharply on renewed Greece hopes "
    },
    {
        "content": "* Greece's Tsipras accepts some conditions for debt deal     * U.S. companies hire most workers since December - ADP     * Weak German five-year note sale spurs bond selling      By Richard Leong     NEW YORK  July 1 U.S. Treasuries prices fell on Wednesday as hopes of a Greece debt deal pared safehaven bids for U.S. government bonds and a stronger-than-expected report on private jobs growth revived bets on a Federal Reserve rate hike later this year.     A poor five-year German Bobl",
        "date": "07012015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "TREASURIES-U.S. bonds slump on Greece  ADP jobs data "
    },
    {
        "content": "July 1 Wall Street was set to open higher on Wednesday after Greek Prime Minister Alexis Tsipras signaled he was prepared to accept creditors' bailout offer with some conditions.",
        "date": "07012015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "RPT-US STOCKS-Wall St set to open higher on renewed Greece hopes "
    },
    {
        "content": "* Futures up: Dow 160 pts  S&P 16.25 pts  Nasdaq 37.50 pts   (Adds comment  updates prices)",
        "date": "07012015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St set to open higher on renewed Greece hopes "
    },
    {
        "content": "NEW YORK  July 1 U.S. Treasuries yields rose to session highs early Wednesday as a stronger-than-forecast rise in a measure of private U.S. jobs growth rekindled bets the Federal Reserve would raise interest rates later this year.",
        "date": "07012015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "TREASURIES-U.S. yields hit session highs after ADP jobs data "
    },
    {
        "content": "NEW YORK  June 3 The U.S. trade deficit narrowed in April on a drop in imports  which surged in March following the end of a West Coast ports labor dispute  while companies picked up their hiring in May after a pullback the previous month.",
        "date": "06032015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "WRAPUP 3-U.S. trade  jobs data encouraging; services sector disappoints "
    },
    {
        "content": "* Private employers added 201 000 jobs in May vs est. 200 000",
        "date": "06032015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "CORRECTED-US STOCKS-Wall St set to open up on strong ADP jobs data "
    },
    {
        "content": "NEW YORK U.S. private employers added 201 000 jobs in May  compared with a downwardly revised 165 000 jobs in April which were the fewest since January 2014  a report by a payrolls processor showed on Wednesday.",
        "date": "06032015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 201 000 jobs in May: ADP "
    },
    {
        "content": "NEW YORK U.S. private employers added 169 000 jobs last month  the fewest since January 2014 and far below economists' expectations  a report by a payrolls processor showed on Wednesday.",
        "date": "05062015",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "U.S. private sector adds 169 000 jobs in April: ADP "
    },
    {
        "content": "* ADP data on U.S. private hiring below economists' forecasts     * European shares close higher  except Greece     * U.S. Treasuries up on bets on slower move by Fed on rates     * Oil rallies after stock build data  as talks on Iran continue      By Sinead Carew     NEW YORK  April 1 U.S. stocks fell for a second day on Wednesday and the dollar dipped after weak U.S. private sector employment and manufacturing data fed worries about the U.S. economy ahead of a highly anticipated jo",
        "date": "04012015",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "GLOBAL MARKETS-Wall Street  dollar fall on economic worry; oil up "
    },
    {
        "content": "* Indexes down: Dow 0.4 pct  S&P 0.4 pct  Nasdaq 0.4 pct   (Updates to close)",
        "date": "04012015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St falls after data; automakers decline "
    },
    {
        "content": "* Yen rises on soft Japanese business sentiment data   (Updates with late New York market action)",
        "date": "04012015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "FOREX-Dollar retreats on weak data as fresh quarter begins "
    },
    {
        "content": "* ADP data on U.S. private hiring below economists' forecasts     * European shares close higher  except Greece     * U.S. Treasuries up on bets on slower move by Fed on rates     * Oil rallies after stock build data  as talks on Iran continue      By Sinead Carew     NEW YORK  April 1 U.S. stocks fell for a second straight day on Wednesday and the dollar dipped after weaker-than-expected private sector employment data spurred concerns that the keenly awaited monthly U.S. jobs report",
        "date": "04012015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "GLOBAL MARKETS-Wall Street  dollar fall after private jobs data; oil up "
    },
    {
        "content": "* Silver rises most among precious metals in Q1  up 6 pct   (Updates prices  adds comment)",
        "date": "04012015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "PRECIOUS-Gold jumps after downbeat March  awaits U.S. jobs data "
    },
    {
        "content": "* Indexes down: Dow 0.4 pct  S&P 0.4 pct  Nasdaq 0.6 pct   (Updates to early afternoon)",
        "date": "04012015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St falls after data; first quarter's winners dip "
    },
    {
        "content": "* Indexes down: Dow 0.4 pct  S&P 0.4 pct  Nasdaq 0.6 pct   (Adds ISM data)",
        "date": "04012015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St falls after data; first quarter's winners weaken "
    },
    {
        "content": "* Yen firmer as weak Tokyo shares weigh on risk sentiment   (Update markets action  change dateline  previous LONDON)",
        "date": "04012015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "FOREX-Dollar retreats on weak data as new quarter begins "
    },
    {
        "content": "* Indexes down: Dow 0.4 pct  S&P 0.3 pct  Nasdaq 0.3 pct   (Updates to market open)",
        "date": "04012015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St edges lower after ADP report "
    },
    {
        "content": "* Futures down: Dow 60 pts  S&P 8 pts  Nasdaq 14.5 pt   (Updates trading  adds data  analyst comment)",
        "date": "04012015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Futures point to lower open after ADP report "
    },
    {
        "content": "NEW YORK U.S. stocks closed down on Wednesday for the second day in a row as investors stepped back after a recent rally ahead of jobs data due later in the week.",
        "date": "03042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Wall Street down for second day after rally; healthcare gains "
    },
    {
        "content": "* Indexes off: Dow 0.47 pct  S&P 0.4 pct  Nasdaq 0.18 pct   (Updates to late morning  adds healthcare moves)",
        "date": "03042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall Street lower for 2nd day; healthcare is sole gainer "
    },
    {
        "content": "NEW YORK U.S. private employers added fewer jobs than expected last month  with the gains declining as well from January's revised level as growth slowed in some sectors  a payrolls processor report showed on Wednesday. | Video ",
        "date": "03042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds jobs in February  but growth slows: ADP "
    },
    {
        "content": "NEW YORK  March 4 U.S. private employers added fewer jobs than expected last month  with the gains declining as well from January's revised level as growth slowed in some sectors  a payrolls processor report showed on Wednesday.",
        "date": "03042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 2-U.S. private sector adds jobs in February  but growth slows -ADP "
    },
    {
        "content": "* Indexes off: Dow 0.69 pct  S&P 0.64 pct  Nasdaq 0.38 pct   (Updates to late morning  adds data)",
        "date": "03042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall Street lower for 2nd day after rally  data "
    },
    {
        "content": "* Indexes off: Dow 0.54 pct  S&P 0.56 pct  Nasdaq 0.48 pct   (Updates to market open)",
        "date": "03042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St opens lower after ADP; services data on tap "
    },
    {
        "content": "NEW YORK  March 4 U.S. private employers added fewer jobs than expected last month  declining as well from January's revised figure as employment growth slowed in some sectors  a payrolls processor report showed on Wednesday.",
        "date": "03042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 1-U.S. private sector adds jobs in February  but growth slows -ADP "
    },
    {
        "content": "* Futures off: Dow 46 pts  S&P 5.75 pts  Nasdaq 10 pts   (Adds quote  data)",
        "date": "03042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St to open lower after ADP; services data on tap "
    },
    {
        "content": "NEW YORK  March 4 U.S. private employers added 212 000 jobs last month  lower than market expectations as well as January's revised figure  a payrolls processor report showed on Wednesday.",
        "date": "03042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 212 000 jobs in February -ADP "
    },
    {
        "content": "* Indexes: Dow up 0.04 pct  S&P down 0.4 pct  Nasdaq down 0.2 pct   (Updates to close)",
        "date": "02042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St ends lower with oil prices  renewed Greece worries "
    },
    {
        "content": "* Indexes: Dow up 0.1 pct  S&P off 0.3 pct  Nasdaq down 0.1 pct   (Updates to afternoon)",
        "date": "02042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-S&P  Nasdaq slip after 2-day run up; energy drops with oil "
    },
    {
        "content": "* Indexes: Dow up 0.1 pct  S&P off 0.4 pct  Nasdaq down 0.2 pct   (Updates to midday  changes byline)",
        "date": "02042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-S&P  Nasdaq down after 2-day run up; biotechs  energy fall "
    },
    {
        "content": "* Indexes: Dow up 0.16 pct  S&P off 0.22 pct  Nasdaq 0.31 pct   (Adds ISM services data)",
        "date": "02042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St dips after 2-day run as energy rally stalls "
    },
    {
        "content": "* Indexes off: Dow 0.2 pct  S&P 0.47 pct  Nasdaq 0.59 pct   (Updates to market open)",
        "date": "02042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St down after 2-day run after ADP as energy drags "
    },
    {
        "content": "* Futures off: Dow 18 pts  S&P 6.25 pts  Nasdaq 14.5 pts   (Adds ADP data  quote)",
        "date": "02042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Wall St to open lower after 2-day run  ADP data "
    },
    {
        "content": "NEW YORK  Feb 4 U.S. Treasuries yields rose on Wednesday after the January reading on a gauge on U.S. private jobs creation supported the view of steady domestic employment growth and revived bets the Federal Reserve might raise interest rates in mid-2015.",
        "date": "02042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "TREASURIES-U.S. yields jump after ADP U.S. jobs data "
    },
    {
        "content": "U.S. private employers added 213 000 jobs in January  falling short of the median forecasts of analysts  a payrolls processor report showed on Wednesday.",
        "date": "02042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private sector adds 213 000 workers in January: ADP "
    },
    {
        "content": "NEW YORK  Feb 4 U.S. stock index futures dipped on Wednesday  after a two-day rally for the S&P 500 ahead of data on the labor market and the services sector.",
        "date": "02042015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Futures dip after 2-day run; ADP data on tap "
    },
    {
        "content": "NEW YORK U.S. stocks rebounded on Wednesday from five straight sessions of losses after strong private sector jobs data and as minutes from the most recent Federal Reserve meeting reassured investors the bank was in no hurry to start raising interest rates. | Video ",
        "date": "01072015",
        "name": "Automatic Data Processing Inc",
        "news_type": "topStory",
        "symbol": "ADP",
        "title": "Wall Street up more than 1 percent  boosted by jobs data  Fed "
    },
    {
        "content": "NEW YORK U.S. private employers added 241 000 jobs in December  beating the median forecasts of analysts and bringing their annual hiring to 2.5 million for 2014  a report by a payrolls processor showed on Wednesday.",
        "date": "01072015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "U.S. private job growth accelerates in December: ADP "
    },
    {
        "content": "NEW YORK  Jan 7 U.S. private employers added 241 000 jobs in December  beating the median forecasts of analysts and bringing their annual hiring to 2.5 million for 2014  a report by a payrolls processor showed on Wednesday.",
        "date": "01072015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "UPDATE 1-U.S. private job growth accelerates in December -ADP "
    },
    {
        "content": "NEW YORK  Jan 7 U.S. stock index futures rose on Wednesday  putting Wall Street on track to bounce from a five-day slide  ahead of data on the labor market and the minutes from the most recent meeting of the U.S. Federal Reserve.",
        "date": "01072015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "US STOCKS-Futures higher after 5-day slide; ADP on tap "
    },
    {
        "content": "LONDON  Jan 7 The euro fell to a new nine-year low against the dollar on Wednesday after data showed the euro zone prices falling for the first time since 2009  piling pressure on the European Central Bank to take bold policy action.",
        "date": "01072015",
        "name": "Automatic Data Processing Inc",
        "news_type": "normal",
        "symbol": "ADP",
        "title": "FOREX-Euro hits 9-yr low as euro zone prices fall for first time since 2009 "
    }
]