[
    {
        "content": "* Takes share stake of 7.7 million shares in Redfin Corp - SEC filing",
        "date": "11142017",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "BRIEF-Tiger Global Management takes share stake in Redfin  Weibo  Autodesk "
    },
    {
        "content": "* Autodesk Inc sees Q3 Non-GAAP loss per share ‍$0.12 - $0.16​",
        "date": "08242017",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "BRIEF-Autodesk Q2 GAAP loss/share $0.66 "
    },
    {
        "content": "* Sachem head capital management lp cuts stake in autodesk inc to 3.0 percent as of june 21 from 5.8 percent as of june 19 - sec filing",
        "date": "06222017",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "BRIEF-Sachem Head Capital cuts stake in Autodesk to 3.0 pct from 5.8 pct "
    },
    {
        "content": "* Autodesk Inc says Andrew Anagnost will also join Autodesk's board of directors",
        "date": "06192017",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "BRIEF-Autodesk names Andrew Anagnost president and CEO "
    },
    {
        "content": "* Files for potential debt shelf; size not disclosed - SEC filing",
        "date": "05182017",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "BRIEF-Autodesk files for potential debt shelf "
    },
    {
        "content": "* Autodesk - on April 26  co  Citibank NA  Bank of America NA  among others entered into letter amendment No. 1 to amended credit agreement dated May 29  2015",
        "date": "04282017",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "BRIEF-Autodesk says co  Citibank  Bank of America entered into amendment to credit agreement "
    },
    {
        "content": "BOSTON  Feb 14 Hedge fund manager Scott Ferguson  who has been a director on the board of design software maker Autodesk for nearly year  plans to leave the board as soon as a new chief executive is selected.",
        "date": "02142017",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "Sachem Head's Ferguson to exit Autodesk board  fund gains -letter "
    },
    {
        "content": "* Autodesk agreed Richard Hill shall not be required to resign from board - SEC filing",
        "date": "02072017",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "BRIEF-Sachem Head Capital says agreed to certain standstill restrictions with Autodesk "
    },
    {
        "content": "Software maker Autodesk Inc said on Tuesday that Chief Executive Carl Bass would step down  less than a year after it struck a deal with two activist investors agitating for changes at the company.",
        "date": "02072017",
        "name": "Autodesk Inc",
        "news_type": "normal",
        "symbol": "ADSK",
        "title": "Autodesk to name new CEO  extend deal with activist "
    },
    {
        "content": "Feb 7 Software maker Autodesk Inc said on Tuesday that Chief Executive Carl Bass would step down  less than a year after it struck a deal with two activist investors agitating for changes at the company.",
        "date": "02072017",
        "name": "Autodesk Inc",
        "news_type": "normal",
        "symbol": "ADSK",
        "title": "UPDATE 1-Autodesk to name new CEO  extend deal with activist "
    },
    {
        "content": "Feb 7 Software maker Autodesk Inc said Chief Executive Carl Bass would step down and two board members nominated by activist investor Sachem Head Capital would resign.",
        "date": "02072017",
        "name": "Autodesk Inc",
        "news_type": "normal",
        "symbol": "ADSK",
        "title": "Autodesk CEO  two investor-nominated directors to step down "
    },
    {
        "content": "* Carl Bass has decided to step down as president and chief executive officer  effective February 8",
        "date": "02072017",
        "name": "Autodesk Inc",
        "news_type": "normal",
        "symbol": "ADSK",
        "title": "BRIEF-Autodesk says CEO to step down  announces board changes "
    },
    {
        "content": "* Q3 earnings per share view $-0.24 -- Thomson Reuters I/B/E/S",
        "date": "11292016",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "BRIEF-Autodesk reports Q3 GAAP loss per share $0.64 "
    },
    {
        "content": "* Imaginit Technologies acquires Autodesk business from Eagle Point Software  Further company coverage:",
        "date": "11072016",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "BRIEF-Imaginit Technologies acquires Autodesk business "
    },
    {
        "content": "* Rib Software AG (RIB) and Autodesk achieve a breakthrough partnership to advance the fully integrated end-to-end 5D BIM enterprise solution for the AEC industry",
        "date": "10252016",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "BRIEF-RIB and Autodesk achieve a breakthrough partnership "
    },
    {
        "content": "* Says to repurchase up to 30 million shares of company's common stock",
        "date": "09192016",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "BRIEF-Autodesk increases share repurchase program "
    },
    {
        "content": "* Q2 earnings per share view $-0.13 -- Thomson Reuters I/B/E/S",
        "date": "08252016",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "BRIEF-Autodesk Q2 loss per share $0.44 "
    },
    {
        "content": "* Autodesk and Trimble sign agreement to increase interoperability  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06142016",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "BRIEF-Autodesk and Trimble sign agreement to increase interoperability "
    },
    {
        "content": "* Autodesk announces new developer offerings and investments to fuel forge platform  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06152016",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "BRIEF-Autodesk announces new developer offerings and investments to fuel forge platform "
    },
    {
        "content": "* Autodesk has appointed BIMobject its exclusive reseller in North America and Europe for new subscriptions of Autodesk Seek",
        "date": "05202016",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "BRIEF-Bimobject appointed exclusive reseller for Autodesk in North America and Europe "
    },
    {
        "content": "Autodesk Inc  reported lower-than-expected quarterly revenue as the design software maker transitions to a subscription model.",
        "date": "05192016",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "Autodesk revenue misses as it moves to cloud "
    },
    {
        "content": "May 19 Autodesk Inc reported lower-than-expected quarterly revenue as the design software maker transitions to a subscription model.",
        "date": "05192016",
        "name": "Autodesk Inc",
        "news_type": "normal",
        "symbol": "ADSK",
        "title": "UPDATE 1-Autodesk revenue misses as it moves to cloud "
    },
    {
        "content": "* Total subscriptions increased 132 000 from q4 of fiscal 2016 to 2.71 million at end of q1",
        "date": "05192016",
        "name": "Autodesk Inc",
        "news_type": "normal",
        "symbol": "ADSK",
        "title": "BRIEF-Autodesk Q1 adjusted loss per share $0.10 "
    },
    {
        "content": "May 19 Autodesk Inc reported a 20.8 percent fall in quarterly revenue as the company moves to a subscription-based model.",
        "date": "05192016",
        "name": "Autodesk Inc",
        "news_type": "normal",
        "symbol": "ADSK",
        "title": "Autodesk revenue falls 20.8 percent "
    },
    {
        "content": "Autodesk Inc said on Friday it had reached a settlement with two activist investors  appointing three directors to its board and avoiding a proxy fight ahead of its annual meeting.",
        "date": "03112016",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "Autodesk settles with activist investors  appoints three directors "
    },
    {
        "content": "March 11 Autodesk Inc said on Friday it had reached a settlement with two activist investors  appointing three directors to its board and avoiding a proxy fight ahead of its annual meeting.",
        "date": "03112016",
        "name": "Autodesk Inc",
        "news_type": "normal",
        "symbol": "ADSK",
        "title": "UPDATE 1-Autodesk settles with activist investors  appoints 3 directors "
    },
    {
        "content": "March 11 AutoCAD design software maker Autodesk Inc said on Friday it had reached a settlement with activist investors Eminence Capital LP and Sachem Head Capital  and appointed three directors to its board.",
        "date": "03112016",
        "name": "Autodesk Inc",
        "news_type": "normal",
        "symbol": "ADSK",
        "title": "Autodesk settles with activist investors  appoints 3 directors "
    },
    {
        "content": "AutoCAD design software maker Autodesk Inc  said it would cut about 10 percent of its workforce in the near term as part of a restructuring plan to accelerate its transition to the subscription-based cloud business.",
        "date": "02032016",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "Autodesk to cut jobs by 10 percent as it transitions to cloud "
    },
    {
        "content": "* Shares rise as much as 11 pct   (Adds shares  analyst comment  details)",
        "date": "02032016",
        "name": "Autodesk Inc",
        "news_type": "normal",
        "symbol": "ADSK",
        "title": "UPDATE 2-Autodesk to cut jobs by 10 pct as it transitions to cloud "
    },
    {
        "content": "Feb 3 AutoCAD software maker Autodesk Inc  said it would cut about 925 jobs  or 10 percent of its workforce  in the near term as part of a restructuring plan to accelerate transition to its cloud business.",
        "date": "02032016",
        "name": "Autodesk Inc",
        "news_type": "normal",
        "symbol": "ADSK",
        "title": "Autodesk to cut 10 pct of workforce "
    },
    {
        "content": "* Says Cad-Q sells as part of its offering software from Autodesk Inc.  which has decided to change its business model to a subscription form",
        "date": "10142015",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "BRIEF-Addnode: Changes in business model affect subsidiary Cad-Q "
    },
    {
        "content": "NEW YORK  Sept 27 Design-software company Autodesk Inc's shares could jump 50 percent in the next 18 months as investors get more comfortable with the company's transition to a cloud-based business model  according to a Sunday report in Barron's financial newspaper.",
        "date": "09282015",
        "name": "Autodesk Inc",
        "news_type": "normal",
        "symbol": "ADSK",
        "title": "Autodesk's move to cloud could send up stock: Barron's "
    },
    {
        "content": "NEW YORK  Sept 27 Design-software company Autodesk Inc's shares could jump 50 percent in the next 18 months as investors get more comfortable with the company's transition to a cloud-based business model  according to a Sunday report in Barron's financial newspaper.",
        "date": "09282015",
        "name": "Autodesk Inc",
        "news_type": "normal",
        "symbol": "ADSK",
        "title": "UPDATE 1-Autodesk's move to cloud could send up stock: Barron's "
    },
    {
        "content": "Autodesk Inc  the maker of computer-aided design (CAD) software  cut its full-year profit and revenue forecast for the second time this year  sending its shares down 7 percent.",
        "date": "08272015",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "CAD software maker Autodesk's forecast disappoints "
    },
    {
        "content": "* To buy SeeControl  an enterprise Internet of Things platform   (Adds details  CEO comments from conference call)",
        "date": "08272015",
        "name": "Autodesk Inc",
        "news_type": "normal",
        "symbol": "ADSK",
        "title": "UPDATE 2-CAD software maker Autodesk's forecast disappoints "
    },
    {
        "content": "Aug 27 Autodesk Inc  the maker of computer-aided design (CAD) software  reported a 4.3 percent fall in quarterly revenue as its licensing revenue declined because of the company's shift to a cloud subscription-based model.",
        "date": "08272015",
        "name": "Autodesk Inc",
        "news_type": "normal",
        "symbol": "ADSK",
        "title": "CAD software maker Autodesk's revenue falls 4.3 pct "
    },
    {
        "content": "Autodesk Inc   which makes computer-aided design software  forecast lower-than-expected profit and revenue for the second quarter  citing a stronger dollar.",
        "date": "05192015",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "CAD software maker Autodesk forecasts profit below estimates "
    },
    {
        "content": "May 19 Autodesk Inc  which makes computer-aided design software  reported a 32.5 percent fall in quarterly profit  hurt by an increase in operating expenses and cost of revenue.",
        "date": "05192015",
        "name": "Autodesk Inc",
        "news_type": "normal",
        "symbol": "ADSK",
        "title": "CAD software maker Autodesk's profit falls "
    },
    {
        "content": "Autodesk Inc  reported a better-than-expected quarterly revenue as the company's switch to a subscription-based model for its computer-aided design software paid off.",
        "date": "02262015",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "Autodesk revenue beats estimates as subscriptions jump "
    },
    {
        "content": "Feb 26 Autodesk Inc reported a 13.3 percent rise in quarterly revenue  as the company benefits from its move to a subscription-based revenue model for its computer-aided design software.",
        "date": "02262015",
        "name": "Autodesk Inc",
        "news_type": "normal",
        "symbol": "ADSK",
        "title": "Autodesk revenue rises on higher subscribers "
    },
    {
        "content": "* Schneider Electric and Autodesk Inc announce the signature of a memorandum of understanding",
        "date": "01212015",
        "name": "Autodesk Inc",
        "news_type": "topStory",
        "symbol": "ADSK",
        "title": "BRIEF-Schneider Electric and Autodesk team up for building lifecycle management "
    }
]