[
    {
        "content": "* ‍AEGON CHOOSES WOLTERS KLUWER'S ONESUMX FOR OPERATIONAL RISK FOR ITS OPERATIONAL RISK MANAGEMENT​ Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "11132017",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Wolters Kluwer says ‍Aegon chooses co's OneSumX for Operational Risk for its operational risk mgmt​ "
    },
    {
        "content": "AMSTERDAM  Nov 9 Dutch insurer Aegon reported a 20 percent rise in third-quarter underlying pretax profit to 556 million euros ($645 million) thanks to fewer claims  higher fee revenues  and lower expenses in the United States  where it does two-thirds of its business.",
        "date": "11092017",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "UPDATE 1-Insurer Aegon outperforms on earnings  boosts solvency ratio "
    },
    {
        "content": "* Q3 RETURN ON EQUITY  8.9 PERCENT VERSUS 7.7 PERCENT YEAR AGO‍​",
        "date": "11092017",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon Q3 income before tax up at 618 million euros  above consensus "
    },
    {
        "content": "AMSTERDAM  Nov 9 Dutch insurer Aegon on Thursday reported a 20 percent rise in third-quarter underlying pretax profit to 556 million euros ($645 million) on fewer claims  higher fee revenues  and lower expenses in the United States  where it does two-thirds of its business.",
        "date": "11092017",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Insurer Aegon posts better-than-expected rise in Q3 pretax profit "
    },
    {
        "content": "AMSTERDAM  Oct 20 Shares of Dutch insurer ASR spiked in afternoon trading on Friday after Bloomberg reported that Aegon had approached the company for a possible takeover but was rebuffed.",
        "date": "10202017",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "UPDATE 2-ASR shares jump on report it rebuffed Aegon "
    },
    {
        "content": "AMSTERDAM  Oct 20 Shares of Dutch insurer ASR jumped briefly in afternoon trading on Friday after Bloomberg reported that Aegon had approached the company for a possible takeover but was rebuffed.",
        "date": "10202017",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "ASR shares jump on report it rebuffed Aegon "
    },
    {
        "content": "* Announces repurchase of shares to neutralize 2016 final and 2017 interim stock dividends",
        "date": "09282017",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon announces share repurchase to neutralize 2016 final and 2017 interim stock dividends "
    },
    {
        "content": "AMSTERDAM  Aug 10 Dutch insurer Aegon on Thursday beat market forecasts with a 23 percent increase in underlying pretax profit and said it had boosted its capital buffer.",
        "date": "08102017",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "UPDATE 1-Dutch insurer Aegon lifts profit  capital position "
    },
    {
        "content": "* ‍HAS AGREED TO SELL UNIROBE MEEÙS GROEP (UMG) TO AON GROEP NEDERLAND FOR EUR 295 MILLION​",
        "date": "08082017",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon to sell Unirobe Meeus Groep "
    },
    {
        "content": "NEW YORK/LONDON  Aug 10 British insurance entrepreneur Clive Cowdery is raising money for a fourth investment vehicle  at the same time as his third  U.S.-focused fund is being wound down and its sole asset put up for sale  sources aware of the matter told Reuters.",
        "date": "08102017",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Insurance veteran Cowdery raising money for Bermuda fund-sources "
    },
    {
        "content": "* Q2 SALES EUR ‍​3.94 BILLION VERSUS EUR 2.77 BILLION YEAR AGO",
        "date": "08102017",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon Q2 income before tax returns to profit at 757 million euros  beating Reuters poll "
    },
    {
        "content": "* AGREED TO SELL AEGON IRELAND PLC TO AGER BERMUDA HOLDING LTD",
        "date": "08102017",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon to divest its business in Ireland "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON/NEW YORK  August 03 (Fitch) Fitch Ratings has affirmed Aegon NV's (Aegon) primary North American life insurance subsidiaries' (referred here as Aegon Americas) and Edinburgh-based Scottish Equitable Plc's Insurer Financial Strength (IFS) Ratings at 'A+' (Strong) and Aegon's Long-Term Issuer Default Rating (IDR) at 'A-'. The Outlooks are Stable. A full list of ratings is available at the end of this commentary. KEY RATING DRIVERS ",
        "date": "08032017",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Fitch Affirms Aegon's IFS Ratings at 'A+'; Outlooks Stable "
    },
    {
        "content": "* UNDER TERMS OF AGREEMENT  AEGON'S TRANSAMERICA LIFE SUBSIDIARIES WILL REINSURE USD 14 BILLION OF LIABILITIES TO AFFILIATES OF WILTON RE US HOLDING INC",
        "date": "06292017",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon completes sale of majority of US run-off businesses "
    },
    {
        "content": "AMSTERDAM  June 28 Dutch insurer Aegon inadequately disclosed the costs of three types of investment-linked insurance policies between 1989 and 2004  a Dutch court ruled on Wednesday.",
        "date": "06282017",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Court says Aegon must compensate some clients on investment-linked policies "
    },
    {
        "content": "Twice Wimbledon champion Petra Kvitova continued her comeback on grass with a 6-2 6-2 win over British wildcard Naomi Broady at the Aegon Classic on Wednesday.",
        "date": "06212017",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Kvitova into Birmingham quarters after straight sets win "
    },
    {
        "content": "Top seed Dan Evans has withdrawn from the Aegon Open in Nottingham due to a calf injury but hopes to be fit for the upcoming Queen's Club tournament and the Wimbledon  starting on July 3.",
        "date": "06132017",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Evans withdraws from Aegon Open due to injury "
    },
    {
        "content": "AMSTERDAM  May 22 Aegon  the Dutch-based insurer that does most of its business in the United States  said on Monday it would sell some U.S. operations to Wilton Re to boost its financial strength under Europe's new Solvency II regime for insurers.",
        "date": "05222017",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Aegon sells some U.S. operations to boost solvency "
    },
    {
        "content": "* HAS AGREED TO SELL ITS TWO LARGEST US RUN-OFF BUSINESSES  PAYOUT ANNUITY BUSINESS AND BANK OWNED / CORPORATE OWNED LIFE INSURANCE BUSINESS (BOLI/COLI)  TO WILTON RE",
        "date": "05222017",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon to divest majority of US run-off businesses "
    },
    {
        "content": "AMSTERDAM Aegon   the Dutch insurer that does most of its business in the United States  on Thursday reported first-quarter net income of 378 million euros ($411 million)  helped by the performance of its investment portfolio.",
        "date": "05112017",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Dutch insurer Aegon profits rise  shares sink on solvency concerns "
    },
    {
        "content": "AMSTERDAM  May 11 Aegon  the Dutch insurer that does most of its business in the United States  on Thursday reported first-quarter net income of 378 million euros ($411 million)  helped by the performance of its investment portfolio.",
        "date": "05112017",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "UPDATE 2-Dutch insurer Aegon profits rise  shares sink on solvency concerns "
    },
    {
        "content": "AMSTERDAM  May 11 Aegon  the Dutch insurer that does most of its business in the United States  on Thursday reported stronger than expected first-quarter net income of 378 million euros ($411 million)  helped by the performance of its investment portfolio.",
        "date": "05112017",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Dutch insurer Aegon's net income rises in first-quarter "
    },
    {
        "content": "* Q1 UNDERLYING EARNINGS BEFORE TAX EUR 488 MILLION ($530.21 MILLION) VERSUS EUR 462 MILLION YEAR AGO",
        "date": "05112017",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon Q1 underlying earnings before tax up at 488 million euros "
    },
    {
        "content": "MILAN  March 24 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "03242017",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Aegon tumbles to 3-month low as European shares extend losses. For more see the LiveMarkets blog "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON/NEW YORK  March 02 (Fitch) Fitch Ratings has affirmed Aegon's primary  North American life insurance subsidiaries' (referred here as Aegon Americas)  and Edinburgh-based Scottish Equitable Plc's Insurer Financial Strength (IFS)  Ratings at 'A+' and Aegon N.V's (Aegon) Long-Term Issuer Default Rating (IDR) at  'A-'. The Outlooks are Stable. Fitch has simultaneously withdrawn the ratings of Transamerica Life  International (Bermuda",
        "date": "03022017",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Fitch Affirms Aegon's IFS Ratings at 'A+'; Outlooks Stable "
    },
    {
        "content": "* Would like to clarify its capital position in United States",
        "date": "02172017",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon clarifies its capital position in US "
    },
    {
        "content": "* Live coverage: cpurl://apps.cp./cms/?pageId=livemarkets   (Adds details  updates prices)",
        "date": "02172017",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "European shares retreat after week of gains; Allianz rallies after update "
    },
    {
        "content": "* The dividend is well covered despite no dividend from the Netherlands and the UK- conf call   Further company coverage:   (Gdynia Newsroom)",
        "date": "02172017",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon div well covered despite no divs from Netherlands  UK - conf call "
    },
    {
        "content": "* Q4 sales 2.73 billion euros ($2.91 billion) versus 2.89 billion euros year ago",
        "date": "02172017",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "REFILE-BRIEF-Aegon Q4 underlying earnings up 27 pct at 554 million euros "
    },
    {
        "content": "AMSTERDAM  Feb 17 Insurer Aegon on Friday reported a better-than-expected underlying pretax profit of 554 million euros ($591 million) for the fourth quarter  up 27 percent on the same period a year earlier  citing cost-cutting and lower claims.",
        "date": "02172017",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Aegon reports 27 percent rise in Q4 pretax profit "
    },
    {
        "content": "* Extends partnership with Auxmoney  leader in financial inclusion",
        "date": "01262017",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon extends partnership with Auxmoney "
    },
    {
        "content": "MIAMI  Dec. 13 (Thomson Reuters Regulatory Intelligence) - The National Association of Insurance Commissioners has elected Michael Consedine  senior vice president and global head of government and policy affairs at Aegon as its chief executive officer  effective in early 2017. He takes over the organization as it prepares for what he called an \"absolutely dynamic\" environment under U.S. President-elect Donald Trump and his promised era of deregulation.",
        "date": "12132016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "State insurance commissioners pick Aegon executive as NAIC chief; \"dynamic\" regulatory era looms "
    },
    {
        "content": "* Higher U.S. interest rates  less regulation seen as positives",
        "date": "11102016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "UPDATE 2-Aegon soars after Q3 earnings  \"Trump effect\" improves outlook "
    },
    {
        "content": "AMSTERDAM Dutch insurer Aegon NV  reported a fall in third-quarter earnings on Thursday  as higher life insurance claims in the United States outweighed benefits from cost-cutting.",
        "date": "11102016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Aegon posts lower third-quarter profit  narrowly beats expectations "
    },
    {
        "content": "AMSTERDAM  Nov 10 Aegon NV on Thursday reported a fall in third-quarter earnings  as the negative impact from lower interest rates and lower death rates in the U.S. outweighed benefits from cost-cutting and favourable equity markets.",
        "date": "11102016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Aegon posts lower Q3 profit  but beats expectations "
    },
    {
        "content": "* Reports net income of 358 million euros  ($391.51 million) in Q3 2016",
        "date": "11102016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon reports Q3 net income of 358 million euros "
    },
    {
        "content": "* Signs 13 year contract with Aegon in UK  Source text: http://bit.ly/2dIP5q1 Further company coverage:    (Gdynia Newsroom)",
        "date": "10172016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Atos signs 13 year contract with Aegon in UK "
    },
    {
        "content": "* Will repurchase 30 765 224 common shares to neutralize dilutive effect of 2016 interim stock dividend  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom:)",
        "date": "10032016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon to repurchase 30 765 224 common shares "
    },
    {
        "content": "* Has entered into an agreement to sell 100% of its shares of Aegon Life Ukraine to TAS group  and will exit the Ukrainian market.",
        "date": "09222016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon to sell 100% of its shares of Aegon Life Ukraine to TAS group "
    },
    {
        "content": "* Announces that chief financial officer Darryl Button will leave company on Dec. 1  2016.  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "09062016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon CFO Darryl Button to leave company "
    },
    {
        "content": "AMSTERDAM  Aug 11 Dutch-based insurer Aegon NV  is reviewing parts of its  business in the United States  it said on Thursday  after reporting second-quarter earnings that missed estimates  partly due to adverse claims in the U.S.",
        "date": "08112016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "UPDATE 1-Aegon 2nd-quarter earnings miss forecasts  reviews U.S. operations "
    },
    {
        "content": "* Announces acquisition of Cofunds from Legal & General  for GBP 140 million (164 million euros)",
        "date": "08112016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "RPT-BRIEF-Aegon acquires Cofunds from Legal & General for 140 mln stg "
    },
    {
        "content": "AMSTERDAM  Aug 11 Dutch-based insurer Aegon NV  on Thursday reported second-quarter earnings below estimates  citing heavier-than-expected claims at its large U.S. business.",
        "date": "08112016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Aegon Q2 earnings miss on higher U.S. claims "
    },
    {
        "content": "* Q2 net  loss of 385 million euros ($429.81 million) due to book loss on  divestment of  UK annuity book and fair value items",
        "date": "08112016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon Q2 underlying earnings before tax miss Reuters poll "
    },
    {
        "content": "* Announces acquisition of Cofunds from Legal & General for GBP 140 million (164 million euros)",
        "date": "08112016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon acquires Cofunds "
    },
    {
        "content": "* Accenture acquires MOBGEN expanding end-to-end digital services",
        "date": "07192016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Accenture buys end-to-end digital services company MOBGEN "
    },
    {
        "content": "* Aegon announced in Q2 divestment of its GBP 9 billion  ($11.77 billion) annuity portfolio in United Kingdom through two transactions  to Rothesay Life and Legal & General",
        "date": "07122016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon gives update on divestment of its GBP 9 billion annuity portfolio in UK "
    },
    {
        "content": "* Aegon announces repurchase of shares to neutralize final stock dividend",
        "date": "07042016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon announces repurchase of shares to neutralize final stock dividend "
    },
    {
        "content": "LONDON Andy Murray became the first player to hold aloft the super-sized Queen's Club trophy for a fifth time after he beat big-serving Canadian Milos Raonic 6-7(5) 6-4 6-3 in the final of the Aegon Championships on Sunday.",
        "date": "06192016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Murray downs Raonic to win record fifth Queen's title "
    },
    {
        "content": "Andy Murray's renewed partnership with Ivan Lendl got off to a winning start on Sunday and the Briton said the American coach was impressed with his battling qualities as he rallied to lift the Queen's Club trophy for a record fifth time.",
        "date": "06202016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Murray impresses Lendl with fighting spirit at Queen's "
    },
    {
        "content": "LONDON Luxembourg's Gilles Muller produced an astonishing Houdini act to reach the quarter-finals of the Aegon Championships  saving 10 match points to beat seventh seed John Isner on Thursday.",
        "date": "06162016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Escapologist Muller saves 10 match points to beat Isner "
    },
    {
        "content": "LONDON Frenchman Paul-Henri Mathieu has withdrawn from the Aegon Championships at Queen's Club because of a wrist injury  meaning British wildcard Kyle Edmund is through to the quarter-finals.",
        "date": "06162016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Mathieu withdraws from Queen's  Edmund into quarters "
    },
    {
        "content": "* Aegon OFE acquired 7.1 percent stake in company  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "06072016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon OFE acquires 7.1 pct stake in Auto Partner "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  May 23 (Fitch) Fitch Ratings says Legal & General Group Plc's (L&G; IFS:  AA-) ratings are not affected by its announced acquisition of GBP3bn of  annuities from Aegon N.V. (IFS: AA-) L&G announced the purchase of GBP3bn annuities from Aegon this morning   initially structured as a reinsurance contract that will be followed by a \"Part  VII transfer\" of the policies to L&G from Aegon. The acquisition is in line with  L&G's strate",
        "date": "05232016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Fitch: L&G's Ratings Unaffected by Purchase of Annuities From Aegon "
    },
    {
        "content": "AMSTERDAM Britain's Legal & General Group  said on Monday it will buy 3 billion pounds ($4.4 billion) of annuity liabilities from Dutch insurer Aegon .",
        "date": "05232016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "L&G picks up Aegon's remaining UK annuities business "
    },
    {
        "content": "AMSTERDAM  May 23 Britain's Legal & General Group said on Monday it will buy 3 billion pounds ($4.4 billion) of annuity liabilities from Dutch insurer Aegon .",
        "date": "05232016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "UPDATE 1-L&G picks up Aegon's remaining UK annuities business "
    },
    {
        "content": "LONDON  May 23 Legal & General Group  said on Monday it has bought a 3 billion pound  ($4.35 billion) UK annuity portfolio from Dutch insurer Aegon NV.",
        "date": "05232016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Legal & General buys 3 bln pound UK annuity portfolio from Aegon "
    },
    {
        "content": "AMSTERDAM  May 23 Dutch insurer Aegon said on Monday that the divestment of its remaining annuities businesses in Britain to Legal and General Group will lead to an improvement of up to 20 percent in its solvency ratio in that country.",
        "date": "05232016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Insurer Aegon says annuities divestment will lift Solvency II rating "
    },
    {
        "content": "May 23 Legal & General Group Plc  acquires 3 billion pound  ($4.35 billion) UK annuity portfolio from Aegon",
        "date": "05232016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Legal & General acquires £3bn uk annuity portfolio from aegon "
    },
    {
        "content": "* Announces sale of 3 billion pound ($4.35 billion) annuity liabilities to Legal & General",
        "date": "05232016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon divests remaining part of UK annuity portfolio "
    },
    {
        "content": "LONDON  May 12 European stocks fell on Thursday as a drop in the shares of major financial companies such as Aegon and Credit Agricole weighed on the region's markets.",
        "date": "05122016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "European shares fall as financial stocks falter "
    },
    {
        "content": "AMSTERDAM Dutch insurer Aegon NV  reported worse-than-expected first-quarter underlying pretax profit of 462 million euros ($527 million) on Thursday  mostly due to weakness at its large U.S. operations.",
        "date": "05122016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Aegon misses first-quarter underlying pretax expectations on weak U.S "
    },
    {
        "content": "AMSTERDAM  May 12 Dutch insurer Aegon NV  reported worse-than-expected first-quarter underlying pretax profit of 462 million euros ($527 million) on Thursday  mostly due to weakness at its large U.S. operations.",
        "date": "05122016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "UPDATE 1-Aegon misses Q1 underlying pretax expectations on weak U.S. "
    },
    {
        "content": "AMSTERDAM  May 12 Aegon NV  the Dutch insurer  reported worse-than-expected first-quarter underlying pretax profit of 462 million euros ($527 million) on Thursday  mostly due to weakness at its large U.S. operations.",
        "date": "05122016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Aegon Q1 underlying pretax profit misses expectations on weak U.S. performance "
    },
    {
        "content": "* Q1 underlying earnings increase to 462 million euro (Reuters poll: 471 million euro)",
        "date": "05122016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon Q1 underlying earnings increase to 462 million "
    },
    {
        "content": "* Aegon to acquire Blackrock's UK Defined Contribution platform and administration business",
        "date": "05032016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon to acquire Blackrock's UK Defined Contribution platform and administration business "
    },
    {
        "content": "LONDON BlackRock   the world's biggest asset manager  on Tuesday said it had agreed to sell its defined contribution pension platform and administration business to Dutch insurer Aegon  for an undisclosed amount.",
        "date": "05032016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Aegon to buy BlackRock's UK pension platform  admin business "
    },
    {
        "content": "* Sees scope for further annuity deals   (Adds source  detail  background)",
        "date": "04112016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "UPDATE 1-Rothesay Life buys $8 bln of Aegon's annuities as profit soars "
    },
    {
        "content": "April 11 British insurance firm Rothesay Life reported a 42 jump in full-year pretax profit on Monday  driven by an increase in new reinsurance and corporate pensions deals.",
        "date": "04112016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Rothesay Life posts FY profit jump  signs annuity deal with Aegon "
    },
    {
        "content": "* Under terms of agreement  Aegon will reinsure 6 billion pounds of liabilities to rothesay life.",
        "date": "04112016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon sells majority of UK annuity portfolio to Rothesay Life "
    },
    {
        "content": "* Aegon announces second tranche of 400 million euro ($455.1 million) share buyback program",
        "date": "04012016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon announces second tranche of 400 mln euro share buyback program "
    },
    {
        "content": "AMSTERDAM Aegon   the Dutch-based insurer  reported lower-than-expected fourth-quarter earnings on Friday  citing lower earnings in the United States where it does two-thirds of its business.",
        "date": "02192016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Insurer Aegon fourth-quarter earnings miss estimates on weak U.S. "
    },
    {
        "content": "AMSTERDAM  Feb 19 Aegon  the Dutch-based insurer  reported lower-than-expected fourth-quarter earnings on Friday  citing lower earnings in the United States where it does two-thirds of its business.",
        "date": "02192016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "UPDATE 1-Insurer Aegon Q4 earnings miss estimates on weak U.S. "
    },
    {
        "content": "* Q4 sales 2.91 billion euros versus 2.12 billion euros ($2.36 billion) year ago",
        "date": "02192016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon Q4 sales up at 2.91 billion euros \u007f\u007f "
    },
    {
        "content": "AMSTERDAM  Feb 19 Aegon  the Dutch-based insurer  on Friday reported a lower-than-expected fourth quarter profit  citing lower earnings in the United States  where it does two-thirds of its business.",
        "date": "02192016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Insurer Aegon Q4 profit misses estimates on lower US earnings "
    },
    {
        "content": "LONDON British insurance firm Rothesay Life is in exclusive talks to buy the 9 billion pound ($13 billion) UK annuity book of Dutch insurer Aegon  a source familiar with the matter said on Friday.",
        "date": "02052016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Rothesay Life in talks to buy Aegon's UK annuity book: source "
    },
    {
        "content": "LONDON  Feb 5 British insurance firm Rothesay Life is in exclusive talks to buy the 9 billion pound ($13 billion) UK annuity book of Dutch insurer Aegon  a source familiar with the matter said on Friday.",
        "date": "02052016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Rothesay Life in talks to buy Aegon's UK annuity book -source "
    },
    {
        "content": "* Says portfolio comprises active commercial portfolio with a total volume of about 90 million euros and two run-off portfolios: authorized agents and co-insurance",
        "date": "01192016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Allianz to buy commercial P&C portfolio from Aegon "
    },
    {
        "content": "* China exports fall much less than expected   (Updates with close of U.S. markets)",
        "date": "01132016",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "GLOBAL MARKETS-U.S. shares tumble; Brent crude slips below $30 "
    },
    {
        "content": "* China exports fall much less than expected   (Updates with opening of U.S. markets; previous dateline London)",
        "date": "01132016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "GLOBAL MARKETS-Wall Street falls sharply; Brent crude dips below $30 "
    },
    {
        "content": "* Aegon jumps after updates; mining stocks in demand   (Adds details  updates prices)",
        "date": "01132016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "European shares come off highs  Aegon rallies "
    },
    {
        "content": "* Aegon jumps after updates; mining stocks in demand   (Updates prices)",
        "date": "01132016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "European shares rally on Chinese data  Aegon leads "
    },
    {
        "content": "LONDON  Jan 13 European equities advanced on Wednesday  led higher by Dutch insurer Aegon following an update on its strategy and targets  with better-than-expected Chinese trade data also soothing investors' fragile sentiment.",
        "date": "01132016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "European shares rally on China data  Aegon leads "
    },
    {
        "content": "* Shares surge  biggest one-day rise since 2012   (Recasts after share rise; adds analyst comment and further details on targets)",
        "date": "01132016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "UPDATE 1-Aegon shares surge on buy-back and divended hike "
    },
    {
        "content": "LONDON  Jan 13 European shares extended the previous session's gains on Wednesday  with better-than-expected Chinese trade data tempering some of the concerns about a slowdown in the world's second largest economy.",
        "date": "01132016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "European shares gain on China data  Aegon jumps after update "
    },
    {
        "content": "AMSTERDAM  Jan 13 Dutch insurance group Aegon  had a solvency ratio of 160 percent at the end of 2015 under Europe's new Solvency II regime  the company said on Wednesday.",
        "date": "01132016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Insurer Aegon says Solvency II ratio was 160 pct at year-end "
    },
    {
        "content": "* New financial targets to deliver on return on equity ambition of 10 pct by 2018",
        "date": "01132016",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon gives strategy update and 2018 financial targets "
    },
    {
        "content": "* Aegon places inaugural 750 million euro ($798.6 million)conditional pass-through covered bond",
        "date": "11242015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon places 750 mln euro conditional pass-through covered bond "
    },
    {
        "content": "AMSTERDAM  Nov 11 Dutch insurer Aegon  on Thursday reported a net loss of 524 million euros ($563.04 million) in the third quarter  due mainly to a book loss on the sale of Canadian activities  slightly missing market expectations.",
        "date": "11122015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "UPDATE 1-Aegon misses market forecasts with net loss "
    },
    {
        "content": "AMSTERDAM  Nov 11 Dutch insurer Aegon  on Thursday reported a net loss of 524 million euros in the third quarter  due mainly to a book loss on the sale of Canadian activities  slightly worse than market expectations.",
        "date": "11122015",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Dutch insurer Aegon reports net loss of 524 million euros "
    },
    {
        "content": "* Q3 sales 2.60 billion euros ($2.80 billion)versus 2.33 billion euros year ago",
        "date": "11122015",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon Q3 net loss in line with expectations "
    },
    {
        "content": "* Aegon acquires Mercer's US defined contribution record-keeping business",
        "date": "09252015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon acquires Mercer's US defined contribution record-keeping business "
    },
    {
        "content": "* Says leaving association of british insurers at end-2015   Further company coverage:",
        "date": "09152015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon UK CEO says leaving Association of British Insurers "
    },
    {
        "content": "* Aegon  RWE fall on results disappointment   (Adds quote  closing prices)",
        "date": "08132015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "European shares rally after China calms markets "
    },
    {
        "content": "* Aegon  RWE fall on results disappointment   (Adds quote  updates prices)",
        "date": "08132015",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "European shares rally after China calms yuan fall "
    },
    {
        "content": "LONDON  Aug 13 European shares bounced on Thursday after a four-percent fall this week  tracking a late rally on Wall Street and gains in Asia on efforts by China's central bank to slow the sharp descent of the yuan that has rocked markets worldwide.",
        "date": "08132015",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "European shares pare losses from China hit "
    },
    {
        "content": "* Raises interim dividend to 12 euro cents per share from 11   (Updates to add Aegon statement on solvency and dividend; notes dividend increased)",
        "date": "08132015",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "UPDATE 1-Aegon Q2 earnings miss forecast; solvency ratio narrows "
    },
    {
        "content": "* Q2 underlying earnings before tax 549 million euros ($611.5 million) versus 514 million euros a year ago",
        "date": "08132015",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon Q2 net income rises to 350 mln euros "
    },
    {
        "content": "Top seed John Isner cruised to his third consecutive Atlanta Open title when he beat hobbled Marcos Baghdatis in straight sets in the final on Sunday.",
        "date": "08022015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Isner beats ailing Baghdatis to win Atlanta title again "
    },
    {
        "content": "* Plans to increase its stake in its India business interest from 26 percent to 49 percent (the highest possible share permitted by a foreign investor under domestic regulations)",
        "date": "07312015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon to rise stake in Indian business interests "
    },
    {
        "content": "* In June  Aegon received approval to change name of its joint venture in China to Aegon THTF Life Insurance Co.  Ltd  or Aegon THTF for short  Source text: http://aegon.me/1Iqo08m Further company coverage:    (Gdynia Newsroom)",
        "date": "07242015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon announces approval for Chinese JV name change to Aegon THTF "
    },
    {
        "content": "LONDON Former Wimbledon champion Rafa Nadal could be heading for a clash with one of his Big Four rivals as early as the fourth round after the Spaniard was seeded 10th for the grasscourt championships on Wednesday.",
        "date": "06242015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Tenth-seeded Nadal lurks as dangerous Wimbledon foe "
    },
    {
        "content": "MELBOURNE Australian Nick Kyrgios has split with a second coach in a year after deciding to part ways with Todd Larkham just days before the start of Wimbledon.",
        "date": "06232015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Australian Kyrgios splits with coach before Wimbledon "
    },
    {
        "content": "LONDON Andy Murray overcame a first-set wobble to keep alive his hopes of a fourth Queen's Club title with a 3-6 7-6 (2) 6-4 quarter-final victory over Luxembourg giant-killer Gilles Muller at the Aegon Championships on Friday.",
        "date": "06192015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Murray overcomes blip to reach Queens Club semis "
    },
    {
        "content": "LONDON Andy Murray eased past Fernando Verdasco at the Aegon Championships on Thursday but an expected quarter-final showdown with the man who beat him at Wimbledon last year was scuppered by Luxembourg left-hander Gilles Muller.",
        "date": "06182015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Murray stays on course for fourth Queen's title "
    },
    {
        "content": "LONDON Britain's Andy Murray won the Aegon Championships at Queen's Club by dismantling big-serving South African Kevin Anderson 6-3 6-4 in a one-sided final on Sunday.",
        "date": "06212015",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Murray outclasses Anderson to take fourth Queen's title "
    },
    {
        "content": "LONDON Kevin Anderson produced a devastating display of serving power to reach the final of the Aegon Championships with a 6-3 6-7(6) 6-3 defeat of gallant Frenchman Gilles Simon at Queen's Club on Saturday.",
        "date": "06202015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Anderson powers into Queen's final  Murray delayed "
    },
    {
        "content": "LONDON Former Wimbledon semi-finalist Angelique Kerber claimed her first grasscourt title with a 6-7(5) 6-3 7-6(4) victory over Czech Karolina Pliskova at the Aegon Classic in Birmingham on Sunday.",
        "date": "06212015",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Kerber claims first grasscourt title "
    },
    {
        "content": "LONDON French Open champion Stanislas Wawrinka was scythed back to earth by big-serving South African Kevin Anderson on the Queen's Club grass as the Swiss bowed out of the Aegon Championships 7-6(4) 7-6(11) on Wednesday.",
        "date": "06172015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Wawrinka cut down by Anderson bombardment "
    },
    {
        "content": "LONDON Former world number one Victoria Azarenka was forced out of the Aegon Classic in Birmingham with a foot injury on Wednesday shortly after defending champion Ana Ivanovic suffered a shock defeat.",
        "date": "06172015",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Azarenka injures foot  Ivanovic loses in Birmingham "
    },
    {
        "content": "LONDON Just when it seemed safe for Rafa Nadal devotees to peer up from behind the sofa the Spaniard suffered another horror show at the hands of Ukrainian spin wizard Alexandr Dolgopolov at Queen's Club on Tuesday.",
        "date": "06162015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Nadal sent packing at Queen's  Wawrinka and Murray win "
    },
    {
        "content": "LONDON Australian trailblazer Nick Kyrgios lasted just 49 minutes against Stanislas Wawrinka at Queen's Club on Tuesday before saying he wanted to forget all about tennis in the run-up to Wimbledon.",
        "date": "06162015",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Struggling Kyrgios wants to switch off "
    },
    {
        "content": "LONDON Defending champion Grigor Dimitrov was locked at one set all with American Sam Querrey in the first round of the Queen's club Wimbledon warm-up tournament when bad light ended play on Monday.",
        "date": "06152015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Dimitrov fights back to level at Queen's  Hewitt out "
    },
    {
        "content": "LONDON Andy Murray has recovered from an illness picked up at the French Open and will begin his preparations for Wimbledon at the Aegon International at Queen's Club next week.",
        "date": "06132015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Murray ready for Queen's despite illness "
    },
    {
        "content": "* Says Aegon and La Banque Postale Asset Management (LBPAM) complete asset management partnership in France",
        "date": "06042015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "BRIEF-Aegon completes asset management partnership with LBPAM "
    },
    {
        "content": "AMSTERDAM  May 13 Aegon  the largest Dutch insurer  said on Wednesday its underlying  pretax earnings fell 6 percent in the first quarter  missing market forecasts  due mainly to higher-than-expected claims in the United States.",
        "date": "05132015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "Dutch insurer Aegon's underlying profit misses expectations "
    },
    {
        "content": "* Underlying earnings before tax aegon's underlying earnings before tax in q1 of 2015 amounted to eur 469 million",
        "date": "05132015",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon says Q1 earnings impacted by adverse claims experience "
    },
    {
        "content": "AMSTERDAM  Feb 19 Dutch insurer Aegon  reported better than expected fourth-quarter earnings on Thursday  boosted by investment gains as the company sold off assets in preparation for Europe's new Solvency II capital rules which come into force next year.",
        "date": "02192015",
        "name": "Aegon NV",
        "news_type": "topStory",
        "symbol": "AEG",
        "title": "UPDATE 1-Aegon's profits up on investment gains  strong dollar "
    },
    {
        "content": "AMSTERDAM  Feb 19 Dutch insurer Aegon  reported better-than-expected earnings on Thursday for the fourth quarter on a mix of growth in its businesses  the stronger U.S. dollar and investment gains.",
        "date": "02192015",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "Aegon Q4 net income rises on investment gains  strong dollar "
    },
    {
        "content": "* In the fourth quarter of 2014  total sales were up 22 percent to eur 2.1 billion",
        "date": "02192015",
        "name": "Aegon NV",
        "news_type": "normal",
        "symbol": "AEG",
        "title": "BRIEF-Aegon Q4 underlying earnings rise 19 pct "
    }
]