[
    {
        "content": "* GOGOLD RESOURCES INC. ANNOUNCES SALE OF SANTA GERTRUDIS PROJECT TO AGNICO EAGLE MINES LIMITED FOR US$80 MILLION",
        "date": "09052017",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "BRIEF-GOGOLD RESOURCES ANNOUNCES SALE OF SANTA GERTRUDIS PROJECT TO AGNICO EAGLE MINES LIMITED FOR $80 MLN "
    },
    {
        "content": "TORONTO  Aug 9 With a plump $3.1 billion pile of cash  Newmont Mining Corp is mulling a sweeter dividend to attract a broader shareholder base  a move that makes it an outlier in the still recovering gold sector.",
        "date": "08092017",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "normal",
        "symbol": "AEM",
        "title": "Cash-rich Newmont Mining mulls boosting dividend as peers pursue debt reduction "
    },
    {
        "content": "* Agnico Eagle reports second quarter 2017 results; strong operational performance continues; full year production guidance increased; nunavut projects advancing on schedule and budget; positive exploration results at multiple projects",
        "date": "07262017",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "BRIEF-Agnico Eagle Mines Q2 earnings per share $0.27 "
    },
    {
        "content": "* Amex Exploration Inc- Agnico Eagle Mines Limited has informed company of its decision to let its option to acquire 51% of Perron Property Lapse Source text for Eikon: Further company coverage:",
        "date": "06282017",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "BRIEF-Amex recovers Perron Gold Property and launches exploration program "
    },
    {
        "content": "* Has received balance of $4 million proceeds from Agnico Sonora  a unit of Agnico Eagle Mines Limited",
        "date": "06012017",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "BRIEF-Sonoro receives Chipriona sale proceeds from Agnico Eagle "
    },
    {
        "content": "* Agnico Eagle reports first quarter 2017 results; strong operational performance continues; full year production guidance increased; canadian malartic extension receives government approval; exploration drilling yields favourable results at amaruq",
        "date": "04272017",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "BRIEF-Agnico Eagle reports Q1 earnings per share $0.33 "
    },
    {
        "content": "* Announces US$220 million sale of common shares to one institutional investor",
        "date": "03272017",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "BRIEF-Agnico Eagle announces $220 mln sale of common shares to one institutional investor "
    },
    {
        "content": "* Agnico Eagle Mines - agreed to purchase 38.1 million common shares of Goldquest Mining Corp in non-brokered private placement at price of $0.60 per share",
        "date": "03062017",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "BRIEF-Agnico Eagle announces investment in Goldquest Mining Corp "
    },
    {
        "content": "* Otis Gold - Agnico Eagle Mines agreed to acquire  by private placement  14.42 million shares of co at price of $0.35 per common share",
        "date": "02242017",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "BRIEF-Otis Gold announces strategic investment by Agnico Eagle "
    },
    {
        "content": "Feb 15 Agnico Eagle Mines said on Wednesday it would invest more than $1.2 billion in building a gold mine in Canada's Arctic and expanding another  making it one of the few gold companies to be constructing mines at a time when industry output is shrinking.",
        "date": "02162017",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "Agnico Eagle to invest $1.2 bln in Arctic gold mines "
    },
    {
        "content": "* Agnico Eagle reports fourth quarter and full year 2016 results - Meliadine and Amaruq projects approved for development; annual gold production expected to grow to 2.0 million ounces in 2020",
        "date": "02152017",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "BRIEF-Agnico Eagle posts Q4 adjusted earnings per share $0.02 "
    },
    {
        "content": "Agnico Eagle Mines Ltd said an employee of a local contractor died in an accident at their Kittila mine in northern Finland on Thursday.",
        "date": "12162016",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "One dead in accident at Agnico's Finland mine "
    },
    {
        "content": "* Agnico Eagle reports third quarter 2016 results: strong operational performance continues; ongoing exploration yields positive results at Amaruq  Sisar Zone at Kittila  Olmeca zone at El Barqueno and Barsele Project in Sweden",
        "date": "10262016",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "BRIEF-Agnico Eagle Mines posts Q3 adj. earnings per share $0.25 "
    },
    {
        "content": "* Agnico Eagle announces entering into of voting support agreement",
        "date": "09142016",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "BRIEF-Agnico Eagle reports entering into of voting support agreement "
    },
    {
        "content": "* Agnico Eagle provides a fifth operational progress update on Barsele Au-VMS project  Source text for Eikon:  Further company coverage:",
        "date": "09122016",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "BRIEF-Agnico Eagle provides a fifth operational progress update on Barsele Au-VMS project "
    },
    {
        "content": "* Says will pay Cdn.$0.85 per subject share  for total consideration of Cdn.$12.7 million",
        "date": "07252016",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "BRIEF-Agnico Eagle announces additional investment in Belo Sun "
    },
    {
        "content": "MEXICO CITY  July 20 Canadian mining company Agnico Eagle said on Wednesday that a group of armed men stormed one of its mines in northern Mexico early on Tuesday morning  injuring a security guard and making off with a haul of silver and gold.",
        "date": "07202016",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "normal",
        "symbol": "AEM",
        "title": "Armed men steal gold and silver from Agnico Eagle's mine in Mexico "
    },
    {
        "content": "* Continued strong operational performance - amaruq  el barqueno and barsele drill programs yield positive results",
        "date": "04282016",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "BRIEF-Agnico Eagle Q1 earnings per share $0.13 "
    },
    {
        "content": "March 19 Canadian gold producer Agnico Eagle Mines Ltd  said it appointed Ammar Al-Joundi  former chief financial officer of Barrick Gold Corp    president as it grooms him as a potential chief executive.",
        "date": "03192015",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "Agnico hires former Barrick Gold CFO Ammar Al-Joundi as president "
    },
    {
        "content": "Feb 11 Agnico Eagle Mines Ltd reported a fourth-quarter net loss on Wednesday on the back of a number of non-cash items  including foreign currency translation losses  mark-to-market adjustment losses and stock option expenses.",
        "date": "02112015",
        "name": "Agnico Eagle Mines Limited",
        "news_type": "topStory",
        "symbol": "AEM",
        "title": "Agnico Eagle reports fourth-quarter loss on non-cash items "
    }
]