[
    {
        "content": "* Cuts share stake in AIG to 841 740 shares from 1.3 million shares",
        "date": "11142017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Omega Advisors takes share stake in Aetna  dissolves stake in Allergan "
    },
    {
        "content": "* Aetna Inc - ‍ new  low-cost prescription drug plan will be available beginning January 1  2018 in 27 states and District of Columbia​",
        "date": "11072017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna Inc introduces low-cost prescription drug plan "
    },
    {
        "content": "U.S. drug distributor Cardinal Health Inc's  quarterly revenue fell short of analysts' forecasts  as prices for generic drugs remained stubbornly low  sending the company's shares down to a four-year low on Monday.",
        "date": "11062017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Cardinal Health misses revenue estimates; names new CEO "
    },
    {
        "content": "U.S. pharmacy operator CVS Health Corp  and health insurer Aetna Inc  are working toward finalizing merger terms and announcing a deal for more than $70 billion as early as December  according to people familiar with the matter.",
        "date": "11032017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "CVS  Aetna aim to finalize deal as early as December: sources "
    },
    {
        "content": "U.S. drugstore chain CVS Health Corp  said on Monday it would start next-day delivery from its stores in 2018  a move some analysts said was in response to Amazon.com's  potential entry into prescription drug sales.",
        "date": "11062017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "CVS to start next-day delivery as Amazon threat looms "
    },
    {
        "content": "Nov 3 U.S. pharmacy operator CVS Health Corp and health insurer Aetna Inc are working toward finalizing merger terms and announcing a deal for more than $70 billion as early as December  according to people familiar with the matter.",
        "date": "11032017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 1-CVS  Aetna aim to finalize deal as early as December -sources "
    },
    {
        "content": "NEW YORK  Nov 3 U.S. pharmacy operator CVS Health Corp and health insurer Aetna Inc are working toward finalizing merger terms and announcing a deal for more than $70 billion as early as December  according to people familiar with the matter.",
        "date": "11032017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "CVS  Aetna aim to finalize deal as early as December -sources "
    },
    {
        "content": "Nov 6 U.S. drugstore chain CVS Health Corp said on Monday it would start next-day delivery from its stores in 2018  a move some analysts said was in response to Amazon.com's potential entry into prescription drug sales.",
        "date": "11062017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 3-CVS to start next-day delivery as Amazon threat looms "
    },
    {
        "content": "Nov 6 CVS Health Corp  which is said to have offered to buy health insurer Aetna Inc  reported a 17 percent drop in quarterly profit on Monday  hurt by lower prices and reimbursements in its pharmacy business.",
        "date": "11062017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "CVS Health's profit drops 17 pct "
    },
    {
        "content": "NEW YORK CVS Health Corp’s planned US$66bn buy of Aetna Inc is poised to boost the healthcare sector’s share of US investment-grade mergers and acquisitions lending beyond its current one-third share of the US$122bn total as the sector remains a bright spot in an otherwise lackluster market.",
        "date": "11032017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "U.S. healthcare brightens tame U.S. high-grade M&A lending "
    },
    {
        "content": "NEW YORK  Nov 3 CVS Health Corp’s planned US$66bn buy of Aetna Inc is poised to boost the healthcare sector’s share of US investment-grade mergers and acquisitions lending beyond its current one-third share of the US$122bn total as the sector remains a bright spot in an otherwise lackluster market.",
        "date": "11032017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "LPC: US healthcare brightens tame US high-grade M&A lending "
    },
    {
        "content": "NEW YORK  Oct 29 The proposed merger between U.S. pharmacy operator CVS Health Corp and No. 3 health insurer Aetna Inc represents a $66 billion bet that insurers can drive down high U.S. drug prices by cutting out the middleman.",
        "date": "10292017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "CVS bid for Aetna: A $66 billion bet on cutting drug costs "
    },
    {
        "content": "Oct 27 U.S. pharmacy operator CVS Health Corp's move to buy health insurer Aetna Inc could shore-up CVS' vulnerable pharmacy business and spur another round of dealmaking in an industry fearing Amazon's arrival  analysts said.",
        "date": "10272017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "UPDATE 1-CVS deal for Aetna could help retailer face Amazon entry - analysts "
    },
    {
        "content": "Oct 26 U.S. pharmacy operator CVS Health Corp has made an offer to acquire No. 3 U.S. health insurer Aetna Inc for more than $200 per share  or over $66 billion  people familiar with the matter said on Thursday.",
        "date": "10262017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "UPDATE 3-CVS makes more than $66 billion bid for Aetna -sources "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Aetna's third-quarter results lay out its insurance value for CVS Health. Revenue at the $56 billion health-coverage firm fell 5 percent in the three months to the end of September  partly from dumping some Obamacare policies. But profit jumped 48 percent as the company kept costs under control. That offers alluring protection for CVS  whose pharmacy and drug-benefit business is threatened by rising competition and transparency.",
        "date": "10312017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Breakingviews - Aetna lays out its insurance value for CVS "
    },
    {
        "content": "U.S. pharmacy operator CVS Health Corp has made an offer to acquire No. 3 U.S. health insurer Aetna Inc for more than $200 per share  or over $66 billion  people familiar with the matter said on Thursday. | Video ",
        "date": "10272017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "CVS makes more than $66 billion bid for Aetna: sources "
    },
    {
        "content": "Oct 26 U.S pharmacy operator CVS Health Corp has made an offer to acquire U.S. health insurer Aetna Inc for more than $200 per share  a person familiar with the matter said on Thursday.",
        "date": "10262017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "CVS makes bid for Aetna-source "
    },
    {
        "content": "U.S. health insurer Aetna Inc failed to provide any hints on reported merger talks with CVS Health Corp when discussing quarterly results on Tuesday and laid out obstacles to 2018 earnings growth  sending its shares lower.",
        "date": "10312017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna silent on CVS bid reports  flags tax hit in 2018 "
    },
    {
        "content": "Oct 27 The following bids  mergers  acquisitions and disposals were reported by 2010 GMT on Friday:",
        "date": "10272017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Drug retailer CVS Health Corp  is in talks to buy health insurer Aetna Inc   the Wall Street Journal reported on Thursday  citing sources.",
        "date": "10262017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "CVS Health in talks to buy health insurer Aetna: WSJ "
    },
    {
        "content": "Oct 26 Drug retailer CVS Health Corp is in talks to buy health insurer Aetna Inc  the Wall Street Journal reported on Thursday  citing sources.",
        "date": "10262017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "CVS Health in talks to buy health insurer Aetna - WSJ "
    },
    {
        "content": "Oct 31 U.S. health insurer Aetna Inc failed to provide any hints on reported merger talks with CVS Health Corp when discussing quarterly results on Tuesday and laid out obstacles to 2018 earnings growth  sending its shares lower.",
        "date": "10312017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 4-Aetna silent on CVS bid reports  flags tax hit in 2018 "
    },
    {
        "content": "Oct 27 U.S. pharmacy operator CVS Health Corp's move to buy health insurer Aetna Inc will broaden their reach in the industry and could spark another round of dealmaking in a sector dreading Amazon's arrival  analysts said.",
        "date": "10272017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "CVS-Aetna deal gets Wall Street thumbs up amid Amazon entry fears "
    },
    {
        "content": "* CVS has proposed to acquire AETNA for more than $200 per share - CNBC citing DJ‍​ Further company coverage:",
        "date": "10262017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-CVS has proposed to acquire Aetna for more than $200 per share - CNBC  citing DJ‍​ "
    },
    {
        "content": "NEW YORK Aetna Inc Chief Executive Mark Bertolini said during a conference call on Tuesday that the company is considering re-launching a pre-Affordable Care Act product it had for transition insurance of less than one year.",
        "date": "10312017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna considering launching short-term insurance plans: CEO "
    },
    {
        "content": "Oct 26 ‍​ * CVS Health in talks to buy Aetna - CNBC  citing DJ ‍​ ",
        "date": "10262017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-CVS Health in talks to buy Aetna - CNBC  citing DJ ‍​ "
    },
    {
        "content": "NEW YORK  Oct 31 Aetna Inc Chief Executive Mark Bertolini said during a conference call on Tuesday that the company is considering re-launching a pre-Affordable Care Act product it had for transition insurance of less than one year.",
        "date": "10312017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "REFILE-Aetna considering launching short-term insurance plans -CEO "
    },
    {
        "content": "NEW YORK  Oct 31 Aetna Inc Chief Executive Mark Bertolini on Tuesday said during an analyst conference call to discuss third-quarter results that the company would not discuss rumor or speculation  referencing recent source-based reports that it was in merger talks with CVS Health Corp.",
        "date": "10312017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CEO declines to discuss CVS bid reports on conference call "
    },
    {
        "content": "Hartford Financial Services Group Inc  said on Monday it would buy health insurer Aetna Inc's  U.S. group life and disability business for $1.45 billion cash in a move that will expand its insurance portfolio and spur its digital technology plans.",
        "date": "10232017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Insurer Hartford to buy Aetna's U.S. life  disability business for $1.45 billion "
    },
    {
        "content": "Oct 31 Aetna Inc's profit rose 39 percent in the third quarter  due to lower losses in its Obamacare business and strong performance in its businesses.",
        "date": "10312017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Health insurer Aetna's profit rises 39 pct in 3rd quarter "
    },
    {
        "content": "* Hartford suspends share buyback in 2017  2018  shares fall (Adds Hartford president comments  presentation details  context)",
        "date": "10232017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 4-Insurer Hartford to buy Aetna's U.S. life  disability business for $1.45 bln "
    },
    {
        "content": "* Q3 earnings per share view $2.09 -- Thomson Reuters I/B/E/S",
        "date": "10312017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-Aetna reports Q3 earnings per share $2.52 "
    },
    {
        "content": "* The Hartford signs agreement to acquire Aetna’S U.S. group life and disability business",
        "date": "10232017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-The Hartford to acquire Aetna's U.S. group life and disability business "
    },
    {
        "content": "Oct 23 Property and casualty insurer Hartford Financial Services Group Inc said on Monday it would buy health insurer Aetna Inc's U.S. group life and disability business for $1.45 billion in cash.",
        "date": "10232017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Hartford to buy Aetna's U.S. life and disability business "
    },
    {
        "content": "* Says delivering Q4 orders is a challenge (Adds more details on outlook  shares)",
        "date": "10112017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "UPDATE 1-Gerresheimer's targets in jeopardy over U.S. healthcare confusion "
    },
    {
        "content": "WASHINGTON Television talk show host Jimmy Kimmel called out a Republican U.S. senator pushing the party's latest healthcare overhaul plan  saying the lawmaker had \"lied right to my face\" about efforts to scrap Obamacare by backing a measure that would strip coverage from many Americans.",
        "date": "09202017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Late-night TV show host Kimmel blasts senator over healthcare bill "
    },
    {
        "content": "* ‍Moody's says U.S. healthcare insurers' outlook is stable amid solid fundamentals​",
        "date": "09192017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-‍Moody's says U.S. healthcare insurers' outlook is stable amid solid fundamentals​ "
    },
    {
        "content": "NEW YORK  Sept 19 New York City's industrial development agency on Tuesday approved a $9.4 million tax-break package for Aetna Inc  as the third-largest U.S. health insurer moves its corporate headquarters to Manhattan from Connecticut.",
        "date": "09192017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "New York City agency approves $9.4 million in tax breaks for Aetna "
    },
    {
        "content": "* Aetna - Expect to reaffirm 2017 EPS projection of $5.46 to $5.56  2017 adjusted earnings per share projection of $9.45 to $9.55‍​ - SEC filing",
        "date": "09112017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna expects to reaffirm 2017 EPS projection "
    },
    {
        "content": "Aetna Inc has been hit with a proposed class action lawsuit accusing it of violating customers' privacy by mailing out envelopes that revealed information for potentially thousands of people taking HIV medications.",
        "date": "08292017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Lawsuit accuses Aetna of revealing patients' HIV information "
    },
    {
        "content": "NEW YORK Several big-name hedge fund investors trimmed their stakes in healthcare companies in the second quarter as the sector led the broad U.S. stock market higher  rallying amid a Republican effort to repeal and replace President Obama's signature healthcare law.",
        "date": "08142017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Big-name U.S. hedge funds shed healthcare stocks during the rally in second-quarter "
    },
    {
        "content": "* Aetna Inc - offering $1 billion aggregate principal amount of 3.875 percent senior notes due 2047 - SEC filing‍​ Source text: (http://bit.ly/2wrvsN8) Further company coverage:",
        "date": "08082017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna - offering $1 bln aggregate principal amount of 3.875 pct senior notes due 2047‍​ "
    },
    {
        "content": "(Reuters Health) - A little-understood syndrome likely afflicted nearly 157 000 pregnant women and new mothers in the United States in 2012  killed 72 of them  and cost the U.S. healthcare system more than $2 billion  researchers estimate.",
        "date": "08012017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Pregnancy disorder exacts toll on mothers  babies  healthcare funds "
    },
    {
        "content": "Aetna Inc reported a higher-than-expected quarterly profit on Thursday as member health costs were lower than anticipated and it benefited from exiting most of its Obamacare individual insurance markets this year.",
        "date": "08032017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Health insurer Aetna profit rises as Obamacare business shrinks "
    },
    {
        "content": "Aug 3 Aetna Inc reported a higher-than-expected quarterly profit on Thursday as member health costs were lower than anticipated and it benefited from exiting most of its Obamacare individual insurance markets this year.",
        "date": "08032017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 5-Health insurer Aetna profit rises as Obamacare business shrinks "
    },
    {
        "content": "* Linde Q2 operating profit beats consensus (Recasts  adds CFO comment  Praxair comment)",
        "date": "07282017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "UPDATE 2-Linde says Praxair merger process on track "
    },
    {
        "content": "Cognizant Technology Solutions Corp raised the lower end of its 2017 revenue forecast  easing concerns of tighter spending from its healthcare clients amid uncertainty surrounding the U.S. healthcare policy.",
        "date": "08032017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Cognizant shrugs off healthcare worry  tightens FY revenue view "
    },
    {
        "content": "* Indexes down: Dow 0.05 pct  S&P 0.14 pct  Nasdaq 0.06 pct (Updates to open)",
        "date": "08032017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "US STOCKS-Wall St opens flat as tech stocks slip "
    },
    {
        "content": "NEW YORK  Aug 3 Aetna Inc has experienced lower member costs \"on the margin\" in its Obamacare individual business so far this year  but uncertainty about federal funding for the program in 2018 may spur members  worried they are going to lose insurance next year  to boost use of medical services in the second-half of 2017  its Chief Financial Officer Shawn Guertin said Thursday.",
        "date": "08032017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna Obamacare member costs improve but second half uncertain "
    },
    {
        "content": "WASHINGTON Republicans struggling to agree on healthcare legislation to overhaul Obamacare obeyed U.S. President Donald Trump's orders to try to swiftly reach a deal but were unable to resolve their differences in a long  late-night meeting. | Video ",
        "date": "07202017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Republicans meet late into night as Trump demands new U.S. healthcare plan "
    },
    {
        "content": "WASHINGTON U.S. Republican Senate leaders aim to hold a procedural vote as early as Tuesday to take up legislation to repeal or replace Obamacare  but it remained unclear which version of the bill senators would vote on.",
        "date": "07242017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Republican strategy on U.S. healthcare bill in flux ahead of vote "
    },
    {
        "content": "* Futures: Dow down 1 pt  S&P off 1 pt  Nasdaq up 7 pts (Adds details  comment  updates prices)",
        "date": "08032017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "US STOCKS-Wall St set to open flat after Dow breaches 22 000 "
    },
    {
        "content": "* Vote to open repeal debate next week (Updates with Republican meeting; adds Senator Corker on McCain)",
        "date": "07202017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 11-Republicans meet late into night as Trump demands new U.S. healthcare plan "
    },
    {
        "content": "WASHINGTON  July 23 U.S. Republican Senate leaders aim to hold a procedural vote as early as Tuesday to take up legislation to repeal or replace Obamacare  but it remained unclear which version of the bill senators would vote on.",
        "date": "07232017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "RPT-Republican strategy on U.S. healthcare bill in flux ahead of vote "
    },
    {
        "content": "* Q2 earnings per share view $2.35 -- Thomson Reuters I/B/E/S",
        "date": "08032017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "CORRECTED-BRIEF-Aetna posts 2nd-qtr adj EPS of $3.42 "
    },
    {
        "content": "Aug 3 Health insurer Aetna Inc reported a 52 percent rise in quarterly profit on Thursday  helped by lower health care costs and strong performance in its businesses.",
        "date": "08032017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Health insurer Aetna's quarterly profit surges 52 pct "
    },
    {
        "content": " (Updates prices)     By Bruno Federowski     SAO PAULO  July 18 Mexico's peso hit a more than 14-month high on Tuesday and Brazil's real firmed sharply after the collapse of a key U.S. healthcare bill fostered doubts about President Donald Trump's economic plans and broadly weighed on the dollar.      Trump's promises to cut taxes and boost spending has triggered expectations of faster inflation that could force the Federal Reserve to raise interest rates more than expected  potenti",
        "date": "07182017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "EMERGING MARKETS-Mexico peso hits 14-month high  Brazil real firms sharply "
    },
    {
        "content": "* Republican push to overhaul or repeal healthcare law hits snag",
        "date": "07182017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "TREASURIES-Yields drop on U.S. healthcare concerns  weak data "
    },
    {
        "content": "    By Bruno Federowski     SAO PAULO  July 18 Latin American currencies strengthened on Tuesday after the collapse of a key U.S. healthcare bill fostered doubts about President Donald Trump's plans to lift the economy.     Trump's promises to cut taxes and boost spending has triggered expectations of faster inflation that could force the U.S. Federal Reserve to raise interest rates more than expected  potentially draining capital from emerging markets.     Trader skepticism over Tru",
        "date": "07182017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "EMERGING MARKETS-LatAm currencies strengthen on U.S. healthcare bill collapse "
    },
    {
        "content": "NEW YORK  July 18 U.S. Treasury yields fell on Tuesday  as investors grew cautious about the latest political drama in Washington around healthcare legislation and more data pointed to benign inflation with a drop in import prices for a second straight month.",
        "date": "07182017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "TREASURIES-Yields slide as latest U.S. healthcare issue weighs "
    },
    {
        "content": "FRANKFURT  July 18 The following are some of the factors that may move German stocks on Tuesday:",
        "date": "07182017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "German stocks - Factors to watch on July 18 "
    },
    {
        "content": "* Glaxosmithkline Plc says begun shipping quadrivalent vaccine doses to U.S. healthcare providers",
        "date": "07142017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-GSK begins shipping quadrivalent vaccine doses to U.S. healthcare providers "
    },
    {
        "content": "* Exact Sciences Corp -Exact Sciences Laboratories entered national ancillary provider participation agreement with Unitedhealthcare Insurance for cologuard",
        "date": "07052017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Exact Sciences laboratories enters national ancillary provider participation agreement with Unitedhealthcare Insurance "
    },
    {
        "content": "NEW YORK  June 29 Aetna Inc  the third-largest U.S. health insurer  will move its corporate headquarters to New York City next year  making it the latest company to leave Connecticut as the state raises taxes and deals with a budget deficit.",
        "date": "06302017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "CORRECTED-UPDATE 2-Aetna settles on New York for new headquarters in 2018 "
    },
    {
        "content": "TOKYO Japanese office equipment maker Konica Minolta Inc  plans to acquire U.S. healthcare firm Ambry Genetics Corp to diversify its business  the Nikkei daily reported on Sunday.",
        "date": "07022017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Japan's Konica Minolta plans to buy U.S. cancer test firm: Nikkei "
    },
    {
        "content": "June 26 Medtronic Plc said on Monday it signed an agreement with health insurer Aetna Inc under which payment for its insulin pump systems will be tied to how well diabetes patients fare after switching from multiple daily insulin injections.",
        "date": "06262017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Medtronic deal with Aetna ties insulin pump payment to patient results "
    },
    {
        "content": "NEW YORK Aetna Inc  the third-largest U.S. health insurer  will move its corporate headquarters to New York City next year  making it the latest company to leave Connecticut as the state raises taxes and deals with a budget deficit.",
        "date": "06292017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna settles on New York for new headquarters in 2018 "
    },
    {
        "content": "NEW YORK The U.S. dollar touched its lowest level against the euro in a year on Wednesday after hawkish comments from the head of the Bank of England added to speculation that monetary policy in Europe was turning hawkish.",
        "date": "06282017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Dollar extends fall as bets on hawkish European policy heat up "
    },
    {
        "content": "NEW YORK The dollar slid to 10-month lows against the euro on Tuesday after the head of the European Central Bank opened the door to steps that might begin to reduce the central bank's stimulus and after a vote on U.S. healthcare legislation was delayed. | Video ",
        "date": "06272017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Dollar dives on Draghi comments  U.S. healthcare vote delay "
    },
    {
        "content": "TOKYO  July 2 Japanese office equipment maker Konica Minolta Inc plans to acquire U.S. healthcare firm Ambry Genetics Corp to diversify its business  the Nikkei daily reported on Sunday.",
        "date": "07022017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 1-Japan's Konica Minolta plans to buy U.S. cancer test firm -Nikkei "
    },
    {
        "content": "* Medtronic announces outcomes-based agreement with Aetna for Type 1 and Type 2 diabetes patients",
        "date": "06262017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-Medtronic announces agreement with Aetna for diabetes patients "
    },
    {
        "content": "NEW YORK  June 29 Aetna Inc.  the third largest U.S. health insurer  will move its corporate headquarters to New York City in 2018  a decision it has been weighing as the state of Connecticut has raised taxes to try to balance its budget.",
        "date": "06292017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna to move corporate headquarter to New York in 2018 "
    },
    {
        "content": "TOKYO  July 2 Japanese office equipment maker Konica Minolta Inc plans to acquire U.S. healthcare firm Ambry Genetics Corp to diversify its business  the Nikkei daily reported on Sunday.",
        "date": "07022017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Japan's Konica Minolta plans to buy U.S. cancer test firm -Nikkei "
    },
    {
        "content": "* BoE's Carney says central bank likely to need to raise rates",
        "date": "06282017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "FOREX-Dollar extends fall as bets on hawkish European policy heat up "
    },
    {
        "content": "NEW YORK  June 27 The dollar slid to 10-month lows against the euro on Tuesday after the head of the European Central Bank opened the door to steps that might begin to reduce the central bank's stimulus and after a vote on U.S. healthcare legislation was delayed.",
        "date": "06272017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "FOREX-Dollar dives on Draghi comments  U.S. healthcare vote delay "
    },
    {
        "content": "* Interpace Diagnostics announces national contract with Aetna",
        "date": "06282017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-Interpace Diagnostics announces national contract with Aetna "
    },
    {
        "content": "    * U.S. healthcare vote delayed until next month     * Dollar index touches lowest since Nov 2016     * Spot silver biased to revisit Dec 2015 lows -technicals",
        "date": "06282017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "PRECIOUS-Gold rises as U.S. healthcare vote delay weighs on stocks  dollar "
    },
    {
        "content": "TOKYO  June 28 Asian shares slumped on Wednesday after Wall Street was knocked hard in the wake of a delay to a U.S. healthcare reform vote  while the euro rallied after European Central Bank President Mario Draghi hinted that the ECB could trim its stimulus this year.",
        "date": "06282017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "GLOBAL MARKETS-Asia stocks pressured as Wall St hit by healthcare vote delay "
    },
    {
        "content": "Accenture Plc  trimmed its annual revenue forecast on Thursday  triggering concerns that uncertainty around U.S. healthcare policy may be weighing on the company's flagship consulting business.",
        "date": "06222017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Accenture trims revenue forecast amid US healthcare uncertainty "
    },
    {
        "content": "* AETNA AND COMMUNITY CARE PHYSICIAN NETWORK SIGN COLLABORATIVE AGREEMENT",
        "date": "06212017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-AETNA AND COMMUNITY CARE PHYSICIAN NETWORK SIGN COLLABORATIVE AGREEMENT "
    },
    {
        "content": "* Euro hits fresh 10-month high after Draghi's upbeat comments",
        "date": "06282017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "FOREX-Euro gets boost from Draghi  delayed US Senate vote dents dollar "
    },
    {
        "content": "NEW YORK  June 22 U.S. healthcare stocks posted sharp gains on Thursday  with hospitals and insurers climbing after Senate Republicans released a draft bill to replace Obamacare  while a recent surge in biotechnology shares showed no signs of slowing.",
        "date": "06222017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "U.S. health sector hits record high on Senate bill  biotech rally "
    },
    {
        "content": "* 3rd-qtr revenue beats estimates (Adds details  shares  CEO and analyst comment)",
        "date": "06222017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-Accenture trims revenue forecast amid US healthcare uncertainty "
    },
    {
        "content": "Despite uncertainly over the future of U.S. healthcare that has prompted major health insurers to pull out of several markets  upstart provider Oscar Health on Wednesday said it has filed to sell health insurance to individuals through Obamacare exchanges in a total of six states in 2018.",
        "date": "06212017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Oscar Health files to expand insurance coverage in several states "
    },
    {
        "content": "SINGAPORE  June 28 The euro stood tall near a 10-month high on Wednesday after the European Central Bank chief hinted the days of the ECB's aggressive stimulus are numbered  and as the dollar was pressured after a vote on U.S. healthcare legislation was delayed.",
        "date": "06282017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "FOREX-Euro gets lift from Draghi  US Senate vote delay dents dollar "
    },
    {
        "content": "June 21 Despite uncertainly over the future of U.S. healthcare that has prompted major health insurers to pull out of several markets  upstart provider Oscar Health on Wednesday said it has filed to sell health insurance to individuals through Obamacare exchanges in a total of six states in 2018.",
        "date": "06212017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "CORRECTED-Oscar Health files to expand insurance coverage in several states "
    },
    {
        "content": "WASHINGTON California on Monday will announce plans to award $20 million in emergency grants to local health and Planned Parenthood clinics in anticipation of possible U.S. healthcare funding cuts  according to State Treasurer John Chiang's office.",
        "date": "06162017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "California to give health clinics $20 million to counter possible Trump cuts "
    },
    {
        "content": "WASHINGTON California on Monday will announce plans to award $20 million in emergency grants to local health and Planned Parenthood clinics in anticipation of possible U.S. healthcare funding cuts  according to State Treasurer John Chiang's office.",
        "date": "06162017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "California to give health clinics $20 mln to counter possible Trump cuts "
    },
    {
        "content": "ZURICH Swiss biotechnology company Actelion on Thursday presented mixed trial results for its antibiotic hopeful cadazolid  saying it met the main goal of one late-stage study but failed to hit the target in a second  identical study.",
        "date": "06082017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Actelion antibiotic misses mark on one study  hits it on another "
    },
    {
        "content": "WASHINGTON  June 6 President Donald Trump pressed Republican congressional leaders on Tuesday to complete their overhaul of the U.S. healthcare system as lawmakers said they were making progress on a contentious effort that threatens to overwhelm their legislative agenda.",
        "date": "06062017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "UPDATE 5-Trump seeks legislative wins to cast off shadow of Russia probes "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  June 06 (Fitch) The U.S. healthcare sector has solid fundamentals relative to other corporate sectors  but faces high levels of event risk from political and regulatory uncertainty  according to Fitch Ratings' fifth annual U.S. High-Yield Healthcare Checkup handbook. \"Most speculative-grade rated healthcare companies in the U.S. will see earnings growth this year given the strong demand for healthcare services and innovation i",
        "date": "06062017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Fitch: High Event Risk  Fundamentals Solid for U.S. Healthcare "
    },
    {
        "content": "NEW YORK  May 31 The state of Connecticut  once known as the insurance capital of the world  has been trying to woo health insurer Aetna  with incentives to stay in the state  Governor Dannel Malloy said on Wednesday.",
        "date": "05312017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Connecticut offers incentives in bid to keep Aetna "
    },
    {
        "content": "May 31 Health insurer Aetna Inc said it is looking to move its headquarters out of Hartford  Connecticut  a move that could put more pressure on a state already facing a huge revenue slump and mounting economic weakness.",
        "date": "05312017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Health insurer Aetna looking to move headquarters out of Connecticut "
    },
    {
        "content": "NEW YORK  May 22 Aetna Inc Chief Executive Mark Bertolini said on Monday that growing through acquisitions in its existing business lines is \"not high on our list\" after its deal with Humana Inc failed.",
        "date": "05222017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CEO says acquisitions aimed directly at size not on its list "
    },
    {
        "content": "* Hartford Mayor Luke Bronin says \"clear that Aetna decided a long time ago to relocate their corporate headquarters out of Connecticut\"",
        "date": "05312017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-Hartford Mayor Luke Bronin says Aetna decided to relocate their corporate headquarters out of Connecticut "
    },
    {
        "content": "* Expect to reaffirm FY 2017 net income per share projection of $4.48 to $4.68  FY 2017 adjusted earnings per share projection of $8.80 to $9.00 Source text for Eikon: (http://bit.ly/2pU0cqt) Further company coverage:",
        "date": "05192017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna expects to reaffirm FY17 net income per share  adjusted EPS projection "
    },
    {
        "content": "BRUSSELS  May 18 U.S. healthcare giant Johnson & Johnson has offered concessions in a bid to address EU antitrust concerns over its $30 billion bid for Swiss biotech company Actelion  the European Commission said on Thursday.",
        "date": "05182017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Johnson & Johnson offers EU concessions over Actelion deal "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.50 per share Source text for Eikon: Further company coverage:",
        "date": "05192017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-Aetna sets quarterly cash dividend of $0.50 per share "
    },
    {
        "content": "Health insurer Aetna Inc said on Wednesday it will exit the 2018 Obamacare individual insurance market in Delaware and Nebraska - the two remaining states where it offered the plans.",
        "date": "05112017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna fully exits Obamacare exchanges with pull-out in 2 states "
    },
    {
        "content": "Health insurer Aetna Inc  said on Wednesday it will exit the 2018 Obamacare individual insurance market in Delaware and Nebraska - the two remaining states where it offered the plans.",
        "date": "05102017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna fully exits Obamacare exchanges with pull-out in two states "
    },
    {
        "content": "May 10 Health insurer Aetna Inc said on Wednesday it will exit the 2018 Obamacare individual insurance market in Delaware and Nebraska - the two remaining states where it offered the plans.",
        "date": "05102017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-Aetna fully exits Obamacare exchanges with pull-out in 2 states "
    },
    {
        "content": "May 10 Health insurer Aetna Inc on Wednesday said it will exit the Obamacare individual insurance market in Delaware and Nebraska and will not offer such plans on or off the online exchange created by the Affordable Care Act.",
        "date": "05102017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna to exit Delaware and Nebraska individual insurance markets "
    },
    {
        "content": "NEW YORK Health insurer Aetna Inc said on Wednesday it will not sell Obamacare individual insurance plans in Virginia next year  a move it attributed to \"growing uncertainty\" in the market and $200 million in expected losses on the business this year.",
        "date": "05032017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna adds Virginia to list of Obamacare exits for 2018 "
    },
    {
        "content": "* Says co completes full acquisition of INC United from SE Holdings and Incubations Co Ltd and an individual  on May 1",
        "date": "05012017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Runsystem completes acquisition of INC United on May 1 "
    },
    {
        "content": "Aetna Inc  reported a quarterly net loss on Tuesday related to costs from its failed acquisition of Humana Inc  and said it will cut exposure to money-losing Obamacare coverage in 2018.",
        "date": "05022017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Insurer Aetna posts loss  evaluates Obamacare exposure "
    },
    {
        "content": "NEW YORK  May 3 Health insurer Aetna Inc said on Wednesday it will not sell Obamacare individual insurance plans in Virginia next year  a move it attributed to \"growing uncertainty\" in the market and $200 million in expected losses on the business this year.",
        "date": "05032017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 1-Aetna adds Virginia to list of Obamacare exits for 2018 "
    },
    {
        "content": "WASHINGTON  May 2 Republicans in the U.S. House of Representatives said on Tuesday they were closer to agreeing on a reworked bill to overhaul the nation's healthcare system but still lacked the votes to pass it  as President Donald Trump pressed lawmakers for a vote.",
        "date": "05022017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Republicans still short of votes to pass U.S. healthcare overhaul "
    },
    {
        "content": "NEW YORK  May 3 Aetna Inc will exit the Obamacare individual insurance market in Virginia and will not offer these plans on or off the online exchange created by the Affordable Care Act  the company said on Wednesday.",
        "date": "05032017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna to exit Virginia Obamacare individual insurance market "
    },
    {
        "content": "May 3 U.S. health insurer Humana Inc's quarterly profit more than quadrupled  helped by a net gain associated with the terminated merger agreement with Aetna Inc .",
        "date": "05032017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Health insurer Humana's quarterly profit surges "
    },
    {
        "content": "WASHINGTON Time was running short for President Donald Trump to attract enough votes to pass a new bill to overhaul the U.S. healthcare system this week as Republican party moderates held out  fearing a backlash from voters worried about losing insurance benefits.",
        "date": "05032017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Trump struggles to win over moderate Republicans on healthcare overhaul "
    },
    {
        "content": "* Aetna raises 2017 adjusted forecast to $8.80-$9.00/share (Recasts; adds CEO comment  details on Obamacare)",
        "date": "05022017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 4-Insurer Aetna posts loss  evaluates Obamacare exposure "
    },
    {
        "content": "* Aetna CFO says expects 2017 individual loss to be about one-half the size of 2016 loss  has 0ne-quarter of 2016 membership",
        "date": "05022017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-Aetna CFO sees 2017 individual loss at half of 2016 "
    },
    {
        "content": "WASHINGTON  May 2 Time was running short for President Donald Trump to attract enough votes to pass a new bill to overhaul the U.S. healthcare system this week as Republican party moderates held out  fearing a backlash from voters worried about losing insurance benefits.",
        "date": "05032017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 3-Trump struggles to win over moderate Republicans on healthcare overhaul "
    },
    {
        "content": "NEW YORK  May 2 Aetna Inc Chief Financial Officer Shawn Guertin said on Tuesday that member medical costs are running higher than anticipated in the company's individual plans sold on exchanges created by the Affordable Care Act.",
        "date": "05022017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CFO looks ahead to smaller individual footprint "
    },
    {
        "content": "* Q1 earnings per share view $2.37 -- Thomson Reuters I/B/E/S",
        "date": "05022017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-Aetna reports first-quarter 2017 results "
    },
    {
        "content": "May 2 U.S. health insurer Aetna Inc reported a first-quarter loss on Tuesday  compared with a year-ago profit  primarily due to costs associated with the termination of the Humana merger agreement.",
        "date": "05022017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Health insurer Aetna reports quarterly loss "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 14 (Fitch) Fitch Ratings has affirmed the ratings on Aetna Inc. (Aetna) and its rated subsidiaries. The Rating Outlook is Negative. A full list of rating actions follows at the end of this release. KEY RATING DRIVERS Fitch removed Aetna's ratings from Negative Watch and assigned a Negative Rating Outlook on Feb. 14  2017  upon the termination of Aetna's merger agreement with Humana Inc. (Humana). The Negative Outlook on A",
        "date": "04142017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Fitch Affirms Aetna's IFS Ratings at 'AA-'; Outlook Remains Negative "
    },
    {
        "content": "NEW YORK U.S. drug distributor Cardinal Health Inc’s deal to buy Medtronic Plc’s medical supplies units days after Abbott Laboratories agreed to a long-awaited purchase of diagnostic testing company Alere Inc has raised the pulse of a sector suppressed by potential healthcare policy upheaval.",
        "date": "04202017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "LPC: U.S. healthcare lending rouses from policy-induced sedation "
    },
    {
        "content": "NEW YORK  April 20 US drug distributor Cardinal Health Inc’s deal to buy Medtronic Plc’s medical supplies units days after Abbott Laboratories agreed to a long-awaited purchase of diagnostic testing company Alere Inc has raised the pulse of a sector suppressed by potential healthcare policy upheaval.",
        "date": "04202017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "LPC: US healthcare lending rouses from policy-induced sedation "
    },
    {
        "content": "* Aetna Inc - CEO Mark T. Bertolini's total compensation for 2016 was $18.7 million versus $17.3 million in 2015",
        "date": "04072017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna Inc's CEO's total compensation for 2016 was $18.7 mln "
    },
    {
        "content": "April 6 As the epidemic of opioid abuse continues to take its toll on the U.S. healthcare system  health insurer Cigna Corp on Thursday reported a nearly 12 percent drop prescription opioid use among its customers in the past twelve months.",
        "date": "04062017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Cigna reports 12 pct cut in opioid use among U.S. customers "
    },
    {
        "content": "NEW YORK Aetna Inc will exit Iowa's Obamacare-compliant individual insurance market in 2018  a year surrounded by uncertainty over which insurers will sell plans and at what price as Republicans seek to dismantle the 2010 Affordable Care Act.",
        "date": "04062017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna exits Iowa individual insurance market for 2018 "
    },
    {
        "content": "As the epidemic of opioid abuse continues to take its toll on the U.S. healthcare system  health insurer Cigna Corp on Thursday reported a nearly 12 percent drop prescription opioid use among its customers in the past twelve months.",
        "date": "04062017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Cigna reports 12 percent cut in opioid use among U.S. customers "
    },
    {
        "content": "NEW YORK  April 6 Aetna Inc will exit Iowa's Obamacare-compliant individual insurance market in 2018  a year surrounded by uncertainty over which insurers will sell plans and at what price as Republicans seek to dismantle the 2010 Affordable Care Act.",
        "date": "04062017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-Aetna exits Iowa individual insurance market for 2018 "
    },
    {
        "content": "NEW YORK  April 6 Health insurer Aetna Inc will not sell Obamacare individual insurance plans in Iowa in 2018 due to financial risk and the uncertain outlook for the online marketplace  the company said in a statement on Thursday.",
        "date": "04062017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna will not sell 2018 Obamacare exchange plans in Iowa "
    },
    {
        "content": "* Shares drop almost 6 percent (Adds details on outlook  shares  analyst comment)",
        "date": "04062017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 1-U.S. healthcare confusion hits packaging firm Gerresheimer "
    },
    {
        "content": "    March 27 Australian shares are expected to open lower on Monday  tracking Wall Street's move last Friday  which fell after Republicans pulled their bill to overhaul the U.S. healthcare system.     Losses in commodities prices are also expected to weigh on the benchmark index          as Chinese steel and iron ore futures fell for a fourth day on Friday  adding to a nearly week-long selloff.                The local share price index futures          was down 0.017 percent or 1 po",
        "date": "03262017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Australia shares set to open lower; NZ up "
    },
    {
        "content": " (This version of the March 26th story corrects to add dropped word 'advises'in paragraph 11)",
        "date": "03272017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "U.S. equity futures at six-week low after Trump healthcare setback "
    },
    {
        "content": "WASHINGTON President Donald Trump suffered a stunning political setback on Friday in a Congress controlled by his own party when Republican leaders pulled legislation to overhaul the U.S. healthcare system  a major 2016 election campaign promise of the president and his allies. | Video ",
        "date": "03252017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Trump tastes failure as U.S. House healthcare bill collapses "
    },
    {
        "content": "March 26 U.S. equity index futures fell to a six-week low on Sunday in a sign Wall Street would start the week defensively after Republicans pulled legislation to overhaul the U.S. healthcare system in a stunning setback for President Donald Trump.",
        "date": "03272017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "REFILE-UPDATE 3-U.S. equity futures at six-week low after Trump healthcare setback "
    },
    {
        "content": "Republican leaders of the House of Representatives pulled legislation to overhaul the U.S. healthcare system from consideration on Friday due to a shortage of votes  despite desperate lobbying by the White House and its allies in Congress  dealing a stiff setback to President Donald Trump.",
        "date": "03252017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Instant View: Republicans pull Obamacare repeal bill "
    },
    {
        "content": "* Trump vows to move on to tax cut legislation   (Adds Trump quotes  lawmaker reaction)",
        "date": "03242017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "UPDATE 11-Trump tastes failure as U.S. House healthcare bill collapses "
    },
    {
        "content": "Highlights of the day for U.S. President Donald Trump's administration on Friday:",
        "date": "03242017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Highlights: The Trump presidency on March 24 at 5:31 p.m. EDT "
    },
    {
        "content": "Anthem Inc  is likely to exit from a large portion of its Obamacare individual insurance markets next year  Jefferies analysts said  nearly a week after Republican leaders pulled legislation to overhaul the U.S. healthcare system.",
        "date": "03302017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Anthem likely to pull back from Obamacare markets in 2018: Jefferies "
    },
    {
        "content": "March 24 Highlights of the day for U.S. President Donald Trump's administration on Friday:",
        "date": "03242017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "HIGHLIGHTS-The Trump presidency on March 24 at 5:31 p.m. EDT/2131 GMT "
    },
    {
        "content": "NEW YORK The dollar pulled back from near a four-month low against the Japanese yen on Friday  and was on pace to snap an eight-day losing streak against the safe-haven currency  after Republicans killed their bill to overhaul the U.S. healthcare system.",
        "date": "03242017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Dollar steadies after U.S. healthcare bill pulled "
    },
    {
        "content": "March 30 Anthem Inc is likely to exit from a large portion of its Obamacare individual insurance markets next year  Jefferies analysts said  nearly a week after Republican leaders pulled legislation to overhaul the U.S. healthcare system.",
        "date": "03302017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Anthem likely to pull back from Obamacare markets in 2018 - Jefferies "
    },
    {
        "content": "NEW YORK The dollar hovered near a four-month low against the Japanese yen on Thursday ahead of a vote on a U.S. Republican healthcare plan seen as a litmus test of President Donald Trump's ability to pass key policies such as tax cuts through Congress.",
        "date": "03232017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Dollar trades in tight range as U.S. healthcare vote looms "
    },
    {
        "content": "* ECB tightening expectations underpin euro   (New throughout  updates prices  adds quotes)",
        "date": "03242017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "FOREX-Dollar steadies after U.S. healthcare bill pulled "
    },
    {
        "content": "* ECB tightening expectations underpin euro   (Updates prices  adds quote)",
        "date": "03242017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "FOREX-Dollar weak as investors await U.S. healthcare vote "
    },
    {
        "content": "NEW YORK If the U.S. healthcare legislation overhaul is not passed  or is postponed  it will put \"a lot of doubt\" on the \"Trump trades \" which include higher U.S. equities and bond yields  DoubleLine Capital Chief Executive Jeffrey Gundlach said on Wednesday.",
        "date": "03222017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "If healthcare vote fails  would jeopardize 'Trump trades': Gundlach "
    },
    {
        "content": "LONDON  March 23 The dollar held under $1.08 per euro for a second day on Thursday ahead of a vote on Republican healthcare plans seen as a litmus test of President Donald Trump's ability to legislate in Congress and deliver on tax and spending promises.",
        "date": "03232017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "FOREX-Dollar steadies as eyes shift to U.S. healthcare vote "
    },
    {
        "content": "March 17 The U.S. Justice Department has disclosed an investigation into four health insurers after a lawsuit accused them of defrauding Medicare by claiming patients were treated for conditions they  did not have or received no treatment for.",
        "date": "03172017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 1-U.S. investigates four insurers over Medicare payments "
    },
    {
        "content": "    SAO PAULO  March 24 The Mexican peso firmed on Friday to its strongest in four months ahead of a key vote on the U.S. healthcare overhaul plan seen as a test of President Donald Trump's self-described skills as a negotiator.     The peso strengthened 0.5 percent  touching levels last seen before Trump was elected in November. Other Latin American currencies also edged up in thin trading volumes.     Bets that Trump's campaign pledges to cut taxes could raise economic growth in th",
        "date": "03242017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "EMERGING MARKETS-Mexican peso at 4-month peak ahead of U.S. healthcare vote "
    },
    {
        "content": "NEW YORK  March 22 The slumping U.S. healthcare stocks at the center of efforts to dismantle the Affordable Care Act are expected to stay volatile as Republican legislation heads into a vote on Thursday that could signal how protracted their battle to repeal the law will be.",
        "date": "03222017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Hospital  Medicaid insurer shares set for volatility as health vote nears "
    },
    {
        "content": "March 23 Stock futures pointed to a higher opening for Canada's main stock index on Thursday ahead of a key vote in the U.S. Congress on a healthcare bill that is seen as a litmus test of President Donald Trump's ability to legislate.",
        "date": "03232017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "CANADA STOCKS-TSX futures rise ahead of U.S. healthcare vote "
    },
    {
        "content": "* ECB tightening expectations underpin euro   (New throughout  updates prices and market activity to U.S. market open; new byline  changes dateline  previous LONDON)",
        "date": "03242017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "FOREX-Dollar steadies as investors await U.S. healthcare vote "
    },
    {
        "content": "* Aetna Inc - expect to reaffirm projections of full-year 2017 net income per share and full-year 2017 operating earnings per share",
        "date": "03142017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna expects to reaffirm projections of FY 2017 net income per share  FY 2017 operating earnings per share "
    },
    {
        "content": "NEW YORK  March 22 If the U.S. healthcare legislation overhaul is not passed  or is postponed  it will put \"a lot of doubt\" on the \"Trump trades \" which include higher U.S. equities and bond yields  DoubleLine Capital Chief Executive Jeffrey Gundlach said on Wednesday.",
        "date": "03222017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 1-If healthcare vote fails  would jeopardize 'Trump trades' -Gundlach "
    },
    {
        "content": "    By Sindhu Chandrasekaran     March 23 Most Southeast Asian stock markets rose on Thursday  in line with Asia and Wall Street  with investors closely watching the progress of a U.S. healthcare bill that could affect President Donald Trump's ability to deliver on other campaign promises.      Repealing and replacing Democratic former President Barack Obama's 2010 Affordable Care Act is a first major test of Trump's legislative ability and whether he can go ahead with his agenda  in",
        "date": "03232017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "SE Asia Stocks-Higher; investors track U.S. healthcare bill "
    },
    {
        "content": "March 24 Hong Kong stocks eked out marginal gains on Friday  with investors awaiting corporate earnings and a vote on a new U.S. healthcare bill seen as President Donald Trump's first policy test.",
        "date": "03242017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Hong Kong shares tick up; Huishan Dairy plummets "
    },
    {
        "content": "NEW YORK  March 22 If the U.S. healthcare legislation overhaul is not passed  or is postponed  it will put \"a lot of doubt\" on the \"Trump trades \" which include higher U.S. equities and bond yields  DoubleLine Capital Chief Executive Jeffrey Gundlach said on Wednesday.",
        "date": "03222017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "If healthcare vote fails  would jeopardize 'Trump trades' - Gundlach "
    },
    {
        "content": "WASHINGTON  March 23 U.S. President Donald Trump may face his first major legislative hurdle on Thursday: a do-or-die vote in the House of Representatives on a plan that would roll back the signature healthcare law of former President Barack Obama.",
        "date": "03232017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "High stakes for Trump in vote on U.S. healthcare plan "
    },
    {
        "content": "    March 9 Highlights of the day for U.S. President Donald Trump's administration on Thursday:      HEALTHCARE     The Trump-backed Republican plan to overhaul the U.S. healthcare system clears its first hurdle but chances for passage in Congress look uncertain amid opposition by Democrats  conservatives and industry groups.                             Trump has launched a charm offensive of the type not seen before in his brief and chaotic tenure  forcefully rallying behind legisla",
        "date": "03102017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "HIGHLIGHTS-The Trump presidency on March 9 at 9:49 p.m. EST/March 10 0149 GMT "
    },
    {
        "content": "* Aetna Inc - Will redeem for cash entire $750 million aggregate principal amount outstanding of its 3.95% senior notes due September 1  2020",
        "date": "02272017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna will redeem for cash entire $750 mln aggregate principal amount outstanding of its 3.95 pct senior notes due Sept 1  2020 "
    },
    {
        "content": "* Aetna announces full redemption of 3.95 percent senior notes due September 1  2020",
        "date": "02272017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-Aetna announces full redemption of 3.95 percent senior notes due Sept. 1  2020 "
    },
    {
        "content": "* Aetna Inc - Aetna is funding repurchases under accelerated share repurchase agreements from available cash",
        "date": "02222017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna announces $3.3 billion accelerated share repurchase "
    },
    {
        "content": "BRUSSELS  Feb 20 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02202017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "EU mergers and takeovers (Feb 20) "
    },
    {
        "content": "* Aetna board of directors doubles quarterly cash dividend  authorizes additional share repurchases",
        "date": "02172017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna sets quarterly cash dividend of $0.50/shr  authorizes additional share repurchases "
    },
    {
        "content": "BRUSSELS  Feb 17 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02172017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "EU mergers and takeovers (Feb 17) "
    },
    {
        "content": "NEW YORK Aetna Inc Chief Executive Mark Bertolini on Wednesday said the individual Obamacare exchanges are in a \"death spiral\" where rising premiums push out healthy customers and leave only the sickest customers behind  which then drives up premium rates further.",
        "date": "02152017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna CEO says Obamacare individual plans are in 'death spiral' "
    },
    {
        "content": "NEW YORK  Feb 15 Aetna Inc Chief Executive Mark Bertolini on Wednesday said the individual Obamacare exchanges are in a \"death spiral\" where rising premiums push out healthy customers and leave only the sickest customers behind  which then drives up premium rates further.",
        "date": "02152017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CEO says Obamacare individual plans are in \"death spiral\" "
    },
    {
        "content": "NEW YORK/WASHINGTON Health insurers Aetna Inc  and Humana Inc walked away from their $34 billion merger on Tuesday and Cigna Corp sought to end its deal with Anthem  shelving the industry consolidation they charted to address former President Barack Obama's Affordable Care Act.",
        "date": "02142017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna  Humana drop merger; Cigna wants to end Anthem deal "
    },
    {
        "content": "* Genetic screening  non-invasive pre-natal testing to be available on in-network basis for Aetna health plans' 40+ million members beginning on Feb 15  Source text for Eikon:",
        "date": "02092017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-NxGen MDx announces national contract with Aetna "
    },
    {
        "content": "Although judges shot down Anthem Inc's  $54 billion acquisition of Cigna Corp  and Aetna Inc's  $35 billion takeover of Humana Inc  on anti-trust grounds  the rulings left scope for a possible combination of Cigna and Humana  industry insiders said.",
        "date": "02092017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Cigna  Humana could still combine despite anti-trust rulings: analysts "
    },
    {
        "content": "WASHINGTON Tom Price was sworn in as U.S. secretary of health on Friday  putting in place a determined opponent of Obamacare to help President Donald Trump fulfill his pledge to dismantle his predecessor's law and reshape the country's healthcare system. | Video ",
        "date": "02102017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "With eye on Obamacare  Price takes helm as U.S. health secretary "
    },
    {
        "content": "NEW YORK/WASHINGTON Feb 14 Health insurers Aetna Inc and Humana Inc walked away from their $34 billion merger on Tuesday and Cigna Corp sought to end its deal with Anthem  shelving the industry consolidation they charted to address former President Barack Obama's Affordable Care Act.",
        "date": "02142017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 6-Aetna  Humana drop merger; Cigna wants to end Anthem deal "
    },
    {
        "content": "* Molina Healthcare - as result of Aetna ending Humana merger and plan to sell medicare advantage assets to Molina  Molina will get $75 million as termination fee  Source text: (http://bit.ly/2knLvt2) Further company coverage:",
        "date": "02142017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-Molina Healthcare to receive $75 mln termination fee following Aetna ending Humana merger "
    },
    {
        "content": "* After Price  Senate moves to Treasury nominee Mnuchin   (Adds Trump quotes)",
        "date": "02102017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 3-With eye on Obamacare  Price takes helm as U.S. health secretary "
    },
    {
        "content": "* Humana continues to build upon proven strategy following termination of merger with Aetna; provides 2017 financial guidance; announces capital deployment plans",
        "date": "02142017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-Humana continues to build upon proven strategy following termination of merger with Aetna "
    },
    {
        "content": "WASHINGTON  Feb 10 The U.S. Senate voted on Friday to confirm Representative Tom Price as the top U.S. healthcare official  putting a determined opponent of Obamacare in position to help President Donald Trump dismantle the healthcare law.",
        "date": "02102017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "U.S. Senate votes to confirm Rep. Price as health secretary "
    },
    {
        "content": "Feb 14 The following bids  mergers  acquisitions and disposals were reported by 1230 GMT on Tuesday:",
        "date": "02142017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Aetna Inc - Aetna will pay Humana $1 billion as a result of termination of merger agreement",
        "date": "02142017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-Aetna says it mutually ends merger agreement with Humana "
    },
    {
        "content": "* Aetna Inc - PillPack has joined its national network of preferred pharmacies for 2017",
        "date": "02022017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna said PillPack has joined its national network of preferred pharmacies for 2017 "
    },
    {
        "content": "Feb 14 Health insurer Aetna Inc and rival Humana Inc said on Tuesday they had mutually ended their $34 billion merger agreement.",
        "date": "02142017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna  Humana end $34 bln merger agreement "
    },
    {
        "content": "* Humana announces termination of merger with Aetna; schedules conference call with investors",
        "date": "02142017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-Humana announces termination of merger with Aetna "
    },
    {
        "content": "Health insurer Aetna Inc said on Tuesday it lost more money than expected on the Obamacare individual insurance plans  one of the main pillars of the Affordable Care Act that President Donald Trump is working to \"repeal and replace.\"",
        "date": "01312017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Insurer Aetna sees Obamacare changes ahead; no word on Humana "
    },
    {
        "content": "NEW YORK  Jan 31 Aetna Inc Chief Executive Officer Mark Bertolini said on Tuesday that he is optimistic about the next wave of healthcare reform being considered by lawmakers and regulators.",
        "date": "01312017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CEO says optimistic about health reform "
    },
    {
        "content": "* Clozels and investor Maag each stand to gain around $1.5 bln",
        "date": "01262017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Medical couple and butcher's boy win big from Actelion sale "
    },
    {
        "content": "Jan 31 Health insurer Aetna Inc said on Tuesday it lost more money than expected on the Obamacare individual insurance plans  one of the main pillars of the Affordable Care Act that President Donald Trump is working to \"repeal and replace.\"",
        "date": "01312017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 4-Insurer Aetna sees Obamacare changes ahead; no word on Humana "
    },
    {
        "content": "* SMI blue-chip index composition faces biggest change in years",
        "date": "01312017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Actelion  Syngenta takeovers set to shake up Swiss SMI index "
    },
    {
        "content": "Jan 31 Health insurer Aetna Inc  whose $34 billion deal for Humana Inc was blocked last week  reported a rise of about 5 percent in quarterly revenue on Tuesday  helped by higher premiums.",
        "date": "01312017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Health insurer Aetna's quarterly revenue rises about 5 pct "
    },
    {
        "content": "* Aetna Inc - Arrangement allows Aetna to reduce its required capital and provides $200 million of collateralized excess of loss reinsurance coverage",
        "date": "01272017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna announces transaction with Vitality Re VIII "
    },
    {
        "content": "Aetna  and Humana  would consider all available options for their proposed $34 billion merger  the two U.S. health insurers said on Tuesday  a day after a court ruled against the deal due to fears it would lower competition.",
        "date": "01242017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna  Humana to consider all options after court blocks merger "
    },
    {
        "content": "A U.S. judge blocked on Monday health insurer Aetna Inc's proposed $34 billion acquisition of smaller peer Humana Inc  raising the stakes for rival Anthem Inc  as it battles to close a $54 billion deal to buy Cigna Corp.",
        "date": "01232017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "U.S. blocks health insurer Aetna's $34 bln Humana acquisition "
    },
    {
        "content": "NEW YORK  Jan 24 The top executives of Aetna  and Humana on Tuesday issued a joint statement saying that they continue to believe in their $34 billion merger deal after a court ruled against it for antitrust reasons  and said that they would consider all available options.",
        "date": "01242017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna and Humana CEOs consider all available options after court loss "
    },
    {
        "content": "A U.S. judge blocked on Monday health insurer Aetna Inc's proposed $34 billion acquisition of smaller peer Humana Inc  raising the stakes for rival Anthem Inc as it battles to close a $54 billion deal to buy Cigna Corp. | Video ",
        "date": "01232017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "U.S. blocks health insurer Aetna's $34 billion Humana acquisition "
    },
    {
        "content": "Jan 23 A U.S. judge blocked on Monday health insurer Aetna Inc's proposed $34 billion acquisition of smaller peer Humana Inc  raising the stakes for rival Anthem Inc as it battles to close a $54 billion deal to buy Cigna Corp.",
        "date": "01232017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 3-U.S. blocks health insurer Aetna's $34 bln Humana acquisition "
    },
    {
        "content": "Jan 23 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Monday:",
        "date": "01232017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 23 (Fitch) Fitch Ratings does not plan to take immediate rating  action on Aetna Inc. (AET) and Humana  Inc. (HUM) following today's U.S.  District Court ruling in a civil suit filed by the Department of Justice (DOJ).  The judge's ruling effectively prohibits AET from moving forward with its  previously announced acquisition of HUM.  Absent legal action by AET or HUM to appeal the ruling and assuming the merger  agreem",
        "date": "01232017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Fitch: Ruling on Aetna-Humana Deal Unlikely to Change Ratings Absent Appeal "
    },
    {
        "content": "WASHINGTON  Jan 23 A U.S. federal judge blocked on Monday health insurer Aetna Inc's proposed $34 billion merger with rival Humana  saying it was illegal under antitrust law.",
        "date": "01232017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Federal judge blocks Aetna Inc's plan to buy rival Humana "
    },
    {
        "content": "BRUSSELS  Jan 18 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "01182017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "EU mergers and takeovers (Jan 18) "
    },
    {
        "content": "* Aetna's $34 billion takeover of Humana blocked by judge as anti-competitive - CNBC  citing DJ    Source text: http://bit.ly/2iWgSKB",
        "date": "01232017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-Aetna's $34 bln takeover of Humana blocked by judge as anti-competitive - CNBC "
    },
    {
        "content": "WASHINGTON President-elect Donald Trump's nominee to head the U.S. Department of Health and Human Services defended his stock holdings and proposals to dismantle Obamacare on Wednesday  saying Americans would not suddenly lose health insurance.",
        "date": "01182017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Trump health pick defends stocks  says Americans won't lose insurance "
    },
    {
        "content": "WASHINGTON  Jan 18 President-elect Donald Trump's nominee to head the U.S. Department of Health and Human Services defended his stock holdings and proposals to dismantle Obamacare on Wednesday  saying Americans would not suddenly lose health insurance.",
        "date": "01182017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 4-Trump health pick defends stocks  says Americans won't lose insurance "
    },
    {
        "content": "WASHINGTON  Jan 18 President-elect Donald Trump's nominee for health secretary was expected to face hard questions from a U.S. Senate panel on Wednesday about his personal stock investments and proposals to dismantle Obamacare.",
        "date": "01182017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Trump's health pick set to defend investments at U.S. Senate hearing "
    },
    {
        "content": "ZURICH Johnson & Johnson  and Actelion  have asked Switzerland's takeover board about the viability of a complicated takeover deal the U.S. healthcare company is discussing with the Swiss biotech firm  newspaper Tages-Anzeiger reported on Friday  without saying how it got the information.",
        "date": "01062017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "J&J  Actelion approach Swiss takeover board over deal structure: paper "
    },
    {
        "content": "ZURICH  Jan 6 Johnson & Johnson and Actelion have asked Switzerland's takeover board about the viability of a complicated takeover deal the U.S. healthcare company is discussing with the Swiss biotech firm  newspaper Tages-Anzeiger reported on Friday  without saying how it got the information.",
        "date": "01062017",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "J&J  Actelion approach Swiss takeover board over deal structure -paper "
    },
    {
        "content": "ZURICH Gilead Sciences has hired a top cancer specialist from Swiss drugmaker Novartis as the U.S. healthcare group sharpens its focus on oncology.",
        "date": "01042017",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Gilead poaches Novartis cancer specialist Riva "
    },
    {
        "content": "WASHINGTON The U.S. Justice Department sought on Monday to knock down arguments by Aetna Inc's  chief executive that Medicare Advantage competes with government insurance programs  making Aetna's proposed merger with Humana legal under antitrust law. Aetna CEO Mark Bertolini testified on Friday and returned to the witness stand Monday morning. The Justice Department sued to stop the merger in July.",
        "date": "12122016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "U.S. seeks to undercut Aetna CEO's defense in merger fight "
    },
    {
        "content": "WASHINGTON Aetna Inc's  chief executive denied on Friday that its withdrawal from some Obamacare exchanges was in retaliation for government efforts to halt its merger with Humana Inc   as he sought to convince a federal judge to approve the deal. The U.S. Justice Department sued to stop the $34 billion tie-up in July  saying that it and another insurance mega merger  Anthem Inc's  planned purchase of Cigna Corp   would mean higher ",
        "date": "12102016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna CEO defends merger with Humana in antitrust trial "
    },
    {
        "content": "WASHINGTON A U.S. Justice Department attorney told a federal judge on Monday that health insurer Aetna Inc's planned acquisition of Humana Inc would break antitrust law by reducing competition in Medicare Advantage and Obamacare exchange businesses  kicking off a trial expected to last weeks.",
        "date": "12052016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "U.S. attorneys argue Aetna-Humana deal violates antitrust law "
    },
    {
        "content": "VIENNA Novartis Chief Executive Joe Jimenez has played down suggestions the Swiss drugmaker could bid for Swiss biotech group Actelion  which is in talks with U.S. healthcare group Johnson & Johnson about a transaction.",
        "date": "12042016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Novartis CEO plays down prospects for Actelion bid: Blick "
    },
    {
        "content": "ZURICH Shares in Swiss biotech company Actelion  plunged on Tuesday after a report the company was not actively considering selling itself  but instead weighing a \"complicated deal\" to link with U.S. healthcare giant Johnson & Johnson .",
        "date": "11292016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Actelion shares plunge on report it eyes 'complicated' J&J deal "
    },
    {
        "content": "ZURICH  Nov 29 Shares in Swiss biotech company Actelion plunged on Tuesday after a report the company was not actively considering selling itself  but instead weighing a \"complicated deal\" to link with U.S. healthcare giant Johnson & Johnson.",
        "date": "11292016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Actelion shares plunge on report it eyes \"complicated\" J&J deal "
    },
    {
        "content": "Nov 24 U.S. healthcare company Johnson & Johnson  has approached Swiss biotechnology firm Actelion Ltd  about a potential takeover  Bloomberg reported on Thursday  citing people it said were familiar with the matter.",
        "date": "11242016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "J&J makes takeover approach for Swiss drugmaker Actelion -Bloomberg "
    },
    {
        "content": "* On November 21  company entered into a first amendment to term loan credit agreement dated as of July 30  2015- SEC filing",
        "date": "11222016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna entered into a first amendment to term loan credit agreement "
    },
    {
        "content": "WASHINGTON Anthem Inc and the U.S. Justice Department dug in their heels on Monday in court over whether the lower prices the health insurer expects to negotiate after buying smaller rival Cigna Corp are an efficiency that benefits customers or an antitrust violation.",
        "date": "11222016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Anthem argues Fortune 500 will not suffer from Cigna deal "
    },
    {
        "content": "NEW YORK Aetna Inc Chief Executive Officer Mark Bertolini said he expected some benefits of President Barack Obama's national healthcare reform law will stick under President-elect Donald Trump  like allowing young adults to stay on their family's health insurance.",
        "date": "11102016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna CEO expects some ACA benefits to stay: Dealbook conference "
    },
    {
        "content": "NEW YORK  Nov 10 Aetna Inc Chief Executive Officer Mark Bertolini said  he expected some benefits of President Barack Obama's national healthcare reform law will stick under President-elect Donald Trump  like allowing young adults to stay on their family's health insurance.",
        "date": "11102016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CEO expects some ACA benefits to stay-Dealbook conference "
    },
    {
        "content": "* Aetna and Banner Health launch a new joint venture health plan in Arizona",
        "date": "10312016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna and Banner Health announces a new JV health plan in Arizona "
    },
    {
        "content": "* Aetna adds Sarepta's DMD drug Exondys 51 to its precertification list  effective nov 15  Source text for Eikon: http://aet.na/2eR7liT Further company coverage:",
        "date": "10272016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna adds Sarepta's DMD drug Exondys 51 to its precertification list "
    },
    {
        "content": "U.S. health insurer Aetna Inc  warned on Thursday that losses from its Obamacare individual insurance plans will likely continue despite pulling out of the exchanges in most states  creating uncertainty for next year's earnings.",
        "date": "10272016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna says losses not over for Obamacare plans "
    },
    {
        "content": "Oct 27 U.S. health insurer Aetna Inc  warned on Thursday that losses from its Obamacare individual insurance plans will likely continue despite pulling out of the exchanges in most states  creating uncertainty for next year's earnings.",
        "date": "10272016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 3-Aetna says losses not over for Obamacare plans "
    },
    {
        "content": "* Aetna CEO says earliest it would reenter Obamacare exchanges if risks there improve is 2019 or more likely 2020",
        "date": "10272016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-Aetna reduced off exchange individual offerings for 2017 "
    },
    {
        "content": "NEW YORK  Oct 27 Aetna Inc. is committed to defending its proposed acquisition of Humana Inc. in court  where the U.S. Department of Justice is seeking to block the acquisition  Chief Executive Officer Mark Bertolini said on a conference call on Thursday.",
        "date": "10272016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CEO is committed to defending Humana acquisition "
    },
    {
        "content": "* Q3 revenue $15.8 billion versus I/B/E/S view $15.71 billion",
        "date": "10272016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "BRIEF-Aetna Q3 earnings per share $1.70 "
    },
    {
        "content": "Oct 21 EQT on Friday closed its acquisition of Press Ganey Holdings Inc  a provider of patient satisfaction surveys  giving the Swedish buyout firm its first foothold in the U.S. healthcare market  the company said.",
        "date": "10212016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "EQT completes acquisition of Press Ganey "
    },
    {
        "content": "Oct 27 Aetna Inc  No. 3 U.S. health insurer  reported an 8 percent rise in quarterly profit as memberships grew in its government business  which sells Medicaid and Medicare plans.",
        "date": "10272016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Health insurer Aetna's quarterly profit rises 8 pct "
    },
    {
        "content": "HONG KONG  Oct 12 Alibaba Group Holdings'  finance arm on Wednesday demonstrated a payment service that will allow virtual reality shoppers to pay for things in future just by nodding their heads.",
        "date": "10122016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Alibaba's new payment system lets virtual reality shoppers pay by nodding "
    },
    {
        "content": "* Aetna and Merck sign a unique value-based contract for Januvia and Janumet",
        "date": "10112016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna and Merck sign a contract for Januvia and Janumet "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.25/shr  Source text for Eikon:  Further company coverage:",
        "date": "09302016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna sets quarterly cash dividend of $0.25 per share "
    },
    {
        "content": "Sept 27 U.S. health insurer Aetna Inc  said it would offer some customers discounts on Apple Inc's  smartwatch  marking the first deal made by the tech giant with an insurer for its devices.",
        "date": "09272016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna to offer Apple Watch at a discount to certain customers "
    },
    {
        "content": "* Expect to reaffirm our full-year 2016 net income per share projection of $6.28 to $6.48",
        "date": "09122016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna expects to reaffirm FY 2016 net income per share projection of $6.28 to $6.48 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 12 (Fitch) The U.S. healthcare industry's shift to value has  created a secular upheaval that permeates nearly every sub-sector  says Fitch  Ratings in a report published today.  \"As the industry grapples with a range of issues  it's increasingly clear that  no corner of the healthcare industry will remain totally untouched \" says Megan  Neuburger  Managing Director  U.S. Corporates. \"All types of healthcare  compani",
        "date": "09122016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Fitch: U.S. Healthcare's Shift to Value Leaves No Sub-Sector Untouched "
    },
    {
        "content": "Sept 8 Hana Must Second Special Purpose Acquisition Co :",
        "date": "09082016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Hana Must Second Special Purpose Acquisition to change co name "
    },
    {
        "content": "* Agreement will give Aetna members continued in-network access to all piedmont facilities  Source text for Eikon:  Further company coverage:",
        "date": "09062016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna  Piedmont Healthcare announce new contract "
    },
    {
        "content": "NEW YORK Aetna Inc  warned in July that it would exit much of the individual Obamacare health insurance market if the government challenged its deal to buy rival Humana Inc   according to a letter it sent to the U.S. Department of Justice. | Video ",
        "date": "08172016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna warned it would cut Obamacare if Humana deal was blocked "
    },
    {
        "content": "NEW YORK  Aug 17 Aetna Inc warned in July that it would exit much of the individual Obamacare health insurance market if the government challenged its deal to buy rival Humana Inc  according to a letter it sent to the U.S. Department of Justice.",
        "date": "08172016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-Aetna warned it would cut Obamacare if Humana deal was blocked "
    },
    {
        "content": "NEW YORK  Aug 17 Aetna Inc's CEO said in a letter to the U.S. Department of Justice during the review of its deal to buy rival Humana Inc that the insurer would exit much of the individual Obamacare insurance market if the agency challenged the merger.",
        "date": "08172016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CEO warned it would cut Obamacare if Humana deal was blocked "
    },
    {
        "content": "NEW YORK Aetna Inc  the No. 3 U.S. health insurer  on Monday said that due to persistent financial losses on Obamacare plans  it will sell individual insurance on the government-run online marketplaces in only four states next year  down from the current 15 states.",
        "date": "08162016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna pulls back on Obamacare health insurance plans in 2017 "
    },
    {
        "content": "NEW YORK  Aug 15 Aetna Inc  the No. 3 U.S. health insurer  on Monday said that due to persistent financial losses on Obamacare plans  it will sell individual insurance on the government-run online marketplaces in only four states next year  down from the current 15 states.",
        "date": "08162016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 1-Aetna pulls back on Obamacare health insurance plans in 2017 "
    },
    {
        "content": "The federal judge hearing the U.S. Justice Department's case to block Aetna Inc's $34 billion purchase of Humana Inc has set a trial date for Dec. 5  later than the companies had requested.",
        "date": "08102016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Judge sets Aetna-Humana antitrust trial date for Dec. 5 "
    },
    {
        "content": "Washington DC  Aug 10 The federal judge hearing the U.S. Justice Department's case to block Aetna Inc's  $34 billion purchase of Humana Inc has set a trial date for Dec. 5  later than the companies had requested.",
        "date": "08102016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 1-Judge sets Aetna-Humana antitrust trial date for Dec. 5 "
    },
    {
        "content": "Washington DC The U.S. District Court judge hearing the U.S. Justice Department's case to block Aetna Inc.'s  $34 billion purchase of Humana Inc.  has set a trial date for Dec. 5  2016  later than the companies had requested.",
        "date": "08102016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Judge sets Aetna-Humana antitrust trial date for December 5 "
    },
    {
        "content": "* In case of termination of asset purchase deal on or prior to dec 31    aetna or humana to pay to co termination fee of $50 million",
        "date": "08052016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Molina says Aetna or Humana may pay to co fee of $50 mln  if deal is terminated on or prior to Dec 31 "
    },
    {
        "content": "WASHINGTON  July 8 Rising wages for U.S. healthcare workers had helped to drive a modest acceleration of inflation over the past year  but these gains in earnings have slowed  which could make it harder for the Federal Reserve to achieve its inflation target.",
        "date": "07082016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Cooling wages for U.S. healthcare workers dim inflation outlook "
    },
    {
        "content": "* Consolidation in US healthcare provider industry is likely to continue as CMS accelerates value-based care initiatives under Medicare program  Source text for Eikon:",
        "date": "06102016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Fitch says U.S. healthcare provider industry consolidation likely to continue "
    },
    {
        "content": "WASHINGTON Planned Parenthood filed a lawsuit against Ohio officials on Wednesday over a plan by the state to restrict the U.S. healthcare agency's access to state and federal funds  saying it was being singled out for providing abortion services.",
        "date": "05112016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Planned Parenthood sues Ohio over plan to restrict funds "
    },
    {
        "content": "WASHINGTON  May 11 Planned Parenthood filed a lawsuit against Ohio officials on Wednesday over a plan by the state to restrict the U.S. healthcare agency's access to state and federal funds  saying it was being singled out for providing abortion services.",
        "date": "05112016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-Planned Parenthood sues Ohio over plan to restrict funds "
    },
    {
        "content": "Aetna Inc  said more customers opted for its Obamacare plans in the first quarter than it had expected  but added that the program needed to be more flexible to become sustainable.",
        "date": "04282016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna adds more individual Obamacare customers than projected "
    },
    {
        "content": "April 25 Augmedix Inc  a startup that uses Alphabet Inc's Google Glass to provide documentation services to doctors and other healthcare workers  said on Monday it had closed a $17 million funding round led by investment firm Redmile Group.",
        "date": "04252016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Google Glass-based startup raises $17 mln in funding "
    },
    {
        "content": "* Says on track to close Humana deal by second-half of year   (Adds CEO comments from call)",
        "date": "04282016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-Aetna adds more individual Obamacare customers than projected "
    },
    {
        "content": "April 28 Aetna Inc  which is in the process of buying rival Humana Inc  reported a near 4 percent fall in quarterly operating earnings as the health insurer lost members in its commercial business.",
        "date": "04282016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Health insurer Aetna's operating earnings fall nearly 4 pct "
    },
    {
        "content": "* CEO Mark T. Bertolini 2015 total compensation of $17.3 million versus $15.1 million in 2014 - SEC FILING",
        "date": "04082016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna CEO Mark Bertolini's  2015 total compensation of $17.3 mln vs. $15.1 mln in 2014 - SEC Filing "
    },
    {
        "content": "* Rreaffirm full-year 2016 operating earnings per share projection of at least $7.75\u007f",
        "date": "03152016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Aetna \u007freaffirm 2016 oper earnings outlook of at least $7.75\u007f/share "
    },
    {
        "content": "* Manager Bruch says sees possibility of new projects in Iran in 2016",
        "date": "03102016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "BRIEF-Linde sees U.S. healthcare reimbursements dropping 40 pct "
    },
    {
        "content": "A federal judge has dismissed a proposed class action accusing Aetna Inc of violating a New Jersey regulation by trying to recoup money from its insureds' personal injury recoveries as preempted by the federal law  but suggested a way the litigation could move forward.",
        "date": "03042016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "New Jersey anti-subrogation rule may allow relief under ERISA - judge "
    },
    {
        "content": "WASHINGTON U.S. Republican presidential front-runner candidate Donald Trump on Wednesday unveiled proposals for reforming U.S. healthcare that included repealing Obamacare  allowing prescription drugs to be imported  and turning the Medicaid program for the poor into block grants to states.",
        "date": "03032016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Republican Trump releases healthcare proposals "
    },
    {
        "content": "WASHINGTON  March 2 U.S. Republican presidential front-runner candidate Donald Trump on Wednesday unveiled proposals for reforming U.S. healthcare that included repealing Obamacare  allowing prescription drugs to be imported  and turning the Medicaid program for the poor into block grants to states.",
        "date": "03032016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-U.S. Republican Trump releases healthcare proposals "
    },
    {
        "content": "WASHINGTON  March 2 U.S. Republican presidential front-runner candidate Donald Trump on Wednesday unveiled proposals for reforming U.S. healthcare that included repealing Obamacare  allowing prescription drugs to be imported  and turning the Medicaid program for the poor into block grants to states.",
        "date": "03032016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "U.S. Republican Trump releases healthcare proposals "
    },
    {
        "content": "Feb 15 Health insurer Aetna Inc said on Monday Florida's insurance regulator approved its acquisition of Humana Inc.",
        "date": "02162016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna gets Florida insurance regulator's approval for Humana deal "
    },
    {
        "content": "Health insurer Humana Inc   which is being bought by rival Aetna Inc   on Wednesday said that it had set aside 74 cents per share in the fourth quarter to cover anticipated shortfalls in its 2016 individual health plan business.",
        "date": "02102016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Health insurer Humana takes fourth-quarter charge for 2016 individual losses "
    },
    {
        "content": "NEW YORK U.S.-based health insurers Cigna Corp and Aetna Inc have struck deals with Novartis AG for a performance-based price for the Swiss drugmaker's new heart drug  Entresto  the companies said on Monday.",
        "date": "02092016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Novartis sets heart-drug price with two insurers based on health outcome "
    },
    {
        "content": "Feb 10 Health insurer Humana Inc  which is being bought by rival Aetna Inc  on Wednesday said that it had set aside 74 cents per share in the fourth quarter to cover anticipated shortfalls in its 2016 individual health plan business.",
        "date": "02102016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-Health insurer Humana takes 4Q charge for 2016 individual losses "
    },
    {
        "content": "NEW YORK  Feb 8 U.S.-based health insurers Cigna Corp and Aetna Inc have struck deals with Novartis AG for a performance-based price for the Swiss drugmaker's new heart drug  Entresto  the companies said on Monday.",
        "date": "02092016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "CORRECTED-UPDATE 1-Novartis sets heart-drug price with two insurers based on health outcome "
    },
    {
        "content": "Feb 10 Health insurer Humana Inc  which is being bought by rival Aetna Inc  reported an 8.4 percent rise in quarterly total revenue  helped by strength in its Medicare Advantage business.",
        "date": "02102016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Health insurer Humana's quarterly revenue rises "
    },
    {
        "content": "NEW YORK  Feb 1 Aetna Inc Chief Executive Officer Mark Bertolini said on Monday that he is concerned that the individual healthcare exchanges created under the Affordable Care Act are not sustainable and that recent government proposals for changes are not enough.",
        "date": "02012016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CEO says Obamacare exchanges need change to be sustainable "
    },
    {
        "content": "Health insurer Aetna Inc  which is in the process of buying smaller rival Humana Inc  said on Monday its Obamacare insurance business improved at the end of last year  providing a stronger starting point for 2016.",
        "date": "02012016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna says individual exchange business improved; shares gain "
    },
    {
        "content": "* CEO says government should revise exchange rules   (Adds analyst  CFO comments  updates shares  bulletpoint)",
        "date": "02012016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 4-Aetna says individual exchange business improved; shares gain "
    },
    {
        "content": "Feb 1 Health insurer Aetna reported a 38 percent rise in quarterly profit  helped by strong performance in its government business that sells Medicare and Medicaid plans.",
        "date": "02012016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Health insurer Aetna profit rises "
    },
    {
        "content": "WASHINGTON  Jan 21 Aetna Inc's plan to buy smaller insurer Humana Inc for $31 billion will mean seniors will pay higher Medicare Advantage premiums  according to a new report by the think tank Center for American Progress (CAP).",
        "date": "01212016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna's deal for Humana will push up costs for seniors - think tank "
    },
    {
        "content": "WASHINGTON Aetna Inc's  plan to buy smaller insurer Humana Inc  for $31 billion will mean seniors will pay higher Medicare Advantage premiums  according to a new report by the think tank Center for American Progress (CAP).",
        "date": "01212016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna's deal for Humana will push up costs for seniors: think tank "
    },
    {
        "content": "Jan 12 The chief executive of Aetna Inc  on Tuesday said the health insurer is not about to withdraw from the public health exchange market  even after losing money on the business last year.",
        "date": "01132016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CEO says he is not giving up on public insurance exchanges "
    },
    {
        "content": "SAN FRANCISCO Aetna Inc  Chief Executive Mark Bertolini said on Tuesday that he still expects the company's $37 billion acquisition of rival Humana Inc  to close this year.",
        "date": "01122016",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna CEO sees Humana deal on track to close this year "
    },
    {
        "content": "Jan 12 AETNA CEO MARK BERTOLINI SAYS IT'S NOT TIME TO GIVE UP ON PUBLIC HEALTH INSURANCE EXCHANGES AETNA CEO SAYS IMPORTANT TO INSURE ALL AMERICANS AETNA CEO SAYS IT'S IMPORTANT TO MAKE RETAIL MARKET WORK IN HEALTHCARE   (Reporting by Susan Kelly in Chicago)",
        "date": "01132016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CEO says not time to give up on health insurance exchanges "
    },
    {
        "content": "A federal judge on Monday dismissed a lawsuit seeking to force the U.S. Securities and Exchange Commission to adopt a rule requiring publicly traded companies to disclose political contributions.",
        "date": "01042016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "SEC not required to make firms disclose political contributions: judge "
    },
    {
        "content": "Jan 4 A federal judge on Monday dismissed a lawsuit seeking to force the U.S. Securities and Exchange Commission to adopt a rule requiring publicly traded companies to disclose political contributions.",
        "date": "01042016",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "SEC not required to make firms disclose political contributions -judge "
    },
    {
        "content": "STOCKHOLM/WASHINGTON General Electric on Monday walked away from a $3.3 billion agreement to sell its appliances business to Sweden's Electrolux  terminating the deal after months of opposition from U.S. antitrust regulators. | Video ",
        "date": "12072015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "GE calls off Electrolux appliance deal amid U.S. antitrust fight "
    },
    {
        "content": "* Electrolux shares fall as much as 15 percent   (Adds Breakingviews link  updates share prices)",
        "date": "12072015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 5-GE calls off Electrolux appliance deal amid U.S. antitrust fight "
    },
    {
        "content": "The U.S. Federal Trade Commission said it has filed a complaint aimed at stopping Staples Inc   the nation's largest office supply store  from buying its top rival  Office Depot Inc .",
        "date": "12072015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "U.S. files complaint to stop Staples from buying Office Depot "
    },
    {
        "content": "* Shares fall 5.5 percent  weigh on other insurers  hospitals   (New throughout  adds outside comment)",
        "date": "11192015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 5-UnitedHealth may exit Obamacare individual exchanges "
    },
    {
        "content": "UnitedHealth Group Inc  the largest U.S. health insurer  warned on Thursday that it might stop selling individual health plans on the Obamacare exchanges in 2017  citing weak enrollment and high medical costs for people who did sign up.",
        "date": "11192015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UnitedHealth may exit Obamacare individual exchanges "
    },
    {
        "content": "U.S. health insurers Aetna Inc  and Anthem Inc  on Friday sought to reassure investors that their Obamacare businesses had not worsened after UnitedHealth Group Inc  warned of mounting losses in that sector.",
        "date": "11202015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna  Anthem reassure investors on Obamacare business "
    },
    {
        "content": "* UnitedHealth to decide next year whether to leave exchanges",
        "date": "11192015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "RPT-UPDATE 3-UnitedHealth may exit Obamacare individual exchanges "
    },
    {
        "content": "U.S. health insurers Aetna Inc and Anthem Inc on Friday sought to reassure investors that their Obamacare businesses had not worsened after UnitedHealth Group Inc warned of mounting losses in that sector.",
        "date": "11202015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna  Anthem say individual Obamacare business performing as expected "
    },
    {
        "content": "Nov 20 Health insurer Aetna reaffirmed its full-year 2015 operating earnings forecast on Friday  a day after UnitedHealth Group Inc cut its guidance  blaming deteriorating performance in its individual Obamacare business.",
        "date": "11202015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Health insurer Aetna reaffirms 2015 profit forecast "
    },
    {
        "content": "MILAN  Oct 26 European shares were seen opening little changed on Monday  with a rate-cut effect seen as fading slightly in Europe after markets rallied to two-month highs on Friday on signs of more central bank support.",
        "date": "10262015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "European Factors to Watch-Shares seen flat as rate-cut effect fades "
    },
    {
        "content": "Health insurer Aetna Inc  raised its full-year operating earnings forecast for the fourth time this year on strong performance in its government business and said underlying operating earnings would increase in 2016.",
        "date": "10292015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna raises forecast as government plans expand "
    },
    {
        "content": "AMSTERDAM  Oct 26 Philips on Monday reported better-than-expected quarterly profits on cost cutting and strong orders for its  U.S. healthcare business  but said the sale of its Lumileds division  worth $3.3 billion  is in doubt.",
        "date": "10262015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "RPT-Philips beats on Q3 profit  but sale of Lumileds in doubt "
    },
    {
        "content": "AMSTERDAM  Oct 26 Philips on Monday reported better-than-expected quarterly profits on cost cutting and strong orders for its  U.S. healthcare business  but said the sale of its Lumileds division  worth $3.3 billion  is in doubt.",
        "date": "10262015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Philips beats on Q3 profit  but sale of Lumileds in doubt "
    },
    {
        "content": "Oct 29 Pfizer Inc  the No. 1 U.S. drugmaker  and Botox maker Allergan Plc said they were in friendly talks to create a pharmaceutical colossus but the prospect that the company would seek to avoid U.S. taxes sounded political alarm bells.",
        "date": "10292015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 5-Pfizer  Allergan drug merger talks raise tax hackles in U.S. "
    },
    {
        "content": "* Shares rise as much as 4.4 percent to $116.07   (Adds comments from CEO  analysts; updates shares)",
        "date": "10292015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 3-Aetna raises forecast as government plans expand "
    },
    {
        "content": "Oct 28 Health insurer Anthem Inc said on Wednesday that its Obamacare insurance business is being hampered by lower-than-anticipated enrollment due to fewer applicants than expected and cheaper premium rates at competitors.",
        "date": "10282015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-Anthem shares falls as Obamacare business hampers profit "
    },
    {
        "content": "Oct 29 Health insurer Aetna Inc reported a 1.5 percent increase in quarterly revenue  helped by membership growth in its government business.",
        "date": "10292015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Health insurer Aetna revenue rises "
    },
    {
        "content": "Oct 19 Health insurer Aetna's proposed acquisition of smaller rival Humana Inc was approved by the shareholders of both companies.",
        "date": "10192015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna  Humana shareholders approve proposed merger "
    },
    {
        "content": "Oct 19 Health insurer Aetna's proposed $37 billion acquisition of smaller rival Humana Inc was approved by the shareholders of both companies.",
        "date": "10192015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 1-Aetna  Humana shareholders approve proposed merger "
    },
    {
        "content": "WASHINGTON Democratic presidential candidate Hillary Clinton has \"serious concerns\" about health insurer Aetna's plan to acquire Humana and Anthem's proposal to buy Cigna  saying the multi-billion-dollar deals should be closely reviewed by U.S. regulators.",
        "date": "10212015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Clinton has \"serious concerns\" about Aetna-Humana  Anthem-Cigna mergers "
    },
    {
        "content": "WASHINGTON Democratic presidential candidate Hillary Clinton has \"serious concerns\" about health insurer Aetna's plan to acquire Humana and Anthem's proposal to buy Cigna  saying the multi-billion-dollar deals should be closely reviewed by U.S. regulators.",
        "date": "10212015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Clinton has 'serious concerns' about Aetna-Humana  Anthem-Cigna mergers "
    },
    {
        "content": "WASHINGTON  Oct 21 Democratic presidential candidate Hillary Clinton has \"serious concerns\" about health insurer Aetna's plan to acquire Humana and Anthem's proposal to buy Cigna  saying the multi-billion-dollar deals should be closely reviewed by U.S. regulators.",
        "date": "10212015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 1-Clinton has \"serious concerns\" about Aetna-Humana  Anthem-Cigna mergers "
    },
    {
        "content": "WASHINGTON  Oct 21 Democratic presidential candidate Hillary Clinton has \"serious concerns\" about health insurer Aetna's plan to acquire Humana and Anthem's proposal to buy Cigna  saying the multi-billion-dollar deals should be closely reviewed by U.S. regulators.",
        "date": "10212015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "RPT-Clinton has \"serious concerns\" about Aetna-Humana  Anthem-Cigna mergers "
    },
    {
        "content": "NEW YORK Angered by videos in which Planned Parenthood officials discussed compensation for providing fetal tissue from abortions  Republicans in Congress are again demanding an end to government funding for the nearly 100-year-old provider of women’s health services. ",
        "date": "09082015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Planned Parenthood faces unexpected challenge from Obamacare "
    },
    {
        "content": "NEW YORK  Sept 8 Angered by videos in which Planned Parenthood officials discussed compensation for providing fetal tissue from abortions  Republicans in Congress are again demanding an end to government funding for the nearly 100-year-old provider of women's health services.",
        "date": "09082015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "RPT-INSIGHT-Planned Parenthood faces unexpected challenge from Obamacare "
    },
    {
        "content": "NEW YORK  Sept 8 Angered by videos in which Planned Parenthood officials discussed compensation for providing fetal tissue from abortions  Republicans in Congress are again demanding an end to government funding for the nearly 100-year-old provider of women's health services.",
        "date": "09082015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "INSIGHT-Planned Parenthood faces unexpected challenge from Obamacare "
    },
    {
        "content": "General Electric Co  said it would sell its U.S. healthcare finance unit to credit card lender Capital One Financial Corp  for about $9 billion as it winds down its finance arm and returns to its industrial roots.",
        "date": "08112015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "GE to sell healthcare finance business to Capital One for $9 billion "
    },
    {
        "content": "* GE has now announced finance asset sales of $78 bln   (Adds details  background  shares)",
        "date": "08112015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-GE to sell healthcare finance business to Capital One for $9 bln "
    },
    {
        "content": "Credit card lender Capital One Financial Corp  is in exclusive talks to acquire General Electric Co's  U.S. healthcare finance unit  in a deal likely to top $10 billion  according to people familiar with the matter.",
        "date": "08072015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Exclusive: Capital One nears deal to acquire GE health finance unit - sources "
    },
    {
        "content": "Credit card lender Capital One Financial Corp  is in exclusive talks to acquire General Electric Co's  U.S. healthcare finance unit  in a deal likely to top $10 billion  according to people familiar with the matter.",
        "date": "08062015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Exclusive: Capital One nears deal to acquire GE health finance unit - sources "
    },
    {
        "content": "* Shares rise as much as 9.6 pct   (Adds details from conference call; updates shares)",
        "date": "08052015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-Health insurer WellCare raises forecast  looks to buy assets "
    },
    {
        "content": "Aetna Inc  on Tuesday reported a better-than-expected adjusted net profit for the second quarter and said \"moderate\" medical costs boosted the profitability of its government Medicare and Medicaid plans.",
        "date": "08042015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna profit beats as moderate medical costs help government plans "
    },
    {
        "content": "Aetna Inc Chief Executive Mark Bertolini said on Tuesday the company is talking to federal and state officials on its $37 billion acquisition of Humana Inc  and that there is enough insurance competition for it to receive approval.",
        "date": "08042015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CEO says antitrust process underway in Humana deal "
    },
    {
        "content": "NEW YORK  Aug 4 Aetna Inc Chief Executive Mark Bertolini said on Tuesday the company is talking to federal and state officials on its $37 billion acquisition of Humana Inc and that there is enough insurance competition for it to receive approval.",
        "date": "08042015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 1-Aetna CEO says antitrust process underway in Humana deal "
    },
    {
        "content": "NEW YORK  Aug 4 Aetna Inc chief executive Mark Bertolini said on Tuesday that the company had begun making regulatory filings with both federal and state authorities related to its acquisition of Humana Inc.",
        "date": "08042015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CEO says has begun antitrust work on Humana deal "
    },
    {
        "content": "NEW YORK  Aug 4 Aetna Inc Chief Financial Officer Shawn Guertin said on Tuesday that the health insurer expects 2015 medical cost trend to increase at the low end of a range of 6 percent to 7 percent.",
        "date": "08042015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CFO says expects 2015 medical cost trend at low end "
    },
    {
        "content": "Health insurer Humana Inc   which earlier this month agreed to be bought by Aetna Inc  for $37 billion  on Wednesday reported a rise in a key medical cost metric that missed analyst expectations.",
        "date": "07292015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Humana says medical costs cut into second-quarter profit "
    },
    {
        "content": "Aug 4 Aetna Inc on Tuesday reported a better-than-expected adjusted net profit for the second quarter and said \"moderate\" medical costs boosted the profitability of its government Medicare and Medicaid plans.",
        "date": "08042015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-Aetna profit beats as moderate medical costs help government plans "
    },
    {
        "content": "Aug 4 Health insurer Aetna Inc  which is in the process of buying rival Humana Inc for $37 billion  reported a 33 percent rise in quarterly profit as it added more members to its government plans.",
        "date": "08042015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Health insurer Aetna's profit rises 33 pct "
    },
    {
        "content": "July 29 Health insurer Humana Inc  which earlier this month agreed to be bought by Aetna Inc for $37 billion  on Wednesday reported a rise in a key medical cost metric that missed analyst expectations.",
        "date": "07292015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-Humana says medical costs cut into second-quarter profit "
    },
    {
        "content": "BRUSSELS  July 28 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "07282015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "EU mergers and takeovers (July 28) "
    },
    {
        "content": "* Combined company would be No. 1 insurer  cover 53 mln members",
        "date": "07242015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "UPDATE 5-Anthem to buy Cigna  creating biggest U.S. health insurer "
    },
    {
        "content": "The U.S. House of Representatives Judiciary Committee is planning two hearings for September to discuss concerns about reduced competition in the healthcare industry  lawmakers from both parties said.",
        "date": "07272015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "U.S. House panel to hold hearings on competition in healthcare "
    },
    {
        "content": "SAN FRANCISCO A year and a half after the Affordable Care Act brought widespread reforms to the U.S. healthcare system  Chicago's Cook County Health & Hospitals System has made its first profit in 180 years.",
        "date": "07232015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Some public hospitals win  others lose with Obamacare "
    },
    {
        "content": "NEW YORK/WASHINGTON U.S. insurance regulators and state attorneys general are lining up to scrutinize Aetna Inc's proposed $33 billion takeover of rival Humana Inc for potential harm to consumers  complicating what is already expected to be a tough and lengthy review by federal antitrust authorities.",
        "date": "07102015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "States line up to scrutinize Aetna's $33 bln Humana deal "
    },
    {
        "content": "NEW YORK U.S. health insurer Aetna Inc  is lining up a $16.2 billion bridge loan to fund its acquisition of smaller rival Humana Inc   which is the first multibillion M&A loan of the second half of 2015 and the second-largest acquisition bridge loan so far this year  according to Thomson Reuters LPC data.",
        "date": "07092015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna's $16.2 billion bridge loan is second-biggest this year "
    },
    {
        "content": "NEW YORK/WASHINGTON U.S. insurance regulators and state attorneys general are lining up to scrutinize Aetna Inc's proposed $33 billion takeover of rival Humana Inc for potential harm to consumers  complicating what is already expected to be a tough and lengthy review by federal antitrust authorities.",
        "date": "07102015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "States line up to scrutinize Aetna's $33 billion Humana deal "
    },
    {
        "content": "NEW YORK  July 9 U.S. health insurer Aetna Inc  is lining up a $16.2 billion bridge loan to fund its acquisition of smaller rival Humana Inc  which is the first multibillion M&A loan of the second half of 2015 and the second-largest acquisition bridge loan so far this year  according to Thomson Reuters LPC data.",
        "date": "07092015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "TRLPC: Aetna's $16.2B bridge loan is second-biggest this year "
    },
    {
        "content": "July 7 Health insurer Humana Inc and buyer Aetna Inc set fees to be paid in the event of a failure of the largest deal in the health insurance industry.",
        "date": "07072015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Humana  Aetna set termination fees for deal "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  July 07 (Fitch) The for-profit hospital industry is well positioned  with respect to the anticipated wave of mergers and acquisitions (M&A) amongst  the largest for-profit health insurers  but consolidation could have some  important longer term ramifications  according to Fitch Ratings. M&A amongst health insurers is not likely to immediately result in outright  price pressure for hospitals. In many markets  health insurers a",
        "date": "07072015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Fitch: US Hospitals Well Positioned for Insurer Consolidation "
    },
    {
        "content": "NEW YORK Aetna Inc's  chief executive said Monday he was confident any antitrust review of the health insurer's proposed purchase of smaller rival Humana Inc  would allow the deal to close in the second half of 2016. | Video ",
        "date": "07062015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CEO addresses antitrust concerns over Humana deal "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 07 (Fitch) Fitch Ratings has placed the ratings of Aetna Inc.  (Aetna) on Rating Watch Negative. The rating action follows Aetna's recent  announcement that it has reached an agreement to acquire Humana Inc. (Humana) in  a cash and stock transaction valued at approximately $37 billion. A full list of  rating actions follows at the end of this release. KEY RATING DRIVERS The rating action reflects Fitch's concern about Aetn",
        "date": "07072015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Fitch Places Aetna on Rating Watch Negative "
    },
    {
        "content": "BRUSSELS  July 2 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "07022015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "EU mergers and takeovers (July 2) "
    },
    {
        "content": "NEW YORK  July 6 Aetna Inc's chief executive said Monday he was confident any antitrust review of the health insurer's proposed purchase of smaller rival Humana Inc would allow the deal to close in the second half of 2016.",
        "date": "07062015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 3-Aetna CEO addresses antitrust concerns over Humana deal "
    },
    {
        "content": "NEW YORK  July 6 Humana Inc  fresh from announcing an agreement to be purchased by larger rival Aetna Inc  prompted new investor concerns about the $33 billion deal on Monday by lowering its 2015 financial forecasts.",
        "date": "07062015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Humana cuts outlook  raising new concerns about Aetna deal "
    },
    {
        "content": "NEW YORK  July 3 Aetna Inc's $37 billion deal to buy smaller health insurer Humana Inc will face rigorous scrutiny from U.S. regulators  which antitrust experts said could also make other large-scale mergers in the sector more difficult.",
        "date": "07032015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "UPDATE 1-Aetna's Humana deal to bring scrutiny on other insurer tie-ups -experts "
    },
    {
        "content": "NEW YORK Aetna Inc's  $37 billion deal to buy smaller health insurer Humana Inc  will face rigorous scrutiny from U.S. regulators  which antitrust experts said could also make other large-scale mergers in the sector more difficult.",
        "date": "07032015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna’s Humana deal to bring scrutiny on other insurer tie-ups "
    },
    {
        "content": "NEW YORK  July 3 Aetna Inc's $37 billion deal to buy smaller health insurer Humana Inc will face rigorous scrutiny from U.S. regulators  which antitrust experts said could also make other large-scale mergers in the sector more difficult.",
        "date": "07032015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna's Humana deal to bring scrutiny on other insurer tie-ups -experts "
    },
    {
        "content": "* Indexes down: Dow 0.3 pct  S&P 0.4 pct  Nasdaq 0.3 pct   (Updates prices  changes comment  byline)",
        "date": "07062015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "US STOCKS-Energy leads Wall St lower with eyes on Greece  China "
    },
    {
        "content": "Health insurer Aetna Inc  on Friday said it would buy smaller rival Humana Inc  for about $37 billion in cash and stock  in the largest ever deal in the insurance industry.",
        "date": "07032015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna to buy Humana for $37 billion in largest insurance deal "
    },
    {
        "content": "July 6 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "07062015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "July 3 Health insurer Aetna Inc on Friday said it would buy smaller rival Humana Inc for about $37 billion in cash and stock  in the largest ever deal in the insurance industry.",
        "date": "07032015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 7-Aetna to buy Humana for $37 bln in largest insurance deal "
    },
    {
        "content": "U.S. health insurer Aetna Inc  is close to buying rival Humana Inc  and a deal could be signed as early as this weekend  Bloomberg reported  citing people familiar with the matter.",
        "date": "06252015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna close to buying Humana: Bloomberg "
    },
    {
        "content": "* Indexes down: Dow 0.2 pct  S&P 0.29 pct  Nasdaq 0.3 pct   (Updates to early afternoon)",
        "date": "07062015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "US STOCKS-Wall St off session lows as Greece aid deal optimism grows "
    },
    {
        "content": "July 3 Health insurer Aetna Inc said it will buy Humana Inc for about $37 billion  or about $230 per share  in a cash-and-stock deal.",
        "date": "07032015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna to buy Humana for $37 bln in cash and stock "
    },
    {
        "content": "July 2 U.S health insurer Aetna Inc is nearing an agreement to buy rival Humana Inc for about $34 billion in a cash and stock deal  people familiar with the matter told Reuters on Thursday.",
        "date": "07032015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "CORRECTED-UPDATE 4-Aetna nears deal to buy Humana for about $34 bln -sources "
    },
    {
        "content": "June 25 U.S. health insurer Aetna Inc is close to buying rival Humana Inc and a deal could be signed as early as this weekend  Bloomberg reported  citing people familiar with the matter.",
        "date": "06252015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-Aetna close to buying Humana - Bloomberg "
    },
    {
        "content": "June 25 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "06252015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "July 6 U.S. stocks erased most of their earlier losses  even turning positive briefly  on Monday after the International Monetary Fund said it is ready to assist Greece if asked.",
        "date": "07062015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "REFILE-US STOCKS-Wall St pares losses after IMF says ready to help Greece "
    },
    {
        "content": "July 2 U.S health insurer Aetna Inc is nearing an agreement to buy rival Humana Inc in a cash and stock deal  two people familiar with the matter told Reuters on Thursday.",
        "date": "07032015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna nears deal to buy Humana at $230 a share -sources "
    },
    {
        "content": "June 25 Health insurer Aetna Inc is close to buying rival Humana Inc  and a deal could be signed as early as this weekend  Bloomberg reported.",
        "date": "06252015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "REFILE-Aetna close to buying Humana - Bloomberg "
    },
    {
        "content": "* Iran talks drag crude prices lower   (Updates trading  adds U.S. markets  changes byline  dateline  previous LONDON)",
        "date": "06252015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "GLOBAL MARKETS-Stocks little changed with eyes on Greece; oil off "
    },
    {
        "content": "WASHINGTON Health insurer Aetna Inc  has made a takeover proposal to rival Humana Inc   the Wall Street Journal reported on Saturday. It gave no details.",
        "date": "06202015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna Inc makes takeover proposal to Humana Inc - WSJ "
    },
    {
        "content": "WASHINGTON  June 20 Health insurer Aetna Inc  has made a takeover proposal to rival Humana Inc   the Wall Street Journal reported on Saturday. It gave no details.        (Reporting by Mohammad Zargham Editing by W Simon)",
        "date": "06202015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna Inc makes takeover proposal to Humana Inc -WSJ "
    },
    {
        "content": "* Cigna shares touch record high of $162.16   (Adds Breakingviews link)",
        "date": "06152015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "UPDATE 4-Cigna rebuffs takeover approach by Anthem - WSJ "
    },
    {
        "content": "WASHINGTON  June 14 Justice Anthony Kennedy was furious when a majority on the U.S. Supreme Court upheld President Barack Obama's healthcare law. As he read the dissenting opinion from the bench three years ago  his anger was palpable. The majority regards its opinion \"as judicial modesty \" he declared. \"It is not. It amounts instead to a vast judicial over-reaching.\"",
        "date": "06152015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "RPT-The voice of opposition past  Justice Kennedy may save Obamacare now "
    },
    {
        "content": "WASHINGTON  June 14 Justice Anthony Kennedy was furious when a majority on the U.S. Supreme Court upheld President Barack Obama's healthcare law. As he read the dissenting opinion from the bench three years ago  his anger was palpable. The majority regards its opinion \"as judicial modesty \" he declared. \"It is not. It amounts instead to a vast judicial over-reaching.\"",
        "date": "06142015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "The voice of opposition past  Justice Kennedy may save Obamacare now "
    },
    {
        "content": "NEW YORK Connecticut Governor Dannel Malloy on Friday proposed cutting planned business taxes by $223.7 million over two years after several large corporations threatened to leave the state.",
        "date": "06122015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Connecticut governor proposes scrapping business taxes "
    },
    {
        "content": "NEW YORK  June 12 Connecticut Governor Dannel Malloy on Friday proposed cutting planned business taxes by $223.7 million over two years after several large corporations threatened to leave the state.",
        "date": "06122015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 4-Connecticut governor proposes scrapping business taxes "
    },
    {
        "content": "NEW YORK  June 4 General Electric Co has assembled an \"exploratory team\" to look at moving its headquarters out of Connecticut after lawmakers passed a budget that includes $1.2 billion in tax increases despite protests from some of the state's biggest corporations.",
        "date": "06042015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "UPDATE 2-Immelt asks GE team to weigh Connecticut pullout after tax hike "
    },
    {
        "content": "NEW YORK Aetna Inc's  state tax burden will increase 27 percent after Connecticut's lawmakers passed a budget that extends a corporate tax surcharge  taxes business on group-wide income  and raises a tax on data processing  the company said Thursday.",
        "date": "06042015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna says state tax burden to jump 27 percent on Connecticut budget "
    },
    {
        "content": "NEW YORK Medicare  the government-run health insurance program for elderly and disabled Americans  paid physicians $90 billion in 2013  up 17 percent from $77 billion in 2012  U.S. healthcare officials reported on Monday.",
        "date": "06012015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Medicare paid doctors $90 billion in 2013  up 17 percent: officials "
    },
    {
        "content": "NEW YORK  June 1 Medicare  the government-run health insurance program for elderly and disabled Americans  paid physicians $90 billion in 2013  up 17 percent from $77 billion in 2012  U.S. healthcare officials reported on Monday.",
        "date": "06012015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Medicare paid doctors $90 billion in 2013  up 17 pct -officials "
    },
    {
        "content": "U.S. healthcare conglomerate Johnson & Johnson said on Wednesday it expects to submit more than 10 new medicines with annual revenue potential of at least $1 billion each to regulators by 2019  and is testing dozens of new uses for existing medicines.",
        "date": "05202015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "J&J to submit at least 10 new drugs for approval by 2019 "
    },
    {
        "content": "May 20 U.S. healthcare conglomerate Johnson & Johnson said on Wednesday it expects to submit more than 10 new medicines with annual revenue potential of at least $1 billion each to regulators by 2019  and is testing dozens of new uses for existing medicines.",
        "date": "05202015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-J&J to submit at least 10 new drugs for approval by 2019 "
    },
    {
        "content": "Thomson Reuters May 15  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.             ** For",
        "date": "05152015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "WASHINGTON  May 13 A newly created non-profit organization sued the U.S. Securities and Exchange Commission on Wednesday in an effort to force the agency to adopt rules requiring companies to disclose political contributions.",
        "date": "05132015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Non-profit sues U.S. SEC to force political disclosures rules "
    },
    {
        "content": "Thomson Reuters May 13  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.             ** For",
        "date": "05132015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "NEW YORK  April 28 Aetna Inc CEO Mark Bertolini said on Tuesday that it added more new customers than expected through the individual Obamacare exchanges  and that their average age was a bit lower this year than in 2014.",
        "date": "04282015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna CEO says 2015 Obamacare members skew younger "
    },
    {
        "content": "Aetna Inc   the third-largest U.S. health insurer  on Tuesday reported first-quarter profit that beat analyst expectations and said spending on medical claims in the first quarter remained low.",
        "date": "04282015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Health insurer Aetna's medical costs are low  boosting profit "
    },
    {
        "content": "April 28 Aetna Inc  the third-largest U.S. health insurer  on Tuesday reported first-quarter profit that beat analyst expectations and said spending on medical claims in the first quarter remained low.",
        "date": "04282015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-Health insurer Aetna's medical costs are low  boosting profit "
    },
    {
        "content": "April 28 Aetna Inc  the third-largest U.S. health insurer   reported a 16.8 percent rise in first-quarter profit as it added 122 000 more members compared with the fourth quarter.",
        "date": "04282015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Health insurer Aetna's profit rises as it adds more members "
    },
    {
        "content": " (This version of the April 12 story corrects reference to Dr. Daly's role in publishing recommendations for genetic testing in paragraph 18) | Video ",
        "date": "04142015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna  Cigna balk as Angelina effect spurs genetic cancer testing "
    },
    {
        "content": "NEW YORK  April 12 Medical researchers call it the \"Angelina Effect \" the surge in demand for genetic testing attributable to movie star Angelina Jolie's public crusade for more aggressive detection of hereditary breast and ovarian cancer.",
        "date": "04142015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "CORRECTED-INSIGHT-Aetna  Cigna balk as Angelina effect spurs genetic cancer testing "
    },
    {
        "content": "NEW YORK  April 13 Medical researchers call it the \"Angelina Effect \" the surge in demand for genetic testing attributable to movie star Angelina Jolie's public crusade for more aggressive detection of hereditary breast and ovarian cancer.",
        "date": "04132015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "RPT - INSIGHT-Aetna  Cigna balk as Angelina effect spurs genetic cancer testing "
    },
    {
        "content": "NEW YORK  April 12 Medical researchers call it the \"Angelina Effect \" the surge in demand for genetic testing attributable to movie star Angelina Jolie's public crusade for more aggressive detection of hereditary breast and ovarian cancer.",
        "date": "04122015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "INSIGHT-Aetna  Cigna balk as Angelina effect spurs genetic cancer testing "
    },
    {
        "content": "NEW YORK  April 14 Several high-ranking bankers have left their jobs at major investment banks in the last 13 months amid a surge in U.S. healthcare deal activity to seek better compensation at boutique investment banks as well as to participate in the growth of the industry at biotech companies themselves.",
        "date": "04142015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "RPT - INSIGHT-Banks see talent flee amid healthcare M&A boom "
    },
    {
        "content": "NEW YORK Several high-ranking bankers have left their jobs at major investment banks in the last 13 months amid a surge in U.S. healthcare deal activity to seek better compensation at boutique investment banks as well as to participate in the growth of the industry at biotech companies themselves.",
        "date": "04142015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Banks see talent flee amid healthcare M&A boom "
    },
    {
        "content": "CHICAGO A U.S. healthcare worker who was being treated for Ebola at a National Institutes of Health hospital in Maryland has been declared free of the virus and was released from the hospital on Thursday  according to the U.S. aid agency Partners In Health.",
        "date": "04092015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "American with Ebola released from U.S. hospital: aid group  NIH "
    },
    {
        "content": "NEW YORK  April 14 Several high-ranking bankers have left their jobs at major investment banks in the last 13 months amid a surge in U.S. healthcare deal activity to seek better compensation at boutique investment banks as well as to participate in the growth of the industry at biotech companies themselves.",
        "date": "04142015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "INSIGHT-Banks see talent flee amid healthcare M&A boom "
    },
    {
        "content": "Brokerages are rolling out software to help financial advisers with a challenge that can seem like fortune-telling: projecting clients' retirement health care costs.",
        "date": "03272015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "U.S. healthcare software triggers client reality check "
    },
    {
        "content": "March 27 Brokerages are rolling out software to help financial advisers with a challenge that can seem like fortune-telling: projecting clients' retirement health care costs.",
        "date": "03272015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "CORRECTED-(OFFICIAL)-YOUR PRACTICE-U.S. healthcare software triggers client reality check "
    },
    {
        "content": "March 18 The last two members of a group of U.S. healthcare workers whose colleague is being treated for the Ebola virus returned on Wednesday from Sierra Leone to the United States  where they are being monitored for possible exposure to the deadly virus.",
        "date": "03192015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Two more U.S. healthcare workers repatriated for Ebola monitoring "
    },
    {
        "content": "CHICAGO Another four U.S. healthcare workers were flown back to the United States for monitoring for possible exposure to the Ebola virus  U.S. Centers for Disease Control and Prevention said on Tuesday.",
        "date": "03172015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Another four U.S. Ebola aid workers flown back to U.S. for monitoring "
    },
    {
        "content": "CHICAGO  March 17 Another four U.S. healthcare workers were flown back to the United States for monitoring for possible exposure to the Ebola virus  U.S. Centers for Disease Control and Prevention said on Tuesday.",
        "date": "03172015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Another four US Ebola aid workers flown back to US for monitoring "
    },
    {
        "content": "WASHINGTON  March 13 A U.S. healthcare worker who tested positive for Ebola while in Sierra Leone was in serious condition at a Maryland hospital  and a second American who may have been exposed to that patient was being flown back to the United States  U.S. health officials said on Friday.",
        "date": "03132015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "UPDATE 5-U.S. healthcare worker with Ebola in 'serious' condition  NIH says "
    },
    {
        "content": "The U.S. National Institutes of Health will admit to its hospital on Friday a U.S. healthcare worker who tested positive for the Ebola virus while working in Sierra Leone.",
        "date": "03122015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "NIH center to admit U.S. healthcare worker with Ebola "
    },
    {
        "content": "March 12 The U.S. National Institutes of Health will admit to its hospital on Friday a U.S. healthcare worker who tested positive for the Ebola virus while working in Sierra Leone.",
        "date": "03122015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 1-NIH center to admit U.S. healthcare worker with Ebola "
    },
    {
        "content": "March 12 The U.S. National Institutes of Health said it plans to admit a U.S. healthcare worker on Friday who has tested positive for Ebola while working in Sierra Leone.",
        "date": "03122015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "NIH says to admit U.S. healthcare worker infected with Ebola "
    },
    {
        "content": "* BOJ's ETF buying supports mood - analysts     * Drugmakers outperform on strong U.S. healthcare shares     * Rakuten falls after Goldman cuts rating      By Ayai Tomisawa     TOKYO  March 5 Japan's Nikkei share average edged up on Thursday after the central bank bought more exchange-traded funds  but gains were limited by investor caution ahead of U.S. jobs data on Friday.     The Nikkei opened lower  but rose 0.2 percent to 18 742.97 by mid-morning  not far from its 15-year high o",
        "date": "03052015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Nikkei edges up  BOJ's ETF buying helps sentiment "
    },
    {
        "content": "An Arizona hospital operator has sued three Aetna affiliates for allegedly underpaying for emergency services given to out-of-network patients.",
        "date": "03032015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Arizona Aetna affiliates sued over alleged underpaying "
    },
    {
        "content": "CVS Health warned on Tuesday that the costs of a potent new class of cholesterol treatments could eclipse those of other expensive medicines and overwhelm the U.S. healthcare system \"if rigid cost control mechanisms are not put in place.\"",
        "date": "02172015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "CVS urges cost controls for new cholesterol drugs "
    },
    {
        "content": "Feb 17 CVS Health warned on Tuesday that the costs of a potent new class of cholesterol treatments could eclipse those of other expensive medicines and overwhelm the U.S. healthcare system \"if rigid cost control mechanisms are not put in place.\"",
        "date": "02172015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-CVS urges cost controls for new cholesterol drugs "
    },
    {
        "content": "Feb 17 CVS Health Corp  the second-largest U.S. pharmacy chain operator  has warned that a new class of drugs being developed to lower \"bad\" cholesterol could cost the U.S. healthcare system as much as $150 billion per year.",
        "date": "02172015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "CVS says new cholesterol drugs could cost U.S. $150 bln/year "
    },
    {
        "content": "Feb 3 Healthcare services provider Cardinal Health Inc said its unit was accused of fraud and violating U.S. healthcare laws by a whistleblower under the False Claims Act.",
        "date": "02042015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Whistleblower files U.S. fraud suit against Cardinal Health "
    },
    {
        "content": "Aetna Inc   the third largest U.S. health insurer  raised its 2015 profit forecast after negotiating a price cut from Gilead Sciences Inc  on hepatitis C treatments for this year.",
        "date": "02032015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Health insurer Aetna raises 2015 profit forecast "
    },
    {
        "content": "Feb 3 Aetna Inc  the third largest U.S. health insurer  raised its 2015 profit forecast after negotiating a price cut from Gilead Sciences Inc on hepatitis C treatments for this year.",
        "date": "02032015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 3-Health insurer Aetna raises 2015 profit forecast "
    },
    {
        "content": "* Futures up: Dow 40 pts  S&P 4.25 pts  Nasdaq 5.25 pts   (Adds oil gains  updates prices)",
        "date": "02032015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "US STOCKS-Wall St to gain at open on Greek deal hopes  oil lift "
    },
    {
        "content": "Thermo Fisher Scientific Inc   the world's largest maker of scientific instruments  forecast 2015 sales and earnings below analysts' expectations  becoming the latest U.S. healthcare company to warn about a strengthening dollar.",
        "date": "01292015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Thermo Fisher says strong dollar to hurt revenue  profit "
    },
    {
        "content": "Feb 3 Aetna Inc Chief Financial Officer Shawn Guertin said on Tuesday that it increased 2015 earnings expectations - to at least $7 per share from at least $6.90 per share - due at least in part to discounts it negotiated for pricey hepatitis C drugs.",
        "date": "02032015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CFO says drug price negotiations partly boosted 2015 earnings view "
    },
    {
        "content": "Jan 29 Thermo Fisher Scientific Inc  the world's largest maker of scientific instruments  forecast 2015 sales and earnings below analysts' expectations  becoming the latest U.S. healthcare company to warn about a strengthening dollar.",
        "date": "01292015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 1-Thermo Fisher says strong dollar to hurt revenue  profit "
    },
    {
        "content": "Feb 3 Aetna Inc Chief Executive Officer Mark Bertolini said on Tuesday that he expects the U.S. health insurer to end the first quarter with 800 000 members who signed up through the individual Obamacare exchanges.",
        "date": "02032015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CEO expects 800 000 Obamacare exchange members in Q1 "
    },
    {
        "content": "NEW YORK  Feb 3 U.S. stock index futures climbed on Tuesday  with the benchmark S&P 500 index set to continue a rally fueled by hopes of a deal on Greek debt.",
        "date": "02032015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "US STOCKS-Futures climb on hopes for Greek debt deal "
    },
    {
        "content": "Feb 3 Health insurer Aetna Inc's net income fell 37 percent in the fourth quarter as investment spending rose and expenses related to healthcare reforms increased.",
        "date": "02032015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Health insurer Aetna's profit falls as expenses rise "
    },
    {
        "content": "Aetna Inc  the third-largest U.S. health insurer  said it negotiated a discount with Gilead Sciences Inc for its hepatitis C treatment and will offer it as the preferred choice to nearly 11 million commercial customers.",
        "date": "01162015",
        "name": "Aetna Inc",
        "news_type": "topStory",
        "symbol": "AET",
        "title": "Aetna backs Gilead's hepatitis C treatment  gets discount "
    },
    {
        "content": "SAN FRANCISCO/WASHINGTON Jan 15 U.S. healthcare executives say Obamacare is likely here to stay  despite repeated calls from Republican lawmakers for repeal of the 2010 law aimed at providing health coverage for millions of uninsured Americans.",
        "date": "01152015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "U.S. healthcare executives say Obamacare is not going anywhere "
    },
    {
        "content": "Jan 16 Aetna Inc  the third-largest U.S. health insurer  said it negotiated a discount with Gilead Sciences Inc for its hepatitis C treatment and will offer it as the preferred choice to nearly 11 million commercial customers.",
        "date": "01162015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "UPDATE 2-Aetna backs Gilead's hepatitis C treatment  gets discount "
    },
    {
        "content": "SAN FRANCISCO/WASHINGTON Jan 15 U.S. healthcare executives say Obamacare is likely here to stay  despite repeated calls from Republican lawmakers for repeal of the 2010 law aimed at providing health coverage for millions of uninsured Americans.",
        "date": "01162015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "RPT-U.S. healthcare executives say Obamacare is not going anywhere "
    },
    {
        "content": "Jan 13 The chief executive of health insurer Aetna Inc on Tuesday said that the company had not yet decided which hepatitis C drugs to cover now that there are two breakthrough treatments on the market  but said that the company was actively working on a decision.",
        "date": "01132015",
        "name": "Aetna Inc",
        "news_type": "normal",
        "symbol": "AET",
        "title": "Aetna CEO says no decision yet on how to cover hepatitis C drugs "
    }
]