[
    {
        "content": "* Aflac Inc announces retirement of Kriss Cloninger III from Aflac Inc's board of directors; appoints new board member Katherine T. Rohrer Source text for Eikon: Further company coverage:",
        "date": "11142017",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "BRIEF-Aflac announces retirement of Kriss Cloninger III from its board "
    },
    {
        "content": "* Aflac incorporated announces third quarter results  upwardly revises 2017 operating eps outlook  increases fourth quarter cash dividend 4.7 pct",
        "date": "10252017",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "BRIEF-Aflac reports Q3 earnings per share $1.80 "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 17 (Fitch) Fitch Ratings has assigned a 'BBB' rating to Aflac  Inc.'s (Aflac) proposed issuance of 2.108% JPY60 billion subordinated notes due 2047. KEY RATING DRIVERS The rating for the new offering is equivalent to the rating on Aflac's existing subordinated debt. The notes are rated three notches below the company's 'A' Insurer Default Rating (IDR)  which reflects Fitch's assumption of \"poor\" recovery prospects in th",
        "date": "10172017",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "Fitch Rates Aflac Inc.'s JPY60 Billion Subordinated Debt 'BBB' "
    },
    {
        "content": "* Aflac Inc will soon float about 60 billion yen or so in yen-denominated hybrid bonds - Nikkei  ‍​ Source text : (http://s.nikkei.com/2ibbR10) Further company coverage:",
        "date": "10132017",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "BRIEF-Aflac will soon float about 60 bln yen in yen-denominated hybrid bonds - Nikkei‍​ "
    },
    {
        "content": "* Aflac Incorporated board of directors increases shares authorized for repurchase",
        "date": "08082017",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "BRIEF-Aflac Incorporated board increases shares authorized for repurchase "
    },
    {
        "content": "* Aflac Incorporated announces second quarter results  affirms 2017 outlook  declares third quarter cash dividend",
        "date": "07272017",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "BRIEF-Aflac Q2 operating earnings per share $1.83 "
    },
    {
        "content": "* Aflac - received notice of unsolicited mini-tender offer by TRC Capital corporation to buy up to 1.5 million shares of aflac incorporated common stock",
        "date": "06272017",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "BRIEF-Aflac receives notice of unsolicited mini-tender offer by TRC Capital Corp to buy up to 1.5 mln shares of Aflac common stock "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 02 (Fitch) Fitch Ratings has affirmed Aflac Inc.'s (Aflac) primary life insurance subsidiaries' Insurer Financial Strength (IFS) ratings at 'A+' and revised the Outlook to Stable from Negative. Fitch has affirmed Aflac's Issuer Default Rating (IDR) at 'A' and senior debt ratings at 'A-'. The Rating Outlook is Stable. A full list of rating actions follows at the end of this release. KEY RATING DRIVERS Today's actions follow ",
        "date": "05022017",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "Fitch Affirms Aflac's Ratings; Revises IFS Outlook to Stable "
    },
    {
        "content": "* Aflac Incorporated announces first quarter results  affirms 2017 outlook  declares second quarter cash dividend",
        "date": "04272017",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "BRIEF-Aflac reports Q1 earnings per share $1.47 "
    },
    {
        "content": "* Aflac- aflac global investments will initially fund $500 million portfolio",
        "date": "03312017",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "BRIEF-Aflac announces investment partnership with Nxt Capital "
    },
    {
        "content": "* Pursuing investment opportunities targeting early-stage companies whose mission is relevant to Aflac's core business",
        "date": "03202017",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "BRIEF-Aflac pursuing investment opportunities targeting early-stage cos "
    },
    {
        "content": "* Aflac inc - ceo daniel amos' total 2016 compensation was $20.4 million versus $20 million in 2015 - sec filing",
        "date": "03162017",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "BRIEF-Aflac CEO Daniel Amos' 2016 compensation $20.4 mln vs $20 mln in 2015 "
    },
    {
        "content": "* Aflac Incorporated announces fourth quarter results  reports 2016 net earnings of $2.7 billion  2016 operating EPS in line with guidance  affirms 2017 outlook  declares first quarter cash dividend",
        "date": "01312017",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "BRIEF-Aflac Inc reports Q4 earnings per share $1.84 "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 18 (Fitch) Fitch Ratings has assigned an 'A-' rating to the  0.932% JPY60 billion senior unsecured notes due 2027 issued by Aflac  Inc.  (Aflac). The 'A-' rating is equivalent to Fitch's ratings on Aflac's outstanding  senior unsecured notes.  KEY RATING DRIVERS Aflac intends to use the net proceeds from this offering for general corporate  purposes  including replenishing cash used to repurchase the company's 6.9%  sen",
        "date": "01182017",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "Fitch Rates Aflac Inc.'s Senior Debt Issues 'A-' "
    },
    {
        "content": "* Says co's president Kriss Cloninger \u007f will retire  effective on Dec. 31",
        "date": "01202017",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "BRIEF-Aflac's president Kriss Cloninger \u007f will retire on Dec. 31 "
    },
    {
        "content": "* Aflac incorporated announces third quarter results  upwardly revises 2016 operating EPS outlook  increases fourth quarter cash dividend 4.9 pct",
        "date": "10272016",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "BRIEF-Aflac reports Q3 EPS $1.53 "
    },
    {
        "content": "May 10 Wall Street securities analysts revised their ratings and price targets on several U.S.-listed companies  including Your Community Bankshares  Kohls and Nordic American Tanker  on Tuesday.            HIGHLIGHTS      * Aflac Inc        : FBR cuts to market perform rating        * Sprouts Farmers market Inc        : Goldman Sachs cuts to sell from neutral        * Hasbro Inc        : Piper Jaffray cuts to neutral from overweight           * St. Jude Medical Inc        : SunTrust",
        "date": "05102016",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "U.S. RESEARCH ROUNDUP-Aflac  St. Jude Medical  Gap "
    },
    {
        "content": "* Aflac names J. Todd Daniels as executive vice president; global chief risk officer and chief actuary  Aflac Inc  Source text for Eikon:  Further company coverage:",
        "date": "05022016",
        "name": "Aflac Incorporated",
        "news_type": "topStory",
        "symbol": "AFL",
        "title": "BRIEF-Aflac Inc names J. Todd Daniels executive vice president "
    },
    {
        "content": "WASHINGTON The U.S. Federal Communications Commission said late on Tuesday it had approved European telecoms group Altice NV's acquisition of U.S. cable company Cablevision Systems Corp in a $17.7 billion deal that includes assumption of debt.",
        "date": "05042016",
        "name": "Aflac Incorporated",
        "news_type": "normal",
        "symbol": "AFL",
        "title": "U.S. FCC approves Altice purchase of Cablevision Systems "
    }
]