[
    {
        "content": "Allergan PLC can proceed with a false advertising lawsuit seeking to stop Imprimis Pharmaceuticals Inc from selling compounded drugs that bypass regulatory approval  including a cheaper alternative to Allergan's dry eye drug  Restasis  a federal judge has ruled.",
        "date": "11162017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan may pursue lawsuit against drug compounder Imprimis "
    },
    {
        "content": "* As of Nov 8  ‍GIC Private reports a 5.11 pct passive stake in  - SEC filing ​ Source text: (http://bit.ly/2zMOtvp) Further company coverage:",
        "date": "11162017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-‍GIC Private reports a 5.11 pct passive stake in Allergan ​ "
    },
    {
        "content": "* Paulson & Co Inc dissolves share stake in Facebook Inc ‍​- SEC filing",
        "date": "11142017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Paulson & Co dissolves share stake in Facebook  cuts share stake in Allergan "
    },
    {
        "content": "* Cuts share stake in AIG to 841 740 shares from 1.3 million shares",
        "date": "11142017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Omega Advisors takes share stake in Aetna  dissolves stake in Allergan "
    },
    {
        "content": "NEW YORK Allergan Plc  said on Monday it will sell just under a quarter of its roughly 10 percent stake in Israel's Teva Pharmaceutical Industries  during the first quarter of 2018  as it starts to unwind its position in the struggling generic drugmaker.",
        "date": "11132017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan to sell a quarter of its Teva stake in first quarter of 2018 "
    },
    {
        "content": "NEW YORK  Nov 13 Allergan Plc said on Monday it will sell just under a quarter of its roughly 10 percent stake in Israel's Teva Pharmaceutical Industries during the first quarter of 2018  as it starts to unwind its position in the struggling generic drugmaker.",
        "date": "11132017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan to sell a quarter of its Teva stake in Q1 2018 "
    },
    {
        "content": "* Amgen and Allergan receive positive CHMP opinion for ABP 215 (biosimilar bevacizumab) for the treatment of certain types of cancer",
        "date": "11102017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Amgen and Allergan receive positive chmp opinion for ABP 215 "
    },
    {
        "content": "A congressional subcommittee on Tuesday heard testimony from intellectual property experts about the validity of drugmaker Allergan PLC's agreement with a Native American tribe to shield patents from review by the Patent Trial and Appeal Board.",
        "date": "11072017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "IP experts testify before Congress on Allergan tribal patent deal "
    },
    {
        "content": "* Allergan receives FDA approval for use of Vraylar (cariprazine) in the maintenance treatment of schizophrenia",
        "date": "11132017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan receives FDA approval for use of Vraylar in maintenance treatment of schizophrenia "
    },
    {
        "content": "ZURICH  Nov 10 Novartis's bid to move in on Bayer's and Regeneron's eye-drug turf was buoyed on Friday by data showing patients on the Swiss drugmaker's new RTH258 drug showed less disease activity than those on its rivals' drug Eylea.",
        "date": "11102017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Novartis posts eye drug data amid play for Eylea's turf "
    },
    {
        "content": "Nov 7 A group of U.S. senators on Tuesday asked drugmaker Allergan Plc to produce documents relating to its agreement to transfer patents to a Native American tribe to shield them from review by an administrative court.",
        "date": "11072017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "U.S. senators press Allergan for details on patent deal with tribe "
    },
    {
        "content": "Nov 2 A U.S. House of Representatives subcommittee on Thursday called a Nov. 7 hearing on the legitimacy of an agreement between drugmaker Allergan Plc and a Native American tribe intended to shield patents from administrative review.",
        "date": "11022017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "U.S. Congress to hold hearing on Allergan tribal patent deal "
    },
    {
        "content": "* Q3 earnings per share view $-0.22 -- Thomson Reuters I/B/E/S",
        "date": "11022017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Ironwood Pharmaceuticals Q3 non-GAAP loss per share $0.18 "
    },
    {
        "content": "Nov 1 Botox-maker Allergan Plc on Wednesday said it will begin to sell off its nearly 10 percent stake in Teva Pharmaceutical Industries  which has lost 60 percent of its value so far this year.",
        "date": "11012017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan to begin selling its 10 percent stake in Teva "
    },
    {
        "content": "* Allergan receives approval for Ozurdex® (dexamethasone intravitreal implant 0.7 mg) in China for the treatment of retinal vein occlusion (RVO)",
        "date": "10302017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan receives approval for Ozurdex in China for treatment of retinal vein occlusion "
    },
    {
        "content": "* Allergan Plc says on October 16  company received a civil investigative demand from the State of North Carolina Department of Justice‍​ - SEC filing",
        "date": "11022017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan receives civil investigative demand from the State of North Carolina DoJ "
    },
    {
        "content": "* Allergan Plc​ announces its intention to begin process of selling the ordinary shares of Teva Pharmaceutical Industries in a prudent and orderly manner",
        "date": "11012017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan says to begin process of sale of its Teva Pharmaceutical shares "
    },
    {
        "content": "Allergan Plc on Wednesday reassured shareholders that it would return to earnings growth in 2019 after losing a major patent ruling last month on its second-most important drug  dry-eye treatment Restasis. | Video ",
        "date": "11012017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan assuages shareholder fears over losing Restasis patent "
    },
    {
        "content": "Nov 1 Allergan Plc on Wednesday reassured shareholders that it would return to earnings growth in 2019 after losing a major patent ruling last month on its second-most important drug  dry-eye treatment Restasis.",
        "date": "11012017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 4-Allergan assuages shareholder fears over losing Restasis patent "
    },
    {
        "content": "* Says expects 2018 non-GAAP EPS of no less than $15 if a Restasis generic competitor launches in january 2018",
        "date": "11012017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan gives 2018 guidance based on Restasis competition "
    },
    {
        "content": "Nov 1 Botox-maker Allergan Plc said on Wednesday its quarterly net sales rose 11.4 percent on higher demand for its medical aesthetics products.",
        "date": "11012017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "CORRECTED-Allergan third-quarter revenue rises 11.4 pct "
    },
    {
        "content": "* Allergan board of directors announces fourth quarter 2017 cash dividend and increases quarterly cash dividend for 2018",
        "date": "10272017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan announces Q4 2017 cash dividend; increases qtrly cash dividend for 2018 "
    },
    {
        "content": "Shares of Imprimis Pharmaceuticals Inc  sky-rocketed as much as 91 percent on Thursday  after the company said it would launch a cheaper alternative to Allergan Plc's  controversial dry eye drug  Restasis  by next month.",
        "date": "10202017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Imprimis Pharma to take on Allergan's Restasis with cheaper product "
    },
    {
        "content": "Groups representing healthcare providers  consumers and trade unions on Thursday urged the U.S. Senate Judiciary Committee to investigate Allergan PLC's attempt to shield some of its patents from administrative review by transferring them to a Native American tribe.",
        "date": "10192017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Labor  consumer groups urge probe of Allergan tribal patent deal "
    },
    {
        "content": "Oct 19 Shares of Imprimis Pharmaceuticals Inc sky-rocketed as much as 91 percent on Thursday  after the company said it would launch a cheaper alternative to Allergan Plc's controversial dry eye drug  Restasis  by next month.",
        "date": "10202017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 3-Imprimis Pharma to take on Allergan's Restasis with cheaper product "
    },
    {
        "content": "Oct 19 Shares of Imprimis Pharmaceuticals sky-rocketed as much as 91.1 percent on Thursday  after it said it would offer a cheaper option to Allergan's dry eye disease medicine  Restasis.",
        "date": "10192017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Imprimis Pharma to take on Allergan's Restasis with cheaper product "
    },
    {
        "content": "Oct 18 A Native American tribe sued Amazon.com Inc and Microsoft Corp in federal court in Virginia on Wednesday for infringing supercomputer patents it is holding for a technology firm.",
        "date": "10182017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "UPDATE 1-Native American tribe holding patents sues Amazon and Microsoft "
    },
    {
        "content": "* Syndax Pharmaceuticals Inc - ‍expands pipeline with exclusive worldwide license to Allergan's portfolio of Menin-MLL inhibitors​",
        "date": "10172017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Syndax Pharmaceuticals says ‍expands pipeline with exclusive worldwide license to Allergan's portfolio of Menin-MLL inhibitors​ "
    },
    {
        "content": "Oct 16 A U.S. judge on Monday invalidated patents issued to Allergan Plc on its dry eye medicine Restasis  saying they covered ideas that were too obvious to protect.",
        "date": "10162017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "U.S. judge in Texas invalidates Allergan patents on Restasis "
    },
    {
        "content": "Oct 18 A Native American tribe sued Amazon.com Inc and Microsoft Corp in federal court in Virginia on Wednesday for infringing supercomputer patents it is holding for a technology firm.",
        "date": "10182017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Native American tribe holding patents sues Amazon and Microsoft "
    },
    {
        "content": "* On Oct 13  co entered into license agreement with Vitae Pharmaceuticals  a subsidiary of Allergan Plc​ - SEC filing",
        "date": "10172017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Syndax Pharma enters into license agreement with unit of Allergan "
    },
    {
        "content": "Oct 16 A U.S. judge on Monday invalidated patents on Allergan Plc's dry-eye medicine Restasis on grounds that the patents cover ideas that are obvious  sending shares of the pharmaceutical company down 3.5 percent.",
        "date": "10162017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 3-U.S. judge in Texas invalidates Allergan patents on Restasis "
    },
    {
        "content": "* U.S. District Court for the Eastern District of Texas issues adverse trial decision concerning Restasis (cyclosporine ophthalmic emulsion) 0.05% patents",
        "date": "10162017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-U.S. Court issues adverse decision concerning Allergan's Restasis "
    },
    {
        "content": "A U.S. judge’s ruling on Monday invalidating Allergan Plc's  patents on its blockbuster $1.5 billion dry-eye medicine  Restasis  has cast doubt on the company's novel strategy to enlist a Native American tribe to help shield those patents from challenge by generic drugmakers  legal experts said.",
        "date": "10182017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan ruling casts doubt on tribal patent strategy "
    },
    {
        "content": "* U.S. district court for Eastern District of Texas issued decision finding asserted claims of patents relating to Restasis invalid ​",
        "date": "10172017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-‍Mylan invalidates Allergan's patents on Restasis​ "
    },
    {
        "content": "* Neos Therapeutics announces settlement with Actavis on Adzenys XR-ODT patent litigation",
        "date": "10182017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Neos therapeutics announces settlement with Actavis on Adzenys XR-ODT patent litigation "
    },
    {
        "content": "Oct 12 Allergan Plc said on Thursday it reached a settlement with InnoPharma Inc  one of the four generic drugmakers challenging the patents for its dry eye medication Restasis in federal court.",
        "date": "10122017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan settles with one of four companies contesting Restasis patent "
    },
    {
        "content": "Last month  in the midst of post-trial briefing in Allergan’s patent suit against generic drug makers that want to begin selling a version of Allergan’s dry eye medication Restasis  Allergan sent a one-paragraph letter to U.S. District Judge William Bryson of Marshall  Texas. Allergan informed the judge that it had just assigned its rights to the patents at issue in the case to the Saint Regis Mohawk Tribe  which  in turn  had granted Allergan an exclusive license to the patents. All",
        "date": "10112017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Texas judge poised to decide if Allergan patent deal with Mohawks was a sham "
    },
    {
        "content": "Allergan Plc's Forest Laboratories unit has agreed to pay $4 million to resolve a lawsuit claiming the drugmaker discriminated against female sales representatives  according to court papers.",
        "date": "10092017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan's Forest to pay $4 million to settle gender discrimination case "
    },
    {
        "content": "* Possible buyers include existing OTC drugmakers and Nestle (Adds Breakingviews link)",
        "date": "10102017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 4-Pfizer weighs $15 bln sale of consumer healthcare business "
    },
    {
        "content": "* Allergan announces settlement on Restasis® (cyclosporine ophthalmic emulsion) 0.05% patent litigation with Innopharma  Inc.",
        "date": "10122017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan announces settlement on Restasis patent litigation with Innopharma "
    },
    {
        "content": "NEW YORK  Oct 5 Democratic U.S. Senator Claire McCaskill on Thursday said she drafted a bill stating that tribal sovereign immunity cannot be used to block U.S. Patent and Trademark Office review of a patent.",
        "date": "10052017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Senator McCaskill drafts bill in response to Allergan patent maneuver "
    },
    {
        "content": "NEW YORK A U.S. House of Representatives committee launched a probe into drugmaker Allergan Plc's  deal to transfer some of its patents to a Native American tribe to shield them from review.",
        "date": "10032017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "U.S. House committee launches probe of Allergan patent deal "
    },
    {
        "content": "NEW YORK  Oct 5 Democratic U.S. Senator Claire McCaskill on Thursday said she drafted a bill stating that tribal sovereign immunity cannot be used to block U.S. Patent and Trademark Office review of a patent.",
        "date": "10052017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Senator McCaskill drafts bill in response to Allergan patent maneuver "
    },
    {
        "content": "Oct 2 Allergan Plc was sued on Monday by Shire Plc for allegedly scheming to block doctors from prescribing its new treatment for dry eye disease.",
        "date": "10022017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Shire sues Allergan in U.S. over dry eye drug "
    },
    {
        "content": "NEW YORK  Oct 3 A U.S. House of Representatives committee launched a probe into drugmaker Allergan Plc's deal to transfer some of its patents to a Native American tribe to shield them from review.",
        "date": "10032017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 2-U.S. House committee launches probe of Allergan patent deal "
    },
    {
        "content": "* House Oversight Committee Says Launches Probe Into Allergan Patent deal with native american tribe",
        "date": "10032017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-U.S. House committee launches probe into Allergan patent deal "
    },
    {
        "content": "NEW YORK  Oct 3 Allergan Plc Chief Executive Brent Saunders on Tuesday  defended his company's decision to transfer drug patents to a Native American tribe as a proper way to shield them from a flawed patent review process  in a response to congressional criticism.",
        "date": "10032017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan CEO says patent review flawed in response to senators "
    },
    {
        "content": "WASHINGTON A federal court in Texas on Friday ruled that the Obama administration acted unlawfully last year when its Treasury Department cracked down on U.S. companies that try to reduce their U.S. taxes by rebasing abroad  in a process known as inversion.",
        "date": "10022017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "U.S. court strikes down Obama-era rule on tax inversions "
    },
    {
        "content": "Four U.S. senators have asked the Senate Judiciary Committee to launch an investigation into a deal drugmaker Allergan Plc  struck with a Native American tribe to protect some of its patents from generic challenge  according to a letter seen by Reuters.",
        "date": "09272017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Senators want probe of Allergan transfer deal with tribe: letter "
    },
    {
        "content": "Sept 27 Four U.S. senators have asked the Senate Judiciary Committee to launch an investigation into a deal drugmaker Allergan Plc struck with a Native American tribe to protect some of its patents from generic challenge  according to a letter seen by Reuters.",
        "date": "09272017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-U.S. senators want probe of Allergan transfer deal with tribe -letter "
    },
    {
        "content": "* Allergan receives refusal to file letter from FDA for Vraylar (Cariprazine) supplemental new drug application (SNDA) for the treatment of negative symptoms in Schizophrenia",
        "date": "09222017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan receives refusal to file letter from FDA for Vraylar SNDA "
    },
    {
        "content": "Sept 22 A Native American tribe holding patents for drugmaker Allergan Plc on Friday moved to dismiss a case brought by generic drug company Mylan NV challenging the patents.",
        "date": "09222017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Native American tribe moves to dismiss Allergan patent case "
    },
    {
        "content": "Sept 22 A Native American tribe holding patents for drugmaker Allergan Plc on Friday moved to dismiss a case brought by generic drug company Mylan NV challenging the patents.",
        "date": "09222017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Native American tribe moves to dismiss Allergan patent case "
    },
    {
        "content": "U.S. drugmaker Allergan Plc  on Monday authorized a $2 billion buyback of its common stock  sending its shares up after a week of disappointing news on its drug development pipeline.",
        "date": "09252017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan boosts shares with $2 billion buyback "
    },
    {
        "content": "* New data from CENTAUR phase 2b clinical study supports continued development of cenicriviroc (CVC) in ongoing phase 3 AURORA trial",
        "date": "09222017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan Plc says new data from phase 2b study supports continued development of cenicriviroc in ongoing phase 3 trial "
    },
    {
        "content": "Sept 25 U.S. drugmaker Allergan Plc on Monday authorized a $2 billion buyback of its common stock  sending its shares up after a week of disappointing news on its drug development pipeline.",
        "date": "09252017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 2-Allergan boosts shares with $2 bln buyback "
    },
    {
        "content": "* Allergan board of directors authorizes new $2 billion share repurchase program  affirms commitment to increasing cash dividend annually",
        "date": "09252017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan board authorizes new $2 billion share repurchase program "
    },
    {
        "content": "Sept 25 U.S. drugmaker Allergan Plc on Monday authorized a $2 billion buyback of its shares and said its Chief Financial Officer Tessa Hilado would retire.",
        "date": "09252017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan sets $2 bln share buyback; CFO to retire "
    },
    {
        "content": "* Allergan announces Tessa Hilado  executive vice president and chief financial officer  to retire from company",
        "date": "09252017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan Plc - CFO to retire "
    },
    {
        "content": " (Fixes date in dateline)     By Jan  Wolfe     Sept 14 As generic drug manufacturers are gearing up to argue that a deal Allergan Plc         made with a Native American tribe to shield patents from administrative review is a sham  some experts say the generic companies are in uncharted legal territory.     Last week  Allergan announced it would transfer the patent rights to its Restasis dry-eye treatment to the Saint Regis Mohawk Tribe  which will license them back to the company i",
        "date": "09142017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "REFILE-Challenge of Allergan tribal patent deal in uncharted legal territory "
    },
    {
        "content": "U.S. Senator Sherrod Brown said on Friday a deal that drugmaker Allergan Plc made with a Native-American tribe to shield patents \"rips off consumers\" and cannot \"become the new normal.\"",
        "date": "09152017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "U.S. senator slams Allergan patent deal with Native-American tribe "
    },
    {
        "content": "Sept 12 The Native American tribe that agreed to hold patents for the drug company Allergan Plc in an attempt to shield them from U.S. administrative review is also doing so for a technology firm.",
        "date": "09122017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Tech entity has tribal patent deal similar to Allergan's "
    },
    {
        "content": "As generic drug manufacturers are gearing up to argue that a deal Allergan Plc made with a Native American tribe to shield patents from administrative review is a sham  some experts say the generic companies are in uncharted legal territory.",
        "date": "09142017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Challenge of Allergan tribal patent deal in uncharted legal territory "
    },
    {
        "content": "Sept 15 U.S. Senator Sherrod Brown said on Friday a deal that drugmaker Allergan Plc made with a Native-American tribe to shield patents \"rips off consumers\" and cannot \"become the new normal.\"",
        "date": "09152017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 2-U.S. senator slams Allergan patent deal with Native-American tribe "
    },
    {
        "content": "* Imprimis Pharmaceuticals Inc - ‍responded to a press release issued by Allergan Plc regarding a lawsuit Allergan USA  Inc. filed against Imprimis​",
        "date": "09112017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Imprimis Pharmaceuticals ‍responded to Allergan Plc press release regarding lawsuit "
    },
    {
        "content": "Sept 15 U.S. Senator Sherrod Brown said on Friday a deal Allergan Plc made with a Native American tribe to shield its patents \"rips off consumers\" and cannot \"become the new normal.\"",
        "date": "09152017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "U.S. senator slams Allergan tribal patent deal "
    },
    {
        "content": "NEW YORK  Sept 12 Generic drugmaker Mylan NV alleged in a court filing that rival Allergan Plc is trying to take advantage of Native American sovereignty to shield its patent for the blockbuster dry-eye treatment Restasis.",
        "date": "09122017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Mylan says Allergan misusing tribal sovereignty in patent dispute "
    },
    {
        "content": "Sept 8 Allergan Plc will transfer to the Saint Regis Mohawk Tribe rights to its blockbuster Restasis dry-eye treatment  the drugmaker said on Friday  in an unusual deal to protect it from patent challenges.",
        "date": "09082017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan pays Mohawk Tribe to protect patents from challenges "
    },
    {
        "content": "Sept 8 Allergan Plc will transfer to the Saint Regis Mohawk Tribe the rights to its blockbuster Restasis dry-eye treatment  the drugmaker said on Friday  in an unusual deal to protect it from patent challenges.",
        "date": "09082017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Allergan pays Mohawk Tribe to protect patents from challenges "
    },
    {
        "content": "* Lyndra Inc announced a partnership with Allergan Plc to develop orally administered ultra-long-acting products for treatment of Alzheimer's disease",
        "date": "09072017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Lyndra says co signs a partnership with Allergan "
    },
    {
        "content": "* Lyndra Inc  announced a partnership with Allergan Plc to develop orally administered ultra-long-acting products for treatment of Alzheimer's disease",
        "date": "09072017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Lyndra and Allergan sign a partnership to develop ultra-long-acting oral products "
    },
    {
        "content": "* Allergan and Saint Regis Mohawk Tribe announce agreements regarding restasis® patents",
        "date": "09082017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan and Saint Regis Mohawk Tribe announce agreements regarding RESTASIS patents "
    },
    {
        "content": "* Allergan files suits against Imprimis Pharmaceuticals  Inc.  Prescriber's Choice  Inc.  and Sincerus Florida  LLC",
        "date": "09082017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan USA files suits against Imprimis  Prescriber's Choice and Sincerus Florida "
    },
    {
        "content": "* Allergan announces settlement of Restasis (Cyclosporine Ophthalmic Emulsion) 0.05% patent litigation with Famy Care",
        "date": "08282017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan settles Restasisn 0.05% patent litigation with Famy Care "
    },
    {
        "content": "JERUSALEM/LONDON/FRANKFURT Teva Pharmaceutical Industries   is looking to team up with other drugmakers to fund some of its development pipeline as it struggles with debts and expiring patents.",
        "date": "08162017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Israel's Teva seeks partners for new drugs to relieve pressure "
    },
    {
        "content": "* Allergan Plc - As part of internal optimization restructuring programs  co intends to eliminate about 400 positions - Sec Filing‍​",
        "date": "08092017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan says as part of internal optimization restructuring programs  co intends to eliminate about 400 positions - SEC Filing‍​ "
    },
    {
        "content": "* FDA approves Medicines360's SNDA for Liletta (levonorgestrel-releasing intrauterine system) 52 mg to prevent pregnancy for up to four years",
        "date": "08072017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-FDA approves Medicines360's SNDA for Liletta to prevent pregnancy for up to four years "
    },
    {
        "content": "* Allergan reports continued strong execution in second quarter 2017 with 9% increase in GAAP net revenues to $4.0 billion",
        "date": "08032017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan Plc Q2 revenue $4.0 billion "
    },
    {
        "content": "* Allergan announces third quarter 2017 cash dividend of $0.70 per ordinary share Source text for Eikon: Further company coverage:",
        "date": "08022017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan Q3 cash dividend of $0.70/shr "
    },
    {
        "content": "Botox-maker Allergan Plc  reported a better-than-expected quarterly profit  helped by strength in its medical aesthetics unit  prompting the drugmaker to raise its full-year revenue forecast.",
        "date": "08032017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Botox-maker Allergan's quarterly profit beats estimates "
    },
    {
        "content": "Aug 3 Botox-maker Allergan Plc reported a better-than-expected quarterly profit  helped by strength in its medical aesthetics unit  prompting the drugmaker to raise its full-year revenue forecast.",
        "date": "08032017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Botox-maker Allergan's quarterly profit beats estimates "
    },
    {
        "content": "Aug 3 Drugmaker Allergan Plc posted a 9 percent rise in quarterly revenue  helped by strength in its medical aesthetics unit.",
        "date": "08032017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Botox-maker Allergan quarterly revenue rises 9 pct "
    },
    {
        "content": "* Amgen and Allergan submit biosimilar Biologics License Application for ABP 980 to US Food and Drug Administration",
        "date": "07312017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Amgen and Allergan submit biosimilar Biologics License application for ABP 980 to U.S. FDA "
    },
    {
        "content": "* U.S. Senator Claire McCaskill opioid investigation expands to include distributors and additional manufacturers‍​",
        "date": "07272017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-U.S. Senator Claire McCaskill opioid investigation expands to include distributors and additional manufacturers‍​ "
    },
    {
        "content": "* Investigational new drug application for rtgel™ in combination with botox® for the treatment of overactive bladder submitted to FDA by Allergan",
        "date": "07192017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan submits investigational NDA for rtgel in combination with botox "
    },
    {
        "content": "* Joseph H. Boccuzi appointed to Allergan Plc board of directors",
        "date": "07192017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan appoints Joseph Boccuzi to its board "
    },
    {
        "content": "* Amgen and allergan to discuss data supporting biologics license application for abp 215  a biosimilar candidate to avastin® (bevacizumab)",
        "date": "07132017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Amgen  Allergan to discuss data supporting biologics license application for ABP 215 "
    },
    {
        "content": "* UK Supreme Court confirms that products by Actavis would infringe Lilly's patent  dismisses Actavis' cross-appeal Source text: https://www.supremecourt.uk/cases/uksc-2015-0181.html Further company coverage: (London newsroom)",
        "date": "07122017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-UK Supreme Court confirms ruling on Lilly's patent case "
    },
    {
        "content": "* Allergan reports new data reinforcing the effectiveness of Viberzi® (eluxadoline) to treat the symptoms associated with irritable bowel syndrome with diarrhea (IBS-D)  abdominal pain and diarrhea",
        "date": "07102017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan reports new data from studies on Viberzi to treat irritable bowel syndrome with diarrhea symptoms "
    },
    {
        "content": "* Vivus announces settlement with actavis on qsymia(r) patent litigation",
        "date": "07052017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Vivus announces settlement with Actavis on Qsymia patent litigation "
    },
    {
        "content": "July 7 Eli Lilly and Co said on Friday the UK Supreme Court ruled that generic versions of the company's top-selling cancer drug Alimta sold by Actavis directly infringe certain Lilly patents in the UK  France  Italy and Spain.",
        "date": "07072017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UK Supreme Court rules in favor of Lilly's Alimta patents "
    },
    {
        "content": "July 7 Eli Lilly and Co won a years-long patent dispute with Actavis on Friday after the UK Supreme Court ruled that the generic drugmaker's versions of Lilly's top-selling cancer drug Alimta directly infringe on certain Lilly patents in Britain  France  Italy and Spain.",
        "date": "07072017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 2-UK Supreme Court rules in favor of Lilly's Alimta patents "
    },
    {
        "content": "A federal judge in Delaware has upheld the validity of an Allergan PLC patent on the company's antipsychotic drug Saphris rebuffing generic drugmakers' efforts to sell copycat versions of the drug.",
        "date": "07012017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Judge upholds patent on Allergan's schizophrenia drug Saphris "
    },
    {
        "content": "* UK Supreme Court rules in Lilly's favor on alimta vitamin regimen patents",
        "date": "07072017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-UK Supreme Court rules in Lilly's favor on Alimta vitamin regimen patents "
    },
    {
        "content": "* Allergan plc - announced launch of over-the-counter artificial tear refresh optive mega-3 Source text for Eikon: Further company coverage:",
        "date": "06272017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan announces launch of artificial tear refresh optive mega-3 "
    },
    {
        "content": "June 28 Sarepta Therapeutics Inc said on Wednesday it appointed Douglas Ingram as president and chief executive officer.",
        "date": "06282017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Sarepta appoints former Allergan executive Douglas Ingram as CEO "
    },
    {
        "content": "* Amgen and Allergan announce fda advisory committee meeting to review ABP 215  a biosimilar candidate to bevacizumab",
        "date": "06072017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Amgen  Allergan announce FDA advisory committee meeting to review ABP 215 "
    },
    {
        "content": "June 7 Mylan NV defended Chairman Robert Coury's role to ISS this week as the influential proxy firm prepares to advise shareholders on how they should vote on the re-election of Coury and other directors  according to a letter the drugmaker released on Wednesday.",
        "date": "06072017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Mylan defends chairman to ISS ahead of June 22 investor vote "
    },
    {
        "content": "June 7 Mylan NV defended Chairman Robert Coury's role to ISS this week as the influential proxy firm prepares to advise shareholders on how they should vote on the re-election of Coury and other directors  according to a letter the drugmaker released on Wednesday.",
        "date": "06072017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Mylan defends chairman to ISS ahead of June 22 investor vote "
    },
    {
        "content": "* Allergan to acquire Keller Medical  Inc.  adding Keller Funnel® to company's leading plastic surgery portfolio Source text for Eikon: Further company coverage:",
        "date": "06072017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan to acquire Keller Medical  adding Keller Funnel to co's leading plastic surgery portfolio "
    },
    {
        "content": "* Allergan announces closing of public offering of senior notes to refinance existing debt Source text for Eikon: Further company coverage:",
        "date": "05262017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan announces closing of public offering "
    },
    {
        "content": "* Allergan announces pricing of public offering of senior notes to refinance existing debt",
        "date": "05232017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan prices public offering of senior notes to refinance existing debt "
    },
    {
        "content": "* viberzi™ now approved in canada for patients with irritable bowel syndrome with diarrhea (ibs-d)",
        "date": "05162017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan says VIBERZI now approved in Canada "
    },
    {
        "content": "NEW YORK Six closely watched investors sliced their stakes in Allergan Plc  during the first quarter  recent regulatory disclosures show  cutting what had been one of the years' best performing health stocks that has stumbled in recent days.",
        "date": "05162017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Several top fund managers trim Allergan stakes in first quarter "
    },
    {
        "content": "NEW YORK  May 15 Six closely watched investors sliced their stakes in Allergan Plc during the first quarter  recent regulatory disclosures show  cutting what had been one of the years' best performing health stocks that has stumbled in recent days.",
        "date": "05162017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Several top fund managers trim Allergan stakes in 1st quarter "
    },
    {
        "content": "* Carl Icahn dissolves share stake in Allergan Plc - sec filing",
        "date": "05152017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Carl Icahn dissolves shared share stake in Allergan "
    },
    {
        "content": "* Paulson & Co Inc takes share stake of 3.5 million shares in Dish Network Corp",
        "date": "05152017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Paulson & Co Inc takes share stake in Dish Network  Monsanto "
    },
    {
        "content": "* Appaloosa lp takes share stake of 1.0 million of class b shares in cbs corp",
        "date": "05122017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Appaloosa LP takes share stake in CBS  cuts in Allergan "
    },
    {
        "content": "TEL AVIV Israel-based Teva Pharmaceutical Industries  reported a smaller-than-expected fall in first-quarter profit on Thursday  with sales boosted by its $40.5 billion acquisition last year of generics drug business Actavis.",
        "date": "05112017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Teva first-quarter profit tops estimates  revenue up on Actavis deal "
    },
    {
        "content": "* Increases Actavis synergy  cost benefit estimate by $200 mln",
        "date": "05112017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 2-Teva Q1 profit tops estimates  revenue up on Actavis deal "
    },
    {
        "content": "* Allergan announces proposed public offering of senior notes to refinance existing debt",
        "date": "05102017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan announces proposed public offering of senior notes to refinance existing debt "
    },
    {
        "content": "Botox-maker Allergan Plc  posted a first-quarter loss on Tuesday as it took a nearly $2 billion write-down on the value of its stake in Teva Pharmaceutical Industries   which has lost more than 40 percent of its value since last year.",
        "date": "05092017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan posts loss as it writes down Teva holdings "
    },
    {
        "content": "* Interim CEO: headcount reduced by 5 000 since Actavis deal  expects more cuts by end of 2017",
        "date": "05112017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Teva interim CEO sees more headcount reductions "
    },
    {
        "content": "* Warner chilcott acting as a co-offeror with allergan funding with respect to 4.850% notes due 2044",
        "date": "05102017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan announces tender offers by certain subsidiaries "
    },
    {
        "content": "May 9 Botox-maker Allergan Plc posted a first-quarter loss on Tuesday as it took a nearly $2 billion write-down on the value of its stake in Teva Pharmaceutical Industries  which has lost more than 40 percent of its value since last year.",
        "date": "05092017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 3-Allergan posts loss as it writes down Teva holdings "
    },
    {
        "content": "* Allergan reports solid start to 2017 with 5 pct increase in first quarter GAAP net revenues to $3.6 billion",
        "date": "05092017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan reports qtrly loss per share from continuing operations of $7.85 "
    },
    {
        "content": "TEL AVIV  May 11 Teva Pharmaceutical Industries reported better-than- expected first-quarter profit as sales were boosted by its $40.5 billion acquisition of Allergan's Actavis generic drug business in August.",
        "date": "05112017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva Pharm Q1 profit tops estimates  revenue rises "
    },
    {
        "content": "May 9 Botox-maker Allergan Plc reported a 5.1 percent rise in quarterly revenue on Tuesday  as sales of its newer medicines helped offset declines in its older drugs.",
        "date": "05092017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan's quarterly revenue rises 5.1 percent "
    },
    {
        "content": "ZURICH  May 9 The Swiss blue-chip SMI was seen opening 0.1 percent lower at 9 034 points on Tuesday  according to premarket indications by bank Julius Baer .",
        "date": "05092017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Swiss stocks - Factors to watch on May 9 "
    },
    {
        "content": "* STRATEGIC PARTNER ALLERGAN COMPLETED PATIENT RECRUITMENT IN BOTH ABICIPAR PEGOL NAMD PHASE 3 STUDIES",
        "date": "05092017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Molecular Partners: partner Allergan completes patient recruitment in both abicipar pegol nAMD Phase 3 studies "
    },
    {
        "content": "* Allergan - shareholder proposal that co adopt as policy to require chair of board  whenever possible  to be independent member of board was rejected Source text (http://bit.ly/2peBxYe) Further company coverage:",
        "date": "05052017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan shareholder rejects proposal that co adopt as policy to require chair of board  to be independent member of board "
    },
    {
        "content": "* Allergan successfully completes zeltiq® aesthetics acquisition Source text for Eikon: Further company coverage:",
        "date": "04282017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan completes Zeltiq acquisition "
    },
    {
        "content": "MUMBAI  April 27 India's antitrust regulator has ordered a probe into Swiss drugmaker Roche for allegedly using anti-competitive practices to restrict cheaper copies of a blockbuster cancer drug from reaching patients.",
        "date": "04272017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "UPDATE 1-India watchdog orders antitrust probe into Roche cancer drug "
    },
    {
        "content": "April 18 U.S. generic drug company Argentum Pharmaceuticals LLC said on Tuesday it had reached an agreement with Allergan Plc that settles a patent dispute over the generic version of Allergan's eye drug  Restasis.",
        "date": "04182017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan  Argentum settle patent dispute over eye drug Restasis "
    },
    {
        "content": "* Argentum PHARMACEUTICALS and Allergan settle patent dispute over Restasis",
        "date": "04182017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Argentum Pharmaceuticals  Allergan settle patent dispute over Restasis "
    },
    {
        "content": "* Novartis expands development programs for NASH through clinical collaboration with Allergan",
        "date": "04182017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Novartis expands trials for NASH via collaboration with Allergan "
    },
    {
        "content": "* Announced it has entered into a clinical trial agreement with Novartis to conduct a phase 2b study  using Allergan's Cenicriviroc",
        "date": "04182017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan says it has entered into a clinical trial agreement with Novartis to conduct a phase 2b study "
    },
    {
        "content": "ZURICH  April 11 Swiss billionaire Hansjoerg Wyss has built a nearly 10 percent stake in biotech group Molecular Partners after share sales by Johnson & Johnson and other investors  the SIX Swiss Exchange said on Tuesday.",
        "date": "04112017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Swiss billionaire Wyss gets nearly 10 pct of Molecular Partners "
    },
    {
        "content": "* Allergan reports topline Phase II data supporting advancement of Botox® (onabotulinumtoxina) for the treatment of major depressive disorder (MDD)",
        "date": "04052017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan reports topline Phase II data supporting advancement of Botox for the treatment of major depressive disorder "
    },
    {
        "content": "* Allergan and Zeltiq announce expiration of Hart-Scott-Rodino waiting period for pending transaction",
        "date": "04062017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan  Zeltiq announce expiration of Hart-Scott-Rodino waiting period "
    },
    {
        "content": "* Allergan Plc- CEO Brenton L. Saunders's 2016 total compensation $4.1 million - SEC Filing",
        "date": "03242017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan Plc says CEO Brenton Saunders's 2016 total compensation $4.1 mln - SEC Filing "
    },
    {
        "content": "March 27 Impax Laboratories Inc  which is said to be conducting a strategic review  named former Allergan Plc executive and industry veteran Paul Bisaro as its chief executive  sending the drugmaker's shares soaring as much as 38 percent.",
        "date": "03272017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Impax Labs names industry veteran Paul Bisaro as CEO  shares soar "
    },
    {
        "content": "* Allergan and Paratek announce positive results from two phase 3 trials of sarecycline for the treatment of moderate to severe acne",
        "date": "03272017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan and Paratek announce positive results from two phase 3 trials "
    },
    {
        "content": "* Allergan and Paratek announce positive results from two phase 3 trials of sarecycline for the treatment of moderate to severe acne",
        "date": "03272017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan and Paratek announce positive results from two phase 3 trials of sarecycline "
    },
    {
        "content": "* Allergan announces availability of restasis multidose™ (cyclosporine ophthalmic emulsion) 0.05 pct -- the first fda-approved preservative free prescription eye drop available in a multidose bottle",
        "date": "03222017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan reports availability of restasis multidose "
    },
    {
        "content": "* Juvéderm Vollure™ XC approved by U.S. FDA for correction of facial wrinkles and folds in adults over the age of 21",
        "date": "03202017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Juvéderm Vollure XC approved by FDA for correction of facial wrinkles and folds "
    },
    {
        "content": "* Cisco appoints brenton l. Saunders  chairman  president and ceo of allergan plc  to board of directors  Source text for Eikon:  Further company coverage:",
        "date": "03132017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Cisco appoints Brenton Saunders  CEO Of Allergan Plc  to board of directors "
    },
    {
        "content": "March 14 Allergan plc said on Tuesday it would get exclusive access and the option to license up to five of Editas Medicine Inc's experimental gene-editing-based eye treatments under a research and development deal between the two companies.",
        "date": "03142017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan signs deal with Editas for gene-editing-based eye treatments "
    },
    {
        "content": "March 14 Allergan plc said on Tuesday it would get exclusive access and the option to license up to five of Editas Medicine Inc's experimental gene-editing-based eye treatments under a research and development deal between the two companies.",
        "date": "03142017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Allergan signs deal with Editas for gene-editing-based eye treatments "
    },
    {
        "content": "* Allergan and Editas Medicine enter into strategic research and development alliance to discover and develop Crispr Genome editing medicines for eye diseases",
        "date": "03142017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan and Editas Medicine enter into strategic research and development alliance "
    },
    {
        "content": "* Supernus announces settlement with Actavis on Trokendi XR patent litigation",
        "date": "03072017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Supernus announces settlement with Actavis on Trokendi XR patent litigation "
    },
    {
        "content": "* Orexo commences patent infringement litigation against Actavis for their generic versions of Suboxone® and Subutex® tablets in the U.S.",
        "date": "03012017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Orexo files patent infringement lawsuit against Actavis "
    },
    {
        "content": "* Lisa DeFrancesco  vice president of investor relations  to leave Allergan",
        "date": "02272017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan says Lisa DeFrancesco  VP investor relations  to leave co "
    },
    {
        "content": "* The Goldman Sachs Group Inc reports 6.3 percent passive stake in Allergan Plc as of dec. 31  2016 - sec filing  Source text: (http://bit.ly/2knWz9s) Further company coverage:",
        "date": "02142017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan says Goldman Sachs Group reported 6.3 pct passive stake in co as of Dec. 31 - SEC filing "
    },
    {
        "content": "* Third Point Llc dissolves share stake in Allergan Plc - SEC Filing",
        "date": "02102017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Third Point LLC takes share stake in JPMorgan  Bank of America - SEC Filing "
    },
    {
        "content": "Botox maker Allergan Plc <AGN.N > agreed to pay $2.48 billion in cash for Zeltiq Aesthetics Inc  adding a system that it says helps people slim down by freezing fat away to the company's line-up of aesthetic products.",
        "date": "02132017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan to buy fat-fighter Zeltiq Aesthetics for $2.48 billion "
    },
    {
        "content": "Feb 13 Botox maker Allergan Plc <AGN.N > agreed to pay $2.48 billion in cash for Zeltiq Aesthetics Inc  adding a system that it says helps people slim down by freezing fat away to the company's line-up of aesthetic products.",
        "date": "02132017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 4-Allergan to buy fat-fighter Zeltiq Aesthetics for $2.48 bln "
    },
    {
        "content": "Allergan Plc  Chief Executive Brent Saunders said on Wednesday he does not anticipate U.S. tax reforms this year and that an import tax could hurt the Dublin-based drugmaker.",
        "date": "02082017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan says U.S. tax reform unlikely in 2017  sees strong year "
    },
    {
        "content": "* Investors call for major changes in the company   (Adds new investigation  investor comment)",
        "date": "02072017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 5-Teva CEO exits in ongoing crisis of confidence at drugmaker "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Allergan has added ice and a slice to its M&A cocktail. The drug company is paying just under $2.5 billion for Zeltiq Aesthetics and its diet-avoiding  fat-freezing tech. It sounds a wackier play than the dozen deals Allergan struck last year. But vain customers pay cold cash for the treatment  making it less speculative than other acquisitions  like gene therapy.",
        "date": "02132017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan adds ice and a slice to M&A cocktail "
    },
    {
        "content": "* Shares rise as much as 2.6 pct   (Adds detail  analyst comment)",
        "date": "02082017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 3-Allergan says U.S. tax reform unlikely in 2017  sees strong year "
    },
    {
        "content": "* Allergan CEO \"We have a good report card for 2016 and a positive outlook for 2017 and beyond\"",
        "date": "02082017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan says does not see U.S. tax reform in 2017 "
    },
    {
        "content": "* Shares have slumped in wake of patent setbacks  acquisitions",
        "date": "02072017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "CORRECTED-UPDATE 2-Teva Pharm's CEO Vigodman steps down amid crisis of confidence "
    },
    {
        "content": "Feb 13 Botox maker Allergan Plc said it would buy body-contouring product maker Zeltiq Aesthetics Inc  for about $2.48 billion  adding muscle to its line-up of products used to fight fat and smoothen wrinkles.",
        "date": "02132017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "CORRECTED-UPDATE 2-Allergan to buy Zeltiq Aesthetics for about $2.48 bln "
    },
    {
        "content": "Motley Rice and Kessler Topaz Meltzer & Check have been named lead counsel in a consolidated lawsuit accusing pharmaceutical giant Allergan of misleading investors by not disclosing that it was at risk of a price-fixing probe by U.S. authorities.",
        "date": "02032017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Motley Rice  Kessler named lead counsel in Allergan lawsuit "
    },
    {
        "content": "Feb 8 Allergan Plc reported a 7 percent rise in quarterly revenue  as demand for its facial aesthetic therapies  including Botox  as well as eye treatments and constipation medicine Linzess more than made up for declining sales of older drugs.",
        "date": "02082017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan revenue up 7 pct as Botox offsets drop in older drug sales "
    },
    {
        "content": "* Allergan has agreed to acquire Zeltiq for $56.50 per share  or $2.475 billion",
        "date": "02132017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan agrees to acquire Zeltiq for $2.48 bln "
    },
    {
        "content": "* Allergan declares first quarterly cash dividend of $0.70 per ordinary share  Source text for Eikon:  Further company coverage:",
        "date": "02032017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan declares first quarterly cash dividend of $0.70 per ordinary share "
    },
    {
        "content": "Feb 13 Allergan Plc on Monday said it would buy Zeltiq Aesthetics Inc for about $2.48 billion to gain access to its flagship body contouring technology.",
        "date": "02132017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan agrees to buy Zeltiq for about $2.48 bln "
    },
    {
        "content": "A bitter defeat in a U.S. patents case sent shares in Teva Pharmaceutical Industries plummeting on Tuesday  the latest in a series of setbacks that has investors calling for major changes at the world's largest generic drugmaker.",
        "date": "01312017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "U.S. court ruling on MS drug is the latest blow for Teva "
    },
    {
        "content": "* Allergan provides board and annual shareholder meeting updates",
        "date": "02032017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan board member Michael Gallagher to retire "
    },
    {
        "content": "* Investors calling for major changes in the company   (Changes dateline  adds details  Mylan reaction  background)",
        "date": "01312017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-U.S. court ruling on MS drug is the latest blow for Teva "
    },
    {
        "content": "WASHINGTON  Jan 26 A top U.S. lawmaker accused the Food and Drug Administration on Friday of failing to hand over documents that would show whether its criminal office is fulfilling the critical mission of protecting public health.",
        "date": "01262017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "House lawmaker seeks more documents in FDA criminal office inquiry "
    },
    {
        "content": "WASHINGTON Endo International Plc said on Monday it has reached a proposed settlement with U.S. antitrust regulators under which it will not pay rivals to delay the introduction of generic competitors to its medications.",
        "date": "01232017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "FTC reaches pay-for-delay settlement with Endo "
    },
    {
        "content": "WASHINGTON  Jan 23 Endo International Plc  said on Monday it has reached a proposed settlement with U.S. antitrust regulators under which it will not pay rivals to delay the introduction of generic competitors to its medications.",
        "date": "01232017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 2-U.S. reaches settlement with Endo on pay-for-delay charges "
    },
    {
        "content": "* Allergan announces FDA approval of RHOFADE\u007f (oxymetazoline hydrochloride) cream  1% for the topical treatment of persistent facial Erythema associated with Rosacea in adults",
        "date": "01192017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan announces FDA approval of RHOFADE cream "
    },
    {
        "content": "* Richter  Allergan sign distribution supply agreement to sell a female medical product in europe - statement",
        "date": "01192017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Richter  Allergan sign distribution supply agreement for Levosert "
    },
    {
        "content": "WASHINGTON  Jan 17 Botox maker Allergan plc  will pay a $15 million penalty and admit to wrongdoing  after U.S. regulators on Tuesday accused the company of failing to disclose merger talks with Actavis  the U.S. Securities and Exchange Commission said.",
        "date": "01172017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan to pay $15 mln over failing to disclose merger talks "
    },
    {
        "content": "WASHINGTON A unit of Botox maker Allergan Plc  will pay a $15 million penalty and admit to wrongdoing  after U.S. regulators on Tuesday accused the unit of failing to disclose 2014 merger talks with Actavis  the U.S. Securities and Exchange Commission said.",
        "date": "01172017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan to pay $15 million over failing to disclose merger talks "
    },
    {
        "content": "WASHINGTON  Jan 17 A unit of Botox maker Allergan Plc will pay a $15 million penalty and admit to wrongdoing  after U.S. regulators on Tuesday accused the unit of failing to disclose 2014 merger talks with Actavis  the U.S. Securities and Exchange Commission said.",
        "date": "01172017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Allergan to pay $15 mln over failing to disclose merger talks "
    },
    {
        "content": "* Hungary's Richter and Allergan announce positive phase III clinical test results for new medicine to treat uterine fibroids.",
        "date": "01172017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Richter  Allergan announce positive uterine fibroid medicine test "
    },
    {
        "content": "* Says \"Allergan is aligned with the priorities of the incoming Trump administration\"",
        "date": "01112017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan CEO says company wants to create more jobs in the U.S. "
    },
    {
        "content": "* Allergan enters parkinson's disease through option arrangement with Lysosomal Therapeutics Inc (LTI) for its potential first-in-class breakthrough compounds",
        "date": "01092017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan enters parkinson's disease through option arrangement with Lysosomal Therapeutics "
    },
    {
        "content": "* Will make upfront payment to assembly of $50 million for exclusive  worldwide rights to develop and commercialize UC  CD and IBS compounds",
        "date": "01092017",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan enters into licensing agreement with Assembly Biosciences "
    },
    {
        "content": "Allergan Plc   taking a more \"realistic\" approach to its forecast  said on Thursday it expects mid-single digit net revenue percentage growth this year  helped by key products and new launches.",
        "date": "01052017",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan expects mid-single digit 2017 revenue growth "
    },
    {
        "content": "WASHINGTON Allergan PLC's Forest Laboratories and Forest Pharmaceuticals units will pay $38 million to settle U.S. charges that it paid physicians to prescribe three medications  the U.S. Justice Department said on Thursday.",
        "date": "12152016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "U.S. says Allergan's Forest units to pay $38 million to settle kickback allegations "
    },
    {
        "content": "Drugmaker Allergan Plc said on Tuesday it would buy LifeCell  a regenerative medicine unit owned by privately held Acelity LP Inc  for $2.9 billion in cash  bringing the number of deals it has made this year to an even dozen.",
        "date": "12202016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan to buy Acelity's tissue unit LifeCell for $2.9 billion "
    },
    {
        "content": "Amgen Inc and Allergan Plc said they have submitted an application to the European health regulator seeking approval of their biosimilar version of Roche Holding AG's blockbuster cancer treatment  Avastin.",
        "date": "12022016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Amgen  Allergan apply for European nod for Avastin biosimilar "
    },
    {
        "content": "* Allergan Plc - received an additional approval from Health Canada for fibristal  Source text for Eikon:  Further company coverage:",
        "date": "11212016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan received an additional approval from Health Canada for fibristal "
    },
    {
        "content": "* Allergan acquires Chase Pharmaceuticals to expand CNS research and development pipeline and build on commitment to alzheimer's disease",
        "date": "11222016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan completes acquisition of Chase Pharmaceuticals "
    },
    {
        "content": "* Allergan receives FDA clearance for the xen\u007f gel stent  a new surgical treatment for refractory glaucoma",
        "date": "11222016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan receives FDA clearance for a new surgical treatment for refractory glaucoma "
    },
    {
        "content": "* Medicines360 Allergan announce study publication evaluating pelvic infection risk following same-day sexually transmitted infection testing  Liletta 52 mg placement",
        "date": "11162016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan announce study publication evaluating pelvic infection risk following same-day sexually transmitted infection testing  Liletta 52 mg placement "
    },
    {
        "content": "* Allergan announces partnership with Amy Dixon  Elite Paratriathlete  to improve patient-physician conversations about irritable bowel syndrome with diarrhea (ibs-d)  Source text for Eikon:  Further company coverage:",
        "date": "11162016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan announces partnership with Amy Dixon  Elite Paratriathlete "
    },
    {
        "content": "* Favorable outcome from Zubsolv\u007f patent infringement litigation against Actavis",
        "date": "11162016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Orexo says may appeal part of U.S. patent ruling "
    },
    {
        "content": "* Amgen Inc - BLA submission includes analytical  pharmacokinetic and clinical data  as well as pharmacology and toxicology data",
        "date": "11152016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Amgen  Allergan submit biosimilar biologics license application for ABP 215 to U.S. FDA "
    },
    {
        "content": "TEL AVIV Teva Pharmaceutical Industries  on Tuesday lowered its full-year earnings forecast  citing launch delays for some drugs that have been pushed back by a year or so.",
        "date": "11152016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva trims 2016 outlook on drug launch delays "
    },
    {
        "content": "* Carl Icahn dissolves shared share stake in Transocean Ltd - SEC filing",
        "date": "11142016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Carl Icahn dissolves shared share stake in Transocean  cuts in Allergan "
    },
    {
        "content": "* Juniper Pharmaceuticals says entered into an agreement with its partner  Allergan to monetize future royalty payments due to Juniper for U.S. Sales of Crinone",
        "date": "11152016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Juniper Pharmaceuticals says entered into an agreement with its partner  Allergan "
    },
    {
        "content": "NEW YORK  Nov 14 Healthcare stocks  including insurers  have jumped since Donald Trump won the U.S. presidential election last week and some hedge fund managers may see further gains in after making new bets in the sector in the third quarter.",
        "date": "11142016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Some hedge funds bet big on health insurers before Trump vote "
    },
    {
        "content": "NEW YORK U.S. stocks are poised to climb more in 2017 as the policies of Republican President-elect Donald Trump are likely to boost earnings  Steven Einhorn  vice chairman of Hedge fund Omega Advisors  said on Monday.",
        "date": "11152016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Omega's Einhorn sees Trump's policies boosting stocks "
    },
    {
        "content": "NEW YORK  Nov 14 Healthcare stocks  including insurers  are primed for a shot in the arm from a Trump presidency and some hedge fund managers stand to reap the gains after making new bets in the sector in the third quarter.",
        "date": "11142016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Some hedge funds bet big on health insurers before Trump vote "
    },
    {
        "content": "* Cipla EU divests stake in Chase Pharmaceuticals to Allergan",
        "date": "11232016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Cipla says UK unit sells stake in Chase Pharmaceuticals "
    },
    {
        "content": " ",
        "date": "11142016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "REUTERS SUMMIT-Omega's Einhorn sees Trump's policies boosting stocks "
    },
    {
        "content": "* Brown is currently president and chief operating officer of Intellectual Ventures",
        "date": "11142016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Adriane Brown to join Allergan board "
    },
    {
        "content": "* Sofregen Medical acquires SERI\u007f Surgical Scaffold product line from Allergan",
        "date": "11112016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Sofregen Medical acquires SERI surgical scaffold product line from Allergan "
    },
    {
        "content": "* Third Point LLC takes share stake of 2.1 million Class A shares in Visa Inc - SEC filing",
        "date": "11102016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Third Point cuts share stake in Allergan  takes share stake in Humana "
    },
    {
        "content": "* Allergan announces launch of TAYTULLA\u007f (norethindrone acetate and ethinyl estradiol capsules and ferrous fumarate capsules) 1 mg/20 mcg  the first and only oral contraceptive softgel capsule  Source text for Eikon:  Further company coverage:",
        "date": "11102016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan launches TAYTULLA  the first  only oral contraceptive softgel capsule "
    },
    {
        "content": "Allergan Plc's chief executive officer on Wednesday took the blame for disappointing quarterly earnings as the drugmaker underestimated sales declines for its older medicines  forcing it to cut its 2016 profit forecast.",
        "date": "11022016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan CEO takes blame for big miss on quarterly earnings "
    },
    {
        "content": "Nov 2 Allergan Plc's chief executive officer on Wednesday took the blame for disappointing quarterly earnings as the drugmaker underestimated sales declines for its older medicines  forcing it to cut its 2016 profit forecast.",
        "date": "11022016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "REFILE-UPDATE 4-Allergan CEO takes blame for big miss on quarterly earnings "
    },
    {
        "content": "Nov 2 Allergan  in conference call with analysts:",
        "date": "11022016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan CEO takes blame for big profit miss in third quarter "
    },
    {
        "content": "Nov 2 Allergan Plc reported a 4.4 percent rise in quarterly revenue  lifted by higher demand for key products such as Botox and Restatis eye drops  and the company expanded its share buyback program by $5 billion to $15 billion.",
        "date": "11022016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan revenue rises 4.4 pct; company expands buyback "
    },
    {
        "content": "* T2 Biosystems announces collaboration with Allergan to develop the first blood-based diagnostic panel to detect antimicrobial resistance",
        "date": "11012016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-T2 Biosystems announces collaboration with Allergan "
    },
    {
        "content": "* Allergan announces $10 billion accelerated share repurchase  initiation of cash dividend in 2017",
        "date": "11022016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan announces $10 bln accelerated share repurchase  initiation of cash dividend in 2017 "
    },
    {
        "content": "* Quarterly gaap continuing operations loss per share of $1.15",
        "date": "11022016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan reports Q3 adjusted earnings per share $3.32 "
    },
    {
        "content": "* Allergan successfully completes Tobira Therapeutics acquisition  Source text for Eikon:  Further company coverage:",
        "date": "11012016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan completes Tobira Therapeutics acquisition "
    },
    {
        "content": "* Allergan introduces restasis multidose (cyclosporine ophthalmic emulsion) 0.05%  a new delivery system for the one and only FDA approved treatment to help patients produce more of their own tears",
        "date": "10282016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan introduces restasis multidose 0.05% "
    },
    {
        "content": "* Allergan to acquire GI disease subsidiary of Rhythm Holding Company Llc  expanding innovative gastroenterology pipeline",
        "date": "10272016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan to acquire GI disease subsidiary of Rhythm Holding Co "
    },
    {
        "content": "* Allergan successfully completes Vitae tender offer  Source text for Eikon:  Further company coverage:",
        "date": "10252016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan successfully completes Vitae tender offer "
    },
    {
        "content": "* Allergan plc - effective today  Brenton L. Saunders has been elected chairman of Allergan's board",
        "date": "10262016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan appoints Brenton Saunders as chairman of the board "
    },
    {
        "content": "Oct 19 The benefits associated with Allergan Plc's experimental drug to treat frequent nightly urination outweigh the risks for certain patients  an advisory panel to the U.S. Food and Drug Administration concluded on Wednesday.",
        "date": "10192016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "FDA panel backs Allergan's drug for frequent nightly urination "
    },
    {
        "content": "* Juvéderm volbella\u007f XC now available to doctors and patients in the U.S.  Source text for Eikon:  Further company coverage:",
        "date": "10182016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan:Juvéderm Volbella XC now available to doctors and patients in the U.S. "
    },
    {
        "content": "* Press release - Urogen Pharma announces agreement to license RTGEL\u007f for use with Neurotoxins to Allergan",
        "date": "10142016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Urogen Pharma announces agreement to license RTGEL for use with Neurotoxins to Allergan "
    },
    {
        "content": "WASHINGTON  Oct 19 The benefits associated with Allergan Plc's experimental drug to treat frequent nightly urination outweigh the risks for certain patients  an advisory panel to the U.S. Food and Drug Administration concluded on Wednesday.",
        "date": "10192016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-FDA panel backs Allergan's drug for frequent nightly urination "
    },
    {
        "content": "* Allergan and Tobira Therapeutics announce early termination of Hart-Scott-Rodino waiting period for Allergan's proposed acquisition of Tobira",
        "date": "10192016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan  Tobira Therapeutics say waiting period terminated for proposed merger "
    },
    {
        "content": "The proposed dosing for a drug being developed by Allergan Plc to treat frequent urination at night has not been adequately studied in trials  a preliminary review by the U.S. Food and Drug Administration staff concluded.",
        "date": "10172016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "FDA staff flag concerns about Allergan's urinary drug "
    },
    {
        "content": "Oct 17 The proposed dosing for a drug being developed by Allergan Plc to treat frequent urination at night has not been adequately studied in trials  a preliminary review by the U.S. Food and Drug Administration staff concluded.",
        "date": "10172016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-FDA staff flag concerns about Allergan's urinary drug "
    },
    {
        "content": "* Allergan and Vitae Pharmaceuticals announce expiration of Hart-Scott-Rodino waiting period for Allergan's proposed acquisition of Vitae",
        "date": "10172016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan  Vitae Pharmaceuticals announce expiration of HSR waiting period "
    },
    {
        "content": "* FDA accepts supplemental new drug application (SNDA) for avycaz\u007f (ceftazidime and avibactam)",
        "date": "10112016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan says FDA accepts supplemental new drug application for avycaz "
    },
    {
        "content": "Teva Pharmaceutical Industries Ltd  said on Wednesday it would sell Allergan Plc's  generics business in the UK and Ireland to India's Intas Pharmaceuticals Ltd  for 603 million pounds ($769.37 million).",
        "date": "10052016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Teva to sell Allergan's generics business in UK  Ireland for $769 million "
    },
    {
        "content": "Oct 5 Teva Pharmaceutical Industries Ltd  said on Wednesday it would sell Allergan Plc's  generics business in the UK and Ireland to India's Intas Pharmaceuticals Ltd for 603 million pounds ($769.37 million).",
        "date": "10052016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Teva to sell Allergan's generics business in UK  Ireland for $769 mln "
    },
    {
        "content": "Oct 5 Teva Pharmaceutical Industries Ltd  said on Wednesday it would sell Allergan Plc's  generics business in the UK and Ireland to India's Intas Pharmaceuticals Ltd for 603 million pounds ($769.37 million).",
        "date": "10052016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva to sell Allergan's generics business in UK  Ireland for $769 mln "
    },
    {
        "content": "LONDON  Oct 3 Britain's AstraZeneca said it had licensed a potential medicine for inflammatory diseases to Allergan for an upfront payment of $250 million and potential additional payments of up to $1.27 billion.",
        "date": "10032016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "AstraZeneca licenses inflammatory disease candidate to Allergan "
    },
    {
        "content": "* Company has settled with all other Namenda XR ANDA defendants  including Lupin Limited and Lupin Pharmaceuticals Inc",
        "date": "09292016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan issues statement on Namenda XR patent litigation following announcement of ANDA approvals "
    },
    {
        "content": "* In addition  Allergan may make potential payments to astrazeneca of up to $1.27 billion  payable over a period of up to 15 years",
        "date": "10032016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan Plc enters licensing agreement with Astrazeneca for worldwide rights to Medi2070 "
    },
    {
        "content": "Sept 26 U.S. drugmaker Pfizer Inc said on Monday it had decided not to separate into two publicly traded companies at this time.",
        "date": "09262016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Pfizer says not to split into two "
    },
    {
        "content": "* Allergan announces FDA approval of natrelle inspira\u007f cohesive breast implants  Source text for Eikon:  Further company coverage:",
        "date": "09232016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan gets FDA approval of Natrelle Inspira cohesive breast implants "
    },
    {
        "content": "* Co and Adamas Pharmaceuticals announce all four dosage strengths of NAMZARIC now available by prescription in pharmacies throughout U.S.  Source text for Eikon:  Further company coverage:",
        "date": "09222016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan and Adamas announce all four dosage strengths of NAMZARIC available throughout U.S. "
    },
    {
        "content": "Botox maker Allergan Plc  in its third acquisition this month  said it would pay up to $1.7 billion for Tobira Therapeutics Inc to get a leg up in the race to develop therapies for NASH  an incurable fatty liver disease closely linked to obesity.",
        "date": "09202016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan to buy Tobira in push for fatty liver disease drugs "
    },
    {
        "content": "Sept 20 Botox maker Allergan Plc  in its third acquisition this month  said it would pay up to $1.7 billion for Tobira Therapeutics Inc to get a leg up in the race to develop therapies for NASH  an incurable fatty liver disease closely linked to obesity.",
        "date": "09202016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 3-Allergan to buy Tobira in push for fatty liver disease drugs "
    },
    {
        "content": "Sept 20 Allergan Plc CEO Brent Saunders calls them \"stepping stones\" - small  bolt-on acquisitions  as opposed to the mega-deals common in the drug industry. And they're expected to boost dealmaking in sectors ranging from neurology to skin care.",
        "date": "09202016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "REFILE-DEALTALK-Allergan pays top dollar for 'stepping stones' from neurology to dermatology "
    },
    {
        "content": "Allergan Plc  CEO Brent Saunders calls them \"stepping stones\" - small  bolt-on acquisitions  as opposed to the mega-deals common in the drug industry. And they're expected to boost dealmaking in sectors ranging from neurology to skin care.",
        "date": "09202016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan pays top dollar for 'stepping stones' from neurology to dermatology "
    },
    {
        "content": "Sept 20 Allergan Plc said it would buy Tobira Therapeutics Inc in a deal worth up to $1.7 billion  to gain access to its experimental therapies for a fatty liver disease called NASH.",
        "date": "09202016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan to buy Tobira in push for NASH treatments "
    },
    {
        "content": "A proposed class action lawsuit brought by a health plan and a drug wholesaler accusing Allergan PLC of suppressing competition for its Alzheimer's drug Namenda can move forward  a federal judge ruled on Tuesday.",
        "date": "09152016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan must face antitrust class action over Alzheimer's drug "
    },
    {
        "content": "* Releasing intrauterine system) 52 mg single-handed inserter  Source text for Eikon:  Further company coverage:",
        "date": "09142016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan and Medicines360 announce launch of new Liletta 52 mg single-handed inserter "
    },
    {
        "content": "* Allergan to acquire Vitae Pharmaceuticals adding innovative development programs for dermatologic conditions",
        "date": "09142016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan to buy Vitae Pharmaceuticals for about $639 mln "
    },
    {
        "content": "The chief executive officer of Allergan Plc said his company would limit annual price increases on its prescription drugs  and that \"outlier\" drugmakers that have imposed huge price increases on their products were scaring off venture capital investors.",
        "date": "09062016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan vows limited price hikes  says 'outliers' deter research "
    },
    {
        "content": "* Medicines360 and Allergan announce publication of levonorgestrel release rates over five years with the Liletta\u007f 52 mg intrauterine system in 'contraception'",
        "date": "09072016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan  Medicines360 post 5-year data on contraceptive device Liletta "
    },
    {
        "content": "* Allergan Acquires Gene Therapy Company Retrosense Therapeutics Adding First-In-Class technology to company's innovative eye care pipeline",
        "date": "09062016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan acquires gene therapy company Retrosense Therapeutics "
    },
    {
        "content": "Generic drugmaker Actavis Inc is asking a federal court to invalidate four Tris Pharma Inc patents on the attention deficit hyperactivity disorder drug Quillichew ER  sold by Tris partner Pfizer Inc.",
        "date": "09072016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Actavis seeks to invalidate Tris patents on chewable ADHD drug "
    },
    {
        "content": "Aug 31 Allergan Plc said it and Adamas Pharmaceuticals Inc settled a patent infringement lawsuit with Amneal Pharmaceuticals over their Alzheimer's drug.",
        "date": "08312016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan  Adamas settle patent lawsuit with Amneal "
    },
    {
        "content": "* Allergan and Adamas announce settlement with Amneal related to namzaric patent litigation",
        "date": "08312016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan and Adamas enter settlement with Amneal Pharmaceuticals "
    },
    {
        "content": "* Washington warns $14.5 billion Irish bill may hurt relations",
        "date": "08312016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "RPT-U.S. slams EU  but Apple tax demand first issued in Washington "
    },
    {
        "content": "BOSTON Carl Icahn  the octogenarian investor whose stock investments still create a buzz on Wall Street nearly 50 years after he first got into the business  made a new bet on Allergan  a new filing shows.",
        "date": "08162016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Icahn makes new bet on Allergan in second-quarter: filing "
    },
    {
        "content": "* Greenlight Capital Inc dissolves share stake in Allergan Plc",
        "date": "08152016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Greenlight Capital dissolves share stake in Allergan Plc - SEC filing "
    },
    {
        "content": " ",
        "date": "08162016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Icahn makes new bet on Allergan  cuts Hertz in Q2 - filing "
    },
    {
        "content": "* Omega Advisors takes 1.49 million shares stake in Nabors Industries Ltd - SEC filing",
        "date": "08152016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Omega Advisors dissolves share stake in Apple  raises share stake in Allergan "
    },
    {
        "content": "* Omega Advisors Inc Ups Share Stake In Allergan Plc By 19.6 Pct To 671 212",
        "date": "08152016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Omega Advisors cuts in Motorola Solutions  ups in Allergan "
    },
    {
        "content": "* Appaloosa LP ups share stake in Allergan Plc to 1.3 Mln from 279 109 Shares - SEC filing",
        "date": "08122016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Appaloosa LP ups share stake in Allergan  cuts in Ingersoll-Rand "
    },
    {
        "content": "* Allergan to acquire eye care company Forsight Vision5 adding Peri-Ocular Ring Technology to company's leading portfolio of innovative eye health products",
        "date": "08112016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan to acquire eye care company Forsight Vision5 "
    },
    {
        "content": "Allergan Plc's  chief executive officer said on Monday he is not interested in using the drugmaker's cash pile for big deals  one week after selling its generics business for $40.5 billion.",
        "date": "08082016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan focused on 'stepping stone' deals  not big ones like Biogen "
    },
    {
        "content": "* Indexes down: Dow 0.2 pct  S&P 0.21 pct  Nasdaq 0.34 pct   (Updates to afternoon)",
        "date": "08082016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "US STOCKS-Wall Street steps back from record highs "
    },
    {
        "content": "NEW YORK  Aug 4 Four months after the collapse of its deal to be bought by Pfizer  Allergan plc  has a $33 billion war chest  a pipeline of experimental drugs that some investors view as undervalued and optimistic shareholders scooping up its shares.",
        "date": "08042016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan's cash-use plan  pipeline could add to share run "
    },
    {
        "content": "Aug 8 Allergan Plc's chief executive officer said on Monday he is not interested in using the drugmaker's cash pile for big deals  one week after selling its generics business for $40.5 billion.",
        "date": "08082016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 3-Allergan focused on 'stepping stone' deals  not big ones like Biogen "
    },
    {
        "content": "JERUSALEM  Aug 4 Teva Pharmaceutical Industries  will remain in the hunt for more acquisitions after completing a deal to buy Allergan's generics business for $40.5 billion this week.",
        "date": "08042016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Teva Pharm eyes more acquisitions after buying Allergan's generics business "
    },
    {
        "content": "* Allergan reports strong second quarter 2016 continuing operations performance with net revenues of $3.7 billion",
        "date": "08082016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan reports Q2 non-GAAP earnings per share of $3.35 "
    },
    {
        "content": "Aug 3 Allergan Plc said it would sell its Anda Inc distribution business to Israel's Teva Pharmaceutical Industries Ltd for $500 million  a day after Teva completed its $40.5 billion acquisition of the Dublin-based company's generics business.",
        "date": "08032016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan to sell Anda drug distribution business to Teva "
    },
    {
        "content": "Biotechnology company Biogen Inc  has drawn takeover interest from drug companies including Merck & Co Inc  and Allergan Plc   The Wall Street Journal reported on Tuesday  citing people familiar with the matter.",
        "date": "08022016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Biogen draws takeover interest from Merck  Allergan: WSJ "
    },
    {
        "content": "JERUSALEM  Aug 4 Teva Pharmaceutical Industries  will focus on the integration of Allergan's  generics business into its operations  it said on Thursday  after completing the $40.5 billion deal this week.",
        "date": "08042016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva Pharm to focus on integrating Allergan's generics business "
    },
    {
        "content": "* Allergan reports strong second quarter 2016 continuing operations performance with net revenues of $3.7 billion",
        "date": "08082016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan Q2 non-GAAP earnings per share $3.35 "
    },
    {
        "content": "* Allergan has no interest in a Biogen deal - CNBC  citing sources",
        "date": "08032016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan has no interest in a Biogen deal - CNBC  citing sources "
    },
    {
        "content": "* Allergan unlikely to pursue Biogen deal- CNBC citing source    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08022016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan unlikely to pursue Biogen deal- CNBC citing source "
    },
    {
        "content": "Aug 2 Biotechnology giant Biogen Inc  has drawn takeover interest from drug companies including Merck & Co Inc and Allergan Plc  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "08022016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "REFILE-Biogen draws takeover interest from Merck  Allergan - WSJ "
    },
    {
        "content": "Aug 8 Allergan Plc reported a bigger second-quarter loss as its Alzheimer's drug  Namenda IR  lost patent exclusivity.",
        "date": "08082016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan quarterly loss widens "
    },
    {
        "content": "* For Q2 of 2016  Anda is expected to contribute approximately $375 million in net revenues excluding sales of Allergan's branded products",
        "date": "08032016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan announces sale of Anda distribution business to Teva "
    },
    {
        "content": "* Biogen has drawn takeover interest from drug companies including Merck & Co and Allergan Plc- WSJ  citing sources  Source (http://on.wsj.com/2b0s6q9)   (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08022016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Biogen has drawn takeover interest from drug companies including Merck & Co and Allergan - WSJ "
    },
    {
        "content": "* Allergan PLC completes divestiture of Global Generics Business to Teva Pharmaceuticals",
        "date": "08022016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan completes divestiture of global generics business to Teva Pharmaceuticals "
    },
    {
        "content": "Pfizer Inc  reported better-than-expected quarterly results  driven by lower taxes and sales of generic medicines  but revenue from its branded patent-protected medicines brought disappointment.",
        "date": "08022016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Pfizer beats estimates  but branded drugs disappoint "
    },
    {
        "content": "Aug 2 Pfizer Inc reported better-than-expected quarterly results  driven by lower taxes and sales of generic medicines  but revenue from its branded patent-protected medicines brought disappointment.",
        "date": "08022016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 5-Pfizer beats estimates  but branded drugs disappoint "
    },
    {
        "content": "Aug 2 Pfizer Inc's quarterly revenue rose about 11 percent  driven by sales of newer drugs and the acquisition of hospital products company Hospira last year.",
        "date": "08022016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Pfizer revenue rises 11 percent "
    },
    {
        "content": "* Allergan receives positive opinion for Truberzi\u007f (eluxadoline) for treatment of irritable bowel syndrome with diarrhoea (IBS-D) in adults",
        "date": "07252016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan receives positive opinion for its treatment for IBS-D in adults "
    },
    {
        "content": "WASHINGTON Teva Pharmaceutical Industries Ltd  won U.S. antitrust approval to purchase Allergan Plc's  generics business  after agreeing to divest 79 generic drugs to rival firms  the Federal Trade Commission said on Wednesday.",
        "date": "07272016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Teva  Allergan win U.S. antitrust approval for generics deal "
    },
    {
        "content": "NEW YORK  July 26 Daniel Loeb's $16 billion Third Point LLC said on Tuesday that the firm's investments in energy credits drove positive returns during the first half of the year and is devoting over $1 billion to energy corporate credits.",
        "date": "07262016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "UPDATE 2-Third Point's 1st-half returns boosted by energy credit investments "
    },
    {
        "content": "A proposed class action brought by health plans claiming Warner Chilcott suppressed generic competition for its ulcerative colitis drugs Asacol HD and Delzicol by discontinuing an older version can go forward  a Boston federal judge ruled Wednesday.",
        "date": "07222016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan must face ulcerative colitis drug product hopping claims "
    },
    {
        "content": "WASHINGTON Teva Pharmaceutical Industries Ltd  won U.S. antitrust approval to purchase Allergan Plc's  generics business  after agreeing to divest more than 75 generic drugs to rival firms  the Federal Trade Commission said on Wednesday.",
        "date": "07272016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva purchase of Allergan generics business gets OK with conditions "
    },
    {
        "content": "July 21 Amgen Inc and Allergan Plc  said their copycat version of Roche Holding AG's  blockbuster cancer treatment  Herceptin  was found as effective as the original in a late-stage study.",
        "date": "07212016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Amgen  Allergan biosimilar found as effective as Roche cancer drug "
    },
    {
        "content": "WASHINGTON  July 27 Teva Pharmaceutical Industries Ltd won U.S. antitrust approval to purchase Allergan Plc's generics business  after agreeing to divest more than 75 generic drugs to rival firms  the Federal Trade Commission said on Wednesday.",
        "date": "07272016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva purchase of Allergan generics business approved with conditions "
    },
    {
        "content": "* Decision follows Adamis' receipt from FDA of a complete response letter in june",
        "date": "07212016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Adamis Pharma provides update on license pact with Allergan "
    },
    {
        "content": "* Teva receives clearance from the U.S. Federal Trade Commission for Actavis Generics acquisition",
        "date": "07272016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Teva gets U.S. FTC clearance for Actavis Generics deal "
    },
    {
        "content": "* In neoadjuvant phase of study  which included chemotherapy  there were more serious adverse events reported in ABP 980 group",
        "date": "07212016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan  Amgen collaborating on development  commercialization of four oncology biosimilars "
    },
    {
        "content": "LONDON  July 21 (IFR) - Teva Pharmaceutical has started marketing a SFr1bn three-tranche bond issue to help fund its US$40.5bn acquisition of Actavis Generics  according to a lead bank.",
        "date": "07212016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva opens books on SFr1bn three-tranche bond "
    },
    {
        "content": "* Says tranches including eur1.75 billion of 0.375% fixed rate senior notes maturing in 2020",
        "date": "07202016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Teva announces pricing of EUR4.0 bln of senior notes "
    },
    {
        "content": "* In addition to two currently available dosage strengths  two new Namzaric dosage strengths will be available in pharmacies in September.",
        "date": "07192016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan and Adamas says FDA approved new  expanded label for Namzaric "
    },
    {
        "content": "* Allergan files application to FDA for approval of oculeve intranasal tear neurostimulator  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07182016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan files application for approval of oculeve intranasal tear neurostimulator "
    },
    {
        "content": "LONDON  July 20 (IFR) - Teva Pharmaceutical has set final terms for an expected \u007f4bn three-tranche bond issue to help fund its US$40.5bn acquisition of Actavis Generics  according to a lead bank.",
        "date": "07202016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva to print \u007f4bn across three tranche M&A bond "
    },
    {
        "content": "* Announces pricing of $15 billion of senior notes in connection with pending acquisition of Actavis Generics",
        "date": "07192016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Teva Pharmaceutical announces pricing of $15 bln of senior notes "
    },
    {
        "content": "NEW YORK  July 18 (IFR) - Teva Pharmaceutical is selling an up to seven-tranche US dollar bond Monday to help finance its acquisition of Allergan Generics  one of the banks managing the deal told IFR.",
        "date": "07182016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "URGENT-Teva to sell up to seven-tranche US dollar bond Monday "
    },
    {
        "content": "NEW YORK/TEL AVIV Teva Pharmaceutical Industries Ltd  said on Wednesday it expected its $40 billion deal to buy Allergan Plc's  generics business to close \"at any time \" even as the companies extended the deadline for completing the transaction to October to allow more time for the U.S. antitrust review.",
        "date": "07132016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Teva says Allergan deal to close 'any time'  expects U.S. antitrust clearance "
    },
    {
        "content": "LONDON  July 20 (IFR) - Teva Pharmaceutical has set final spreads for an expected \u007f4bn multi-tranche issue to help fund its US$40.5bn acquisition of Actavis Generics  according to a lead bank.",
        "date": "07202016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva sets final terms for expected \u007f4bn M&A bond "
    },
    {
        "content": "NEW YORK/TEL AVIV  July 13 Teva Pharmaceutical Industries Ltd said on Wednesday it expected its $40 billion deal to buy Allergan Plc's generics business to close \"at any time \" even as the companies extended the deadline for completing the transaction to October to allow more time for the U.S. antitrust review.",
        "date": "07132016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 3-Teva says Allergan deal to close 'any time'  expects U.S. antitrust clearance "
    },
    {
        "content": "LONDON  July 20 (IFR) - Teva Pharmaceutical has set guidance for a multi-tranche bond issue to help fund its US$40.5bn acquisition of Actavis Generics  according to a lead bank.",
        "date": "07202016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva sets guidance for three tranche euro-denominated M&A bond "
    },
    {
        "content": "LONDON  July 20 (IFR) - Teva Pharmaceutical has started marketing an expected \u007f4bn multi-tranche euro bond issue to help fund its US$40.5bn acquisition of Actavis Generics  according to a lead bank.",
        "date": "07202016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva marketing three-tranche euro-denominated M&A bond "
    },
    {
        "content": "July 13 Allergan Plc said it extended the deadline to close a deal to sell its generic business to Teva Pharmaceutical Industries Ltd by three months to October.",
        "date": "07132016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "CORRECTED-Allergan extends Teva deal deadline "
    },
    {
        "content": "* Allergan  Teva deal approval expected in next 2 weeks - CNBC citing sources   Further company coverage: [AGN.N TEVA.TA]   (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "07132016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan  Teva deal approval expected in next 2 weeks - CNBC "
    },
    {
        "content": "* Sees 2016 revenue $22.0-$22.5 bln  non-gaap EPS $5.20-$5.40",
        "date": "07132016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Israel's Teva Pharm provides 2016-2019 financial estimates "
    },
    {
        "content": "* Co and teva pharmaceutical industries ltd entered into an amendment  dated july 11  2016 to master purchase agreement",
        "date": "07132016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan  Teva entered amendment to master purchase agreement "
    },
    {
        "content": "Impax Laboratories Inc  said it would buy a portfolio of generic drugs from Teva Pharmaceutical Industries Ltd  and Allergan Plc  for about $586 million.",
        "date": "06212016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Impax buys generic drugs from Teva  Allergan for $586 million "
    },
    {
        "content": "June 21 Impax Laboratories Inc said it would buy a portfolio of generic drugs from Teva Pharmaceutical Industries Ltd and Allergan Plc for about $586 million.",
        "date": "06212016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 2-Impax buys generic drugs from Teva  Allergan for $586 mln "
    },
    {
        "content": "* Expects 2016 total company revenues to increase at least 15% over full year 2015",
        "date": "06212016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Impax signs agreements to acquire generic products from Teva  Allergan "
    },
    {
        "content": "June 21 Impax Laboratories Inc said it would buy a portfolio of generic products from Teva Pharmaceutical Industries Ltd and Allergan Plc  for about $586 million.",
        "date": "06212016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Impax buys portfolio of generic products from Teva  Allergan "
    },
    {
        "content": "* \"Look forward to working together with FDA\" to bring glaucoma treatment system to market",
        "date": "06152016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan says FDA accepts premarket notification filing for glaucoma treatment "
    },
    {
        "content": "MUMBAI India's second-largest drugmaker Dr Reddy's Laboratories Ltd said it agreed to buy eight generic drugs from Teva Pharmaceutical Industries and Allergan Plc for $350 million in cash to bolster its U.S. business.",
        "date": "06112016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "India's Dr Reddy's in $350 million deal to buy eight U.S. drugs from Teva  Allergan "
    },
    {
        "content": "* FDA prescription drug user fee act (PDUFA) target action date is expected to occur in early 2017",
        "date": "06092016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan says supplemental NDA for 72 mcg Linaclotide accepted for FDA review "
    },
    {
        "content": "MUMBAI  June 11 India's second-largest drugmaker Dr Reddy's Laboratories Ltd said it agreed to buy eight generic drugs from Teva Pharmaceutical Industries  and Allergan Plc for $350 million in cash to bolster its U.S. business.",
        "date": "06112016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "CORRECTED-UPDATE 1-India's Dr Reddy's in $350 mln deal to buy 8 U.S. drugs from Teva  Allergan "
    },
    {
        "content": "MUMBAI  June 11 India's No. 2 drugmaker Dr Reddy's Laboratories Ltd said it agreed to buy a portfolio of eight generic drugs from Teva Pharmaceutical Industries Ltd and Allergan Plc for $350 million in cash to bolster its U.S. business.",
        "date": "06112016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "CORRECTED-India's Dr Reddy's to buy 8 U.S. generic drugs from Teva  Allergan for $350 mln "
    },
    {
        "content": "* Allergan CEO to CNBC: \"Don't know exactly\" how large Icahn's position in the company is",
        "date": "06062016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan CEO to CNBC: \"Don't know exactly\" how large Icahn's position in the company is "
    },
    {
        "content": "The U.S. Food and Drug Administration approved Allergan Plc's treatment for high blood pressure or hypertension  the company said on Monday.",
        "date": "06062016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "FDA approves Allergan's combination therapy for hypertension "
    },
    {
        "content": "June 6 The U.S. Food and Drug Administration approved Allergan Plc's treatment for high blood pressure or hypertension  the company said on Monday.",
        "date": "06062016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-FDA approves Allergan's combination therapy for hypertension "
    },
    {
        "content": "June 6 The U.S. Food and Drug Administration approved Allergan Plc's treatment for high blood pressure or hypertension  the company said on Monday.",
        "date": "06062016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "U.S. FDA approves Allergan's hypertension treatment "
    },
    {
        "content": "* Allergan expects byvalson to be available in 2nd half of 2016.",
        "date": "06062016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan announces FDA approval of byvalson "
    },
    {
        "content": "* Received approval from U.S. Food And Drug Administration (FDA) to market Juvéderm Volbella XC",
        "date": "06012016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan receives FDA approval to market Juvéderm Volbella XC "
    },
    {
        "content": "Billionaire investor Carl Icahn said on Tuesday he had acquired a \"large position\" in Botox-maker Allergan Plc  and that he was very supportive of Chief Executive Officer Brent Saunders.",
        "date": "05312016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Carl Icahn acquires 'large position' in Allergan  backs CEO "
    },
    {
        "content": "May 31 Billionaire investor Carl Icahn said on Tuesday he had acquired a \"large position\" in Botox-maker Allergan Plc and that he was very supportive of Chief Executive Officer Brent Saunders.",
        "date": "05312016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 2-Carl Icahn acquires 'large position' in Allergan  backs CEO "
    },
    {
        "content": "* Carl Icahn says is \"very supportive\" of Allergan CEO Brent Saunders",
        "date": "05312016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Carl Icahn says recently acquired a \"large position\" in Allergan "
    },
    {
        "content": "* Allergan receives FDA approval of Teflaro\u007f (Ceftaroline Fosamil) for pediatric patients  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05312016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan receives FDA approval of Teflaro "
    },
    {
        "content": "* Allergan announces FDA acceptance of NDA filing for oxymetazoline hci cream 1.0%",
        "date": "05242016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan announces FDA acceptance of NDA filing for oxymetazoline hci cream 1.0% "
    },
    {
        "content": "* Allergan's botox vista\u007f (botulinum toxin type a) receives national marketing authorisation in japan for treatment of crow's feet lines in adult patients",
        "date": "05232016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan's botox wins Japanese approval to treat crow's feet lines "
    },
    {
        "content": "NEW YORK Allergan Plc  Chief Executive Brent Saunders said on Monday the company expects to close the $40.5 billion sale of its generic medicines portfolio to Teva Pharmaceutical Industries Ltd  in a matter of weeks  opening the door for new acquisitions.",
        "date": "05232016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan CEO says company is 'weeks away' from closing Teva deal "
    },
    {
        "content": "NEW YORK  May 23 Allergan Plc Chief Executive Brent Saunders said on Monday the company expects to close the $40.5 billion sale of its generic medicines portfolio to Teva Pharmaceutical Industries Ltd in a matter of weeks  opening the door for new acquisitions.",
        "date": "05232016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Allergan CEO says company is \"weeks away\" from closing Teva deal "
    },
    {
        "content": "* Allergan CEO says company is free to do multibillion dollar deals after Teva transaction closes",
        "date": "05232016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan CEO says company is \"weeks away\" from closing Teva deal "
    },
    {
        "content": "BOSTON Hedge funds  including Baupost Group  Davidson Kempner Capital Management and Magnetar Financial  made investments in Allergan Plc  during the first quarter  betting that the company would become the world's biggest drug maker.",
        "date": "05172016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Investors made bets on Allergan just weeks before deal collapsed "
    },
    {
        "content": "BOSTON  May 16 Hedge funds  including Baupost Group  Davidson Kempner Capital Management and Magnetar Financial  made investments in Allergan Plc during the first quarter  betting that the company would become the world's biggest drug maker.",
        "date": "05162016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Investors made bets on Allergan just weeks before deal collapsed "
    },
    {
        "content": "NEW YORK  May 13 Seth Klarman's Baupost Group took a new stake in the first quarter in Allergan Plc  before the drugmaker's $160 billion merger with Pfizer Inc  was terminated last month.",
        "date": "05132016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Baupost took $461 mln Allergan stake before Pfizer deal collapsed "
    },
    {
        "content": "NEW YORK  May 16 Former SAC executive Gabe Plotkin's Melvin Capital took a new position in streaming video service Netflix Inc  buying 950 000 shares and a call option for 1.45 million shares  according to regulatory filings on Monday. Hoplite Capital also took a new position in Netflix  buying 236 456 shares  while Blue Ridge took a new position  buying 1.4 million shares.",
        "date": "05162016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "HIGHLIGHTS-Top U.S. hedge funds bet on Netflix  Yahoo  consumer stocks "
    },
    {
        "content": "* Allergan announces positive pivotal trial results for oculeve intranasal tear neurostimulator",
        "date": "05162016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan announces positive pivotal trial results for Oculeve Intranasal Tear Neurostimulator "
    },
    {
        "content": "Allergan Plc   whose $160 billion merger with Pfizer Inc  collapsed last month  reported a higher-than-expected quarterly profit and said it would buy back up to $10 billion in company stock  helping lift its shares 4 percent.",
        "date": "05102016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan profit beats estimates  share buybacks planned "
    },
    {
        "content": " ",
        "date": "05092016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "A "
    },
    {
        "content": "* Shares up 2.9 pct at $220.00   (Adds Breakingviews link  updates share price)",
        "date": "05102016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 5-Allergan profit beats estimates  share buybacks planned "
    },
    {
        "content": "* Says in analyst conference call that new Vraylar schizophrenia drug has blockbuster sales potential",
        "date": "05102016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan says to pay down $8 bln in debt with Teva-deal proceeds "
    },
    {
        "content": "* Teva Pharmaceutical Industries Ltd says generic medicines revenues in q1 of 2016 amounted to $2.2 billion  a decrease of 17%",
        "date": "05092016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Teva Pharmaceutical's Q1 Non-GAAP EPS $1.20 "
    },
    {
        "content": "* Cardiome and allergan announce xydalba(tm) (dalbavancin) licensing agreement in international markets",
        "date": "05052016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Cardiome and Allergan announce Xydalba(tm) licensing agreement in international markets "
    },
    {
        "content": "*Allergan and Richter announce positive phase 3 results for ulipristal acetate in treatment of uterine fibroids",
        "date": "05092016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Richter and Allergan plan to submit new drug application for uterine fibroids in 2017 "
    },
    {
        "content": "Teva Pharmaceutical Industries Ltd is finalizing as much as $2 billion in asset sale agreements to win U.S. antitrust clearance for its $40.5 billion acquisition of Allergan Plc's generic drug portfolio  according to a source familiar with the matter.",
        "date": "05052016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva Pharm finalizing asset sales to clear Allergan deal: source "
    },
    {
        "content": "* Supernus enters into partial settlement agreement with Actavis on oxtellar xr",
        "date": "05102016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Supernus enters partial settlement agreement with Actavis on oxtellar xr "
    },
    {
        "content": "* Allergan and Richter announce positive phase iii results for ulipristal acetate 5 and 10 mg in treatment of uterine fibroids",
        "date": "05092016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan and Richter say new drug application for treatment of uterine fibroids planned to be submitted in 2017 "
    },
    {
        "content": "May 5 Teva Pharmaceutical Industries Ltd  is finalizing as much as $2 billion in asset sale agreements to win U.S. antitrust clearance for its $40.5 billion acquisition of Allergan Plc's generic drug portfolio  according to a source familiar with the matter.",
        "date": "05052016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva Pharm finalizing asset sales to clear Allergan deal -source "
    },
    {
        "content": "* Shareholder proposal requesting Allergan's annual report on lobbying activities defeated at Co's annual meeting",
        "date": "05062016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan shareholders vote against independent board chairman - SEC Filing "
    },
    {
        "content": "* Co  perrigo announced launch of guaifenesin 1200mg and dextromethorphan hbr 60mg extended-release tablets",
        "date": "05032016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan and Perrigo announce launch of guaifenesin 1200mg "
    },
    {
        "content": "* Namenda XR revenues in Q1 of 2016 were $173 million   as prescriptions formulary coverage remained stable following loss of exclusivity of Namenda IR",
        "date": "05102016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan Q1 loss per share $0.38 from continuing operations "
    },
    {
        "content": "May 10 Allergan Plc  whose $160 billion merger with Pfizer Inc fell apart last month  reported a 48 percent rise in quarterly revenue  led by a strong performance by its branded drugs business  which includes Botox and the eye drug Restasis.",
        "date": "05102016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan reports 48 pct rise in quarterly revenue "
    },
    {
        "content": "* Company expects to execute $4 - $5 billion in open market repurchases",
        "date": "05102016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan announces share repurchase program of up to $10 bln "
    },
    {
        "content": "* Allergan receives chmp positive opinion for enzepi\u007f (pancrelipase) for patients with exocrine pancreatic insufficiency (epi)",
        "date": "04292016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan receives CHMP positive opinion for enzepi "
    },
    {
        "content": "* Beginning in 2016  Liletta is available at a price of $55.83 to military treatment facilities and VA hospitals nationwide  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05022016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan says Liletta available at price of $55.83 to military treatment facilities  VA hospitals nationwide "
    },
    {
        "content": "* Watson will obtain commercial rights for U.S. For upfront fee and milestone payments totaling up to $32.5 million",
        "date": "05102016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Adamis Pharmaceuticals announces license agreement with Allergan unit "
    },
    {
        "content": "* Allergan receives fda approval and launches first generic version of crestor\u007f (rosuvastatin)  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05022016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan receives FDA approval "
    },
    {
        "content": "* Allergan acquires topical dermatology company Topokine Therapeutics adding non-invasive fat reduction development program",
        "date": "04212016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan buys topical dermatology company Topokine Therapeutics "
    },
    {
        "content": "April 7 Britain's FTSE 100 index is seen opening up 8 points  or 0.13 percent  on Thursday  according to financial bookmakers  with futures up 0.40 percent ahead of the cash market open. For more on the factors affecting European stocks  please click on",
        "date": "04072016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-UK Stocks-Factors to watch on April 7 "
    },
    {
        "content": "April 7 Britain's FTSE 100 index is seen opening up 8 points  or 0.13 percent  on Thursday  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The UK blue chip index closed up 70.40 points  or 1.2 percent  on Wednesday at 6 161.63  boosted by pharmaceuticals companies as Pfizer  pulled out of a deal for Allergan  prompting speculation over other merger and acquisition activity in the sector.      * BP: Shareholder advisor",
        "date": "04072016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UK Stocks-Factors to watch on April 7 "
    },
    {
        "content": "U.S. drugmaker Pfizer Inc  and Ireland-based Allergan Plc  walked away from their $160 billion merger on Wednesday  a major win for President Barack Obama  who has been pushing to curb deals in which companies move overseas to cut taxes. | Video ",
        "date": "04062016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Pfizer  Allergan scrap $160 billion deal after U.S. tax rule change "
    },
    {
        "content": "* Under terms of agreement  Heptares will receive an upfront payment of $125 million",
        "date": "04062016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan's and Heptares's units enter licensing agreement "
    },
    {
        "content": "* Baa3 rating reflects allergan's significant scale and good diversity by therapeutic area and product  Source text for Eikon:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04062016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Moody's confirms Allergan's Baa3 rating outlook stable "
    },
    {
        "content": "* Indexes up: Dow 0.2 pct  S&P 0.5 pct  Nasdaq 1 pct   (Updates to after Fed minutes)",
        "date": "04062016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "US STOCKS-Wall St rises with healthcare; oil rallies "
    },
    {
        "content": "* Conducting a review of u.s. Department of Treasury's actions announced today",
        "date": "04042016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Pfizer and Allergan say conducting a review of U.S. Department of Treasury's actions "
    },
    {
        "content": "LONDON Hedge funds which bet on mergers and acquisitions were hurt by the collapse of a $160 billion tie-up between pharmaceutical companies Pfizer  and Allergan  - although the effects could have been even worse.",
        "date": "04062016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Mega-deal collapse a second-quarter wake-up for merger-arb hedge funds "
    },
    {
        "content": "LONDON  April 6 Hedge funds which bet on mergers and acquisitions were hurt by the collapse of a $160 billion tie-up between pharmaceutical companies Pfizer and Allergan - although the effects could have been even worse.",
        "date": "04062016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Mega-deal collapse a Q2 wake-up for merger-arb hedge funds "
    },
    {
        "content": "April 6 U.S. drugmaker Pfizer Inc and Ireland-based Allergan Plc walked away from their $160 billion merger on Wednesday  a major win for President Barack Obama  who has been pushing to curb deals in which companies move overseas to cut taxes.",
        "date": "04062016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 3-Pfizer  Allergan scrap $160 bln deal after U.S. tax rule change "
    },
    {
        "content": "* Indexes up: Dow 0.39 pct  S&P 0.65 pct  Nasdaq 1.02 pct   (Updates to early afternoon)",
        "date": "04062016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "US STOCKS-Wall St pushed higher by healthcare  energy stocks "
    },
    {
        "content": "Democratic presidential candidates Hillary Clinton and Bernie Sanders on Wednesday cheered the end of U.S. drugmaker Pfizer Inc's  $160 billion merger with Ireland-based Allergan Plc .",
        "date": "04062016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Democratic White House hopefuls cheer end of Pfizer  Allergan deal "
    },
    {
        "content": "Drugmaker Pfizer Inc  is leaning toward abandoning its $160 billion agreement to buy Allergan Plc  in light of the U.S. Treasury's new measures to curb such tax evading deals  a source familiar with the situation said on Tuesday. | Video ",
        "date": "04052016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Exclusive: Pfizer leaning toward abandoning deal with Allergan - source "
    },
    {
        "content": "NEW YORK  April 5 The dollar fell on Tuesday to touch its weakest level against the yen since October 2014 and stock markets worldwide slumped as economic data out of Europe and the United States prompted a retreat from riskier assets.",
        "date": "04052016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "GLOBAL MARKETS-Dollar touches 17-month low vs yen as stocks slump "
    },
    {
        "content": "NEW YORK The U.S. Treasury Department's proposed new tax regulations threw a series of corporate mergers into question on Tuesday  fanning a hot political situation and pushing Pfizer Inc closer to a decision to walk away from buying Botox maker Allergan Plc.",
        "date": "04052016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "U.S. Treasury rules put Pfizer-Allergan deal in question "
    },
    {
        "content": "NEW YORK  April 5 Shares in Allergan Plc  opened down more than 15 percent on Tuesday  a day after the U.S. Treasury Department proposed new tax regulations that analysts said could kill its $160 billion agreement to be bought by Pfizer Inc.",
        "date": "04052016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan shares fall as investors bet on Pfizer deal collapse "
    },
    {
        "content": "* CEO Brenton Saunders' 2015 total compensation was $21.6 million versus $36.6 million in 2014 - SEC filing",
        "date": "03252016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan CEO's 2015 total compensation was $21.6 million "
    },
    {
        "content": "March 28 A U.S. district court on Monday ruled in favor of Shire Plc  preventing Allergan Plc  from selling generic versions of Lialda  the ulcerative colitis drug  in the United States until 2020.",
        "date": "03282016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Shire gets favorable ruling against Allergan in Lialda patent case "
    },
    {
        "content": "* \u007fPerrigo and Allergan announce first-to-market launch of store brand OTC equivalent to Mucinex\u007f 1200mg er tablets",
        "date": "03232016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan and Perrigo announce launch of guaifenesin 1200mg ER tablets "
    },
    {
        "content": "* U.S. Court rules on patent litigation between shire and allergan",
        "date": "03282016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-U.S. court rules in favor of Shire over Allergan Lialda patent "
    },
    {
        "content": "* \u007fNow anticipate that completing Actavis generics\u007f acquisition could take as long as june 2016 - SEC filing  Source - http://1.usa.gov/1R2sPnl Further company coverage:    )",
        "date": "03162016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan PLC anticipates completing Actavis acquisition could take as long as June 2016 "
    },
    {
        "content": "TEL AVIV  March 15 Israel-based Teva Pharmaceutical Industries said on Tuesday it now expects its $40.5 billion acquisition of the generic drug activities of Allergan to be completed by June.",
        "date": "03152016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva Pharm sees close of $40.5 bln Allergan generics deal by June "
    },
    {
        "content": "TEL AVIV Israel-based Teva Pharmaceutical Industries  said on Tuesday it now expects its $40.5 billion acquisition of the generic drug activities of Allergan  to be completed by June.",
        "date": "03152016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva Pharm sees close of $40.5 billion Allergan generics deal by June "
    },
    {
        "content": "BRUSSELS  March 10 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03102016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "UPDATE 1-EU mergers and takeovers (March 10) "
    },
    {
        "content": "BRUSSELS  March 10 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03102016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "EU mergers and takeovers (March 10) "
    },
    {
        "content": "BRUSSELS  March 9 Teva Pharmaceutical Industries  is expected to win EU antitrust approval for its $40.5 billion bid for Allergan's generics unit after agreeing to sell off some of its products to appease regulators  three people familiar with the matter said on Wednesday.",
        "date": "03092016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "EXCLUSIVE-Teva set to win EU okay for $40.5 bln Allergan deal -sources "
    },
    {
        "content": "BRUSSELS  March 10 The European Commission on Thursday approved Teva Pharmaceutical Industries'  $40.5 billion acquisition of the generics activities of Allergan  conditional on a number of divestments  notably Allergan businesses in Britain and Ireland.",
        "date": "03102016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "EU approves Teva bid for Allergan's generics with conditions "
    },
    {
        "content": "BRUSSELS Teva Pharmaceutical Industries  is expected to win EU antitrust approval for its $40.5 billion bid for Allergan's  generics unit after agreeing to sell off some of its products to appease regulators  three people familiar with the matter said on Wednesday.",
        "date": "03092016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Exclusive: Teva set to win EU okay for $40.5 billion Allergan deal - sources "
    },
    {
        "content": "NEW YORK  March 3 Calls in the U.S. presidential campaign to cut pharmaceutical prices are not helping to revive a barely two-month-old exchange-traded fund that invests in shares of generic drugmakers.",
        "date": "03032016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Generic drug ETF ailing despite political focus on high drug prices "
    },
    {
        "content": "Allergan Plc  reported better-than-expected quarterly revenue  helped by strong performance in its U.S. brands segment  and said it continues to expect its takeover by Pfizer Inc  to close in the second half 2016.",
        "date": "02222016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan's revenue beats on higher U.S. brand sales "
    },
    {
        "content": "Feb 22 Allergan Plc reported better-than-expected quarterly revenue  helped by strong performance in its U.S. brands segment  and said it continues to expect its takeover by Pfizer Inc to close in the second half 2016.",
        "date": "02222016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 2-Allergan's revenue beats on higher U.S. brand sales "
    },
    {
        "content": "Feb 22 Allergan Plc  which is in the process of being bought by Pfizer Inc  reported a 73.8 percent rise in quarterly revenue  helped by strong performance in its branded drugs business which includes Botox and Restasis eye drops.",
        "date": "02222016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan reports higher Q4 revenue "
    },
    {
        "content": "BRUSSELS Teva Pharmaceutical Industries Ltd  has offered concessions to allay EU antitrust concerns over its $40.5 billion bid for Allergan's  generics unit which will cement its position as the world's largest generics drugmaker.",
        "date": "02192016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Teva offers EU concessions over Allergan generics deal "
    },
    {
        "content": "* Deal would cement Teva as world's largest generics drugmaker",
        "date": "02192016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 2-Teva offers EU concessions over Allergan generics deal "
    },
    {
        "content": "BRUSSELS  Feb 19 Teva Pharmaceutical Industries Ltd has offered concessions to allay antitrust concerns over its $40.5 billion bid for Allergan's  generics unit  European Union regulators said on Friday.",
        "date": "02192016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva offers EU concessions over Allergan generics deal - EU "
    },
    {
        "content": "LONDON  Feb 12 Eli Lilly said on Friday it lost the latest round of a lengthy patent saga over its blockbuster Alimta lung cancer drug in the UK High Court  in a boost for generic drugmaker Actavis  now renamed Allergan .",
        "date": "02122016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Eli Lilly loses latest round in UK drug patent battle "
    },
    {
        "content": "Pfizer Inc   which agreed to buy Allergan Plc  for $160 billion last year  unveiled its management line up for the combined company  once the deal closes in the second half of 2016.",
        "date": "02082016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Pfizer unveils management line up for combined company "
    },
    {
        "content": "Feb 8 Pfizer Inc  which agreed to buy Allergan Plc for $160 billion last year  unveiled its management line up for the combined company  once the deal closes in the second half of 2016.",
        "date": "02082016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Pfizer unveils management line up for combined company "
    },
    {
        "content": "Feb 5 A federal judge on Friday said Allergan Plc's plan to sell a generic version of a drug meant to treat epilepsy infringed patents belonging to Supernus Pharmaceuticals Inc.",
        "date": "02052016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Supernus beats Allergan over epilepsy drug patents "
    },
    {
        "content": "Feb 8 Pfizer Inc  which agreed to buy Allergan Plc for $160 billion last year  said it will create a new operating unit to house its consumer healthcare and Allergan's opthalmology and Botox units once the deal closes in the second half of 2016.",
        "date": "02082016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Pfizer to create operating unit after Allergan deal closes "
    },
    {
        "content": "Feb 5 A federal judge on Friday said Allergan Plc's planned generic version of a drug meant to treat epilepsy infringed patents belonging to Supernus Pharmaceuticals Inc.",
        "date": "02052016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Supernus beats Allergan over epilepsy drug patents "
    },
    {
        "content": "* Cannot speculate whether u.s. Treasury department will issue third notice on tax inversions",
        "date": "02022016",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Pfizer says see no legal roadblocks to Allergan merger "
    },
    {
        "content": "Feb 2 Pfizer Inc  which has agreed to buy Botox-maker Allergan Plc for $160 billion  reported a 7 percent rise in quarterly revenue  helped by its Hospira acquisition and demand for its pneumonia vaccine.",
        "date": "02022016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Pfizer revenue rises as pneumonia vaccine sales jump "
    },
    {
        "content": "NEW YORK  Jan 12 The research chiefs of betrothed drugmakers Pfizer Inc and Allergan say the proposed combination of their experimental drugs deserves more credit  including potential blockbuster treatments for schizophrenia and depression.",
        "date": "01122016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Pfizer  Allergan say combined drug pipeline 'underappreciated' "
    },
    {
        "content": "NEW YORK  Jan 12 (IFR) - Investors could easily soak up a US$60bn bond from AB InBev if the beer giant wants to sell that much debt this week to help fund its acquisition of rival brewer SABMiller.",
        "date": "01122016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Bond investors hope AB InBev will wet their whistles "
    },
    {
        "content": "* Pfizer says its experimental off-the-shelf CAR T cell therapies for cancer may have major advantages over personalized CAR T cells",
        "date": "01122016",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Allergan research chief says Pfizer immuno-oncology pipeline underappreciated "
    },
    {
        "content": "BOSTON  Dec 31 Billionaire investor William Ackman said on Thursday he sold about 5 million shares in drug company Valeant International in order to generate a tax loss as investors in his Pershing Square Capital Management face the biggest loss in the company's history.",
        "date": "12312015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Ackman's fund sells 5 mln Valeant shares to generate tax loss "
    },
    {
        "content": "Allergan PLC's extortion claims against a venture fund that tried to challenge the validity of one of its patents do not belong in federal court  a federal judge has ruled.",
        "date": "12302015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "U.S. judge tosses Allergan extortion lawsuit against fund over patent "
    },
    {
        "content": "Teva Pharmaceutical Industries Ltd  is in the process of divesting about $1 billion worth of assets to address antitrust concerns over its deal to buy Allergan Plc's  generic drugs business  people familiar with the matter said.",
        "date": "12032015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Teva divesting $1 billion in assets to clear Allergan deal "
    },
    {
        "content": "Dec 3 Teva Pharmaceutical Industries Ltd  is in the process of divesting about $1 billion worth of assets to address antitrust concerns over its deal to buy Allergan Plc's generic drugs business  people familiar with the matter said.",
        "date": "12032015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva divesting $1 bln in assets to clear Allergan deal -sources "
    },
    {
        "content": "NEW YORK Pfizer Inc on Monday said it would buy Botox maker Allergan Plc in a deal worth $160 billion to slash its U.S. tax bill  rekindling a fierce political debate over the financial maneuver. | Video ",
        "date": "11242015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Pfizer to buy Allergan in $160 billion deal "
    },
    {
        "content": " ((Story corrects description of Healthcare Compliance Association to non-profit membership association  from a company that provides consultation for healthcare providers in first item})",
        "date": "11242015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Saunders gets key job as Pfizer  Allergan combine (Nov. 23) "
    },
    {
        "content": "Pfizer Inc  was due to secure formal board approval on Sunday for its acquisition of Botox maker Allergan Plc  for more than $150 billion  creating the world's biggest drug maker  according to people familiar with the matter.",
        "date": "11222015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Pfizer set to buy Allergan for more than $150 billion "
    },
    {
        "content": "Nov 23 Allergan Plc's Chief Executive Brent Saunders will be second in command at the world's largest drug maker  after he made the biggest bet of his career by selling his company for a record $160 billion to Pfizer Inc .",
        "date": "11242015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "CORRECTED-TIMELINE-Saunders gets key job as Pfizer  Allergan combine (Nov. 23) "
    },
    {
        "content": "Nov 22 Pfizer Inc was due to secure formal board approval on Sunday for its acquisition of Botox maker Allergan Plc for more than $150 billion  creating the world's biggest drug maker  according to people familiar with the matter.",
        "date": "11222015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 3-Pfizer set to buy Allergan for more than $150 bln-sources "
    },
    {
        "content": "SYDNEY/WELLINGTON  Nov 24 Australian shares fell 0.62 percent on Tuesday ending a five session winning streak  taking negative cues from Wall Street and lower commodity prices.",
        "date": "11242015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Australia shares turn lower  dragged by falling commodity prices "
    },
    {
        "content": "Nov 22 Pfizer Inc's and Allergan Plc's  boards of directors were due to approve their merger agreement on Sunday  in the healthcare sector's largest ever deal  according to people familiar with the matter.",
        "date": "11222015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Pfizer and Allergan to approve merger agreement on Sunday-sources "
    },
    {
        "content": "NEW YORK Pfizer Inc  on Monday said it would buy Botox maker Allergan Plc  in a deal worth $160 billion to slash its U.S. tax bill  rekindling a fierce political debate over the financial maneuver. | Video ",
        "date": "11232015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Pfizer to buy Allergan in $160 billion deal "
    },
    {
        "content": "Nov 20 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Friday:",
        "date": "11202015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Nov 19 Several large U.S. funds that boosted their stakes in Allergan Plc in recent months appear to be optimistic about the company's growth prospects  even before Pfizer's reported $150 billion takeover bid for the botox maker.",
        "date": "11192015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "U.S. funds optimistic about Allergan piled in before Pfizer bid "
    },
    {
        "content": "Pfizer Inc and Allergan Inc chief executives have agreed on the roles they would assume in a combined company  removing one of the last hurdles to the largest ever healthcare merger  people familiar with the matter said.",
        "date": "11202015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Exclusive: Pfizer  Allergan CEOs agree on combined company roles - sources "
    },
    {
        "content": "Nov 19 Several large U.S. funds that boosted their stakes in Allergan Plc in recent months appear to be optimistic about the company's growth prospects  even before Pfizer's reported $150 billion takeover bid for the botox maker.",
        "date": "11192015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-U.S. funds optimistic about Allergan piled in before Pfizer bid "
    },
    {
        "content": "NEW YORK  Nov 23 Pfizer Inc on Monday said it would buy Botox maker Allergan Plc in a deal worth $160 billion to slash its U.S. tax bill  rekindling a fierce political debate over the financial maneuver.",
        "date": "11232015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 5-Pfizer to buy Allergan in $160 billion deal "
    },
    {
        "content": "BOSTON Hedge fund managers' favorite stocks stumbled hard this year to post their worst returns since the financial crisis with health-care companies  such as Valeant Pharmaceuticals   leading the way lower  according to new data from Goldman Sachs.",
        "date": "11232015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Hedge funds' favorite stocks lag broader market: Goldman data "
    },
    {
        "content": "Several large U.S. funds that boosted their stakes in Allergan Plc  in recent months appear to be optimistic about the company's growth prospects  even before Pfizer's reported $150 billion takeover bid for the botox maker.",
        "date": "11202015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "U.S. funds optimistic about Allergan piled in before Pfizer bid "
    },
    {
        "content": "RINGASKIDDY  Ireland  Nov 16 Drugmaker Pfizer's  plans to take over Allergan have faced a political backlash in the United States over fears a deal would lead to the company shifting its headquarters and taxable profits to Ireland.",
        "date": "11172015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "RPT-INSIGHT-How Pfizer has shifted U.S. profits overseas for years "
    },
    {
        "content": "Pfizer Inc  and Allergan Plc  are in final stages of talks over an all-stock deal  CNBC tweeted  citing sources.",
        "date": "11192015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Pfizer  Allergan in final stage of merger talks: CNBC "
    },
    {
        "content": "Nov 23 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "11232015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "WASHINGTON  Nov 23 U.S. Democratic presidential candidate Hillary Clinton on Monday bashed Pfizer Inc's  deal to buy Allergan PLC  saying she would propose steps to prevent tax inversions and calling on regulators to take tougher action.",
        "date": "11232015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Clinton bashes Pfizer-Allergan deal  to propose anti-inversion steps "
    },
    {
        "content": "WASHINGTON/NEW YORK  Nov 19 The U.S. Treasury Department on Thursday took steps to clamp down on tax-avoiding \"inversion\" deals with new rules  though there was scarce evidence they would stop the biggest inversion of them all  between Pfizer Inc and Allergan Plc.",
        "date": "11202015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 2-U.S. unveils new inversion rules; unlikely to thwart Pfizer "
    },
    {
        "content": "Nov 19 Pfizer Inc and Allergan Plc  are in final stages of talks over an all-stock deal  CNBC tweeted  citing sources.",
        "date": "11192015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Pfizer  Allergan in final stage of merger talks - CNBC "
    },
    {
        "content": "Nov 23 Allergan Plc's Chief Executive Brent Saunders will be second in command at the world's largest drug maker  after he made the biggest bet of his career by selling his company for a record $160 billion to Pfizer Inc .",
        "date": "11232015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "TIMELINE-Saunders gets key job as Pfizer  Allergan combine "
    },
    {
        "content": "Pfizer Inc  is in talks to acquire Allergan Plc  for $370-$380 per share  according to a person familiar with the matter  valuing the potential deal at around $150 billion  the healthcare sector's biggest.",
        "date": "11192015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Pfizer discussing Allergan offer at $370-$380 per share: source "
    },
    {
        "content": "NEW YORK/WASHINGTON  Nov 18 Pfizer Inc's  talks to acquire Allergan Plc in a $150 billion deal that would see the U.S. drug giant redomicile in Ireland accelerated on Wednesday  as the U.S. Treasury prepared to clamp down further on such tax inversions.",
        "date": "11192015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 3-Pfizer-Allergan talks accelerate amid new inversion clamp-down "
    },
    {
        "content": "WASHINGTON Pfizer Inc's  buyout bid for Allergan Plc  has financial markets on edge over a possible new move by the U.S. Treasury Department against tax-inversion deals  but the outlook for any such steps was still unclear on Friday.",
        "date": "11132015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Pfizer-Allergan deal refocuses market on U.S. tax-inversion rules "
    },
    {
        "content": "Nov 18 Pfizer Inc is in talks to acquire Allergan Plc for $370-$380 per share  according to a person familiar with the matter  valuing the potential deal at around $150 billion  the healthcare sector's biggest.",
        "date": "11192015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Pfizer discussing Allergan offer at $370-$380 per share-source "
    },
    {
        "content": "WASHINGTON  Nov 13 Pfizer Inc's buyout bid for Allergan Plc has financial markets on edge over a possible new move by the U.S. Treasury Department against tax-inversion deals  but the outlook for any such steps was still unclear on Friday.",
        "date": "11132015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Pfizer-Allergan deal refocuses market on US tax-inversion rules "
    },
    {
        "content": "Drugmaker Mylan NV's  $26 billion hostile bid for Perrigo Co Plc  failed on Friday  putting an end to the ongoing saga  which started more than seven months ago.",
        "date": "11132015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Mylan fails in $26 billion takeover bid for Perrigo "
    },
    {
        "content": "Nov 6 A Pfizer Inc merger with Ireland-based Allergan  in addition to providing tax benefits  would bolster the U.S. drugmaker's growth prospects should it decide to sell or spin off its portfolio of products that have gone off patent.",
        "date": "11062015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "RPT-Pfizer-Allergan deal would set up US company for a split "
    },
    {
        "content": "Nov 13 Drugmaker Mylan NV's $26 billion hostile bid for Perrigo Co Plc failed on Friday  putting an end to the ongoing saga  which started more than seven months ago.",
        "date": "11132015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "TIMELINE-Mylan fails in $26 bln takeover bid for Perrigo "
    },
    {
        "content": "A Pfizer Inc  merger with Ireland-based Allergan   in addition to providing tax benefits  would bolster the U.S. drugmaker's growth prospects should it decide to sell or spin off its portfolio of products that have gone off patent.",
        "date": "11062015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Pfizer-Allergan deal would set up U.S. company for a split "
    },
    {
        "content": "The proposed corporate tie-up between Pfizer Inc and Allergan Plc  both drug makers  is refocusing attention in Washington on tax-driven corporate inversion transactions.",
        "date": "11022015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Factbox: Pfizer-Allergan puts focus on U.S. tax inversion rules "
    },
    {
        "content": "* Says global botox sales rose 7.9 percent in third quarter; grew 13 percent excluding negative impact of stronger dollar",
        "date": "11042015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Allergan says global botox sales rose 7.9 percent in third quarter grew 13 percent excluding negative impact of stronger dollar "
    },
    {
        "content": "Nov 6 A Pfizer Inc merger with Ireland-based Allergan  in addition to providing tax benefits  would bolster the U.S. drugmaker's growth prospects should it decide to sell or spin off its portfolio of products that have gone off patent.",
        "date": "11062015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Pfizer-Allergan deal would set up US company for a split "
    },
    {
        "content": "NEW YORK/LONDON Investment banks Guggenheim Partners LLC and JPMorgan Chase & Co  have secured key roles in Pfizer Inc's  merger negotiations with Allergan Plc   according to people familiar with the matter  in what would be the biggest ever deal in the pharmaceutical sector.",
        "date": "11022015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Exclusive: Guggenheim  JPMorgan clinch key roles in Pfizer-Allergan talks "
    },
    {
        "content": "Botox-maker Allergan Plc  which is in talks to be bought by Pfizer Inc  reported a better-than-expected quarterly profit on strong sales of high-margin branded drugs  its biggest business.",
        "date": "11042015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Branded drugs help Botox-maker Allergan beat profit estimates "
    },
    {
        "content": "* Shares up 1.4 pct in premarket trading   (Adds forecast  background; updates shares)",
        "date": "11042015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 2-Branded drugs help Botox-maker Allergan beat profit estimates "
    },
    {
        "content": "WASHINGTON  Oct 29 Pfizer Inc faces political risks in Washington if it proceeds with a bid for Allergan  but with little chance of legislation to curb such tax inversion deals  the Obama administration may be able to throw up only limited obstacles.",
        "date": "10302015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "RPT-Pfizer-Allergan sparks fresh tax inversion angst on Capitol Hill "
    },
    {
        "content": "Nov 4 Botox maker Allergan Plc  created from the merger of Actavis and Allergan  reported quarterly revenue that nearly doubled due to higher sales of its branded drugs.",
        "date": "11042015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Botox-maker Allergan's revenue nearly doubles "
    },
    {
        "content": "Pfizer Inc  the No. 1 U.S. drugmaker  and Botox maker Allergan Plc said they were in friendly talks to create a pharmaceutical colossus but the prospect that the company would seek to avoid U.S. taxes sounded political alarm bells. | Video ",
        "date": "10302015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Pfizer  Allergan drug merger talks raise tax hackles in U.S. "
    },
    {
        "content": "* Says sells Constella/Linzess product rights for 64 million euros ($70.8 million) to Allergan",
        "date": "10272015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Almirall sells Constella/Linzess product rights to Allergan "
    },
    {
        "content": "Pfizer Inc  the No. 1 U.S. drugmaker  and Botox maker Allergan Plc said they were in friendly talks to create a pharmaceutical colossus but the prospect that the company would seek to avoid U.S. taxes sounded political alarm bells. | Video ",
        "date": "10292015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Pfizer  Allergan drug merger talks raise tax hackles in U.S. "
    },
    {
        "content": "* Says agreement allows Actavis to enter market in June 2018  or earlier under certain conditions",
        "date": "10272015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "BRIEF-Orexo settles Abstral U.S. patent litigation with Actavis "
    },
    {
        "content": "WASHINGTON  Oct 29 Pfizer Inc faces political risks in Washington if it proceeds with a bid for Allergan  but with little chance of legislation to curb such tax inversion deals  the Obama administration may be able to throw up only limited obstacles.",
        "date": "10292015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Pfizer-Allergan sparks fresh tax inversion angst on Capitol Hill "
    },
    {
        "content": "* Indexes down: Dow .13 pct  S&P .04 pct  Nasdaq .42 pct   (Updates close with Valeant down after the bell; LinkedIn up)",
        "date": "10292015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "US STOCKS-Wall St slips on tech results  chances of Fed hike "
    },
    {
        "content": "Oct 29 Pfizer Inc  the No. 1 U.S. drugmaker  and Botox maker Allergan Plc said they were in friendly talks to create a pharmaceutical colossus but the prospect that the company would seek to avoid U.S. taxes sounded political alarm bells.",
        "date": "10292015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 5-Pfizer  Allergan drug merger talks raise tax hackles in U.S. "
    },
    {
        "content": "Oct 29 Warner Chilcott US Sales LLC  now part of Botox maker Allergan Plc  agreed to plead guilty to felony healthcare fraud and pay $125 million to resolve U.S. charges that it paid kickbacks to doctors to induce them to prescribe several of its drugs.",
        "date": "10292015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 3-Allergan unit to plead guilty to healthcare fraud  pay $125 mln "
    },
    {
        "content": "* Indexes down: Dow .13 pct  S&P .04 pct  Nasdaq .42 pct   (Updates to close)",
        "date": "10292015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "US STOCKS-Wall St ticks down as investors digest Fed  earnings "
    },
    {
        "content": "Oct 29 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "10292015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Indexes down: Dow 0.2 pct  S&P 0.11 pct  Nasdaq 0.36 pct   (Updates to late afternoon)",
        "date": "10292015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "US STOCKS-Wall St slips with eye on Fed rate hike in Dec "
    },
    {
        "content": "Oct 29 Warner Chilcott US Sales LLC  now part of Allergan Plc  agreed to plead guilty to felony health care fraud and pay $125 million to resolve U.S. criminal and civil liability arising from its illegal marketing of several drugs  the Department of Justice said on Thursday.",
        "date": "10292015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan unit to plead guilty to health care fraud  pay $125 mln "
    },
    {
        "content": "Oct 21 Drugmaker Allergan Plc said on Wednesday that nearly all of its drugs are being distributed through traditional wholesale and retail channels.",
        "date": "10212015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan clarifies on drug distribution practices "
    },
    {
        "content": "A $600 million patent licensing dispute over the use of Botox to treat migraine headaches has been resolved in Allergan PLC's favor with a U.S. judge scolding Miotox LLC for making \"tedious and convoluted\" arguments to prove its case.",
        "date": "10062015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "U.S. judge clears up $600 mln patent headache for Allergan "
    },
    {
        "content": "Drugmaker Allergan Plc  said it expected revenue to be greater than $8 billion in the second half as it completes the sale of its generics business to Teva Pharmaceuticals Industries Ltd  .",
        "date": "09282015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan forecasts second-half revenue above $8 billion "
    },
    {
        "content": "Sept 28 Drugmaker Allergan Plc said it expected revenue to be greater than $8 billion in the second half as it completes the sale of its generics business to Teva Pharmaceuticals Industries Ltd .",
        "date": "09282015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Allergan forecasts 2nd-half revenue above $8 bln "
    },
    {
        "content": "Sept 28 Drugmaker Allergan Plc said it expected revenue to be greater than $8 billion in the second half to reflect the divesture of its global generics business to Teva Pharmaceuticals Industries Ltd .",
        "date": "09282015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan forecasts 2nd-half revenue above $8 bln "
    },
    {
        "content": "Sept 23 Amgen Inc and Allergan Plc  said their drug candidate for lung cancer was found as effective as Roche AG's Avastin in preventing disease progression and improving survival  in a late-stage study.",
        "date": "09232015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Amgen  Allergan say Avastin copycat succeeds in lung cancer study "
    },
    {
        "content": "Sept 17 Allergan Plc said on Thursday the U.S. Food and Drug Administration approved its new antipsychotic drug to treat bipolar disorder and schizophrenia.",
        "date": "09172015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan gets FDA nod for new antipsychotic "
    },
    {
        "content": "Sept 23 Amgen Inc and Allergan Plc  said a late-stage study showed their biosimilar candidate for a type of lung cancer was as effective as Roche AG's Avastin in preventing disease progression and improving survival.",
        "date": "09232015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Amgen  Allergan say Avastin copycat succeeds in lung cancer study "
    },
    {
        "content": "BOSTON  Aug 14 Top U.S. hedge funds added shares of Apple Inc in the second quarter  even as shares of the iPhone maker were flat during the period.",
        "date": "08142015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Hedge funds added Apple shares in second quarter  filings show "
    },
    {
        "content": "Aug 6 Allergan  which is selling its generics business to focus on branded drugs and aesthetics products  aims to acquire or license products that have already shown promise in studies  and leave the riskier discovery process to small biotechs and academic researchers.",
        "date": "08062015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan CEO says better to leave discoveries to others "
    },
    {
        "content": "Aug 6 Allergan Plc said on Thursday it received a subpoena from the U.S. Department of Justice seeking information on marketing and pricing of its generic drugs.",
        "date": "08062015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan gets DoJ subpoena over generic drug pricing "
    },
    {
        "content": "NEW YORK  Aug 4 Acorn Inc's Hi-Tech Pharmacal Co  Inc infringed three Allergan Inc patents on its Lumigan topical glaucoma treatment  a U.S. appeals court ruled on Tuesday.",
        "date": "08042015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Akorn Inc's Hi-Tech Pharmacal infringes Allergan glaucoma drug patents "
    },
    {
        "content": "Irish drugmaker Allergan Plc  reported better-than-expected revenue for the first full quarter since the merger of Actavis and Allergan.",
        "date": "08062015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan reports better-than-expected revenue "
    },
    {
        "content": "* Quarterly earnings beat estimates   (Adds details  background)",
        "date": "08062015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 2-Allergan reports better-than-expected revenue "
    },
    {
        "content": "Aug 6 Botox-maker Allergan Plc's  quarterly revenue more than doubled  helped by higher sales of its branded drugs in North America.",
        "date": "08062015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Drugmaker Allergan's revenue more than doubles "
    },
    {
        "content": "NEW YORK  Aug 4 An Akorn Inc unit's proposed generic glaucoma drug infringed three Allergan Inc  patents on its Lumigan topical treatment for the eye disease  a U.S. appeals court ruled on Tuesday.",
        "date": "08042015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Akorn Inc's Hi-Tech Pharmacal infringes Allergan glaucoma drug patents "
    },
    {
        "content": "JERUSALEM  July 30 Teva Pharmaceutical Industries  which this week revealed plans to buy Allergan's generics drugs business in a $40.5 billion deal  said on Thursday sales of its branded multiple sclerosis drug Copaxone rose 12 percent in the second quarter even though it faces new competition.",
        "date": "07302015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva's MS drug Copaxone has strong second-quarter sales "
    },
    {
        "content": "TEL AVIV  July 26 After months of sparring in a hostile takeover bid for rival Mylan NV  Teva Pharmaceutical's move to buy Allergan Plc's  generic drug business instead could be a smoother ride that will bring bigger returns  faster.",
        "date": "07262015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan bid may be healthier for Teva than battle with Mylan "
    },
    {
        "content": "Israeli drug maker Teva Pharmaceutical Industries Ltd   is in talks to combine with Allergan Plc's  big generic-drug business  the Wall Street Journal reported on Saturday  citing people familiar with the matter.",
        "date": "07252015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Teva in talks to buy Allergan big generic-drug unit: WSJ "
    },
    {
        "content": "TEL AVIV Israel's Teva Pharmaceutical Industries will pay $40.5 billion in cash and stock for Allergan's generic drugs business  solidifying Teva's position as the world's No. 1 maker of generics while freeing Allergan to focus on branded drugs  paying down debt and potential \"transformational\" acquisitions.",
        "date": "07272015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Teva to buy Allergan generic business for $40.5 bln  drops Mylan bid "
    },
    {
        "content": "Botox-maker Allergan Plc  is exploring a breakup of the company into two businesses  eight months after forming a multi-billion dollar pharmaceutical company through a merger with Actavis Plc  Bloomberg reported on Friday  citing sources.",
        "date": "07242015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Allergan said to be exploring split into two businesses: Bloomberg "
    },
    {
        "content": "Teva Pharmaceutical Industries Ltd  is in advanced talks to buy Allergan Plc's  generic drug business following a thus far unsuccessful effort to acquire peer Mylan NV   according to a person familiar with the matter.",
        "date": "07262015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva nears deal for Allergan's generic drugs unit: source "
    },
    {
        "content": "July 25 Teva Pharmaceutical Industries Ltd  is in advanced talks to buy Allergan Plc's  generic drug business following a thus far unsuccessful effort to acquire peer Mylan NV  according to a person familiar with the matter.",
        "date": "07262015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Teva nears deal for Allergan's generic drugs unit -source "
    },
    {
        "content": "Allergan Plc  is considering a breakup of the company into two businesses  a person familiar with the matter told Reuters on Friday  potentially adding the botox-maker to a list of large drugmakers realigning themselves to focus on specific areas of their businesses.",
        "date": "07252015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan said to be exploring split into two businesses: source "
    },
    {
        "content": "July 24 Allergan Plc is considering a breakup of the company into two businesses  a person familiar with the matter told Reuters on Friday  potentially adding the botox-maker to a list of large drugmakers realigning themselves to focus on specific areas of their businesses.",
        "date": "07252015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 2-Allergan said to be exploring split into two businesses -source "
    },
    {
        "content": "TEL AVIV Israel’s Teva Pharmaceutical Industries will pay $40.5 billion in cash and stock for Allergan’s generic drugs business  solidifying Teva's position as the world's No. 1 maker of generics while freeing Allergan to focus on branded drugs  paying down debt and potential \"transformational\" acquisitions. | Video ",
        "date": "07272015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Teva to buy Allergan generic business for $40.5 billion  drops Mylan bid "
    },
    {
        "content": "July 24 Botox-maker Allergan Plc is exploring a breakup of the company into two businesses  eight months after forming a multi-billion dollar pharmaceutical company through a merger with Actavis Plc  Bloomberg reported on Friday  citing sources.",
        "date": "07242015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan said to be exploring split into two businesses -Bloomberg "
    },
    {
        "content": "NEW YORK Allergan plc CEO Brent Saunders is ready to put the $36 billion his company will net from the sale of its generics business to Teva Pharmaceutical Industries Ltd to work  possibly with another large  \"transformational\" merger.",
        "date": "07272015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan CEO  fresh off one deal  sets sights on others "
    },
    {
        "content": "* Combined entity to have proforma revenue of $26 bln in 2016",
        "date": "07272015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 6-Teva to buy Allergan generic business for $40.5 bln  drops Mylan bid "
    },
    {
        "content": "NEW YORK  July 27 Allergan plc CEO Brent Saunders is ready to put the $36 billion his company will net from the sale of its generics business to Teva Pharmaceutical Industries Ltd to work  possibly with another large  \"transformational\" merger.",
        "date": "07272015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Allergan CEO  fresh off one deal  sets sights on others "
    },
    {
        "content": "* Oil prices  commodities lower following China equity selloff",
        "date": "07272015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "US STOCKS-Wall St drops as China stock slump stokes growth fears "
    },
    {
        "content": "July 27 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "07272015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Oil prices  commodities lower following China equity selloff",
        "date": "07272015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "US STOCKS-Wall St sinks as tumbling China stocks stoke growth fears "
    },
    {
        "content": "* Payment follows IND filing with the FDA for a molecule derived from the collaboration between the two companies",
        "date": "07212015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-Diaxonhit receives $0.5 million payment from Allergan "
    },
    {
        "content": "* Indexes down: Dow 0.73 pct  S&P 0.5 pct  Nasdaq 0.89 pct   (Updates to afternoon trading)",
        "date": "07272015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "US STOCKS-Wall St sinks as tumbling China equities stoke growth worry "
    },
    {
        "content": "* Shares rise 50 pct to record high   (Adds analyst  fund manager and executive comments; updates shares)",
        "date": "07132015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 2-Anacor skin cream succeeds in studies  fuels takeover expectations "
    },
    {
        "content": "LONDON Eli Lilly has won a patent case in the Court of Appeal in London over its blockbuster Alimta lung cancer drug  boosting prospects for future sales and dealing a blow to generic challenger Actavis  now renamed Allergan.",
        "date": "06252015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Eli Lilly wins UK Alimta drug patent case on appeal  shares jump "
    },
    {
        "content": "June 17 Botox-maker Allergan Inc said it would buy Kythera Biopharmaceuticals Inc in a cash-and-stock deal valued at about $2.1 billion  to expand its line of cosmetic treatments.",
        "date": "06172015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Allergan to buy Kythera Biopharmaceuticals for $2.1 billion "
    },
    {
        "content": "June 17 Botox-maker Allergan Plc said it would buy Kythera Biopharmaceuticals Inc in a cash-and-stock deal valued at about $2.1 billion  to expand its line of cosmetic treatments.",
        "date": "06172015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 1-Allergan to buy Kythera Biopharmaceuticals for $2.1 billion "
    },
    {
        "content": "Drugmaker Actavis Plc  expects its full-year revenue to rise at least 57 percent  helped by double-digit growth from the Allergan business it bought in March.",
        "date": "05112015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Actavis expects Allergan business to drive 2015 growth "
    },
    {
        "content": "* Expects 2015 rev of $20.5-$21 bln; adj rev of $22-$22.5 bln",
        "date": "05112015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 2-Actavis expects Allergan business to drive 2015 growth "
    },
    {
        "content": "March 16   * S&P Dow jones indices says American Airlines Group Inc  to replace",
        "date": "03162015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "BRIEF-American Airlines to join S&P 500 "
    },
    {
        "content": "NEW YORK  March 17 Actavis Plc said on Tuesday that Allergan Inc's top executive David Pyott will not join the combined company's board of directors after all.",
        "date": "03172015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "Actavis says Allergan's Pyott won't join new company's board "
    },
    {
        "content": "BRUSSELS  March 17 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03172015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "EU mergers and takeovers (March 17) "
    },
    {
        "content": "BOSTON Billionaire investor William Ackman has purchased a five percent stake in Valeant Pharmaceuticals    his hedge fund said on Monday  making him the Canadian drug company's fifth-largest stakeholder.",
        "date": "03092015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Exclusive: Ackman's Pershing Square makes $3.3 billion bet on Valeant "
    },
    {
        "content": "BRUSSELS  March 5 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03052015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "EU mergers and takeovers (March 5) "
    },
    {
        "content": "Thomson Reuters March 05  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  now click on Related Co Data  now click on Co Events.                ",
        "date": "03052015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "NEW YORK Actavis Plc   a generic drugmaker that has been steadily acquiring branded medicines  said it will change its name to Allergan Inc after it completes its planned $66 billion purchase of the Botox maker  signaling its growing focus on patent-protected drugs.",
        "date": "02182015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Actavis to take Allergan name  reflecting brand-drug focus "
    },
    {
        "content": "NEW YORK  Feb 18 Actavis Plc  a generic drugmaker that has been steadily acquiring branded medicines  said it will change its name to Allergan Inc after it completes its planned $66 billion purchase of the Botox maker  signaling its growing focus on patent-protected drugs.",
        "date": "02182015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "UPDATE 3-Actavis to take Allergan name  reflecting brand-drug focus "
    },
    {
        "content": "BRUSSELS  Feb 10 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02102015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "EU mergers and takeovers (Feb 10) "
    },
    {
        "content": "NEW YORK  Feb 3 For two decades  Allergan Inc  president Doug Ingram labored to transform the Botox-maker from a sleepy eye care upstart to a global aesthetics giant. He was just a few months away from getting the top job when a merger deal with Actavis Plc in November thwarted his ambitions.",
        "date": "02032015",
        "name": "Allergan plc",
        "news_type": "normal",
        "symbol": "AGN",
        "title": "How the Actavis deal upended Allergan No. 2's CEO ambitions "
    },
    {
        "content": "SAN FRANCISCO Allergan Inc  Chief Executive David Pyott is close to joining the board of directors of Actavis Plc   which reached a deal to buy the Botox-maker for $66 billion in November  three people familiar with the matter said on Thursday.",
        "date": "01152015",
        "name": "Allergan plc",
        "news_type": "topStory",
        "symbol": "AGN",
        "title": "Actavis aims to add Allergan CEO to its board: sources "
    }
]