[
    {
        "content": "* James Michener to become senior advisor to Assured Guaranty CEO Source text for Eikon: Further company coverage:",
        "date": "11022017",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "BRIEF-James Michener to become senior advisor to Assured Guaranty CEO "
    },
    {
        "content": "* Assured Guaranty Ltd reports results for third quarter 2017",
        "date": "11022017",
        "name": "Assured Guaranty Ltd",
        "news_type": "normal",
        "symbol": "AGO",
        "title": "BRIEF-Assured Guaranty Ltd reports Q3 earnings per share $1.72 "
    },
    {
        "content": "* ‍Assured Guaranty withdraws complaint against PREPA​ Source text for Eikon: Further company coverage:",
        "date": "10132017",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "BRIEF-‍Assured Guaranty withdraws complaint against PREPA​ "
    },
    {
        "content": "Oct 13 Bond insurer Assured Guaranty Ltd said on Friday it voluntarily withdrew its lawsuit against Puerto Rico Electric Power Authority (PREPA) over the failure to apply pledged revenue to the payment of bonds because of the utility's need to focus on restoring the power grid damaged by Hurricane Maria.",
        "date": "10142017",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "Assured Guaranty withdraws PREPA lawsuit in Hurricane Maria aftermath "
    },
    {
        "content": "NEW YORK  Oct 7 Puerto Rico bond insurer Assured Guaranty Ltd said late on Friday it voluntarily withdrew a complaint that challenged the legality of the island's fiscal turnaround plan  citing the devastating impact of Hurricane Maria.",
        "date": "10072017",
        "name": "Assured Guaranty Ltd",
        "news_type": "normal",
        "symbol": "AGO",
        "title": "Assured Guaranty pulls Puerto Rico lawsuit  cites hurricane "
    },
    {
        "content": "NEW YORK  Oct 4 Puerto Rico's benchmark general obligation bonds fell on Wednesday  hitting a record low  after U.S. President Donald Trump suggested late on Tuesday that the island's massive debt load will have to be wiped out because of devastation caused by Hurricane Maria.",
        "date": "10042017",
        "name": "Assured Guaranty Ltd",
        "news_type": "normal",
        "symbol": "AGO",
        "title": "UPDATE 4-Puerto Rico benchmark bond drops to record low after Trump remark "
    },
    {
        "content": "NEW YORK The mayor of Hartford on Monday told bond investors that Connecticut's cash-strapped capital city has no room left to tax or cut its way out of its fiscal crisis  a bond holder said.",
        "date": "09252017",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "Hartford mayor tells bondholders of dire fiscal status "
    },
    {
        "content": "NEW YORK  Sept 25 The mayor of Hartford on Monday told bond investors that Connecticut's cash-strapped capital city has no room left to tax or cut its way out of its fiscal crisis  a bond holder said.",
        "date": "09252017",
        "name": "Assured Guaranty Ltd",
        "news_type": "normal",
        "symbol": "AGO",
        "title": "UPDATE 3-Hartford mayor tells bondholders of dire fiscal status "
    },
    {
        "content": "Sept 25 Securities insurer Assured Guaranty Ltd said on Monday it is willing to issue Hartford  the capital of Connecticut  a general obligation bond that could help the city avoid filing for bankruptcy.",
        "date": "09252017",
        "name": "Assured Guaranty Ltd",
        "news_type": "normal",
        "symbol": "AGO",
        "title": "Assured Guaranty says ready to help Hartford city avoid bankruptcy "
    },
    {
        "content": "* Assured Guaranty releases statement regarding Hartford  Connecticut",
        "date": "09252017",
        "name": "Assured Guaranty Ltd",
        "news_type": "normal",
        "symbol": "AGO",
        "title": "BRIEF-Assured Guaranty says discussed ways with Hartford to help ease city's financial issues "
    },
    {
        "content": "* Assured Guaranty Ltd - ‍files adversary complaint \"challenging\" PREPA's failure to remit special revenue bond collateral for payment of its bonds​",
        "date": "08082017",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "BRIEF-Assured Guaranty ‍files adversary complaint in federal district court in Puerto Rico "
    },
    {
        "content": "* Assured Guaranty Ltd. Reports results for second quarter 2017",
        "date": "08022017",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "BRIEF-Assured Guaranty Q2 earnings per share $1.24 "
    },
    {
        "content": "* Assured guaranty files motion to lift automatic stay and commence an action against prepa for the appointment of a receiver",
        "date": "07182017",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "BRIEF-Assured Guaranty files motion to lift automatic stay  commence action against PREPA for appointment of receiver "
    },
    {
        "content": "* Assured Guaranty takes step toward combining European subsidiaries",
        "date": "06262017",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "BRIEF-Assured Guaranty takes step toward combining European subsidiaries "
    },
    {
        "content": "* Assured Guaranty Ltd. reports results for first quarter 2017",
        "date": "05042017",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "BRIEF-Assured Guaranty Q1 earnings per share $2.49 "
    },
    {
        "content": "May 4 A pair of bond insurers with about $9 billion at stake in Puerto Rico's debt crisis on Thursday sued the U.S. territory and its financial oversight board  objecting to a fiscal turnaround plan approved by the board in March.",
        "date": "05042017",
        "name": "Assured Guaranty Ltd",
        "news_type": "normal",
        "symbol": "AGO",
        "title": "Assured  MBIA sue Puerto Rico board over island fiscal plan "
    },
    {
        "content": "* Assured Guaranty comments on modification of PREPA restructuring support agreement",
        "date": "04062017",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "BRIEF-Assured Guaranty comments on modification of PREPA restructuring support agreement "
    },
    {
        "content": "* CEO Dominic Frederico's 2016 total compensation was $12.7 million versus $12.2 million in 2015 - SEC filing  Source text - http://bit.ly/2msYiv0 Further company coverage:",
        "date": "03222017",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "BRIEF-Assured Guaranty CEO Dominic Frederico's 2016 total compensation was $12.7 mln "
    },
    {
        "content": "NEW YORK  March 21 Puerto Rico Electric Power Authority  the island's ailing power  utility  on Tuesday reopened a long-agreed debt restructuring deal that drew ire from bondholders and put the stock of credit insurers under further selling pressure.",
        "date": "03212017",
        "name": "Assured Guaranty Ltd",
        "news_type": "normal",
        "symbol": "AGO",
        "title": "Puerto Rico offers new PREPA debt restructuring  bond insurers suffer "
    },
    {
        "content": "* Assured Guaranty Ltd reports results for fourth quarter 2016 and full year 2016",
        "date": "02232017",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "BRIEF-Assured Guaranty reports qtrly earnings per share $1.49 "
    },
    {
        "content": "* New york insurance regulator approves assured guaranty municipal corp. Plan to repurchase shares valued at $300 million from assured guaranty municipal holdings inc.",
        "date": "11282016",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "BRIEF-New york Insurance regulator approves Assured Guaranty's plan to repurchase shares valued at $300 mln "
    },
    {
        "content": "* Sets quarterly dividend of $0.13 per share  Source text for Eikon:  Further company coverage:",
        "date": "11022016",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "BRIEF-Assured Guaranty sets quarterly dividend of $0.13 per share "
    },
    {
        "content": "* AGC will deliver to MBIA all of notes issued in Zohar II 2005-1 transaction that AGC holds",
        "date": "09292016",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "BRIEF-Assured Guaranty to acquire MBIA UK Insurance Limited "
    },
    {
        "content": "* Q2 earnings per share view $0.54 -- Thomson Reuters I/B/E/S",
        "date": "08032016",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "BRIEF-Assured Guaranty Q2 operating earnings per share $1.03 "
    },
    {
        "content": "* Assured guaranty files motion to lift stay and challenge commonwealth's executive orders diverting prhta pledged toll revenues not subject to clawback",
        "date": "07222016",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "BRIEF-Assured Guaranty files motion to lift stay and challenge the Commonwealth's Executive Orders Diverting PRHTA Pledged Toll Revenues "
    },
    {
        "content": "* Assured guaranty ltd. Reports results for first quarter 2016",
        "date": "05042016",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "BRIEF-Assured Guaranty reports Q1 earnings per share $0.43 "
    },
    {
        "content": "* Sets quarterly dividend of $0.13per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05042016",
        "name": "Assured Guaranty Ltd",
        "news_type": "normal",
        "symbol": "AGO",
        "title": "BRIEF-Assured Guaranty sets quarterly dividend of $0.13 per share "
    },
    {
        "content": "* As part of transaction  cifg na will merge into agc  which will be surviving entity",
        "date": "04132016",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "BRIEF-Assured Guaranty expects to pay $450 mln in cash to acquire CIFG "
    },
    {
        "content": "* Bond insurers: Puerto Rico's clawbacks violated U.S. constitution",
        "date": "01082016",
        "name": "Assured Guaranty Ltd",
        "news_type": "topStory",
        "symbol": "AGO",
        "title": "UPDATE 3-Bond insurers sue Puerto Rico over debt default  clawbacks "
    },
    {
        "content": "Puerto Rico's debt-laden power utility  PREPA  has a tentative agreement with its bond insurers on a restructuring of its debt  according to two sources familiar with negotiations  but the deal is not official and still needs approval by PREPA's board.",
        "date": "12182015",
        "name": "Assured Guaranty Ltd",
        "news_type": "normal",
        "symbol": "AGO",
        "title": "Puerto Rico utility in tentative agreement to restructure debt -sources "
    },
    {
        "content": "SAN JUAN/NEW YORK  Dec 18 Puerto Rico's debt-laden power utility  PREPA  has a tentative agreement with its bond insurers on a restructuring of its debt  according to two sources familiar with negotiations  but the deal is not official and still needs approval by PREPA's board.",
        "date": "12182015",
        "name": "Assured Guaranty Ltd",
        "news_type": "normal",
        "symbol": "AGO",
        "title": "UPDATE 2-Puerto Rico utility in tentative agreement to restructure debt -sources "
    }
]