[
    {
        "content": "* Avangrid Inc - ‍pricing of $600 million in aggregate principal amount of its 3.150 pct notes due December 1  2024​ Source text for Eikon: Further company coverage:",
        "date": "11162017",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "BRIEF-Avangrid announces pricing of notes "
    },
    {
        "content": "* Avangrid Inc files for potential mixed shelf offering  size not disclosed - SEC filing‍​ Source text: (http://bit.ly/2jnue3l) Further company coverage:",
        "date": "11132017",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "BRIEF-Avangrid Inc files for potential mixed shelf offering "
    },
    {
        "content": "* Reaffirms FY 2017 adjusted earnings per share view $2.10 to $2.35",
        "date": "10242017",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "BRIEF-Avangrid Q3 earnings per share $0.32 "
    },
    {
        "content": "Oct 5 TransCanada Corp said on Thursday it would abandon its Energy East and Eastern Mainline pipeline projects  following tough review by Canada's energy regulator.",
        "date": "10052017",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "TransCanada to abandon Energy East and Eastern Mainline projects "
    },
    {
        "content": "* TransCanada announces termination of Energy East pipeline and Eastern Mainline projects",
        "date": "10052017",
        "name": "Avangrid Inc",
        "news_type": "normal",
        "symbol": "AGR",
        "title": "BRIEF-TransCanada announces termination of Energy East pipeline and Eastern Mainline projects "
    },
    {
        "content": "CALGARY  Alberta TransCanada Corp  seeks to suspend the application for its Energy East pipeline for 30 days and may abandon the project  the company said on Thursday  weeks after Canada's National Energy Board (NEB) announced a tougher review process.",
        "date": "09082017",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "TransCanada may abandon Energy East pipe facing tougher review "
    },
    {
        "content": "CALGARY  Alberta  Sept 7 TransCanada Corp seeks to suspend the application for its Energy East pipeline for 30 days and may abandon the project  the company said on Thursday  weeks after Canada's National Energy Board (NEB) announced a tougher review process.",
        "date": "09082017",
        "name": "Avangrid Inc",
        "news_type": "normal",
        "symbol": "AGR",
        "title": "UPDATE 3-TransCanada may abandon Energy East pipe facing tougher review "
    },
    {
        "content": "CALGARY  Alberta  Sept 7 TransCanada Corp will suspend the application for its Energy East pipeline project for 30 days  the company said on Thursday  weeks after Canada's National Energy Board (NEB) regulator announced a tougher review process.",
        "date": "09072017",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "TransCanada pauses Energy East pipe in face of tougher review "
    },
    {
        "content": "* Transcanada seeks 30-day suspension of Energy East Pipeline and Eastern Mainline Project applications",
        "date": "09072017",
        "name": "Avangrid Inc",
        "news_type": "normal",
        "symbol": "AGR",
        "title": "BRIEF-Transcanada seeks 30-day suspension of Energy East Pipeline and Eastern Mainline Project applications "
    },
    {
        "content": "CALGARY  Alberta  Aug 23 The upcoming review of TransCanada Corp's proposed Energy East pipeline will consider its potential indirect contributions to greenhouse gas emissions  Canada's National Energy Board (NEB) regulator said on Wednesday.",
        "date": "08232017",
        "name": "Avangrid Inc",
        "news_type": "normal",
        "symbol": "AGR",
        "title": "Canada to consider indirect emissions for TransCanada Energy East pipe "
    },
    {
        "content": "CALGARY  Alberta  Aug 23 The review of TransCanada Corp's proposed Energy East pipeline will consider its indirect greenhouse gas contributions  Canada's National Energy Board (NEB) regulator said on Wednesday  expanding the scope of the assessment.",
        "date": "08232017",
        "name": "Avangrid Inc",
        "news_type": "normal",
        "symbol": "AGR",
        "title": "UPDATE 1-Canada to consider indirect emissions for TransCanada Energy East pipe "
    },
    {
        "content": "* Avangrid reports second quarter 2017 earnings results and affirms 2017 earnings outlook",
        "date": "07192017",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "BRIEF-Avangrid reports Q2 results and affirms 2017 earnings outlook "
    },
    {
        "content": "* AVANGRID SHAREHOLDERS OVERWHELMINGLY APPROVE ALL BOARD PROPOSALS AT 2017 ANNUAL MEETING",
        "date": "06222017",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "BRIEF-AVANGRID SHAREHOLDERS APPROVE ALL BOARD PROPOSALS AT 2017 ANNUAL MEETING "
    },
    {
        "content": "* Says Executive Vice President Rich Cavallaro  who currently oversees U.S. operations  has chosen to move into his former role as business unit president for Skanska USA Civil",
        "date": "05242017",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "BRIEF-Changes in Skanska senior executive team "
    },
    {
        "content": "* Avangrid acquires major stake in Massachusetts off-shore wind project with Vineyard Wind",
        "date": "05092017",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "BRIEF-Avangrid acquires major stake in Massachusetts off-shore wind project with Vineyard Wind "
    },
    {
        "content": "* NAMED LAURA BEANE AS INCOMING CEO FOR AVANGRID RENEWABLES Source text for Eikon: Further company coverage:",
        "date": "04252017",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "BRIEF-AVANGRID NAMES LAURA BEANE AS INCOMING CEO FOR AVANGRID RENEWABLES "
    },
    {
        "content": "* Avangrid reports first quarter 2017 earnings results and affirms 2017 earnings outlook",
        "date": "04252017",
        "name": "Avangrid Inc",
        "news_type": "normal",
        "symbol": "AGR",
        "title": "BRIEF-Avangrid Q1 earnings per share $0.77 "
    },
    {
        "content": "OTTAWA  Jan 27 Canada's energy regulator on Friday scrapped a partially completed hearing into TransCanada Corp's proposed Energy East pipeline and said the process would start again from the beginning.",
        "date": "01272017",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "Review of Canada Energy East pipeline to restart from beginning "
    },
    {
        "content": "CALGARY  Alberta  Jan 10 A Canadian environmental group on Tuesday filed a legal challenge against the regulatory review of TransCanada Corp's Energy East pipeline  seeking to restart what it calls a process tainted by bias.",
        "date": "01102017",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "UPDATE 1-Review process for Energy East pipeline faces legal challenge "
    },
    {
        "content": "CHARLOTTETOWN  Prince Edward Island For years  heavy equipment operator Ashley Underhill has tried to defy the notion that one could only make a good living in Canada's poorer east coast by spending most of the time away from the family in the nation's western oil patch.",
        "date": "12152016",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "Energy East pipeline woes cast pall over Canada's Atlantic coast "
    },
    {
        "content": "OTTAWA  Sept 9 Canada's energy regulator said on Friday that a panel assessing TransCanada Corp's  proposed Energy East pipeline was quitting  a decision that will drag out an already-lengthy appraisal process.",
        "date": "09092016",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "UPDATE 4-Canada regulator says TransCanada pipeline panel to step down "
    },
    {
        "content": "Sept 9 Transcanada Corp says it accepts decision of Energy East panel to step down  company looks forward to hearings resuming",
        "date": "09092016",
        "name": "Avangrid Inc",
        "news_type": "normal",
        "symbol": "AGR",
        "title": "BRIEF-Transcanada says it accepts decision of Energy East panel to step down "
    },
    {
        "content": "Sept 9 Canada's energy regulator says all three members of panel assessing Transcanada Corp's Energy East oil pipeline have stepped down",
        "date": "09092016",
        "name": "Avangrid Inc",
        "news_type": "normal",
        "symbol": "AGR",
        "title": "BRIEF-All three members of panel assessing TransCanada Corp's Energy East oil pipeline have stepped down "
    },
    {
        "content": "CALGARY/OTTAWA Canada's National Energy Board on Tuesday suspended Montreal hearings on TransCanada Corp's  proposed Energy East pipeline after protests disrupted the first day of the process on Monday.",
        "date": "08302016",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "Canada regulator suspends TransCanada pipeline approval hearing "
    },
    {
        "content": "CALGARY/OTTAWA  Aug 30 Canada's National Energy Board on Tuesday suspended Montreal hearings on TransCanada Corp's proposed Energy East pipeline after protests disrupted the first day of the process on Monday.",
        "date": "08302016",
        "name": "Avangrid Inc",
        "news_type": "normal",
        "symbol": "AGR",
        "title": "UPDATE 2-Canada regulator suspends TransCanada pipeline approval hearing "
    },
    {
        "content": "Aug 30 Canada's energy minister says National Energy Board will have to deal with situation of postponed Energy East hearings",
        "date": "08302016",
        "name": "Avangrid Inc",
        "news_type": "normal",
        "symbol": "AGR",
        "title": "BRIEF-Canada energy minister says NEB wll have to deal with postponed Energy East hearings "
    },
    {
        "content": "* On July 14  2016  board increased number of directors that constitute board from twelve to fourteen directors",
        "date": "07192016",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "BRIEF-Avangrid board increased number of board directors from twelve to fourteen "
    },
    {
        "content": "* Avangrid reports second quarter 2016 earnings results and affirms consolidated 2016 earnings outlook",
        "date": "07192016",
        "name": "Avangrid Inc",
        "news_type": "normal",
        "symbol": "AGR",
        "title": "BRIEF-Avangrid Q2 eps $0.25 "
    },
    {
        "content": "VANCOUVER  June 16 Canada's energy regulator on Thursday officially launched its 21-month review of TransCanada Corp's Energy East pipeline  which would carry crude from Alberta's oil sands to refineries and export terminals in Eastern Canada.",
        "date": "06162016",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "UPDATE 2-Canada's energy regulator starts review of oil pipeline to east "
    },
    {
        "content": "* Avangrid reports first quarter 2016 earnings results and increases outlook",
        "date": "04262016",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "BRIEF-Avangrid Q1 earnings per share $0.53 "
    },
    {
        "content": "CALGARY  Alberta  April 22 TransCanada Corp  agreed to submit to a Quebec environmental review of its Energy East pipeline on Friday  avoiding a potential legal battle with the province by putting the controversial project through an extra round of scrutiny.",
        "date": "04222016",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "UPDATE 2-TransCanada agrees to Quebec environmental review for pipeline "
    },
    {
        "content": "* Toyota Motor Sales  Usa  Inc. says is recalling approximately 230 model year 2016 Sienna Minivans  Source text (http://toyota.us/1SQ3eRx) Further company coverage:",
        "date": "04062016",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "BRIEF-Toyota recalls certain 2016 model year Sienna Minivans "
    },
    {
        "content": "MONTREAL  March 1 Quebec on Tuesday filed a motion for an injunction to ensure TransCanada Corp's  proposed Energy East oil pipeline complies with the Canadian province's environmental laws  another potential setback for the project.",
        "date": "03012016",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "UPDATE 4-Quebec seeks injunction to force Energy East pipeline review "
    },
    {
        "content": "* Alberta premier Notley: will not come out with guns blazing over Quebec's Energy East injunction",
        "date": "03012016",
        "name": "Avangrid Inc",
        "news_type": "normal",
        "symbol": "AGR",
        "title": "BRIEF-Alberta's Notley: won't come out with guns blazing over Energy East injunction "
    },
    {
        "content": "MONTREAL  March 1 The Canadian province of Quebec said on Tuesday it would seek an injunction against TransCanada Corp's proposed Energy East pipeline  saying the Quebec portion of the project had to be evaluated under provincial law.",
        "date": "03012016",
        "name": "Avangrid Inc",
        "news_type": "normal",
        "symbol": "AGR",
        "title": "Quebec gov't files injunction against Energy East pipeline "
    },
    {
        "content": "* Says still targeting 2020 for Energy East pipeline but extension of National Energy Board regulatory process may translate into delay  Source text for Eikon:  Further company coverage:    (Reporting By Nia Williams)",
        "date": "02112016",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "BRIEF-TransCanada says regulatory process may delay Energy East pipeline "
    },
    {
        "content": "OTTAWA  Jan 29 TransCanada Corp must \"do its homework\" and meet a number of conditions to stand any chance of being allowed to build its proposed Energy East pipeline in the province of Quebec  a senior official said on Friday.",
        "date": "01292016",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "TransCanada must do homework to get Energy East permit: Quebec "
    },
    {
        "content": "OTTAWA  Jan 27 Canada announced new interim rules on Wednesday for environmental reviews that will impose delays on two projects - TransCanada Corp's Energy East pipeline and Kinder Morgan Inc's expansion of its Trans Mountain Pipeline.",
        "date": "01272016",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "UPDATE 3-Canada imposes further delays on two major pipeline projects "
    },
    {
        "content": "OTTAWA  Jan 21 The influential mayor of Montreal and other local municipal leaders will on Thursday announce their formal opposition to TransCanada Corp's proposed Energy East pipeline  the Canadian Broadcasting Corp said.",
        "date": "01212016",
        "name": "Avangrid Inc",
        "news_type": "topStory",
        "symbol": "AGR",
        "title": "Montreal area mayors to oppose Energy East pipeline: CBC "
    }
]