[
    {
        "content": "WINNIPEG  Manitoba Nutrien  the company to be formed from the merger of Agrium Inc  and Potash Corp of Saskatchewan   plans to expand its U.S. farm supply network and return cash to shareholders  Agrium Chief Executive Chuck Magro said on Wednesday  as it leverages unusually flush coffers during an agriculture slump.",
        "date": "11082017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "Merged fertilizer firm Nutrien eyes U.S. farm suppliers as cash pile builds "
    },
    {
        "content": "WINNIPEG  Manitoba  Nov 8 Nutrien  the company to be formed from the merger of Agrium Inc and Potash Corp of Saskatchewan  plans to expand its U.S. farm supply network and return cash to shareholders  Agrium Chief Executive Chuck Magro said on Wednesday  as it leverages unusually flush coffers during an agriculture slump.",
        "date": "11082017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "UPDATE 2-Merged fertilizer firm Nutrien eyes U.S. farm suppliers as cash pile builds "
    },
    {
        "content": "WINNIPEG  Manitoba  Nov 8 Nutrien  the company to be formed by year-end from the merger of Agrium Inc and Potash Corp of Saskatchewan  plans to expand its farm supply network  and return some cash to shareholders  Agrium Chief Executive Chuck Magro said on Wednesday. Magro will become Nutrien's CEO.",
        "date": "11082017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Farm supply growth  returning cash are priorities for Nutrien: Agrium CEO "
    },
    {
        "content": "Canadian fertilizer maker Agrium Inc    the world's biggest farm retailer  reported a bigger-than-expected quarterly loss as demand for its products was reduced by severe dry weather in Australia and Canada.",
        "date": "11082017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Canada's Agrium posts bigger-than-expected third-quarter loss "
    },
    {
        "content": "* Sees FY 2017 earnings per share $4.65 to $4.80 from continuing operations",
        "date": "11072017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium Q3 adj. loss per share $0.23 "
    },
    {
        "content": "Nov 7 Canadian fertilizer maker Agrium Inc   the world's biggest farm retailer  reported a bigger-than-expected quarterly loss as demand for its products was reduced by severe dry weather in Australia and Canada.",
        "date": "11082017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "UPDATE 1-Canada's Agrium posts bigger-than-expected 3rd-qtr loss "
    },
    {
        "content": "Nov 7 Canadian fertilizer maker Agrium Inc   the world's biggest farm retailer  reported widening quarterly losses on Tuesday on lower overall sales volumes and higher cost of product.",
        "date": "11082017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "CORRECTED-Canada's Agrium posts wider loss in Q3 "
    },
    {
        "content": "* Agrium and PotashCorp announce receipt of regulatory approval in China",
        "date": "11072017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Agrium and PotashCorp receive regulatory approval in China "
    },
    {
        "content": "WINNIPEG  Manitoba  Nov 7 Canadian fertilizer producer and farm supplier Agrium Inc said on Tuesday it will sell its Idaho phosphate production facility for $100 million to fertilizer company Itafos  to address concerns of U.S. regulators about its merger with Potash Corp of Saskatchewan.",
        "date": "11072017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Agrium sells U.S. plants to ease Potash Corp merger concerns "
    },
    {
        "content": "* Agrium announces sale of Conda phosphate and North Bend nitric acid operations",
        "date": "11072017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Agrium announces sale of Conda phosphate and North Bend nitric acid operations "
    },
    {
        "content": "BEIJING  Nov 7 China's commerce ministry said on Tuesday it has granted conditional regulatory approval to the proposed $25 billion merger between fertiliser companies Agrium Inc and Potash Corp of Saskatchewan Inc.",
        "date": "11072017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "China commerce ministry conditionally approves Potash-Agrium merger "
    },
    {
        "content": "* SAYS POTASHCORP ANNOUNCES ITS PLAN TO MERGE WITH CANADIAN FERTILIZER COMPANY AGRIUM",
        "date": "10222017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Arab Potash says PotashCorp plans to merge with Agrium "
    },
    {
        "content": "* Agrium and Potashcorp announce receipt of regulatory approval in India",
        "date": "10182017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium and Potashcorp receive regulatory approval in India "
    },
    {
        "content": "TORONTO  Sept 12 Canada's main stock index rose on Tuesday  helped by financial sector gains and moves higher in shares of Agrium Inc and Potash Corp of Saskatchewan after a competition watchdog gave their planned merger a green light.",
        "date": "09122017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "CANADA STOCKS-TSX rises with financials  Agrium-Potash Corp deal OK "
    },
    {
        "content": "* Agrium and Potashcorp receive unconditional Canadian regulatory clearance for merger",
        "date": "09112017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium and Potashcorp receive Canadian regulatory clearance for merger "
    },
    {
        "content": "OTTAWA  Sept 11 Canada's competition watchdog said on Monday it will not challenge a proposed merger between Agrium Inc and Potash Corp  saying the transaction was unlikely to substantially lessen competition in the fertilizer industry.",
        "date": "09112017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Canada competition watchdog will not challenge Agrium  Potash merger "
    },
    {
        "content": "Fertilizer companies Agrium Inc and Potash Corp of Saskatchewan Inc said on Thursday they were told by regulators in India and China that they need to divest Potash's offshore interests for their merger to be approved.",
        "date": "09072017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "India  China regulators ask Potash to sell stake for merger with Agrium "
    },
    {
        "content": "Sept 7 Fertilizer companies Agrium Inc and Potash Corp of Saskatchewan Inc said on Thursday they were told by regulators in India and China that they need to divest Potash's offshore interests for their merger to be approved.",
        "date": "09072017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "UPDATE 1-India  China regulators ask Potash to sell stake for merger with Agrium "
    },
    {
        "content": "Sept 7 Fertilizer companies Agrium Inc and Potash Corp of Saskatchewan Inc said on Thursday they were notified by regulators in India and China to divest Potash's offshore interests for their merger approval.",
        "date": "09072017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "CORRECTED-India  China regulators ask Potash to sell stake for Agrium merger "
    },
    {
        "content": "* Agrium and Potashcorp provide update for proposed merger of equals",
        "date": "09072017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Agrium and Potashcorp provide update for proposed merger of equals "
    },
    {
        "content": "* Agrium Inc - ‍Frank comes to Agrium from Monsanto​ Source text for Eikon: Further company coverage:",
        "date": "08222017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium names Mike Frank as president of Agrium Retail "
    },
    {
        "content": "Canadian fertilizer maker Agrium Inc   on Wednesday reported quarterly profit and revenue that edged past analysts' estimates  helped by higher selling prices for potash.",
        "date": "08092017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "Agrium quarterly profit  revenue narrowly beat estimates "
    },
    {
        "content": "Aug 9 Canadian fertilizer maker Agrium Inc on Wednesday reported quarterly profit and revenue that edged past analysts' estimates  helped by higher selling prices for potash.",
        "date": "08092017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "UPDATE 1-Agrium quarterly profit  revenue narrowly beat estimates "
    },
    {
        "content": "* Qtrly retail sales were $5.7 billion versus $5.8 billion in Q2 2016",
        "date": "08092017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Agrium Q2 adjusted EPS $4.09 "
    },
    {
        "content": "Aug 9 Canadian fertilizer maker Agrium Inc reported a 1.2 percent fall in quarterly profit on Wednesday  hurt by weak demand for phosphate and nitrogen.",
        "date": "08092017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Agrium's quarterly profit falls 1.2 pct "
    },
    {
        "content": "TORONTO  July 10 Canada's main stock index rose on Monday  reversing early losses as key sectors including materials and energy rebounded.",
        "date": "07102017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "CANADA STOCKS-TSX edges higher on materials  energy; Home Capital falls "
    },
    {
        "content": "WINNIPEG  Manitoba  June 21 Canadian fertilizer producers Agrium Inc and Potash Corp of Saskatchewan Inc  which are seeking regulator approval to merge  said on Wednesday that the combined company would be called Nutrien.",
        "date": "06212017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Agrium-Potash merged company to be called Nutrien "
    },
    {
        "content": "* Upon closure of the merger transaction  Agrium and Potashcorp will become nutrien",
        "date": "06212017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Agrium and Potash Corp will become Nutrien  upon closure of merger transaction "
    },
    {
        "content": "* Agrium announces acquisition of Starpharma's agrochemical polymer technology business",
        "date": "06132017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium announces acquisition of Starpharma's agrochemical polymer technology business "
    },
    {
        "content": "* Sets dividend of $0.875 per share Source text for Eikon: Further company coverage:",
        "date": "05022017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium sets dividend of $0.875 per share "
    },
    {
        "content": "Agrium Inc    the world's biggest farm retailer  reported a smaller-than-expected loss on Monday  helped by higher selling prices for potash.",
        "date": "05012017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "Fertilizer maker Agrium posts smaller-than-expected loss "
    },
    {
        "content": "May 1 Agrium Inc   the world's biggest farm retailer  reported a smaller-than-expected loss on Monday  helped by higher selling prices for potash.",
        "date": "05012017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "UPDATE 1-Fertilizer maker Agrium posts smaller-than-expected loss "
    },
    {
        "content": "May 1 Canadian fertilizer maker Agrium Inc reported a quarterly loss on Monday  compared with a year-ago profit  largely due to higher natural gas costs and lower phosphate prices.",
        "date": "05012017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Agrium posts quarterly loss vs. year-ago profit "
    },
    {
        "content": "* Q1 retail sales of $2 240 million versus. $2 290 million last year",
        "date": "05012017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Agrium reports Q1 loss per share $0.08 "
    },
    {
        "content": "* Agrium Inc - successfully commissioned its new urea plant with its first run of urea production at Borger nitrogen operations facility in Texas",
        "date": "04182017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium Inc successfully commissioned its new urea plant in Texas "
    },
    {
        "content": "NEW DELHI  March 29 India's competition regulator said the proposed merger between Agrium Inc and Potash Corp of Saskatchewan Inc  was likely to hurt competition  a government statement said on Wednesday.",
        "date": "03292017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Indian regulator says Agrium-Potash merger likely to hurt competition "
    },
    {
        "content": "NEW DELHI/WINNIPEG  March 29 India's competition regulator said the proposed merger of fertilizer producers Agrium Inc and Potash Corp of Saskatchewan Inc is likely to hurt competition  but the comments were not expected to prevent the merger.",
        "date": "03292017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "UPDATE 1-Indian regulator says Agrium-Potash merger likely to hurt competition "
    },
    {
        "content": "TORONTO  March 9 Canada's main stock index edged higher on Thursday as Canadian Natural Resources led a rebound in energy shares after sharp losses the day before  and the materials group gained ground.",
        "date": "03092017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "CANADA STOCKS-TSX rises as Canadian Natural Resources leads energy bounce "
    },
    {
        "content": "March 1 Potash Corporation Of Saskatchewan Inc  CEO Jochen Tilk  speaking at an investor presentation in Florida:",
        "date": "03012017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Potash Corp sees third-quarter closing of Agrium merger "
    },
    {
        "content": "* Sets dividend of $0.875 per share  Source text for Eikon:  Further company coverage:",
        "date": "02222017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium sets dividend of $0.875/share "
    },
    {
        "content": "* Capital Research Global Investors reports a 6 percent passive stake in Agrium Inc as of Dec 30  2016 - SEC Filing  Source text: [http://bit.ly/2kkDjtD] Further company coverage:",
        "date": "02132017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Capital Research Global Investors reports a 6 pct passive stake in Agrium as of Dec 30 - SEC Filing "
    },
    {
        "content": "Feb 10 Agrium Inc CEO Chuck Magro  speaking on a quarterly conference call:",
        "date": "02102017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium has 'strong interest' in seed or chemical lines-CEO "
    },
    {
        "content": "WINNIPEG  Manitoba Agrium Inc    a Canadian fertilizer maker and the world's biggest farm retailer  on Thursday forecast a less profitable year than expected and said its quarterly profit plunged.",
        "date": "02102017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Fertilizer maker Agrium forecasts less profitable year than expected "
    },
    {
        "content": "WINNIPEG  Manitoba  Feb 9 Agrium Inc    a Canadian fertilizer maker and the world's biggest farm retailer  on Thursday forecast a less profitable year than expected.",
        "date": "02092017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "Fertilizer maker Agrium forecasts less profitable year than expected "
    },
    {
        "content": "WINNIPEG  Manitoba  Feb 9 Agrium Inc    a Canadian fertilizer maker and the world's biggest farm retailer  on Thursday forecast a less profitable year than expected and said its quarterly profit plunged.",
        "date": "02102017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "UPDATE 1-Fertilizer maker Agrium forecasts less profitable year than expected "
    },
    {
        "content": "Jan 25 Agrium Inc CEO Chuck Magro  speaking at CIBC investor conference in British Columbia:",
        "date": "01252017",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium sees US corn plantings 90-92 million acres in 2017 "
    },
    {
        "content": "TORONTO  Jan 26 Canada's main stock index edged lower on Thursday but stayed close to its all-time high as a retreat among materials stocks weighed and investors reacted to a string of earnings reports.",
        "date": "01262017",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "CANADA STOCKS-TSX edges lower as materials stocks weigh  earnings in focus "
    },
    {
        "content": "* Agrium and Potashcorp provide update on approvals for proposed merger of equals",
        "date": "11072016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium  Potashcorp provide update on approvals for proposed merger "
    },
    {
        "content": "WINNIPEG  Manitoba  Nov 4 Moody's Investor Service on Friday downgraded the credit rating of Potash Corp of Saskatchewan   citing concerns of a longer-than-expected fertilizer slump  ahead of the company's planned merger with rival Agrium Inc.",
        "date": "11042016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "UPDATE 1-Moody's downgrades Potash Corp as fertilizer slump lingers "
    },
    {
        "content": "WINNIPEG  Manitoba  Nov 4 Moody's Investor Service on Friday downgraded the credit rating of Potash Corp of Saskatchewan   due to concerns of a longer-than-expected fertilizer slump  ahead of the company's planned merger with rival Agrium Inc.",
        "date": "11042016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Moody's downgrades Potash Corp as fertilizer slump lingers "
    },
    {
        "content": "* Agrium Inc - Approximately 98 percent of shares and voting options voted at meeting were voted in favour of merger",
        "date": "11032016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium securityholders overwhelmingly approve merger of equals with Potashcorp "
    },
    {
        "content": "* Potash Corporation of Saskatchewan Inc - More than 99 percent of shares voted at meeting were voted in favor of merger",
        "date": "11032016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Potashcorp shareholders overwhelmingly approve merger of equals with Agrium "
    },
    {
        "content": "CALGARY  Alberta/WINNIPEG  Manitoba  Nov 3 (Reuters) - S hareholders of Agrium Inc and Potash Corp of Saskatchewan Inc overwhelmingly approved an all-stock merger of the fertilizer producers on Thursday.",
        "date": "11032016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Agrium  Potash Corp investors back merger of fertilizer companies "
    },
    {
        "content": "CALGARY  Alberta/WINNIPEG  Manitoba  Nov 3 (Reuters) - S hareholders of Agrium Inc and Potash Corp of Saskatchewan Inc overwhelmingly approved an all-stock merger of the fertilizer producers on Thursday  shifting the focus to U.S. and Canadian regulators.",
        "date": "11032016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "UPDATE 2-Agrium  Potash Corp investors back merger of fertilizer companies "
    },
    {
        "content": "TORONTO/WINNIPEG Shareholders of Agrium Inc  and Potash Corp of Saskatchewan Inc  are set to overwhelmingly approve a merger of the two Canadian fertilizer producers  according to a source familiar with the situation  despite initial skepticism from Agrium investors.",
        "date": "10272016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "Agrium-Potash merger set for shareholder approval -source "
    },
    {
        "content": "Nov 3 Agrium Inc CEO Chuck Magro  speaking on a conference call said:",
        "date": "11032016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Agrium expects overwhelming investor support for Potash merger "
    },
    {
        "content": "TORONTO/WINNIPEG  Oct 27 Shareholders of Agrium Inc and Potash Corp of Saskatchewan Inc are set to overwhelmingly approve a merger of the two Canadian fertilizer producers  according to a source familiar with the situation  despite initial skepticism from Agrium investors.",
        "date": "10272016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "WRAPUP 1-Agrium-Potash merger set for shareholder approval -source "
    },
    {
        "content": "Nov 3 Canadian fertilizer maker Agrium Inc    reported a surprise quarterly loss on Thursday as it grapples with low fertilizer and crop prices  and also cut its full-year profit forecast.",
        "date": "11032016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "UPDATE 1-Agrium posts surprise loss on low fertilizer prices "
    },
    {
        "content": "* Agrium inc - q3 wholesale sales were $518 million versus $673 million",
        "date": "11032016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Agrium Q3 adjusted loss per share $0.12 "
    },
    {
        "content": "Nov 3 Canadian fertilizer maker Agrium Inc    reported a quarterly loss on Thursday hit by weak fertilizer and crop prices.",
        "date": "11032016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Canadian fertilizer maker Agrium posts quarterly loss "
    },
    {
        "content": "TORONTO/WINNIPEG  Oct 27 The shareholders of Agrium Inc and Potash Corp of Saskatchewan Inc  are set to overwhelmingly approve a merger of the two Canadian fertilizer producers  according to a source familiar with the situation  despite initial skepticism from Agrium investors.",
        "date": "10272016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "UPDATE 1-Agrium-Potash merger set for shareholder approval - source "
    },
    {
        "content": "TORONTO/WINNIPEG  Oct 27 The shareholders of Agrium Inc and Potash Corp of Saskatchewan Inc  are set to overwhelmingly approve a merger of the two Canadian fertilizer producers  according to a source familiar with the situation  despite initial skepticism from Agrium investors.",
        "date": "10272016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Agrium-Potash merger set for shareholder approval - source "
    },
    {
        "content": "Oct 27 Potash Corp of Saskatchewan    the world's biggest fertilizer company by capacity  said early votes by shareholders supported a proposed merger with rival Agrium Inc as it posted a smaller-than-expected drop in quarterly profit.",
        "date": "10272016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "UPDATE 2-Potash Corp sees merger support; profit drops less than expected "
    },
    {
        "content": "Investor advisory company Glass Lewis said on Thursday it recommended that Agrium Inc  and Potash Corp of Saskatchewan Inc  shareholders support a proposed merger  saying it would create a bigger  more diversified company.",
        "date": "10202016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "Glass Lewis recommends Agrium  Potash investors back merger "
    },
    {
        "content": "Oct 17 Investor advisory company Institutional Shareholder Services (ISS) has recommended that investors in fertilizer producers Agrium Inc and Potash Corp of Saskatchewan support a merger of the companies.",
        "date": "10172016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "UPDATE 1-ISS recommends investors back Agrium-Potash Corp merger "
    },
    {
        "content": "Oct 20 Investor advisory company Glass Lewis said on Thursday it recommended that Agrium Inc and Potash Corp of Saskatchewan Inc shareholders support a proposed merger  saying it would create a bigger  more diversified company.",
        "date": "10202016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "UPDATE 1-Glass Lewis recommends Agrium  Potash investors back merger "
    },
    {
        "content": "Oct 17 Investor advisory company Institutional Shareholder Services (ISS) has recommended that investors in fertilizer producers Agrium Inc and Potash Corp of Saskatchewan support a merger of the companies.",
        "date": "10172016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "ISS recommends investors back Agrium-Potash Corp merger "
    },
    {
        "content": "Oct 20 Investor advisory company Glass Lewis said on Thursday that it recommended Agrium Inc  shareholders support a proposed merger with Potash Corp of Saskatchewan  saying that it would create a bigger  more diversified company.",
        "date": "10202016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Glass Lewis recommends Agrium investors back Potash Corp merger "
    },
    {
        "content": "Oct 6 Agrium Inc and Potash Corp of Saskatchewan shareholders will hold separate meetings next month to vote on a merger agreement between the two fertilizer companies  they said in a filing on Thursday.",
        "date": "10062016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Agrium  Potash to hold shareholder votes on merger next month "
    },
    {
        "content": "Plunging crop and fertilizer prices may not have hit rock bottom yet  and the market's weakness makes it the right time to merge leading farm input suppliers  the chief executive officer of Agrium Inc said on Tuesday  making his pitch to skeptical investors for a $26 billion union with Potash Corp of Saskatchewan Inc.",
        "date": "09212016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "Tough farm conditions right time for Potash merger: Agrium CEO "
    },
    {
        "content": "BRUSSELS China National Chemical Corp (ChemChina) [CNNCC.UL] has sought antitrust approval for its $43 billion bid for Swiss pesticides and seeds group Syngenta  from the European Union and a decision is expected by Oct. 28.",
        "date": "09262016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "ChemChina seeks EU okay for Syngenta deal  decision due October 28 "
    },
    {
        "content": "BRUSSELS  Sept 26 China National Chemical Corp (ChemChina) has sought antitrust approval for its $43 billion bid for Swiss pesticides and seeds group Syngenta  from the European Union and a decision is expected by Oct. 28.",
        "date": "09262016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "ChemChina seeks EU okay for Syngenta deal  decision due Oct. 28 "
    },
    {
        "content": "Sept 20 Plunging crop and fertilizer prices may not have hit rock bottom yet  and the market's weakness makes it the right time to merge leading farm input suppliers  the chief executive officer of Agrium Inc said on Tuesday  making his pitch to skeptical investors for a $26 billion union with Potash Corp of Saskatchewan Inc.",
        "date": "09202016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "Tough farm conditions right time for Potash merger -Agrium CEO "
    },
    {
        "content": "WINNIPEG Canada's Agrium Inc will woo reluctant shareholders next week in Toronto to support its proposed merger with Potash Corp of Saskatchewan Inc  and seek to appease concerns that it has little to gain by marrying its fertilizer rival.",
        "date": "09162016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "Agrium to woo uneasy investors over Potash merger deal "
    },
    {
        "content": "Sept 20 Potash Corp  Agrium CEOs  speaking at Scotiabank investor conference in Toronto:",
        "date": "09202016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Potash Corp  Agrium merger could accelerate retail expansion "
    },
    {
        "content": "WINNIPEG  Sept 15 Canada's Agrium Inc  will woo reluctant shareholders next week in Toronto to support its proposed merger with Potash Corp of Saskatchewan Inc   and seek to appease concerns that it has little to gain by marrying its fertilizer rival.",
        "date": "09152016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "Agrium to woo uneasy investors over Potash merger deal "
    },
    {
        "content": "* Moody's places Agrium under review for upgrade following merger announcement with Potash Corp",
        "date": "09132016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Moody's places Agrium under review for upgrade following merger announcement with Potash "
    },
    {
        "content": "Sept 12 From interview with Potash Corp CEO and Agrium CEO:",
        "date": "09122016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Potash  Agrium see Canpotex as 'equal partnership' with Mosaic "
    },
    {
        "content": "* Based on the Aug 29  market caps of both Potash and Agrium  combined co will have $26 billion market cap - conf call",
        "date": "09122016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Agrium says new co will have low-cost capacity of about 22 mln tonnes "
    },
    {
        "content": "TORONTO  Sept 12 Canada's main stock index fell early on Monday  as investors bet that global central bank enthusiasm for monetary stimulus may be waning and oil prices dipped  while Potash Corp and Agrium Inc both gained after agreeing to merge.",
        "date": "09122016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "CANADA STOCKS-TSX falls with oil  global sentiment; Potash and Agrium gain "
    },
    {
        "content": "* Agrium and PotashCorp to combine in merger of equals to create a world-Class integrated global supplier of crop inputs",
        "date": "09122016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Agrium and PotashCorp to combine in merger of equals "
    },
    {
        "content": "Sept 12 Canada's Agrium Inc and Potash Corp of Saskatchewan Inc said on Monday they would combine to create a fertilizer and farm retailing giant with proforma enterprise value of $36 billion.",
        "date": "09122016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Agrium and Potash Corp to merge "
    },
    {
        "content": "* Agrium's crop production services announces two retail acquisitions  to add 34 locations in the u.s. And canada",
        "date": "09062016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium's crop production services announces two retail acquisitions "
    },
    {
        "content": "WINNIPEG  Manitoba  Sept 1 Crop Production Services (CPS)  a farm retail subsidiary of fertilizer producer Agrium Inc  has agreed to sell four Alberta stores to resolve competition concerns around its proposed purchase of smaller rival Andrukow Group Solutions  Canada's antitrust regulator said on Thursday.",
        "date": "09012016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "Agrium unit to divest some stores in Canada farm retail deal "
    },
    {
        "content": "TORONTO  Sept 1 Canada's main stock index rose on Thursday  led by gold mining stocks after weak U.S. manufacturing data tempered expectations for Federal Reserve interest hikes.",
        "date": "09012016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "CANADA STOCKS-TSX rises  led by gold miners after weak U.S. data "
    },
    {
        "content": "* Consolidation in sector is being driven by low valuations synergies and longer term growth prospects",
        "date": "09012016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Fitch Potashcorp/Agrium merger talks highlight distribution "
    },
    {
        "content": "* Agrium confirms discussions with PotashCorp regarding potential merger of equals",
        "date": "08302016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium confirms talks with Potash Corp for potential merger of equals "
    },
    {
        "content": "Aug 30 Canadian fertilizer companies Agrium Inc  and Potash Corp of Saskatchewan Inc are in talks to merge  Bloomberg reported  citing people familiar with the matter.",
        "date": "08302016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Agrium  Potash Corp in merger talks- Bloomberg "
    },
    {
        "content": "* Potash Corp  Agrium Inc planning to merge; combination could be announced as soon as next week - Bloomberg  citing sources  Source text : http://bloom.bg/2bzbR1O",
        "date": "08302016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Potash Corp  Agrium planning to merge - Bloomberg "
    },
    {
        "content": "Aug 23 An Agrium Inc worker has been injured at the Vanscoy  Saskatchewan  potash mine  a union official said on Tuesday  less than two weeks after another died of work-related injuries at the same mine.",
        "date": "08232016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "UPDATE 1-Agrium worker injured in Canada mine incident  production shut "
    },
    {
        "content": "Aug 23 An Agrium Inc worker has been injured at the Vanscoy  Saskatchewan  potash mine  a union official said on Tuesday  less than two weeks after another died of work-related injuries at the same mine.",
        "date": "08232016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Agrium worker injured in Canada mine incident  production shut "
    },
    {
        "content": "Aug 11 An Agrium Inc worker has died of his injuries from an accident at the Vanscoy  Saskatchewan  potash mine  a company spokesman said on Thursday.",
        "date": "08112016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "Agrium worker dies after Canadian mine accident "
    },
    {
        "content": "TORONTO  Aug 9 Agrium Inc's operations at its Vanscoy potash mine in the province of Saskatchewan could be halted for days  a union official said on Tuesday  the day after a worker was injured.",
        "date": "08092016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "UPDATE 1-Agrium's Vanscoy potash mine operations remain suspended "
    },
    {
        "content": "* CEO Chuck Magro said the company is interested in potential acquisitions of wholesale fertilizer assets and farm retail stores.   Further company coverage:    (Reporting By Rod Nickel)",
        "date": "08042016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium interested in buying fertilizer assets  farm retail stores - CEO "
    },
    {
        "content": "Aug 3 Two of North America's biggest fertilizer companies reported large drops in quarterly profit on Wednesday  and warned of tough times ahead as abundant supplies weighed on prices.",
        "date": "08032016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Fertilizer price slump chops profits at CF Industries  Agrium "
    },
    {
        "content": "Aug 3 Canadian fertilizer maker Agrium Inc   on Wednesday reported a 16 percent fall in quarterly profit due to weak fertilizer prices.",
        "date": "08032016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Agrium's profit falls 16 percent on weak fertilizer prices "
    },
    {
        "content": "* Agrium inc says  board approved a dividend of $0.875 u.s. Per common share  Source text for Eikon:  Further company coverage:",
        "date": "08032016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Agrium says board approved dividend of US$0.875 per common share "
    },
    {
        "content": "* Agrium announces investment in Finistere Agtech venture fund",
        "date": "07272016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium agrium announces investment in Finistere Agtech Venture Fund "
    },
    {
        "content": "CHICAGO  July 6 U.S. grain trader Cargill Inc  has agreed to sell its ag-retail business in the United States to farming input seller and distributor Agrium Inc   the companies said on Wednesday.",
        "date": "07062016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Cargill sells U.S. ag-retail business to Agrium "
    },
    {
        "content": "* Sale does not involve Cargill's Canadian crop input retail business",
        "date": "07062016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Agrium to acquire Cargill's U.S. AG-Retail business "
    },
    {
        "content": "Agrium Inc   North America's largest retail seller of products for crop farming  could benefit if some of the biggest makers of seed and agricultural chemicals merge  Chief Executive Chuck Magro said on Wednesday.",
        "date": "06082016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "Agrium sees opportunities as seed  chemical companies talk mergers "
    },
    {
        "content": "June 8 Agrium Inc  North America's largest retail seller of products for crop farming  could benefit if some of the biggest makers of seed and agricultural chemicals merge  Chief Executive Chuck Magro said on Wednesday.",
        "date": "06082016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "UPDATE 1-Agrium sees opportunities as seed  chemical companies talk mergers "
    },
    {
        "content": "June 8 Agrium Inc CEO Chuck Magro was speaking at investor day in Toronto:",
        "date": "06082016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Agrium sees opportunities from seed  chemical mergers-CEO "
    },
    {
        "content": "June 8 Agrium Inc  North America's largest retail seller of products for crop farming  plans to build up to 30 stores in the region by 2020  Chief Executive Chuck Magro told investors in Toronto on Wednesday.",
        "date": "06082016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Agrium to build up to 30 farm retail stores in North America "
    },
    {
        "content": "WINNIPEG  Manitoba  June 2 North America's big potash miners have doubled down on a production cut strategy they hope will lift the fertilizer's price from a near decade low  even as some investors warn this threatens their long-term profitability and props up weaker rivals.",
        "date": "06022016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Potash output cuts seen hindering industry's long-term recovery "
    },
    {
        "content": "NEW YORK Agrium Inc    North America's biggest retail seller of products for farming  sees ample opportunities to buy and build more stores in the United States and looks to claim a quarter of the market  its chief executive said on Thursday.",
        "date": "05192016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "Agrium eyes one-quarter share of U.S. farm retail sector "
    },
    {
        "content": "* Files for mixed shelf of up to $2.5 billion - sec filing  Source text : http://1.usa.gov/1Nl1XmQ Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "05052016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium files for mixed shelf of up to $2.5 bln "
    },
    {
        "content": "* Says victor Zaleschuk  who has served on Agrium's board since 2002 and as board chair since 2012  is retiring from board  Source text for Eikon:  Further company coverage:",
        "date": "05052016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Agrium Inc appoints Derek Pannell as Chair of Agrium's board "
    },
    {
        "content": "* 2016 annual guidance range has been revised to $5.25 to $6.25 diluted earnings per share",
        "date": "05032016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Agrium Inc reports Q1 adjusted earnings per share $0.05 "
    },
    {
        "content": "May 3 Canadian fertilizer company Agrium Inc  quarterly profit tumbled 83 percent  hurt by weaker selling prices of all nutrients.",
        "date": "05032016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Canada's Agrium posts 83 pct fall in profit "
    },
    {
        "content": "* Approved a dividend of $0.875 U.S. Per common share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "05032016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "BRIEF-Agrium approved a dividend of $0.875 U.S./shr "
    },
    {
        "content": "Feb 9 Agrium Inc   a Canadian fertilizer and farm products retailer  joined rival Potash Corp of Saskatchewan Inc in forecasting a weaker-than-expected 2016 profit  as prices for crop nutrients remain weak.",
        "date": "02092016",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "UPDATE 2-Fertilizer maker Agrium's forecast disappoints  shares fall "
    },
    {
        "content": "Feb 9 Agrium Inc   a Canadian fertilizer and farm products retailer  forecast lower-than-expected profit for 2016  blaming weak prices.",
        "date": "02092016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "CORRECTED-UPDATE 1-Fertilizer maker Agrium's 2016 profit forecast misses estimates "
    },
    {
        "content": "Feb 9 Canadian fertilizer and farm products retailer Agrium Inc's quarterly profit nearly tripled  helped by higher earnings from retail sales and strong performance at its wholesale business  where costs fell and sales volumes rose.",
        "date": "02092016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Canadian fertilizer company Agrium's profit nearly triples "
    },
    {
        "content": "Jan 21 The suspension of production at an eastern Canadian mine may lead Potash Corp of Saskatchewan Inc   to shelve plans to build a new West Coast shipping terminal with partners Mosaic Co and Agrium Inc   Potash Chief Executive Jochen Tilk said on Thursday.",
        "date": "01212016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "UPDATE 1-Potash Corp mine closure may shelve Canpotex port plans -CEO "
    },
    {
        "content": "* Half of TSX's 10 main groups rise; 3 gainers for every faller",
        "date": "01212016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "CANADA STOCKS-TSX bucks downtrend  rises as energy stocks bounce "
    },
    {
        "content": "Jan 21 Potash Corp of Saskatchewan's   decision this week to suspend production at an Eastern Canadian mine may lead to it shelving plans to build a new West Coast shipping terminal with partners Mosaic Co and Agrium Inc  Potash Chief Executive Jochen Tilk said on Thursday.",
        "date": "01212016",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Potash Corp mine closure may lead to shelving Canpotex port plans -CEO "
    },
    {
        "content": "* Yara has signed an agreement to acquire the assets of West Sacramento Nitrogen Operations from Agrium for a purchase price of USD 27 million",
        "date": "12032015",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "BRIEF-Yara buys Sacramento terminal from Agrium for $27 mln "
    },
    {
        "content": "Agrium Inc  the Canadian fertilizer and farm retail dealer  on Thursday reported quarterly profit jumped nearly 9 percent  as higher sales volumes and lower costs helped it buck the sector's trend of weaker earnings.",
        "date": "11052015",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "Fertilizer maker Agrium bucks sector trend  records bigger profit "
    },
    {
        "content": "Nov 5 Canadian fertilizer and farm retail dealer Agrium Inc  reported a nearly 9 percent rise in quarterly profit  helped by lower costs.",
        "date": "11052015",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "UPDATE 1-Fertilizer maker Agrium's profit rises nearly 9 pct "
    },
    {
        "content": "Nov 5 Canadian fertilizer and farm retail dealer Agrium Inc  reported a nearly 9 percent rise in quarterly profit  helped by lower costs.",
        "date": "11052015",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Agrium profit rises nearly 9 pct on lower costs "
    },
    {
        "content": "Aug 5 North American nitrogen fertilizer producers Agrium Inc and CF Industries reported on Wednesday higher second-quarter profits after markets closed.",
        "date": "08052015",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Fertilizer makers Agrium  CF post higher profits "
    },
    {
        "content": "Aug 5 North American nitrogen fertilizer producers Agrium Inc and CF Industries reported higher second-quarter profits on Wednesday after markets closed.",
        "date": "08052015",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "UPDATE 1-Fertilizer makers Agrium  CF post higher profits "
    },
    {
        "content": "May 5 Canadian fertilizer and farm retail dealer Agrium Inc reported on Tuesday higher first-quarter profit.",
        "date": "05052015",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "Agrium reports higher quarterly profit; raises dividend 12 pct "
    },
    {
        "content": "May 5 Canadian fertilizer and farm retail dealer Agrium Inc on Tuesday reported a first-quarter profit that fell short of expectations  due in part to a late start to the U.S. spring farming season.",
        "date": "05062015",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "UPDATE 1-Agrium quarterly profit disappoints; boosts dividend 12 pct "
    },
    {
        "content": "WINNIPEG  Manitoba  March 30 Canpotex Ltd  the offshore potash sales arm of North America's Potash Corp of Saskatchewan   Mosaic Co and Agrium Inc   said on Monday it had set 2015 supply contracts with major Chinese buyers  including Sinofert Holdings Ltd  and expected higher volume.",
        "date": "03302015",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "UPDATE 1-Canpotex sets potash contracts with Chinese buyers "
    },
    {
        "content": "WINNIPEG  Manitoba  March 30 Canpotex Ltd  the offshore potash sales arm of Potash Corp of Saskatchewan    Mosaic Co and Agrium Inc  said on Monday it had set 2015 supply contracts with major Chinese buyers  including Sinofert Holdings Ltd.",
        "date": "03302015",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Canpotex sets potash contracts with Chinese buyers "
    },
    {
        "content": "WINNIPEG  Manitoba  Feb 26 Canadian farmers are plowing profits from bumper crops into fertilizer storage facilities to mitigate the pricing power held by major retailers and producers.",
        "date": "02272015",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Canadian farmers store fertilizer to fight dealers' pricing power "
    },
    {
        "content": "Feb 23 Canadian fertilizer and farm retail dealer Agrium Inc reported a 48 percent fall in fourth-quarter profit as expenses rose.",
        "date": "02242015",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "Canada's Agrium profit falls 48 pct "
    },
    {
        "content": "NEW YORK  Feb 17 Top U.S. hedge fund management firms  including David Einhorn's Greenlight Capital and Philippe Laffont's Coatue Management  reduced their stakes in Apple Inc  during the fourth quarter  ahead of the iPhone maker's strong rally in 2015  according to regulatory filings.",
        "date": "02172015",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "HIGHLIGHTS-Top U.S. hedge funds cut Apple stakes ahead of all-time high "
    },
    {
        "content": "NEW YORK  Feb 17 Top U.S. hedge fund management firms  including David Einhorn's Greenlight Capital and Philippe Laffont's Coatue Management  cut their stakes in Apple Inc  during the fourth quarter  ahead of the iPhone maker's strong rally this year  according to regulatory filings.",
        "date": "02172015",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "CORRECTED-HIGHLIGHTS-Top U.S. hedge funds scale back on Apple ahead of all-time high "
    },
    {
        "content": "Jan 22 Canadian fertilizer and farm retail dealer Agrium Inc  said it would pay out a larger percentage of its free cash flow as dividends and buy back up to 5 percent of its shares  driving its stock up as much as 5.6 percent.",
        "date": "01222015",
        "name": "Agrium Inc",
        "news_type": "topStory",
        "symbol": "AGU",
        "title": "UPDATE 1-Agrium shares rise on dividend  buy-back news "
    },
    {
        "content": "Jan 22 Canadian fertilizer and farm retail dealer Agrium Inc  said it would pay out 40-50 percent of its free cash flow as dividend  up from its earlier target of 25-35 percent.",
        "date": "01222015",
        "name": "Agrium Inc",
        "news_type": "normal",
        "symbol": "AGU",
        "title": "Agrium to pay more in dividend "
    }
]