[
    {
        "content": "FRANKFURT  Nov 2 German healthcare group Fresenius SE said on Thursday that weakness at Akorn   the U.S. maker of liquid generic drugs it has agreed to buy  could continue into next year but the deal was still worth it over the longer term.",
        "date": "11022017",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "UPDATE 1-Fresenius says Akorn troubles could continue into next year "
    },
    {
        "content": "NEW YORK  Oct 31 John Kapoor  the billionaire founder of opioid maker Insys Therapeutics Inc  has resigned as chairman of drugmaker Akorn Inc  just days after his arrest on charges he participated in a scheme to bribe doctors to prescribe a potent pain medication while he was at Insys.",
        "date": "10312017",
        "name": "Akorn Inc",
        "news_type": "normal",
        "symbol": "AKRX",
        "title": "Insys founder Kapoor steps down as Akorn chairman after arrest "
    },
    {
        "content": "BOSTON  Oct 26 The billionaire founder of Insys Therapeutics Inc was arrested on Thursday on U.S. charges he participated in a scheme to bribe doctors to prescribe a fentanyl-based cancer pain drug  marking a step by authorities to fight the opioid epidemic.",
        "date": "10272017",
        "name": "Akorn Inc",
        "news_type": "normal",
        "symbol": "AKRX",
        "title": "UPDATE 3-Billionaire Insys founder charged in U.S. opioid bribe case "
    },
    {
        "content": "TEL AVIV  Oct 3 New York-based Senvest Management is shorting three drug stocks  Insys Therapeutics Inc   Akorn Inc and Fresenius SE  its chief executive Richard Mashaal said on Tuesday ",
        "date": "10032017",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "Senvest Management shorting drug stocks Insys  Akorn  Fresenius "
    },
    {
        "content": "* At yesterday's special meeting  shareholders of Akorn  Inc.  have approved merger agreement with fresenius kabi  with 83.9 percent of outstanding shares being voted in favour of transaction. Source text for Eikon: Further company coverage:",
        "date": "07202017",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "BRIEF-Fresenius SE says Akorn shareholders approved merger "
    },
    {
        "content": "* Akorn shareholders vote to approve merger agreement with Fresenius Kabi",
        "date": "07192017",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "BRIEF-Akorn shareholders vote to approve merger agreement with Fresenius Kabi "
    },
    {
        "content": "FRANKFURT  May 3 German healthcare group Fresenius SE & Co KGaA on Wednesday lifted its guidance on strong demand in the United States for its generic infusion drugs.",
        "date": "05032017",
        "name": "Akorn Inc",
        "news_type": "normal",
        "symbol": "AKRX",
        "title": "Fresenius ups FY guidance on growth at generic drugs unit "
    },
    {
        "content": "* Akorn - deal with Fresenius Kabi provides under specified circumstances  co to be required to pay Fresenius Kabi AG termination fee of $129 million Source text: (http://bit.ly/2oEMWQV) Further company coverage:",
        "date": "04242017",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "BRIEF-Akorn deal to pay Fresenius Kabi AG termination fee of $129 mln under specified circumstances "
    },
    {
        "content": "FRANKFURT  April 24 Acquisitive German healthcare conglomerate Fresenius SE & Co KGaA revved up its deals pace by acquiring U.S. generic drugmaker Akorn Inc for $4.75 billion (4.37 billion euros)  and in a separate deal  the biosimilars unit of German peer Merck KGaA .",
        "date": "04242017",
        "name": "Akorn Inc",
        "news_type": "normal",
        "symbol": "AKRX",
        "title": "Fresenius snaps up Akorn  Merck KGaA's biosimilars in separate deals "
    },
    {
        "content": "German healthcare conglomerate Fresenius SE & Co KGaA  is close to acquiring generic drugmaker Akorn Inc  in an all-cash deal valuing the company at more than $4 billion  people familiar with the matter said on Monday.",
        "date": "04242017",
        "name": "Akorn Inc",
        "news_type": "normal",
        "symbol": "AKRX",
        "title": "Exclusive: Fresenius nears deal to acquire Akorn - sources "
    },
    {
        "content": "FRANKFURT German healthcare group Fresenius SE & Co KGaA  has stepped up its dealmaking  agreeing to buy U.S. generic drugmaker Akorn Inc  for $4.75 billion (4.37 billion euros) and the biosimilars arm of Germany's Merck KGaA.",
        "date": "04252017",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "Fresenius picks up M&A pace with Akorn  Merck KGaA deals "
    },
    {
        "content": "* Fresenius shares up almost 1 percent (Adds advisers  shares  background  CEO  analyst comments)",
        "date": "04252017",
        "name": "Akorn Inc",
        "news_type": "normal",
        "symbol": "AKRX",
        "title": "UPDATE 2-Fresenius picks up M&A pace with Akorn  Merck KGaA deals "
    },
    {
        "content": "FRANKFURT  April 25 The DAX top-30 index looked set to open 0.3 percent higher on Tuesday  according to premarket data from brokerage Lang & Schwarz at 0625 GMT.",
        "date": "04252017",
        "name": "Akorn Inc",
        "news_type": "normal",
        "symbol": "AKRX",
        "title": "German stocks - Factors to watch on April 25 "
    },
    {
        "content": "Generic drugmaker Akorn Inc must pay $20.5 million in a lawsuit by a Georgia teacher who accused the company of failing to warn that one of its products would react adversely with another medication she was already taking  a state court jury has ruled.",
        "date": "04112017",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "Akorn hit with $20.5 million verdict over failure to warn "
    },
    {
        "content": "German healthcare group Fresenius SE & Co KGaA  said on Friday that it was in talks with the generic drugmaker Akorn Inc  for a potential takeover.",
        "date": "04072017",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "Germany's Fresenius in talks to buy generic drugmaker Akorn "
    },
    {
        "content": "April 7 German healthcare group Fresenius SE & Co KGaA said on Friday that it was in talks with the generic drugmaker Akorn Inc for a potential takeover.",
        "date": "04072017",
        "name": "Akorn Inc",
        "news_type": "normal",
        "symbol": "AKRX",
        "title": "UPDATE 3-Germany's Fresenius in talks to buy generic drugmaker Akorn "
    },
    {
        "content": "* Akorn Inc- Akorn is currently in discussions with Fresenius Kabi  a subsidiary of Fresenius SE & Co. KGaA concerning a potential acquisition of Akorn Source text for Eikon: Further company coverage:",
        "date": "04072017",
        "name": "Akorn Inc",
        "news_type": "normal",
        "symbol": "AKRX",
        "title": "BRIEF-Akorn confirms discussions with Fresenius Kabi "
    },
    {
        "content": "April 7 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "04072017",
        "name": "Akorn Inc",
        "news_type": "normal",
        "symbol": "AKRX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "April 7 German healthcare group Fresenius SE & Co KGaA is weighing a bid for generic drugmaker Akorn Inc  Bloomberg reported on Friday  citing people familiar with the matter.",
        "date": "04072017",
        "name": "Akorn Inc",
        "news_type": "normal",
        "symbol": "AKRX",
        "title": "Germany's Fresenius weighing bid for generic drugmaker Akorn -Bbg "
    },
    {
        "content": "* Fresenius said to weigh a bid for U.S. generics maker Akorn - Bloomberg Source text: http://bit.ly/2nM2sKg",
        "date": "04072017",
        "name": "Akorn Inc",
        "news_type": "normal",
        "symbol": "AKRX",
        "title": "BRIEF-Fresenius said to weigh a bid for U.S. generics maker Akorn - Bloomberg "
    },
    {
        "content": "* Akorn Inc - CEO Raj Rai's total compensation for 2016 was $7.2 million - SEC filing  Source text for Eikon: (http://bit.ly/2mkcqHb) Further company coverage:",
        "date": "03202017",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "BRIEF-Akorn Inc's CEO Raj Rai's total compensation for 2016 was $7.2 mln "
    },
    {
        "content": "* expects 2017 adjusted net income per diluted share (non-gaap) $1.53 - $1.72",
        "date": "03012017",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "BRIEF-Akorn Inc reports Q4 gaap earnings per share $0.26 "
    },
    {
        "content": "* Akorn receives approval for mycophenolate mofetil for injection  USP  Source text for Eikon:  Further company coverage:",
        "date": "02282017",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "BRIEF-Akorn receives approval for mycophenolate mofetil for injection  USP "
    },
    {
        "content": "* On November 22  2016  patent trial and appeal board ruled in favor of Akorn in its inter partes review proceeding",
        "date": "11282016",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "BRIEF-Akorn invalidates Durezol patent via inter partes review proceeding "
    },
    {
        "content": "* Now sees 2016 net revenue $ 1.125 billion from $1.06-$1.08 billion earlier",
        "date": "11032016",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "BRIEF-Akorn Q3 earnings per share $0.38 "
    },
    {
        "content": "* Akorn relaunches Ofloxacin Otic solution  Source text for Eikon:  Further company coverage:",
        "date": "08252016",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "BRIEF-Akorn relaunches Ofloxacin Otic solution "
    },
    {
        "content": "* Q2 adjusted NON-GAAP earnings per share $0.58 including items",
        "date": "08042016",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "BRIEF-Akorn reported Q2 EPS $0.50 "
    },
    {
        "content": "* Qtrly gaap eps of $0.34  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "05162016",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "BRIEF-Akorn Q1 earnings $0.34/shr "
    },
    {
        "content": "* Anticipates filing quarterly report no later than May 16  Source text: http://1.usa.gov/1rF8mzo Further company coverage:",
        "date": "05102016",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "BRIEF-Akorn files for non-timely 10-q "
    },
    {
        "content": "* Akorn completes 2014 financial statement restatement and reports audited 2015 and restated 2014 results",
        "date": "05102016",
        "name": "Akorn Inc",
        "news_type": "normal",
        "symbol": "AKRX",
        "title": "BRIEF-Akorn affirms 2016 net revenue and EPS guidance "
    },
    {
        "content": "* On Monday  May 9  2016  company plans to file annual report on form 10-K for year ended December 31  2015  Source text for Eikon:  Further company coverage:",
        "date": "05062016",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "BRIEF-Akorn to file annual report for year ended Dec 31  2015 on May 9 "
    },
    {
        "content": "* Remains Akorn's goal to file its restated 2014 financial information and delinquent 2015 financial results with sec by may 9  2016",
        "date": "03222016",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "BRIEF-Akorn sees 2016 GAAP share between $1.56 - $1.66 "
    },
    {
        "content": "NEW YORK An Akorn Inc unit's proposed generic glaucoma drug infringed three Allergan Inc  patents on its Lumigan topical treatment for the eye disease  a U.S. appeals court ruled on Tuesday.",
        "date": "08042015",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "Akorn Inc's Hi-Tech Pharmacal infringes Allergan glaucoma drug patents "
    },
    {
        "content": "NEW YORK  Aug 4 An Akorn Inc unit's proposed generic glaucoma drug infringed three Allergan Inc  patents on its Lumigan topical treatment for the eye disease  a U.S. appeals court ruled on Tuesday.",
        "date": "08042015",
        "name": "Akorn Inc",
        "news_type": "normal",
        "symbol": "AKRX",
        "title": "UPDATE 1-Akorn Inc's Hi-Tech Pharmacal infringes Allergan glaucoma drug patents "
    },
    {
        "content": "March 4 Akorn Inc announced a policy to prevent the use of its drugs in state executions in response to a call by shareholder New York State Common Retirement Fund  the third-largest public pension fund in the United States.",
        "date": "03042015",
        "name": "Akorn Inc",
        "news_type": "normal",
        "symbol": "AKRX",
        "title": "Akorn details policy to prevent use of its drugs in state executions "
    },
    {
        "content": "* Says signs strategic cooperation agreement with U.S. pharma firm Akorn",
        "date": "01062015",
        "name": "Akorn Inc",
        "news_type": "topStory",
        "symbol": "AKRX",
        "title": "BRIEF-China's Hybio Pharmaceutical signs strategic agreement with U.S. firm Akorn "
    }
]