[
    {
        "content": "* Q3 adjusted earnings per share $1.08 from continuing operations",
        "date": "11082017",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle posts Q3 earnings per share $1.06 "
    },
    {
        "content": "SANTIAGO  Sept 28 Chile sees no obstacles to approving Albemarle Corp's request for an increase in its annual lithium production limit  given the high prices for the metal used in electric car batteries  a government official told Reuters on Thursday.",
        "date": "09282017",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "UPDATE 1-Chile sees no obstacle to Albemarle request to hike lithium output cap "
    },
    {
        "content": "SANTIAGO  Sept 28 The head of Chile's CORFO state development agency told Reuters on Thursday he saw \"no reason to object\" to Albemarle Corp's request for an increase in its annual lithium production limit.",
        "date": "09282017",
        "name": "Albemarle Corporation",
        "news_type": "normal",
        "symbol": "ALB",
        "title": "Chile sees no obstacle to Albemarle request to hike lithium output cap "
    },
    {
        "content": "SANTIAGO  Sept 15 Albemarle Corp has asked Chile to increase the U.S. miner's lithium production limit in the country  it said on Friday  amid high global prices for the mineral used in batteries as demand for electric vehicles surges.",
        "date": "09152017",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "Albemarle asks Chile to raise lithium production limit "
    },
    {
        "content": "* Albemarle growth story continues with strong second quarter performance",
        "date": "08072017",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle Q2 earnings per share $0.92 "
    },
    {
        "content": "LONDON Producers of processed lithium - an essential element for batteries used in electric cars - are agreeing long-term contracts with their customers to fund the investments needed to address a looming shortfall.",
        "date": "08072017",
        "name": "Albemarle Corporation",
        "news_type": "normal",
        "symbol": "ALB",
        "title": "Lithium processors prepare to meet demand in era of electric car "
    },
    {
        "content": "* Laurie Brlas elected to Albemarle Corporation board of directors",
        "date": "06262017",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Laurie Brlas gets elected to Albemarle board of directors "
    },
    {
        "content": "A federal appeals court on Tuesday said Bayer CropScience LP may pursue part of its lawsuit accusing Albemarle Corp of breach-of-contract and bad faith by imposing steep price increases on methyl bromide as the companies were preparing to sever their 16-year sales agreement.",
        "date": "06202017",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "Bayer CropScience lawsuit over 'bad faith' Albemarle pricing is revived "
    },
    {
        "content": "* Albemarle reports 10% growth in first quarter 2017 net sales",
        "date": "05032017",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle reports Q1 sales $722.1 million "
    },
    {
        "content": "* Talison  a JV between co and tianqi lithium  has approved expansion of lithium concentrate production at greenbushes  Australia spodumene mine",
        "date": "03162017",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle positioned to double lithium concentrate production at Greenbushes facility "
    },
    {
        "content": "* CEO Luther Kissam's FY 2016 total compensation $8.4 million versus $5.3 million in FY 2015 - sec filing  Source text : http://bit.ly/2nvMLLB Further company coverage:",
        "date": "03172017",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle CEO Luther Kissam's FY 2016 total compensation was $8.4 mln "
    },
    {
        "content": "SANTIAGO  Feb 27 A lithium plant at Albemarle's operations in northern Chile was operating partially on Monday after the firm evacuated workers due to heavy weekend rains  the company told Reuters.",
        "date": "02272017",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "Albemarle's Chilean lithium plant partially closed after storm "
    },
    {
        "content": "* Declared a quarterly dividend of $0.32 per share  an increase of 5 pct over previous quarterly dividend of $0.305  Source text for Eikon:  Further company coverage:",
        "date": "02232017",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle raises dividend for 23rd consecutive year "
    },
    {
        "content": "* Albemarle and Tianqi terminate option for indirect minority interest in Albemarle subsidiary",
        "date": "02222017",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle and Tianqi terminate option for indirect minority interest in Albemarle subsidiary "
    },
    {
        "content": "LONDON  Feb 3 There's lithium in them there Cornish hills!",
        "date": "02062017",
        "name": "Albemarle Corporation",
        "news_type": "normal",
        "symbol": "ALB",
        "title": "RPT-COLUMN-Cornish lithium dreams may die in South America's salt lakes: Andy Home "
    },
    {
        "content": "* Albemarle Corporation announces early tender results of maximum tender offers for certain outstanding debt securities",
        "date": "01192017",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle says as of Jan. 18  total of EUR 533.3 mln aggregate principal amount of 2021 notes had been validly tendered "
    },
    {
        "content": "* Albemarle corporation announces redemption of all outstanding 3.000 pct senior notes due 2019",
        "date": "01112017",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle Corp announces redemption of all outstanding 3 pct senior notes due 2019 "
    },
    {
        "content": "* Albemarle corporation announces pricing and expiration of any and all tender offers",
        "date": "01112017",
        "name": "Albemarle Corporation",
        "news_type": "normal",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle announces pricing of tender offers "
    },
    {
        "content": "* Albemarle reports third quarter 2016 results and raises full year guidance",
        "date": "11072016",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle posts Q3 adj. earnings $0.91/shr from continuing operations "
    },
    {
        "content": "* Albemarle board of directors elects Luke Kissam as chairman",
        "date": "11082016",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle board of directors elects Luke Kissam as chairman "
    },
    {
        "content": "* Albemarle signs agreement for exclusive exploration and acquisition rights to lithium resource in Argentina",
        "date": "09122016",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle signs agreement for exclusive exploration  acquisition rights to lithium resource in Argentina "
    },
    {
        "content": "* Q2 adjusted earnings per share $0.93 from continuing operations",
        "date": "08032016",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle Q2 adjusted EPS $0.93 from cont ops "
    },
    {
        "content": "FRANKFURT  July 27 Global chemicals maker BASF  warned that the $3.2 billion it paid for Albemarle Corp's surface-treatment unit Chemetall set a high bar for future returns from the investment.",
        "date": "07272016",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BASF says must run Chemetall very well to avoid buyer's remorse "
    },
    {
        "content": "* Fortive Corp will be added to S&P 500 after the close of trading on Friday  July 1  replacing Columbia Pipeline Group Inc  Source text: (http://bit.ly/28QcVli)   (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06232016",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-S&P Dow Jones indices says Albemarle  Fortive to join S&P 500 "
    },
    {
        "content": "* Fitch says Albemarle's planned sale of its Chemetall surface treatment business to BASF is neutral to co's ratings  Source text (http://bit.ly/1YwNMxN) Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780; )",
        "date": "06172016",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Fitch says Albemarle's planned sale of Chemetall surface treatment business to BASF is neutral to ratings "
    },
    {
        "content": "June 17 Chemical producer Albemarle Corp  said it would sell its surface-treatment unit to Germany's BASF SE  the world's largest chemical producer  for $3.2 billion in cash.",
        "date": "06172016",
        "name": "Albemarle Corporation",
        "news_type": "normal",
        "symbol": "ALB",
        "title": "Albemarle to sell surface treatment unit to BASF for $3.2 bln "
    },
    {
        "content": "* Albemarle enters into definitive agreement to sell Chemetall Surface Treatment Business to BASF for $3.2 billion",
        "date": "06172016",
        "name": "Albemarle Corporation",
        "news_type": "normal",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle to sell Chemetall Surface Treatment Business to BASF for $3.2 bln "
    },
    {
        "content": "LONDON  June 6 Lithium is shaping up to be The Next Big Thing.",
        "date": "06062016",
        "name": "Albemarle Corporation",
        "news_type": "normal",
        "symbol": "ALB",
        "title": "COLUMN-What price lithium  the metal of the future? Andy Home "
    },
    {
        "content": "* Albemarle to name Brian Tessin vice president  tax & chief tax counsel  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06012016",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle to name Brian Tessin vice president  tax & chief tax counsel "
    },
    {
        "content": "The Chemetall unit is a global supplier of specialty chemicals used in surface treatment of metals and plastics.",
        "date": "05132016",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "Albemarle exploring sale of unit worth $3 billion: Bbg "
    },
    {
        "content": "* Sets quarterly dividend of $0.305 per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05102016",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle sets quarterly dividend of $0.305/share "
    },
    {
        "content": "May 13 Lithium producer Albemarle Corp  is exploring the sale of its surface-treatment division for about $3 billion  Bloomberg reported  according to people familiar with the matter. (http://bloom.bg/1OoF3Lj)",
        "date": "05132016",
        "name": "Albemarle Corporation",
        "news_type": "normal",
        "symbol": "ALB",
        "title": "Albemarle exploring sale of unit worth $3 bln - Bbg "
    },
    {
        "content": "* Albemarle names David Ryan treasurer  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05102016",
        "name": "Albemarle Corporation",
        "news_type": "normal",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle names David Ryan treasurer "
    },
    {
        "content": "* Albemarle Corp said to explore sale of $3 billion surface-treatment unit - Bloomberg  citing sources",
        "date": "05132016",
        "name": "Albemarle Corporation",
        "news_type": "normal",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle said to explore sale of $3 bln surface-treatment unit- Bloomberg "
    },
    {
        "content": "* Albemarle names Karen Narwold executive vice president and chief administrative officer",
        "date": "05132016",
        "name": "Albemarle Corporation",
        "news_type": "normal",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle names Karen Narwold executive VP  chief administrative officer "
    },
    {
        "content": "* Albemarle to discontinue production of HBCD-based flame retardants to focus on supplying Greencrest\u007f Polymeric fire safety solutions",
        "date": "05042016",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "BRIEF-Albemarle to discontinue production of HBCD-based flame retardants "
    },
    {
        "content": "SANTIAGO  Feb 2 U.S. lithium producer Albemarle has signed a deal with Chile to significantly increase its output of lithium at a time when interest in the mineral that powers electric car batteries is heating up.",
        "date": "02022016",
        "name": "Albemarle Corporation",
        "news_type": "topStory",
        "symbol": "ALB",
        "title": "U.S. lithium firm Albemarle plans to more than double Chile output "
    },
    {
        "content": "By Sinead Carew and Caroline Valetkevitch     Dec 7 World leaders gathered in Paris for climate talks are pledging billions of dollars to improve the environment  but green-company investors are not impressed by the promises  seeing little immediate benefit to the companies they buy.     As the two-week United Nations summit enters its final phase  clean energy stocks have gained little ground  and several fund managers say they have not been doing any additional buying as a result o",
        "date": "12072015",
        "name": "Albemarle Corporation",
        "news_type": "normal",
        "symbol": "ALB",
        "title": "Investors shrug off climate summit investment pledges "
    },
    {
        "content": "MILAN/NEW YORK  Nov 30 Electric carmaker Tesla Motors  lithium supplier Albemarle and solar-panel efficiency specialist SolarEdge Technologies  are among winners from a growing focus on emissions as climate-change talks get under way  Goldman Sachs told clients.",
        "date": "11302015",
        "name": "Albemarle Corporation",
        "news_type": "normal",
        "symbol": "ALB",
        "title": "UPDATE 1-Goldman backs low-emissions stocks as climate talks start "
    },
    {
        "content": "MILAN  Nov 30 Electric carmaker Tesla  lithium supplier Albemarle and tyremaker Continental  are among relative winners from a growing focus on emissions as climate-change talks get underway  Goldman Sachs told clients.",
        "date": "11302015",
        "name": "Albemarle Corporation",
        "news_type": "normal",
        "symbol": "ALB",
        "title": "Goldman backs low-emissions stocks as climate talks start "
    },
    {
        "content": "HOUSTON  Oct 2 Four people were injured on Friday in a small explosion at an industrial plant in Pasadena  Texas used by solar company SunEdison Inc  emergency management officials said.",
        "date": "10022015",
        "name": "Albemarle Corporation",
        "news_type": "normal",
        "symbol": "ALB",
        "title": "Four people injured in blast at Texas SunEdison plant "
    },
    {
        "content": "Thomson Reuters April 28  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04282015",
        "name": "Albemarle Corporation",
        "news_type": "normal",
        "symbol": "ALB",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    }
]