[
    {
        "content": "STOCKHOLM  Oct 26 Swedish auto safety gear maker Autoliv  reported quarterly core operating earnings just below market expectations on Thursday and slightly reduced its like-for-like sales forecast for the year.",
        "date": "10262017",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "UPDATE 1-Autoliv trims 2017 sales growth forecast  keeps profitability view "
    },
    {
        "content": "STOCKHOLM  Oct 26 Swedish auto safety gear maker Autoliv  reported quarterly operating earnings below market forecasts on Thursday and said it expected like-for-like sales to be virtually flat in the final quarter of the year.",
        "date": "10262017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "RPT-Autoliv Q3 profit lags forecast  sees flat like-for-like sales "
    },
    {
        "content": "STOCKHOLM  Oct 26 Swedish auto safety gear maker Autoliv  reported quarterly operating earnings below market forecasts on Thursday and said it expected like-for-like sales to be virtually flat in the final quarter of the year.",
        "date": "10262017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Autoliv Q3 profit lags forecast  sees flat like-for-like sales "
    },
    {
        "content": "* SOUTH AFRICA'S COMPETITION COMMISSION - AUTOLIV HAS AGREED TO PAY AN ADMINISTRATIVE PENALTY OF ALMOST 150 MILLION RAND FOLLOWING ITS ADMISSION OF HAVING CONTRAVENED THE COMPETITION ACT",
        "date": "10092017",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-South Africa's Competition Commission fines Autoliv near 150 mln rand "
    },
    {
        "content": "* AUTOLIV TO ACQUIRE LIDAR AND TIME OF FLIGHT CAMERA EXPERTISE",
        "date": "09282017",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv to buy assets of Swedish LiDar specialist "
    },
    {
        "content": "STOCKHOLM Sweden's Autoliv   said it planned to split into two listed companies  with one focused on high-tech safety gear to capture the rapid growth toward self-driving vehicles  lifting its shares on Thursday.",
        "date": "09142017",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "Autoliv lifts shares with plans to split into two listed companies "
    },
    {
        "content": "* One firm to focus on products such as airbags and seatbelts",
        "date": "09142017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "UPDATE 3-Autoliv lifts shares with plans to split into two listed companies "
    },
    {
        "content": "* Autoliv to supply geely radar systems for autonomous driving",
        "date": "09142017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv wins order from Geeely for autonomous driving radar systems "
    },
    {
        "content": "* Adient and Autoliv agree to collaborate on safety  comfort and convenience for seats of the future Source text for Eikon: Further company coverage:",
        "date": "09122017",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Adient  Autoliv to collaborate on seats of the future "
    },
    {
        "content": "* Carlson mentioned as possible candidate for Ericsson chairmanship by Swedish business daily Dagens Industri",
        "date": "09142017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv CEO says 2019 sales target largely based on already booked orders "
    },
    {
        "content": "* Autoliv   Adient collaborating to address vehicle seating challenges presented by designs for future car and incorporation of autonomous driving Source text for Eikon: Further company coverage: (Reporting by Stockholm Newsroom)",
        "date": "09122017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv and Adient to collaborate "
    },
    {
        "content": "STOCKHOLM  Sept 14 Autoliv   the world's largest maker of airbags and seatbelts  said on Thursday it would carry out a strategic review aimed at splitting its business into two separate companies.",
        "date": "09142017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Autoliv eyes split of business into two listed companies "
    },
    {
        "content": "* Autoliv  - will outline its strategy for shareholder value creation and sets 2020 targets for passive safety and electronics as standalone entities",
        "date": "09142017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv sets financial targets for 2020 "
    },
    {
        "content": "* Autoliv initiates strategic review of separating its business segments  passive safety and electronics",
        "date": "09142017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv to make strategic review to split business "
    },
    {
        "content": "* Autoliv starts collaboration with Seeing Machines to develop driver monitoring systems (DMS)",
        "date": "08172017",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv teams up with Seeing Machines to develop driver monitoring systems "
    },
    {
        "content": "* Says today declared a quarterly dividend of 60 cents per share for Q4 of 2017 Source text for Eikon: Further company coverage: (Reporting by Stockholm Newsroom)",
        "date": "08142017",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv declares dividend of 60 cents per share for Q4 "
    },
    {
        "content": "* SAYS IT WILL WORK IN COLLABORATION WITH AUTOLIV TO DELIVER NEXT GENERATION DRIVER MONITORING SYSTEMS (DMS) FOR AUTONOMOUS VEHICLES Source text for Eikon: Further company coverage: (Bangalore.newsroom@thomsonreuters.com)",
        "date": "08172017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Seeing Machines says will work in collaboration with Autoliv "
    },
    {
        "content": "STOCKHOLM Swedish auto safety gear maker Autoliv   halved its underlying full-year growth forecast on Friday on the back of weaker car markets in China and North America and raised its forecast for costs.",
        "date": "07212017",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "Autoliv shares hit as outlook deteriorates "
    },
    {
        "content": "July 21 Autoliv  CEO and Chairman Jan Carlson in Reuters interview:",
        "date": "07212017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv CEO says still expects passive safety R D&E costs to peak in H2 "
    },
    {
        "content": "* Autoliv Inc qtrly operating income $216.4 versus $212.7 million in Q2 2016",
        "date": "07212017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv Inc reports Q2 adjusted earnings per share $1.44 "
    },
    {
        "content": "STOCKHOLM  July 21 Swedish auto safety gear maker Autoliv  reported quarterly operating earnings in line with expectations but forecast little growth in like-for-like sales and a slightly softer margin for the third quarter.",
        "date": "07212017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Autoliv Q2 operating profit in line  sees subdued growth in Q3 "
    },
    {
        "content": "DETROIT  July 12 Autotech Ventures  a Silicon Valley venture capital firm  said it had raised $120 million from automotive companies and financial investors for a fund that will invest in startups working on transportation services and digital vehicle technology.",
        "date": "07122017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "New Silicon Valley fund aims to connect auto companies and startups "
    },
    {
        "content": "* Autoliv enters LiDAR commercialization agreement with Velodyne",
        "date": "07032017",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv signs agreement with Velodyne over self-driving cars "
    },
    {
        "content": "STOCKHOLM  June 27 Volvo Cars and Swedish car safety supplier Autoliv have signed a deal with U.S. firm Nvidia Corp  best known for its graphics technology in computer games  to develop software systems for self-driving cars.",
        "date": "06272017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Volvo and Autoliv team up with Nvidia for self-driving cars "
    },
    {
        "content": "SAN FRANCISCO  June 26 Chipmaker Nvidia Corp announced on Monday it was partnering with Volvo Cars and Swedish auto supplier Autoliv to develop self-driving car technology for vehicles due to hit the market by 2021.",
        "date": "06272017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "REFILE--Nvidia partners with Volvo  auto suppliers  in self-driving deals "
    },
    {
        "content": "STOCKHOLM  June 9 The near-collapse of Japanese airbag maker Takata has cleared the road for bigger rival Swedish rival Autoliv but higher orders have yet to translate into share price gains.",
        "date": "06092017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Autoliv says will accelerate beyond $12 billion sales target "
    },
    {
        "content": "STOCKHOLM  June 1 Swedish auto safety gear maker Autoliv  in May resumed buying back its own shares  the first time in over two years the company uses its mandate  information posted on its website showed.",
        "date": "06012017",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "Autoliv resumed share buy backs in May "
    },
    {
        "content": "* Says declared a quarterly dividend of 60 cents per share for Q3 of 2017 Source text for Eikon: Further company coverage: (Stockholm Newsroom)",
        "date": "05092017",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv declares dividend of 60 cents/share for Q3 "
    },
    {
        "content": "April 28 Autoliv   the world's biggest maker of airbags and seatbelts  is expecting higher raw material costs this year than previously forecast  Chief Executive Jan Carlson told Reuters after the firm posted earnings above expecations on Friday.",
        "date": "04282017",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "Autoliv sees raw material cost rise of $38 mln in 2017 "
    },
    {
        "content": "STOCKHOLM  April 28 Autoliv   the world's biggest maker of airbags and seatbelts  reported a bigger-than-expected rise in quarterly earnings but flagged uncertainty about global vehicle production ahead  sending its shares slightly lower.",
        "date": "04282017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Autoliv flags auto output uncertainty after profit tops forecast "
    },
    {
        "content": "* Q1 operating profit $218 million (205) versus mean forecast $206 million in Reuters poll Source text for Eikon: Further company coverage: (Stockholm Newsroom)",
        "date": "04282017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv Q1 operating profit beats forecasts "
    },
    {
        "content": "* Says for Q2 of 2017  company expects organic sales to increase by around 2% and an adjusted operating margin of around 8.5%",
        "date": "04282017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv sees organic sales growth  roughly flat margin in Q2 "
    },
    {
        "content": "* CEO Jan Carlson's total compensation for 2016 $4.5 million versus. $3.2 million in 2015 - SEC filing  Source text for Eikon: Further company coverage:",
        "date": "03242017",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv CEO Jan Carlson's total compensation for 2016 $4.5 mln "
    },
    {
        "content": "SAN FRANCISCO  March 14 To understand Intel's $15.3 billion proposed acquisition of Israel's Mobileye  imagine the data created and compiled by a self-driving car scanning the road and objects around it as a potential source of revenue.",
        "date": "03152017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Intel bets on selling Mobileye data  with maps a first test "
    },
    {
        "content": "* Says has declared a quarterly dividend of 60 cents per share for the second quarter 2017  an increase of 2 cents per share from the previous level  Source text for Eikon:  Further company coverage:   (Stockholm Newsroom)",
        "date": "02202017",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv declares quarterly dividend of 60 cents/share "
    },
    {
        "content": "* Shares fall 7 pct   (Writes through with detail  background  share)",
        "date": "02022017",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "UPDATE 2-Autoliv shares fall as heavy investments drag down earnings "
    },
    {
        "content": "* Autoliv Q4 operating profit $239 mln vs mean forecast $238 mln in Reuters poll and year-ago $281 mln",
        "date": "02022017",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv Q4 profit in line  organic growth below forecast "
    },
    {
        "content": "The following stocks may be affected by newspaper reports and other factors on Friday:",
        "date": "01132017",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "NORDIC STOCKS - Factors to watch on Jan 13 "
    },
    {
        "content": "TOKYO Takata Corp  has shortlisted Sweden's Autoliv Inc  and U.S. parts supplier Key Safety Systems as potential bidders for the Japanese airbag maker at the center of the world's biggest auto recall  Bloomberg reported.",
        "date": "11222016",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "Autoliv  Key Safety Systems preferred bidders for Takata: Bloomberg "
    },
    {
        "content": "TOKYO  Nov 22 Takata Corp has shortlisted Sweden's Autoliv Inc and U.S. parts supplier Key Safety Systems as potential bidders for the Japanese airbag maker at the centre of the world's biggest auto recall  Bloomberg reported.",
        "date": "11222016",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Autoliv  Key Safety Systems preferred bidders for Takata - Bloomberg "
    },
    {
        "content": "* Daicel is no longer a strong contender to take over Takata and car makers are instead looking with favor toward Autoliv - WSJ  citing sources  Source text: http://on.wsj.com/2fwA7aE",
        "date": "11162016",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Takata customers back rival Autoliv's takeover plan- WSJ "
    },
    {
        "content": "* Says declared an unchanged quarterly dividend of 58 cents per share for the first quarter of 2017",
        "date": "11032016",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv quarterly dividend unchanged at 58 cents/share "
    },
    {
        "content": "STOCKHOLM Autoliv    the world's biggest maker of airbags and seatbelts  reported a bigger-than-expected rise in quarterly earnings but said it expected flat like-for-like sales in the final three months of the year.",
        "date": "10272016",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "Autoliv third-quarter profit beats forecast  sees flat like-for-like sales "
    },
    {
        "content": "STOCKHOLM  Oct 27 Autoliv   the world's biggest maker of airbags and seatbelts  reported a bigger-than-expected rise in quarterly earnings but said it expected flat like-for-like sales in the final three months of the year.",
        "date": "10272016",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Autoliv Q3 profit beats forecast  sees flat like-for-like sales "
    },
    {
        "content": "* Says for Q4 of 2016  company expects organic sales to be flat compared to Q4 of 2015",
        "date": "10272016",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv sees flat organic sales in Q4 yr/yr "
    },
    {
        "content": "* Autoliv and Volvo Cars to create joint venture for autonomous driving",
        "date": "09062016",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv and Volvo Cars to set up autonomous driving JV "
    },
    {
        "content": "* Says files for a potential mixed shelf with u.s. sec; size undisclosed - sec filing  Source text for Eikon:  Further company coverage:",
        "date": "08172016",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv says files for a potential mixed shelf with U.S. SEC; size undisclosed "
    },
    {
        "content": "Aug 15 (Reuters) - * Autoliv Inc sets quarterly dividend of $0.58 per share Source text for Eikon: Further company coverage: ",
        "date": "08152016",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv sets quarterly dividend of $0.58 per share "
    },
    {
        "content": "* Says quarterly dividend of 58 cents per share for the fourth quarter of 2016",
        "date": "08152016",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv declares dividend "
    },
    {
        "content": "July 22 Autoliv   the world's top maker of auto safety gear  trimmed its 2016 margin outlook and said strong demand promted a need for higher capacity investments as it reported second-quarter earnings below market expectations.",
        "date": "07222016",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "UPDATE 2-Autoliv trims margin outlook as strong demand spurs investment need "
    },
    {
        "content": "* Says is seeing stronger order intake across the board within passive safety segment",
        "date": "07222016",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv: seeing strong order intake across board in passive safety-CEO "
    },
    {
        "content": "* Q2 operating income $213 million versus mean forecast $225 million in Reuters poll and year-ago $209 mln",
        "date": "07222016",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv Q2 profit lags forecast  sees softer margin in Q3 vs Q2 "
    },
    {
        "content": "* Autoliv has refinanced its existing revolving credit facility",
        "date": "07152016",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv says it has refinanced its existing revolving credit facility "
    },
    {
        "content": "* Autoliv has refinanced its existing revolving credit facility",
        "date": "07152016",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv refinances its revolving credit facility "
    },
    {
        "content": "* Autoliv says it supplied air bag inflators   (Adds recalls by geographic region for emissions defect; 90 pct of recalled air bag inflators in Prius models  updates share price)",
        "date": "06292016",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "UPDATE 4-Toyota recalls 3.37 mln cars over air bags  emissions control "
    },
    {
        "content": "* Says cooperating with Toyota in their voluntary recall of approximately 1.4 million vehicles of Toyota Prius and Lexus CT 200h",
        "date": "06292016",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv: cooperating with Toyota in recall  sees cost at lower end of $10-40 mln range "
    },
    {
        "content": "STOCKHOLM  June 29    * Auto safety gear maker Autoliv  confirms Toyota is recalling 1.4 million Prius cars equipped with its airbag inflators.",
        "date": "06292016",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Autoliv confirms involved in Toyota Prius recall  shares fall "
    },
    {
        "content": "* Autoliv CEO says sees boost from lower raw material costs of $28 million in 2016 versus previous forecast of around $40 million  Further company coverage:    (Reporting by Niklas Pollard)  (stockholm.newsroom@thomsonreuters.com; +46 (0)8-700 10 10;))",
        "date": "04292016",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv CEO sees raw materials boost of $28 million in 2016 "
    },
    {
        "content": "STOCKHOLM  April 29 Auto safety gear maker Autoliv  reported a bigger than expected rise in first quarter core earnings on Friday and raised its forecast for like-for-like sales this year while affirming its margin outlook.",
        "date": "04292016",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "RPT-Autoliv Q1 operating profit beats forecast "
    },
    {
        "content": "STOCKHOLM  April 29 Auto safety gear maker Autoliv  reported a bigger than expected rise in first quarter core earnings on Friday and raised its forecast for like-for-like sales this year while affirming its margin outlook.",
        "date": "04292016",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Autoliv Q1 operating profit beats forecast "
    },
    {
        "content": "* Nissin Kogyo JV's sales  operating margin for period April-December 2016 expected to be slightly lower than initially communicated",
        "date": "04012016",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv Inc - Nissin Kogyo JV's sales expected to be in range of $400-$450 mln "
    },
    {
        "content": "* Takata faces massive costs if responsible for faulty airbags   (Adds comment from Honda  context to airbag recall)",
        "date": "03292016",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "UPDATE 1-Takata plans to increase capital around Sept as recall costs mount-Kyodo "
    },
    {
        "content": "* Autoliv elects Leif Johansson as new board member  Source text for Eikon:  Further company coverage:    (Stockholm Newsroom)",
        "date": "02162016",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv names Leif Johansson as new board member "
    },
    {
        "content": "NEW YORK Facing a hostile Congress in an election year  President Barack Obama will be hard-pressed to push through many of the proposals in his final budget as U.S. leader.",
        "date": "02082016",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Corporate winners of Obama budget still face long odds "
    },
    {
        "content": "STOCKHOLM Swedish car safety gear maker Autoliv   said on Friday it expected like-for-like sales growth of 5 percent this year  well below market expectations  sending its shares sharply down.",
        "date": "01292016",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "Autoliv shares hit by soft growth forecast "
    },
    {
        "content": "* Sees 2016 organic sales growth of 5 pct vs mean forecast 8 pct",
        "date": "01292016",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "UPDATE 1-Autoliv shares hit by soft growth forecast "
    },
    {
        "content": "STOCKHOLM  Jan 29 Auto safety gear maker Autoliv   reported fourth quarter core earnings that beat market expectations on Friday and said it expected like-for-like sales to grow around 5 percent this year.",
        "date": "01292016",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "CORRECTED-Autoliv Q4 core profit beats forecast "
    },
    {
        "content": "* Says \u007ffor Q1 of 2016  company expects organic sales to increase by more than 10 percent and an adjusted operating margin of around 8.5 percent",
        "date": "01292016",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv sees more than 10 pct organic sales growth in Q1\u007f "
    },
    {
        "content": "The following stocks may be affected by newspaper reports and other factors on Monday:",
        "date": "01252016",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "NORDIC STOCKS - Factors to watch on Jan 25 "
    },
    {
        "content": "* Autoliv says \u007fboard declared a quarterly dividend of 56 cents per share for Q1 2016",
        "date": "12182015",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv says \u007fboard declared dividend of 56 cents/share for Q1 2016\u007f "
    },
    {
        "content": "* Says \u007fhas appointed Mikael Bratt as president of its Passive Safety business",
        "date": "12182015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv appoints Volvo truck boss Bratt as new head of Passive Safety "
    },
    {
        "content": "* Says Mats Backman  executive vice president and Chief Financial Officer  CFO  for Sandvik has decided to leave Sandvik to assume equivalent position as CFO for automotive safety supplier Autoliv",
        "date": "11252015",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Sandvik CFO Backman leaves for Autoliv "
    },
    {
        "content": "STOCKHOLM  Nov 11 Swedish car safety equipment maker Autoliv could capitalise on the crisis engulfing its rival Takata Corp by finally extending its global leadership to the one major auto hub it has been unable to dominate - Japan.",
        "date": "11102015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Takata air bag crisis hands Autoliv chance to go big in Japan "
    },
    {
        "content": "* Shares rise 5 pct   (Adds detail  CEO comment  updates shares)",
        "date": "10232015",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "UPDATE 1-Autoliv sees early positive signs from Chinese tax cut "
    },
    {
        "content": "STOCKHOLM  Oct 23 Auto safety gear maker Autoliv   reported third quarter core earnings that narrowly beat market expectations on Friday and said it expected like-for-like sales to grow around 7 percent this year  sending its shares higher.",
        "date": "10232015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Autoliv Q3 core profit just above forecast "
    },
    {
        "content": "BORAS  Sweden  Oct 1 Autoliv  the world's biggest maker of seat belts and airbags  is ready to cut more jobs in China to counter any downturn in demand while seeking to expand elsewhere to secure its dominant global market position.",
        "date": "10012015",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "UPDATE 1-Sweden's Autoliv ready to cut more staff in China as car sales stall "
    },
    {
        "content": "GOTHENBURG  Sweden  Oct 1 Auto safety gear maker Autoliv  targets $12 billion in sales by the end of the decade and could potentially reach $15 billion if it succeeds in grabbing additional market and acquisition opportunities  it said on Thursday.",
        "date": "10012015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Autoliv targets $12 bln in sales by end of the decade "
    },
    {
        "content": "* Says company further expects its restructuring costs to return to a normalized level averaging around 30 bps of sales from 2016 onward  down significantly from 2015 estimate of more than $90 million.",
        "date": "10012015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv aims for $12 bln in sales by end of decade "
    },
    {
        "content": "STOCKHOLM  Sept 9 Auto safety equipment maker Autoliv and Japan's Nissin Kogyo will form a joint venture involving the companies' brake businesses  Autoliv said on Wednesday.",
        "date": "09092015",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "Autoliv and Nissin Kogyo in brakes joint venture "
    },
    {
        "content": "* Autoliv inc says has entered into a definitive agreement to establish a joint venture (jv) with Nissin Kogyo",
        "date": "09092015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv says to form joint venture with Nissin Kogyo "
    },
    {
        "content": "TOKYO  Aug 25 Toyota Motor Corp said on Tuesday it is testing air-bag inflators made by Autoliv  and Nippon Kayaku Co as possible alternatives to potentially lethal parts supplied by Takata Corp.",
        "date": "08252015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Toyota says testing potential alternatives to Takata air-bag inflators "
    },
    {
        "content": "* Takata inflators linked to 8 deaths and more than 100 injuries",
        "date": "08212015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "EXCLUSIVE-Toyota to buy 13 mln air-bag inflators from Takata rival-sources "
    },
    {
        "content": "* Autoliv says declared a quarterly dividend of 56 cents per share for Q4 2015  Source text for Eikon:  Further company coverage:",
        "date": "08032015",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv declares Q4 dividend of 56 cents/share "
    },
    {
        "content": "* Autoliv CEO says best estimate is continued positive development for Chinese OEMs in H2",
        "date": "07172015",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv CEO still positive on Chinese OEMs "
    },
    {
        "content": "STOCKHOLM  July 17 Auto safety gear maker Autoliv  reported a bigger than expected rise in second quarter earnings on Friday and repeated its forecast to grow like-for-like sales by more than 6 percent this year.",
        "date": "07172015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Autoliv Q2 profit tops forecast  stands by 2015 outlook "
    },
    {
        "content": "STOCKHOLM  July 17 Auto safety gear maker Autoliv  reported a bigger than expected rise in second quarter earnings on Friday and repeated its forecast to grow like-for-like sales by more than 6 percent this year.",
        "date": "07172015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "RPT-Autoliv Q2 profit tops forecast  stands by 2015 outlook "
    },
    {
        "content": "SAO PAULO  July 7 Brazil's antitrust watchdog has opened an investigation into a suspected cartel involving local units of Japanese auto parts maker Takata Corp  and Swedish-American rival Autoliv Inc  citing potential price collusion in safety belts  airbags and steering wheels.",
        "date": "07072015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Brazil watchdog names Takata  Autoliv in price-fixing probe "
    },
    {
        "content": "DETROIT At least 400 000 of the 4 million replacement inflators for defective Takata air bags will need to be replaced again in U.S. vehicles  sources at the Japanese safety equipment maker and the U.S. safety watchdog told Reuters.",
        "date": "06042015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Exclusive: Takata  U.S. regulator can't say how many cars may have faulty air bags "
    },
    {
        "content": "At least 400 000 of the 4 million replacement inflators for defective Takata air bags will need to be replaced again in U.S. vehicles  sources at the Japanese safety equipment maker and the U.S. safety watchdog told Reuters.",
        "date": "06042015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Takata identifies at least 400 000 faulty air bag replacement units "
    },
    {
        "content": "* Says declared a quarterly dividend of 56 cents per share for the third quarter 2015  Source text for Eikon:  Further company coverage:",
        "date": "05062015",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv sets 56 cents/share quarterly dividend "
    },
    {
        "content": "STOCKHOLM Auto safety gear maker Autoliv   said on Wednesday it expected higher second-quarter sales growth after producing first quarter earnings above market expectations on the back of strong sales in Europe and lower overall costs.",
        "date": "04222015",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "Autoliv stands by 2015 outlook as profit beats forecast "
    },
    {
        "content": "STOCKHOLM  April 22 Auto safety gear maker Autoliv  said on Wednesday it expected higher second-quarter sales growth after producing first quarter earnings above market expectations on the back of strong sales in Europe and lower overall costs.",
        "date": "04222015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "UPDATE 1-Autoliv stands by 2015 outlook as profit beats forecast "
    },
    {
        "content": "STOCKHOLM  April 22 Auto safety gear maker Autoliv  posted first quarter earnings above market expectations on Wednesday and said it expected organic sales growth of around 6 percent in the second quarter.",
        "date": "04222015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Autoliv Q1 adjusted operating profit beats forecast "
    },
    {
        "content": "STOCKHOLM Auto safety gear maker Autoliv   said on Wednesday it had reached settlements in U.S. antitrust class action lawsuits at a total amount of $81 million.",
        "date": "03252015",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "Autoliv to pay $81 mln in U.S. antitrust probe "
    },
    {
        "content": "* Autoliv has reached agreements regarding additional settlements to resolve certain direct purchasers' global (including U.S.) or non-U.S. antitrust claims which were not covered by its earlier U.S. direct purchaser antitrust class action settlement",
        "date": "03252015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv reaches additional antitrust settlements "
    },
    {
        "content": "WASHINGTON  March 5 U.S. auto safety regulators are considering unprecedented steps to speed up the replacement of potentially deadly Takata Corp air bags in millions of cars that remain on American roads despite massive recalls initiated by automakers.",
        "date": "03052015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "NHTSA could tap unexercised authority to speed Takata recalls "
    },
    {
        "content": "* Autoliv elects new directors and declares increased dividend",
        "date": "02172015",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "BRIEF-Autoliv sets Q2 dividend to 56 cents per share  elects two new board members "
    },
    {
        "content": "* Sees 2015 adjusted operating margin 9.5 pct vs 9.1 pct in 2014",
        "date": "01292015",
        "name": "Autoliv Inc",
        "news_type": "topStory",
        "symbol": "ALV",
        "title": "UPDATE 1-Autoliv sees 2015 growth  better margins as Q4 beats forecast "
    },
    {
        "content": "STOCKHOLM  Jan 29 Auto safety gear maker Autoliv   posted fourth quarter earnings above market expectations on Thursday and said it expected organic sales growth of more than 6 percent this year.",
        "date": "01292015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "RPT-Autoliv Q4 operating profit beats forecast "
    },
    {
        "content": "STOCKHOLM  Jan 29 Auto safety gear maker Autoliv   posted fourth quarter earnings above market expectations on Thursday and said it expected organic sales growth of more than 6 percent this year.",
        "date": "01292015",
        "name": "Autoliv Inc",
        "news_type": "normal",
        "symbol": "ALV",
        "title": "Autoliv Q4 operating profit beats forecast "
    }
]