[
    {
        "content": "* Alexion receives new Japanese patent for Soliris® (eculizumab)  extending patent protection into 2027 and strengthening global patent portfolio Source text for Eikon: Further company coverage:",
        "date": "11062017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion receives new Japanese patent for Soliris "
    },
    {
        "content": "* Q3 earnings per share view $1.32 -- Thomson Reuters I/B/E/S",
        "date": "10262017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion reports Q3 non-GAAP earnings per share of $1.44 "
    },
    {
        "content": "* Interim analysis from phase 3 open-label extension study shows sustained benefits of Soliris (Eculizumab) treatment for patients with refractory generalized myasthenia gravis",
        "date": "09132017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "RPT-BRIEF-Alexion announces interim analysis from phase 3 open-label extension study of Soliris "
    },
    {
        "content": "* Interim analysis from phase 3 open-label extension study shows sustained benefits of Soliris (Eculizumab) treatment for patients with refractory generalized myasthenia gravis",
        "date": "09132017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "BRIEF-Interim analysis from phase 3 open-label extension study of Soliris "
    },
    {
        "content": "Alexion Pharmaceuticals Inc  said on Tuesday it would lay off about 20 percent of its workforce and sharpen its focus on its core rare disease drugs business  as it looks to restore investor confidence.",
        "date": "09122017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "Alexion Pharma to lay off 20 percent of workforce "
    },
    {
        "content": "* Drugmaker's shares down slightly (Adds details  analyst comment  updates share price)",
        "date": "09122017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "UPDATE 2-Alexion Pharma to lay off 20 pct of workforce "
    },
    {
        "content": "Sept 12 U.S. drugmaker Alexion Pharmaceuticals Inc said on Tuesday it would lay off about 20 percent of its global workforce in an effort to cut spending.",
        "date": "09122017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "Drugmaker Alexion to cut 20 pct of jobs "
    },
    {
        "content": "* Alexion announces restructuring to advance corporate strategy",
        "date": "09122017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion to reduce 20 pct of its global workforce "
    },
    {
        "content": "* Alexion receives three U.S. Patents for Soliris (eculizumab)  extending patent protection into 2027",
        "date": "08152017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion receives three U.S. Patents for Soliris (eculizumab)  extending patent protection into 2027 "
    },
    {
        "content": "* Third Point LLC takes share stake of 1.6 million shares in Blackrock Inc - SEC filing‍​",
        "date": "08112017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Third Point LLC takes share stake in Blackrock Inc  Alexion Pharmaceuticals "
    },
    {
        "content": "NEW YORK Alexion Pharmaceuticals Inc  posted a better than expected second-quarter profit on Thursday and raised its full-year forecast on strong sales of its expensive rare disease treatment Soliris.",
        "date": "07272017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "Alexion posts higher second-quarter earnings on strong Soliris sales "
    },
    {
        "content": "NEW YORK  July 27 Alexion Pharmaceuticals Inc posted a better than expected second-quarter profit on Thursday and raised its full-year forecast on strong sales of its expensive rare disease treatment Soliris.",
        "date": "07272017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "Alexion posts higher Q2 earnings on strong Soliris sales "
    },
    {
        "content": "* Arbutus announces conclusion of LNP license agreement with Alexion",
        "date": "07272017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "BRIEF-Arbutus announces conclusion of LNP license agreement with Alexion "
    },
    {
        "content": "* Blueprint Medicines to evaluate opportunities to advance rare disease discovery program in fibrodysplasia ossificans progressiva following discontinuation of collaboration with Alexion",
        "date": "07272017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "BRIEF-Blueprint Medicines to evaluate advance disease discovery program opportunities "
    },
    {
        "content": "* Says has reached national funding agreement with NICE & NHS England based on Managed Access Agreement",
        "date": "07052017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion reaches funding agreement with NICE and NHS England for Strensiq "
    },
    {
        "content": "* Alexion receives positive CHMP opinion for Soliris (eculizumab) for the treatment of patients with refractory Generalized Myasthenia Gravis (GMG) in the European Union",
        "date": "06232017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion receives positive CHMP opinion for Soliris in the EU "
    },
    {
        "content": "Alexion Pharmaceuticals Inc named long-time Biogen Inc Chief Financial Officer Paul Clancy to a similar position  effective July 31  as recently appointed CEO Ludwig Hantson steps up efforts to regain investor confidence.",
        "date": "06132017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "Alexion taps Biogen veteran Paul Clancy as CFO "
    },
    {
        "content": "June 13 Alexion Pharmaceuticals Inc named long-time Biogen Inc Chief Financial Officer Paul Clancy to a similar position  effective July 31  as recently appointed CEO Ludwig Hantson steps up efforts to regain investor confidence.",
        "date": "06132017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "UPDATE 1-Alexion taps Biogen veteran Paul Clancy as CFO "
    },
    {
        "content": "June 13 Alexion Pharmaceuticals Inc on Tuesday named Biogen Inc's Chief Financial Officer Paul Clancy as its finance head  effective July 31.",
        "date": "06132017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "REFILE-Alexion names Biogen's Paul Clancy as CFO "
    },
    {
        "content": "* Alexion Pharmaceuticals Inc - in connection with appointment as CFO  Paul Clancy will receive stock options valued about $1.2 million",
        "date": "06132017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion Pharmaceuticals in connection with appointment as CFO  Paul Clancy will receive stock options valued about $1.2 million "
    },
    {
        "content": "* Alexion Pharmaceuticals Inc - Clancy will succeed Dave Anderson  who will continue to serve as CFO until july 31  2017",
        "date": "06132017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion Pharmaceuticals names Paul Clancy as CFO "
    },
    {
        "content": "May 23 Alexion Pharmaceuticals Inc said on Tuesday its chief financial officer and research head would leave in the latest top level exits  sending the company's shares down 11 percent to a more-than-three-and-half year low.",
        "date": "05232017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "Alexion's shares plunge on latest top level exits "
    },
    {
        "content": "* Alexion Pharmaceuticals - long-term data confirm benefits of treatment with strensiq in adolescents and adults with hypophosphatasia through 5 years Source text for Eikon: Further company coverage:",
        "date": "05152017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion Pharmaceuticals says long-term data confirm benefits of Strensiq "
    },
    {
        "content": "SAO PAULO Brazilian police searched the Sao Paulo offices of drugmaker Alexion Pharmaceuticals Inc on Monday as part of a probe into its relationship with a patient advocacy group accused of filing fraudulent lawsuits to spur drug purchases.",
        "date": "05082017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "Brazilian police search Alexion offices in fraud probe "
    },
    {
        "content": "SAO PAULO  May 8 Brazilian police searched the Sao Paulo offices of drugmaker Alexion Pharmaceuticals Inc on Monday as part of a probe into its relationship with a patient advocacy group accused of filing fraudulent lawsuits to spur drug purchases.",
        "date": "05082017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "UPDATE 2-Brazilian police search Alexion offices in fraud probe "
    },
    {
        "content": "* Raises FY 2017 non-GAAP earnings per share view $5.10 to $5.30",
        "date": "04272017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion Pharmaceuticals Q1 non-GAAP earnings per share $1.38 "
    },
    {
        "content": "Alexion Pharmaceuticals Inc  on Monday named former Baxalta CEO Ludwig Hantson to its top job  as the rare-disease drug maker seeks to regain investor confidence following the exit of top management.",
        "date": "03272017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "Alexion Pharma names former Baxalta chief Ludwig Hantson CEO "
    },
    {
        "content": "March 27 Alexion Pharmaceuticals Inc on Monday named former Baxalta CEO Ludwig Hantson to its top job  as the rare-disease drug maker seeks to regain investor confidence following the exit of top management.",
        "date": "03272017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "UPDATE 2-Alexion Pharma names former Baxalta chief Ludwig Hantson CEO "
    },
    {
        "content": "March 27 Alexion Pharmaceuticals Inc said it named former Baxalta head Ludwig Hantson chief executive officer as the rare-disease drug maker looks to steady the ship following the exit of its top management.",
        "date": "03272017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "Alexion Pharma names former Baxalta head Ludwig Hantson CEO "
    },
    {
        "content": "* Alexion appoints Ludwig Hantson  Ph.D.  as chief executive officer",
        "date": "03272017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion appoints Ludwig Hantson as chief executive officer "
    },
    {
        "content": "* Alexion submits application in Japan for soliris® (eculizumab) as a potential treatment for patients with refractory generalized myasthenia gravis (gmg)  Source text for Eikon: Further company coverage:",
        "date": "03222017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion submits application for soliris as treatment for refractory generalized myasthenia gravis "
    },
    {
        "content": "* Arbutus licenses LNP delivery technology to Alexion for use in single messenger RNA product candidate",
        "date": "03162017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Arbutus licenses LNP delivery technology to Alexion "
    },
    {
        "content": "Alexion Pharmaceuticals Inc said on Monday it has initiated a company-wide restructuring that will affect about 7 percent of its workforce.",
        "date": "03132017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "Alexion to cut 7 percent of workforce "
    },
    {
        "content": "March 13 Alexion Pharmaceuticals Inc said on Monday it has initiated a company-wide restructuring that will affect about 7 percent of its workforce.",
        "date": "03132017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "Alexion to cut 7 pct of workforce "
    },
    {
        "content": "* Alexion Pharmaceuticals says initiated companywide restructuring",
        "date": "03132017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion Pharma says initiated companywide restructuring "
    },
    {
        "content": "* 2017 rev forecast just under estimates  but reassuring-analysts",
        "date": "02162017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "UPDATE 3-Alexion Pharma's revenue forecast allays investor fears "
    },
    {
        "content": "* Alexion CFO says \"we're preparing for potential tax reform\": conf call",
        "date": "02162017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion interim CEO says looking for opportunities in M&A front "
    },
    {
        "content": "Alexion Pharmaceuticals Inc  forecast 2017 revenue that will likely quell investor concerns  as the drugmaker looks to steady the ship following the recent exits of its chief executive and chief financial officer.",
        "date": "02162017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "Alexion Pharma revenue forecast allays fears about Soliris' future "
    },
    {
        "content": "* Alexion reports fourth quarter and full year 2016 results and provides financial guidance for 2017",
        "date": "02162017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion Pharmaceuticals posts Q4 adj. earnings $1.26/shr "
    },
    {
        "content": "Feb 16 Alexion Pharmaceuticals Inc  reported an 18.5 percent rise in fourth-quarter revenue  helped by demand for its costly rare blood disorder drug Soliris.",
        "date": "02162017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "Alexion Pharma's revenue rises 18.5 pct "
    },
    {
        "content": "* Alexion interim CEO says they are not up for sale - JPM Healthcare conf",
        "date": "01092017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion interim CEO says company is not up for sale - conf "
    },
    {
        "content": "* Alexion submits U.S. and EU applications seeking approval of Soliris\u007f (eculizumab) as a treatment for patients with refractory generalized myasthenia gravis (gMG)",
        "date": "01092017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion submits U.S. and EU applications seeking approval of Soliris as a treatment for patients with refractory generalized myasthenia gravis "
    },
    {
        "content": "Alexion Pharmaceuticals Inc  on Wednesday filed its delayed third-quarter 2016 financial report with U.S. regulators and said an investigation into allegations regarding sales practices found no need to restate previous financial results.",
        "date": "01052017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "Alexion says no need to revise earnings  shares rise "
    },
    {
        "content": "* FDA grants orphan drug designation to ALXN1210 for the treatment of patients with paroxysmal nocturnal hemoglobinuria (pnh)",
        "date": "01062017",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-FDA grants orphan drug designation to ALXN1210 "
    },
    {
        "content": "Alexion Pharmaceuticals Inc's chief executive officer and chief financial officer resigned  a month after the drugmaker said it was investigating allegations related to sales practices of its flagship drug.",
        "date": "12122016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "Alexion Pharmaceuticals says CEO  CFO resign  shares slump "
    },
    {
        "content": "* Alexion Pharmaceuticals Inc - new data from an analysis of patients enrolled in global atypical hemolytic uremic syndrome (aHUS) registry",
        "date": "11172016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion Pharmaceuticals announces new data "
    },
    {
        "content": "* Paulson & Co cuts share stake in Alexion Pharmaceuticals Inc by 15.0 percent to 227 700 shares",
        "date": "11142016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Paulson & Co cuts share stake in Alexion Pharmaceuticals  Johnson & Johnson "
    },
    {
        "content": "* Alexion says new long-term data show reduction in liver fibrosis and cirrhosis in cohort of patients with lysosomal acid lipase deficiency treated with Kanuma",
        "date": "11112016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion says new long-term data show reduction in liver fibrosis and cirrhosis in cohort of patients with lysosomal acid lipase deficiency treated with Kanuma "
    },
    {
        "content": "* Files for non-timely 10-Q  Source text for Eikon: [ID:http://bit.ly/2fTifZm] Further company coverage:",
        "date": "11092016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion Pharmaceuticals files for non-timely 10-Q "
    },
    {
        "content": "Nov 10 Alexion Pharmaceuticals Inc said on Wednesday it was  investigating allegations made by a former employee regarding sales practices involving its flagship and costly blood disorder drug Soliris.",
        "date": "11092016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "UPDATE 1-Alexion says investigating Soliris sales practices "
    },
    {
        "content": "Nov 10 Alexion Pharmaceuticals Inc said on Wednesday it was conducting an investigation into allegations made by a former employee regarding sales practices of blood disorder drug Soliris.",
        "date": "11092016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "Alexion says investigating Soliris sales practices "
    },
    {
        "content": "* Q3 earnings per share view $1.17 -- Thomson Reuters I/B/E/S",
        "date": "10272016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion Pharmaceuticals posts Q3 non-gaap EPS of $1.23 "
    },
    {
        "content": "* Alexion initiates simultaneous registration trials of ALXN1210 for patients with paroxysmal nocturnal hemoglobinuria (PNH) and atypical hemolytic uremic syndrome (ahus)",
        "date": "10272016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion initiates simultaneous registration trials of ALXN1210 for patients with PNH and AHUS "
    },
    {
        "content": "* European Commission grants orphan drug designation to ALXN1007 for the treatment of patients with graft-versus-host disease (GVHD)",
        "date": "08292016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion gets orphan drug designation for ALXN1007 "
    },
    {
        "content": "* Fda recently completed  routine current good manufacturing practice inspection of Co's Smithfield  Rhode island manufacturing facility",
        "date": "08082016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion Pharmaceuticals-FDA recently completed  routine current good manufacturing practice inspection of Co's Smithfield  Rhode Island Manufacturing Facility "
    },
    {
        "content": "* FY2016 earnings per share view $5.05  revenue view $3.06 billion -- Thomson Reuters I/B/E/S",
        "date": "07282016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion reports Q2 non-gaap EPS $1.13 "
    },
    {
        "content": "* Alexion presents new SBC-103 (Rhnaglu enzyme) phase 1/2 data on brain MRI and neurocognitive assessments in patients with mucopolysaccharidosis iiib (MPS IIIB)",
        "date": "07142016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion presents new SBC-103 data in patients with MPS iiiB "
    },
    {
        "content": "* Late-Breaking data presented at EHA: all patients with pnh treated with once-monthly dosing of ALXN1210 in phase 1/2 study exhibit rapid and sustained reductions in ldhSays announced today that interim data were presented from a phase 1/2 study of ALXN1210",
        "date": "06102016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion Pharmaceuticals announces data from phase 1/2 study of ALXN1210 "
    },
    {
        "content": "* Dow up 0.3 pct  S&P up 0.3 pct  Nasdaq down 0.04 pct   (Updates to late afternoon)",
        "date": "06072016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "US STOCKS-S&P edges closer to record high; energy shares lead "
    },
    {
        "content": "Alexion Pharmaceuticals Inc said its drug Soliris  already approved in the United States for the treatment of two rare blood disorders  missed its primary goal in a late-stage trial.",
        "date": "06062016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "Alexion shares slump as drug misses goal in late-stage trial "
    },
    {
        "content": "June 6 Alexion Pharmaceuticals Inc said its drug Soliris  already approved in the United States for the treatment of two rare blood disorders  missed its primary goal in a late-stage trial.",
        "date": "06062016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "UPDATE 1-Alexion shares slump as drug misses goal in late-stage trial "
    },
    {
        "content": "June 6 Alexion Pharmaceuticals Inc said its drug Soliris  already approved in the United States for the treatment of two rare blood disorders  missed its primary goal in a late-stage trial  sending its shares down 9 percent in extended trade.",
        "date": "06062016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "Alexion drug misses goal in late-stage trial "
    },
    {
        "content": "* Alexion announces topline results from Phase 3 regain study of eculizumab (soliris) in patients with refractory generalized myasthenia gravis (GMG)",
        "date": "06062016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion announces topline results from Phase 3 regain study of eculizumab "
    },
    {
        "content": "* Says CFO Vikas Sinha FY 2015 total compensation $4.7 million versus $7 million in FY 2014 - sec filing",
        "date": "03312016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion says CEO David Hallal's 2015 compensation was $14.7 mln "
    },
    {
        "content": "* Kanuma receives marketing approval in japan for treatment of patients with lysosomal acid lipase deficiency  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "03282016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Alexion Pharmaceuticals Kanuma receives marketing approval in Japan "
    },
    {
        "content": "LONDON  Feb 18 An enzyme treatment from Alexion Pharmaceuticals costing 491 992 pounds ($704 630) a year may be worth using in babies with a rare disorder but does not represent good value for all patients  Britain's healthcare cost watchdog said.",
        "date": "02182016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "UK cost agency queries value of $700 000-a-year Alexion drug "
    },
    {
        "content": "LONDON  Feb 18 An enzyme treatment from Alexion Pharmaceuticals costing 491 992 pounds ($704 630) a year may be worth using in babies with a rare disorder but does not represent good value for all patients  Britain's healthcare cost watchdog said.",
        "date": "02182016",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "UPDATE 1-UK cost agency queries value of $700 000-a-year Alexion drug "
    },
    {
        "content": "The U.S. Food and Drug Administration on Tuesday approved Alexion Pharmaceutical Inc's treatment for an ultra-rare and potentially fatal genetic disorder.",
        "date": "12082015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "FDA approves Alexion drug for ultra-rare disease "
    },
    {
        "content": "Dec 8 The U.S. Food and Drug Administration on Tuesday approved Alexion Pharmaceutical Inc's treatment for an ultra-rare and potentially fatal genetic disorder.",
        "date": "12082015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "UPDATE 2-FDA approves Alexion drug for ultra-rare disease "
    },
    {
        "content": "Dec 8 The U.S. Food and Drug Administration on Tuesday approved Alexion Pharmaceutical Inc's treatment for a rare and potentially fatal genetic disorder.",
        "date": "12082015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "FDA approves Alexion Pharma's enzyme-replacement therapy "
    },
    {
        "content": "LONDON  Dec 3 A new drug to treat a rare inherited bone disorder from Alexion Pharmaceuticals  that costs more than $550 000 a year for each patient has been deemed too expensive by Britain's health cost watchdog NICE.",
        "date": "12032015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "Alexion's $550 000 bone drug too expensive for Britain "
    },
    {
        "content": "Oct 23 The U.S. Food and Drug Administration on Friday approved Alexion Pharmaceuticals Inc's Strensiq  a treatment for a rare kind of metabolic bone disorder.",
        "date": "10232015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "UPDATE 1-FDA approves Alexion's metabolic bone disorder drug "
    },
    {
        "content": "The U.S. Food and Drug Administration on Friday approved Alexion Pharmaceuticals Inc's Strensiq  a treatment for a rare kind of metabolic disorder.",
        "date": "10232015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "FDA approves Alexion Pharma's metabolic disorder drug "
    },
    {
        "content": "Sept 4 Alexion Pharmaceuticals Inc said the U.S. Food and Drug Administration would delay by three months its decision on approving a key drug the company got through the acquisition of Synageva BioPharma Corp.",
        "date": "09042015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "FDA delays decision on key Alexion drug by 3 months "
    },
    {
        "content": "NEW YORK Ten weeks after closing its $8.4 billion purchase of Synageva BioPharma Corp  Alexion Pharmaceuticals Inc on Tuesday announced European approval for the key drug acquired through the deal  an enzyme-replacement therapy for an ultra-rare  life threatening disease.",
        "date": "09012015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "Alexion gets EU approval for drug acquired in Synageva deal "
    },
    {
        "content": "NEW YORK  Sept 1 Ten weeks after closing its $8.4 billion purchase of Synageva BioPharma Corp  Alexion Pharmaceuticals Inc on Tuesday announced European approval for the key drug acquired through the deal  an enzyme-replacement therapy for an ultra-rare  life threatening disease.",
        "date": "09012015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "UPDATE 1-Alexion gets EU approval for drug acquired in Synageva deal "
    },
    {
        "content": "Sept 1 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "09012015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "NEW YORK  Sept 1 Ten weeks after closing its $8.4 billion purchase of Synageva BioPharma Corp  Alexion Pharmaceuticals Inc on Tuesday announced European approval for the key drug acquired through the deal  an enzyme-replacement therapy for an ultra-rare  life threatening disease.",
        "date": "09012015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "CORRECTED-Alexion gets EU approval for drug acquired in Synageva deal "
    },
    {
        "content": "* New manufacturing line to be constructed at Lonza's existing Portsmouth  NH (USA) plant",
        "date": "07022015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "BRIEF-Lonza announces additional long-term agreement with Alexion "
    },
    {
        "content": "LONDON  June 26 New drugs from Novartis  and Alexion won a green light from European regulators on Friday  delivering a boost to both drugmakers and offering new treatment options for cancer and rare diseases.",
        "date": "06262015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "Europe gives green light to new Novartis  Alexion drugs "
    },
    {
        "content": "Alexion Pharmaceuticals Inc on Wednesday said it agreed to buy Synageva BioPharma Corp for $8.4 billion  more than twice its market value  to expand its offering of potentially high-priced medicines for rare diseases. | Video ",
        "date": "05062015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "topStory",
        "symbol": "ALXN",
        "title": "Alexion to bolster rare disease offering with $8.4 billion deal "
    },
    {
        "content": "The hefty premium Alexion Pharmaceuticals Inc has agreed to pay to acquire Synageva BioPharma Corp highlights how the popularity of so-called orphan drug makers is leading to valuations many investors now deem frothy.",
        "date": "05062015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "Rich Synageva M&A premium epitomizes appetite for orphan drugs "
    },
    {
        "content": "May 6 The hefty premium Alexion Pharmaceuticals Inc has agreed to pay to acquire Synageva BioPharma Corp highlights how the popularity of so-called orphan drug makers is leading to valuations many investors now deem frothy.",
        "date": "05062015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "CORRECTED-Rich Synageva M&A premium epitomizes appetite for orphan drugs "
    },
    {
        "content": "May 6 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "05062015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Alexion offers $225.92 per Synageva share in cash and stock",
        "date": "05062015",
        "name": "Alexion Pharmaceuticals Inc",
        "news_type": "normal",
        "symbol": "ALXN",
        "title": "UPDATE 4-Alexion to bolster rare disease offering with $8.4 bln deal "
    }
]