[
    {
        "content": "* AMD appoints Mark Durcan to board of directors Source text for Eikon: Further company coverage:",
        "date": "11012017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-AMD appoints Mark Durcan to board of directors "
    },
    {
        "content": "* AMD delivers semi-custom graphics chip for new Intel processor",
        "date": "11062017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-AMD delivers semi-custom graphics chip for new Intel processor "
    },
    {
        "content": "Nov 6 Bitter rivals Advanced Micro Devices Inc and Intel Corp on Monday unveiled a partnership that will help the chipmakers take on Nvidia Corp.",
        "date": "11062017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "Rivals AMD  Intel partner to take on Nvidia "
    },
    {
        "content": "* Intel and AMD team up on PC chips to battle Nvidia- WSJ  citing sources‍​",
        "date": "11062017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "BRIEF-Intel and AMD team up on PC chips to battle Nvidia- WSJ "
    },
    {
        "content": " (Corrects headline and paragraph 1 to clarify that revenue is forecast to drop in Q4 from Q3  not from the year-earlier period. Removes incorrect reference to first revenue drop in seven quarters)",
        "date": "10252017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "AMD forecasts sequential revenue drop in fourth quarter  shares plummet "
    },
    {
        "content": "* Advanced Micro Devices Inc sees Q4 non-GAAP gross margin to be approximately 35 pct‍​",
        "date": "10242017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-AMD sees Q4 adj gross margin to be about 35 pct‍​ "
    },
    {
        "content": "* Futures down: Dow 8 pts  S&P 3 pts  Nasdaq 9.75 pts (Adds details and comment  updates price)",
        "date": "10252017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "US STOCKS-Tepid earnings to pressure Wall St at open "
    },
    {
        "content": "* Futures: Dow up 2 pts  S&P off 2.25 pts  Nasdaq down 7.25 pts",
        "date": "10252017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "US STOCKS-Futures flat after downbeat earnings "
    },
    {
        "content": "* Q3 earnings per share view $0.08 -- Thomson Reuters I/B/E/S",
        "date": "10242017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "BRIEF-AMD reports Q3 earnings per share $0.07 "
    },
    {
        "content": "Oct 24 Advanced Micro Devices Inc reported a 25.7 percent rise in quarterly revenue on Tuesday  its sixth straight quarter rise  aided by a slew of launches such as the Epyc processors for servers and a new range of Ryzen desktop processors.",
        "date": "10242017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "Chipmaker AMD reports 25.7 pct rise in quarterly revenue "
    },
    {
        "content": "Sept 21 GlobalFoundries  which fabricates chips for Advanced Micro Devices Inc  said on Thursday it had not received any commitment from Tesla to work with any autonomous driving technology or product  contradicting an earlier media report.",
        "date": "09212017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "GlobalFoundries says no commitment from Tesla on chip deal "
    },
    {
        "content": "Sept 21 GlobalFoundries  which fabricates chips for Advanced Micro Devices Inc  said on Thursday that Tesla had not committed to working with it on any autonomous driving technology or product  contradicting an earlier media report.",
        "date": "09212017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "UPDATE 1-GlobalFoundries says no commitment from Tesla on chip deal "
    },
    {
        "content": "BRUSSELS U.S. electronic chipmaker GlobalFoundries has asked European antitrust regulators to investigate market leader TSMC   accusing the Taiwanese firm of unfair competition  an industry source said on Monday.",
        "date": "09212017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "Exclusive: Chipmaker GlobalFoundries asks EU to investigate bigger rival TSMC - source "
    },
    {
        "content": "Electric carmaker Tesla Inc  is working with Advanced Micro Devices Inc  to develop its own artificial intelligence chip for self-driving cars  CNBC reported on Wednesday  citing a source familiar with the matter.",
        "date": "09202017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "Tesla working with AMD to develop chip for self-driving car: CNBC "
    },
    {
        "content": "Sept 20 Electric carmaker Tesla Inc is working with Advanced Micro Devices Inc to develop its own artificial intelligence chip for self-driving cars  CNBC reported on Wednesday  citing a source familiar with the matter.",
        "date": "09202017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "Tesla working with AMD to develop chip for self-driving car-CNBC "
    },
    {
        "content": "* Regenxbio announces completion of dosing of first cohort in Phase I clinical trial of RGX-314 gene therapy for wet AMD",
        "date": "09202017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "BRIEF-Regenxbio announces completion of dosing of first cohort in Phase I clinical trial of RGX-314 gene therapy for wet AMD "
    },
    {
        "content": "* Advanced Micro Devices Inc - ‍AMD and Baidu announced a collaboration focused on optimizing software for amd radeon instinct gpus in baidu datacenters​ Source text for Eikon: Further company coverage:",
        "date": "08282017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-Advanced Micro Devices  Baidu enters into collaboration "
    },
    {
        "content": "ABU DHABI  Aug 4 Abu Dhabi’s Mubadala Investment Company on Friday said it sold a 3.9 percent stake in Advanced Micro Devices in its second sale of shares in the U.S.-based semiconductor company this year.",
        "date": "08042017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "Abu Dhabi’s Mubadala sells second stake in U.S. chipmaker AMD "
    },
    {
        "content": "Advanced Micro Devices Inc  forecast current-quarter revenue above analysts' estimates and raised its full-year expectations  betting on robust demand for its graphics chips and its new Ryzen processors for PCs.",
        "date": "07252017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "Chipmaker AMD forecasts current-quarter revenue above estimates "
    },
    {
        "content": "July 25 Advanced Micro Devices Inc forecast current-quarter revenue above analysts' estimates and raised its full-year expectations  betting on robust demand for its graphics chips and its new Ryzen processors for PCs.",
        "date": "07252017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "UPDATE 1-Chipmaker AMD forecasts current-quarter revenue above estimates "
    },
    {
        "content": "* Biotime receives DSMB approval to start third patient cohort in clinical trial for dry-AMD; commences patient enrollment in the U.S.",
        "date": "07252017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "BRIEF-Biotime receives DSMB approval to start third patient cohort in clinical trial for dry-AMD commences patient enrollment in the U.S. "
    },
    {
        "content": "July 25 Chipmaker Advanced Micro Devices Inc reported a 19 percent rise in quarterly revenue on Tuesday  boosted by demand for its graphics chips and its new Ryzen processors for PCs.",
        "date": "07252017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "Chipmaker AMD's revenue rises 19 pct "
    },
    {
        "content": "* Mubadala Development Company reports 16.9 percent stake in Advanced Micro Devices as of July 1 versus 14.8 percent stake as of March 3 - SEC filing Source text: (http://bit.ly/2sGJWum) Further company coverage:",
        "date": "07052017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-Mubadala Development reports 16.9 pct stake in AMD as of July 1 vs previous stake of 14.8 pct "
    },
    {
        "content": "* AMD appoints Abhi Y. Talwalkar to board of directors Source text for Eikon: Further company coverage:",
        "date": "07032017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-Advanced Micro Devices appoints Abhi Talwalkar to board "
    },
    {
        "content": "* AMD selected by the U.S. Department of energy to help drive next-generation supercomputing hardware architecture Source text for Eikon: Further company coverage:",
        "date": "06152017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-AMD selected by the U.S. Department of energy to help drive next-generation supercomputing hardware architecture "
    },
    {
        "content": "SAN FRANCISCO  June 6 Shares of Advanced Micro Devices surged nearly 9 percent on Tuesday boosted by strong demand for its chips from cryptocurrency miners  leaving short sellers at a loss for the year.",
        "date": "06062017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "AMD rallies as cryptocurrency miners snap up graphics chips "
    },
    {
        "content": "* Indexes up: Dow 0.17 pct  S&P 0.12 pct  Nasdaq 0.06 pct (Updates to close of U.S. market)",
        "date": "05022017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "US STOCKS-Wall St edges up on heavy earnings day; Fed on tap "
    },
    {
        "content": "* Dow up 0.04 pct  S&P down 0.05 pct  Nasdaq down 0.09 pct (Updates to late afternoon)",
        "date": "05022017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "US STOCKS-Wall St staggers sideways as Apple helps  autos drag "
    },
    {
        "content": "Advanced Micro Devices Inc  reported an 18.3 percent jump in quarterly revenue  largely in line with analysts' estimates  but the chipmaker's second-quarter gross margins forecast raised some concerns.",
        "date": "05012017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "AMD's revenue rises 18.3 percent  but margin forecast disappoints "
    },
    {
        "content": "May 1 Advanced Micro Devices Inc reported an 18.3 percent jump in quarterly revenue  largely in line with analysts' estimates  but the chipmaker's second-quarter gross margins forecast raised some concerns.",
        "date": "05012017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "UPDATE 2-AMD's revenue rises 18.3 pct  but margin forecast disappoints "
    },
    {
        "content": "* Q1 earnings per share view $-0.04 -- Thomson Reuters I/B/E/S",
        "date": "05012017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "BRIEF-AMD reports Q1 loss per share $0.08 "
    },
    {
        "content": "May 1 Chipmaker Advanced Micro Devices Inc reported a smaller quarterly loss on Monday  fueled by demand for its latest Ryzen processors and its graphics chips.",
        "date": "05012017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "Chipmaker AMD's quarterly loss narrows "
    },
    {
        "content": "* OHR Pharmaceutical provides update on ongoing squalamine clinical trial in Wet-Amd",
        "date": "04102017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-OHR Pharmaceutical provides update on ongoing squalamine clinical trial in WET-AMD "
    },
    {
        "content": "* Advanced Micro Devices - co  units  ATI Technologies ULC entered into fifth amendment amended and restated loan and security agreement dated April 14  2015",
        "date": "03212017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-Advanced Micro Devices  units  ATI Technologies entered into 5th amendment amended and restated loan and security agreement dated April 14  2015 "
    },
    {
        "content": "WASHINGTON  March 17 The U.S. International Trade Commission said on Friday it had voted to open an investigation of certain graphics systems and components used in televisions  smartphones  tablets and other consumer electronics.",
        "date": "03172017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "USITC opens probe of graphics components in TVs  smartphones "
    },
    {
        "content": "* BioTime expands opregen® clinical trial in dry-amd with opening of first us sites",
        "date": "03132017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-Biotime expands OpRegen clinical trial in dry-AMD with opening of first US sites "
    },
    {
        "content": "* Mubadala Development Company PJSC reports 14.8 percent stake in Advanced Micro Devices Inc as of March 3  2017  - SEC filing",
        "date": "03062017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-Mubadala Development Company reports 14.8 pct stake in Advanced Micro Devices - SEC filing "
    },
    {
        "content": "* Advanced Micro Devices Inc - CEO Lisa Su's 2016 compensation was $11.7 million versus $7.4 million in 2015 - sec filing  Source text (http://bit.ly/2nfI3O2) Further company coverage:",
        "date": "03082017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-Advanced Micro Devices CEO Lisa Su's 2016 compensation was $11.7 mln vs. $7.4 mln in 2015 "
    },
    {
        "content": "ABU DHABI  March 5 Abu Dhabi investment fund Mubadala Development Co sold nearly a third of its stake in Advanced Micro Devices  booking a tiny gain on its investments in the micro chip maker.",
        "date": "03052017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "Abu Dhabi's Mubadala sells part stake in AMD for $613 mln "
    },
    {
        "content": "* Initiated strategic realignment of research and development resources from pre-clinical Axitinib development program to DME clinical development program",
        "date": "02272017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-Clearside Biomedical says realignment for Axitinib for treatment of wet AMD towards DME program "
    },
    {
        "content": "* Advanced Micro Devices Inc - For the full year 2017  expect \"to grow annual revenue  expand gross margin and deliver non-GAAP net income\"",
        "date": "01312017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-Advanced Micro Devices sees Q1 non-GAAP gross margin to be about 33 pct "
    },
    {
        "content": "Jan 31 Advanced Micro Devices Inc on Tuesday posted a smaller-than-expected quarterly loss and gave a strong revenue forecast for the current quarter  boosted by demand for its graphic chips used in gaming consoles and a stabilizing PC market.",
        "date": "01312017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "UPDATE 1-AMD posts smaller loss  gives strong forecast on graphic chips demand "
    },
    {
        "content": "Jan 31 Chipmaker Advanced Micro Devices Inc  reported a smaller loss for the fourth quarter as its revenue was boosted by strong demand for its graphic chips used in gaming consoles and a stabilizing PC market.",
        "date": "01312017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "RPT-AMD posts narrower loss on demand for graphic chips "
    },
    {
        "content": "* AMD reports fourth quarter and annual 2016 financial results",
        "date": "01312017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "BRIEF-AMD reports Q4 and annual 2016 financial results "
    },
    {
        "content": "Jan 31 Chipmaker Advanced Micro Devices Inc  reported a smaller loss for the fourth quarter as its revenue was boosted by strong demand for its graphic chips used in gaming consoles and a stabilizing PC market.",
        "date": "01312017",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "AMD posts narrower loss on demand for graphic chips "
    },
    {
        "content": "Chipmaker Advanced Micro Devices Inc reported a better-than-expected 23.2 percent increase in quarterly revenue  helped by higher demand for graphics chips used in gaming consoles.",
        "date": "10202016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "AMD revenue beats on demand for chips used in gaming consoles "
    },
    {
        "content": "Oct 20 Chipmaker Advanced Micro Devices Inc  reported a better-than-expected 23.2 percent increase in quarterly revenue  helped by higher demand for graphics chips used in gaming consoles.",
        "date": "10202016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "UPDATE 1-AMD revenue beats on demand for chips used in gaming consoles "
    },
    {
        "content": "* Now expect full year 2016 revenue to be up approximately 6% from 2015 based on the midpoint of Q4 2016 revenue guidance",
        "date": "10202016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "BRIEF-Advanced Micro Devices now expect FY16 revenue to be up about 6% from 2015 "
    },
    {
        "content": "Oct 20 Chipmaker Advanced Micro Devices Inc  reported a 23.2 pct percent rise in quarterly revenue as demand jumped for its graphics chips used in gaming consoles.",
        "date": "10202016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "AMD revenue up 23.2 pct as demand grows for chips used in gaming consoles "
    },
    {
        "content": "* Q3 revenue $1.307 billion versus i/b/e/s view $1.21 billion",
        "date": "10202016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "BRIEF-Advanced Micro Devices reports Q3 non-gaap earnings per share $0.03 "
    },
    {
        "content": "* AMD collaborates with Alibaba Cloud to deliver cloud computing services based on AMD Radeon PRO GPU Technologies  Source text for Eikon:  Further company coverage:",
        "date": "10142016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-AMD collaborates with Alibaba Cloud to deliver cloud computing services "
    },
    {
        "content": "* AMD announces early results of cash tender offers and consent",
        "date": "09232016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-AMD announces early results of cash tender offers and consent "
    },
    {
        "content": "* Amd announces pricing and upsize of $700 million of convertible senior notes and pricing of public offering of $600 million of common stock",
        "date": "09092016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-AMD announces pricing and upsizes offerings "
    },
    {
        "content": "* S&P - Advanced Micro Devices Inc. Sr. convertible notes rated 'CCC'; ratings affirmed on equity offering; outlook stable",
        "date": "09072016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-S&P says Advanced Micro Devices Inc. Sr. Convertible notes rated 'CCC' ratings affirmed on equity offering; outlook stable "
    },
    {
        "content": "* AMD announces multi-year amendment to the wafer supply agreement with GlobalFoundries",
        "date": "08312016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-AMD announces multi-year amendment to the wafer supply agreement with GlobalFoundries "
    },
    {
        "content": "WASHINGTON Wells Fargo  Advanced Micro Devices and Fifth Third Bank have in recent years agreed to settlement deals that seek to muzzle former employees in ways that some lawyers said could violate U.S. whistleblower protection laws.",
        "date": "08252016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "Companies made deals that could run afoul of U.S. whistleblower rules "
    },
    {
        "content": "WASHINGTON Wells Fargo   Advanced Micro Devices  and Fifth Third Bank  have in recent years agreed to settlement deals that seek to muzzle former employees in ways that some lawyers said could violate U.S. whistleblower protection laws.",
        "date": "08252016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "Exclusive: Companies made deals that could run afoul of U.S. whistleblower rules "
    },
    {
        "content": "* For the full year 2016  expect revenue to grow low single digit percentage year-over-year",
        "date": "07212016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-Advanced Micro Devices expects 2016 capital expenditures of about $80 mln "
    },
    {
        "content": "* Q2 revenue $1.027 billion versus i/b/e/s view $951.3 million",
        "date": "07212016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "BRIEF-AMD Q2 non-GAAP loss per share $0.05 "
    },
    {
        "content": "Advanced Micro Devices Inc's forecast implied that the struggling chipmaker could post a surprise rise in current quarter revenue  ending a run of six quarters of declines  helped by strong demand for its chips and a new licensing deal.",
        "date": "04212016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "AMD flags possible stop to revenue declines  shares soar "
    },
    {
        "content": "April 21 Advanced Micro Devices Inc's  forecast implied that the struggling chipmaker could post a surprise rise in current quarter revenue  ending a run of six quarters of declines  helped by strong demand for its chips and a new licensing deal.",
        "date": "04212016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "UPDATE 2-AMD flags possible stop to revenue declines  shares soar "
    },
    {
        "content": "April 21 Advanced Micro Devices Inc's  quarterly revenue handsomely beat Wall Street estimates and the chipmaker said it signed a $293 million licensing agreement with a Chinese investment group.",
        "date": "04212016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "CORRECTED-UPDATE 1-AMD revenue beats  company signs $293 mln licensing agreement "
    },
    {
        "content": "* Accelerates availability of mobile 7th generation AMD A-Series processors",
        "date": "04052016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "BRIEF-Advanced Micro Devices announces early availability of 7th generation AMD A-Series processors "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 14 (Fitch) Fitch Ratings has downgraded and withdrawn the  ratings for Advanced Micro Devices  Inc. (AMD) including the Long-term Issuer  Default Rating (IDR) to 'CCC' from 'B-'.  See the full list of ratings at the  end of this release Fitch's actions affect about $2.2 billion of total funded debt. A rating Outlook  is not assigned at the 'CCC' IDR level. Fitch has withdrawn AMD's ratings for  commercial reasons. Fitch ",
        "date": "03142016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "Fitch Downgrades AMD to 'CCC'; Withdraws Ratings "
    },
    {
        "content": "Feb 17 Associated Press has partnered with chipmaker Advanced Micro Devices Inc to produce virtual reality-based content to create lifelike environments built around news and documentaries.",
        "date": "02172016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "AP partners with AMD to produce VR news content "
    },
    {
        "content": "* Shares fall 6 pct after market   (Adds analyst comment  CEO quote  details)",
        "date": "01192016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "UPDATE 2-AMD revenue forecast misses estimates on China slowdown "
    },
    {
        "content": "Advanced Micro Devices forecast first-quarter revenue below analysts' estimates  due to lower demand for its graphic chips used in consoles and an economic slowdown in China.",
        "date": "01192016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "AMD revenue forecast misses market estimates "
    },
    {
        "content": "Jan 19 Chipmaker Advanced Micro Devices Inc  reported a 22.7 percent fall in quarterly revenue  the sixth straight quarter of decline  as the company struggles with falling demand from PC makers.",
        "date": "01192016",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "AMD revenue falls 22.7 pct "
    },
    {
        "content": "SEOUL Tech giant Samsung Electronics Co Ltd will start making new chips for Advanced Micro Devices (AMD) Inc next year  South Korea's Electronic Times reported on Tuesday citing unnamed sources.",
        "date": "12222015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "Samsung Electronics to start making new chips for AMD in 2016: Electronic Times "
    },
    {
        "content": "SEOUL  Dec 22 Tech giant Samsung Electronics Co Ltd will start making new chips for Advanced Micro Devices (AMD) Inc next year  South Korea's Electronic Times reported on Tuesday citing unnamed sources.",
        "date": "12222015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "Samsung Elec to start making new chips for AMD in 2016 -Electronic Times "
    },
    {
        "content": "Advanced Micro Devices Inc said on Thursday it would sell most of its assembly and testing operations in two Asian cities  as the struggling chipmaker looks to cut spending amid weak demand for its processors for personal computer.",
        "date": "10152015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "AMD to sell some testing operations  gives weak revenue forecast "
    },
    {
        "content": "* Shares volatile in extended trading  last down 0.5 pct   (Adds details on transaction  company's forecast)",
        "date": "10152015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "UPDATE 2-AMD to sell some testing operations  gives weak revenue forecast "
    },
    {
        "content": "Oct 15 Chipmaker Advanced Micro Devices Inc's  revenue fell for the fifth straight quarter due to continued weak demand from PC makers for its processors.",
        "date": "10152015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "Chipmaker AMD's revenue falls for fifth quarter in a row "
    },
    {
        "content": "Struggling chipmaker Advanced Micro Devices Inc said it would cut about 500 jobs  or 5 percent of its global workforce  as it looks to rein in costs amid weak demand for its chips used in personal computers and intense competition.",
        "date": "10012015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "Chipmaker AMD to cut 500 global jobs  take $42 million charge "
    },
    {
        "content": "Oct 1 Struggling chipmaker Advanced Micro Devices Inc said it would cut about 500 jobs  or 5 percent of its global workforce  as it looks to rein in costs amid weak demand for its chips used in personal computers and intense competition.",
        "date": "10012015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "UPDATE 2-Chipmaker AMD to cut 500 global jobs  take $42 mln charge "
    },
    {
        "content": "Oct 1 Chipmaker Advanced Micro Devices Inc  said it would cut 5 percent of its global workforce as part of a restructuring plan.",
        "date": "10012015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "Chipmaker AMD to cut 5 pct of global workforce "
    },
    {
        "content": "Sept 11 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "09112015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "SAN FRANCISCO A two-day rally in the lowly shares of Advanced Micro Devices Inc may be squeezing short sellers  who recently increased their bets against the chipmaker.",
        "date": "07292015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "Bounce in AMD's stock may put pressure on short sellers "
    },
    {
        "content": "Chipmaker Advanced Micro Devices Inc lowered its revenue estimate for the second quarter  below analysts' average estimate  saying the demand for personal computers was weaker-than-expected.",
        "date": "07062015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "Chipmaker AMD cuts revenue estimate  citing weak PC sales "
    },
    {
        "content": "* Indexes down: Dow 0.5 pct  S&P 0.4 pct  Nasdaq 1 pct   (Adds details  updates prices)",
        "date": "07072015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "US STOCKS-Wall St lower on China concerns; Greece watched "
    },
    {
        "content": "* Stock falls as much as 15 pct in extended trading   (Adds analyst comment  background)",
        "date": "07062015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "UPDATE 2-Chipmaker AMD cuts revenue estimate  citing weak PC sales "
    },
    {
        "content": "* Indexes down: Dow 1.15 pct  S&P 1.12 pct  Nasdaq 1.73 pct   (Adds details  comment  updates prices)",
        "date": "07072015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "US STOCKS-Wall St drops as China hits commodities  Greece crisis drags "
    },
    {
        "content": "* Indexes down: Dow 0.24 pct  S&P 0.22 pct  Nasdaq 0.45 pct   (Updates to open)",
        "date": "07072015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "US STOCKS-Wall St lower in choppy trading as Greece summit looms "
    },
    {
        "content": "* Futures up: Dow 27 pts  S&P 4.25 pts  Nasdaq 3.5 pts   (Adds details  comment  update prices)",
        "date": "07072015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "US STOCKS-Wall St set to open up as Greece summit looms "
    },
    {
        "content": "Chipmaker Advanced Micro Devices is at the initial stage of reviewing whether to split itself in two or spin off a business  seeking to reverse its fortunes and take on rival Intel Corp  according to three people familiar with the matter.",
        "date": "06192015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "Exclusive: Advanced Micro Devices mulling breakup  spinoff - sources "
    },
    {
        "content": "U.S. chipmaker Advanced Micro Devices Inc reported a bigger-than-expected adjusted loss and a steep fall in sales for the first quarter and said it expected weak demand for personal computers to continue for some time.",
        "date": "04162015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "AMD loss bigger than expected as PC sales remain weak "
    },
    {
        "content": "April 16 U.S. chipmaker Advanced Micro Devices Inc reported a bigger-than-expected adjusted loss and a steep fall in sales for the first quarter and said it expected weak demand for personal computers to continue for some time.",
        "date": "04162015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "UPDATE 2-AMD loss bigger than expected as PC sales remain weak "
    },
    {
        "content": "April 16 U.S. chipmaker Advanced Micro Devices Inc reported a 26.2 percent fall in quarterly revenue  hurt by continued weak PC and graphic card sales and intense competition from Intel Corp.",
        "date": "04162015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "AMD revenue falls as PC sales continue to decline "
    },
    {
        "content": "NEW YORK  April 1 U.S. chipmaker Advanced Micro Devices must face claims that it committed securities fraud by hiding problems with the 2011 launch of a new computer processor that eventually led to a $100 million writedown  a federal judge in Oakland  California  ruled.",
        "date": "04012015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "Advanced Micro Devices must face securities fraud lawsuit-ruling "
    },
    {
        "content": "NEW YORK U.S. chipmaker Advanced Micro Devices must face claims that it committed securities fraud by hiding problems with the 2011 launch of a new computer processor that eventually led to a $100 million writedown  a federal judge in Oakland  California  ruled.",
        "date": "04012015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "Advanced Micro Devices must face securities fraud lawsuit: ruling "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 02 (Fitch) Fitch Ratings has affirmed the long-term Issuer  Default Rating (IDR) for Advanced Micro Devices Inc. (NYSE: AMD) at 'B-'. The  Rating Outlook is Stable.  Fitch's actions affect approximately $2.6 billion of total debt  including the  undrawn portion of the company's revolving credit facility (RCF). A full list of  ratings follows the end of this commentary. The ratings and Outlook reflect Fitch's expectatio",
        "date": "02022015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "Fitch Affirms AMD's IDR at 'B-'; Outlook Stable "
    },
    {
        "content": "U.S. chipmaker Advanced Micro Devices Inc  forecast weaker-than-expected first-quarter revenue and said it taking steps to return its computing and graphics businesses to a \"healthy trajectory\" from the second quarter.",
        "date": "01212015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "AMD first-quarter revenue forecast disappoints "
    },
    {
        "content": "U.S. chipmaker Advanced Micro Devices Inc  forecast weaker-than-expected first-quarter revenue and said it taking steps to return its computing and graphics businesses to a \"healthy trajectory\" from the second quarter.",
        "date": "01202015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "topStory",
        "symbol": "AMD",
        "title": "AMD first-quarter revenue forecast disappoints "
    },
    {
        "content": "Jan 20 U.S. chipmaker Advanced Micro Devices Inc  forecast weaker-than-expected first-quarter revenue and said it taking steps to return its computing and graphics businesses to a \"healthy trajectory\" from the second quarter.",
        "date": "01202015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "UPDATE 1-AMD first-quarter revenue forecast disappoints "
    },
    {
        "content": "Jan 20 U.S. chipmaker Advanced Micro Devices Inc  reported a 22 percent fall in quarterly revenue  hurt by continued weak PC and graphic card sales and intense competition from Intel Corp.",
        "date": "01202015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "AMD revenue falls as PC sales continue to fall "
    },
    {
        "content": "SAN FRANCISCO  Jan 12 Chipmaker Advanced Micro Devices announced the departure of three senior executives on Monday following recent layoffs and the appointment of a new CEO.",
        "date": "01122015",
        "name": "Advanced Micro Devices Inc",
        "news_type": "normal",
        "symbol": "AMD",
        "title": "Chipmaker AMD says three senior executives stepping down "
    }
]