[
    {
        "content": "* Amgen launches the Enbrel Mini single-dose prefilled cartridge with autotouch reusable autoinjector that is ergonomically designed for patients",
        "date": "11172017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen launches Enbrel Mini with Autotouch in U.S. "
    },
    {
        "content": "* Amgen receives positive CHMP opinion to expand use of Nplate® (romiplostim) in pediatric patients with chronic immune thrombocytopenic purpura",
        "date": "11102017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen receives positive CHMP opinion to expand use of Nplate in pediatric patients with chronic immune thrombocytopenic purpura "
    },
    {
        "content": "* Temasek Holdings (Private) Ltd takes share stake of 982 057 Class A shares in Vantiv Inc - SEC filing",
        "date": "11142017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Temasek Holdings takes share stake in Vantiv Inc  raises share stake in Amgen "
    },
    {
        "content": "* Amgen and Allergan receive positive CHMP opinion for ABP 215 (biosimilar bevacizumab) for the treatment of certain types of cancer",
        "date": "11102017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen and Allergan receive positive chmp opinion for ABP 215 "
    },
    {
        "content": "* Amgen and Novartis announce expanded collaboration with Banner Alzheimer's Institute in pioneering prevention program",
        "date": "11022017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen  Novartis announce expanded collaboration with Banner Alzheimer's Institute "
    },
    {
        "content": "* Announces new analyses of high-risk patient subgroups from Repatha (evolocumab) cardiovascular outcomes study at AHA Scientific Sessions 2017 Source text for Eikon: Further company coverage:",
        "date": "11062017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen announces new analyses of high-risk patient subgroups "
    },
    {
        "content": "TOKYO  Oct 31 Japan's Kirin Holdings Co Ltd said on Tuesday it would sell its share in a pharmaceutical research joint venture with California-based drugmaker Amgen Inc for $780 million.",
        "date": "10312017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Japan's Kirin cashes out of Amgen drug joint venture "
    },
    {
        "content": "* ‍Kirin-Amgen joint venture to become wholly-owned subsidiary of Amgen​",
        "date": "10312017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-‍Kirin-Amgen joint venture to become wholly-owned subsidiary of Amgen​ "
    },
    {
        "content": "* Says terminating shareholders' agreement of joint venture with Amgen",
        "date": "10312017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Kirin says terminating shareholders' agreement of JV with Amgen "
    },
    {
        "content": "* Phase 3 A.R.R.O.W. study of once-weekly KYPROLIS(carfilzomib) regimen meets primary endpoint of progression-free survival in relapsed and refractory multiple myeloma patients",
        "date": "10232017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen's Phase 3 A.R.R.O.W. study of once-weekly KYPROLIS regimen meets primary endpoint "
    },
    {
        "content": "* Amgen announces appointment of Wanda M. Austin to board of directors",
        "date": "10242017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen appoints Wanda Austin to board of directors "
    },
    {
        "content": "Oct 25 Amgen Inc reported higher-than-expected third quarter profit on Wednesday as lower research and other costs and higher operating margins helped offset sales declines in some of its biggest established products.",
        "date": "10252017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen quarterly profit tops expectations despite sales decline "
    },
    {
        "content": "* Amgen Inc - ‍board of directors declared a $1.15 per share dividend for Q4 of 2017​ Source text for Eikon: Further company coverage:",
        "date": "10242017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen ‍board declares $1.15 per share dividend for Q4 "
    },
    {
        "content": "Oct 25 Amgen Inc reported higher-than-expected third quarter profit on Wednesday as lower costs and improved operating margins helped offset sales declines in some of its most important products.",
        "date": "10252017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 3-Amgen quarterly profit tops expectations despite sales decline "
    },
    {
        "content": "* Amgen - co  Boston Children's Hospital entered into neuroscience research collaboration aimed at identifying novel pain targets",
        "date": "10162017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen and Boston Children's Hospital enter into neuroscience research collaboration "
    },
    {
        "content": "* FDA accepts supplemental biologics license application for Prolia® (denosumab) in glucocorticoid-induced osteoporosis",
        "date": "10092017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-FDA accepts supplemental biologics license application for Prolia "
    },
    {
        "content": "* Amgen and CytomX Therapeutics announce strategic collaboration in immuno-oncology",
        "date": "10032017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen  CytomX therapeutics announce strategic collaboration in Immuno-Oncology "
    },
    {
        "content": "Amgen Inc has reached a settlement with AbbVie Inc that will delay the U.S. launch of Amgen's cheaper biosimilar version of AbbVie's cash cow  the blockbuster rheumatoid arthritis drug Humira  until Jan. 31  2023.",
        "date": "09282017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "AbbVie  Amgen settlement sets Humira U.S. biosimilar launch for 2023 "
    },
    {
        "content": "* Amgen and AbbVie agree to settlement allowing commercialization of Amgevita",
        "date": "09282017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen and AbbVie agree to settlement allowing commercialization of Amgevita "
    },
    {
        "content": "* Amgen and Simcere announce strategic collaboration to co-develop and commercialize biosimilars in China",
        "date": "09262017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen and Simcere announce strategic collaboration to co-develop and commercialize biosimilars in China "
    },
    {
        "content": "A federal jury has awarded Amgen Inc $70 million after finding that Hospira's production of a biosimilar version infringed Amgen's patent covering its anemia drug Epogen.",
        "date": "09252017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Hospira must pay Amgen $70 million in biosimilar patent case - jury "
    },
    {
        "content": "* Amgen Inc - preliminary assessment is that critical manufacturing areas in facility in Juncos  Puerto Rico  not been significantly impacted by storm​",
        "date": "09252017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen provides update on Hurricane Maria "
    },
    {
        "content": "The U.S. Food and Drug Administration said on Thursday it has approved Amgen Inc's biosimilar version of Roche Holding AG's cancer drug Avastin.",
        "date": "09142017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "U.S. FDA approves biosimilar version of cancer drug Avastin "
    },
    {
        "content": "Sept 14 The U.S. Food and Drug Administration said on Thursday it has approved Amgen Inc's biosimilar version of Roche Holding AG's cancer drug Avastin.",
        "date": "09142017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "RPT-U.S. FDA approves biosimilar version of cancer drug Avastin "
    },
    {
        "content": "* U.S. FDA says approved Amgen's Mvasi (bevacizumab-awwb) as a biosimilar to Avastin (bevacizumab) for the treatment of multiple types of cancer",
        "date": "09142017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-U.S. FDA approved Amgen's Mvasi as a biosimilar to Avastin "
    },
    {
        "content": "* ANNOUNCED ON MONDAY  TOGETHER WITH AMGEN   DETAILED RESULTS FROM THE PHASE 3 ARCH STUDY",
        "date": "09122017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-UCB and Amgen announce detailed results from the phase 3 ARCH study "
    },
    {
        "content": "* European commission approves expanded use of Mimpara (cinacalcet) for the treatment of secondary hyperparathyroidism in children with end-stage renal disease on dialysis",
        "date": "08312017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-European Commission approves expanded use of Mimpara for the treatment of secondary hyperparathyroidism in children with end-stage renal disease on dialysis "
    },
    {
        "content": "* Long-Term analysis of phase 3 head-to-head study confirms Kyprolis® (carfilzomib) regimen extends overall survival in patients with relapsed multiple myeloma",
        "date": "08302017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Long-Term analysis of phase 3 head-to-head study confirms Kyprolis® (carfilzomib) regimen extends overall survival in patients with relapsed multiple myeloma "
    },
    {
        "content": "* FDA accepts Amgen's filing of a supplemental new drug application to add overall survival results to Kyprolis® (carfilzomib) label",
        "date": "08302017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-FDA accepts Amgen's filing of a supplemental new drug application to add overall survival results to Kyprolis® (carfilzomib) label "
    },
    {
        "content": "* Amgen Foundation expands the Amgen Biotech experience  bringing total program reach to 900 000 high school students by 2020 Source text for Eikon: Further company coverage:",
        "date": "08242017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen Foundation expands Amgen Biotech experience "
    },
    {
        "content": "* Amgen to present new data from the Repatha cardiovascular outcomes study at ESC congress 2017 Source text for Eikon: Further company coverage:",
        "date": "08212017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen to present new data from the Repatha cardiovascular outcomes study "
    },
    {
        "content": "* Amgen and Humana partner for improved health outcomes and efficiency Source text for Eikon: Further company coverage:",
        "date": "08172017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen and Humana partner for improved health outcomes "
    },
    {
        "content": "* Soros Fund Management LLC dissolves share stake in Alphabet Inc class A shares   ‍​",
        "date": "08142017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Soros Fund Management LLC dissolves share stake in Alphabet  Amgen  American Airlines ‍​ "
    },
    {
        "content": "* Temasek Holdings (Private) Ltd takes share stake in JPMorgan Chase & Co of 264 337 shares",
        "date": "08142017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Temasek Holdings takes stake in JPMorgan  Biogen  Celgene "
    },
    {
        "content": "* Sets quarterly dividend of $1.15per share Source text for Eikon: Further company coverage:",
        "date": "07282017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen sets quarterly dividend of $1.15/shr "
    },
    {
        "content": "Amgen Inc said on Thursday the U.S. Food and Drug Administration granted priority review to the company's request to add important heart safety data to the label of its expensive injectable cholesterol drug Repatha.",
        "date": "07272017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen gets fast FDA review for adding heart benefits to cholesterol drug label "
    },
    {
        "content": "July 27 Amgen Inc said on Thursday the U.S. Food and Drug Administration granted priority review to the company's request to add important heart safety data to the label of its expensive injectable cholesterol drug Repatha.",
        "date": "07272017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen gets fast U.S. FDA review for adding heart benefits to cholesterol drug label "
    },
    {
        "content": "NEW YORK  July 31 Pharmacy benefit manager Express Scripts Holding Co said on Monday it would favor drugmaker Mylan Inc's versions of the EpiPen lifesaving allergy treatment over the allergy auto-injectors of other companies.",
        "date": "07312017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "UPDATE 1-Express Scripts to cover Mylan's EpiPen  exclude rivals "
    },
    {
        "content": "* FDA grants priority review for Amgen's supplemental biologics license application for Repatha® (evolocumab) to include data on reducing risk of cardiovascular events",
        "date": "07272017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-FDA grants priority review for Amgen's supplemental biologics license application for Repatha "
    },
    {
        "content": "* Amgen and Allergan submit biosimilar Biologics License Application for ABP 980 to US Food and Drug Administration",
        "date": "07312017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen and Allergan submit biosimilar Biologics License application for ABP 980 to U.S. FDA "
    },
    {
        "content": "Amgen Inc  on Tuesday reported higher-than-expected second-quarter profit and raised its 2017 earnings forecast with strong sales growth in newer products for multiple myeloma and osteoporosis.",
        "date": "07252017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen second-quarter profit tops Street view  shares fall "
    },
    {
        "content": "* Amgen submits supplemental biologics license application for Prolia® (denosumab) in glucocorticoid-induced osteoporosis",
        "date": "07312017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen submits supplemental biologics license application for Prolia in glucocorticoid-induced osteoporosis "
    },
    {
        "content": "July 25 Amgen Inc on Tuesday reported higher-than-expected second-quarter profit and raised its 2017 earnings forecast with strong sales growth in newer products for multiple myeloma and osteoporosis.",
        "date": "07252017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 2-Amgen 2nd-quarter profit tops Street view  shares fall "
    },
    {
        "content": "* FDA accepts biologics license application for Aimovig™ (erenumab)",
        "date": "07202017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen says FDA accepts biologics license application for Aimovig "
    },
    {
        "content": "July 25 Amgen Inc on Tuesday reported higher-than-expected second-quarter profit and raised its 2017 earnings forecast as  growth in newer products helped offset declines in established blockbuster medicines.",
        "date": "07252017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "CORRECTED-UPDATE 1-Amgen 2nd-quarter profit tops Street view  shares fall "
    },
    {
        "content": "* Q2 earnings per share view $3.11 -- Thomson Reuters I/B/E/S",
        "date": "07252017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen Q2 GAAP shr $2.91 "
    },
    {
        "content": "* Amgen and Array BioPharma announce preclinical license and collaboration agreement in inflammation",
        "date": "07182017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen and Array BioPharma announce preclinical license and collaboration agreement "
    },
    {
        "content": "* Ligand enters into commercial license and supply agreement with Amgen for rights to use captisol in the formulation of AMG 330",
        "date": "07172017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Ligand enters into commercial license  supply agreement with Amgen "
    },
    {
        "content": "* Amgen and UCB provide update on regulatory status of Evenity (Romosozumab) in the US",
        "date": "07162017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen and UCB provide update on regulatory status of Evenity in U.S. "
    },
    {
        "content": "July 25 Amgen Inc on Tuesday reported higher-than-expected second-quarter profit and raised its 2017 earnings forecast as strong growth in newer products helped offset declines in established blockbuster medicines.",
        "date": "07252017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen 2nd quarter profit tops Street estimates  raises forecast "
    },
    {
        "content": "* Amgen and allergan to discuss data supporting biologics license application for abp 215  a biosimilar candidate to avastin® (bevacizumab)",
        "date": "07132017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen  Allergan to discuss data supporting biologics license application for ABP 215 "
    },
    {
        "content": "ZURICH  June 27 Novartis's generics unit Sandoz said the European Commission approved Erelzi  its biosimilar to Amgen's Enbrel  to treat inflammatory diseases such as rheumatoid arthritis  psoriasis  and psoriatic arthritis.",
        "date": "06272017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Novartis gets European OK for biosimilar of Amgen's Enbrel "
    },
    {
        "content": "* FDA approves Vectibix® (panitumumab) for use in wild-type RAS metastatic colorectal cancer",
        "date": "06292017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-FDA approves Vectibix for use in wild-type RAS metastatic colorectal cancer "
    },
    {
        "content": "* Amgen receives positive CHMP opinion to expand use of mimpara (cinacalcet) for the treatment of secondary hyperparathyroidism in certain children with end-stage renal disease on dialysis",
        "date": "06232017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen receives positive CHMP opinion to expand use of mimpara "
    },
    {
        "content": "* Amgen's multiple Myeloma treatment  Kyprolis® (Carfilzomib)  in combination with Dexamethasone  receives NICE recommendation for use at first relapse",
        "date": "06122017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen's multiple Myeloma treatment in combination with Dexamethasone  receives NICE recommendation for use at first relapse "
    },
    {
        "content": "WASHINGTON  June 12 The U.S. Supreme Court on Monday cut the time it will take for copycat versions of biologic drugs to get to the market in a pivotal ruling about an expensive class of medicines that can yield billions of dollars in sales for drug companies.",
        "date": "06122017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 4-U.S. Supreme Court speeds copycat biologic drugs to market "
    },
    {
        "content": "* Coherus shares tumble 30 pct  Amgen up slightly (Adds background  details from conference call; updates shares)",
        "date": "06122017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "FDA rejects Coherus's biosimilar for Neulasta  shares plunge "
    },
    {
        "content": "June 12 Coherus BioSciences Inc said on Monday the U.S. Food and Drug Administration (FDA) declined to approve its biosimilar copy of Amgen Inc's blockbuster treatment  Neulasta  which is used to fight infections in cancer patients.",
        "date": "06122017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "RPT-UPDATE 3-FDA rejects Coherus's biosimilar for Neulasta  shares plunge "
    },
    {
        "content": "Coherus BioSciences Inc said on Monday the U.S. Food and Drug Administration (FDA) denied the approval of its biosimilar for Amgen Inc's blockbuster treatment  Neulasta  which fights infections in cancer patients.",
        "date": "06122017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "FDA rejects Coherus' biosimilar for Amgen's Neulasta "
    },
    {
        "content": "* Amgen and Allergan announce fda advisory committee meeting to review ABP 215  a biosimilar candidate to bevacizumab",
        "date": "06072017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen  Allergan announce FDA advisory committee meeting to review ABP 215 "
    },
    {
        "content": "June 6 A federal appeals court hinted on Tuesday it may let Sanofi AG and Regeneron Pharmaceuticals Inc sell a cholesterol drug Amgen Inc has been trying to block on patent infringement grounds  according to lawyers and analysts who attended oral arguments in the case.",
        "date": "06062017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Regeneron  Sanofi urge court to reverse ban on cholesterol drug "
    },
    {
        "content": "* Amgen submits regulatory applications for repatha® (evolocumab) cardiovascular outcomes data in US and Europe Source text for Eikon: Further company coverage:",
        "date": "06052017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen submits regulatory applications for repatha cardiovascular outcomes data in US  Europe "
    },
    {
        "content": "Here are some upcoming events of interest to the intellectual property law community. All times local.",
        "date": "06052017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Week Ahead in Intellectual Property  Feb. 13  2017 "
    },
    {
        "content": "* Feldan Therapeutics and Elasmogen announce research agreement with Amgen to develop intracellular biologics",
        "date": "05092017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Feldan Therapeutics and Elasmogen announce research agreement with Amgen "
    },
    {
        "content": "* Amgen inc files for potential five-part senior notes offering - sec filing Source text for Eikon: (http://bit.ly/2qh9EEe) Further company coverage:",
        "date": "05082017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen files for potential five-part senior notes offering "
    },
    {
        "content": "* Amgen and Harvard Pilgrim agree to first cardiovascular outcomes-based refund contract for repatha (evolocumab)",
        "date": "05022017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen  Harvard Pilgrim agree to contract for repatha "
    },
    {
        "content": "MUMBAI  April 27 India's antitrust regulator has ordered a probe into Swiss drugmaker Roche for allegedly using anti-competitive practices to restrict cheaper copies of a blockbuster cancer drug from reaching patients.",
        "date": "04272017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "UPDATE 1-India watchdog orders antitrust probe into Roche cancer drug "
    },
    {
        "content": "Amgen Inc  on Wednesday reported higher-than-expected first-quarter profit as cost controls helped offset a sharp drop in sales of Enbrel  its blockbuster rheumatoid arthritis and psoriasis drug.",
        "date": "04262017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Cost controls help offset lower Amgen first-quarter drug sales "
    },
    {
        "content": "* Completed initial phases of biologics price competition & innovation act patent exchange procedure with amgen for Coherus' CHS-1701",
        "date": "04252017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Coherus Biosciences completes formalities with amgen for Coherus' CHS-1701 "
    },
    {
        "content": "* Amgen announces expanded commercial collaboration with Novartis for erenumab in migraine",
        "date": "04242017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen announces expanded commercial collaboration with Novartis for erenumab in migraine "
    },
    {
        "content": "* Says 2017 earnings per share guidance increased to $10.64-$11.32 on GAAP basis  and $12.00-$12.60 on non-GAAP basis",
        "date": "04262017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen reports Q1 GAAP earnings per share $2.79 "
    },
    {
        "content": "April 26 Amgen Inc on Wednesday reported higher-than-expected first-quarter profit as cost controls helped offset a sharp drop in sales of Enbrel  its blockbuster rheumatoid arthritis and psoriasis drug.",
        "date": "04262017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 3-Cost controls help offset lower Amgen 1st-quarter drug sales "
    },
    {
        "content": "* Amgen says optimistic about rebound in Enbrel sales in coming quarters after Q1 decline",
        "date": "04262017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen optimistic for Enbrel sales rebound "
    },
    {
        "content": "April 26 Amgen Inc on Wednesday reported higher-than-expected first-quarter profit as cost controls helped offset a sharp drop in sales of Enbrel  its blockbuster rheumatoid arthritis and psoriasis drug.",
        "date": "04262017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen first-quarter profit exceeds Street estimates on lower costs "
    },
    {
        "content": "* Amgen Inc - CEO Robert Bradway's total compensation for 2016 was $16.9 million versus $16.1 million in 2015 - SEC filing Source text: (http://bit.ly/2oOpF0j) Further company coverage:",
        "date": "04062017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen says CEO Robert Bradway's total compensation for 2016 was $16.9 mln vs $16.1 mln in 2015 - SEC filing "
    },
    {
        "content": "* Amgen submits applications in the us and europe to expand current indication for xgeva® (denosumab) to include patients with multiple myeloma",
        "date": "04042017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen submits applications in the U.S. and Europe to expand current indication for xgeva "
    },
    {
        "content": "* FDA grants priority review for Amgen's Blincyto® (blinatumomab) supplemental biologics license application",
        "date": "03292017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-FDA grants priority review for Amgen's Blincyto supplemental biologics license application "
    },
    {
        "content": "* Amgen enters into agreement with Inovalon and Avalere to engage value-based contracting opportunities",
        "date": "03292017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen enters into agreement with Inovalon and Avalere "
    },
    {
        "content": "* European Commission approves Amgevita™ (biosimilar adalimumab) for the treatment of certain inflammatory diseases",
        "date": "03232017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-European Commission approves Amgevita for treatment of certain inflammatory diseases "
    },
    {
        "content": "BOSTON  March 21 Sanofi SA and Regeneron Pharmaceuticals Inc filed a lawsuit seeking a court order declaring that their eczema drug Dupixent  awaiting a U.S. approval decision  does not infringe an Amgen Inc  patent for a failed asthma treatment.",
        "date": "03212017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Sanofi  Regeneron sue Amgen to protect eczema drug from patent claims "
    },
    {
        "content": "BOSTON  March 21 Sanofi SA and Regeneron Pharmaceuticals Inc have filed a lawsuit seeking a court order declaring that their eczema drug Dupixent  awaiting a U.S. approval decision  does not infringe an Amgen Inc patent for a failed asthma treatment.",
        "date": "03212017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-Sanofi  Regeneron sue Amgen to protect eczema drug from patent claims "
    },
    {
        "content": "NEW YORK U.S. stocks dipped on Friday as bank shares fell alongside Treasury yields while Adobe helped buoy the S&P tech sector and the Nasdaq Composite. | Video ",
        "date": "03172017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Wall St. flat as banks  Amgen weigh; Adobe rallies "
    },
    {
        "content": "March 13 Data that should help unlock the sales potential of a potent new cholesterol medicine will be unveiled at the American College of Cardiology meeting this week as the future of the only rival drug rests with the courts in an ongoing patent dispute.",
        "date": "03132017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Data on heart benefits of Amgen drug is key to unlocking sales "
    },
    {
        "content": "* Dow down 0.1 pct  S&P 500 down 0.13 pct  Nasdaq flat   (Updates to market close  changes comment  byline)",
        "date": "03172017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "US STOCKS-Wall St flat as banks  Amgen weigh; Adobe rallies "
    },
    {
        "content": "JERUSALEM - U.S. chipmaker Intel agrees to buy driverless technology firm Mobileye for $15.3 billion  positioning itself for a dominant role in the autonomous-driving sector after missing the market for mobile phones. (INTEL-MOBILEYE/ (UPDATE 4  PICTURE)  moved  by Tova Cohen and Ari Rabinovitch  695 words)",
        "date": "03132017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Reuters Business News Schedule at 1330 GMT/0930 AM ET "
    },
    {
        "content": "* Amgen Inc - four-year follow-up results from Repatha (evolocumab) Osler-1 study",
        "date": "03142017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen Inc reports four-year follow-up results from Repatha Osler-1 study "
    },
    {
        "content": "NEW YORK  March 17 Express Scripts Holding Co  Chief Medical Officer Dr. Steve Miller said on Friday that the data on heart drug Repatha from Amgen Inc was incrementally better and would change patient access to the drug.",
        "date": "03172017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Express Scripts says Amgen data opens door to patients "
    },
    {
        "content": "* Repatha (evolocumab) demonstrates reduced need for apheresis in patients with high LDL cholesterol in phase 3 study",
        "date": "03132017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Repatha demonstrates reduced need for apheresis in patients with high LDL cholesterol "
    },
    {
        "content": "March 13 Amgen Inc said on Monday its injection Repatha significantly reduced the need for patients to undergo a procedure to reduce bad cholesterol  according to the findings of a late-stage study.",
        "date": "03132017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen's Repatha lowers need for cholesterol-lowering procedure "
    },
    {
        "content": "* Sets quarterly dividend of $1.15 per share  Source text for Eikon:  Further company coverage:",
        "date": "03072017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen sets quarterly dividend of $1.15 per share "
    },
    {
        "content": "* Dow up 0.06 pct  S&P up 0.05 pct  Nasdaq down 0.03 pct   (Updates to open)",
        "date": "03172017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "US STOCKS-Wall St little changed as healthcare stocks weigh "
    },
    {
        "content": "WASHINGTON  March 17 Amgen Inc's Repatha drug cut the risk of heart attacks and strokes by over 20 percent in patients with heart disease  demonstrating a clear clinical benefit beyond its ability to slash \"bad\" LDL cholesterol levels  data from a huge study known as Fourier showed on Friday.",
        "date": "03172017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "RPT-Amgen cholesterol drug cuts heart attack  stroke risk more than 20 pct-study "
    },
    {
        "content": "March 13 Data that should help unlock the sales potential of a potent new cholesterol medicine will be unveiled at the American College of Cardiology meeting this week as the future of the only rival drug rests with the courts in an ongoing patent dispute.",
        "date": "03132017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "RPT-Data on heart benefits of Amgen drug is key to unlocking sales "
    },
    {
        "content": "* Amgen highlights Landmark Repatha (evolocumab) cardiovascular outcomes study amongst data to be presented at acc.17  Source text for Eikon:  Further company coverage:",
        "date": "03062017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen highlights Landmark Repatha (evolocumab) cardiovascular outcomes study "
    },
    {
        "content": "WASHINGTON  March 17 Amgen Inc's Repatha drug cut the risk of heart attacks and strokes by over 20 percent in patients with heart disease  demonstrating a clear clinical benefit beyond its ability to slash \"bad\" LDL cholesterol levels  data from a huge study known as Fourier showed on Friday.",
        "date": "03172017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen cholesterol drug cuts heart attack  stroke risk more than 20 pct-study "
    },
    {
        "content": "* Coherus Biosciences Inc - Amgen has filed a trade secret action in California State Court on March 3  2017",
        "date": "03062017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Coherus Biosciences says Amgen files trade secret action against company "
    },
    {
        "content": "* Announces positive results from planned overall survival analysis of phase 3 head-to-head ENDEAVOR trial",
        "date": "02282017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen announces positive results from planned overall survival analysis of phase 3 head-to-head ENDEAVOR trial "
    },
    {
        "content": "* Amgen Inc - files for potential mixed shelf; size not disclosed   Source text:(http://bit.ly/2lhl0EQ) Further company coverage:",
        "date": "02152017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen Inc files for potential mixed shelf size not disclosed "
    },
    {
        "content": "The U.S. Food and Drug Administration has approved Amgen Inc's treatment for secondary hyperparathyroidism in adult patients with chronic kidney disease undergoing dialysis  the U.S. biotech company said on Tuesday.",
        "date": "02072017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "FDA approves Amgen drug for secondary hyperparathyroidism "
    },
    {
        "content": "* Regeneron CEO: \"As we further diversify our product related revenue stream  we do not plan to provide eylea guidance after 2017\"",
        "date": "02092017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Regeneron says price increases unrelated from innovation will be pushed back on "
    },
    {
        "content": "Feb 8 A U.S. appeals court on Wednesday stayed an order that would have blocked Regeneron Pharmaceuticals Inc  and Sanofi SA from selling their cholesterol drug  Praluent  while they appeal the order.",
        "date": "02082017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "UPDATE 2-Regeneron  Sanofi win stay of U.S. order blocking cholesterol drug sales "
    },
    {
        "content": "* FDA approves Amgen's Parsabiv\u007f (etelcalcetide)  first new treatment in more than a decade for secondary hyperparathyroidism in adult patients on hemodialysis",
        "date": "02072017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-FDA approves Amgen's Parsabiv  first new treatment in more than a decade for secondary hyperparathyroidism in adult patients on hemodialysis "
    },
    {
        "content": "Feb 8 A U.S. appeals court on Wednesday has stayed an order that would have blocked Regeneron Pharmaceuticals Inc and Sanofi SA from selling their cholesterol drug  Praluent  later this month while they appeal.",
        "date": "02082017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Regeneron  Sanofi win stay of order blocking cholesterol drug sales "
    },
    {
        "content": "Feb 7 The U.S. Food and Drug Administration has approved Amgen Inc's treatment for secondary hyperparathyroidism in adult patients with chronic kidney disease undergoing dialysis  the U.S. biotech company said on Tuesday.",
        "date": "02072017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "U.S. FDA approves Amgen drug for secondary hyperparathyroidism "
    },
    {
        "content": "* Amgen announces appointment of Charles M. Holley Jr. To board of directors",
        "date": "02032017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen appoints Charles Holley Jr. to board of directors "
    },
    {
        "content": "* Amgen CEO says international expansion important element of long-term growth",
        "date": "02022017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen CEO expects to see U.S. tax reform "
    },
    {
        "content": "NEW YORK U.S. stocks ended little changed on Thursday as the recent rally continued to stall following President Donald Trump's latest comments on trade and the policies he will pursue. | Video ",
        "date": "02032017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Wall Street stalls as market  Trump priorities diverge "
    },
    {
        "content": "Amgen Inc  on Thursday posted a higher-than-expected fourth-quarter profit  helped by a jump in sales of its Enbrel rheumatoid arthritis drug  but it issued a 2017 sales and earnings forecast range below current Wall Street estimates.",
        "date": "02022017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen fourth quarter profit tops Street view  cholesterol news lifts shares "
    },
    {
        "content": "Feb 2 Amgen Inc on Thursday posted a higher-than-expected fourth-quarter profit  helped by a jump in sales of its Enbrel rheumatoid arthritis drug  but it issued a 2017 sales and earnings forecast range below current Wall Street estimates.",
        "date": "02022017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 2-Amgen 4th-qtr profit tops Street view  cholesterol news lifts shares "
    },
    {
        "content": "Feb 2 Amgen Inc on Thursday posted a higher-than-expected fourth-quarter profit  helped by a jump in sales of its Enbrel rheumatoid arthritis drug  but it issued a 2017 sales and earnings forecast range below current Wall Street estimates.",
        "date": "02022017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen 4th-qtr profit tops Street view  but 2017 outlook light "
    },
    {
        "content": "* Amgen reports fourth quarter and full year 2016 financial results",
        "date": "02022017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen reports Q4 EPS $2.59 "
    },
    {
        "content": "Amgen on Wednesday urged a federal appeals court to reject briefs from doctors arguing that Regeneron Pharmaceuticals Inc and Sanofi SA should be allowed to keep selling their cholesterol drug Praluent while they appeal their loss to Amgen in a patent lawsuit.",
        "date": "01272017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen opposes doctors weighing in on cholesterol drug patent fight "
    },
    {
        "content": "ZURICH  Jan 25 The Novartis copy of Amgen's blockbuster psoriasis drug Enbrel will not go on sale before 2018 at the earliest because of the U.S. company's patent protection challenge  the Swiss drugmaker's head of generics told Reuters.",
        "date": "01252017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Novartis says court battle will delay its Enbrel copy until 2018 at least "
    },
    {
        "content": "* Mead Johnson Nutrition jumps  in talks with Reckitt Benckiser",
        "date": "02022017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "US STOCKS-Wall St stalls as market  Trump priorities diverge "
    },
    {
        "content": "* Amgen receives positive CHMP opinion for ABP 501 (biosimilar adalimumab) for the treatment of certain inflammatory diseases",
        "date": "01272017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen receives positive CHMP opinion for ABP 501 "
    },
    {
        "content": "* Indexes down: Dow 0.16 pct  S&P 0.09 pct  Nasdaq 0.18 pct   (Updates to early afternoon)",
        "date": "02022017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "US STOCKS-Wall St slips as investors digest Trump's trade comments "
    },
    {
        "content": "* Indexes up: Dow 0.11 pct  S&P 0.13 pct  Nasdaq 0.17 pct   (Adds details  comments; updates prices)",
        "date": "02022017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "US STOCKS-Wall St edges up on gains in consumer stocks "
    },
    {
        "content": "* EU Medicines Agency recommends approval of Amgen's Amgevita and Solymbic  both containing adalimumab",
        "date": "01272017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-EMA recommends approval of two biosimilars from Amgen "
    },
    {
        "content": "* Indexes down: Dow 0.18 pct  S&P 0.30 pct  Nasdaq 0.46 pct   (Updates to open)",
        "date": "02022017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "US STOCKS-Wall St lower as Fed uncertainty weighs on bank stocks "
    },
    {
        "content": "* Futures down: Dow 44 pts  S&P 4.75 pts  Nasdaq 11.25 pts   (Adds details  comments  updates prices)",
        "date": "02022017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "US STOCKS-Wall St set to open lower as Fed clouds rate hike timing "
    },
    {
        "content": "* Davita enters into new sourcing and supply agreement with Amgen and initiates 2017 kidney care guidance",
        "date": "01092017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Davita enters into new sourcing and supply agreement with Amgen "
    },
    {
        "content": "* Amgen and Davita enter into new sourcing and supply agreement",
        "date": "01092017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen and Davita enter into new sourcing and supply agreement "
    },
    {
        "content": "Regeneron Pharmaceuticals Chief Executive Len Schleifer on Monday ripped into Amgen Inc  for its insistence on blocking sales of a rival Regeneron cholesterol drug while the appeals process in a patent infringement case plays out.",
        "date": "01102017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Regeneron CEO says Amgen not putting patients first in patent dispute "
    },
    {
        "content": "* Amgen and Immatics enter strategic collaboration to develop novel bispecific cancer immunotherapies",
        "date": "01092017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen  Immatics enter strategic collaboration to develop novel bispecific cancer immunotherapies "
    },
    {
        "content": "Jan 9 Regeneron Pharmaceuticals Chief Executive Len Schleifer on Monday ripped into Amgen Inc  for its insistence on blocking sales of a rival Regeneron cholesterol drug while the appeals process in a patent infringement case plays out.",
        "date": "01102017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-Regeneron CEO says Amgen not putting patients first in patent dispute "
    },
    {
        "content": "* Court grants permanent injunction for infringement of Amgen's repatha patents",
        "date": "01062017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Court grants permanent injunction for infringement of Amgen's Repatha patents "
    },
    {
        "content": "A federal judge on Tuesday refused to throw out a court verdict upholding two Amgen Inc patents related to the company's cholesterol drug  a defeat for Sanofi SA and Regeneron Pharmaceuticals Inc  which make a rival drug.",
        "date": "01042017",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Sanofi  Regeneron lose bid to overturn Amgen win in patent case "
    },
    {
        "content": "Jan 9 Regeneron Pharmaceuticals Chief Executive Len Schleifer on Monday ripped into Amgen Inc  for its insistence on blocking sales of a rival Regeneron cholesterol drug while the appeals process in a patent infringement case plays out.",
        "date": "01102017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "CORRECTED-Regeneron CEO says Amgen not putting patients first in patent dispute "
    },
    {
        "content": "* Amgen statement on January 9  2017  U.S. District court decision",
        "date": "01102017",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen comments on Delaware court's ruling on PCSK9 patent litigation "
    },
    {
        "content": "Amgen Inc and Allergan Plc said they have submitted an application to the European health regulator seeking approval of their biosimilar version of Roche Holding AG's blockbuster cancer treatment  Avastin.",
        "date": "12022016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen  Allergan apply for European nod for Avastin biosimilar "
    },
    {
        "content": "Amgen Inc and Novartis said late on Wednesday that episodic migraine sufferers reported fewer debilitating headaches per month after using the companies' investigational drug erenumab  compared to trial participants who got a placebo.",
        "date": "11172016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen  Novartis aim for big  crowded migraine market after new drug data "
    },
    {
        "content": "Nov 16 Amgen Inc and Novartis  said late on Wednesday that episodic migraine sufferers reported fewer debilitating headaches per month after using the companies' investigational drug erenumab  compared to trial participants who got a placebo.",
        "date": "11172016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-Amgen  Novartis aim for big  crowded migraine market after new drug data "
    },
    {
        "content": "NEW ORLEANS  Nov 15 Amgen Inc's potent new drug Repatha  when added to statin therapy  not only took \"bad\" LDL cholesterol down to extremely low levels but caused declines in artery-clogging plaque in a majority of high-risk heart patients after 18 months of treatment  according to data from a clinical trial.",
        "date": "11152016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen cholesterol drug reduces artery-clogging plaque in study "
    },
    {
        "content": "* Janssen announces clinical trial collaboration and supply agreement with Amgen to evaluate Daratumumab (darzalex\u007f) in combination with Carfilzomib (kyprolis\u007f)  Source text for Eikon:  Further company coverage:",
        "date": "11102016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Janssen reports clinical trial collaboration and supply agreement with Amgen to evaluate Daratumumab in combination with Carfilzomib "
    },
    {
        "content": "* Genmab announces phase III study of daratumumab in combination with carfilzomib in multiple myeloma",
        "date": "11102016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Genmab says combination of drugs from J&J  Amgen will be tested in study "
    },
    {
        "content": "Nov 16 Amgen Inc said on Wednesday its migraine treatment met the main goal of reducing monthly migraine days in patients with episodic migraine in a second late-stage study.",
        "date": "11162016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen's migraine drug succeeds in late-stage trial "
    },
    {
        "content": "* Amgen Inc - FDA has approved SBLA for expanded use of ENBREL to treat pediatric patients (ages 4-17) with chronic moderate-to-severe plaque psoriasis",
        "date": "11042016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-FDA approves expanded use of ENBREL to treat children with chronic moderate-to-severe plaque psoriasis "
    },
    {
        "content": "An Amgen Inc subsidiary has sued three generic drug companies over their applications to make generic versions of Amgen's cancer drug Kyprolis  the latest in a series of lawsuits asserting Amgen's patent rights to the drug.",
        "date": "11032016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen unit sues generic companies over generic Kyprolis plans "
    },
    {
        "content": "* Appoints Lori Johnston as senior vice president  human resources  Source text for Eikon:  Further company coverage:",
        "date": "11022016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen appoints Lori Johnston as senior vice president  human resources "
    },
    {
        "content": "* CEO says likely will not be able to launch Humira biosimilar in 2017 given pace of litigation  Source text for Eikon:  Further company coverage:    (Reporting By Bill Berkrot)",
        "date": "10272016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen unlikely to launch Humira biosimilar in 2017 "
    },
    {
        "content": "* Amgen (europe) gmbh - announced an investment in ehealth ventures  an israel-based \"digital health incubator\"  Source text for Eikon:  Further company coverage:",
        "date": "10252016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen to invest in israel-based ehealth ventures "
    },
    {
        "content": "* Q3 GAAP earnings per share $2.68; Q3 Non-GAAP earnings per share $3.02; Q3 revenue $5.8 billion  up 2 percent",
        "date": "10272016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen Inc Q3 Non-GAAP EPS $3.02 "
    },
    {
        "content": "* Arrowhead Pharmaceuticals Inc - Files for sale of aggregate of 3.0 million shares of co's common stock by selling shareholder Amgen Inc - SEC filing",
        "date": "10282016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Arrowhead Pharma files for sale of aggregate of 3 mln shares of co's common stock by selling shareholder Amgen "
    },
    {
        "content": "Amgen Inc  on Thursday reported higher-than-expected third-quarter profit on lower research and manufacturing costs and onetime payments  and the world's largest biotechnology company raised its full-year earnings forecast for the third successive quarter.",
        "date": "10272016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen third-quarter profit tops Street view on cost cutting "
    },
    {
        "content": "Oct 27 Amgen Inc on Thursday reported higher-than-expected third-quarter profit on lower research and manufacturing costs and onetime payments  and the world's largest biotechnology company raised its full-year earnings forecast for the third successive quarter.",
        "date": "10272016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 2-Amgen 3rd-quarter profit tops Street view on cost cutting "
    },
    {
        "content": "Oct 27 Amgen Inc on Thursday reported higher-than-expected third-quarter profit despite disappointing sales of some of its biggest medicines  as results were helped by lower research and manufacturing costs and onetime payments  and the biotechnology company raised its full-year earnings forecast.",
        "date": "10272016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen 3rd-quarter profit tops expectations on cost cutting "
    },
    {
        "content": "** iShares Nasdaq Biotechnology ETF hitting fresh 3-mth lows; bear trend from its late Sept high remains intact",
        "date": "10282016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BUZZ-Biotech ETF weakness grows more acute "
    },
    {
        "content": "* Unilife Corp - reduced workforce to approximately 140 employees",
        "date": "10242016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Unilife Corp implemented cost reduction measures "
    },
    {
        "content": "* Amgen announces positive top-line results from Xgeva\u007f (Denosumab) Phase 3 trial for delay of bone complications in multiple Myeloma patients",
        "date": "10202016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen announces positive top-line results from Xgeva (Denosumab) Phase 3 trial "
    },
    {
        "content": "* Bradway will serve on Boeing board's audit and finance committees",
        "date": "10142016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Boeing board elects Amgen CEO Robert Bradway as new director "
    },
    {
        "content": "* Announces strategic collaboration with Amgen in oncology and neuroscience",
        "date": "10042016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Nuevolution: strategic collaboration with Amgen in oncology and neuroscience "
    },
    {
        "content": "Amgen Inc said on Thursday it would buy a stake in Arrowhead Pharmaceuticals Inc and collaborate with the company to develop gene-silencing therapies for heart disease.",
        "date": "09292016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen  Arrowhead team up on gene-therapies for heart disease "
    },
    {
        "content": "* Amgen stock down about 1.2 pct   (Adds comments from conference call  analysts  details)",
        "date": "09272016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "UPDATE 3-Amgen's multiple myeloma drug falls short in new-patient study "
    },
    {
        "content": "Sept 29 Amgen Inc said on Thursday it would buy a stake in Arrowhead Pharmaceuticals Inc and collaborate with the company to develop gene-silencing therapies for heart disease.",
        "date": "09292016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-Amgen  Arrowhead team up on gene-therapies for heart disease "
    },
    {
        "content": "Sept 29 Amgen Inc said on Thursday it would buy a stake in Arrowhead Pharmaceuticals Inc and team up with the company to develop gene-silencing therapies for heart disease.",
        "date": "09292016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen and Arrowhead to develop gene-therapies for heart disease "
    },
    {
        "content": "WASHINGTON The U.S. Food and Drug Administration on Friday approved Amgen Inc's biosimilar version of AbbVie's top-selling arthritis drug  Humira.",
        "date": "09232016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "FDA approves Amgen's copy of AbbVie arthritis drug Humira "
    },
    {
        "content": "WASHINGTON  Sept 23 The U.S. Food and Drug Administration on Friday approved a cheaper  biosimilar version of AbbVie's top-selling arthritis drug  Humira.",
        "date": "09232016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "U.S. FDA approves Amgen's cheaper copy of arthritis drug Humira "
    },
    {
        "content": "Amgen Inc said on Tuesday its potent new cholesterol fighter  Repatha  met the primary and secondary goals of a study designed to show it can decrease plaque buildup in heart arteries of patients already taking widely used statin drugs  such as Lipitor.",
        "date": "09202016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen cholesterol drug reduces arterial plaque buildup: study "
    },
    {
        "content": "* Intravascular ultrasound study meets primary and secondary endpoints",
        "date": "09202016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen announces positive top line results from Phase 3 GLAGOV imaging study of Repatha(evolocumab) "
    },
    {
        "content": "A federal judge in Florida has ruled that Apotex Inc would not infringe an Amgen Inc patent by making copycat versions of Amgen's white-blood-cell-boosting drugs Neulasta and Neupogen.",
        "date": "09072016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Apotex cleared of infringement in copycat drug dispute with Amgen "
    },
    {
        "content": "* Amgen obtains global development and commercial rights from Boehringer Ingelheim for investigational bite immuno-oncology drug for multiple myeloma",
        "date": "09012016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen gets commercial rights from Boehringer Ingelheim "
    },
    {
        "content": "* Swiss drugmaker fighting Amgen on patents  regulatory hurdles",
        "date": "08312016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Novartis bid to sell new biosimilar crimped by U.S. court battles "
    },
    {
        "content": "* Amgen and Servier extend omecamtiv mecarbil collaboration in chronic heart failure",
        "date": "09012016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen and servier extend omecamtiv mecarbil collaboration "
    },
    {
        "content": "* Cytokinetics and Amgen to advance Omecamtiv Mecarbil to phase 3 clinical development",
        "date": "09012016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Cytokinetics and Amgen to advance Omecamtiv Mecarbil to phase 3 "
    },
    {
        "content": "* Amgen announces positive top-line results from phase 3 study of prolia (denosumab) in patients receiving glucocorticoid therapy",
        "date": "08292016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen announces positive top-line results from phase 3 study "
    },
    {
        "content": "WASHINGTON The U.S. Food and Drug Administration on Tuesday approved Novartis AG's biosimilar version of Amgen Inc's arthritis drug Enbrel.",
        "date": "08302016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "FDA approves Novartis biosimilar to Amgen's Enbrel "
    },
    {
        "content": "* Files for potential senior notes offerings  size not disclosed - sec filing  Source text (http://bit.ly/2bfDulU) Further company coverage:",
        "date": "08102016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen files for potential senior notes offerings  size not disclosed "
    },
    {
        "content": "LONDON  Aug 9 Britain's cost-effectiveness agency NICE has recommended use of a virus-based melanoma drug from Amgen  reversing an earlier negative decision after the company provided further information.",
        "date": "08092016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "In change of tack  UK agency backs Amgen virus-based cancer drug "
    },
    {
        "content": "Amgen Inc  on Wednesday posted higher-than-expected second-quarter profit on strong drug sales and again raised its full-year forecast in a clear signal of management confidence in the business.",
        "date": "07272016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen again raises 2016 forecast in display of confidence "
    },
    {
        "content": "July 27 Amgen Inc on Wednesday reported higher-than-expected second-quarter profit on increased sales of its blockbuster rheumatoid arthritis drug Enbrel and newer medicines  and the  company again raised its full-year forecast.",
        "date": "07272016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "REFILE-UPDATE 2-Amgen again raises 2016 forecast in display of confidence "
    },
    {
        "content": "July 27 Amgen Inc on Wednesday reported higher-than-expected second-quarter profit on increased sales of its blockbuster rheumatoid arthritis drug Enbrel and newer medicines  and the  company again raised its full-year forecast.",
        "date": "07272016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen 2nd-quarter profit tops Street view  raises 2016 forecast "
    },
    {
        "content": "* Board of directors declared a $1.00 per share dividend for q3 of 2016  Source text for Eikon:  Further company coverage:    )",
        "date": "07222016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen declares quarterly dividend of $1 per share "
    },
    {
        "content": "July 21 Amgen Inc and Allergan Plc  said their copycat version of Roche Holding AG's  blockbuster cancer treatment  Herceptin  was found as effective as the original in a late-stage study.",
        "date": "07212016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen  Allergan biosimilar found as effective as Roche cancer drug "
    },
    {
        "content": "U.S. regulators have declined to approve Novartis' so-called biosimilar copy of Amgen's Neulasta drug that fights infections in cancer patients  the Swiss drugmaker said on Tuesday.",
        "date": "07192016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "FDA knocks back Novartis copy of Amgen's drug Neulasta "
    },
    {
        "content": "* Amgen and UCB submit biologics license application for romosozumab to the FDA",
        "date": "07222016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen and UCB submit biologics license application for romosozumab to the FDA "
    },
    {
        "content": "* In neoadjuvant phase of study  which included chemotherapy  there were more serious adverse events reported in ABP 980 group",
        "date": "07212016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Allergan  Amgen collaborating on development  commercialization of four oncology biosimilars "
    },
    {
        "content": "* Settlement class consists of purchasers of Amgen's publicly-traded securities during period from April 22  2004  through May 10  2007",
        "date": "07212016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen announces settlement of securities litigation "
    },
    {
        "content": "July 19 Valeant Pharmaceuticals International Inc's experimental drug to treat the skin disorder psoriasis should be approved as long as certain measures are put in place to mitigate the risk of suicide  an advisory committee to the U.S. Food and Drug Administration concluded on Tuesday.",
        "date": "07192016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 2-U.S. FDA panel backs Valeant psoriasis drug with risk program "
    },
    {
        "content": "July 19 U.S. regulators have declined to approve Novartis' so-called biosimilar copy of Amgen's  Neulasta drug that fights infections in cancer patients  the Swiss drugmaker said on Tuesday.",
        "date": "07192016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "U.S. FDA knocks back Novartis copy of Amgen's drug Neulasta "
    },
    {
        "content": "A federal judge in Fort Lauderdale  Florida on Monday heard closing arguments in a patent lawsuit brought by Amgen Inc in an effort to block Apotex Inc from launching a copycat version of its white-blood-cell-boosting drug Neulasta.",
        "date": "07192016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Patent trial over Amgen's white blood cell drug Neulasta wraps up "
    },
    {
        "content": "July 19 Some of the world's largest drug companies are taking out their checkbooks for acquisitions of smaller peers whose cancer drugs have the potential to cure not just patients  but corporate growth prospects as well.",
        "date": "07192016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "DEALTALK-Old pharma sees new profit cure in cancer drugs "
    },
    {
        "content": "July 15 Valeant Pharmaceuticals International Inc's experimental drug to treat the skin disorder psoriasis carries a potential risk of suicide that is challenging to assess due to limited data  according to a preliminary review by the U.S. Food and Drug Administration published on Friday.",
        "date": "07152016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 2-Valeant psoriasis drug's suicide risk hard to assess -FDA Staff "
    },
    {
        "content": "* Amgen and daiichi sankyo announce agreement to commercialize biosimilars in japan",
        "date": "07142016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen and Daiichi Sankyo agree to commercialize Biosimilars in Japan "
    },
    {
        "content": "Novartis AG's cheaper version of Amgen Inc's arthritis drug Enbrel is highly similar in potency and safety to the original and should be approved  an advisory panel to the U.S. Food and Drug Administration concluded on Wednesday.",
        "date": "07132016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "FDA panel supports Novartis version of Amgen arthritis drug "
    },
    {
        "content": "Some of the world's largest drug companies are taking out their checkbooks for acquisitions of smaller peers whose cancer drugs have the potential to cure not just patients  but corporate growth prospects as well.",
        "date": "07192016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Old pharma sees new profit cure in cancer drugs "
    },
    {
        "content": "July 13 Novartis AG's cheaper version of Amgen Inc's arthritis drug Enbrel is highly similar in potency and safety to the original and should be approved  an advisory panel to the U.S. Food and Drug Administration concluded on Wednesday.",
        "date": "07132016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 2-U.S. FDA panel supports Novartis version of Amgen arthritis drug "
    },
    {
        "content": "Amgen Inc's cheaper version of AbbVie's top-selling arthritis drug Humira is highly similar to the original and should be approved  an advisory panel to the U.S. Food and Drug Administration concluded on Tuesday.",
        "date": "07122016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "FDA panel backs Amgen copy of AbbVie arthritis drug Humira "
    },
    {
        "content": "Novartis AG's cheaper version of Amgen Inc's blockbuster arthritis drug Enbrel is highly similar in potency and safety to the original  according to a review by Food and Drug Administration staff.",
        "date": "07112016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Novartis copy of Amgen arthritis drug highly similar: FDA staff "
    },
    {
        "content": "July 12 Amgen Inc's cheaper version of AbbVie's top-selling arthritis drug Humira is highly similar to the original and should be approved  an advisory panel to the U.S. Food and Drug Administration concluded on Tuesday.",
        "date": "07122016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 3-U.S. FDA panel backs Amgen copy of AbbVie arthritis drug Humira "
    },
    {
        "content": "Novartis AG's cheaper version of Amgen Inc's blockbuster arthritis drug Enbrel is highly similar in potency and safety to the original  according to a review by Food and Drug Administration staff.",
        "date": "07112016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Novartis copy of Amgen arthritis drug highly similar - FDA staff "
    },
    {
        "content": "* Amgen to discuss data supporting biologics license application for ABP 501  a biosimilar candidate to adalimumab",
        "date": "07122016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen to discuss data supporting biologics license application for ABP 501 "
    },
    {
        "content": "July 11 Novartis AG's cheaper version of Amgen Inc's blockbuster arthritis drug Enbrel is highly similar in potency and safety to the original  according to a review by Food and Drug Administration staff.",
        "date": "07112016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 3-Novartis copy of Amgen arthritis drug highly similar -FDA staff "
    },
    {
        "content": "July 11 Novartis AG's cheaper version of Amgen Inc's blockbuster arthritis drug Enbrel is highly similar in potency and safety to the original  according to a review by Food and Drug Administration staff.",
        "date": "07112016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "CORRECTED-UPDATE 2-Novartis copy of Amgen arthritis drug highly similar -FDA staff "
    },
    {
        "content": "Amgen Inc's version of AbbVie Inc's Humira arthritis drug  the world's top-selling medicine  appears similar in potency and safety to the original product  U.S. Food and Drug Administration staff members said on Friday.",
        "date": "07082016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen drug appears 'highly similar' to Humira: FDA staff "
    },
    {
        "content": "July 8 Amgen Inc's version of AbbVie Inc's Humira arthritis drug  the world's top-selling medicine  appears similar in potency and safety to the original product  U.S. Food and Drug Administration staff members said on Friday.",
        "date": "07082016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 3-Amgen drug appears 'highly similar' to Humira -FDA staff "
    },
    {
        "content": "NEW YORK  June 30 Doctors and hospitals in the United States received $7.52 billion in payments and ownership and investment interests from the makers of drugs and medical devices in 2015  according to data released by a government health agency.",
        "date": "06302016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "UPDATE 2-U.S. doctors  hospitals paid billions by drug  device makers - gov't "
    },
    {
        "content": "* Amgen announces FDA advisory committee meeting to review ABP 501  a biosimilar candidate to adalimumab",
        "date": "06132016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen announces FDA advisory committee meeting to review ABP 501 "
    },
    {
        "content": "* Amgen announces expiration and final results of senior notes exchange offers  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06102016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen announces expiration  final results of senior notes exchange offers "
    },
    {
        "content": "June 8 An experimental drug for prevention of chronic migraine headaches from Amgen Inc met the main goal of a midstage study by reducing the number of monthly attacks compared with a placebo  the company said on Wednesday.",
        "date": "06082016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen says migraine prevention drug meets main goal of study "
    },
    {
        "content": "* Amgen receives positive CHMP opinion to extend indication of Kyprolis\u007f (carfilzomib) for the treatment of relapsed multiple myeloma",
        "date": "05272016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen receives positive CHMP opinion to extend indication of Kyprolis "
    },
    {
        "content": "* Amgen announces pricing terms of senior notes exchange offers  Source text for Eikon:  Further company coverage:",
        "date": "05252016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen announces pricing terms of senior notes exchange offers "
    },
    {
        "content": "France's Sanofi SA  is preparing to name candidates it will put forward to replace the entire board of U.S. cancer drug company Medivation Inc  as early as Wednesday  according to people familiar with the matter.",
        "date": "05252016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Exclusive: Sanofi to unveil challenge to Medivation's board - sources "
    },
    {
        "content": "French drugmaker Sanofi  named eight candidates to replace the entire board of Medivation Inc  on Wednesday  stepping up pressure on the U.S. cancer drug company which has rejected its $9.3 billion takeover approach.",
        "date": "05252016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Sanofi moves to oust Medivation board in $9.3 billion takeover fight "
    },
    {
        "content": "NEW YORK  May 12 Regeneron Pharmaceuticals  Chief Executive Leonard Schleifer on Thursday took aim at an influential drug pricing watchdog  saying a critique of the company's new cholesterol lowering therapy was non-scientific.",
        "date": "05122016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Regeneron CEO says drug price critique by independent group unscientific "
    },
    {
        "content": "NEW YORK  May 11 Cigna Corp signed deals that will pay the makers of Repatha and Praluent  two powerful but pricey cholesterol lowering treatments  based on how well their customers respond to the medicines  the health insurer said on Wednesday.",
        "date": "05112016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Cigna makes deals with Amgen  Sanofi for pricey cholesterol drugs "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 13 (Fitch) Fitch Ratings has assigned a 'BBB' rating to Amgen  Inc.'s (Amgen) notes offering. The company intends to use the net proceeds from  this offering to repay select outstanding notes. The Rating Outlook is Stable.  The ratings apply to $34.5 billion of debt outstanding at Mar. 31  2016. A full  list of Amgen's ratings can be found at the end of this release. KEY RATING DRIVERS --At 3.1x gross debt-to-EBITDA  Amgen'",
        "date": "05132016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Fitch Rates Amgen Inc. Notes Offering 'BBB'; Outlook Stable "
    },
    {
        "content": "May 13 France's Sanofi SA was moving ahead on Friday with preparations to replace Medivation Inc's  board of directors after the U.S. cancer drug maker refused to engage with it in sale talks based on a $9.3 billion acquisition offer.",
        "date": "05132016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Sanofi presses on with threat to oust Medivation's board "
    },
    {
        "content": "LONDON Two rival cholesterol-lowering injections from Sanofi and Amgen have been recommended by Britain's healthcare cost watchdog after the manufacturers offered special discounts to the country's state-run health service.",
        "date": "05052016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Sanofi  Amgen cholesterol drugs win UK backing after price cuts "
    },
    {
        "content": "* Xbiotech appoints Amgen veteran Scott Whitehurst as chief financial officer",
        "date": "05032016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Xbiotech appoints Amgen veteran Scott Whitehurst as CFO "
    },
    {
        "content": "Amgen Inc on Thursday reported much higher-than-expected first-quarter profit as sales of several key drugs beat Wall Street estimates  and the company significantly raised its full-year earnings forecast.",
        "date": "04282016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen profit sails past Street expectations; raises 2016 outlook "
    },
    {
        "content": "* Q1 earnings per share view $2.60 -- Thomson Reuters I/B/E/S",
        "date": "04282016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen Q1 adjusted earnings per share $2.90 "
    },
    {
        "content": "April 28 Amgen Inc on Thursday reported much higher-than-expected first-quarter profit as sales of several key drugs exceeded Wall Street estimates  and the company significantly raised its full-year earnings forecast.",
        "date": "04282016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen profit tops Street expectations; raises 2016 outlook "
    },
    {
        "content": "* Says CEO Robert A. Bradway FY 2015 total compensation $16.1 million versus $14 million in FY 2014 - SEC Filing",
        "date": "04072016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen CEO's FY 2015 total compensation was $16.1 mln vs $14 mln in FY 2014 - SEC Filing "
    },
    {
        "content": "* Janssen announces discontinuation of Fulranumab phase 3 development program in Osteoarthritis pain",
        "date": "03312016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Janssen Pharmaceuticals terminates licensing agreement with Amgen for Fulranumab "
    },
    {
        "content": "A federal jury upheld the validity of two Amgen Inc patents related to the company's newly-approved drug to reduce bad cholesterol  in a defeat for Sanofi SA and Regeneron Pharmaceuticals Inc  which make a rival drug.",
        "date": "03162016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen beats Sanofi  Regeneron at cholesterol drug trial "
    },
    {
        "content": "March 16 A federal jury upheld the validity of two Amgen Inc patents related to the company's newly-approved drug to reduce bad cholesterol  in a defeat for Sanofi SA and Regeneron Pharmaceuticals Inc  which make a rival drug.",
        "date": "03162016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 2-Amgen beats Sanofi  Regeneron at cholesterol drug trial "
    },
    {
        "content": "NEW YORK  March 3 Calls in the U.S. presidential campaign to cut pharmaceutical prices are not helping to revive a barely two-month-old exchange-traded fund that invests in shares of generic drugmakers.",
        "date": "03032016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Generic drug ETF ailing despite political focus on high drug prices "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 23 (Fitch) Fitch Ratings has assigned Amgen Inc.'s (Amgen)  Swiss franc-denominated notes offering a 'BBB' rating.  The company intends to use the net proceeds from this issue to repay outstanding  indebtedness  including borrowings under a term loan credit agreement  to  repurchase shares of common stock and for general corporate purposes.  The notes are rated at the same level as Amgen's Long-term Issuer Default  Rat",
        "date": "02232016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Fitch Rates Amgen Inc. Swiss Franc Notes 'BBB'; Outlook Stable "
    },
    {
        "content": "* Frame study met all primary endpoints by reducing the incidence of new vertebral fracture through 12 and 24 months",
        "date": "02222016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen and UCB announce positive top-line results from the phase 3 study of Romosozumab in postmenopausal women with Osteoporosis "
    },
    {
        "content": "* Amgen and UCB announce positive top-line results from the phase 3 study of romosozumab in postmenopausal women with osteoporosis",
        "date": "02222016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-UCB and Amgen announce positive top-line results from phase 3 study of Romosozumab "
    },
    {
        "content": "Feb 15 Biopharmaceutical company Amgen Inc  said on Monday its Aranesp drug met its primary goal of reducing the incidence of red blood cell transfusions in anemic patients suffering from Myelodysplastic Syndromes (MDS) in a phase 3 trial.",
        "date": "02152016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen blood cell disorder drug meets primary goal in phase 3 trial "
    },
    {
        "content": "* Biocartis and Amgen collaborate to offer rapid RAS biomarker testing to selected hospitals and clinics in Brazil  Canada  Colombia  Mexico  Saudi Arabia  Spain and Turkey",
        "date": "02032016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Biocartis and Amgen collaborate on rapid RAS biomarker testing "
    },
    {
        "content": "WASHINGTON  Jan 25 The U.S. Supreme Court on Monday handed a victory to Amgen Inc by throwing out a ruling in favor of current and former employees who say they lost money by investing in the pharmaceutical company's own stock-ownership plan.",
        "date": "01252016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "U.S. top court rules for Amgen over employee lawsuit "
    },
    {
        "content": "Amgen Inc's  fourth-quarter earnings soundly beat estimates on higher sales of its blockbuster rheumatoid arthritis drug Enbrel and lower costs  and the world's largest biotechnology company raised its 2016 profit forecast.",
        "date": "01282016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen fourth quarter profit tops street; raises 2016 forecast "
    },
    {
        "content": "Jan 28 Amgen Inc's fourth-quarter earnings soundly beat estimates on higher sales of its blockbuster rheumatoid arthritis drug Enbrel and lower costs  and the world's largest biotechnology company raised its 2016 profit forecast.",
        "date": "01282016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 2-Amgen 4th quarter profit tops Street; raises 2016 forecast "
    },
    {
        "content": "Jan 28 Amgen Inc on Thursday reported much higher-than-expected fourth-quarter earnings  helped by increased sales of its blockbuster rheumatoid arthritis drug Enbrel and lower costs  and the company raised its 2016 profit forecast.",
        "date": "01282016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen 4th quarter profit tops Street estimates as costs fall "
    },
    {
        "content": "Jan 11 Baxalta Inc and Coherus Biosciences Inc said their experimental biosimilar of Amgen Inc's arthritis drug Enbrel met the main goal in a late-stage study.",
        "date": "01112016",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "UPDATE 1-Baxalta-Coherus Enbrel biosimilar succeeds in late-stage study "
    },
    {
        "content": "Jan 14 U.S. patent officials on Thursday denied petitions by Amgen to review two formulation patents on AbbVie's Humira  a potential setback in Amgen efforts to market a biosimilar version of the world's top-selling prescription medicine.",
        "date": "01142016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "U.S. patent office rules against Amgen Humira challenge "
    },
    {
        "content": "Jan 14 U.S. patent officials on Thursday denied petitions by Amgen to review two formulation patents on AbbVie's Humira  a potential setback in Amgen efforts to market a biosimilar version of the world's top-selling prescription medicine.",
        "date": "01142016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-U.S. patent office rules against Amgen Humira challenge "
    },
    {
        "content": "* Says u.s. Patent office denies amgen challenge to review Humira formulation patents  Source text for Eikon:  Further company coverage:    (Reporting By Bill Berkrot)",
        "date": "01142016",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-U.S. Patent office declines Amgen Humira patent challenges "
    },
    {
        "content": "* \u007fAnnounced that Amgen Inc.  USA  will acquire 100 pct of Catherex  Inc.  USA  a spin-off of Medigene\u007f\u007f",
        "date": "12212015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Medigene says \u007fAmgen acquires medigene spin-off\u007f "
    },
    {
        "content": "Dec 14 Amgen Inc on Monday said it had reached a deal with British drugmaker GlaxoSmithKline to reacquire the sales rights to three of its products in 48 countries  including Australia as well as markets in Asia  South America and Europe.",
        "date": "12142015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen reacquires rights to three drugs from Glaxo in 48 countries "
    },
    {
        "content": "Nov 25 Amgen Inc on Wednesday said it filed with U.S. health regulators seeking approval to sell its first biosimilar drug  which would be a less expensive alternative to AbbVie's Humira  the world's top-selling prescription medicine.",
        "date": "11252015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen files for U.S. approval of biosimilar to Humira "
    },
    {
        "content": "LONDON  Nov 18 Amgen's new injectable cholesterol drug Repatha has been turned down for use on Britain's state health service  underscoring a worldwide debate about the value of such pricey medicines.",
        "date": "11182015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UK cost watchdog turns down Amgen's new cholesterol drug "
    },
    {
        "content": "LONDON  Nov 18 Amgen's new injectable cholesterol drug Repatha has been turned down for use on Britain's state health service  underscoring a worldwide debate about the value of such pricey medicines.",
        "date": "11182015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-UK cost watchdog turns down Amgen's new cholesterol drug "
    },
    {
        "content": "ZURICH The U.S. Food and Drug Administration has accepted Novartis unit Sandoz's submission for approval of a biosimilar version of U.S.-based Amgen's Neulasta drug that fights infections in cancer patients  the Swiss group said on Wednesday.",
        "date": "11182015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Novartis biosimilar takes aim at Amgen drug Neulasta "
    },
    {
        "content": "ZURICH  Nov 18 The U.S. Food and Drug Administration has accepted Novartis unit Sandoz's submission for approval of a biosimilar version of U.S.-based Amgen's Neulasta drug that fights infections in cancer patients  the Swiss group said on Wednesday.",
        "date": "11182015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-Novartis biosimilar takes aim at Amgen drug Neulasta "
    },
    {
        "content": "U.S. health regulators on Tuesday approved Amgen Inc's novel cancer immunotherapy for injection into melanoma lesions and lymph nodes of patients with the deadliest form of skin cancer that returns after initial surgery.",
        "date": "10272015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "FDA approves Amgen's injected immunotherapy for melanoma "
    },
    {
        "content": "Oct 27 U.S. health regulators on Tuesday approved Amgen Inc's novel cancer immunotherapy for injection into melanoma lesions and lymph nodes of patients with the deadliest form of skin cancer that returns after initial surgery.",
        "date": "10272015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 2-FDA approves Amgen's injected immunotherapy for melanoma "
    },
    {
        "content": "Amgen Inc  on Wednesday reported much higher-than-expected third-quarter profit  helped by a 30-percent spike in revenue from the rheumatoid arthritis drug Enbrel due to price increases and inventory stocking.",
        "date": "10282015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen profit beats Street  issues conservative 2016 forecast "
    },
    {
        "content": "Oct 28 Amgen Inc on Wednesday reported much higher-than-expected third-quarter profit  helped by a 30-percent spike in revenue from the rheumatoid arthritis drug Enbrel due to price increases and inventory stocking.",
        "date": "10282015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 2-Amgen profit beats Street  issues conservative 2016 forecast "
    },
    {
        "content": "* Amgen says expects Japanese approval of Repatha cholesterol lowering drug in 1H 2016",
        "date": "10282015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen to raise quarterly dividend 27 percent "
    },
    {
        "content": "Oct 28 Amgen Inc on Wednesday reported much higher-than-expected third quarter profit  driven in part by a 30 percent spike in sales of the blockbuster rheumatoid arthritis drug Enbrel due to price increases and inventory stocking.",
        "date": "10282015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen 3rd quarter profit sails past Wall Street estimates "
    },
    {
        "content": "LONDON A first-in-class drug from Amgen based on a tumour-killing virus was given a green light by European regulators on Friday  paving the way for its approval within a couple of months.",
        "date": "10232015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen wins EU green light for first virus-based cancer drug "
    },
    {
        "content": "* One of several new drugs for most deadly form of skin cancer",
        "date": "10232015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-Amgen wins EU green light for first virus-based cancer drug "
    },
    {
        "content": "* EU Medicines Agency recommends approval of Amgen Inc's  melanoma drug T-vec",
        "date": "10232015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-EU Medicines Agency backs approval of Amgen's melanoma drug "
    },
    {
        "content": "Oct 16 The most influential source for U.S. oncology treatment guidelines on Friday unveiled ratings aimed at helping doctors and patients assess the costs versus benefits of current therapies for two types of blood cancer.",
        "date": "10162015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "U.S. oncology group rates blood cancer regimens  including cost "
    },
    {
        "content": "Oct 12 The odds that Merck & Co's  high-stakes cholesterol drug will succeed have dropped dramatically after Eli Lilly and Co said its similar medicine failed to reduce heart attacks and strokes  top U.S. heart doctors said.",
        "date": "10132015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Merck cholesterol drug's odds dim after Lilly failure "
    },
    {
        "content": "NEW YORK/ATLANTA  Oct 5 The Pacific trade deal agreed on Monday  which grants biotechnology drug producers less protection than offered by the United States  could put more downward pressures on the costly drugs' pricing in the industry's most lucrative market.",
        "date": "10052015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Pacific trade deal adds to U.S. price quandary for biotech drugs "
    },
    {
        "content": "NEW YORK/ATLANTA The Pacific trade deal agreed on Monday  which grants biotechnology drug producers less protection than offered by the United States  could put more downward pressures on the costly drugs' pricing in the industry's most lucrative market.",
        "date": "10062015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Pacific trade deal adds to U.S. price quandary for biotech drugs "
    },
    {
        "content": "Sept 29 A seven-day selloff of U.S. biotechnology stocks has hit sector investors - especially hedge funds - hard. But some managers say it was overdone and are already eyeing bargains such as Gilead Sciences Inc and Amgen Inc.",
        "date": "09292015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "U.S. biotech bloodbath hits hedge funds but some bargains emerge "
    },
    {
        "content": "Sept 25 European health regulators on Friday conditionally approved Amgen Inc's rare blood cancer drug  Blincyto  which is one of the world's most expensive cancer treatments.",
        "date": "09252015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen's leukemia drug gets conditional European approval "
    },
    {
        "content": "Sept 25 European health regulators on Friday conditionally approved Amgen Inc's rare blood cancer drug  Blincyto  which is one of the world's most expensive cancer treatments.",
        "date": "09252015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-Amgen's leukemia drug gets conditional European approval "
    },
    {
        "content": "Sept 23 Amgen Inc and Allergan Plc  said their drug candidate for lung cancer was found as effective as Roche AG's Avastin in preventing disease progression and improving survival  in a late-stage study.",
        "date": "09232015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen  Allergan say Avastin copycat succeeds in lung cancer study "
    },
    {
        "content": "Sept 23 Amgen Inc and Allergan Plc  said a late-stage study showed their biosimilar candidate for a type of lung cancer was as effective as Roche AG's Avastin in preventing disease progression and improving survival.",
        "date": "09232015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-Amgen  Allergan say Avastin copycat succeeds in lung cancer study "
    },
    {
        "content": "* EU Medicines Agency recommends conditional approval of leukemia drug blincyto from Amgen Inc",
        "date": "09252015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-EU Medicines Agency recommends approval of Amgen's leukemia drug "
    },
    {
        "content": "NEW YORK  Sept 16 The U.S. Securities and Exchange Commission has decided to drop a lawsuit accusing two Dubai men of insider trading in Onyx Pharmaceuticals Inc while the cancer drugmaker was mulling a takeover bid by Amgen Inc .",
        "date": "09162015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "SEC drops Onyx insider trading lawsuit against Dubai men "
    },
    {
        "content": "NEW YORK  Sept 16 A federal judge on Wednesday dismissed the U.S. Securities and Exchange Commission's lawsuit accusing two Dubai men of insider trading in Onyx Pharmaceuticals Inc while the cancer drugmaker was mulling a takeover bid by Amgen Inc.",
        "date": "09162015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-U.S. SEC drops Onyx insider trading lawsuit against Dubai men "
    },
    {
        "content": "Amgen Inc  said it will buy biotechnology company Dezima Pharma B.V.  adding another cholesterol drug to its expanding portfolio of treatments for cardiovascular diseases.",
        "date": "09162015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen to buy Dezima Pharma for $300 million in cash "
    },
    {
        "content": "Sept 16 Amgen Inc said it will buy biotechnology company Dezima Pharma B.V.  adding another cholesterol drug to its expanding portfolio of treatments for cardiovascular diseases.",
        "date": "09162015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-Amgen to buy Dezima Pharma for $300 mln in cash "
    },
    {
        "content": "Sept 16 Amgen Inc said it will buy Netherlands-based Dezima Pharma B.V. for $300 million in cash and up to $1.25 billion in additional payments.",
        "date": "09162015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen to buy Dezima Pharma for $300 mln in cash "
    },
    {
        "content": "Sept 11 Amgen Inc said it had asked the U.S. Food and Drug Administration to approve a monthly single-dosing option for its recently approved cholesterol drug  Repatha.",
        "date": "09112015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen seeks FDA approval for monthly dosing option for Repatha "
    },
    {
        "content": "Sept 11 Amgen Inc said on Friday it had asked the U.S. Food and Drug Administration to approve a monthly single-dosing option for its recently approved cholesterol drug  Repatha.",
        "date": "09112015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-Amgen seeks FDA approval for monthly dosing option for Repatha "
    },
    {
        "content": "* Purchases us biologics manufacturing facility to support growing pipeline",
        "date": "09112015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-AstraZeneca buys manufacturing facility in U.S. from Amgen "
    },
    {
        "content": "* Amgen unsuccessful in attempt to block Zarxio launch   (Adds Amgen comment)",
        "date": "09032015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "UPDATE 3-Novartis launches first U.S. 'biosimilar' drug at 15 pct discount "
    },
    {
        "content": "Amgen Inc said its experimental bone drug was found to be more effective than an already marketed drug in a late-stage study.",
        "date": "09012015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen's bone drug succeeds in late-stage study "
    },
    {
        "content": "LONDON  Sept 1 Novartis and Amgen  are joining forces in the hunt for an Alzheimer's treatment  in the latest sign that drugmakers believe an effective therapy for the memory-robbing disease may be within reach.",
        "date": "09012015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Novartis  Amgen join forces to fight Alzheimer's and migraine "
    },
    {
        "content": "NEW YORK A U.S. appeals court has cleared the way for Novartis AG to launch the first biosimilar drug in the United States as it declined on Wednesday to stop the sale of the company's copycat version of Amgen Inc's  blockbuster cancer drug Neupogen.",
        "date": "09022015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen cannot stop imminent sale of Neupogen copycat -U.S. appeals court "
    },
    {
        "content": "A U.S. appeals court has cleared the way for Novartis AG to launch the first biosimilar drug in the United States as it declined on Wednesday to stop the sale of the company's copycat version of Amgen Inc's blockbuster cancer drug Neupogen.",
        "date": "09022015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen cannot stop imminent sale of Neupogen copycat: appeals court "
    },
    {
        "content": "NEW YORK  Sept 2 A U.S. appeals court has cleared the way for Novartis AG to launch the first biosimilar drug in the United States as it declined on Wednesday to stop the sale of the company's copycat version of Amgen Inc's  blockbuster cancer drug Neupogen.",
        "date": "09022015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 2-Amgen cannot stop imminent sale of Neupogen copycat -U.S. appeals court "
    },
    {
        "content": "NEW YORK  Sept 2 A U.S. appeals court has cleared the path for Novartis AG to launch the first biosimilar drug in the United States as it declined on Wednesday to stop the sale of the company's copycat version of Amgen Inc's  blockbuster cancer drug Neupogen.",
        "date": "09022015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen cannot stop imminent sale of Neupogen copycat: U.S. appeals court "
    },
    {
        "content": "WASHINGTON The U.S. Food and Drug Administration on Thursday approved Amgen Inc's Repatha drug for patients with hereditary forms of high cholesterol and those with cardiovascular disease.",
        "date": "08272015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "FDA approves Amgen's cholesterol-lowering drug Repatha "
    },
    {
        "content": "LONDON Amgen is launching its injectable cholesterol drug in Europe at around half the U.S. price  in a move likely to stoke controversy about the way Americans end up paying far more than others for new medicines.",
        "date": "09012015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Europe gets Amgen cholesterol drug for 50-60 percent of U.S. price "
    },
    {
        "content": "LONDON  Sept 1 Amgen is launching its injectable cholesterol drug in Europe at around half the U.S. price  in a move likely to stoke controversy about the way Americans end up paying far more than others for new medicines.",
        "date": "09012015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Europe gets Amgen cholesterol drug for 50-60 pct of U.S. price "
    },
    {
        "content": "WASHINGTON  Aug 27 The U.S. Food and Drug Administration on Thursday approved Amgen Inc's Repatha drug for patients with hereditary forms of high cholesterol and those with cardiovascular disease.",
        "date": "08272015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 3-FDA approves Amgen's cholesterol-lowering drug Repatha "
    },
    {
        "content": "Canada's Valeant Pharmaceuticals International Inc   is buying rights to AstraZeneca Plc's  late-stage experimental psoriasis drug brodalumab after it was dropped by Amgen Inc  in May.",
        "date": "09012015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Valeant picks up AstraZeneca psoriasis drug after Amgen exit "
    },
    {
        "content": "Sept 1 Canada's Valeant Pharmaceuticals International Inc  is buying rights to AstraZeneca Plc's late-stage experimental psoriasis drug brodalumab after it was dropped by Amgen Inc in May.",
        "date": "09012015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-Valeant picks up AstraZeneca psoriasis drug after Amgen exit "
    },
    {
        "content": "Amgen Inc has reached a $71 million settlement with 48 U.S. states and the District of Columbia to resolve claims that the biotechnology company promoted its popular Enbrel and Aranesp drugs for uses not approved by the federal Food and Drug Administration.",
        "date": "08182015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen pays $71 million to settle Enbrel  Aranesp marketing case "
    },
    {
        "content": "Amgen Inc has reached a $71 million settlement with 48 U.S. states and the District of Columbia to resolve claims that the biotechnology company promoted its popular Enbrel and Aranesp drugs for uses not approved by the federal Food and Drug Administration.",
        "date": "08182015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen pays $71 mln to settle Enbrel  Aranesp marketing case "
    },
    {
        "content": "Aug 18 Amgen Inc has reached a $71 million settlement with 48 U.S. states and the District of Columbia to resolve claims that the biotechnology company promoted its popular Enbrel and Aranesp drugs for uses not approved by the federal Food and Drug Administration.",
        "date": "08182015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-Amgen pays $71 mln to settle Enbrel  Aranesp marketing case "
    },
    {
        "content": "Aug 18 Amgen Inc has reached a $71 million settlement with 48 U.S. states and the District of Columbia to resolve claims that it promoted two of its most popular drugs  Aranesp and Enbrel  for off-label uses.",
        "date": "08182015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen  U.S. states in $71 mln settlement over drug marketing "
    },
    {
        "content": "July 29 Express Scripts Holding Co  the largest pharmacy benefit manager in the United States  on Wednesday said the cost of potent  newly approved cholesterol drugs could \"wreak financial havoc\" among its clients.",
        "date": "07292015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "UPDATE 2-Express Scripts says costly new cholesterol drugs could 'wreak havoc' "
    },
    {
        "content": "(The Day Ahead is an email and PDF publication that includes the day's major stories and events  analyses and other features. To receive The Day Ahead  Eikon users can register at . Thomson One users can register at RT/DAY/US. All times in ET/GMT)       The two U.S. personal care products companies  Procter & Gamble Co and Colgate-Palmolive Co  report results for the fourth-quarter and second quarter  respectively. Both companies  with big operations outside the United States  have been worki",
        "date": "07292015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "What to Watch in the Day Ahead - Thursday  July 30 "
    },
    {
        "content": "* At close: Dow down 0.03 pct  S&P flat  Nasdaq up 0.33 pct   (Updates with stock moves after the bell)",
        "date": "07302015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "US STOCKS-Wall Street ends flat; Expedia flies after the bell "
    },
    {
        "content": "* Says increased FY 2015 adjusted earnings per share outlook to the range of $9.55 to $9.80 from the range of $9.35 to $9.65",
        "date": "07302015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen Q2 GAAP earnings $2.15 per share "
    },
    {
        "content": "July 30 Amgen Inc on Thursday reported higher-than-expected second quarter profit and revenue  helped by strong sales of its Enbrel rheumatoid arthritis drug and cost cutting  and the company raised its full-year forecasts.",
        "date": "07302015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen profit tops Street view  boosts full-year forecast "
    },
    {
        "content": "July 30 Amgen Inc on Thursday reported higher-than-expected second-quarter profit and revenue  helped by strong sales of its Enbrel rheumatoid arthritis drug and cost cutting  and the company raised its full-year forecasts.",
        "date": "07302015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-Amgen profit tops Street view  boosts full-year forecast "
    },
    {
        "content": "NEW YORK  Novartis AG must wait until Sept. 2 to sell the first biosimilar drug to be approved in the United States  a copycat version of Amgen Inc's $1.2 billion-a-year Neupogen  a U.S. appeals court said on Tuesday.",
        "date": "07212015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Novartis blocked from selling Neupogen copycat until Sept. 2 "
    },
    {
        "content": "NEW YORK Novartis AG must wait until Sept. 2 to sell the first biosimilar drug to be approved in the United States  a copycat version of Amgen Inc's $1.2 billion-a-year Neupogen  a U.S. appeals court said on Tuesday.",
        "date": "07212015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Drugmaker Novartis blocked from selling Neupogen copycat until Sept 2 "
    },
    {
        "content": "NEW YORK  July 21 Novartis AG must wait until Sept. 2 to sell the first biosimilar drug to be approved in the United States  a copycat version of Amgen Inc's  $1.2 billion-a-year Neupogen  a U.S. appeals court said on Tuesday.",
        "date": "07212015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 2-Drugmaker Novartis blocked from selling Neupogen copycat until Sept. 2 "
    },
    {
        "content": "* Dow down 0.33 pct  S&P down 0.09 pct  Nasdaq up 0.07 pct   (Updates to open)",
        "date": "07312015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "US STOCKS-Dow  S&P dragged down by poor earnings from Exxon  Chevron "
    },
    {
        "content": "Amgen Inc's cholesterol fighting drug was approved by the European Commission  giving the keenly anticipated treatment a head start over a rival drug being developed by Regeneron Pharmaceuticals Inc and Sanofi SA.",
        "date": "07212015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen wins first approval for new class of cholesterol drugs "
    },
    {
        "content": "July 21 Amgen Inc's cholesterol fighting drug was approved by the European Commission  giving the keenly anticipated treatment a head start over a rival drug being developed by Regeneron Pharmaceuticals Inc and Sanofi SA.",
        "date": "07212015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-Amgen wins first approval for new class of cholesterol drugs "
    },
    {
        "content": "July 16 Amgen Inc on Thursday said some patients with a deadly form of leukemia experienced complete remission after being treated with its Blincyto drug in a midstage clinical trial  results that could eventually lead to an expanded approval of the pricy cancer medicine.",
        "date": "07162015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen reports positive preliminary results on leukemia drug "
    },
    {
        "content": "July 21 Amgen Inc said the European commission approved its keenly anticipated cholesterol fighting drug  Repatha.",
        "date": "07212015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "European regulator approves Amgen's anti-cholesterol drug Repatha "
    },
    {
        "content": "Amgen Inc said its drug met the main goal of improving overall survival in metastatic colorectal cancer patients who have not responded to chemotherapy.",
        "date": "06182015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen's cancer drug meets main goal in late-stage study "
    },
    {
        "content": "June 18 Amgen Inc said its drug met the main goal of improving overall survival in metastatic colorectal cancer patients who have not responded to chemotherapy.",
        "date": "06182015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-Amgen's cancer drug meets main goal in late-stage study "
    },
    {
        "content": "June 18 Amgen Inc said its cancer drug met its main goal of improving overall survival in patients with the third most common form of the disease.",
        "date": "06182015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "CORRECTED-Amgen's cancer drug meets main goal in a late-stage study "
    },
    {
        "content": "WASHINGTON An advisory panel to the U.S. Food and Drug Administration recommended approval of Amgen Inc's cholesterol-lowering drug Repatha on Wednesday  but said it should be used only in patients at high risk of cardiovascular disease.",
        "date": "06102015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "FDA panel backs Amgen's cholesterol drug for high-risk patients "
    },
    {
        "content": "WASHINGTON  June 10 An advisory panel to the U.S. Food and Drug Administration recommended approval of Amgen Inc's cholesterol-lowering drug Repatha on Wednesday  but said it should be used only in patients at high risk of cardiovascular disease.",
        "date": "06102015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-FDA panel backs Amgen's cholesterol drug for high-risk patients "
    },
    {
        "content": "WASHINGTON  June 3 Novartis AG unit Sandoz asked a U.S. appeals court on Wednesday to lift a preliminary injunction barring it from selling its biosimilar Zarxio  a cheaper version of a drug that fends off infections in cancer patients.",
        "date": "06032015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Novartis tries to get U.S. ban lifted on sale of Neupogen copycat "
    },
    {
        "content": "* Roche announces a collaboration with Amgen on a phase 1b study to evaluate the safety and efficacy of talimogene laherparepvec  Amgen's investigational oncolytic immunotherapy  in combination with Roche's investigational anti-PDL1 therapy atezolizumab  in patients with triple-negative breast cancer and colorectal cancer with liver metastases",
        "date": "06022015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Roche says to collaborate with Amgen on cancer study "
    },
    {
        "content": "Amgen Inc said it will terminate a collaboration with AstraZeneca Plc to develop a psoriasis drug after it observed suicidal thoughts in the subjects of a trial.",
        "date": "05222015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen ends partnership with AstraZeneca on psoriasis drug "
    },
    {
        "content": "LONDON  May 19 Amgen's new cholesterol drug Repatha could be recommended for approval in Europe as early as this week  putting it ahead in a race with a rival product from Sanofi.",
        "date": "05192015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen cholesterol drug could get EU green light this week "
    },
    {
        "content": "May 22 Amgen Inc said it will terminate a collaboration with AstraZeneca Plc  to develop a psoriasis drug after it observed suicidal thoughts in the subjects of a trial.",
        "date": "05222015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 2-Amgen ends partnership with AstraZeneca on psoriasis drug "
    },
    {
        "content": "May 22 Amgen Inc said it will terminate a collaboration with AstraZeneca Plc  to develop an inflammation drug after it observed suicidal thoughts in subjects of a trial.",
        "date": "05222015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen ends collaboration with AstraZeneca on inflammation drug "
    },
    {
        "content": "May 22 Amgen Inc's closely watched new cholesterol drug  Repatha  has been recommended for approval in Europe  putting the U.S. drugmaker ahead in a race with rival Sanofi SA.",
        "date": "05222015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen first to win EU backing for new kind of cholesterol drug "
    },
    {
        "content": "* Recommends approval of cholesterol drug Repatha from Amgen Inc",
        "date": "05222015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-EU Medicines Agency gives nod for Amgen's cholesterol drug "
    },
    {
        "content": "May 7 A U.S. appeals court has blocked the sale of Novartis AG's recently approved \"biosimilar\" form of Neupogen  the  blockbuster Amgen Inc drug used to prevent infections in cancer patients.",
        "date": "05072015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "UPDATE 1-Novartis 'biosimilar' drug blocked by U.S. appeals court "
    },
    {
        "content": "Amgen Inc's skin cancer immunotherapy showed enough efficacy in the treatment of melanoma to be given marketing approval  an independent advisory panel to the U.S. Food and Drug Administration said on Wednesday.",
        "date": "04292015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "FDA panel recommends approval for Amgen's skin cancer immunotherapy "
    },
    {
        "content": "April 29 Amgen Inc's skin cancer immunotherapy showed enough efficacy in the treatment of melanoma to be given marketing approval  an independent advisory panel to the U.S. Food and Drug Administration said on Wednesday.",
        "date": "04292015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1- FDA panel recommends approval for Amgen's skin cancer immunotherapy "
    },
    {
        "content": "* Indexes down: Dow 0.23 pct  S&P 0.41 pct  Nasdaq 0.63 pct   (Updates close with volume  Apple gains after the bell)",
        "date": "04272015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "US STOCKS-Wall St ends down as biotechs drop 4 pct; Apple up late "
    },
    {
        "content": "Amgen Inc reported higher first-quarter earnings on Tuesday  helped by price increases for its best-selling drugs  as well as lower spending on research and development.",
        "date": "04212015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "Amgen earnings boosted by higher drug prices  lower R&D "
    },
    {
        "content": "* Indexes down: Dow 0.23 pct  S&P 0.41 pct  Nasdaq 0.63 pct   (Updates to close)",
        "date": "04272015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "US STOCKS-Wall St ends down as biotechs drop 4 pct "
    },
    {
        "content": "The Federal Open Market Committee begins a two-day meeting on interest rate policy. The Fed has already ruled out an April rate hike  so not much is expected from this meeting. Investors will watch for signs that the Fed is getting more comfortable with inflation data.",
        "date": "04272015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "What to Watch in the Day Ahead - Tuesday  April 28 "
    },
    {
        "content": "* Indexes down: Dow 0.04 pct  S&P 0.2 pct  Nasdaq 0.5 pct   (Updates to late afternoon)",
        "date": "04272015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "US STOCKS-Wall St slips as biotechs drop; Apple shares up "
    },
    {
        "content": "April 21 Amgen Inc reported higher first-quarter earnings on Tuesday  helped by price increases for its best-selling drugs  as well as lower spending on research and development.",
        "date": "04212015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 2-Amgen earnings boosted by higher drug prices  lower R&D "
    },
    {
        "content": "* Indexes down: Dow 0.2 pct  S&P 0.3 pct  Nasdaq 0.4 pct   (Updates to early afternoon)",
        "date": "04272015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "US STOCKS-Wall St reverses course to trade lower as health stocks drag "
    },
    {
        "content": "April 21 Amgen Inc reported higher first-quarter earnings on Tuesday  driven by price increases for its biggest-selling drugs  as well as lower spending on research and development.",
        "date": "04212015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen 1st-quarter profit boosted by drug price rises  lower R&D "
    },
    {
        "content": "U.S. Food and Drug Administration staff reviewers said an accelerated review of drugmaker Amgen Inc's skin cancer immunotherapy cannot be considered at this time  citing concerns over the design and results of a key study.",
        "date": "04272015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen's cancer immunotherapy fails to impress FDA staff reviewers "
    },
    {
        "content": "* Amgen says looking forward to discussing study data   (Adds background  Amgen comment; updates shares)",
        "date": "04272015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 2-Amgen's cancer immunotherapy fails to impress FDA staff reviewers "
    },
    {
        "content": "U.S. health regulators on Wednesday approved Amgen Inc's Corlanor to treat patients with chronic heart failure  giving the world's largest biotechnology company its first cardiovascular product.",
        "date": "04152015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "U.S. FDA approves Amgen's Corlanor heart failure drug "
    },
    {
        "content": "April 15 U.S. health regulators on Wednesday approved Amgen Inc's Corlanor to treat patients with chronic heart failure  giving the world's largest biotechnology company its first cardiovascular medicine product.",
        "date": "04152015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "U.S. FDA approves Amgen heart failure drug "
    },
    {
        "content": "NEW YORK A U.S. judge on Thursday denied Amgen Inc's bid to block the sale of Novartis AG's recently approved \"biosimilar\" form of Neupogen  Amgen's blockbuster drug used to prevent infections in cancer patients.",
        "date": "03192015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "U.S. judge rejects Amgen bid to block 'biosimilar' Neupogen "
    },
    {
        "content": "NEW YORK  March 19 A U.S. judge on Thursday denied Amgen Inc's bid to block the sale of Novartis AG's recently approved \"biosimilar\" form of Neupogen  Amgen's blockbuster drug used to prevent infections in cancer patients.",
        "date": "03192015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 2-U.S. judge rejects Amgen bid to block 'biosimilar' Neupogen "
    },
    {
        "content": "March 19 Novartis AG :  * Says it  Amgen both agreed to seek expedited review by U.S. appeals",
        "date": "03192015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Novartis says it  Amgen want expedited appellate review of Neupogen decision "
    },
    {
        "content": "SAN FRANCISCO A U.S. judge on Thursday denied Amgen Inc's bid to block the sale of Novartis AG's  recently approved \"biosimilar\" form of Neupogen  Amgen's blockbuster drug used to prevent infections in cancer patients.",
        "date": "03192015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "U.S. judge rejects Amgen bid to block biosimilar Neupogen "
    },
    {
        "content": "SAN FRANCISCO  March 19 A U.S. judge on Thursday denied Amgen Inc's bid for a preliminary injunction against Novartis AG's Sandoz unit over disputed biologic product filgrastim.",
        "date": "03192015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "U.S. judge rejects Amgen injunction bid against Novartis Sandoz unit "
    },
    {
        "content": "* Amgen seeking to block biosimilar's launch   (Adds Amgen comment)",
        "date": "03062015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "UPDATE 2-Novartis wins approval for first U.S. biosimilar drug "
    },
    {
        "content": "LONDON/LOS ANGELES A revolution is brewing in healthcare with lower-cost copies of complex biotech drugs finally set to reach the United States  nine years after so-called biosimilars were launched in Europe.",
        "date": "03062015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Copy me: Europe shows U.S. a path to cheaper biotech drugs "
    },
    {
        "content": "Feb 17 CVS Health warned on Tuesday that the costs of a potent new class of cholesterol treatments could eclipse those of other expensive medicines and overwhelm the U.S. healthcare system \"if rigid cost control mechanisms are not put in place.\"",
        "date": "02172015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 2-CVS urges cost controls for new cholesterol drugs "
    },
    {
        "content": "Feb 17 CVS Health on Tuesday warned that costs of a potent new class of cholesterol treatments and other specialty drugs in development could eclipse those of expensive new medicines and overwhelm the healthcare system \"if rigid cost control mechanisms are not put in place.\"",
        "date": "02172015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "CORRECTED-UPDATE 1-CVS urges cost controls for new cholesterol  specialty drugs "
    },
    {
        "content": "March 1 Amgen Inc's Kyprolis helped patients with relapsed multiple myeloma live twice as long before their blood cancer worsened compared to a regimen containing rival drug Velcade  according to an interim analysis announced by the company on Sunday.",
        "date": "03022015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "UPDATE 1-Amgen says Kyprolis doubles progression-free survival vs Velcade "
    },
    {
        "content": "Jan 26 Regeneron Pharmaceuticals on Monday said U.S. health regulators accepted its application to review a potent  cholesterol drug on a priority basis  potentially giving it the upper hand in a fierce race with Amgen  to bring a new medicine from the promising class to market.",
        "date": "01262015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Regeneron/Sanofi cholesterol drug gets FDA priority review "
    },
    {
        "content": "Jan 27 Amgen Inc :  * Sees at least $400 million cost saving in 2015 from ongoing restructuring",
        "date": "01272015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen sees at least $400 million cost saving in 2015 "
    },
    {
        "content": "Jan 27 Amgen Inc on Tuesday reported higher-than-expected fourth-quarter profit  driven by strong sales of its blockbuster rheumatoid arthritis drug Enbrel  cost cutting and a tax credit.",
        "date": "01272015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen profit tops expectations on Enbrel sales  tax credit "
    },
    {
        "content": "* Q4 adjusted earnings per share $2.16; q4 gaap earnings per share $1.68; q4 revenue $5.33 billion versus. $5.01 billion",
        "date": "01272015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "BRIEF-Amgen Q4 adj shr $2.16 "
    },
    {
        "content": "Jan 13 Express Scripts  the largest U.S. pharmacy benefit manager  on Tuesday said cost savings on expensive cancer treatments could be achieved if the company were involved earlier in the decision-making process.",
        "date": "01132015",
        "name": "Amgen Inc",
        "news_type": "topStory",
        "symbol": "AMGN",
        "title": "UPDATE 1-Express Scripts sees opportunity to lower cancer treatment cost "
    },
    {
        "content": "Jan 5 Staff reviewers at the U.S. Food and Drug Administration recommended approval for Novartis AG's   copy of Amgen Inc's blockbuster cancer drug Neupogen.",
        "date": "01052015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "FDA staff recommends Novartis copy of Amgen's Neupogen "
    },
    {
        "content": "Jan 5 Staff reviewers at the U.S. Food and Drug Administration recommended approval of Novartis AG's   copy of Amgen Inc's blockbuster cancer drug Neupogen  finding no \"clinically meaningful differences\" between the two.",
        "date": "01052015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 3-FDA staff recommends Novartis copy of Amgen's Neupogen "
    },
    {
        "content": "Jan 5 Amgen Inc and Kite Pharma Inc  said they entered into a deal to develop and market cancer immunotherapies using Amgen's cancer targets and Kite's technology platform.",
        "date": "01052015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "Amgen  Kite Pharma ink deal to develop cancer immunotherapies "
    },
    {
        "content": "Jan 7 A panel to the U.S. Food and Drug Administration unanimously backed the approval of Novartis AG's   copy of Amgen Inc's blockbuster cancer drug Neupogen  paving the way for the regulator's first approval for a biosimilar.",
        "date": "01072015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "FDA panel unanimously backs Novartis' copy of Amgen's Neupogen "
    },
    {
        "content": "Jan 7 A panel to the U.S. Food and Drug Administration unanimously backed the approval of Novartis AG's   copy of Amgen Inc's blockbuster cancer drug Neupogen  setting the stage for the regulator's first approval of a biosimilar.",
        "date": "01072015",
        "name": "Amgen Inc",
        "news_type": "normal",
        "symbol": "AMGN",
        "title": "UPDATE 1-FDA panel unanimously backs Novartis' copy of Amgen's Neupogen "
    }
]