[
    {
        "content": "* Movil has option to sell bulk of stake via convertible bond",
        "date": "11172017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil CFO says has had interest in KPN stake "
    },
    {
        "content": "MEXICO CITY  Nov 13 Mexico's America Movil on Monday said it would push back against \"regulatory subsidies\" for its rivals  less than two weeks after authorities said the telecommunications company could start charging other companies again for connecting to its network.",
        "date": "11132017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Slim's America Movil says rivals get unfair 'subsidies' in Mexico "
    },
    {
        "content": "MEXICO CITY Mexico’s telecommunications regulator said on Thursday that billionaire Carlos Slim's America Movil  could start charging local rivals for mobile calls to its network for the first time since a 2014 sector reform.",
        "date": "11032017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Mexico regulator says America Movil can charge competitors for calls "
    },
    {
        "content": "MEXICO CITY  Nov 2 Mexico’s telecommunications regulator said on Thursday that competitors of billionaire Carlos Slim’s America Movil will have to pay the company 0.028562 peso per minute for mobile calls to its network from Jan. 1.",
        "date": "11022017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Mexico regulator says America Movil can charge competitors for calls "
    },
    {
        "content": "MEXICO CITY  Nov 2 Mexico’s telecommunications regulator said on Thursday that billionaire Carlos Slim's America Movil could start charging local rivals for mobile calls to its network for the first time since a 2014 sector reform.",
        "date": "11032017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 3-Mexico regulator says America Movil can charge competitors for calls "
    },
    {
        "content": "MEXICO CITY For every peso cent Mexican mogul Carlos Slim's America Movil can charge for interconnection fees  the company's competitors in Mexico would collectively pay about $20 million per year  according to estimates from rival AT&T Inc provided to Reuters.",
        "date": "10262017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil's network fees may cost rivals millions: AT&T "
    },
    {
        "content": "MEXICO CITY  Oct 25 Mexican telecommunications company America Movil  whose shares fell more than 6 percent on weak third-quarter results  said on Wednesday it believed it would no longer be barred from charging rivals for mobile calls made to clients on its network.",
        "date": "10252017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "UPDATE 1-America Movil sees end of regulatory drag as results hit shares "
    },
    {
        "content": "MEXICO CITY  Oct 24 Mexican billionaire Carlos Slim's America Movil on Tuesday reported a net loss of 9.55 billion pesos ($525 million) for the third quarter  hampered by the depreciation of the Mexican peso.",
        "date": "10242017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil reports net loss of 9.55 bln pesos in third quarter "
    },
    {
        "content": "MEXICO CITY  Oct 26 For every peso cent Mexican mogul Carlos Slim's America Movil can charge for interconnection fees  the company's competitors in Mexico would collectively pay about $20 million per year  according to estimates from rival AT&T Inc provided to Reuters.",
        "date": "10262017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil's network fees may cost rivals millions -AT&T "
    },
    {
        "content": "MEXICO CITY  Oct 25 The chief executive of Mexican telecoms company America Movil said on Wednesday that he thought there was no way the firm would continue to be barred from charging competitors for mobile calls made to clients on its network.",
        "date": "10252017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil chief thinks zero interconnection rate finished "
    },
    {
        "content": "VIENNA  Oct 24 Telekom Austria  part of Mexican tycoon Carlos Slim's America Movil  increased its full-year revenue forecast thanks to higher income from fixed-line customers and a smaller than expected hit from new EU roaming rules.",
        "date": "10242017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-Telekom Austria raises full-year revenue forecast "
    },
    {
        "content": "VIENNA  Oct 24 Telekom Austria  part of Mexican tycoon Carlos Slim's America Movil  said its third-quarter core profit fell 2.6 percent  largely due to negative currency effects and higher costs in its home market.",
        "date": "10242017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Telekom Austria reports Q3 core profit fall  ups revenue forecast "
    },
    {
        "content": "MEXICO CITY Mexico's telecommunications regulator is discussing a proposal that would allow billionaire Carlos Slim's America Movil to start charging local rivals again for calls made to clients on its network  according to a document seen by Reuters.",
        "date": "10242017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Exclusive: Mexico telecoms regulator to vote on letting Slim's America Movil charge rivals "
    },
    {
        "content": "MEXICO CITY  Oct 25 Shares in America Movil   the telecoms company controlled by Mexican billionaire Carlos Slim  fell by 4 percent after the market opened on Wednesday after the firm posted a net loss of 9.55 billion pesos ($525 million) for the third quarter.",
        "date": "10252017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Shares in Mexico's America Movil fall after third quarter loss "
    },
    {
        "content": "MEXICO CITY Mexican billionaire Carlos Slim's America Movil  on Tuesday reported a net loss of 9.55 billion pesos ($525 million) for the third quarter  with its results dragged down by a costly Colombian arbitration panel ruling.",
        "date": "10252017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Slim's America Movil posts third-quarter loss  hurt by Colombia payment "
    },
    {
        "content": "MEXICO CITY  Oct 24 Mexican billionaire Carlos Slim's America Movil on Tuesday reported a net loss of 9.55 billion pesos ($525 million) for the third quarter  with its results dragged down by a costly Colombian arbitration panel ruling.",
        "date": "10252017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 3-Slim's America Movil posts 3rd-quarter loss  hurt by Colombia payment "
    },
    {
        "content": "AMSTERDAM  Oct 20 Dutch telecoms group KPN said on Friday Chief Executive Eelco Blok is to step down in April  and will be replaced by Maximo Ibarra  the former head of Italian mobile network operator Wind Tre .",
        "date": "10202017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "CORRECTED-UPDATE 1-Dutch telecoms group KPN says CEO to step down  names successor "
    },
    {
        "content": "MEXICO CITY  Oct 5 Mexico's telecommunications regulator IFT on Thursday asked billionaire Carlos Slim's company America Movil to modify a proposal to separate out its fixed-line services  the regulator said in a statement. (Reporting by David Alire Garcia)",
        "date": "10052017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexican telecom regulator asks America Movil to modify separation plan "
    },
    {
        "content": "MEXICO CITY  Sept 28 NBCUniversal/Telemundo and America Movil jointly submitted bids to the Mexican Soccer Federation for media rights to the men’s and women’s Mexico national team for two World Cup cycles  the companies said in a statement on Thursday.",
        "date": "09282017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "NBCUniversal/Telemundo  America Movil bid for Mexico soccer team media rights "
    },
    {
        "content": "MEXICO CITY America Movil  the largest mobile phone operator in Latin America  chaired by Mexico's Carlos Slim  said on Wednesday that it had reached an agreement to sell its 30 percent stake in a group of Mexican soccer clubs.",
        "date": "09062017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil reaches deal to sell stake in soccer clubs "
    },
    {
        "content": "MEXICO CITY  Sept 6 America Movil  the largest mobile phone operator in Latin America  chaired by Mexico's Carlos Slim  said on Wednesday that it had reached an agreement to sell its 30 percent stake in a group of Mexican soccer clubs.",
        "date": "09062017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-America Movil reaches deal to sell stake in soccer clubs "
    },
    {
        "content": "MEXICO CITY  Sept 6 America Movil  the telecommunications giant of Mexican mogul Carlos Slim  said on Wednesday that it had reached an agreement to sell its 30 percent stake in a group of Mexican soccer clubs.",
        "date": "09062017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil says reaches agreement to sell stake in soccer clubs "
    },
    {
        "content": "MEXICO CITY  Aug 31 As Carlos Slim’s America Movil begins to loosen its grip on Mexico’s telecom sector  the company could be the key to more competition in television  another highly saturated Mexican industry  a report released on Thursday said.",
        "date": "08312017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "UPDATE 1-OECD recommends Slim's entry to Mexico TV to spur competition "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 31 (Fitch) Fitch Ratings has downgraded the Long-Term Foreign and Local Currency Issuer Default Ratings (IDR) and senior unsecured notes ratings of America Movil S.A.B. de C.V. (AMX) to 'A-' from 'A'. The Outlook is revised to Stable from Negative. A full list of rating action follows at the end of this release. KEY RATING DRIVERS The downgrade of AMX's ratings to 'A-' from 'A' reflects the company's financial profile de",
        "date": "08312017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Fitch Downgrades America Movil to 'A-'; Outlook Revised to Stable "
    },
    {
        "content": "MEXICO CITY Mexican billionaire Carlos Slim's America Movil said on Tuesday that it had complied with a Colombian arbitration ruling ordering it to pay the government $1.08 billion for wireless telecommunication assets used in the South American nation.",
        "date": "08302017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Carlos Slim's America Movil makes $1 billion payment in Colombia case "
    },
    {
        "content": "MEXICO CITY  Aug 31 As Carlos Slim’s America Movil begins to loosen its grip on Mexico’s telecom sector  the company could be the key to more competition in television  another highly saturated Mexican industry  a report released on Thursday said.",
        "date": "08312017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "OECD recommends Slim's entry to Mexico TV to spur competition "
    },
    {
        "content": "MEXICO CITY  Aug 29 Mexican billionaire Carlos Slim's America Movil said on Tuesday that it had complied with a Colombian arbitration ruling ordering it to pay the government $1.08 billion for wireless telecommunication assets used in the South American nation.",
        "date": "08302017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-Carlos Slim's America Movil makes $1 bln payment in Colombia case "
    },
    {
        "content": "MEXICO CITY  Aug 29 Mexican billionaire Carlos Slim's America Movil said on Tuesday that it had complied with a Colombian arbitration ruling ordering it to compensate the government for wireless telecommunication assets used in the South American nation.",
        "date": "08302017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Carlos Slim's America Movil makes payment in Colombia telecom case "
    },
    {
        "content": "MEXICO CITY  Aug 23 America Movil's Telcel unit and AT&T have reached an agreement regarding roaming services in Mexico  America Movil announced on Wednesday.",
        "date": "08232017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil announces roaming agreement with AT&T for Mexico users "
    },
    {
        "content": "MEXICO CITY Despite a landmark Supreme Court ruling in his favor  Mexican mogul Carlos Slim shouldn't break out the champagne just yet.",
        "date": "08182017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Despite legal victory  America Movil may face tough ride with regulator "
    },
    {
        "content": "MEXICO CITY Mexico's Supreme Court on Wednesday ruled billionaire Carlos Slim's telecommunications company America Movil should not be barred by law from charging competitors certain fees  prompting fears of a rollback of a sweeping antitrust reform.",
        "date": "08172017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Slim's America Movil wins telecom battle in top Mexico court "
    },
    {
        "content": "MEXICO CITY  Aug 16 The Mexican Supreme Court on Wednesday unanimously found billionaire Carlos Slim's telecom firm America Movil should not be barred by law from charging its rivals interconnection fees  in a setback to a reform intended to curb the firm's dominance.",
        "date": "08162017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Mexican Supreme Court favors Slim's America Movil in telecom reform battle "
    },
    {
        "content": "MEXICO CITY  Aug 16 Mexico's Supreme Court on Wednesday ruled billionaire Carlos Slim's telecommunications company America Movil should not be barred by law from charging competitors certain fees  prompting fears of a rollback of a sweeping antitrust reform.",
        "date": "08172017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 6-Slim's America Movil wins telecom battle in top Mexico court "
    },
    {
        "content": "MEXICO CITY  Aug 10 A Mexican Supreme Court justice on Thursday favored America Movil's stance that the country's telecommunications regulator should decide whether it can charge interconnection fees to its rivals  although the issue must still be decided by a full court panel.",
        "date": "08102017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "One Mexican justice sides with Slim's America Movil ahead of key vote "
    },
    {
        "content": "MEXICO CITY America Movil  the telecommunications company of Mexican tycoon Carlos Slim  and Movistar  the Colombian unit of Spain's Telefonica SA  may not have to pay any compensation while legal action in Colombia is under review  a government minister said on Wednesday.",
        "date": "07272017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Shares in Slim's America Movil shrug off Colombian order to pay $1 billion "
    },
    {
        "content": "MEXICO CITY  July 19 Claro CR Telecomunicaciones  the Costa Rican unit of Mexico's telecommunications giant America Movil  was awarded at auction on Wednesday two new concessions  the Mexican firm said in a statement.",
        "date": "07202017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil's Costa Rican unit wins two concessions at auction "
    },
    {
        "content": "MEXICO CITY Mexican billionaire Carlos Slim's America Movil  expects regulatory approval to separate part of its Telmex unit by the end of 2017 or early next year  its chief executive said on Wednesday.",
        "date": "07192017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil sees approval of partial Telmex separation by year-end "
    },
    {
        "content": "MEXICO CITY  July 19 Mexican billionaire Carlos Slim's America Movil expects regulatory approval to separate part of its Telmex unit by the end of 2017 or early next year  its chief executive said on Wednesday.",
        "date": "07192017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 2-America Movil sees approval of partial Telmex separation by year-end "
    },
    {
        "content": "MEXICO CITY  July 19 Mexican telecoms firm America Movil expects to have approval from the country's telecoms regulator to separate part of its Telmex unit in the fourth quarter of this year or the first quarter of 2018  Chief Executive Daniel Hajj said on Wednesday.",
        "date": "07192017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil sees approval for partial Telmex separation by Q1 "
    },
    {
        "content": "MEXICO CITY America Movil  Latin America's largest telecommunications company by number of subscribers  posted an 86 percent increase in net profit in its second quarter  helped by the peso's gains.",
        "date": "07192017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil quarterly net profit rises 86 percent "
    },
    {
        "content": "MEXICO CITY Mexican billionaire Carlos Slim's America Movil  said on Monday it was auditing its Guatemalan unit after an investigation in the country raised questions about payments made by a former executive at the telecoms company.",
        "date": "07172017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil audits Guatemala unit after questions surface over payments "
    },
    {
        "content": "MEXICO CITY  July 18 America Movil  Latin America's largest telecommunications company by number of subscribers  posted an 86 percent increase in net profit in its second quarter  helped by the peso's gains.",
        "date": "07192017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 2-America Movil quarterly net profit rises 86 percent "
    },
    {
        "content": "MEXICO CITY  July 18 America Movil  Latin America's largest telecommunications firm by number of subscribers  posted an 86 percent increase in net profit in its second quarter.",
        "date": "07182017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil posts strong gains in Q2 profit "
    },
    {
        "content": "MEXICO CITY  July 18 Samsung Electronics Co. and America Movil  the telecoms company controlled by Mexican billionaire Carlos Slim  said in a joint statement on Tuesday they had signed an agreement to provide the latest technology to Latin American consumers.",
        "date": "07182017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Samsung  America Movil announce partnership in Latin America "
    },
    {
        "content": "MEXICO CITY  July 18 Samsung Electronics Co Ltd and America Movil  the telecoms company controlled by Mexican billionaire Carlos Slim  said on Tuesday they had signed an agreement to provide the latest technology to Latin American consumers.",
        "date": "07182017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-Samsung  America Movil announce partnership in Latin America "
    },
    {
        "content": "VIENNA  July 18 Telekom Austria  a unit of Mexican tycoon Carlos Slim's America Movil  reported a 7.8 percent rise in second-quarter core profit  helped by strong demand in its home market and in Belarus.",
        "date": "07182017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-Telekom Austria Q2 core profit up 8 pct  helped by solid home market "
    },
    {
        "content": "MEXICO CITY  July 5 Billionaire Carlos Slim's America Movil argued on Wednesday against rules brought in by an overhaul of the country's telecommunications industry  saying in a statement they were unfair and had led to a loss of its business rights.",
        "date": "07062017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's America Movil details argument in telecom dispute "
    },
    {
        "content": "France's JCDecaux  will create a joint venture with Mexican telecommunications group America Movil  it said on Tuesday  as part of the outdoor advertising company's drive to expand in Latin America.",
        "date": "06272017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "France's JCDecaux  America Movil create joint advertising venture in Mexico "
    },
    {
        "content": "June 27 France's JCDecaux will create a joint venture with Mexican telecommunications group America Movil  it said on Tuesday  as part of the outdoor advertising company's drive to expand in Latin America.",
        "date": "06272017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-France's JCDecaux  America Movil create joint advertising venture in Mexico "
    },
    {
        "content": "MEXICO CITY  June 21 Mexico's Supreme Court ruled on Wednesday in a spat over interconnection rates paid between telecommunications firm America Movil and rivals that touches on a bigger case related to an antitrust reform the company is fighting.",
        "date": "06222017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's Supreme Court rules in spat related to telecom reform "
    },
    {
        "content": "June 27 France's JCDecaux said on Tuesday it will create a joint venture with Mexican telecommunications group America Movil by merging their out of home (OOH) advertising businesses.",
        "date": "06272017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "France's JCDecaux  America Movil create joint venture in Mexico "
    },
    {
        "content": "* JCDECAUX AND AMÉRICA MÓVIL TO CREATE A JOINT VENTURE BY MERGING THEIR OOH BUSINESSES IN MEXICO",
        "date": "06272017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "BRIEF-JCDecaux and América Móvil to create a joint venture in Mexico "
    },
    {
        "content": "MEXICO CITY  May 18 Billionaire Carlos Slim's telecommunications giant America Movil plans to roll out a 4.5G network in Mexico by the end of the year  and gear up for 5G by 2020  CEO Daniel Hajj said at a news conference in Mexico City on Thursday.",
        "date": "05182017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Carlos Slim's America Movil to roll out 4.5G network this year "
    },
    {
        "content": "MEXICO CITY Mexican billionaire Carlos Slim's America Movil  has received a green light from the telecoms regulator IFT to buy rights to 60 megahertz of spectrum from Grupo MVS  the telecoms giant said on Thursday.",
        "date": "05052017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Mexico's America Movil gets approval to buy spectrum from Grupo MVS "
    },
    {
        "content": "MEXICO CITY  May 4 Mexican billionaire Carlos Slim's America Movil has received a green light from the telecoms regulator IFT to buy rights to 60 megahertz of spectrum from Grupo MVS  the telecoms giant said on Thursday.",
        "date": "05052017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-Mexico's America Movil gets approval to buy spectrum from Grupo MVS "
    },
    {
        "content": "MEXICO CITY  May 4 Mexican billionaire Carlos Slim's America Movil has received a green light from the telecoms regulator to buy rights to 60 MHz of spectrum from Grupo MVS  the telecoms giant said on Thursday.",
        "date": "05042017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Mexico's America Movil gets approval to buy spectrum from MVS "
    },
    {
        "content": "MEXICO CITY  April 26 Mexican telecoms company America Movil has submitted its proposal for separating a part of its fixed-line unit Telmex from the rest of the company  and expects approval in coming months  a company executive said Wednesday.",
        "date": "04262017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil expects approval for Telmex plan in months "
    },
    {
        "content": "VIENNA  April 24 Telekom Austria  a unit of Mexican tycoon Carlos Slim's America Movil  reported a 1.5 percent rise in first-quarter core profit  helped by currency effects.",
        "date": "04242017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "UPDATE 1-Telekom Austria's Q1 core profit slightly up helped by one-offs "
    },
    {
        "content": "MEXICO CITY Mexican billionaire Carlos Slim's telecoms company America Movil  posted a sevenfold increase in first-quarter net profit on Tuesday  beating analyst expectations as the peso appreciated against the dollar and euro.",
        "date": "04252017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Mexico America Movil profit surges on forex gains "
    },
    {
        "content": "MEXICO CITY Mexican billionaire Carlos Slim's America Movil  is likely to report a nearly 500 percent jump in first-quarter net profit next week  helped by favorable exchange rates in its key markets  according to a poll of six analysts.",
        "date": "04192017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil's first-quarter profit seen surging on forex changes "
    },
    {
        "content": "MEXICO CITY  April 25 Mexican billionaire Carlos Slim's telecoms company America Movil posted a sevenfold increase in first-quarter net profit on Tuesday  beating analyst expectations as the peso appreciated against the dollar and euro.",
        "date": "04252017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 2-Mexico America Movil profit surges on forex gains "
    },
    {
        "content": "MEXICO CITY  April 25 Mexican billionaire Carlos Slim's telecoms company America Movil reported on Tuesday a 35.85 billion peso ($1.91 billion) first-quarter net profit. ($1 = 18.7275 on March 31) (Reporting by Anthony Esposito; Editing by James Dalgleish)",
        "date": "04252017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Slim's America Movil posts $1.91 bln 1st-quarter net profit "
    },
    {
        "content": "MEXICO CITY Mexican billionaire Carlos Slim's America Movil said on Tuesday it plans to ask shareholders at an April 5 meeting to approve up to 3 billion pesos ($158 million) in share buybacks between April 2017 and April 2018.",
        "date": "03282017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil plans up to 3 billion pesos in share buybacks "
    },
    {
        "content": "MEXICO CITY  March 28 Mexican billionaire Carlos Slim's America Movil said on Tuesday it plans to ask shareholders at an April 5 meeting to approve up to 3 billion pesos ($158 million) in share buybacks between April 2017 and April 2018.",
        "date": "03282017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil plans up to 3 bln pesos in share buybacks "
    },
    {
        "content": "MEXICO CITY Antitrust measures announced last week that would split up Carlos Slim's America Movil and open its fixed line network to competition may help Mexico's dominant telecommunications provider reduce labor costs  according to a labor union spokesman.",
        "date": "03172017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Antitrust move may let America Movil cut labor costs: union "
    },
    {
        "content": "MEXICO CITY  March 16 Antitrust measures announced last week that would split up Carlos Slim's America Movil and open its fixed line network to competition may help Mexico's dominant telecommunications provider reduce labor costs  according to a labor union spokesman.",
        "date": "03172017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Antitrust move may let America Movil cut labor costs - union "
    },
    {
        "content": "MEXICO CITY Shares of billionaire Carlos Slim's America Movil slumped on Thursday after regulators ratcheted up antitrust measures aimed at breaking Slim's hold on Mexican telecoms  adding uncertainty to the outlook for his principal cash cow.",
        "date": "03092017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Antitrust rules batter America Movil as uncertainty bites "
    },
    {
        "content": "MEXICO CITY  March 9 Shares of billionaire Carlos Slim's America Movil slumped on Thursday after regulators ratcheted up antitrust measures aimed at breaking Slim's hold on Mexican telecoms  adding uncertainty to the outlook for his principal cash cow.",
        "date": "03092017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 2-Antitrust rules batter America Movil as uncertainty bites "
    },
    {
        "content": "MEXICO CITY  March 9 Mexico's telecoms regulator said on Thursday that billionaire Carlos Slim's America Movil  has 65 working days to present a proposal for the legal separation of a part of its fixed-line unit Telmex.",
        "date": "03092017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's America Movil has 65 days to propose separation plan- IFT "
    },
    {
        "content": "MEXICO CITY  March 9 Shares of America Movil   the telecoms giant controlled by billionaire Carlos Slim  slumped on Thursday after the company said the Mexican telecoms regulator had stepped up antitrust rules against it.",
        "date": "03092017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil stock falls after regulator toughens antitrust rules "
    },
    {
        "content": "MEXICO CITY Billionaire Carlos Slim's America Movil said on Wednesday that the Mexican telecommunications regulator had stepped up antitrust rules against the company  including ordering it to separate out part of its fixed-line infrastructure.",
        "date": "03092017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico cranks up antitrust rules against Slim's America Movil "
    },
    {
        "content": "MEXICO CITY  March 8 Billionaire Carlos Slim's America Movil said on Wednesday that the Mexican telecommunications regulator had stepped up antitrust rules against the company  including ordering it to separate out part of its fixed-line infrastructure.",
        "date": "03092017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 2-Mexico cranks up antitrust rules against Slim's America Movil "
    },
    {
        "content": "MEXICO CITY  March 8 Billionaire Carlos Slim's America Movil said on Wednesday that the Mexican telecommunications regulator had stepped up antitrust rules against the company  including ordering it to separate out part of its fixed-line infrastructure.",
        "date": "03092017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico steps up antitrust rules against Slim's America Movil "
    },
    {
        "content": "MEXICO CITY Mexico's telecoms regulator has discussed forcing billionaire Carlos Slim to legally separate part of his fixed-line unit Telmex from the rest of the company  people familiar with the matter said  a move that would intensify antitrust rules against the company.",
        "date": "03012017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Exclusive: Mexico may force Slim's America Movil to separate fixed unit - sources "
    },
    {
        "content": "SAO PAULO  Feb 14 Brazilian billionaire Edson de Godoy Bueno  who built a healthcare empire in his country that became UnitedHealth Group Inc's platform to expand in Latin America  died on Tuesday.",
        "date": "02142017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Billionaire Bueno  UnitedHealth's Latin America chairman  dies "
    },
    {
        "content": "MEXICO CITY  Feb 3 Mexico's America Movil expects a regulatory review of antitrust rules in place against it to be published in the first quarter  Chief Executive Daniel Hajj said on Friday.",
        "date": "02032017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil expects Mexico antitrust review in 1st-qtr "
    },
    {
        "content": "MEXICO CITY Shares in America Movil  slumped 3.7 percent on Friday  after the telecom company controlled by the family of Mexican billionaire Carlos Slim posted its largest loss in 15 years in the fourth quarter.",
        "date": "02032017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Shares in Mexico mogul Slim's America Movil slump on surprise Q4 loss "
    },
    {
        "content": "MEXICO CITY Mexico's America Movil  suffered its largest loss in 15 years in the fourth quarter  as higher financial costs dragged on the giant telecoms company amid shrinking margins at home.",
        "date": "02032017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's America Movil suffers biggest loss in 15 years "
    },
    {
        "content": "MEXICO CITY  Feb 2 Mexico's America Movil  suffered its largest loss in 15 years in the fourth quarter  as higher financial costs dragged on the giant telecoms company amid shrinking margins at home.",
        "date": "02032017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 2-Mexico's America Movil suffers biggest loss in 15 years "
    },
    {
        "content": "MEXICO CITY  Feb 2 Mexican telecoms company America Movil on Thursday said it swung to an almost 6 billion peso ($289 million) net loss in the fourth quarter.",
        "date": "02032017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Slim's America Movil reports surprise 4th-qtr loss "
    },
    {
        "content": "VIENNA  Jan 30 Telekom Austria  a unit of Mexican tycoon Carlos Slim's America Movil  confirmed a fall in its full-year core profit  largely due to tough price competition which it expects to persist in 2017.",
        "date": "01302017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "UPDATE 1-Persistent price pressure take toll on Slim's Telekom Austria "
    },
    {
        "content": "MEXICO CITY  Jan 17 Mexican tycoon Carlos Slim's cell-phone company  America Movil  said on Tuesday it would launch a television channel in the United States targeting  Mexican audiences later this year  putting it into competition with broadcasters like Univision and Telemundo.",
        "date": "01182017",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's Slim to launch TV channel in U.S. for Mexicans "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 09 (Fitch) Today Fitch Ratings launches its Spotlight series of  the 20 most \"in the news\" Latin American issuers  starting with America Movil's  struggle to deleverage amidst a difficult operating environment in Mexico.  One report will be released each day through Feb. 6  2017  following the  schedule at the end of this release. \"Fitch sees no signs of recovery in the Mexican market  due to intense  competition leadin",
        "date": "01092017",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Fitch Launches Spotlight Series on LatAm Corporates with America Movil "
    },
    {
        "content": "MEXICO CITY Mexican telecoms giant America Movil   controlled by tycoon Carlos Slim  said on Monday its Mexican unit had reached an agreement to provide a national roaming service to its main competitor in the local market  Telefonica Mexico.",
        "date": "12062016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Mexico's America Movil to provide national roaming service to Telefonica Mexico "
    },
    {
        "content": "MEXICO CITY Billionaire Carlos Slim's America Movil said on Monday that its wireless subsidiary had agreed to buy spectrum for mobile devices from Mexico's Grupo MVS  which would increase Mexico's dominant player's offer of high-speed data services.",
        "date": "11292016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil agrees to buy mobile spectrum from Grupo MVS "
    },
    {
        "content": "MEXICO CITY  Nov 28 Billionaire Carlos Slim's America Movil said on Monday that its wireless subsidiary had agreed to buy 60 MHz of spectrum in the 2.5 GHz band from Mexico's Grupo MVS.",
        "date": "11282016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil agrees to buy 60 MHz of spectrum from Grupo MVS "
    },
    {
        "content": "MEXICO CITY  Nov 28 Billionaire Carlos Slim's America Movil said on Monday that its wireless subsidiary had agreed to buy spectrum for mobile devices from Mexico's Grupo MVS  which would increase Mexico's dominant player's offer of high-speed data services.",
        "date": "11292016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-America Movil agrees to buy mobile spectrum from Grupo MVS "
    },
    {
        "content": "MEXICO CITY Mexican telecoms company America Movil  on Thursday said it swung to a profit in the third quarter  thanks to stronger data revenues and lower foreign exchange losses.",
        "date": "10282016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Mexico's America Movil swings to profit  helped by data use "
    },
    {
        "content": "MEXICO CITY  Oct 27 Mexican telecoms company America Movil on Thursday said it swung to a profit in the third quarter  thanks to stronger data revenues and lower foreign exchange losses.",
        "date": "10272016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "UPDATE 1-Mexico's America Movil swings to profit  helped by data use "
    },
    {
        "content": "MEXICO CITY Shares in Mexican telecoms company America Movil  soared more than 12 percent on Friday after its third-quarter earnings report showed what one analyst called early signs of \"stability.\"",
        "date": "10282016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil shares soar after Q3 results show signs of 'stability' "
    },
    {
        "content": "MEXICO CITY  Oct 27 Mexican telecoms company America Movil on Thursday reported a third-quarter profit of 2.12 billion pesos ($109.6 million)  compared with a loss of 2.9 billion pesos in the same period last year.",
        "date": "10272016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's America Movil reports 3rd-qtr profit of 2.1 bln pesos "
    },
    {
        "content": "MEXICO CITY  Oct 28 Mexican telecoms company America Movil said on Friday that offering content is important  and will become \"very important\" in the future  as rival AT&T Inc  bids for U.S. media powerhouse Time Warner Inc.",
        "date": "10282016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-America Movil says offering content will become \"very important\" "
    },
    {
        "content": "VIENNA  Oct 27 Telekom Austria  part of Mexican tycoon Carlos Slim's America Movil  reported a 9.4 percent increase in  third-quarter core profit  helped by acquisitions in Eastern Europe.",
        "date": "10272016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-America Movil's Austria unit reports 9 pct rise in Q3 core profit "
    },
    {
        "content": "MEXICO CITY  Oct 28 Shares in America Movil jumped over 7 percent to 11.98 pesos in Friday morning trading  after the telecommunications giant swung to profit in the third quarter in its earning report on Thursday.",
        "date": "10282016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Shares in America Movil rise over 7 pct after 3rd-qtr earnings "
    },
    {
        "content": "VIENNA  Oct 27 Telekom Austria  part of Mexican tycoon Carlos Slim's America Movil  reported a 9.4 percent increase in  third-quarter core profit  helped by solid growth in its home market Austria and acquisitions in Eastern Europe.",
        "date": "10272016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil's Austria unit reports 9.4 pct rise in Q3 EBITDA "
    },
    {
        "content": "SAO PAULO  Oct 19 América Móvil SAB  the Mexican phone carrier controlled by billionaire Carlos Slim  is planning to increase capital spending in Brazil next year as part of an effort to boost coverage of fourth-generation mobile telephony  a company executive said.   (Reporting by Alberto Alerigi Jr; Writing by Guillermo Parra-Bernal)",
        "date": "10192016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Mexico's America Movil to expand 4G coverage in Brazil  boost investment "
    },
    {
        "content": "MEXICO CITY Shareholders of Mexican telecoms giant America Movil (AMXL.MX) have approved a proposal to delist shares from the Nasdaq and Latibex stock exchanges  the company said in a regulatory filing on Thursday.",
        "date": "10072016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil shareholders approve delisting from Nasdaq  Latibex "
    },
    {
        "content": "MEXICO CITY  Oct 6 Shareholders of Mexican telecoms giant America Movil (AMXL.MX) have approved a proposal to delist shares from the Nasdaq and Latibex stock exchanges  the company said in a regulatory filing on Thursday.",
        "date": "10062016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil shareholders approve delisting from Nasdaq  Latibex "
    },
    {
        "content": "SAO PAULO America Movil SAB  is interested in acquiring some or all of the operations run by struggling Brazilian rival Oi SA   the chief executive of the Mexican telecom giant said in a newspaper interview published on Wednesday.",
        "date": "09212016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Mexico's America Movil eyes acquisition of Brazil rival Oi: Valor "
    },
    {
        "content": "SAO PAULO  Sept 21 America Movil SAB  is interested in acquiring some or all of the operations run by struggling Brazilian rival Oi SA  the chief executive of the Mexican telecom giant said in a newspaper interview published on Wednesday.",
        "date": "09212016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-Mexico's America Movil eyes acquisition of Brazil rival Oi -Valor "
    },
    {
        "content": "SAO PAULO  Sept 21 America Movil SAB  is interested in acquiring some or all of the operations run by struggling Brazilian rival Oi SA  the chief executive of the Mexican telecom giant said in a newspaper interview published on Wednesday.",
        "date": "09212016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's America Movil eyes acquisition of Brazilian rival Oi -Valor "
    },
    {
        "content": "VIENNA  Sept 14 America Movil CFO Garcia Moreno denied a media report that the company was planning to delist its subsidiary Telekom Austria from the Vienna stock exchange  APA news agency said on Wednesday.",
        "date": "09142016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil CFO denies reports of plan to delist Telekom Austria "
    },
    {
        "content": "MEXICO CITY Mexican telecoms giant America Movil  said on Tuesday its board will propose to shareholders that it delist its shares from the Nasdaq and Latibex stock exchanges  without giving any further information.",
        "date": "09142016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's America Movil says proposes delisting from Nasdaq  Latibex "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  September 01 (Fitch) Fitch Ratings has affirmed America Movil  S.A.B.  de C.V.'s (AMX) and Telefonos de Mexico  S.A.B. de C.V.'s (Telmex) Local and  Foreign Currency Long-Term Issuer Default Ratings (IDRs) and senior unsecured  notes at 'A'. Fitch has also affirmed AMX's and Telmex Internacional S.A.B. de  C.V. y Subsidiarias' (Telint) national scale ratings at 'AAA(mex)'. The Rating  Outlook on the IDRs is revised to Negative ",
        "date": "09012016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Fitch Affirms America Movil at 'A'; Outlook Revised to Negative "
    },
    {
        "content": "MEXICO CITY  Aug 22 Mexico's America Movil  said on Monday it has sold a 0.89 percent take in Telekom Austria AG  but said it had \"no intention\" of selling its remaining 51 percent in the company.",
        "date": "08222016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil trims stake in Telekom Austria  says to keep 51 pct "
    },
    {
        "content": "MEXICO CITY  July 28 Mexican telecoms company America Movil on Thursday reported a 45 percent drop in second-quarter profit compared with the year earlier period  missing expectations as it faced greater mobile competition in its home market and economic woes in Brazil.",
        "date": "07292016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "UPDATE 2-America Movil profit almost halves on Mexico mobile competition "
    },
    {
        "content": "MEXICO CITY  July 28 Mexico's America Movil on Thursday reported a 45 percent drop in second-quarter net profit compared with the same period a year earlier.",
        "date": "07282016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Mexico's America Movil posts 45 pct drop in 2nd-qtr profit "
    },
    {
        "content": "VIENNA America Movil will cut its stake in Telekom Austria by 7.8 percentage points to just over 50 percent  it said on Thursday  ahead of an end of year deadline to reduce its holding and increase the Austrian firm's free float.",
        "date": "07282016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil to reduce Telekom Austria stake "
    },
    {
        "content": "* America Movil must reduce 60 pct stake by September   (Adds detail on bond issue from Citi statement)",
        "date": "07282016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 2-America Movil to reduce Telekom Austria stake "
    },
    {
        "content": "VIENNA  July 28 Citigroup said on Thursday it was launching a bond of up to 400 million euros ($443.8 million) exchangeable into shares of Telekom Austria  as a deadline approaches for parent America Movil to sell part of its stake in the Austrian company.",
        "date": "07282016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Telekom Austria exchangeable bond launched as free float deadline looms "
    },
    {
        "content": "MEXICO CITY Carlos Slim's America Movil  is likely on Thursday to report a 29 percent fall in second-quarter net profit  hurt by exchange rate losses  analysts predict.",
        "date": "07222016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil profit seen falling 29 percent in second quarter "
    },
    {
        "content": "* Telekom Austria CEO says there is full commitment to grow in Europe  we're not big enough",
        "date": "07252016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "BRIEF-CEO of America Movil's Telekom Austria: 1-2 pct organic growth possible "
    },
    {
        "content": "MEXICO CITY  July 19 Mexico's telecoms regulator said on Tuesday it had set price rules for 2015-2018 for fixed-line telephone firms Telmex and Telnor  part of tycoon Carlos Slim's America Movil  in line with a 2013 law seeking to place new restrictions on the telecom giant.",
        "date": "07192016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "UPDATE 1-Mexico telecoms watchdog sets price rules for Telmex up to 2018 "
    },
    {
        "content": "June 29 Jose Felix  Chief Executive of America Movil Brazil unit  said the company has no plans to acquire Oi assets",
        "date": "06292016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "BRIEF-CEO of America Movil in Brazil says no plans to acquire Oi assets "
    },
    {
        "content": "WASHINGTON Puerto Rico Telephone Company and its parent  America Movil SAB de CV  of Mexico  will pay $1.1 million to resolve a U.S. investigation over foreign ownership levels  the Federal Communications Commission said on Tuesday.",
        "date": "06282016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil to pay $1.1 million to settle U.S. probe "
    },
    {
        "content": "WASHINGTON  June 28 Puerto Rico Telephone Company and its parent  America Movil SAB de CV of Mexico  will pay $1.1 million to resolve a U.S. investigation over foreign ownership levels  the Federal Communications Commission said on Tuesday.",
        "date": "06282016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-America Movil to pay $1.1 mln to settle U.S. probe "
    },
    {
        "content": "WASHINGTON June 28 Puerto Rico Telephone Company and its parent company  America Movil of Mexico  will pay $1.1 million to resolve a U.S. investigation over foreign ownership levels  the Federal Communications Commission said on Tuesday.",
        "date": "06282016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil to pay $1.1 mln to settle FCC probe "
    },
    {
        "content": "VIENNA  June 24 Telekom Austria's free float has to be increased towards the end of the year under the terms of a syndicate contract with its parent company America Movil  the head of Austria's state holding company OBIB said on Friday.",
        "date": "06242016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Telekom Austria's free float to increase towards year-end -OBIB "
    },
    {
        "content": "MEXICO CITY/MADRID  May 17 Mexican billionaire Carlos Slim has put two of his grandchildren on boards of his companies  a major step in the succession of one of the world's largest family business empires.",
        "date": "05172016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Carlos Slim keeps it in the family as grandkids join boards "
    },
    {
        "content": "MEXICO CITY America Movil  the Mexican telecoms giant controlled by billionaire Carlos Slim  said on Monday its Peruvian subsidiary had agreed to buy Olo Del Peru S.A.C. and TVS Wireless S.A.C.  two telecommunications operators in Peru.",
        "date": "05102016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil's Peruvian unit agrees to buy Olo Del Peru and TVS Wireless "
    },
    {
        "content": "MEXICO CITY  May 11 Mexico's telecoms regulator said America Movil SAB de CV is complying with rules imposed under a 2013 law to curb the telecom giant's dominance  as it debates whether to amend the rules.",
        "date": "05122016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's America Movil complying with antitrust rules -regulator "
    },
    {
        "content": "MEXICO CITY Shares in Carlos Slim's America Movil slumped more than 9 percent on Thursday  a day after the telecoms company posted results which missed expectations by a wide margin  prompting analysts to downgrade their ratings.",
        "date": "04282016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Shares in Slim's America Movil slump after weak results "
    },
    {
        "content": "MEXICO CITY  April 27 Mexico's America Movil on Wednesday reported a drop in first-quarter net profit compared with the same period a year earlier.",
        "date": "04272016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil 1st-qtr profit drops more than 40 pct "
    },
    {
        "content": "MEXICO CITY Carlos Slim's America Movil is likely on Wednesday to report an 86 percent jump in net profit  helped by much lower foreign exchange losses  analysts predict.",
        "date": "04262016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil's profit seen jumping 86 percent in first quarter "
    },
    {
        "content": "MEXICO CITY  April 28 Shares in Carlos Slim's America Movil slumped more than 9 percent on Thursday  a day after the telecoms company posted results which missed expectations by a wide margin  prompting analysts to downgrade their ratings.",
        "date": "04282016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-Shares in Slim's America Movil slump after weak results "
    },
    {
        "content": "VIENNA  April 27 Telekom Austria  part of Mexican tycoon Carlos Slim's America Movil  reported a 2.5 percent decline in its first-quarter core profit  after extraordinary effects in Slovenia pushed last year's result up.",
        "date": "04272016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil's Austrian unit reports decrease in Q1 core profit "
    },
    {
        "content": "MEXICO CITY  April 28 Shares in Carlos Slim's America Movil slumped by 8 percent in early trading on Thursday  a day after it posted results that missed analyst expectations by a wide margin.",
        "date": "04282016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Shares in Slim's America Movil slump after profit drop "
    },
    {
        "content": "MEXICO CITY America Movil said on Wednesday first-quarter profit fell more than 40 percent from a year ago  as mobile competition from AT&T Inc intensified in Mexico and it started paying rent on cell towers after a sweeping regulatory overhaul.",
        "date": "04282016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil profit drops as Mexico competition grows "
    },
    {
        "content": "MEXICO CITY  April 27 America Movil  said on Wednesday first-quarter profit fell more than 40 percent from a year ago  as mobile competition from AT&T Inc  intensified in Mexico and it started paying rent on cell towers after a sweeping regulatory overhaul.",
        "date": "04282016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 2-America Movil profit drops as Mexico competition grows "
    },
    {
        "content": "MEXICO CITY A shareholder meeting of Mexican telecoms giant America Movil  which is controlled by the family of billionaire Carlos Slim  voted to create a 12 billion peso ($689 million) stock purchase fund  the company said in a statement on Monday.",
        "date": "04192016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil meeting approves 12 billion peso share purchase fund "
    },
    {
        "content": "MEXICO CITY  April 18 A shareholder meeting of Mexican telecoms giant America Movil  which is controlled by the family of billionaire Carlos Slim  voted to create a 12 billion peso ($689 million) stock purchase fund  the company said in a statement on Monday.",
        "date": "04182016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil meeting approves 12 bln peso share purchase fund "
    },
    {
        "content": "WASHINGTON/NEW YORK March 18 The U.S. Federal Communications Commission said on Friday that it had received 104 applications to take part in an auction of valuable low-frequency airwaves relinquished by TV broadcasters      including many wireless companies who want to use the airwaves to build new networks or improve existing coverage.",
        "date": "03182016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 2-U.S. FCC says it receives 104 bids to participate in spectrum auction "
    },
    {
        "content": "MEXICO CITY Mexican billionaire Carlos Slim's bank and his holding company spent over $200 million between November and late February to buy nearly 350 million shares in Slim's America Movil  according to a U.S. regulatory filing released on Tuesday.",
        "date": "03162016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Slim companies spend over $200 million on America Movil stock "
    },
    {
        "content": "NEW YORK  March 7 (IFR) - America Movil tapped the euro market for \u007f1.5bn (US$1.65bn) of senior unsecured funding on Monday  benefitting from strengthening investor sentiment about Latin America credits.",
        "date": "03072016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil raises \u007f1.5bn as LatAm tone improves "
    },
    {
        "content": "MEXICO CITY Mexico's America Movil does not plan to issue any more bonds for more than a year after selling 1.5 billion euros in debt this week  Chief Financial Officer Carlos Garcia Moreno said on Wednesday  adding there were no acquisitions on the horizon.",
        "date": "03102016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil wraps up bond issues for year  no acquisition plans: CFO "
    },
    {
        "content": "MEXICO CITY  March 3 Mexican telecoms giant America Movil bought the largest share of mobile Internet frequencies in a federal auction meant to spur more and better mobile data services  Mexico's telecoms regulator said on Thursday.",
        "date": "03042016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's America Movil top buyer in wireless spectrum auction "
    },
    {
        "content": "MEXICO CITY  Feb 9 Mexico's America Movil on Tuesday reported a jump in fourth-quarter net profit compared with the same period a year earlier.",
        "date": "02092016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Mexico's America Movil profit jumps in 4th-qtr "
    },
    {
        "content": "MEXICO CITY  Feb 10 Mexican telecoms giant America Movil  which is controlled by the family of billionaire Carlos Slim  plans to cut its capital expenditure by at least one-fifth in 2016  its chief executive said on Wednesday.",
        "date": "02102016",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "UPDATE 1-America Movil to slash capital spending by at least 20 pct "
    },
    {
        "content": "* Slim  state have to increase free float in 2016   (Adds details  background)",
        "date": "02092016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-America Movil's Austria unit swings to net profit "
    },
    {
        "content": "MEXICO CITY  Feb 10 Mexican telecoms giant America Movil  which is controlled by the family of billionaire Carlos Slim  has 17 billion pesos left in its buyback fund from 2015  the company said in a conference call on Wednesday.",
        "date": "02102016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's America Movil says has 17 bln pesos left in buyback fund "
    },
    {
        "content": "VIENNA  Feb 9 Telekom Austria  part of Mexican tycoon Carlos Slim's America Movil  reported on Tuesday a 4 percent increase in its 2015 core profit  helped by cost savings and synergy effects with its parent company.",
        "date": "02092016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Telekom Austria increases 2015 core profit by 4 pct\u007f "
    },
    {
        "content": "MEXICO CITY  Feb 9 Carlos Slim's America Movil on Tuesday reported a five-fold increase in quarterly profit  helped by a smaller loss from currency fluctuations  but tougher regulations in Mexico continued to squeeze margins at home.",
        "date": "02102016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 3-America Movil cuts exchange rate losses  but Mexico margin squeezed "
    },
    {
        "content": "MEXICO CITY  Feb 9 Carlos Slim's America Movil on Tuesday reported a five-fold increase in quarterly profit  helped by a smaller loss from currency fluctuations  but tougher regulations in Mexico continued to squeeze margins at home.",
        "date": "02102016",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "CORRECTED-UPDATE 2-America Movil cuts exchange rate losses  but Mexico margin squeezed "
    },
    {
        "content": "MEXICO CITY  Dec 21 Shares in Telesites   the Mexican wireless transmission towers firm spun off from billionaire Carlos Slim's telecoms giant America Movil   rose in their market debut on Monday.",
        "date": "12212015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "UPDATE 1-Shares in Slim's Telesites rise in market debut after spinoff "
    },
    {
        "content": "MEXICO CITY  Dec 17 Mexico's telecoms regulator on Thursday said it had approved swaps of frequency blocks and a spectrum rental deal between AT&T Inc and Telefonica SA   the main competitors to the country's dominant player  Carlos Slim's America Movil.",
        "date": "12182015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico telecoms regulator backs AT&T and Telefonica spectrum deal "
    },
    {
        "content": "MEXICO CITY  Dec 11 Billionaire Carlos Slim's bank and his holding company bought up almost 500 million America Movil shares in the last few months  according to a Securities Exchange Commission filing on Friday.",
        "date": "12112015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Slim holding companies spend $416 million on America Movil stock "
    },
    {
        "content": "MEXICO CITY  Nov 30 Billionaire Carlos Slim's telecommunications giant America Movil is set to be knocked off its perch as the top-weighted company on Mexico's benchmark stock index  after a quarterly rebalancing that takes effect on Tuesday.",
        "date": "12012015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Slim's America Movil loses top spot on Mexico index "
    },
    {
        "content": "MEXICO CITY  Nov 28 Mexico's telecom regulator said it signed off on the prices  dominant phone company America Movil can charge rivals and virtual operators to connect to its network  according to a statement from the regulator on Saturday.",
        "date": "11282015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's telecom watchdog approves America Movil prices "
    },
    {
        "content": "AMSTERDAM  Nov 27 KPN said on Friday that a member of its supervisory board appointed by America Movil  is stepping down  as Movil intends to sell its stake in KPN.",
        "date": "11272015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "KPN: Movil-appointed board member leaving as Movil to sell stake "
    },
    {
        "content": "MEXICO CITY  Oct 19 Mexican billionaire Carlos Slim's America Movil on Monday reported a third-quarter net loss as Latin American currencies depreciated sharply against the dollar  hurting the revenue of region's biggest pay TV and wireless company.",
        "date": "10192015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "UPDATE 1-Forex woes push Mexico's America Movil to third-quarter loss "
    },
    {
        "content": "MEXICO CITY Mexico's America Movil  faces tough challenges across all its biggest markets with weak Latin American currencies  tougher regulation and new competition contributing to its first quarterly loss in almost 14 years.",
        "date": "10202015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Slim's America Movil faces multiple tests after surprise loss "
    },
    {
        "content": "MEXICO CITY  Oct 19 Mexico's America Movil on Monday reported a net loss in the third-quarter compared to the same period a year earlier.",
        "date": "10192015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's America Movil swings to loss in third-quarter "
    },
    {
        "content": "VIENNA  Oct 19 Austria's state holding company OBIB  which has stakes in firms including Telekom Austria   Austrian Post and OMV  has not been instructed to sell any shares  its chief said on Monday.",
        "date": "10192015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Austrian state holding company says not tasked with selling stakes "
    },
    {
        "content": "MEXICO CITY  Oct 20 Mexico's America Movil  faces tough challenges across all its biggest markets with weak Latin American currencies  tougher regulation and new competition contributing to its first quarterly loss in almost 14 years.",
        "date": "10202015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 2-Slim's America Movil faces multiple tests after surprise loss "
    },
    {
        "content": "MEXICO CITY Mexican billionaire Carlos Slim's America Movil  is reviewing its dollar capital expenditure plans and renegotiating with suppliers  the company said on Tuesday  after the telecoms giant reported its first quarterly loss in almost 14 years.",
        "date": "10202015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil reviewing capex  renegotiating with suppliers after loss "
    },
    {
        "content": "MEXICO CITY  Oct 20 Mexican billionaire Carlos Slim's America Movil fell sharply in early Tuesday trading after the global telecommunications company reported its first quarterly loss in almost 14 years.",
        "date": "10202015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil shares sink after first loss in nearly 14 years "
    },
    {
        "content": "MEXICO CITY  Oct 20 Shares in Mexican billionaire Carlos Slim's America Movil fell over 3 percent to 14.060 pesos per share in early trading on Tuesday after the telecoms giant reported its first quarterly loss in almost 14 years.     (Reporting by Alexandra Alper)",
        "date": "10202015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Shares of Mexico's America Movil fall over 3 pct after weak results "
    },
    {
        "content": "MEXICO CITY  Oct 19 Mexican billionaire Carlos Slim's America Movil on Monday reported its first quarterly loss in almost 14 years as a sharp depreciation in Latin American currencies battered the region's biggest pay TV and wireless company.",
        "date": "10202015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 3-Forex woes push Slim's America Movil to first loss in 14 years "
    },
    {
        "content": "VIENNA  Oct 17 Austria on Saturday denied a newspaper report saying it was preparing to sell its 28 percent stake in Telekom Austria to the company's majority owner  Mexican tycoon Carlos Slim's America Movil.",
        "date": "10172015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Austria denies planning to sell Telekom stake "
    },
    {
        "content": "MEXICO CITY  Oct 11 Mexican telecoms regulator IFT said on Sunday that it will force  Telmex to offer competitors better terms as it seeks to open up its local network  part of an effort to increase competition in a sector dominated by billionaire Carlos Slim.",
        "date": "10112015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexican regulator requires new Telmex plan to open local network "
    },
    {
        "content": "MEXICO CITY  Oct 1 Mexican telecommunications firms Alestra  a unit of industrial conglomerate Alfa  and Axtel announced on Thursday they would merge to better rival Carlos Slim's America Movil  which dominates Mexico's fixed-line market.",
        "date": "10012015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "UPDATE 2-Telco unit of Mexico's Alfa to merge with Axtel "
    },
    {
        "content": "MEXICO CITY  Oct 1 Mexican telecommunications firms Alestra  a unit of industrial conglomerate Alfa  and Axtel announced they would merge on Thursday to better rival Carlos Slim's America Movil  which currently dominates the market.",
        "date": "10012015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Telco unit of Mexico's Alfa to merge with Axtel "
    },
    {
        "content": "MEXICO CITY  Sept 10 Mexican telecoms giant America Movil said on Thursday it had completed a placement of 750 million euros ($840.15 million) worth of bonds convertible into shares of Dutch telco KPN.",
        "date": "09102015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil sells 750 mln euros in bonds convertible into KPN shares "
    },
    {
        "content": "MEXICO CITY America Movil said on Tuesday it is facing a Mexico regulatory probe into whether its fixed-line unit Telmex violated the terms of its concession  and whether it broke the law  dealing a blow to its television ambitions at home.",
        "date": "08262015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil says facing Mexico probe in blow to TV ambition "
    },
    {
        "content": "MEXICO CITY  Aug 25 America Movil said on Tuesday it is facing a Mexico regulatory probe into whether its fixed-line unit Telmex violated the terms of its concession  and whether it broke the law  dealing a blow to its television ambitions at home.",
        "date": "08262015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-America Movil says facing Mexico probe in blow to TV ambition "
    },
    {
        "content": "MADRID Mexican magnate Carlos Slim  the main shareholder of FCC   wants to appoint a senior manager from America Movil  as chief executive of the Spanish construction firm  Spanish daily Cinco Dias said on Tuesday.",
        "date": "08182015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Carlos Slim wants Mexican Carlos Jarque as FCC CEO: report "
    },
    {
        "content": "MEXICO CITY  Aug 16 America Movil said on Sunday it removed roaming charges on calls to and data in the United States for 40 million Mexican prepay clients as it gears up to prevent new rival AT&T Inc. stealing market share on its home turf.",
        "date": "08162015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Slim's America Movil extends Mexico-U.S. 'borderless' plan to prepay "
    },
    {
        "content": "MEXICO CITY  Aug 10 Mexican billionaire Carlos Slim has slightly raised his stake in telecoms giant America Movil  according to a filing from the U.S. Securities and Exchange Commission posted on Monday.",
        "date": "08102015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Mexico's Carlos Slim increases his stake in America Movil "
    },
    {
        "content": "MEXICO CITY America Movil is still sniffing out deals in Europe  which could become twice as important for the Mexican telecom company's revenue base within five years  its chief financial officer said on Wednesday.",
        "date": "08122015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Slim's America Movil eyes European fixed-line telcos "
    },
    {
        "content": "AMSTERDAM  July 29 Telecommunications company KPN missed analyst forecasts for its second-quarter on Wednesday as efficiency gains and improvements in the consumer segment failed to compensate for declining business revenue.",
        "date": "07292015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "KPN misses on falling business revenues  expects strong cash flow "
    },
    {
        "content": "LONDON  July 20 European stocks were seen opening slightly higher on Monday  continuing a recent rally as Greek banks were set to re-open following last week's aid deal with international lenders.         Greek banks are ready to open their branches across the country after a three-week shutdown  officials said  although the Athens Stock Exchange was set to remain closed.       German Chancellor Angela Merkel called for swift aid talks so Athens could also lift withdrawal limits  and",
        "date": "07202015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "European Factors to Watch-Shares set to rise as Greek banks re-open "
    },
    {
        "content": "* Move comes after previous CEO left unexpectedly in June   (Adds details on Plater's contract  share price  background)",
        "date": "07242015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "UPDATE 1-America Movil arm Telekom Austria names new CEO "
    },
    {
        "content": "VIENNA  July 24 Telekom Austria named its Chief Operating Officer Alejandro Plater as its new Chief Executive on Friday  around two months after Hannes Ametsreiter left the America Movil unit to take the helm at Vodafone Germany.",
        "date": "07242015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil unit Telekom Austria names Plater as new CEO "
    },
    {
        "content": "AMSTERDAM European telecoms and cable firm Altice has no plans to bid for the 21 percent stake in Dutch rival KPN owned by Carlos Slim's America Movil  Altice's chief executive was quoted as saying by a Dutch newspaper on Saturday.",
        "date": "07182015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Altice denies interest in Carlos Slim's KPN stake: newspaper "
    },
    {
        "content": "AMSTERDAM  July 18 European telecoms and cable firm Altice has no plans to bid for the 21 percent stake in Dutch rival KPN owned by Carlos Slim's America Movil  Altice's chief executive was quoted as saying by a Dutch newspaper on Saturday.",
        "date": "07182015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Altice denies interest in Carlos Slim's KPN stake - newspaper "
    },
    {
        "content": "MEXICO CITY/VIENNA  July 17 Mexico's America Movil on Friday said its Telekom Austria  unit did not need a capital increase  after a local newspaper reported that it might try to raise new funds.",
        "date": "07172015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil says Telekom Austria doesn't need a capital hike "
    },
    {
        "content": "MEXICO CITY  July 16 Mexico's America Movil on Thursday reported a 25.4 percent drop in second-quarter net profit compared to the same period a year earlier  hit by higher costs and foreign exchange losses.",
        "date": "07162015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "UPDATE 1-Mexico's America Movil posts profit drop after currency slumps "
    },
    {
        "content": "MEXICO CITY  July 17 Mexico's America Movil expects the spin off of its towers into a new company Telesites to happen in the third quarter  executives said on a conference call on Friday.",
        "date": "07172015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's America Movil says tower spin off expected in 3rd-qtr "
    },
    {
        "content": "MEXICO CITY  July 16 Mexico's America Movil on Thursday reported a 25.4 percent drop in second-quarter net profit compared to the same period a year earlier  hit by a slump in Latin American currencies against the dollar.",
        "date": "07162015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's America Movil posts 25.4 pct drop in 2nd-qtr profit "
    },
    {
        "content": "MEXICO CITY Mexican telecoms giant America Movil  controlled by billionaire Carlos Slim  will respond to a challenge from U.S. carrier AT&T by offering some subscribers free calls to and data in the United States  and will also invest $6 billion in its network in Mexico  its chief executive said on Thursday.",
        "date": "07162015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Facing AT&T  America Movil pledges free roaming  $6 billion network upgrade "
    },
    {
        "content": "MEXICO CITY  July 16 Mexican telecoms giant America Movil  controlled by billioinaire Carlos Slim  will respond to a challenge from U.S. carrier AT&T by offering some subscribers free calls to and data in the United States  and will also invest $6 billion in its network in Mexico  its chief executive said on Thursday.",
        "date": "07162015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 2-Facing AT&T  America Movil pledges free roaming  $6 bln network upgrade "
    },
    {
        "content": "July 16 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "07162015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Still plans to pay dividend of 0.05 euro per share   (Adds details  quote  background)",
        "date": "07162015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-Telekom Austria cuts full-year revenue forecast "
    },
    {
        "content": "MEXICO CITY  July 16 Mexican telecoms giant America Movil  which is controlled by billionaire Carlos Slim  will invest $6 billion over the next three years  the company chief executive Daniel Hajj said on Thursday.",
        "date": "07162015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's America Movil to invest $6 bln in next 3 years-CEO "
    },
    {
        "content": "MEXICO CITY  June 30 Mexico's telecoms regulator said on Tuesday that it will open access to the \"last mile\" of Telmex telephone network to rivals  in a decision that aims to increase competition in a sector dominated by billionaire Carlos Slim.",
        "date": "06302015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-Mexico gives competitors access to Telmex phone networks "
    },
    {
        "content": "MEXICO CITY  June 30 Mexico's telecoms regulator will open access to the \"last mile\" of Telmex telephone networks to competitors  two sources said on Tuesday  in a decision that aims to increase competition in a sector dominated by billionaire Carlos Slim.",
        "date": "06302015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico will give competitors access to Telmex phone networks -sources "
    },
    {
        "content": "VIENNA Telekom Austria Chief Executive Hannes Ametsreiter unexpectedly quit on Monday to leave the unit of Mexican tycoon Carlos Slim's America Movil at the end of July to move to a new job which he declined to name.",
        "date": "06152015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Telekom Austria CEO Ametsreiter unexpectedly quits for new job "
    },
    {
        "content": "* Telekom Austria shares down around 4 pct   (Adds Ametsreiter comments)",
        "date": "06152015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 2-Telekom Austria CEO Ametsreiter unexpectedly quits for new job "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 26 (Fitch) Fitch Ratings has assigned an 'A(EXP)' rating to America  Movil  S.A.B. de C.V.'s (AMX) proposed EUR3 billion senior unsecured  exchangeable notes due 2020. The notes will be exchangeable for common shares of  Koninklijke KPN N.V. in which AMX holds 21% stakes. Proceeds from the issuance  are expected to be used for general corporate uses including debt repayment. KEY RATING DRIVERS AMX's ratings reflect its posi",
        "date": "05262015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Fitch Rates America Movil's EUR3.0B Exchangeable Notes 'A (EXP)' "
    },
    {
        "content": "AMSTERDAM Shares in KPN   fell in early trading Wednesday after America Movil  said it will sell up to 2.5 billion euros ($2.77 billion) worth of its own bonds exchangeable for KPN shares under certain circumstances.",
        "date": "05202015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "KPN shares fall on potential America Movil exit "
    },
    {
        "content": "LONDON  May 20 - America Movil launches up to 2.5 billion euros  ($2.78 billion) senior unsecured bonds of  exchangeable into KPN shares. - Bonds will have a maturity of 5 years and are expected to pay a coupon of up to 0.50 percent per annum payable semi-annually in arrear. - The exchange premium seen between 40 percent and 45 percent above the reference price of KPN stock  which will be the volume weighted average price on the Euronext Amsterdam on 20 May 2015. - Deutsche Bank acti",
        "date": "05202015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil issues 2.5 bln euros bonds exchangeable into KPN shares "
    },
    {
        "content": "RIVIERA MAYA  Mexico AT&T Inc will take \"a couple of years\" to shape up its new business in Mexico  where it competes with billionaire Carlos Slim's dominant carrier America Movil  AT&T Mexico Chief Executive Thaddeus Arroyo said in an interview on Thursday.",
        "date": "05072015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "AT&T Mexico chief: will take 'couple of years' to shape up Mexico business "
    },
    {
        "content": "SAO PAULO  April 30 The Brazilian wireless unit of Mexico's America Movil SAB said it expects to reduce capital spending by 20 percent this year following the completion of several projects.",
        "date": "04302015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil's Brazil mobile unit to spend 20 pct less in 2015 "
    },
    {
        "content": "MEXICO CITY  April 23 Mexico's America Movil on Thursday reported a 41 percent slump in first-quarter profit  missing expectations due to a foreign exchange loss mostly on the depreciation of the Brazilian real against the dollar.",
        "date": "04232015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "UPDATE 1-Mexico's America Movil profit drops on weak Brazilian currency "
    },
    {
        "content": "MEXICO CITY Mexico's America Movil  said on Friday that it was still reviewing alternatives to a sale of assets in Mexico in the wake of AT&T's entry into the market  adding that it did not want to sell infrastructure.",
        "date": "04242015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil says still looking at Mexico asset sale alternatives "
    },
    {
        "content": "MEXICO CITY  April 23 Mexico's America Movil on Thursday reported a 41 percent drop in first-quarter net profit compared to the same period a year earlier  driven by exchange rate losses.",
        "date": "04232015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's America Movil profit drops 41 pct in 1st-qtr "
    },
    {
        "content": "MEXICO CITY  April 24 Mexico's America Movil  said on Friday that it was still reviewing alternatives to a sale of assets in Mexico in the wake of AT&T's entry into the market  adding that it did not want to sell infrastructure.",
        "date": "04242015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-America Movil says still looking at Mexico asset sale alternatives "
    },
    {
        "content": "MEXICO CITY  April 23 Mexico's America Movil on Thursday reported a 41 percent slump in first-quarter net profit  missing expectations due to a foreign exchange loss for the second consecutive quarter  mostly on the depreciation of the Brazilian real against the dollar.",
        "date": "04242015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 2-America Movil profit hammered by weak Brazilian currency "
    },
    {
        "content": "MEXICO CITY  April 17 Shareholders in Mexico's America Movil on Friday approved a plan to spin off around 10 800 cell towers into a new company  Telesites  that will open up their use to competitors  the company said in a statement.",
        "date": "04172015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "UPDATE 1-America Movil shareholders approve tower spin-off plan "
    },
    {
        "content": "MEXICO CITY Telecommunications giant America Movil expects to see net profit reduced by 3.0 percent in the first quarter of 2015  compared to a year earlier  affected by the general depreciation of Latin American currencies compared to the dollar.",
        "date": "04212015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil first-quarter profit seen lower on currency losses "
    },
    {
        "content": "MEXICO CITY  April 17 Shareholders in Mexico's America Movil on Friday approved a plan to spin off around 10 800 cell towers into a new company  Telesites  that will open up their use to competitors  a person familiar with the matter said.",
        "date": "04172015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil shareholders approve tower spin-off plan "
    },
    {
        "content": "MEXICO CITY Mexico's America Movil  the telecoms company controlled by billionaire Carlos Slim  said on Wednesday it would propose spinning off its local cellphone tower business into a separate  listed company known as Telesites.",
        "date": "04022015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil plans to list Mexico tower spin-off business "
    },
    {
        "content": "MEXICO CITY  April 1 Mexico's America Movil  the telecoms company controlled by billionaire Carlos Slim  said on Wednesday it would propose spinning off its local cellphone tower business into a separate  listed company known as Telesites.",
        "date": "04022015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 3-America Movil plans to list Mexico tower spin-off business "
    },
    {
        "content": "MEXICO CITY  April 1 Mexican telecoms giant America Movil  controlled by billionaire Carlos Slim  said on Wednesday it would propose at an upcoming shareholder meeting a spin-off of its cellphone tower business into a separate company known as Telesites.",
        "date": "04012015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Mexico's America Movil proposes name for tower business spin-off "
    },
    {
        "content": "MEXICO CITY  April 1 Mexican billionaire Carlos Slim's America Movil will propose a spinoff of assets relating to its mobile phone business in Mexico to shareholders at a meeting April 17  the company said in a statement on Wednesday.",
        "date": "04012015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-America Movil to propose Mexico asset spinoff to shareholders "
    },
    {
        "content": "VIENNA  March 31 Telekom Austria aims to save around 90 million euros  ($97 million) this year in a cost-cutting drive  the America Movil unit said in its 2014 annual report published on Tuesday.",
        "date": "03312015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Telekom Austria aims to save around 90 mln eur in 2015 "
    },
    {
        "content": "MEXICO CITY  April 1 Mexican billionaire Carlos Slim's America Movil will propose a spinoff of assets related to its mobile phone business in Mexico to shareholders at a meeting on April 17  the company said in a statement on Wednesday.",
        "date": "04012015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil to propose Mexico asset spinoff to shareholders "
    },
    {
        "content": "MEXICO CITY Mexico's telecom regulator will not necessarily impose tougher rules against billionaire Carlos Slim's America Movil if it does not go ahead with a plan to sell off assets  the head of the regulatory agency said in an interview on Friday.",
        "date": "03282015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil may not face tougher regulation without asset sale: regulator "
    },
    {
        "content": "MEXICO CITY  March 27 Mexico's telecom regulator will not necessarily impose tougher rules against Carlos Slim's America Movil if it does not sell off assets  the head of the sector regulator said in an interview on Friday.",
        "date": "03272015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil may not face tougher regulation without asset sale - regulator "
    },
    {
        "content": "MEXICO CITY  March 25 Mexico's America Movil  said on Wednesday that a subsidiary of Grupo Elektra  would become a mobile virtual network operator (MVNO) on its network.",
        "date": "03252015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil says Elektra unit to be virtual operator on its network "
    },
    {
        "content": "MEXICO CITY Mexico's America Movil said on Wednesday it had signed a subsidiary of Grupo Elektra as a mobile virtual network operator (MVNO)  its second such deal in two weeks.",
        "date": "03262015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil signs Elektra unit as virtual operator to its network "
    },
    {
        "content": "MEXICO CITY  March 25 Mexico's America Movil  said on Wednesday it had signed a subsidiary of Grupo Elektra as a mobile virtual network operator (MVNO)  its second such deal in two weeks.",
        "date": "03262015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-America Movil signs Elektra unit as virtual operator to its network "
    },
    {
        "content": "MEXICO CITY  March 19 A unit of Carlos Slim's Grupo Financiero Inbursa bank has entered two loan agreements  pledging America Movil stock as collateral  according to a filing published on Thursday by the U.S. Securities and Exchange Commission.",
        "date": "03192015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Carlos Slim bank unit pledges America Movil stock for new loans "
    },
    {
        "content": "MEXICO CITY  March 19 A subsidiary of Mexican billionaire Carlos Slim's Grupo Financiero Inbursa  bank has entered two loan agreements for nearly $700 million  pledging America Movil stock as collateral  according to a filing published on Thursday.",
        "date": "03192015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 2-Carlos Slim bank unit pledges America Movil stock for new loans "
    },
    {
        "content": "MEXICO CITY  March 17 Latin America's largest telecoms company  America Movil  on Tuesday said it wanted to raise the amount of money in its share buyback fund to 35 billion pesos ($2.28 billion) for 2015  from 30 billion pesos last year.",
        "date": "03172015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil to increase funds for share buybacks in 2015 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 12 (Fitch) Weaker Latin American currencies and regulatory  issues are leading to widening credit default swap (CDS) spreads for two telecom  giants in Mexico  according to Fitch Solutions in its latest CDS Case Study  Snapshot. Five-year CDS on America Movil and Telefonos de Mexico (Telmex) widened 28% and  29% last week  respectively.  Additionally  CDS referencing both companies' debt  are pricing at the widest levels",
        "date": "03122015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Fitch Solutions: America Movil & Telmex CDS At Widest Level in Nearly Two Years "
    },
    {
        "content": "VIENNA  March 5 Telekom Austria named Alejandro Plater as its new chief operating officer on Thursday  tapping an Ericsson executive who had helped majority owner America Movil build cutting-edge mobile internet networks in Central America.",
        "date": "03052015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Telekom Austria names Ericsson's Platter as COO "
    },
    {
        "content": "NEW YORK  March 4 (IFR) - Argentina proved to be the top performer in a mixed day for the region  where Brazilian credits came under pressure after lawmakers pushed back on President Dilma Rousseff's austerity plans.",
        "date": "03042015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "LatAm credits end mixed  as America Movil taps in pesos "
    },
    {
        "content": "VIENNA  Feb 27 Mexico's America Movil  is set to install Ericsson manager Alejandro Plater as new operations chief at Telekom Austria  two sources with knowledge of the matter told Reuters on Friday.",
        "date": "02272015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil to install Ericsson man at Telekom Austria-sources "
    },
    {
        "content": "BUENOS AIRES  Feb 25 Mobile operator Claro  a unit of Mexican tycoon Carlos Slim's America Movil   said on Wednesday it would invest $2.7 billion  in its Argentine operations over the next five years.",
        "date": "02252015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Claro says to invest $2.7 bln in Argentine telecoms operations "
    },
    {
        "content": "* Sees 2015 revenue up around 2 pct   (Adds comment on outlook  paragraphs 2 and 3)",
        "date": "02102015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "UPDATE 2-Telekom Austria sees 2015 growth  steady dividend "
    },
    {
        "content": "Feb 11 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "02112015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "MEXICO CITY  Feb 11 America Movil's planned spinoff of cellphone towers in Mexico into a new company is at an advanced stage and should be up and running by May or June of this year  Chief Executive Daniel Hajj said on Wednesday.",
        "date": "02112015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 2-America Movil sees cell tower spinoff completed by June "
    },
    {
        "content": "MEXICO CITY  Feb 11 Mexican telecoms giant America Movil is still in the process of selling Mexican assets  CEO Daniel Hajj said in an earnings call on Wednesday.",
        "date": "02112015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "RPT-America Movil cellphone tower spinoff to be completed by June -CEO "
    },
    {
        "content": "* CEO sees strong Q1 after Q4 loss   (Recasts with CEO comments)",
        "date": "02112015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 1-Telekom Austria says has room for acquisitions "
    },
    {
        "content": "VIENNA  Feb 11 America Movil unit Telekom Austria expects a strong first quarter  its chief executive Hannes Ametsreiter told a news conference on Wednesday  after the company reported a fourth-quarter loss of around 49 million euros ($55.44 million).",
        "date": "02112015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "CEO of America Movil unit Telekom Austria says expects strong Q1 "
    },
    {
        "content": "MEXICO CITY Mexico's America Movil said on Tuesday its fourth-quarter profit slumped 82 percent compared with a year earlier  as its exchange rate loss more than doubled after falling global oil prices hammered Latin American currencies.",
        "date": "02112015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil profit plunges on regional currency slumps "
    },
    {
        "content": "MEXICO CITY  Feb 10 Mexico's America Movil  said on Tuesday its fourth-quarter profit slumped 82 percent compared with a year earlier  as its exchange rate loss more than doubled after falling global oil prices hammered Latin American currencies.",
        "date": "02112015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 2-America Movil profit plunges on regional currency slumps "
    },
    {
        "content": "MEXICO CITY  Feb 10 Mexico's America Movil said on Tuesday its fourth-quarter net profit slumped 82 percent compared to a year earlier.",
        "date": "02112015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "America Movil 4th-qtr profit drops 82 pct "
    },
    {
        "content": "WASHINGTON TracFone  owned by America Movil SAB  has agreed to pay $40 million to reimburse customers who purchased prepaid unlimited data plans that turned out to have maximum limits  the U.S. Federal Trade Commission said on Wednesday.",
        "date": "01282015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "TracFone to pay $40 million to settle deceptive ad allegations "
    },
    {
        "content": "AT&T Inc said on Monday it would buy bankrupt NII Holdings Inc's wireless business in Mexico for $1.875 billion in a move to create a larger Mexican wireless player that will have a better chance of competing with No. 1 America Movil.",
        "date": "01262015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "AT&T to buy NII Holdings' wireless business in Mexico "
    },
    {
        "content": "WASHINGTON  Jan 28 TracFone  owned by America Movil SAB  has agreed to pay $40 million to reimburse customers who purchased prepaid unlimited data plans that turned out to have maximum limits  the U.S. Federal Trade Commission said on Wednesday.",
        "date": "01282015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 2-TracFone to pay $40 mln to settle deceptive ad allegations "
    },
    {
        "content": "Jan 26 AT&T Inc said on Monday it would buy bankrupt NII Holdings Inc's wireless business in Mexico for $1.875 billion in a move to create a larger Mexican wireless player that will have a better chance of competing with No. 1 America Movil.",
        "date": "01262015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "UPDATE 3-AT&T to buy NII Holdings' wireless business in Mexico "
    },
    {
        "content": "TracFone  owned by America Movil SAB  has agreed to pay $40 million to reimburse customers who purchased prepaid unlimited data plans that turned out to have maximum limits  the Federal Trade Commission said on Wednesday.",
        "date": "01282015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "TracFone to pay $40 mln to settle deceptive ad allegations "
    },
    {
        "content": "MEXICO CITY  Jan 20 Mexican billionaire Carlos Slim has slightly increased his personal stake in America Movil   the massive telecommunications company he controls  filings from the U.S. Securities and Exchange Commission showed on Tuesday.",
        "date": "01212015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Mexico's Slim slightly raises personal stake in America Movil "
    },
    {
        "content": "MEXICO CITY  Jan 14 The Mexican unit of Spanish telecoms company Telefonica is not in talks to buy assets belonging to tycoon Carlos Slim's America Movil  Telefonica Mexico's chairman Francisco Gil Diaz told Reuters on Wednesday.",
        "date": "01152015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Telefonica's Mexico unit not in talks to buy America Movil assets "
    },
    {
        "content": "MEXICO CITY  Jan 9 Mexico's telecommunications regulator has fined both Carlos Slim's fixed-line unit Telmex and satellite TV provider Dish Mexico for failing to disclose fully a tie-up between them  the companies said in separate statements on Friday.",
        "date": "01102015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "UPDATE 1-Mexico telecom regulator fines Dish Mexico  Telmex for tie-up "
    },
    {
        "content": "Jan 9 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Friday:",
        "date": "01092015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "MEXICO CITY  Jan 9 Carlos Slim's fixed-line and mobile telecommunications company America Movil will spin off a holding company known as Sercotel  according to an announcement in Mexico City's daily gazette on Friday.",
        "date": "01092015",
        "name": "America Movil SAB de CV",
        "news_type": "normal",
        "symbol": "AMOV",
        "title": "Slim's America Movil to spin off Sercotel unit "
    },
    {
        "content": "VIENNA  Jan 8 Telekom Austria's  majority shareholder does not rule out a further capital increase to fund European acquisitions  according to a newspaper interview published on Thursday.",
        "date": "01082015",
        "name": "America Movil SAB de CV",
        "news_type": "topStory",
        "symbol": "AMOV",
        "title": "America Movil doesn't rule out Telekom Austria capital hike for expansion "
    }
]