[
    {
        "content": "* AutoNation announces pricing of $750 million aggregate principal amount of senior notes",
        "date": "11082017",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "BRIEF-AutoNation announces pricing of $750 million aggregate principal amount of senior notes "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 03 (Fitch) Fitch Ratings has assigned a Long-Term Issuer Default Rating (IDR) of 'BBB-' to AutoNation  Inc. Fitch has also assigned a 'BBB-' rating to the company's senior unsecured revolver and notes  and an 'F3' Short-Term IDR to the company's $1 billion CP program. The Rating Outlook is Stable. A full list of ratings follows at the end of this release. The ratings reflect AutoNation's steady operating margins over ",
        "date": "11032017",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "Fitch Assigns 'BBB-' IDR to AutoNation; Outlook Stable "
    },
    {
        "content": "U.S. auto retailer AutoNation Inc  announced a multi-year partnership on Thursday to support Alphabet Inc's  Waymo self-driving car unit  including vehicle maintenance and repairs as the company adds new brands into its fleet  sending its shares up 13 percent to a high for the year.",
        "date": "11022017",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "AutoNation announces Waymo fleet repair deal  shares jump "
    },
    {
        "content": "Nov 2 U.S. auto retailer AutoNation Inc announced a multi-year partnership on Thursday to support Alphabet Inc's Waymo self-driving car unit  including vehicle maintenance and repairs as the company adds new brands into its fleet  sending its shares up 13 percent to a high for the year.",
        "date": "11022017",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "UPDATE 3-AutoNation announces Waymo fleet repair deal  shares jump "
    },
    {
        "content": "Nov 2 America's largest automotive retailer AutoNation Inc reported a 9.5 percent fall in quarterly profit on Thursday  hurt in part by the impact of Hurricane Irma.",
        "date": "11022017",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "AutoNation's profit falls 9.5 pct in third quarter "
    },
    {
        "content": "* AutoNation says ‍on october 19  co amended and restated its existing unsecured credit agreement​- sec filing",
        "date": "10242017",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "BRIEF-AutoNation restates existing unsecured credit pact "
    },
    {
        "content": "* AutoNation CEO Mike Jackson on CNBC says \"probably lost 5-6 percent of inventory\" in Houston",
        "date": "09082017",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "BRIEF-AutoNation CEO on CNBC says \"probably lost 5-6 pct of inventory\" in Houston "
    },
    {
        "content": "* Autonation CEO Mike Jackson on CNBC says business is at a standstill in Houston; don't know when stores will be reopened",
        "date": "08292017",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "BRIEF-Autonation CEO on CNBC says 17 Houston stores closed in wake of hurricane Harvey "
    },
    {
        "content": "AutoNation Inc   the largest U.S. auto retail chain  on Wednesday reported a 21.8-percent fall in quarterly profit  hurt by lower new vehicle sales  and the company's shares fell 4.4 percent in early New York trading.",
        "date": "08022017",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "AutoNation profit falls on lower vehicle sales "
    },
    {
        "content": "Aug 2 AutoNation Inc  the largest U.S. auto retail chain  on Wednesday reported a 21.8-percent fall in quarterly profit  hurt by lower new vehicle sales  and the company's shares fell 4.4 percent in early New York trading.",
        "date": "08022017",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "UPDATE 1-AutoNation profit falls on lower vehicle sales "
    },
    {
        "content": "* Awarded jaguar land rover add-point  with expected annual revenue of about $130 million",
        "date": "08022017",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "BRIEF-AutoNation Q2 earnings per share $0.86 from continuing operations "
    },
    {
        "content": "* AutoNation Inc Says Q2 SHR from cont ops $0.86; Q2 Revenue $5.28 bln VS $5.44 bln",
        "date": "08022017",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "BRIEF-AutoNation reports Q2 SHR from cont ops $0.86 "
    },
    {
        "content": "Aug 2 AutoNation Inc  the largest U.S. auto retail chain  on Wednesday reported a 21.8 percent fall in quarterly profit hurt by lower new vehicle sales.",
        "date": "08022017",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "AutoNation profit falls 21.8 pct on lower vehicle sales "
    },
    {
        "content": "May 31 AutoNation Inc  the biggest U.S. auto retail chain  on Wednesday named Lance Iserman chief operating officer  following the abrupt departure of predecessor Bill Berman earlier this month.",
        "date": "05312017",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "AutoNation names company veteran Iserman chief operating officer "
    },
    {
        "content": "* Autonation announces resignation of William \"Bill\" Berman  president and chief operating officer Source text for Eikon: Further company coverage:",
        "date": "05152017",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "BRIEF-Autonation announces resignation of William Berman  CEO "
    },
    {
        "content": "DETROIT AutoNation Inc   the largest U.S. auto retail chain  on Tuesday reported a higher quarterly net profit that beat  expectations and said it expects sales and gross profit from used vehicle operations to rise in the second quarter.",
        "date": "04252017",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "AutoNation profit rises  sees increase ahead "
    },
    {
        "content": "DETROIT  April 25 AutoNation Inc  the largest U.S. auto retail chain  on Tuesday reported a higher quarterly net profit that beat  expectations and said it expects sales and gross profit from used vehicle operations to rise in the second quarter.",
        "date": "04252017",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "UPDATE 2-AutoNation profit rises  sees increase ahead "
    },
    {
        "content": "DETROIT  April 25 AutoNation Inc  the largest U.S. auto retail chain  on Tuesday reported a higher quarterly net profit as revenue increased slightly.",
        "date": "04252017",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "AutoNation quarterly profit rises "
    },
    {
        "content": "* Autonation announces retirement of jon ferrando  executive vice president - general counsel  corporate development and human resources  Source text for Eikon:  Further company coverage:",
        "date": "03082017",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "BRIEF-Autonation announces retirement of its executive vice president "
    },
    {
        "content": "* Autonation Inc - Mike Jackson will continue as chairman and chief executive officer of Autonation.  Source text for Eikon:  Further company coverage:",
        "date": "02012017",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "BRIEF-Autonation says William \"Bill\" Berman named president "
    },
    {
        "content": "AutoNation Inc  said on Friday fourth-quarter net income from continuing operations surged 31 percent despite dwindling profit margins on vehicle sales  thanks in part to a gain from the sale of assets.",
        "date": "02032017",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "AutoNation quarterly earnings rise despite pressure on margins "
    },
    {
        "content": "Feb 3 AutoNation Inc said on Friday fourth-quarter net income from continuing operations surged 31 percent despite dwindling profit margins on vehicle sales  thanks in part to a gain from the sale of assets.",
        "date": "02032017",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "UPDATE 2-AutoNation quarterly earnings rise despite pressure on margins "
    },
    {
        "content": "* AutoNation reports all-time record quarterly and all-time record full year earnings per share",
        "date": "02032017",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "BRIEF-AutoNation reports Q4 earnings per share $1.14 from continuing operations "
    },
    {
        "content": "* Autonation CEO Mike Jackson says using a sledgehammer of major border adjustment taxes would be disruptive  and overtime industry would have to adapt - CNBC",
        "date": "01102017",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "BRIEF-Autonation CEO Mike Jackson says using a sledgehammer of major border adjustment taxes would be disruptive - CNBC "
    },
    {
        "content": "* Jana Partners LLC takes sole share stake of 111 127 shares in Sage Therapeutics Inc",
        "date": "11142016",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "BRIEF-Jana Partners cuts sole share stake in Alphabet  takes sole share stake in Mondelez International "
    },
    {
        "content": "AutoNation Inc reported a 9 percent decline in third-quarter net income on Friday  and said it will launch a multi-year effort to expand its business beyond new vehicle sales.",
        "date": "10282016",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "AutoNation net income drops on recall costs; to add used-car stores "
    },
    {
        "content": "Oct 28 AutoNation Inc reported a 9 percent decline in third-quarter net income on Friday  and said it will launch a multi-year effort to expand its business beyond new vehicle sales.",
        "date": "10282016",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "UPDATE 2-AutoNation net income drops on recall costs; to add used-car stores "
    },
    {
        "content": "Oct 28 U.S. auto retail chain AutoNation Inc said on Friday it will invest $500 million or more over the next several years to expand its business beyond new vehicle sales  including  opening standalone used-vehicle stores that would compete with used-car specialist Carmax Inc.",
        "date": "10282016",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "AutoNation set to add used-car stores  more service centers "
    },
    {
        "content": "* Estimates Takata airbag recall negatively impacted q3 net income from continuing operations by about $6 million after-tax",
        "date": "10282016",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "BRIEF-AutoNation reports Q3 earnings from continuing operations of $1.05/share "
    },
    {
        "content": "Oct 28 AutoNation Inc  the largest U.S. car dealership chain  reported a 9 percent fall in quarterly net profit on Friday as automakers continued to offer discounts on new vehicles.",
        "date": "10282016",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "Automaker discounting hits AutoNation's net profit "
    },
    {
        "content": "* Barry Rosenstein of Jana Partner says \"we are out of Autonation \" - CNBC",
        "date": "10202016",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "BRIEF-Barry Rosenstein says \"We are out of Autonation \" - CNBC "
    },
    {
        "content": "Oct 28 U.S. auto retail chain AutoNation Inc said on Friday it will invest $500 million or more over the next several years to expand its business beyond new vehicle sales  including  opening standalone used-vehicle stores that would compete with used-car specialist Carmax Inc.",
        "date": "10282016",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "RPT-AutoNation set to add used-car stores  more service centers "
    },
    {
        "content": "July 29 AutoNation Inc Chief Executive Mike Jackson told Reuters the U.S. auto dealership chain will continue reducing stocks of unsold vehicles at its stores  responding to signs that U.S. vehicle sales growth has hit a plateau.",
        "date": "07292016",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "AutoNation CEO: Auto retailer wants to trim inventories further "
    },
    {
        "content": "* AutoNation to acquire BMW  Land Rover and Jaguar stores in Westchester County  New York",
        "date": "07072016",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "BRIEF-AutoNation to acquire Bmw  Land Rover and Jaguar stores "
    },
    {
        "content": "* Autonation to acquire chrysler jeep store in denver  colorado  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "06092016",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "BRIEF-Autonation to acquire Chrysler Jeep store in Denver  Colorado "
    },
    {
        "content": "AutoNation Inc   the largest U.S. car dealership chain  said first quarter income from continuing operations fell to 90 cents a share from 97 cents a share a year ago  in part because of expenses related to extensive hail damage to cars.",
        "date": "04222016",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "Hail damage dents AutoNation quarterly profit; sales flat "
    },
    {
        "content": "April 22 AutoNation Inc  the largest U.S. car dealership chain  said first quarter income from continuing operations fell to 90 cents a share from 97 cents a share a year ago  in part because of expenses related to extensive hail damage to cars.",
        "date": "04222016",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "UPDATE 2-Hail damage dents AutoNation quarterly profit; sales flat "
    },
    {
        "content": "April 22 AutoNation Inc  the largest U.S. auto dealership chain  reported a 14 percent fall in quarterly profit as costs rose.",
        "date": "04222016",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "U.S. auto dealer AutoNation's quarterly profit falls 14 pct "
    },
    {
        "content": "AutoNation Inc  Chief Executive Mike Jackson told Reuters on Thursday the U.S. auto retailer will cut new vehicle orders as part of a push to reduce its stocks of unsold vehicles by 10 to 15 percent this year.",
        "date": "01282016",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "AutoNation will cut new vehicle orders: CEO "
    },
    {
        "content": "Jan 28 AutoNation Inc Chief Executive Mike Jackson told Reuters on Thursday the U.S. auto retailer will cut new vehicle orders as part of a push to reduce its stocks of unsold vehicles by 10 to 15 percent this year.",
        "date": "01282016",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "UPDATE 3-AutoNation will cut new vehicle orders -CEO "
    },
    {
        "content": "Jan 28 AutoNation Inc  the largest U.S. auto dealership chain  reported a 5.8 percent rise in quarterly sales  reflecting strong growth in vehicle sales and services business.",
        "date": "01282016",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "AutoNation quarterly sales rise 5.8 pct "
    },
    {
        "content": "LAS VEGAS  Jan 6 The head of the largest U.S. auto dealer group on Wednesday warned that automakers and dealers will have to be disciplined in order to avoid problems experienced in the years following 2000 when profits were cut by lofty incentives that kept sales volume high.",
        "date": "01062016",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "AutoNation CEO warns automakers not to push sales by incentives "
    },
    {
        "content": "LAS VEGAS  Jan 6 The head of the largest U.S. auto dealer group warned on Wednesday that automakers and dealers must avoid the problems in the years immediately following 2000  when lofty incentives kept sales volume high but cut profits.",
        "date": "01062016",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "INTERVIEW-AutoNation CEO warns automakers not to push sales by incentives "
    },
    {
        "content": "SAN ANTONIO A Texas plumber whose company pickup truck with logo and name clearly visible appeared in a photograph of a militant wielding an anti-aircraft weapon in Syria has sued the dealer he sold it to  saying the harassment it generated has damaged his business.",
        "date": "12142015",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "Texas plumber sues dealer after company pickup appears in Syria militant photo "
    },
    {
        "content": "Oct 28 AutoNation Inc  the largest U.S. auto dealership chain  said Wednesday  net income from continuing operations rose to a quarterly record  reflecting strong growth in vehicle sales and service business.",
        "date": "10282015",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "AutoNation reports record quarter as vehicle sales boom "
    },
    {
        "content": "Oct 28 AutoNation Inc  the largest U.S. auto dealership chain  said on Wednesday net income rose to an all-time quarterly record  reflecting strong growth in vehicle sales and its service business.",
        "date": "10282015",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "UPDATE 2-AutoNation reports record quarter as vehicle sales boom "
    },
    {
        "content": "Sept 23 AutoNation Inc  the largest U.S. auto retailer  said the \"brand position\" of Volkswagen AG  in the United States was at risk following the German carmaker's manipulation of emission data.",
        "date": "09232015",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "Volkswagen's brand position in U.S. at risk: AutoNation CEO "
    },
    {
        "content": "AutoNation Inc   the largest U.S. auto retailer  posted a 15 percent rise in quarterly profit as demand remained strong on the back of an improving economy and low oil prices.",
        "date": "07222015",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "AutoNation second-quarter profit gets boost from higher demand "
    },
    {
        "content": "DETROIT AutoNation Inc  Chief Executive Mike Jackson said on Wednesday the shift by U.S. consumers toward trucks and sport utility vehicles is creating problems for manufacturers who had geared factories to build small and mid-sized cars.",
        "date": "07222015",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "SUV  truck sales challenge automakers  says AutoNation CEO "
    },
    {
        "content": "DETROIT  July 22 AutoNation Inc Chief Executive Mike Jackson said on Wednesday the shift by U.S. consumers toward trucks and sport utility vehicles is creating problems for manufacturers who had geared factories to build small and mid-sized cars.",
        "date": "07222015",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "UPDATE 1-SUV  truck sales challenge automakers  says AutoNation CEO "
    },
    {
        "content": "July 22 AutoNation Inc  the largest U.S. auto retailer  posted a 15 percent rise in quarterly profit as demand remained strong on the back of an improving economy and low oil prices.",
        "date": "07222015",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "UPDATE 1-AutoNation Q2 profit gets boost from higher demand "
    },
    {
        "content": "July 22 AutoNation  the largest U.S. auto retailer  reported a 15 percent rise in quarterly profit as an improving economy and low oil prices boosted vehicle sales.",
        "date": "07222015",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "AutoNation profit rises 15 pct on increased vehicle demand "
    },
    {
        "content": "DETROIT AutoNation Inc   the largest U.S. auto dealer group  on Wednesday posted stronger-than-expected quarterly profit as sales for both new and used vehicles rose.",
        "date": "04222015",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "AutoNation first-quarter profit tops estimates in 'Goldilocks period' "
    },
    {
        "content": "DETROIT  April 22 AutoNation Inc  the largest U.S. auto dealer group  on Wednesday posted stronger-than-expected quarterly profit as sales for both new and used vehicles rose.",
        "date": "04222015",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "UPDATE 2-AutoNation 1st-qtr profit tops estimates in 'Goldilocks period' "
    },
    {
        "content": "DETROIT  April 22 AutoNation Inc  the largest U.S. auto dealer group  on Wednesday posted stronger-than-expected quarterly profit as sales for both new and used vehicles rose.",
        "date": "04222015",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "AutoNation posts stronger-than-expected quarterly profit "
    },
    {
        "content": "DETROIT AutoNation Inc   the largest U.S. auto dealer group  on Tuesday posted a higher-than-expected quarterly profit due to strong profit margins from new and used vehicle sales  driving its shares up nearly 8 percent.",
        "date": "02032015",
        "name": "AutoNation Inc",
        "news_type": "topStory",
        "symbol": "AN",
        "title": "AutoNation posts higher profit on strong new and used car demand "
    },
    {
        "content": "DETROIT  Feb 3 AutoNation Inc  the largest U.S. auto dealer group  on Tuesday posted a higher-than-expected quarterly profit due to strong profit margins from new and used vehicle sales  driving its shares up nearly 8 percent.",
        "date": "02032015",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "UPDATE 1-AutoNation posts higher profit on strong new and used car demand "
    },
    {
        "content": "DETROIT  Feb 3 AutoNation Inc  the largest U.S. auto dealer group  on Tuesday posted a stronger-than-expected quarterly profit and said it still expected U.S. industry new-vehicle sales in 2015 to top 17 million for only the third time in history.",
        "date": "02032015",
        "name": "AutoNation Inc",
        "news_type": "normal",
        "symbol": "AN",
        "title": "REFILE-AutoNation posts strong profit  still sees U.S. industry sales above 17 mln in '15 "
    }
]