[
    {
        "content": "* Arista networks  inc. Reports third quarter 2017 financial results",
        "date": "11022017",
        "name": "Arista Networks Inc",
        "news_type": "topStory",
        "symbol": "ANET",
        "title": "BRIEF-Arista Networks Q3 non-gaap earnings per share $1.62 "
    },
    {
        "content": "* Arista Networks  Inc. reports second quarter 2017 financial results",
        "date": "08032017",
        "name": "Arista Networks Inc",
        "news_type": "topStory",
        "symbol": "ANET",
        "title": "BRIEF-Arista Networks Q2 GAAP earnings per share $1.30 "
    },
    {
        "content": "* Arista Networks says on Aug 4  International Trade Commission issued notice in connection with investigation no. 337-Ta-944 - SEC filing",
        "date": "08072017",
        "name": "Arista Networks Inc",
        "news_type": "topStory",
        "symbol": "ANET",
        "title": "BRIEF-Arista Networks says International Trade Commission issued notice in connection with investigation no. 337-Ta-944 "
    },
    {
        "content": "The U.S. government on Thursday dealt Arista Networks Inc a loss in its technology dispute with Cisco Systems Inc and refused to set aside an order blocking importation of some of Arista's network switches.",
        "date": "07212017",
        "name": "Arista Networks Inc",
        "news_type": "topStory",
        "symbol": "ANET",
        "title": "Arista loses bid to lift import ban in Cisco battle "
    },
    {
        "content": "July 20 The U.S. government on Thursday dealt Arista Networks Inc a loss in its technology dispute with Cisco Systems Inc and refused to set aside an order blocking importation of some of Arista's network switches.",
        "date": "07202017",
        "name": "Arista Networks Inc",
        "news_type": "normal",
        "symbol": "ANET",
        "title": "Arista loses bid to lift import ban in Cisco battle "
    },
    {
        "content": "July 20 The U.S. government on Thursday dealt Arista Networks Inc a loss in its technology dispute with Cisco Systems Inc and refused to set aside an order blocking importation of some of Arista's network switches.",
        "date": "07212017",
        "name": "Arista Networks Inc",
        "news_type": "normal",
        "symbol": "ANET",
        "title": "UPDATE 1-Arista loses bid to lift import ban in Cisco battle "
    },
    {
        "content": "* Arista Networks Inc - On July 5  co announced completion of presidential review period for international trade commission investigation - SEC Filing",
        "date": "07052017",
        "name": "Arista Networks Inc",
        "news_type": "topStory",
        "symbol": "ANET",
        "title": "BRIEF-Arista Networks says co announced completion of presidential review period for international trade commission investigation - SEC Filing "
    },
    {
        "content": "A judge ruled on Wednesday that Arista Networks Inc successfully redesigned its ethernet switches so that they do not infringe on a patent owned by Cisco Networks Inc  handing Arista its latest victory in a long-running intellectual property battle with its larger rival.",
        "date": "06222017",
        "name": "Arista Networks Inc",
        "news_type": "topStory",
        "symbol": "ANET",
        "title": "Arista notches another win in Cisco networking patent fight "
    },
    {
        "content": "June 1 Arista Networks Inc won a ruling on Thursday in its legal battle with Cisco Systems Inc over networking device technology  setting the stage for Arista to undo a U.S. agency's order blocking importation of some of its products.",
        "date": "06012017",
        "name": "Arista Networks Inc",
        "news_type": "normal",
        "symbol": "ANET",
        "title": "Arista wins round in Cisco patent fight over network technology "
    },
    {
        "content": "* Arista Networks - received letter from customs and border protection ruling that co's current products which contain redesigned EOS are not within scope of limited exclusion order issued by U.S. ITC",
        "date": "04112017",
        "name": "Arista Networks Inc",
        "news_type": "topStory",
        "symbol": "ANET",
        "title": "BRIEF-Arista Networks receives letter from customs and border protection "
    },
    {
        "content": "* Arista Networks  Inc. Reports fourth quarter and full year 2016 financial results",
        "date": "02162017",
        "name": "Arista Networks Inc",
        "news_type": "topStory",
        "symbol": "ANET",
        "title": "BRIEF-Arista Networks Q4 non-gaap earnings per share $1.04 "
    },
    {
        "content": "SAN FRANCISCO A U.S. jury on Wednesday handed Arista Networks Inc a major win in a wide-ranging legal battle against Cisco Systems Inc  ruling that Arista owed no damages over Cisco's claims of copyright infringement.",
        "date": "12142016",
        "name": "Arista Networks Inc",
        "news_type": "topStory",
        "symbol": "ANET",
        "title": "U.S. jury sides with Arista over Cisco in copyright battle "
    },
    {
        "content": "U.S. customs officials ruled that Arista Networks Inc can import redesigned ethernet switches that had been banned by the International Trade Commission  reducing pressure on Arista as it battles allegations of intellectual property infringement made by rival Cisco Systems Inc.",
        "date": "11222016",
        "name": "Arista Networks Inc",
        "news_type": "topStory",
        "symbol": "ANET",
        "title": "U.S. Customs sides with Arista amid Cisco patent allegations "
    },
    {
        "content": "Nov 21 U.S. customs officials ruled that Arista Networks Inc can import redesigned ethernet switches that had been banned by the International Trade Commission  reducing pressure on Arista as it battles allegations of intellectual property infringement made by rival Cisco Systems Inc.",
        "date": "11212016",
        "name": "Arista Networks Inc",
        "news_type": "normal",
        "symbol": "ANET",
        "title": "U.S. Customs sides with Arista amid Cisco patent allegations "
    },
    {
        "content": "Networking equipment giant Cisco Systems Inc is set to confront fast-growing rival Arista Networks Inc at a copyright and patent trial that kicks off Monday in a California federal court.",
        "date": "11212016",
        "name": "Arista Networks Inc",
        "news_type": "normal",
        "symbol": "ANET",
        "title": "Cisco  Arista set to face off at copyright and patent trial "
    },
    {
        "content": "* Arista Networks Inc -  on November 18  2016  received a letter from United States customs and border protection",
        "date": "11212016",
        "name": "Arista Networks Inc",
        "news_type": "normal",
        "symbol": "ANET",
        "title": "BRIEF-Arista Networks receives letter from United States CBP "
    },
    {
        "content": "* Arista networks Inc Reports third quarter 2016 financial results",
        "date": "11032016",
        "name": "Arista Networks Inc",
        "news_type": "topStory",
        "symbol": "ANET",
        "title": "BRIEF-Arista Networks Inc reports earnings per share of $0.69 "
    },
    {
        "content": "Cisco Systems Inc accused Arista Networks Inc of violating a cease and desist order imposed by the U.S. International Trade Commission and claimed the company's redesigned ethernet switches continue to infringe its patents in a new complaint.",
        "date": "08302016",
        "name": "Arista Networks Inc",
        "news_type": "topStory",
        "symbol": "ANET",
        "title": "Cisco tells International Trade Commission Arista flouting its orders "
    },
    {
        "content": "A federal judge has put on hold an antitrust case filed by Arista Networks Inc against rival Cisco Systems Inc  saying that Arista has not shown a delay would allow Cisco to perpetuate its \"monopoly power\" over consumers and competitors.",
        "date": "08252016",
        "name": "Arista Networks Inc",
        "news_type": "topStory",
        "symbol": "ANET",
        "title": "Judge pauses Arista antitrust case against Cisco "
    },
    {
        "content": "NEW YORK The U.S. Trade Representative has upheld an import ban on Arista Networks Inc's ethernet switches following a federal commission's finding in June that the company's products infringed patents owned by rival Cisco Systems Inc  Cisco said.",
        "date": "08232016",
        "name": "Arista Networks Inc",
        "news_type": "normal",
        "symbol": "ANET",
        "title": "U.S. Trade Rep approves import ban on Arista devices  says rival Cisco "
    },
    {
        "content": "NEW YORK  Aug 23 The U.S. Trade Representative has upheld an import ban on Arista Networks Inc's  ethernet switches following a federal commission's finding in June that the company's products infringed patents owned by rival Cisco Systems Inc  Cisco said.",
        "date": "08232016",
        "name": "Arista Networks Inc",
        "news_type": "normal",
        "symbol": "ANET",
        "title": "UPDATE 2-U.S. Trade Rep approves import ban on Arista devices  says rival Cisco "
    },
    {
        "content": "NEW YORK  Aug 23 The U.S. Trade Representative has upheld an import ban against certain Arista Networks Inc  products following a June decision by a federal trade agency finding that the company's products infringed several patents owned by rival Cisco Systems Inc  Cisco said in a Monday blog post on the company's website.",
        "date": "08232016",
        "name": "Arista Networks Inc",
        "news_type": "normal",
        "symbol": "ANET",
        "title": "Import ban on Arista devices approved by USTR  Cisco says "
    },
    {
        "content": "* Arista Networks Inc reports second quarter 2016 financial results",
        "date": "08042016",
        "name": "Arista Networks Inc",
        "news_type": "topStory",
        "symbol": "ANET",
        "title": "BRIEF-Arista Networks reports Q2 EPS $0.53 "
    },
    {
        "content": "NEW YORK Network equipment maker Cisco Systems Inc won a key victory in a sprawling legal battle with rival Arista Networks Inc on Thursday after the U.S. International Trade Commission ruled Arista infringed three of Cisco's patents with its ethernet switches used in computer data centers and servers.",
        "date": "06232016",
        "name": "Arista Networks Inc",
        "news_type": "topStory",
        "symbol": "ANET",
        "title": "Arista infringes Cisco networking patents  U.S. trade agency rules "
    },
    {
        "content": "NEW YORK  June 23 Network equipment maker Cisco Systems Inc won a key victory in a sprawling legal battle with rival Arista Networks Inc on Thursday after the U.S. International Trade Commission ruled Arista infringed three of Cisco's patents with its ethernet switches used in computer data centers and servers.",
        "date": "06232016",
        "name": "Arista Networks Inc",
        "news_type": "normal",
        "symbol": "ANET",
        "title": "UPDATE 2-Arista infringes Cisco networking patents  U.S. trade agency rules "
    },
    {
        "content": "* Arista Networks Inc Reports first quarter 2016 financial results",
        "date": "05052016",
        "name": "Arista Networks Inc",
        "news_type": "topStory",
        "symbol": "ANET",
        "title": "BRIEF-Arista Networks Q1 GAAP earnings per share $0.48 "
    },
    {
        "content": "Oct 29 Elgeka Trade Distributions Representations Industry SA :",
        "date": "10292015",
        "name": "Arista Networks Inc",
        "news_type": "topStory",
        "symbol": "ANET",
        "title": "BRIEF-Elgeka's Arista and Viotros unit to merge "
    }
]