[
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 14 (Fitch) Fitch Ratings has assigned a 'BBB' rating to Anthem Inc.'s (ANTM) planned issue of new senior notes of various maturities.  The rating on the planned issuance is equivalent to Fitch's ratings on ANTM's currently outstanding senior notes.  Fitch has concurrently affirmed ANTM's previously outstanding ratings and maintained their Negative Outlook.  A full list of rating actions can be found at the end of this ",
        "date": "11142017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Fitch Rates Anthem's Planned Issue 'BBB'; Affirms Existing Ratings; Outlook Negative "
    },
    {
        "content": "* Anthem launches cash tender offers for certain outstanding debt securities",
        "date": "11142017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem launches cash tender offers for certain outstanding debt securities "
    },
    {
        "content": "* Anthem Inc issues positive coverage decision for balloon sinus dilation",
        "date": "11132017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem Inc issues positive coverage decision for balloon sinus dilation "
    },
    {
        "content": "* Anthem Inc files preliminary prospectus supplement related to a potential five-part notes offering - SEC filing Source text: (http://bit.ly/2iTLr0B) Further company coverage:",
        "date": "11142017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem files preliminary prospectus supplement related to potential notes offering "
    },
    {
        "content": "NEW YORK  Nov 10 A group of prominent hedge funds have roared back with market-trouncing returns in 2017  helping the industry score its best performance in at least four years in a surprise rebound for an often maligned pocket of Wall Street.",
        "date": "11102017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "The 20 percent club: hedge fund stars of an industry rebound "
    },
    {
        "content": "NEW YORK  Nov 9 Health insurer Anthem Inc has eased access to Sarepta Therapeutics' treatment for Duchenne muscular dystrophy  and on Thursday changed its reimbursement policy on its website to \"medically necessary.\"",
        "date": "11092017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Health insurer Anthem eases restrictions on Sarepta's Duchenne treatment "
    },
    {
        "content": "Anthem Inc's  Joseph Swedish will be replaced as chief executive by industry veteran Gail Boudreaux but will stay on as executive chairman until May 2018 and be a senior adviser through May 2020  the health insurer said on Monday.",
        "date": "11062017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem top executive Swedish to become adviser  Boudreaux named CEO "
    },
    {
        "content": "NEW YORK  Nov 9 Health insurer Anthem Inc has eased access to Sarepta Therapeutics' treatment for Duchenne muscular dystrophy  and on Thursday changed its reimbursement policy on its website to \"medically necessary.\"",
        "date": "11092017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-Health insurer Anthem eases restrictions on Sarepta's Duchenne treatment "
    },
    {
        "content": "Nov 6 Anthem Inc's Joseph Swedish will be replaced as chief executive by industry veteran Gail Boudreaux but will stay on as executive chairman until May 2018 and be a senior adviser through May 2020  the health insurer said on Monday.",
        "date": "11062017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Anthem top executive Swedish to become adviser  Boudreaux named CEO "
    },
    {
        "content": "* Anthem Inc says as per offer letter  Gail Boudreaux's initial compensation will consist of annual base salary of $1.4 million - SEC filing",
        "date": "11062017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem says as per offer letter  Gail Boudreaux's initial compensation will consist of annual base salary of $1.4 mln "
    },
    {
        "content": "Nov 6 Health insurer Anthem Inc said on Monday its Chief Executive Joseph Swedish will step down and will be replaced by Gail Boudreaux.",
        "date": "11062017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem CEO Joseph Swedish to step down "
    },
    {
        "content": "* Anthem Inc - ‍board elects Gail K. Boudreaux chief executive officer and president​",
        "date": "11062017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem ‍board elects Gail Boudreaux CEO and president​ "
    },
    {
        "content": "Nov 3 U.S. health insurer Anthem Inc's Chief Executive Joseph Swedish will step down and be succeeded by Gail Boudreaux  the Wall Street Journal reported on Friday  citing people with knowledge of the matter.",
        "date": "11032017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem CEO Joseph Swedish to step down  Gail Boudreaux to succeed -WSJ "
    },
    {
        "content": "U.S. health insurer Anthem Inc's  Chief Executive Joseph Swedish will step down and be succeeded by industry veteran Gail Boudreaux  the Wall Street Journal reported on Friday  citing people with knowledge of the matter.",
        "date": "11042017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem CEO Joseph Swedish to step down  Gail Boudreaux to succeed: WSJ "
    },
    {
        "content": "* Anthem CEO Joseph Swedish to step down; to be replaced by Gail K. Boudreaux - WSJ  citing sources Source text: http://on.wsj.com/2Ajy5Te Further company coverage:",
        "date": "11032017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem CEO Joseph Swedish to step down  to be replaced by Gail Boudreaux - WSJ  citing sources "
    },
    {
        "content": "Nov 3 U.S. health insurer Anthem Inc's Chief Executive Joseph Swedish will step down and be succeeded by industry veteran Gail Boudreaux  the Wall Street Journal reported on Friday  citing people with knowledge of the matter.",
        "date": "11042017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Anthem CEO Joseph Swedish to step down  Gail Boudreaux to succeed -WSJ "
    },
    {
        "content": "Anthem Inc reported better-than-expected quarterly earnings as its Obamacare individual insurance business broke even and forecast a slight 2018 profit for the government plans despite uncertainty about the market's future.",
        "date": "10252017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "U.S. insurer Anthem says Obamacare business improving; stock jumps "
    },
    {
        "content": "Oct 25 Anthem Inc reported better-than-expected quarterly earnings as its Obamacare individual insurance business broke even and forecast a slight 2018 profit for the government plans despite uncertainty about the market's future.",
        "date": "10252017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 3-U.S. insurer Anthem says Obamacare business improving; stock jumps "
    },
    {
        "content": "* Express Scripts Holding CEO says \"last week's announcement by anthem  while disappointing and perplexing  was not surprising to us\" - Conf call",
        "date": "10252017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Express Scripts says Anthem's announcement last week disappointing  not surprising "
    },
    {
        "content": "NEW YORK  Oct 25 Anthem Inc's individual insurance plans created under the Affordable Care Act broke even in the third quarter as customer health costs fell and the No. 2 U.S. health insurer said it now expects a slight profit for the business line in 2018.",
        "date": "10252017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem's individual insurance business turning a profit- CEO "
    },
    {
        "content": "Oct 25 - Anthem Inc said quarterly profit rose 21 percent as the No. 2 U.S. health insurer added more members in its commercial and specialty business and increased its premium rates.",
        "date": "10252017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "CORRECTED-U.S. health insurer Anthem's quarterly profit rises 21 pct "
    },
    {
        "content": "Health insurer Anthem Inc will start managing its billions of dollars of patient prescriptions itself in 2020  it said on Wednesday  ending a deal with Express Scripts Holding Co  that had deteriorated into lawsuits over terms.",
        "date": "10182017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Health insurer Anthem takes pharmacy business in house  taps CVS to help "
    },
    {
        "content": "Oct 18 Health insurer Anthem Inc will start managing its billions of dollars of patient prescriptions itself in 2020  it said on Wednesday  ending a deal with Express Scripts Holding Co that had deteriorated into lawsuits over terms.",
        "date": "10182017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 4-Health insurer Anthem takes pharmacy business in house  taps CVS to help "
    },
    {
        "content": "NEW YORK  Oct 18 U.S. health insurer Anthem Inc expects $4 billion in savings starting in 2021 from its plan to end its current pharmacy contract and start managing those benefits itself  executives said on Wednesday in a conference call with investors.",
        "date": "10182017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem expects $4 billion in savings with pharmacy deal "
    },
    {
        "content": "* Anthem signs lease to build new technology center in Midtown Atlanta's tech square",
        "date": "10122017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem signs lease to build new technology center in Midtown Atlanta "
    },
    {
        "content": "Oct 18 Health insurer Anthem Inc will start managing its billions of dollars of patient prescriptions itself in 2020  it said on Wednesday  ending a deal with Express Scripts Holding that had deteriorated into lawsuits over terms.",
        "date": "10182017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "CORRECTED-UPDATE 2-Health insurer Anthem takes pharmacy business in house  taps CVS to help "
    },
    {
        "content": "* CVS Health signs five-year agreement with anthem  inc. To provide services to support ingeniorx",
        "date": "10182017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-CVS Health signs five-year agreement with Anthem "
    },
    {
        "content": "Oct 18 Drug retailer CVS Health Corp said on Wednesday it entered into an agreement with Anthem Inc to provide services to the health insurer's newly launched pharmacy benefit management (PBM) business  IngenioRx.",
        "date": "10182017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem signs agreement with CVS Health for new PBM business "
    },
    {
        "content": "* Anthem Inc - ‍ Establishing new pharmacy benefits manager to be named IngenioRx which will begin offering full suite of PBM Solutions starting in 2020​ Source text for Eikon: Further company coverage:",
        "date": "10182017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem launches IngenioRx  new pharmacy benefits manager "
    },
    {
        "content": "U.S. industrial conglomerate General Electric Co  said on Friday it promoted Jamie Miller  who has been the head of its transportation unit  to chief financial officer  replacing Jeffrey Bornstein.",
        "date": "10062017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "GE names Jamie Miller as CFO  replacing Bornstein "
    },
    {
        "content": "Oct 4 - Insys Therapeutics Inc on Tuesday detailed how it will defend itself against a $19 million lawsuit by Anthem Inc accusing it of fraudulently obtained reimbursements for its opioid Subsys  one of a number of cases filed by insurers.",
        "date": "10042017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Insys faults Anthem lawsuit over opioid drug as other insurers sue "
    },
    {
        "content": "Oct 6 U.S. industrial conglomerate General Electric Co said on Friday it promoted Jamie Miller  who has been the head of its transportation unit  to chief financial officer  replacing Jeffrey Bornstein.",
        "date": "10062017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-GE names Jamie Miller as CFO  replacing Bornstein "
    },
    {
        "content": "* Anthem Inc provides statement regarding individual market participation in Maine‍​",
        "date": "09272017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem provides statement regarding individual market participation in Maine‍​ "
    },
    {
        "content": "Sept 27 U.S. health insurer Anthem Inc said on Wednesday it will not offer individual Obamacare plans in Maine in 2018  citing uncertainty over government operations  including whether it will provide subsidies to reduce costs under the Affordable Care Act.",
        "date": "09272017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Anthem will not sell individual Obamacare plans in Maine next year "
    },
    {
        "content": "* Says ‍transaction is expected to be slightly accretive to earnings in 2018​",
        "date": "09202017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem to acquire HealthSun "
    },
    {
        "content": "NEW YORK U.S. health insurer Anthem Inc  said on Friday it plans to sell Obamacare health plans in 68 cities and counties in Virginia next year  covering the only remaining U.S. counties that are currently without insurers offering the plans.",
        "date": "09152017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem to sell Obamacare health plans in Virginia counties that don't offer them "
    },
    {
        "content": "NEW YORK  Sept 15 U.S. health insurer Anthem Inc said on Friday it plans to sell Obamacare health plans in 68 cities and counties in Virginia next year  covering the only remaining U.S. counties that are currently without insurers offering the plans.",
        "date": "09152017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-Anthem to sell Obamacare health plans in Virginia counties that don't offer them "
    },
    {
        "content": "NEW YORK  Sept 15 U.S. health insurer Anthem Inc said on Friday that it plans to sell Obamacare health plans in 68 cities and counties in Virginia next year  covering the only remaining U.S. counties that are currently without insurers offering the plans.",
        "date": "09152017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem to sell Obamacare health plans in Virginia's bare counties "
    },
    {
        "content": "NEW YORK Anthem Inc   which has trimmed the number of states and counties in which it will sell individual Obamacare plans in 2018  said on Tuesday it is still working with some state regulators on its market participation for next year.",
        "date": "09122017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem still considering presence in some Obamacare markets: CEO "
    },
    {
        "content": "NEW YORK  Sept 12 Anthem Inc  which has trimmed the number of states and counties in which it will sell individual Obamacare plans in 2018  said on Tuesday it is still working with some state regulators on its market participation for next year.",
        "date": "09122017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem still considering presence in some Obamacare markets -CEO "
    },
    {
        "content": "* Anthem reaffirms net income guidance for FY 2017 to be greater than $10.35 per share  including about $1.35 per share of net unfavorable items - SEC filing",
        "date": "09122017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem reaffirms net income guidance for FY 2017 to be greater than $10.35 per share "
    },
    {
        "content": "* Says to reduce Obamacare health care plan offerings in Kentucky to 59 counties in 2018",
        "date": "09062017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem to reduce Obamacare offerings in Kentucky in 2018 "
    },
    {
        "content": "* ‍Anthem has issued a positive coverage decision for Nanostring's Prosigna breast cancer gene signature assay​ Source text for Eikon: Further company coverage:",
        "date": "09052017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-‍Anthem issues a positive coverage decision for NanoString’s Prosigna "
    },
    {
        "content": "* EndoPredict receives positive coverage decisions from Medicare and Anthem",
        "date": "08172017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-EndoPredict receives positive coverage decisions from Medicare and Anthem "
    },
    {
        "content": "Aug 11 U.S. health insurer Anthem Inc said on Friday it will exit Obamacare markets in Virginia and reduce its plan offerings in Washington and Scott counties and the city of Bristol next year.",
        "date": "08112017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem to exit Obamacare market in Virginia next year "
    },
    {
        "content": "U.S. health insurer Anthem Inc  said on Monday it will no longer offer Obamacare plans in Nevada's state exchange and will stop offering the plans in nearly half of Georgia's counties next year.",
        "date": "08072017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem to pare back Obamacare offerings in Nevada and Georgia "
    },
    {
        "content": "Aug 7 U.S. health insurer Anthem Inc said on Monday it will no longer offer Obamacare plans in Nevada's state exchange and will stop offering the plans in nearly half of Georgia's counties next year.",
        "date": "08072017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Anthem to pare back Obamacare offerings in Nevada and Georgia "
    },
    {
        "content": "NEW YORK  Aug 7 U.S. health insurer Anthem Inc will no longer offer Obamacare plans in Nevada's state exchange  the state's insurance commissioner said on Monday.",
        "date": "08072017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem to leave Nevada's Obamacare market "
    },
    {
        "content": "* Anthem statement regarding individual market participation in Virginia",
        "date": "08112017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem statement regarding individual market participation in Virginia "
    },
    {
        "content": "NEW YORK  Aug 2 A federal judge has dismissed a lawsuit in which Express Scripts Holding Co shareholders accused the pharmacy benefits manager of inflating its share price by hiding its deteriorating relationship with its largest customer  Anthem Inc.",
        "date": "08022017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Express Scripts wins dismissal of lawsuit over Anthem ties "
    },
    {
        "content": "U.S. health insurer Anthem Inc is pulling back from 16 of 19 pricing regions in California where it offered Obamacare options this year  state officials said on Tuesday.",
        "date": "08022017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem to cut back Obamacare plan offerings in California "
    },
    {
        "content": "NEW YORK  July 28 With Republican efforts to dismantle Obamacare in disarray  hundreds of U.S. counties are at risk of losing access to private health coverage in 2018 as insurers consider pulling out of those markets in the coming months.",
        "date": "07282017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-Hundreds of U.S. counties at risk for no Obamacare insurer in 2018 "
    },
    {
        "content": "* Express Scripts-based on recent statements made other actions taken by Anthem  co believes unlikely its contract with anthem will be extended‍​",
        "date": "07252017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Express Scripts says a new contract with Anthem would be \"significantly less favorable\" to co "
    },
    {
        "content": "Anthem Inc said it may exit more individual Obamacare markets as the future of the national healthcare law and the government subsidies that make insurance affordable for millions of Americans remain up in the air.",
        "date": "07262017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem says may exit more individual markets over Obamacare funding "
    },
    {
        "content": "July 26 Anthem Inc said it may exit more individual Obamacare markets as the future of the national healthcare law and the government subsidies that make insurance affordable for millions of Americans remain up in the air.",
        "date": "07262017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 4-Anthem says may exit more individual markets over Obamacare funding "
    },
    {
        "content": "NEW YORK  July 26 Anthem Inc  a health insurer with more than 1 million customers in Obamacare individual insurance plans  on Wednesday threatened to further shrink its 2018 market participation.",
        "date": "07262017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem threatens to exit more Obamacare markets in 2018 "
    },
    {
        "content": "* Q2 revenue $22.2 billion versus I/B/E/S view $22.26 billion",
        "date": "07262017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem reports second quarter 2017 results "
    },
    {
        "content": "July 26 - U.S. health insurer Anthem Inc on Wednesday reported a nearly 10 percent increase in quarterly profit  helped by higher enrollment and a rise in premium rates.",
        "date": "07262017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "US health insurer Anthem's profit rises nearly 10 pct "
    },
    {
        "content": "Pharmacy benefit manager Express Scripts Holding Co  said on Tuesday that a new contract with biggest customer Anthem Inc  would be on terms significantly less favorable for the company.",
        "date": "07262017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Express Scripts says any new Anthem contract would be unfavorable "
    },
    {
        "content": "July 25 Pharmacy benefit manager Express Scripts Holding Co said on Tuesday that a new contract with biggest customer Anthem Inc would be on terms significantly less favorable for the company.",
        "date": "07262017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-Express Scripts says any new Anthem contract would be unfavorable "
    },
    {
        "content": "July 25 Pharmacy benefit manager Express Scripts Holding Co said on Tuesday that a new contract with biggest customer Anthem Inc would be on terms significantly less favorable for the company.",
        "date": "07262017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Express Scripts bearish on new Anthem contract "
    },
    {
        "content": "July 13 Health insurer Anthem Inc filed a lawsuit against Insys Therapeutics Inc on Wednesday  alleging the drugmaker fraudulently obtained reimbursements for its opioid painkiller Subsys.",
        "date": "07132017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem files lawsuit against Insys Therapeutics "
    },
    {
        "content": "Anthem Inc  the largest U.S. health insurance company  has agreed to settle litigation over hacking in 2015 that compromised about 79 million people's personal information for $115 million  which lawyers said would be the largest settlement ever for a data breach.",
        "date": "06232017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem to pay record $115 mln to settle U.S. lawsuits over data breach "
    },
    {
        "content": "Anthem Inc   the largest U.S. health insurance company  has agreed to settle litigation over hacking in 2015 that compromised about 79 million people's personal information for $115 million  which lawyers said would be the largest settlement ever for a data breach.",
        "date": "06232017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem to pay record $115 million to settle U.S. lawsuits over data breach "
    },
    {
        "content": "NEW YORK  June 21 U.S. healthcare insurer Cigna Corp said on Wednesday it will continue to offer individual coverage under Obamacare for now while rival Anthem Inc announced it was shrinking its participation  amid uncertainty over the fate of the government-subsidized program.",
        "date": "06212017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Cigna stays in Obamacare for now; Anthem reduces participation "
    },
    {
        "content": "* Excluding items  co continues to expect adjusted net income to be greater than $11.60 per share for FY ​",
        "date": "06142017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem intend's to reaffirm FY net income guidance to be greater than $10.37 per share "
    },
    {
        "content": "June 21 Anthem Inc  which has urged lawmakers to commit to paying government subsidies for the Obamacare individual health insurance system  said on Wednesday it would reduce the number of individual plan offerings in Wisconsin and Indiana next year.",
        "date": "06212017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem to reduce Obamacare offerings in Wisconsin  Indiana "
    },
    {
        "content": "* To reduce its 2018 individual plan offerings in Wisconsin and Indiana",
        "date": "06212017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem to reduce 2018 individual plan offerings in Wisconsin  Indiana "
    },
    {
        "content": "CINCINNATI  June 7 U.S. President Donald Trump said on Wednesday that the Obamacare healthcare system is in a \"death spiral\" and must be reformed soon  a day after insurer Anthem Inc announced it would withdraw from the Ohio healthcare insurance exchange next year.",
        "date": "06072017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Trump says Obamacare in 'death spiral ' urges Congress to act "
    },
    {
        "content": "Anthem Inc  which has urged Republican lawmakers to commit to paying government subsidies for the Obamacare individual health insurance system  on Tuesday announced it would exit most of the Ohio market next year.",
        "date": "06062017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem to leave Ohio's Obamacare insurance market in 2018 "
    },
    {
        "content": "June 6 Anthem Inc  which has urged Republican lawmakers to commit to paying government subsidies for the Obamacare individual health insurance system  on Tuesday announced it would exit most of the Ohio market next year.",
        "date": "06062017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 3-Anthem to leave Ohio's Obamacare insurance market in 2018 "
    },
    {
        "content": "Anthem Inc  one of the largest sellers of Obamacare individual health insurance  will exit most of the Ohio market next year because of volatility and uncertainty about whether the government will continue to provide subsidies aimed at making the plans affordable  it said on Tuesday.",
        "date": "06062017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem plans to leave Obamacare insurance market in Ohio in 2018 "
    },
    {
        "content": "NEW YORK  June 6 Anthem Inc  one of the largest sellers of Obamacare individual health insurance  said it will exit most of the Ohio market next year because of volatility and uncertainty about whether the government will continue to provide subsidies aimed at making the plans affordable.",
        "date": "06062017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem plans to leave Obamacare market in Ohio in 2018 "
    },
    {
        "content": "NEW YORK Anthem Inc on Wednesday said its plans for selling 2018 Obamacare individual plans are still up in the air because of political and regulatory uncertainty  making it the latest health insurer to say questions about continued funding of government subsidies will affect consumers next year.",
        "date": "05242017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem still weighing 2018 Obamacare individual participation "
    },
    {
        "content": "NEW YORK  May 25 Cigna Corp  which recently won court approval to break off its failed deal with Anthem Inc  on Thursday said it would give its more than 40 000 employees five Cigna shares each and expand its paid leave  as it embarks on its next phase of growth.",
        "date": "05252017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem battle behind it  Cigna gives stock to 40 000 workers "
    },
    {
        "content": "NEW YORK  May 24 Anthem Inc on Wednesday said its plans for selling 2018 Obamacare individual plans are still up in the air because of political and regulatory uncertainty  making it the latest health insurer to say questions about continued funding of government subsidies will affect consumers next year.",
        "date": "05242017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Anthem still weighing 2018 Obamacare individual participation "
    },
    {
        "content": "NEW YORK  May 24 Anthem Inc is looking at each state to determine what its participation in the Obamacare individual market will be next year given the political and regulatory uncertainty  Chief Executive Officer Joseph Swedish said on Wednesday.",
        "date": "05242017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem weighing Obamacare individual market in each state "
    },
    {
        "content": "* Veracyte announces Anthem coverage for the Afirma® gene expression classifier for use in thyroid cancer diagnosis",
        "date": "05182017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Veracyte says Anthem coverage for the Afirma gene expression classifier for use in thyroid cancer diagnosis "
    },
    {
        "content": "WILMINGTON  Del./WASHINGTON  May 8 Health insurer Anthem Inc asked a Delaware judge on Monday to give it more time to try to win approval for a merger with rival Cigna Corp  which is seeking to end the deal and collect a $1.85 billion break-up fee.",
        "date": "05082017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem argues for 60 days to save merger with balky Cigna "
    },
    {
        "content": "WILMINGTON  Del. A judge effectively killed off any practical chance of Anthem Inc  merging with Cigna Corp  on Thursday as he declined to order Cigna not to terminate the deal.",
        "date": "05112017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Delaware judge denies Anthem injunction  effectively ending Cigna merger "
    },
    {
        "content": "WILMINGTON  Del./WASHINGTON Health insurer Anthem Inc asked a Delaware judge on Monday to give it more time to try to win approval for a merger with rival Cigna Corp  which is seeking to end the deal and collect a $1.85 billion break-up fee.",
        "date": "05092017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem argues for 60 days to save merger with balky Cigna "
    },
    {
        "content": "* Anthem comments on decision of the Delaware Court of Chancery on acquisition of Cigna; terminates merger agreement",
        "date": "05122017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem says Cigna is not entitled to termination fee "
    },
    {
        "content": "WILMINGTON  Del.  May 11 A judge effectively killed off any practical chance of Anthem Inc merging with Cigna Corp on Thursday as he declined to order Cigna not to terminate the deal.",
        "date": "05112017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-Delaware judge denies Anthem injunction  effectively ending Cigna merger "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 12 (Fitch) Fitch's ratings of Anthem Inc. (ANTM) will remain on Rating Watch Negative following the company's announcement today that it has delivered to Cigna Corp. (CI) a notice terminating the merger agreement between the two companies. Today's announcement from ANTM follows a Delaware judge's ruling yesterday denying the company's request for a 60-day extension of a restraining order enjoining CI from terminating its me",
        "date": "05122017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Fitch: Anthem Remains on Negative Watch Following Termination of Merger Agreement with Cigna "
    },
    {
        "content": "WILMINGTON  Delaware  May 11 A Delaware judge refused to grant health insurer Anthem Inc a preliminary injunction on Thursday  handing a victory to smaller rival Cigna Corp which has sought to terminate their $54 billion proposed merger.",
        "date": "05112017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Delaware judge denies Anthem injunction request in fight with rival Cigna "
    },
    {
        "content": "NEW YORK Anthem Inc  on Friday called off a $54 billion deal to buy Cigna Corp   one day after the second-largest U.S. health insurer lost a Delaware business court ruling that could have kept alive the chances of a combination.",
        "date": "05122017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem deal with Cigna finally off  but break-up fee fight goes on "
    },
    {
        "content": "NEW YORK  May 12 Anthem Inc on Friday called off a $54 billion deal to buy Cigna Corp  one day after the second-largest U.S. health insurer lost a Delaware business court ruling that could have kept alive the chances of a combination.",
        "date": "05122017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Anthem deal with Cigna finally off  but break-up fee fight goes on "
    },
    {
        "content": "* Cigna Corporation announces termination of Anthem transaction",
        "date": "05122017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Cigna Corporation announces termination of Anthem transaction "
    },
    {
        "content": "Health insurer Cigna Corp   which is trying to ditch a takeover bid by Anthem Inc   said on Friday that first-quarter profit rose and it added hundreds of thousands of new members in its Obamacare individual business.",
        "date": "05052017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Cigna boosts first-quarter profit as Anthem deal heads to U.S. high court "
    },
    {
        "content": "NEW YORK  May 12 Anthem Inc said on Friday it notified Cigna Corp that the $54 billion merger deal was off after it lost a Delaware business court ruling on Thursday and also said it would not pay Cigna the $1.85 billion merger break-up fee.",
        "date": "05122017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem tells Cigna the deal is off  refuses to pay break-up fee "
    },
    {
        "content": "* Anthem files Supreme Court petition on Cigna (Adds quotes from Supreme Court petition  antitrust expert)",
        "date": "05052017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 4-Cigna boosts 1st-qtr profit as Anthem deal heads to U.S. high court "
    },
    {
        "content": "Health insurer Cigna Corp  which is trying to ditch a takeover bid by Anthem Inc  said on Friday that first-quarter profit rose and it added hundreds of thousands of new members in its Obamacare individual business.",
        "date": "05052017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Cigna boosts 1st-qtr profit as Anthem deal heads to U.S. top court "
    },
    {
        "content": "WASHINGTON  April 28 A U.S. appeals court dealt health insurer Anthem Inc's bid to merge with rival Cigna a likely death blow on Friday when it upheld a lower court's decision stopping the deal.",
        "date": "04282017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "U.S. appeals court blocks Anthem bid to merge with rival Cigna "
    },
    {
        "content": "NEW YORK  April 26 The loss of a multi-billion dollar contract with Anthem Inc comes with a silver lining for some shareholders of Express Scripts Holding Co : a higher likelihood that the pharmaceutical benefits manager (PBM) gets scooped up in a deal.",
        "date": "04272017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "RPT-DEALTALK-Anthem contract loss could put Express Scripts in M&A crosshairs "
    },
    {
        "content": "WASHINGTON  April 28 A U.S. appeals court on Friday blocked health insurer Anthem Inc's bid to merge with Cigna  upholding a lower court's decision that the $54 billion deal should not be allowed because it would lead to higher prices for healthcare.",
        "date": "04282017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 3-U.S. appeals court blocks Anthem bid to merge with rival Cigna "
    },
    {
        "content": "WASHINGTON  April 28 A U.S. appeals court on Friday blocked health insurer Anthem Inc's bid to merge with Cigna  upholding a lower court's decision that the $54 billion deal should not be allowed because it would lead to higher prices for healthcare.",
        "date": "04282017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "CORRECTED-UPDATE 2-U.S. appeals court blocks Anthem bid to merge with rival Cigna "
    },
    {
        "content": "NEW YORK  April 25 Pharmacy benefit manager Express Scripts Holding Co said on Tuesday that it plans to cut costs and is on the lookout for strategic deals as it readies itself for the potential loss of its largest customer  Anthem Inc.",
        "date": "04252017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Express Scripts seeks cost cuts  M&A as it preps for Anthem loss "
    },
    {
        "content": "Pharmacy benefit manager Express Scripts Holding Co said Anthem Inc  its biggest customer and one that has sued the company over claims of being overcharged  was unlikely to renew its contract after it ends in 2019.",
        "date": "04242017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Express Scripts says likely to lose top client Anthem "
    },
    {
        "content": "* Anthem responds to U.S. Court of appeals decision on acquisition of Cigna",
        "date": "04282017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem responds to U.S. Court of appeals decision on acquisition of Cigna "
    },
    {
        "content": "NEW YORK  April 26 The loss of a multi-billion dollar contract with Anthem Inc comes with a silver lining for some shareholders of Express Scripts Holding Co : a higher likelihood that the pharmaceutical benefits manager (PBM) gets scooped up in a deal.",
        "date": "04262017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "DEALTALK-Anthem contract loss could put Express Scripts in M&A crosshairs "
    },
    {
        "content": "NEW YORK  April 25 Pharmacy benefit manager Express Scripts Holding Co said on Tuesday that it plans to cut costs and is on the lookout for strategic deals as it readies itself for the potential loss of its largest customer  Anthem Inc.",
        "date": "04252017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-Express Scripts seeks cost cuts  M&A as it preps for Anthem loss "
    },
    {
        "content": "April 24 Pharmacy benefit manager Express Scripts Holding Co said Anthem Inc  its biggest customer and one that has sued the company over claims of being overcharged  was unlikely to renew its contract after it ends in 2019.",
        "date": "04242017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Express Scripts says likely to lose top client Anthem "
    },
    {
        "content": "April 24 Express Scripts Holding Co  the largest pharmacy benefit manager in the United States  said health insurer Anthem Inc was unlikely to renew its contract with the company.",
        "date": "04242017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Express Scripts says Anthem unlikely to renew contract after 2019 "
    },
    {
        "content": "* Anthem names DR. Mai Pham as vice president  provider alignment solutions Source text for Eikon: Further company coverage:",
        "date": "04242017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem names Dr. Mai Pham as vice president "
    },
    {
        "content": "Anthem Inc  which has 1.1 million customers in individual Obamacare plans  said it was moving ahead with its 2018 insurance filings but had told state regulators it could increase premiums sharply and exit some markets.",
        "date": "04262017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Amid uncertainty  Anthem proceeds with 2018 Obamacare plans "
    },
    {
        "content": "April 26 - Anthem Inc  which has 1.1 million customers in individual Obamacare plans  said it was moving ahead with its 2018 insurance filings but had told state regulators it could increase premiums sharply and exit some markets.",
        "date": "04262017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 5-Amid uncertainty  Anthem proceeds with 2018 Obamacare plans "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  April 26 (Fitch) Express Scripts Holding Company's (ESRX  'BBB' / Outlook Stable) announcement that Anthem  Inc. (Anthem  'BBB+' / Rating Watch Negative) intends to move its business in 2020 was incorporated in Fitch's prior rationale for ESRX's 'BBB' rating  which also presumed that ESRX would adjust capital deployment as necessary to maintain leverage (gross debt/EBITDA) around 2x regardless of whether the contract was retai",
        "date": "04262017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Fitch: Anthem Walking from ESRX Talks Raises Downside Risk "
    },
    {
        "content": "NEW YORK  April 26 Two days after Express Scripts Holding Co said it had lost its contract to do pharmacy benefit management for Anthem Inc  Anthem's top executive said the company had not made a decision on or ruled out any vendor.",
        "date": "04262017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem says it hasn't ruled out any PBM  including Express Scripts "
    },
    {
        "content": "WASHINGTON  April 20 Health insurer Anthem Inc denied a report on Thursday that it was in negotiations with the Justice Department in an effort to save its merger with smaller rival Cigna Corp.",
        "date": "04202017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem denies report of talks with Justice Dept regarding merger "
    },
    {
        "content": "NEW YORK  April 26 Anthem Inc Chief Executive Officer Joseph Swedish said on Wednesday that the company would base its 2018 individual health insurance plans on the U.S. government continuing to pay subsidies that help reduce patient costs but added that those plans would change if those payments are not extended.",
        "date": "04262017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem CEO says 2018 plans depend on cost-sharing subsidies "
    },
    {
        "content": "* Q1 earnings per share view $3.62 -- Thomson Reuters I/B/E/S",
        "date": "04262017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem Q1 earnings per share $3.73 "
    },
    {
        "content": "* CEO Joseph R. Swedish 's 2016 total compensation $16.5 million versus $13.6 million in 2015 - SEC filing",
        "date": "03312017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem says CEO Joseph Swedish's 2016 total compensation $16.5 mln - SEC filing "
    },
    {
        "content": "Anthem Inc  is likely to exit from a large portion of its Obamacare individual insurance markets next year  Jefferies analysts said  nearly a week after Republican leaders pulled legislation to overhaul the U.S. healthcare system.",
        "date": "03302017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem likely to pull back from Obamacare markets in 2018: Jefferies "
    },
    {
        "content": "March 30 Anthem Inc is likely to exit from a large portion of its Obamacare individual insurance markets next year  Jefferies analysts said  nearly a week after Republican leaders pulled legislation to overhaul the U.S. healthcare system.",
        "date": "03302017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem likely to pull back from Obamacare markets in 2018 - Jefferies "
    },
    {
        "content": "NEW YORK  March 24 A federal judge has dismissed two of the six counterclaims that pharmacy benefits manager Express Scripts Holding Co raised in health insurer's Anthem Inc's $15 billion lawsuit claiming it charged too much for drugs.",
        "date": "03242017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Judge dismisses two Express Scripts claims in Anthem drug pricing lawsuit "
    },
    {
        "content": "* Intend to reaffirm company's net income guidance for full year 2017 to be greater than $11.11 per share",
        "date": "03152017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem continues to expect FY 2017 adjusted net income to be greater than $11.50 per share "
    },
    {
        "content": "* CEO Joseph Swedish's 2016 total compensation was $16.5 million versus $13.6 million in 2015 - sec filing  Source text (http://bit.ly/2mKBRRc) Further company coverage:",
        "date": "03102017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem CEO's 2016 total compensation was $16.5 mln vs. $13.6 mln in 2015 "
    },
    {
        "content": "WASHINGTON  March 1 Connecticut said on Wednesday it had no plans to drop its opposition to health insurer Anthem Inc's proposed purchase of rival Cigna Corp  even if the U.S. Justice Department decides to settle with the companies.",
        "date": "03012017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Connecticut says will not drop opposition to Anthem/Cigna deal "
    },
    {
        "content": "* Cigna says in light of recently announced schedule in appeal of court's ruling to enjoin proposed merger with Anthem  co decided to postpone investor day  Source text for Eikon: Further company coverage:",
        "date": "03012017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Cigna decides to postpone Investor Day "
    },
    {
        "content": "NEW YORK Anthem Inc.  and other U.S. health insurers complained to the White House for more than a year that they were losing money on people who waited to sign up for Obamacare coverage until they were sick.",
        "date": "02272017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem and Blue Crosses loom large in Obamacare talks "
    },
    {
        "content": "Feb 23 Cigna Corp said Chief Financial Officer Thomas McCarthy will retire this summer  a week after the health insurer's $54 billion deal to be acquired by Anthem Inc was blocked by the U.S. Justice Department.",
        "date": "02232017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Cigna CFO Thomas McCarthy to retire "
    },
    {
        "content": "* Anthem declares first quarter 2017 dividend of $0.65 per share  Source text for Eikon:  Further company coverage:",
        "date": "02222017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem declares first quarter dividend of 65 cents/shr "
    },
    {
        "content": "NEW YORK/BOSTON  Feb 16 New York state on Thursday announced final regulations requiring  banks and insurers to meet minimum cyber-security standards and report breaches to regulators as part of an effort to combat a surge in cyber crime and limit damages to consumers.",
        "date": "02162017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "CORRECTED-New York state cyber security regulation to take effect March 1 "
    },
    {
        "content": "* Anthem Bluecross and Blueshield expands its badgercare plus and medicaid services to 24 additional Wisconsin counties  Source text for Eikon:  Further company coverage:",
        "date": "02162017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem Bluecross and Blueshield expands some services "
    },
    {
        "content": "Anthem Inc on Wednesday won a temporary restraining order that blocks smaller rival Cigna Corp from officially terminating their proposed $54 billion merger  a transaction already rejected by U.S. antitrust regulators. | Video ",
        "date": "02152017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem sues Cigna to block termination of merger "
    },
    {
        "content": "* Third Point Llc dissolves share stake in Allergan Plc - SEC Filing",
        "date": "02102017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Third Point LLC takes share stake in JPMorgan  Bank of America - SEC Filing "
    },
    {
        "content": "* Says notified Anthem that it has terminated agreement and plan of merger by and among co  Anthem and a direct wholly owned subsidiary of Anthem",
        "date": "02142017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Cigna Corp terminates merger agreement with Anthem Inc "
    },
    {
        "content": "* Cigna Corp - as per court's order  will continue to abide by terms of the merger agreement with Anthem until the court further reviews the case  Source text: (http://bit.ly/2kVZ8ht) Further company coverage:",
        "date": "02162017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Cigna says will abide by terms of agreement with Anthem until court reviews case "
    },
    {
        "content": "Feb 15 Anthem Inc on Wednesday won a temporary restraining order that blocks smaller rival Cigna Corp  from officially terminating their proposed $54 billion merger  a transaction already rejected by U.S. antitrust regulators.",
        "date": "02152017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 4-Anthem sues Cigna to block termination of merger "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 15 (Fitch) Anthem Inc. (ANTM) and Cigna Corp. (CI) remain on  Rating Watch Negative following the companies' recent filing of lawsuits against  each other in a Delaware Court  according to Fitch Ratings. The lawsuits relate  to a merger agreement the companies entered into in July 2015  and both seek  damages.  On Feb. 14  2017  CI notified ANTM that it had terminated the companies' merger  agreement and had filed suit",
        "date": "02152017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Fitch: Anthem & Cigna Remain on Negative Watch Following Lawsuit Filings "
    },
    {
        "content": "* Intends to \"defend against Anthem litigation and pursue its own action against Anthem for damages that anthem has caused Cigna\"  Source text (http://bit.ly/2lQqnI3) Further company coverage:",
        "date": "02152017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Cigna Corp says will defend against Anthem litigation "
    },
    {
        "content": "Feb 15 Anthem Inc said on Wednesday it has filed a lawsuit seeking a temporary restraining order to enjoin Cigna Corp from terminating its $54 billion deal.",
        "date": "02152017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem sues Cigna to block deal termination "
    },
    {
        "content": "Health insurer Cigna Corp on Thursday added to growing public pressure on Republican lawmakers and the Trump administration to stabilize the Obamacare individual market or risk insurers pulling out.",
        "date": "02022017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Cigna adds to insurers' pressure on lawmakers for Obamacare fixes "
    },
    {
        "content": "A federal judge on Wednesday ruled against U.S. health insurer Anthem Inc's  proposed $54 billion merger with smaller rival Cigna Corp   derailing an unprecedented effort to consolidate the country's health insurance industry. | Video ",
        "date": "02092017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "U.S. court blocks Anthem-Cigna merger  dealing blow to consolidation "
    },
    {
        "content": "* Anthem files suit against Cigna seeking a temporary restraining order to enjoin Cigna from terminating the merger agreement  specific performance compelling Cigna to comply with the merger agreement and damages",
        "date": "02152017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem files suit against Cigna seeking temporary restraining order to enjoin Cigna from terminating merger agreement "
    },
    {
        "content": "Feb 2 Health insurer Cigna Corp on Thursday added to growing public pressure on Republican lawmakers and the Trump administration to stabilize the Obamacare individual market or risk insurers pulling out.",
        "date": "02022017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 3-Cigna adds to insurers' pressure on lawmakers for Obamacare fixes "
    },
    {
        "content": "A federal judge on Wednesday ruled against U.S. health insurer Anthem Inc's proposed $54 billion merger with smaller rival Cigna Corp  derailing an unprecedented effort to consolidate the country's health insurance industry.",
        "date": "02092017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "US court blocks Anthem-Cigna merger  dealing blow to consolidation "
    },
    {
        "content": "* Anthem responds to u.s. District court's decision on acquisition of cigna",
        "date": "02092017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem responds to U.S. District Court's decision on acquisition of Cigna "
    },
    {
        "content": "Feb 8 A federal judge on Wednesday ruled against U.S. health insurer Anthem Inc's proposed $54 billion merger with smaller rival Cigna Corp  derailing an unprecedented effort to consolidate the country's health insurance industry.",
        "date": "02092017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 6-US court blocks Anthem-Cigna merger  dealing blow to consolidation "
    },
    {
        "content": "Feb 2 Health insurer Cigna Corp  which is waiting for a ruling on the U.S. government's lawsuit to block its acquisition by Anthem Inc  reported a 3 percent rise in quarterly operating revenue on Thursday  as it added new members.",
        "date": "02022017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Health insurer Cigna's operating revenue rises 3 pct "
    },
    {
        "content": "* Cigna comments on district court decision to enjoin the proposed transaction with Anthem",
        "date": "02092017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Cigna comments on district court decision to enjoin the proposed transaction with Anthem "
    },
    {
        "content": "Feb 8 A federal judge on Wednesday ruled against U.S. health insurer Anthem Inc's proposed $54 billion merger with smaller rival Cigna Corp  derailing an unprecedented effort to consolidate the country's health insurance industry.",
        "date": "02092017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "CORRECTED-UPDATE 3-U.S. court blocks Anthem-Cigna deal  dealing blow to consolidation "
    },
    {
        "content": "Feb 8 A U.S. federal judge on Wednesday ruled against health insurer Anthem Inc's proposed $54 billion merger with smaller rival Cigna Corp  a deal that would have created the largest U.S. health insurer by membership.    (Reporting by Akankshita Mukhopadhyay in Bengaluru; Editing by Bernard Orr)",
        "date": "02092017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "U.S. court blocks Anthem-Cigna deal "
    },
    {
        "content": "* U.S. judge blocks merger of Anthem Inc and Cigna Corp  - court order   Further company coverage:",
        "date": "02092017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-U.S. judge blocks merger of Anthem Inc and Cigna Corp  - court order "
    },
    {
        "content": "NEW YORK Anthem Inc  shares could rise by 30 percent as the U.S. health insurer is undervalued and has the most room for improvement in profit margins and earnings among its peers  Barron's reported.",
        "date": "01302017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Health insurer Anthem could rise 30 percent on earnings potential: Barron's "
    },
    {
        "content": "Anthem Inc said on Wednesday that it might stop selling individual plans on the Obamacare exchanges in 2018 unless the U.S. government tightens enrollment and eligibility rules to better balance sick and healthy customers.",
        "date": "02012017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem CEO uncertain about 2018 Obamacare participation "
    },
    {
        "content": "Feb 1 Anthem Inc said on Wednesday that it might stop selling individual plans on the Obamacare exchanges in 2018 unless the U.S. government tightens enrollment and eligibility rules to better balance sick and healthy customers.",
        "date": "02012017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 4-Anthem CEO uncertain about 2018 Obamacare participation "
    },
    {
        "content": "NEW YORK  Feb 1 Anthem Inc. Chief Executive Officer Joseph Swedish on Wednesday laid out a list of short-term changes designed to stabilize the market as the new Republican administration and Congress seek to change Obamacare.",
        "date": "02012017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem CEO says weighing 2018 participation in Obamacare plans "
    },
    {
        "content": "Jan 23 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Monday:",
        "date": "01232017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Anthem CEO says expects ACA-compliant individual plans to be break even to slightly profitable in 2017",
        "date": "02012017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem CEO says hopeful will hear soon from judge on Cigna "
    },
    {
        "content": "* Cigna - made no determination with respect to Anthem's notice seeking to extend termination date  including whether Cigna will seek to terminate merger agreement",
        "date": "02012017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Cigna says has made no determination about Anthem merger extension "
    },
    {
        "content": "* Q4 earnings per share view $1.61 -- Thomson Reuters I/B/E/S",
        "date": "02012017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem reports fourth quarter and full year 2016 results "
    },
    {
        "content": "Feb 1 - Anthem Inc  which is fighting a U.S. government lawsuit to block its deal to buy Cigna Corp  said quarterly revenue rose 7.6 percent  helped by higher premiums and an increase in memberships.",
        "date": "02012017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "U.S. health insurer Anthem's quarterly revenue rises 7.6 pct "
    },
    {
        "content": "A federal judge is expected to block a proposed deal between health insurer Anthem Inc  and Cigna Corp  as soon as Thursday  the New York Post reported  citing sources.",
        "date": "01192017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Judge to block mega-merger of Anthem and Cigna: NY Post "
    },
    {
        "content": "Jan 19 A federal judge is expected to block a proposed deal between health insurer Anthem Inc and Cigna Corp as soon as Thursday  the New York Post reported  citing sources.",
        "date": "01192017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Judge to block mega-merger of Anthem and Cigna - NY Post "
    },
    {
        "content": "NEW YORK  Jan 19 Anthem Inc on Thursday said it extended the deadline for its acquisition of Cigna Corp  by three months as it awaits a federal court ruling on the U.S. government's lawsuit to block the deal.",
        "date": "01192017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem extends Cigna deal closing date ahead of court ruling "
    },
    {
        "content": "* Says following issuance of court's opinion related to antitrust lawsuit  Cigna intends to evaluate its options in accordance with its merger agreement with Anthem",
        "date": "01192017",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Cigna intends to evaluate its options regarding its merger agreement with Anthem "
    },
    {
        "content": "* Inovalon Holdings Inc- Announced a multi-year extension of its partnership with Anthem  Inc",
        "date": "01092017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Inovalon Holdings announced a multi-year extension of its partnership with Anthem "
    },
    {
        "content": "* Anthem Inc - expects full year 2016 net income to be approximately $9.21 per share",
        "date": "01102017",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem Inc expects FY 2016 net income to be $9.21 per share "
    },
    {
        "content": "WASHINGTON  Nov 21 Anthem Inc and the U.S. Justice Department dug in their heels on Monday in court over whether the lower prices the health insurer expects to negotiate after buying smaller rival Cigna Corp are an efficiency that benefits customers or an antitrust violation.",
        "date": "11212016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "UPDATE 3-Anthem argues Fortune 500 will not suffer from Cigna deal "
    },
    {
        "content": "WASHINGTON Anthem Inc and the U.S. Justice Department dug in their heels on Monday in court over whether the lower prices the health insurer expects to negotiate after buying smaller rival Cigna Corp are an efficiency that benefits customers or an antitrust violation.",
        "date": "11222016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem argues Fortune 500 will not suffer from Cigna deal "
    },
    {
        "content": "WASHINGTON  Nov 21 Anthem Inc and the U.S. Justice Department dug in their heels on Monday in court over whether the lower prices the health insurer expects to negotiate after buying smaller rival Cigna Corp are an efficiency that benefits customers or an antitrust violation.",
        "date": "11212016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem argues that Fortune 500 won't suffer from Cigna deal "
    },
    {
        "content": "U.S. health insurer Anthem Inc  on Wednesday raised the prospect of smaller participation in the individual Obamacare exchanges in 2018  saying it would have a market-by-market strategy that hinges on 2017 profitability.",
        "date": "11022016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem says it may trim Obamacare participation in 2018 "
    },
    {
        "content": "Nov 2 U.S. health insurer Anthem Inc on Wednesday raised the prospect of smaller participation in the individual Obamacare exchanges in 2018  saying it would have a market-by-market strategy that hinges on 2017 profitability.",
        "date": "11022016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 3-Anthem says it may trim Obamacare participation in 2018 "
    },
    {
        "content": "NEW YORK  Nov 2    Anthem Inc Chief Executive Officer Joseph Swedish said on Tuesday during a conference call that Anthem is looking closely at the Obamacare individual exchanges for regulatory changes as it decides if it will modify strategy for 2018.",
        "date": "11022016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem CEO looking closely at Obamacare individual plan market "
    },
    {
        "content": "* Anthem Inc - FY 2016 net income is now expected to be approximately $9.28 per share  including approximately $1.52 per share of net unfavorable items",
        "date": "11022016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem Q3 adjusted EPS $2.45 "
    },
    {
        "content": "Nov 2 Anthem Inc's quarterly revenue rose 7.5 percent as the No. 2 U.S. health insurer added more members to its Medicaid plans.",
        "date": "11022016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "U.S. health insurer Anthem's quarterly revenue rises 7.5 pct "
    },
    {
        "content": "Oct 26 Pharmacy benefit manager Express Scripts   in conference call with analysts:",
        "date": "10262016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Express Scripts says hopes to hold onto Anthem as client "
    },
    {
        "content": "* Anthem medicare plans score significant increases in 2017 medicare star quality ratings",
        "date": "10132016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem Medicare Plans score increases in 2017 Medicare Star Quality ratings "
    },
    {
        "content": "Oct 7 Health insurer Anthem Inc said it would not cover the first U.S. Food and Drug Administration-approved Duchenne muscular dystrophy (DMD) drug  developed by Sarepta Therapeutics Inc  calling it \"investigational and not medically necessary\".",
        "date": "10072016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem won't cover first FDA-approved Duchenne drug "
    },
    {
        "content": "* Lowell Copper  Gold Mountain Mining And Anthem United announce completion of business combination to create JDL Gold Corp.  Source text for Eikon:",
        "date": "10072016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Lowell Copper  Gold Mountain Mining and Anthem United announce completion of business combination to create Jdl Gold Corp. "
    },
    {
        "content": "WASHINGTON The U.S. government  which is suing to stop Anthem Inc's  proposed purchase of Cigna Corp   is pressing the health insurers to provide letters in which each of them accused the other of breaching the merger agreement  according to court documents filed on Wednesday.",
        "date": "09212016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "U.S. wants letters showing conflict in Anthem-Cigna merger: filing "
    },
    {
        "content": "WASHINGTON  Sept 21 The U.S. government  which is suing to stop Anthem Inc's proposed purchase of Cigna Corp  is pressing the health insurers to provide letters in which each of them accused the other of breaching the merger agreement  according to court documents filed on Wednesday.",
        "date": "09212016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "U.S. wants letters showing conflict in Anthem-Cigna merger -filing "
    },
    {
        "content": "* Anthem and Cigna have accused one another of merger breach - Bloomberg  Source text - (http://bloom.bg/2cR9knM) Further company coverage:    (Bengaluru Newsroom)",
        "date": "09212016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem and Cigna have accused one another of merger breach - Bloomberg "
    },
    {
        "content": "* Lowell Copper  Gold Mountain Mining and Anthem United announce a proposed combination to create a new multi-asset gold and copper company",
        "date": "08152016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Lowell copper  Gold Mountain  Anthem United propose to create new company "
    },
    {
        "content": "WASHINGTON The judge overseeing the U.S. Justice Department's bid to stop health insurer Anthem from merging with competitor Cigna said on Friday her goal was to have a ruling by the end of January  later than the Dec. 30 date sought by Anthem.",
        "date": "08122016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "U.S. judge in Anthem merger trial sets trial for Nov. 21  plans ruling by late Jan. 2017 "
    },
    {
        "content": "WASHINGTON The judge overseeing the U.S. Justice Department's bid to stop health insurer Anthem  from merging with competitor Cigna  said on Friday her goal was to have a ruling by the end of January  later than the Dec. 30 date sought by Anthem.",
        "date": "08122016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "U.S. judge in Anthem merger trial sets trial for November 21  plans ruling by late January 2017 "
    },
    {
        "content": "WASHINGTON The judge overseeing the U.S. government's bid to stop health insurer Anthem Inc  from buying Cigna Corp   who had been seen as favorable for the deal  has relinquished the case.",
        "date": "08052016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "U.S. challenge to Anthem-Cigna deal gets new judge "
    },
    {
        "content": "WASHINGTON  Aug 12 The judge overseeing the U.S. Justice Department's bid to stop health insurer Anthem  from merging with competitor Cigna said on Friday her goal was to have a ruling by the end of January  later than the Dec. 30 date sought by Anthem.",
        "date": "08122016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-U.S. judge in Anthem merger trial sets trial for Nov. 21  plans ruling by late Jan. 2017 "
    },
    {
        "content": "The judge overseeing the U.S. Justice Department's bid to stop big health insurer Anthem from merging with competitor Cigna said on Friday her goal was to have a ruling by the end of January  later than the Dec. 30 sought by Anthem.",
        "date": "08122016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Judge in Anthem merger trial plans ruling by late January "
    },
    {
        "content": "WASHINGTON  Aug 12 The judge overseeing the U.S. Justice Department's bid to stop big health insurer Anthem  from merging with competitor Cigna said on Friday her goal was to have a ruling by the end of January  later than the Dec. 30 sought by Anthem.",
        "date": "08122016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "U.S. judge in Anthem merger trial plans ruling by late January "
    },
    {
        "content": "WASHINGTON  Aug 5 The judge overseeing the U.S. government's bid to stop health insurer Anthem Inc from buying Cigna Corp  who had been seen as favorable for the deal  has relinquished the case.",
        "date": "08052016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 3-U.S. challenge to Anthem-Cigna deal gets new judge "
    },
    {
        "content": "IT services provider Cognizant Technology Solutions Corp  forecast current-quarter revenue below analysts' estimates  citing the impact of Brexit vote on its clients from the financial services industry.",
        "date": "08052016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Cognizant's forecast weak as Brexit weighs on clients "
    },
    {
        "content": "* Shares recoup early losses   (Adds President comment  details  background  updates shares)",
        "date": "08052016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Cognizant's forecast weak as Brexit weighs on clients "
    },
    {
        "content": "* Shares fall as much as 6.4 pct   (Adds conference call comments; updates shares)",
        "date": "07292016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "UPDATE 3-Health insurer Cigna to look for M&A targets if Anthem deal fails "
    },
    {
        "content": "* Anthem CEO Joseph Swedish on CNBC - Very disappointed with the DOJ decision; blocks patient access to \"high quality healthcare\"",
        "date": "07262016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem CEO on CNBC says believe will prevail in the end "
    },
    {
        "content": "Health insurer Anthem Inc  on Wednesday vowed to fight U.S. government efforts to block its planned acquisition of Cigna Corp  and said it expects to lose money this year on its business selling individual health coverage under President Barack Obama's healthcare law.",
        "date": "07272016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem to fight for Cigna deal  sees Obamacare losses "
    },
    {
        "content": "July 27 Health insurer Anthem Inc on Wednesday vowed to fight U.S. government efforts to block its planned acquisition of Cigna Corp and said it expects to lose money this year on its business selling individual health coverage under President Barack Obama's healthcare law.",
        "date": "07272016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 4-Anthem to fight for Cigna deal  sees Obamacare losses "
    },
    {
        "content": "* Comments on DOJ position regarding proposed deal with Anthem; Cinga currently evaluating its options consistent with obligations under agreement",
        "date": "07212016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Cigna comments on DOJ position regarding proposed deal with Anthem "
    },
    {
        "content": "July 19 U.S. antitrust officials are expected to file lawsuits to block Anthem Inc's acquisition of Cigna Corp as well as Aetna Inc's takeover of Humana Inc  Bloomberg reported  citing a person familiar with the matter.",
        "date": "07192016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "CORRECTED-U.S. antitrust officials set to block Anthem  Aetna deals - BBG "
    },
    {
        "content": "NEW YORK U.S. antitrust officials on Thursday moved to block an unprecedented consolidation of the national health insurance market  filing a lawsuit against Anthem Inc's  proposed purchase of Cigna Corp  and Aetna Inc's  planned acquisition of Humana Inc . | Video ",
        "date": "07222016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "U.S. moves to block massive health insurer deals led by Anthem  Aetna "
    },
    {
        "content": "Health insurer Anthem Inc on Wednesday said it was committed to its planned acquisition of Cigna Corp  and again vowed to fight U.S. government efforts to block the deal  saying the merger will help lower costs for consumers.",
        "date": "07272016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem vows to fight for Cigna deal; profit beats estimates "
    },
    {
        "content": "* Q2 revenue $21.3 billion versus I/B/E/S view $20.57 billion",
        "date": "07272016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem reports Q2 adjusted earnings per share $3.33 "
    },
    {
        "content": "US Justice Department files lawsuit against Anthem  Cigna In D.C. District Court - court filing   (Reporting By Caroline Humer)",
        "date": "07212016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Us Justice Department files lawsuit against Anthem  Cigna in D.C. District court - court filing "
    },
    {
        "content": "* U.S. said poised to sue to block Anthem  Aetna mergers - Bloomberg",
        "date": "07192016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-U.S. said poised to sue to block Anthem  Aetna mergers - Bloomberg "
    },
    {
        "content": "NEW YORK  July 21 U.S. antitrust officials on Thursday moved to block an unprecedented consolidation of the national health insurance market  filing a lawsuit against Anthem Inc's proposed purchase of Cigna Corp and Aetna Inc's planned acquisition of Humana Inc.",
        "date": "07222016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 7-U.S. moves to block massive health insurer deals led by Anthem  Aetna "
    },
    {
        "content": "July 27 Anthem Inc's quarterly revenue rose about 7.2 percent as the No.2 U.S. health insurer added more members in its government business  which sells Medicaid and Medicare plans.",
        "date": "07272016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "U.S. health insurer Anthem's quarterly revenue rises 7.2 pct "
    },
    {
        "content": "NEW YORK  July 21 U.S. antitrust regulators will announce on Thursday plans to file lawsuits to block two separate health insurance mergers  Anthem Inc.'s  purchase of Cigna Corp. and Aetna Inc.'s  acquisition of Humana Inc.  according to a source familiar with the matter.",
        "date": "07212016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "U.S. regulators to block Anthem-Cigna  Aetna-Humana deals Thursday-source "
    },
    {
        "content": "California's insurance commissioner on Thursday urged the U.S. Department of Justice to block health insurer Anthem Inc's  acquisition of Cigna Corp   saying he is concerned it will raise premiums in the state.",
        "date": "06172016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "California insurance commissioner urges U.S. to block Anthem-Cigna deal "
    },
    {
        "content": "* Fitch: Anthem block of Cigna buy wouldn't likely hurt ratings",
        "date": "06202016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Fitch: Anthem block of Cigna Buy wouldn't likely hurt ratings "
    },
    {
        "content": "NEW YORK  June 16 The state of California's Insurance Commissioner Dave Jones said on Thursday that he would recommend to the U.S. Department of Justice that it block health insurer Anthem Inc's acquisition of Cigna Corp  because he believes it will raise prices in the state.",
        "date": "06162016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "California's insurance head says Anthem-Cigna deal anti-competitive "
    },
    {
        "content": "* U.S. antitrust regulators have privately expressed concerns about Anthem's proposed acquisition of Cigna- WSJ  citing sources",
        "date": "06192016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-U.S. antitrust regulators have privately expressed concerns about Anthem-Cigna deal- WSJ "
    },
    {
        "content": "June 19 U.S. antitrust regulators are concerned about health insurer Anthem Inc's proposed acquisition of Cigna Corp and not sure the companies can offer enough concessions to maintain competition in the industry  the Wall Street Journal reported on Sunday.",
        "date": "06202016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Antitrust regulators worry about proposed Cigna-Anthem merger -WSJ "
    },
    {
        "content": "June 16 California's insurance commissioner on Thursday urged the U.S. Department of Justice to block health insurer Anthem Inc's acquisition of Cigna Corp  saying he is concerned it will raise premiums in the state.",
        "date": "06162016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "CORRECTED-UPDATE 2-California insurance commissioner urges U.S. to block Anthem-Cigna deal "
    },
    {
        "content": "* Intend to reaffirm company's net income guidance for full year 2016 to be greater than $9.65 per share",
        "date": "06072016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem intends to reaffirm company's net income guidance for 2016 "
    },
    {
        "content": "* Received final order from Indiana Department Of Insurance Commissioner  approving acquisition of Cigna healthcare of Indiana",
        "date": "05262016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem gets approval for Cigna deal from Indiana Department of Insurance "
    },
    {
        "content": "* With election of Braly  ExxonMobil board stands at 14 directors  12 of whom are non-employee directors",
        "date": "05252016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Angela Braly elected to ExxonMobil board "
    },
    {
        "content": "NEW YORK Anthem Inc  Chief Executive Officer Joseph Swedish said on Tuesday the health insurer was pushing for approval from antitrust regulators reviewing its $51 billion acquisition of Cigna Corp  and expects to hear a decision in July.",
        "date": "05242016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem CEO expects U.S. regulatory decision in July "
    },
    {
        "content": "Wall Street expressed growing doubts about a pending $54 billion merger of U.S. health insurers Anthem Inc  and Cigna Corp on Monday as news of management squabbles added to concerns over its review by antitrust regulators.",
        "date": "05232016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Doubts mount over merger of health insurers Anthem  Cigna "
    },
    {
        "content": "NEW YORK  May 24 Anthem Inc Chief Executive Officer Joseph Swedish said on Tuesday the health insurer was pushing for approval from antitrust regulators reviewing its $51 billion acquisition of Cigna Corp and expects to hear a decision in July.",
        "date": "05242016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Anthem CEO expects U.S. regulatory decision in July "
    },
    {
        "content": "NEW YORK  May 24 Anthem Inc Chief Executive Officer Joseph Swedish on Tuesday said that the antitrust process with Cigna Corp is moving forward as expected - including on the national level - and that tensions with the smaller insurer about the review are in the past.",
        "date": "05242016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem CEO says Cigna deal moving forward with antitrust review "
    },
    {
        "content": "May 23 Wall Street expressed growing doubts about a pending $54 billion merger of U.S. health insurers Anthem Inc and Cigna Corp on Monday as news of management squabbles added to concerns over its review by antitrust regulators.",
        "date": "05232016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Doubts mount over merger of health insurers Anthem  Cigna "
    },
    {
        "content": "WASHINGTON Quarrels have broken out behind the scenes of Anthem Inc's  proposed acquisition of Cigna Corp   as the health insurers seek regulatory approval for their landmark deal  the Wall Street Journal reported on Sunday.",
        "date": "05222016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem  Cigna merger squabbles could delay antitrust approval: WSJ "
    },
    {
        "content": "NEW YORK Health insurer Cigna Corp plans to cut its customers' prescriptions for opioid treatments by 25 percent over the next three years  putting its weight behind a U.S. government battle against addictive pain killers.",
        "date": "05192016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Cigna plans to cut opioid use among U.S. customers by 25 pct "
    },
    {
        "content": "Wall Street expressed growing doubts about a pending $54 billion merger of U.S. health insurers Anthem Inc  and Cigna Corp  on Monday as news of management squabbles added to concerns over its review by antitrust regulators.",
        "date": "05242016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Doubts mount over merger of health insurers Anthem  Cigna "
    },
    {
        "content": "May 23 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "05232016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "PRESS DIGEST - Wall Street Journal - May 23 "
    },
    {
        "content": "WASHINGTON  May 22 Quarrels have broken out behind the scenes of Anthem Inc's proposed acquisition of Cigna Corp  as the health insurers seek regulatory approval for their landmark deal  the Wall Street Journal reported on Sunday.",
        "date": "05222016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-Anthem  Cigna merger squabbles could delay antitrust approval -WSJ "
    },
    {
        "content": "WASHINGTON  May 22 Quarrels have broken out behind the scenes of Anthem Inc's proposed acquisition of Cigna Corp  as the health insurers seek regulatory approval for their landmark deal  the Wall Street Journal reported on Sunday.",
        "date": "05222016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem  Cigna merger squabbles could delay antitrust approval - WSJ "
    },
    {
        "content": "NEW YORK Health insurer Cigna Corp   which announced plans to be bought by larger Anthem Inc  10 months ago  on Friday said the deal may close in 2017 rather than 2016 due to the complexity of the regulatory process  according to a filing with the Securities and Exchange Commission.",
        "date": "05062016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Cigna says Anthem deal could close in 2017; Anthem sticks to 2016 "
    },
    {
        "content": "U.S. health insurer Cigna Corp   which is being bought by larger rival Anthem Inc   reported a better-than-expected quarterly profit as more customers signed up for its Medicare Advantage business  boosting premiums.",
        "date": "05062016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Health insurer Cigna reports better-than-expected profit "
    },
    {
        "content": "Health insurer Anthem Inc  on Wednesday said it is not planning to exit the Obamacare individual insurance exchanges next year like competitor UnitedHealth Group  and is planning instead on growth in that market.",
        "date": "04272016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem CEO plans for growth on Obamacare insurance exchanges "
    },
    {
        "content": "April 27 Health insurer Anthem Inc on Wednesday said it is not planning to exit the Obamacare individual insurance exchanges next year like competitor UnitedHealth Group  and is planning instead on growth in that market.",
        "date": "04272016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 3-Anthem CEO plans for growth on Obamacare insurance exchanges "
    },
    {
        "content": "Health insurer Anthem Inc on Wednesday said the Obamacare individual insurance exchanges are not as profitable as it originally expected  but it is not planning to exit like competitor UnitedHealth Group.",
        "date": "04272016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem CEO backs Obamacare insurance exchanges and sees possible growth "
    },
    {
        "content": "NEW YORK  April 27 Anthem Inc added 975 000 new individual members from the Obamacare exchanges during the first quarter  an increase of 184 000 members and more than the company had expected  Chief Executive Joe Swedish said on Wednesday.",
        "date": "04272016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem's individual Obamacare enrollment grew more than expected "
    },
    {
        "content": "* Q1 earnings per share view $3.32 -- Thomson Reuters I/B/E/S",
        "date": "04272016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem Q1 adjusted earnings per share $3.46 "
    },
    {
        "content": "April 27 Health insurer Anthem Inc  which is in the process of buying smaller rival Cigna Corp   reported a near 6.5 percent rise in quarterly revenue  as it added more members to its Medicaid plans.",
        "date": "04272016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Health insurer Anthem reports higher revenue on Medicaid enrollments "
    },
    {
        "content": "Pharmacy benefit manager Express Scripts Holding Co has accused Anthem Inc of negotiating their contract in bad faith and is seeking a court order that the health insurer has no right to demand lower drug prices.",
        "date": "04192016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Express Scripts says Anthem negotiated in bad faith: court filing "
    },
    {
        "content": "April 19 - Pharmacy benefit manager Express Scripts Holding Co has accused Anthem Inc of negotiating their contract in bad faith and is seeking a court order that the health insurer has no right to demand lower drug prices.",
        "date": "04202016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Express Scripts says Anthem negotiated in bad faith - court filing "
    },
    {
        "content": "April 19 Pharmacy benefit manager Express Scripts Holding Co has accused Anthem Inc of negotiating their contract in bad faith and is seeking a court order that the health insurer has no right to demand lower drug prices.",
        "date": "04192016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-Express Scripts says Anthem negotiated in bad faith - court filing "
    },
    {
        "content": "April 19 Pharmacy benefit manager Express Scripts Holding Co has accused Anthem Inc of negotiating their contract in bad faith and is seeking a court order that the health insurer has no right to demand lower drug prices.",
        "date": "04192016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Express Scripts says Anthem negotiated in bad faith -court filing "
    },
    {
        "content": "* Ceo Joseph Swedish's fy 2015 total compensation was $13.6 million  compared to $13.5 million in fy 2014",
        "date": "04012016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem CEO Joseph Swedish's 2015 compensation was $13.6 mln  vs $13.5 mln in 2014 "
    },
    {
        "content": "* Anthem lawsuit is credit negative for express scripts but no effect on ratings",
        "date": "03212016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Moody's says Anthem lawsuit is credit negative for Express Scripts but no effect on ratings "
    },
    {
        "content": "Health insurer Anthem Inc said it had sued pharmacy benefit manager Express Scripts Holding Co to recover damages from drug pricing it believes was too high.",
        "date": "03212016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Health insurer Anthem sues Express Scripts over drug pricing "
    },
    {
        "content": "* Fy2016 earnings per share view $10.90 -- Thomson Reuters I/B/E/S",
        "date": "03162016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem Inc says \u007freaffirms net income guidance for FY 2016 "
    },
    {
        "content": "March 21 Health insurer Anthem Inc said it had sued pharmacy benefit manager Express Scripts Holding Co  to recover damages from drug pricing it believes was too high.",
        "date": "03212016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Health insurer Anthem sues Express Scripts over drug pricing "
    },
    {
        "content": "March 21 Health insurer Anthem Inc said it filed a lawsuit against pharmacy benefit manager Express Scripts Holding Co to recover damages for pharmacy pricing that was higher than competitive benchmark pricing.",
        "date": "03212016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Health insurer Anthem files suit against Express Scripts "
    },
    {
        "content": "March 1 The American Hospital Association warned U.S. antitrust regulators that Anthem Inc's proposed acquisition of Cigna Corp will hurt other health insurers' ability to compete with Blue Cross Blue Shield plans  leading to higher premiums for consumers.",
        "date": "03012016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "U.S. hospital group warns of Blue Cross dominance if Anthem buys Cigna "
    },
    {
        "content": "* Tells analysts in conference call it is hopeful it can reach contract agreement with Anthem Inc   Source text for Eikon:  Further company coverage:    (Reporting by Ransdell Pierson)",
        "date": "02172016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "BRIEF-Express Scripts says hopeful can reach contract agreement with Anthem "
    },
    {
        "content": "A federal judge has dismissed several claims but allowed others to go forward in a multidistrict litigation against health insurer Anthem Inc over a data breach last year that compromised about 79 million customers' personal information.",
        "date": "02172016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Judge allows some claims over Anthem data breach to go forward "
    },
    {
        "content": "Feb 4 Health insurer Cigna Corp  which is being bought by larger rival Anthem Inc  reported a 6.7 percent rise in quarterly revenue  helped by membership growth in its government plans.",
        "date": "02042016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Health insurer Cigna's quarterly revenue rises 6.7 pct "
    },
    {
        "content": "Health insurer Anthem Inc   which is in the process of buying smaller rival Cigna Corp   said on Wednesday its individual Obamacare exchange health plans weighed on fourth-quarter profit  causing it to miss analysts' expectations.",
        "date": "01272016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Health insurer Anthem says Obamacare costs drag down fourth-quarter profit "
    },
    {
        "content": "* Anthem cfo expects obamacare exchange business to be profitable in 2016 but to fall short of projected range for 3 to 5 percent profit margin  Further company coverage:    (Reporting By Caroline Humer)",
        "date": "01272016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem CFO expects Obamacare exchange business to be profitable in 2016 "
    },
    {
        "content": "Jan 27 Health insurer Anthem Inc  which is in the process of buying smaller rival Cigna Corp  reported a 6.3 percent rise in quarterly revenue as more people enrolled in its Medicaid plans.",
        "date": "01272016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Health insurer Anthem reports higher quarterly revenue "
    },
    {
        "content": "Jan 12 Anthem Inc could save $3 billion annually on drug costs from a re-pricing provision in its current contract with pharmacy benefits manager Express Scripts Holding Co  the health insurer's chief executive officer said Tuesday.",
        "date": "01132016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem targets $3 billion in drug cost savings with Express Scripts "
    },
    {
        "content": "Jan 12 ANTHEM INC CEO JOSEPH SWEDISH SAYS CONTINUES TO EXPECT CIGNA ACQUISITION TO CLOSE IN SECOND HALF OF 2016 ANTHEM SAYS CONTINUES TO WORK WITH REGULATORS TO FINALIZE ACQUISITION ANTHEM SAYS CIGNA DEAL WILL ENHANCE AFFORDABILITY  CHOICE FOR MEMBERS ANTHEM SAYS EXPECTS COST SAVINGS FROM REPRICING PROVISION IN PHARMACEUTICAL SERVICES CONTRACT   (Reporting by Susan Kelly in Chicago)",
        "date": "01122016",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem CEO expects Cigna acquisition to close in second half "
    },
    {
        "content": "Jan 12 Anthem Inc could save $3 billion annually on drug costs from a re-pricing provision in its current contract with pharmacy benefits manager Express Scripts Holding Co  the health insurer's chief executive officer said Tuesday.",
        "date": "01132016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-Anthem targets $3 billion in drug cost savings with Express Scripts "
    },
    {
        "content": "Jan 12 Health insurer Anthem Inc said on Tuesday it expected an adjusted net income of more than $10.80 per share for 2016 compared with $10.16 estimated for 2015.",
        "date": "01122016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Health insurer Anthem expects higher profit for 2016 "
    },
    {
        "content": "Jan 12 Health insurer Anthem Inc  which is buying rival Cigna Corp  said it expected its adjusted net income to rise to over $10.80 per share in 2016 from $10.16 estimated for 2015.",
        "date": "01122016",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-Health insurer Anthem expects higher profit for 2016 "
    },
    {
        "content": "Pharmacy benefit manager Express Scripts Holding Co said it was negotiating the repricing of its contract with Anthem Inc  one of its biggest customers  but it was too soon to know the financial terms of the deal.",
        "date": "12232015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Express Scripts in talks over new Anthem contract  forecasts growth "
    },
    {
        "content": "Pharmacy benefit manager Express Scripts Holding Co said it was negotiating the repricing of its contract with Anthem Inc  one of its biggest customers  but it was too soon to know the financial terms of the deal.",
        "date": "12222015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Express Scripts in talks over new Anthem contract  forecasts growth "
    },
    {
        "content": "Dec 22 Pharmacy benefit manager Express Scripts Holding Co said it was negotiating the repricing of its contract with Anthem Inc  one of its biggest customers  but it was too soon to know the financial terms of the deal.",
        "date": "12222015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Express Scripts in talks over new Anthem contract  forecasts growth "
    },
    {
        "content": "U.S. health insurers Aetna Inc  and Anthem Inc  on Friday sought to reassure investors that their Obamacare businesses had not worsened after UnitedHealth Group Inc  warned of mounting losses in that sector.",
        "date": "11202015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Aetna  Anthem reassure investors on Obamacare business "
    },
    {
        "content": "U.S. health insurers Aetna Inc and Anthem Inc on Friday sought to reassure investors that their Obamacare businesses had not worsened after UnitedHealth Group Inc warned of mounting losses in that sector.",
        "date": "11202015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Aetna  Anthem say individual Obamacare business performing as expected "
    },
    {
        "content": "Health insurer Cigna Corp  reported a better-than-expected quarterly profit  helped by higher enrollments in its government plans and favorable medical costs.",
        "date": "11062015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Health insurer Cigna reports better-than-expected profit "
    },
    {
        "content": "Health insurer Anthem Inc  said on Wednesday that its Obamacare insurance business is being hampered by lower-than-anticipated enrollment due to fewer applicants than expected and cheaper premium rates at competitors.",
        "date": "10282015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem shares falls as Obamacare business hampers profit "
    },
    {
        "content": "Oct 28 Health insurer Anthem Inc said on Wednesday that its Obamacare insurance business is being hampered by lower-than-anticipated enrollment due to fewer applicants than expected and cheaper premium rates at competitors.",
        "date": "10282015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Anthem shares falls as Obamacare business hampers profit "
    },
    {
        "content": "NEW YORK Anthem Inc  Chief Executive Officer Joseph Swedish said on Wednesday that he expects its planned acquisition of Cigna to close in the second half of 2016 as anticipated.",
        "date": "10282015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem CEO expects Cigna acquisition to close second half of 2016 "
    },
    {
        "content": "NEW YORK  Oct 28 Anthem Inc Chief Executive Officer Joseph Swedish said on Wednesday that he expects its planned acquisition of Cigna to close in the second half of 2016 as anticipated.",
        "date": "10282015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem CEO expects Cigna acquisition to close 2nd half of 2016 "
    },
    {
        "content": "Oct 28 Health insurer Anthem Inc  reported a 7.6 percent increase in quarterly revenue  helped by enrollment growth in its commercial and government businesses.",
        "date": "10282015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Health insurer Anthem's revenue rises 7.6 pct "
    },
    {
        "content": "NEW YORK Health insurer Anthem's planned $47 billion takeover of rival Cigna will not hurt consumers but increase choice and affordability  Cigna CEO David Cordani said  defending the merger against widespread criticism that it will harm competition.",
        "date": "09172015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Cigna CEO defends Anthem deal  says consumer will still have choice "
    },
    {
        "content": "NEW YORK  Sept 8 The leading U.S. physicians' organization said on Tuesday that two proposed mergers of U.S. health insurers worth tens of billions of dollars could lead to higher prices in 17 states for companies that buy insurance for their workers or people who buy their own insurance.",
        "date": "09082015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "UPDATE 3-U.S. doctors group says planned health mergers are anti-competitive "
    },
    {
        "content": "Aetna Inc Chief Executive Mark Bertolini said on Tuesday the company is talking to federal and state officials on its $37 billion acquisition of Humana Inc  and that there is enough insurance competition for it to receive approval.",
        "date": "08042015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Aetna CEO says antitrust process underway in Humana deal "
    },
    {
        "content": "NEW YORK  Aug 4 Aetna Inc Chief Executive Mark Bertolini said on Tuesday the company is talking to federal and state officials on its $37 billion acquisition of Humana Inc and that there is enough insurance competition for it to receive approval.",
        "date": "08042015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-Aetna CEO says antitrust process underway in Humana deal "
    },
    {
        "content": "NEW YORK  Aug 6 U.S. hospitals urged antitrust regulators this week to consider whether health insurer Anthem Inc's  planned acquisition of rival Cigna Corp  would boost healthcare costs.",
        "date": "08062015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "U.S. hospitals urge DOJ antitrust probe of Anthem-Cigna deal "
    },
    {
        "content": "NEW YORK  Aug 6 U.S. hospitals urged antitrust regulators this week to consider whether health insurer Anthem Inc's  planned acquisition of rival Cigna Corp  would boost healthcare costs.",
        "date": "08062015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-U.S. hospitals urge DOJ antitrust probe of Anthem-Cigna deal "
    },
    {
        "content": "Health insurer Anthem Inc   which plans to buy rival Cigna Corp  for $47 billion  on Wednesday said medical costs  particularly in its Medicaid and Medicare businesses  were at the low end of expectations and helped boost second-quarter profit.",
        "date": "07292015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem profit beats as medical costs stay at low end of estimates "
    },
    {
        "content": "July 29 Health insurer Anthem Inc  which plans to buy rival Cigna Corp for $47 billion  on Wednesday said medical costs  particularly in its Medicaid and Medicare businesses  were at the low end of expectations and helped boost second-quarter profit.",
        "date": "07292015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 4-Anthem profit beats as medical costs stay at low end of estimates "
    },
    {
        "content": "July 29 Health insurer Anthem Inc  reported a 17.5 percent rise in quarterly earnings helped by strong performance in its commercial and government businesses.",
        "date": "07292015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Health insurer Anthem profit rises 17.5 percent "
    },
    {
        "content": "The U.S. House of Representatives Judiciary Committee is planning two hearings for September to discuss concerns about reduced competition in the healthcare industry  lawmakers from both parties said.",
        "date": "07272015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "U.S. House panel to hold hearings on competition in healthcare "
    },
    {
        "content": "Health insurer Cigna Corp  which agreed last week to be bought by Anthem Inc for $47 billion  said on Thursday that medical services use was low in the second quarter  helping to keep costs in check and beat Wall Street profit estimates.",
        "date": "07302015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Health insurer Cigna says second-quarter medical costs stay low; profit beats "
    },
    {
        "content": "July 30 Health insurer Cigna Corp  which agreed last week to be bought by Anthem Inc for $47 billion  said on Thursday that medical services use was low in the second quarter  helping to keep costs in check and beat Wall Street profit estimates.",
        "date": "07302015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "CORRECTED-UPDATE 3-Health insurer Cigna says 2nd-qtr medical costs stay low; profit beats "
    },
    {
        "content": "NEW YORK  July 30 Cigna Corp CEO David Cordani said on Thursday that the company has begun conversations with regulators  including state regulators and antitrust regulators  about its $47 billion agreement to be purchased by Anthem Inc..",
        "date": "07302015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Cigna CEO says has begun talks with regulators about Anthem deal "
    },
    {
        "content": "July 22 U.S. health insurer Anthem Inc  is close to finalizing negotiations to acquire peer Cigna Inc  and could announce a roughly $48 billion deal as early as this week  two people familiar with the matter said on Wednesday.",
        "date": "07232015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "UPDATE 4-Anthem set to announce deal for Cigna this week -sources "
    },
    {
        "content": "Anthem Inc said on Friday it would buy Cigna Corp for about $54.2 billion  creating the largest U.S. health insurer by membership and accelerating the industry's consolidation from five national players to three.",
        "date": "07242015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem to buy Cigna  creating biggest U.S. health insurer "
    },
    {
        "content": "* Combined company would be No. 1 insurer  cover 53 mln members",
        "date": "07242015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 5-Anthem to buy Cigna  creating biggest U.S. health insurer "
    },
    {
        "content": "July 24 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "07242015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "NEW YORK (IFR) - U.S. health insurer Anthem said on Friday that Bank of America  Credit Suisse and UBS have committed to a $27 billion bridge to back its $54.2 billion acquisition of rival Cigna Corp  according to RLPC.",
        "date": "07242015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem locks in bank financing for Cigna purchase "
    },
    {
        "content": "NEW YORK  July 24 (IFR) - U.S. health insurer Anthem said on Friday that Bank of America  Credit Suisse and UBS have committed to a $27 billion bridge to back its $54.2 billion acquisition of rival Cigna Corp  according to RLPC.",
        "date": "07242015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Anthem locks in bank financing for Cigna purchase "
    },
    {
        "content": "NEW YORK  July 24 (IFR) - US health insurer Anthem said on Friday it had locked in committed financing from Bank of America  Credit Suisse and UBS to pay for its acquisition of rival Cigna Corp in a deal valued at US$54.2bn.",
        "date": "07242015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "CORRECTED-Anthem locks in bank financing for Cigna purchase "
    },
    {
        "content": "Health insurer Anthem Inc is close to finalizing negotiations to acquire peer Cigna Inc and could announce a roughly $48 billion deal as early as this week  according to a person familiar with the matter.",
        "date": "07222015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem set to announce deal for Cigna this week -source "
    },
    {
        "content": "* Says confident of getting regulatory approvals   (Adds comments from Anthem  Cigna CEOs  background on businesses)",
        "date": "07242015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 4-Anthem to buy Cigna to create biggest U.S. health insurer "
    },
    {
        "content": "July 22 Health insurer Anthem Inc is close to finalizing negotiations to acquire peer Cigna Inc  and could announce a roughly $48 billion deal as early as this week  according to a person familiar with the matter.",
        "date": "07222015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "RPT-UPDATE 2-Anthem set to announce deal for Cigna this week -source "
    },
    {
        "content": "New York US insurer Anthem Inc has lined up an approximately $27 billion bridge loan facility to help finance its $54.2 billion acquisition of health services company Cigna Corp  banking sources said.",
        "date": "07242015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "LPC-Anthem lines up $27 billion bridge loan for Cigna buy: bankers "
    },
    {
        "content": "New York  July 24 US insurer Anthem Inc  has lined up an approximately $27 billion bridge loan facility to help finance its $54.2 billion acquisition of health services company Cigna Corp  banking sources said.",
        "date": "07242015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "LPC-Anthem lines up $27 bln bridge loan for Cigna buy-bankers "
    },
    {
        "content": "Health insurer Anthem Inc is close to finalizing negotiations to acquire peer Cigna Inc and could announce a roughly $48 billion deal as early as this week  according to a person familiar with the matter.",
        "date": "07222015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem set to announce deal for Cigna this week: source "
    },
    {
        "content": "July 22 Health insurer Anthem Inc is close to finalizing negotiations to acquire peer Cigna Inc  and could announce a roughly $48 billion deal as early as this week  according to a person familiar with the matter.",
        "date": "07222015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Anthem set to announce deal for Cigna this week -source "
    },
    {
        "content": "July 9 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "07092015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Health insurers Anthem Inc  and Cigna Corp  were moving ahead to sign a merger deal as Cigna backed down on its differences over governance issues  CNBC tweeted  citing sources.",
        "date": "07092015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem  Cigna progressing toward deal: CNBC "
    },
    {
        "content": "July 9 Health insurers Anthem Inc and Cigna Corp were moving ahead to sign a merger deal as Cigna backed down on its differences over governance issues  CNBC tweeted  citing sources.",
        "date": "07092015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-Anthem  Cigna progressing towards deal - CNBC "
    },
    {
        "content": "July 9 Health insurers Anthem Inc and Cigna Corp were moving ahead to sign a merger deal as Cigna backed down over governance issues  CNBC tweeted  citing sources.",
        "date": "07092015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem  Cigna progressing towards deal - CNBC "
    },
    {
        "content": "U.S. health insurer Cigna Corp  has had its first meetings with competitor Anthem Inc  after it rebuffed Anthem's $47 billion merger proposal last month  a person familiar with the matter said on Thursday.",
        "date": "07022015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem  Cigna in new round of talks: source "
    },
    {
        "content": "July 2 U.S. health insurer Cigna Corp has had its first meetings with competitor Anthem Inc after it rebuffed Anthem's $47 billion merger proposal last month  a person familiar with the matter said on Thursday.",
        "date": "07022015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem  Cigna in new round of talks -source "
    },
    {
        "content": "NEW YORK/WASHINGTON  June 22 U.S. health insurer Anthem Inc on Monday dismissed concerns that buying smaller competitor Cigna Corp would be considered anti-competitive  even as antitrust experts said the combination would earn regulatory scrutiny.",
        "date": "06222015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem confident  but experts see antitrust hurdles to Cigna deal "
    },
    {
        "content": "NEW YORK/WASHINGTON  June 22 U.S. health insurer Anthem Inc on Monday dismissed concerns that buying smaller competitor Cigna Corp would be considered anti-competitive  even as antitrust experts said the combination would earn regulatory scrutiny.",
        "date": "06222015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Anthem confident  but experts see antitrust hurdles to Cigna deal "
    },
    {
        "content": "Health insurer Cigna Corp  rebuffed Anthem Inc's  $47 billion merger proposal on Sunday  saying it was \"deeply disappointed\" with Anthem's recent actions and the offer was not in the best interest of shareholders.",
        "date": "06212015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Cigna rebuffs Anthem's 'deeply disappointing' proposal "
    },
    {
        "content": "June 22 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "06222015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Anthem says it has already made a \"very compelling offer\" when asked if it would raise its offer for cigna   Further company coverage:    (Reporting By Caroline Humer)",
        "date": "06222015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Anthem says has made a \"very compelling offer\" "
    },
    {
        "content": "June 21 Health insurer Cigna Corp  rebuffed Anthem Inc's $47 billion merger proposal on Sunday  saying it was \"deeply disappointed\" with Anthem's recent actions and the offer was not in the best interest of shareholders.",
        "date": "06212015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-Cigna rebuffs Anthem's \"deeply disappointing\" proposal "
    },
    {
        "content": "June 21 Cigna Corp said on Sunday that Anthem Inc's \"highly conditional  non-binding proposal\" is inadequate and that it is not in the best interest of Cigna shareholders.",
        "date": "06212015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Cigna calls Anthem's offer \"inadequate\" "
    },
    {
        "content": "* Says Anthem proposal inadequate and not in best interests of Cigna shareholders",
        "date": "06212015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "BRIEF-Cigna says Anthem proposal inadequate and not in best interests of Cigna shareholders "
    },
    {
        "content": "NEW YORK  June 22 Anthem Inc CEO Joseph Swedish said on Monday that the company has looked closely at how antitrust authorities would view an acquisition of Cigna Corp  and does not see any \"substantive\" issues.",
        "date": "06222015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem CEO does not see substantive antitrust issues with Cigna deal "
    },
    {
        "content": "* Indexes up: Dow 0.69 pct  S&P 0.7 pct  Nasdaq 0.7 pct   (Updates to open)",
        "date": "06222015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "US STOCKS-Wall Street opens higher on Greek deal hopes "
    },
    {
        "content": "NEW YORK U.S. health insurer Anthem Inc  said on Saturday it had offered $47 billion in cash and stock for smaller rival Cigna Corp   signaling a pick-up in the industry's long-awaited consolidation.",
        "date": "06202015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem offers $47 billion for Cigna as insurers race for a deal "
    },
    {
        "content": "NEW YORK  June 22 U.S. health insurer Anthem Inc  on Monday said it is committed to buying Cigna Corp   saying it had found $2 billion in cost synergies within two years  after the smaller rival publicly rejected the deal.",
        "date": "06222015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem says committed to Cigna deal  sees $2 bln in synergies "
    },
    {
        "content": "NEW YORK  June 20 U.S. health insurer Anthem Inc  said on Saturday it had offered $47 billion in cash and stock for smaller rival Cigna Corp  signaling a pick-up in the industry's long-awaited consolidation.",
        "date": "06202015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 4-Anthem offers $47 bln for Cigna as insurers race for a deal "
    },
    {
        "content": "NEW YORK  June 20 U.S. health insurer Anthem Inc  said on Saturday it had offered $184 per share in cash and stock for smaller rival Cigna Corp but a deal was being held up in part over what role Cigna's CEO would have in a merged company.",
        "date": "06202015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem offers $184 per share for Cigna  CEO role holds up deal "
    },
    {
        "content": "Health insurer Cigna Corp  rebuffed a takeover offer from larger rival Anthem Inc   as the U.S. managed care sector gears up for a round of consolidation  the Wall Street Journal reported on Monday.",
        "date": "06152015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Cigna rebuffs takeover approach by Anthem: WSJ "
    },
    {
        "content": "* Cigna shares touch record high of $162.16   (Adds Breakingviews link)",
        "date": "06152015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 4-Cigna rebuffs takeover approach by Anthem - WSJ "
    },
    {
        "content": "* Cigna touches record high after Anthem takeover offer report",
        "date": "06152015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "US STOCKS-U.S. stocks lower amid Greek debt worries "
    },
    {
        "content": "June 15 Health insurer Cigna Corp has rebuffed a takeover offer from Anthem Inc  CNBC tweeted  citing Dow Jones.",
        "date": "06152015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "CORRECTED-Cigna rebuffs takeover approach by Anthem - CNBC  citing Dow Jones "
    },
    {
        "content": "SINGAPORE  June 5 Whoever was behind the latest theft of personal data from U.S. government computers  they appear to be following a new trend set by cybercriminals: targeting increasingly valuable medical records and personnel files.",
        "date": "06052015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Medical data  cybercriminals' holy grail  now espionage target "
    },
    {
        "content": "May 19 The financial chief of Anthem Inc   the second-largest U.S. health insurer  said on Tuesday that low interest rates and other conditions make it a good time for an acquisition  adding to speculation about merger activity in the sector.",
        "date": "05192015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem CFO says insurer could make 'meaningful' acquisition "
    },
    {
        "content": "Anthem Inc   the second-largest U.S. health insurer  reported a better-than-expected quarterly profit  helped by rise in memberships for government plans  particularly Medicaid.",
        "date": "04292015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Health insurer Anthem's profit beats as Medicaid enrollments rise "
    },
    {
        "content": "NEW YORK Anthem Inc  CEO Joseph Swedish said on Wednesday that the health insurer's new Obamacare exchange customers appear to be skewing \"slightly younger\" than in the past  which has positive implications for claims costs.",
        "date": "04292015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem CEO says Obamacare exchange members 'slightly younger' "
    },
    {
        "content": "NEW YORK  April 29 Anthem Inc CEO Joseph Swedish said on Wednesday that the health insurer's new Obamacare exchange customers appear to be skewing \"slightly younger\" than in the past  which has positive implications for claims costs.",
        "date": "04292015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem CEO says Obamacare exchange members \"slightly younger\" "
    },
    {
        "content": "April 29 Anthem Inc  the second-largest U.S. health insurer  reported a better-than-expected quarterly profit  helped by rise in memberships for government plans  particularly Medicaid.",
        "date": "04292015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-Health insurer Anthem's profit beats as Medicaid enrollments rise "
    },
    {
        "content": "April 29 Anthem Inc  the second-largest U.S. health insurer  reported a 23 percent rise in quarterly profit as more people signed up for its individual and government plans.",
        "date": "04292015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Health insurer Anthem's profit rises on higher enrollments "
    },
    {
        "content": "NEW YORK Health insurer Anthem Inc  which earlier this month reported that it was hit by a massive cyberbreach  said on Tuesday that 8.8 million to 18.8 million people who were members of other Blue Cross Blue Shield plans could be victims in the attack.",
        "date": "02252015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem says hack may affect more than 8.8 million other BCBS members "
    },
    {
        "content": "Health insurer Anthem Inc  which earlier this month reported that it was hit by a massive cyberbreach  said on Tuesday that 8.8 million to 18.8 million people who were not its customers could be victims in the attack.",
        "date": "02242015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem says at least 8.8 million non-customers could be victims in data hack "
    },
    {
        "content": "NEW YORK  Feb 24 Health insurer Anthem Inc   which earlier this month reported that it was hit by a massive cyberbreach  said on Tuesday that 8.8 million to 18.8 million people who were members of other Blue Cross Blue Shield plans could be victims in the attack.",
        "date": "02252015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Anthem says hack may affect more than 8.8 million other BCBS members "
    },
    {
        "content": "Feb 24 Health insurer Anthem Inc  which earlier this month reported that it was hit by a massive cyberbreach  said on Tuesday that 8.8 million to 18.8 million people who were not its customers could be victims in the attack.",
        "date": "02242015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-Anthem says at least 8.8 million non-customers could be victims in data hack "
    },
    {
        "content": "Anthem Inc said on Wednesday its millions of customers can sign up for free credit monitoring and identity-theft protection services this week following a massive cyber attack involving stolen U.S. Social Security numbers  birth dates and sensitive health information.",
        "date": "02122015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem offers free identity-theft protection after breach "
    },
    {
        "content": "BOSTON  Feb 10 Attorneys general from 10 U.S. states sent a letter to Anthem Inc complaining that the company has been too slow in notifying consumers that they were victims of a massive data breach disclosed last week.",
        "date": "02102015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "U.S. states say Anthem too slow to inform customers of breach "
    },
    {
        "content": "BOSTON New York's Financial Services Department said on Monday it planned to do regular cybersecurity reviews of insurers in the wake of the massive breach at health insurer Anthem Inc.",
        "date": "02092015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "New York plans cybersecurity reviews of insurers after breach "
    },
    {
        "content": "BOSTON  Feb 10 Ten U.S. states have sent a letter to Anthem Inc complaining that the company has been too slow in notifying consumers that they were victims of a massive data breach disclosed last week.",
        "date": "02102015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 1-U.S. states say Anthem too slow to inform customers of breach "
    },
    {
        "content": "Feb 11 Anthem Inc said on Wednesday its millions of customers can sign up for free credit monitoring and identity-theft protection services this week following a massive cyber attack involving stolen U.S. Social Security numbers  birth dates and sensitive health information.",
        "date": "02112015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem offers free identity-theft protection after breach "
    },
    {
        "content": "Health insurer Anthem Inc on Friday warned U.S. customers about an email scam targeting former and current members whose personal information was suspected to have been breached in a massive cyber attack.",
        "date": "02072015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem warns U.S. customers of email scam after data breach "
    },
    {
        "content": "Feb 6 Health insurer Anthem Inc on Friday warned U.S. customers about an email scam targeting former and current members whose personal information was suspected to have been breached in a massive cyber attack.",
        "date": "02072015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 3-Anthem warns U.S. customers of email scam after data breach "
    },
    {
        "content": "BOSTON Ten U.S. states have sent a letter to Anthem Inc complaining that the company has been too slow in notifying consumers that they were victims of a massive data breach disclosed last week.",
        "date": "02112015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "U.S. states say Anthem too slow to inform customers of breach "
    },
    {
        "content": "BOSTON  Feb 10 Ten U.S. states have sent a letter to Anthem Inc complaining that the company has been too slow in notifying consumers that they were victims of a massive data breach disclosed last week.",
        "date": "02112015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-U.S. states say Anthem too slow to inform customers of breach "
    },
    {
        "content": "NEW YORK  Feb 5 Several U.S. states are investigating a massive cyberattack on No. 2 U.S. health insurer Anthem Inc that a person familiar with the matter said is being examined for possible ties to China.",
        "date": "02052015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 3-U.S. states probe massive data breach at health insurer Anthem "
    },
    {
        "content": "Health insurer Anthem Inc   which has nearly 40 million U.S. customers  said late on Wednesday that hackers had breached one of its IT systems and stolen personal information relating to current and former consumers and employees. | Video ",
        "date": "02052015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Health insurer Anthem hit by massive cybersecurity breach "
    },
    {
        "content": "Health insurer Anthem Inc on Friday warned U.S. customers about an email scam targeting former and current members whose personal information was suspected to have been breached in a massive cyber attack.",
        "date": "02062015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Anthem warns U.S. customers of email scam after data breach "
    },
    {
        "content": "NEW YORK Several U.S. states are investigating a massive cyberattack on No. 2 U.S. health insurer Anthem Inc  that is being looked at for possible ties to China  according to a source familiar with the probe.",
        "date": "02052015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "States investigate massive breach at health insurer Anthem "
    },
    {
        "content": "Feb 6 Health insurer Anthem Inc on Friday warned U.S. customers about an email scam targeting former and current members whose personal information was suspected to have been breached in a massive cyber attack.",
        "date": "02062015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Anthem warns U.S. customers of email scam after data breach "
    },
    {
        "content": "NEW YORK  Feb 5 Connecticut and New York prosecutors reached out to No. 2 U.S. health insurer Anthem Inc  on Thursday  a day after the firm said it was a victim of a cyberattack that compromised data of tens of millions of people.",
        "date": "02052015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "U.S. states review Anthem breach; Connecticut seeks data on attack "
    },
    {
        "content": "Feb 6 Health insurer Anthem Inc warned consumers about an email scam targeting former and current members whose personal information was suspected to have breached.",
        "date": "02062015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem warns consumers of email scam "
    },
    {
        "content": "Feb 4 Hackers have stolen personal information relating to current and former customers and staff of no. 2 U.S. health insurer Anthem Inc.  after breaching an IT system containing data on up to 80 million people  the company said late on Wednesday.",
        "date": "02052015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 3-U.S. health insurer Anthem hit by massive cybersecurity breach "
    },
    {
        "content": "NEW YORK Several U.S. states are investigating a massive cyberattack on No. 2 U.S. health insurer Anthem Inc  that a person familiar with the matter said is being examined for possible ties to China.",
        "date": "02062015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "U.S. states probe massive data breach at health insurer Anthem "
    },
    {
        "content": "Health insurer Anthem Inc   which has nearly 40 million U.S. customers  said late on Wednesday that hackers had breached one of its IT systems and stolen personal information relating to current and former consumers and employees. | Video ",
        "date": "02062015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Health insurer Anthem hit by massive cybersecurity breach "
    },
    {
        "content": "Feb 4 Health insurer Anthem Inc said hackers broke into a database containing personal information for about 80 million of its customers and employees  the Wall Street Journal reported.",
        "date": "02052015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Health insurer Anthem hit by hackers - WSJ "
    },
    {
        "content": "NEW YORK  Feb 5 Several U.S. states are investigating a massive cyberattack on No. 2 U.S. health insurer Anthem Inc that a person familiar with the matter said is being examined for possible ties to China.",
        "date": "02062015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 4-U.S. states probe massive data breach at health insurer Anthem "
    },
    {
        "content": "Health insurer Anthem Inc  reported a better-than-expected quarterly profit  helped by an increase in premium revenue and memberships for its government plans  particularly in the Medicaid program.",
        "date": "01282015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "Health insurer Anthem's profit beats as enrollments rise "
    },
    {
        "content": "Jan 28 Health insurer Anthem Inc  reported a better-than-expected quarterly profit  helped by an increase in premium revenue and memberships for its government plans  particularly in the Medicaid program.",
        "date": "01282015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "UPDATE 2-Health insurer Anthem's profit beats as enrollments rise "
    },
    {
        "content": "Jan 28 Health insurer Anthem Inc  reported a better-than-expected quarterly profit  helped by an increase in premiums and memberships for its plans.",
        "date": "01282015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "CORRECTED-UPDATE 1-Health insurer Anthem's profit beats as enrollments rise "
    },
    {
        "content": "Jan 28 Health insurer Anthem Inc's  quarterly profit more than tripled due to a rise in enrollments.",
        "date": "01282015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Health insurer Anthem's profit rises on higher enrollments "
    },
    {
        "content": "Jan 8 Health insurer Anthem Inc on Thursday said it reached a deal under which Gilead Sciences Inc's hepatitis C drug Harvoni will be the primary treatment for patients infected with the most common strain of the liver-destroying virus.",
        "date": "01092015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "CORRECTED-UPDATE 1-Anthem selects Gilead as primary supplier of hepatitis C drugs "
    },
    {
        "content": "Jan 8 Health insurer Anthem Inc on Thursday said it reached a deal under which Gilead Sciences Inc's hepatitis C drug Harvoni will be the primary treatment for patients infected with the most common strain of the liver-destroying virus.",
        "date": "01082015",
        "name": "Anthem Inc",
        "news_type": "topStory",
        "symbol": "ANTX",
        "title": "UPDATE 1-Anthem selects Gilead as primary supplier of hepatitis C drugs "
    },
    {
        "content": "Jan 8 Health insurer Anthem Inc on Thursday said it reached a deal under which Gilead Sciences Inc's hepatitis C drug Harvoni will be the primary treatment for patients infected with the most common strain of the liver-destroying virus.",
        "date": "01082015",
        "name": "Anthem Inc",
        "news_type": "normal",
        "symbol": "ANTX",
        "title": "Anthem selects Gilead as primary supplier of hepatitis C drugs "
    }
]