[
    {
        "content": "* AON- HAS ACQUIRED HENDERSON INSURANCE BROKING GROUP  AN INDEPENDENT UK-BASED INSURANCE BROKING FIRM",
        "date": "10302017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "BRIEF-Aon buys British insurance broking firm Henderson Insurance "
    },
    {
        "content": "* Q3 earnings per share view $1.28 -- Thomson Reuters I/B/E/S",
        "date": "10272017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "BRIEF-Aon reports Q3 earnings per share $0.72 "
    },
    {
        "content": "* Aon Plc says on October 19  2017  Aon Plc and Aon Corporation entered into a $400 000 000 five-year credit agreement​ - SEC filing",
        "date": "10202017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "BRIEF-Aon plc and Aon Corp enter into $400 mln five-year credit agreement​ "
    },
    {
        "content": "* Willis Towers Watson and Aon reach agreement on chief financial officer dispute",
        "date": "10042017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "BRIEF-Willis Towers Watson and Aon reach agreement on CFO dispute "
    },
    {
        "content": "NEW YORK Insurance broker Aon Plc  said on Friday it would buy real estate investment management firm The Townsend Group from Colony NorthStar Inc  for $475 million  helping expand its property investment management portfolio.",
        "date": "09012017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "Aon to buy real estate investment firm Townsend from Colony NorthStar "
    },
    {
        "content": "NEW YORK  Sept 1 Insurance broker Aon Plc said on Friday it would buy real estate investment management firm The Townsend Group from Colony NorthStar Inc for $475 million  helping expand its property investment management portfolio.",
        "date": "09012017",
        "name": "Aon plc",
        "news_type": "normal",
        "symbol": "AON",
        "title": "UPDATE 1-Aon to buy real estate investment firm Townsend from Colony NorthStar "
    },
    {
        "content": "* Aon to acquire leading real estate investment advisor Townsend Group; extending leadership position in investments Source text for Eikon: Further company coverage:",
        "date": "09012017",
        "name": "Aon plc",
        "news_type": "normal",
        "symbol": "AON",
        "title": "BRIEF-Aon to acquire leading real estate investment advisor Townsend Group extending leadership position in investments "
    },
    {
        "content": "* Colony NorthStar announces agreement to sell the Townsend Group to Aon",
        "date": "09012017",
        "name": "Aon plc",
        "news_type": "normal",
        "symbol": "AON",
        "title": "BRIEF-Colony NorthStar announces agreement to sell the Townsend Group to Aon "
    },
    {
        "content": "NEW YORK  Sept 1 Insurance broker Aon Plc will buy real estate investment management firm The Townsend Group from Colony NorthStar Inc for $475 million to expand its property investment management portfolio  people familiar with the matter said on Friday.",
        "date": "09012017",
        "name": "Aon plc",
        "news_type": "normal",
        "symbol": "AON",
        "title": "Aon to buy real estate investment firm Townsend from Colony NorthStar -sources "
    },
    {
        "content": "* Q2 adjusted earnings per share $1.45 from continuing operations",
        "date": "08042017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "BRIEF-Aon reports Q2 adjusted earnings of $1.53/shr "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.36 per share Source text for Eikon: Further company coverage:",
        "date": "07142017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "BRIEF-Aon sets quarterly cash dividend of $0.36/shr "
    },
    {
        "content": "* Q1 earnings per share view $1.29 -- Thomson Reuters I/B/E/S",
        "date": "05092017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "BRIEF-Aon reports Q1 earnings per share $1.09 "
    },
    {
        "content": "* Aon acquires leading provider of talent measurement and psychometric assessment",
        "date": "05042017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "BRIEF-Aon acquires leading provider of talent measurement and psychometric assessment "
    },
    {
        "content": "* Probe is one of the first of its kind by FCA (Updates number of brokers  adds UIB statement  potential sanction)",
        "date": "04212017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "UPDATE 3-Britain investigates five insurance brokers over aviation business "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.36 per share Source text for Eikon: Further company coverage:",
        "date": "04142017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "BRIEF-Aon Plc announces 9 pct  increase to annual cash dividend "
    },
    {
        "content": "April 10 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "04102017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "MOVES- Aon  Citigroup  iCapital "
    },
    {
        "content": "April 10 UK-based Aon Plc's human resources and consulting services unit Aon Hewitt named Derry Pickford as principal  asset allocation in its global asset allocation team.",
        "date": "04102017",
        "name": "Aon plc",
        "news_type": "normal",
        "symbol": "AON",
        "title": "MOVES-Aon Hewitt appoints Pickford to global asset allocation team "
    },
    {
        "content": "Feb 21 London-based insurance broker Aon Plc  named Tony Pugh as head of defined contribution solutions for Europe  Middle East and Africa.",
        "date": "02212017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "MOVES-Aon names new EMEA head of defined contribution solutions "
    },
    {
        "content": "NEW YORK Private equity firm Blackstone Group LP  has agreed to acquire insurance broker Aon Plc's  employee benefits outsourcing business for around $4.8 billion  people familiar with the matter said on Thursday.",
        "date": "02092017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "Exclusive: Blackstone to acquire Aon's benefits outsourcing for $4.8 billion - sources "
    },
    {
        "content": "Insurance broker Aon Plc  said on Friday it agreed to sell its employee benefits outsourcing business to private equity firm Blackstone Group LP  for up to $4.8 billion.",
        "date": "02102017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "Aon to sell benefits outsourcing to Blackstone for up to $4.8 billion "
    },
    {
        "content": "Feb 10 Insurance broker Aon Plc said on Friday it agreed to sell its employee benefits outsourcing business to private equity firm Blackstone Group LP for up to $4.8 billion.",
        "date": "02102017",
        "name": "Aon plc",
        "news_type": "normal",
        "symbol": "AON",
        "title": "UPDATE 3-Aon to sell benefits outsourcing to Blackstone for up to $4.8 bln "
    },
    {
        "content": "* Blackstone will be required to pay to Aon a $215 million termination fee if purchase agreement is terminated under certain circumstances",
        "date": "02102017",
        "name": "Aon plc",
        "news_type": "normal",
        "symbol": "AON",
        "title": "BRIEF-Aon says Blackstone will pay a $215 mln termination fee if agreement is terminated "
    },
    {
        "content": "* Aon signs definitive agreement to sell benefits administration and hr business process outsourcing (BPO) platform",
        "date": "02102017",
        "name": "Aon plc",
        "news_type": "normal",
        "symbol": "AON",
        "title": "BRIEF-Aon signs definitive agreement to sell benefits administration  HR BPO platform "
    },
    {
        "content": "Feb 10 Insurance broker Aon PLC said on Friday it agreed to sell its benefits administration and HR BPO platform to Blackstone Group LP for $4.3 billion in cash.",
        "date": "02102017",
        "name": "Aon plc",
        "news_type": "normal",
        "symbol": "AON",
        "title": "Aon to sell benefits outsourcing to Blackstone for $4.3 bln "
    },
    {
        "content": "Aon Hewitt  a unit of Aon Plc  has appointed William Parry as a senior consultant to the retirement and investment practice in its fiduciary management unit.",
        "date": "01232017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "Aon Hewitt appoints William Parry as senior consultant "
    },
    {
        "content": "Jan 23 Aon Hewitt  a unit of Aon Plc  has appointed William Parry as a senior consultant to the retirement and investment practice in its fiduciary management unit.",
        "date": "01232017",
        "name": "Aon plc",
        "news_type": "normal",
        "symbol": "AON",
        "title": "MOVES-Aon Hewitt appoints William Parry as senior consultant "
    },
    {
        "content": "Insurance broker Aon Plc is in advanced talks to sell its employee benefits outsourcing unit to buyout firm Clayton Dubilier & Rice LLC for nearly $4.5 billion  people familiar with the matter said on Thursday.",
        "date": "01202017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "Aon nears $4.5 billion sale of benefits outsourcing unit -sources "
    },
    {
        "content": "Insurance broker Aon Plc  is in advanced talks to sell its employee benefits outsourcing unit to buyout firm Clayton Dubilier & Rice LLC for nearly $4.5 billion  people familiar with the matter said on Thursday.",
        "date": "01192017",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "Exclusive: Aon nears $4.5 billion sale of benefits outsourcing unit - sources "
    },
    {
        "content": "Insurance broker Aon Plc  is exploring a sale of a division that other companies use to outsource the administration of employee benefits  potentially valuing it at more than $5 billion  people familiar with the matter said.",
        "date": "12072016",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "Exclusive: Aon explores $5 billion benefits outsourcing unit sale - sources "
    },
    {
        "content": "* Aon announces agreement to acquire leading health and benefits brokerage and solutions firm in Brazil  Source text for Eikon:  Further company coverage:",
        "date": "11252016",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "BRIEF-Aon announces agreement to acquire leading health and benefits brokerage and solutions firm in Brazil "
    },
    {
        "content": "* Asx alert-CL8 signs agreement with AON to launch mobilise platform-CL8.AX",
        "date": "10182016",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "BRIEF-Collaborate Corporation says Co signs agreement with AON to launch mobilise platform "
    },
    {
        "content": "* Aon announces agreement to acquire risk management firm  creating a comprehensive cyber risk management advisory group",
        "date": "10112016",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "BRIEF-Aon to acquire risk management firm Stroz Friedberg Inc "
    },
    {
        "content": "* Q2 earnings per share view $1.39 -- Thomson Reuters I/B/E/S",
        "date": "07292016",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "BRIEF-Aon posts Q2 earnings of $1.01/share "
    },
    {
        "content": "June 13 UK-based Aon Plc's human resources and consulting services unit Aon Hewitt hired Alison Trusty as hedge fund researcher in its liquid alternatives manager research team  the company said.",
        "date": "06132016",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "MOVES-Alison Trusty joins Aon Hewitt as hedge fund researcher "
    },
    {
        "content": "May 23 Aon Hewitt  the human resources and consulting services unit of Aon Plc  appointed Matthew Fletcher senior consultant in its risk settlement group.",
        "date": "05232016",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "MOVES-Matthew Fletcher joins Aon Hewitt's risk settlement group "
    },
    {
        "content": "LONDON  May 12 British specialist insurer Pension Insurance Corp (PIC) has completed a 900 million pound ($1.30 billion) pension buy-in deal for insurance broker Aon  it said on Thursday.",
        "date": "05122016",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "Pension Insurance Corp completes $1.3 bln pension deal for Aon "
    },
    {
        "content": "* Ceo regory case's fy 2015 total compensation $29.7 million versus $14.0 million in fy 2014 - sec filing",
        "date": "04292016",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "BRIEF-AON Plc CEO's FY 2015 total compensation $29.7 mln vs $14 mln in FY 2014 "
    },
    {
        "content": "* Q1 earnings per share view $1.33 -- Thomson Reuters I/B/E/S",
        "date": "04292016",
        "name": "Aon plc",
        "news_type": "normal",
        "symbol": "AON",
        "title": "BRIEF-AON PLC reports adjusted EPS $1.35 "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.33per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04152016",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "BRIEF-Aon announces 10 pct increase to annual cash dividend "
    },
    {
        "content": "April 11 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "04112016",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "MOVES- BNY Mellon  Point72  JPMorgan  J. Safra Sarasin  Aon Hewitt "
    },
    {
        "content": "April 11 Aon Hewitt  the human resources and consulting services unit of Aon Plc  has appointed Michael Ferguson a senior public sector governance consultant.",
        "date": "04112016",
        "name": "Aon plc",
        "news_type": "normal",
        "symbol": "AON",
        "title": "MOVES-Michael Ferguson joins Aon Hewitt as governance consultant "
    },
    {
        "content": "TORONTO  March 31 The financial health of Canadian pension funds declined in the first quarter of 2016  affected by volatile currency markets  weakness in equity markets and lower bond yields  consultancy Aon said on Thursday.",
        "date": "03312016",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "Canadian pension plans' health declines in first quarter -survey "
    },
    {
        "content": "March 29 British insurance broker Aon Plc  said it appointed Chris Inman to its defined contribution pensions (DC) team.",
        "date": "03292016",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "MOVES-Aon appoints Chris Inman to defined contribution team "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 21 (Fitch) Fitch Ratings has affirmed all of Aon plc's (Aon)  ratings  including the Issuer Default Rating (IDR) and senior debt ratings at  'BBB+'  and the commercial paper ratings at 'F2'. The Rating Outlook is Stable.  A complete list of ratings follows at the end of this release. KEY RATING DRIVERS The ratings affirmation reflects Aon's continued favorable competitive position   solid balance sheet and cash flow gener",
        "date": "03212016",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "Fitch Affirms Aon's Ratings; Outlook Stable "
    },
    {
        "content": "Jan 25 Aon Plc's human resources and consulting services unit  Aon Hewitt  named David Bunkle as a partner in its retirement and investment business  based in Leeds.",
        "date": "01252016",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "MOVES-Aon Hewitt appoints David Bunkle as partner "
    },
    {
        "content": "LONDON  Jan 5 Aon Hewitt said on Tuesday it had advised the UK pension scheme of French telecoms company Alcatel-Lucent on a 300 million pound ($441.09 million) derisking deal with insurer Aviva.",
        "date": "01052016",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "Aon Hewitt advises on $440 mln Alcatel-Lucent bulk annuity deal "
    },
    {
        "content": "LONDON  Oct 12 Deals involving transferring the risk of British company defined benefit pension schemes to insurers are likely to total 10 billion pounds ($15.35 billion) this year  down on last year's record 13 billion pounds  consultants Aon Hewitt said on Monday.",
        "date": "10122015",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "UK company pension insurance deals seen totalling $15 bln in 2015-Aon Hewitt "
    },
    {
        "content": "Sept 2 Insurance broker Aon Plc's UK health and benefits business appointed James Monk and Gisele de Werra to its defined contribution (DC) team.",
        "date": "09022015",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "MOVES-Aon Employee Benefits boosts UK pension team "
    },
    {
        "content": "* After record 2014  Q1 saw company deals worth 800 mln pounds",
        "date": "08032015",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "UK life insurer revenue lifeline sees patchy start to year "
    },
    {
        "content": "July 24 The following financial services industry appointments were announced on Friday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "07242015",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "MOVES-Aon  SYZ Asset Management  Baring Asset Management "
    },
    {
        "content": "July 24 British insurance broker Aon Plc  appointed Qin Lu as chief executive of Aon Benfield Greater China and Aon risk solutions China.",
        "date": "07242015",
        "name": "Aon plc",
        "news_type": "normal",
        "symbol": "AON",
        "title": "MOVES-Insurance broker Aon hires Qin Lu from Swiss Re "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 13 (Fitch) Fitch Ratings expects to assign a 'BBB+' rating to the  proposed 30-year senior unsecured notes issuance by Aon plc (Aon). Additionally   Fitch has affirmed all of Aon's ratings  including the Issuer Default Rating  (IDR) and senior debt ratings at 'BBB+'  and the commercial paper rating at  'F2'. The Rating Outlook is Stable. A complete list of ratings follows at the  end of this release. KEY RATING DRIVERS  The",
        "date": "05132015",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "Fitch Expects to Rate Aon's New Sr. Debt 'BBB+'; Affirms All Ratings "
    },
    {
        "content": "MUMBAI  April 1 Private equity fund Everstone Capital said on Wednesday it had bought Payfront Technologies Pte Ltd  the Asia-Pacific payroll business of Aon Hewitt  for an undisclosed amount.",
        "date": "04012015",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "Everstone buys Aon Hewitt's Asia-Pacific payroll business "
    },
    {
        "content": "Jan 29 Aon Hewitt  the retirement and health solutions business of Aon Plc  appointed Jorge Huitron as a senior consultant to its manager research team.",
        "date": "01292015",
        "name": "Aon plc",
        "news_type": "topStory",
        "symbol": "AON",
        "title": "MOVES-Jorge Huitron joins Aon's retirement and health solutions unit "
    }
]