[
    {
        "content": "* Air Products extends term of Seifi Ghasemi as chairman  president and chief executive officer",
        "date": "11142017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products extends term of Seifi Ghasemi as CEO "
    },
    {
        "content": "NEW YORK  Nov 15 Activist investor William Ackman told his hedge fund clients on Wednesday that he liquidated positions in Air Products and Chemicals Inc and Nomad Foods Ltd  investments that earned them a lot of money.",
        "date": "11162017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "Ackman sells Air Products  Nomad Foods positions  makes strong profit "
    },
    {
        "content": "BEIJING A top Chinese coal miner  Yankuang Group  and U.S. industrial gas supplier Air Products and Chemicals Inc on Thursday said they planned to build a $3.5 billion coal-to-synthesis gas (syngas) plant in China.",
        "date": "11092017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "U.S. firm Air Products  China's Yankuang plan to build $3.5 billion coal-to-syngas plant in China "
    },
    {
        "content": "BEIJING  Nov 9 A top Chinese coal miner  Yankuang Group  and U.S. industrial gas supplier Air Products and Chemicals Inc on Thursday said they planned to build a $3.5 billion coal-to-synthesis gas (syngas) plant in China.",
        "date": "11092017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "UPDATE 1-US firm Air Products  China's Yankuang plan to build $3.5 bln coal-to-syngas plant in China "
    },
    {
        "content": "BEIJING  Nov 9 One of China's top coal miners Yankuang Group and U.S. industrial gas supplier Air Products and Chemicals Inc have agreed to build a $3.5 billion coal-to-synthesis gas (syngas) plant in Shaanxi province  the companies said on Thursday.",
        "date": "11092017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "Air Products  China's Yankuang to build coal-to-syngas plant in Shaanxi "
    },
    {
        "content": "* Signs investment cooperation agreement with yankuang group for $3.5 billion coal-to-syngas production facility in China​",
        "date": "11092017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "BRIEF-Air Products and Chemicals ‍signs agreement with Yankuang group for $3.5 bln coal-to-syngas production facility in China​ "
    },
    {
        "content": "* Air products and Nippon Steel & Sumikin Pipeline & Engineering sign exclusive long-term relationship agreement",
        "date": "10312017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products and Nippon Steel & Sumikin Pipeline & Engineering sign exclusive agreement "
    },
    {
        "content": "* Air Products reports very strong fiscal 2017 fourth quarter and full-year results",
        "date": "10262017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products reports Q4 GAAP EPS of $2.15 from continuing operations "
    },
    {
        "content": "BERLIN Industrial gases firms Air Products and Air Liquide may bid for parts of peers Linde  and Praxair  that the two groups may be forced to divest in the event of a merger  Frankfurter Allgemeine Zeitung reported on Friday.",
        "date": "10132017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "Industrial gases firms eye Linde-Praxair parts: Frankfurter Allgemeine "
    },
    {
        "content": "* Says extends its contract with Barrick Goldstrike to operate and maintain Oxygen Plant in Elko  Nevada Source text for Eikon: Further company coverage:",
        "date": "10102017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products extends contract with Barrick Goldstrike "
    },
    {
        "content": "BERLIN  Oct 13 Industrial gases firms Air Products and Air Liquide may bid for parts of peers Linde and Praxair that the two groups may be forced to divest in the event of a merger  Frankfurter Allgemeine Zeitung reported on Friday.",
        "date": "10132017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "Industrial gases firms eye Linde-Praxair parts -Frankfurter Allgemeine "
    },
    {
        "content": "* Pershing Square Capital Management dissolves sole share stake in Air Products and Chemicals Inc‍​ - SEC filing‍​",
        "date": "08142017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Pershing Square Capital Management dissolves sole share stake in Air Products and Chemicals "
    },
    {
        "content": "* Air Products reports fiscal 2017 third quarter GAAP EPS of $.47 and strong growth in adjusted EPS of $1.65  up 15 percent*",
        "date": "08012017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products reports Q3 sales $2.122 billion "
    },
    {
        "content": "* Air products wins contract for Coral South floating LNG project",
        "date": "07312017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products wins contract for Coral South floating LNG project "
    },
    {
        "content": "* Huntsman awards carbon monoxide and hydrogen supply contract to Air Products",
        "date": "07172017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Huntsman awards carbon monoxide  hydrogen supply contract to Air Products "
    },
    {
        "content": "* Air Products to supply SMIC's capacity expansion project in Tianjin  China",
        "date": "06272017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products to supply SMIC's capacity expansion project in Tianjin  China "
    },
    {
        "content": "* ‍linde North America-new production jv with Air Products to build a large-scale air separation unit and industrial gas liquefier in glenmont  NY​ ‍​",
        "date": "06152017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-‍linde North America announces new production joint venture  with Air Products‍​ "
    },
    {
        "content": "* Air Products announces joint venture with Linde North America for a new industrial gas plant in upstate New York",
        "date": "06152017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "BRIEF-Air Products announces joint venture with Linde North America "
    },
    {
        "content": "* Air Products invests in six industrial gas plants to support booming electronics manufacturing industry in china",
        "date": "06022017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products invests in 6 industrial gas plants to support electronics manufacturing industry in China "
    },
    {
        "content": "* Pershing Square Capital Management LP cuts sole share stake in Air Products & Chemicals Inc by 41.1 percent to 2.3 million shares",
        "date": "05152017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Pershing Square Capital Management cuts sole share stake in Air Products & Chemicals "
    },
    {
        "content": "* Pershing Square Capital Management LP - On May 15  sold 1.9 million shares of Air Products and Chemicals' common stock through block transaction- SEC Filing Source text: [http://bit.ly/2qOhzZM] Further company coverage:",
        "date": "05162017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products and Chemicals says Pershing Square Capital Management LP sold 1.9 mln shares of company's common stock through block transaction- SEC Filing "
    },
    {
        "content": "* Air products signs strategic cooperation agreement with sinopec and epec for e-commerce in china",
        "date": "05082017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products and Chemicals signs strategic cooperation agreement with Sinopec and EPEC "
    },
    {
        "content": "* Says this year's focus is clearly on integrating Air Products businesses and Huber deal when concluded",
        "date": "05052017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Evonik's focus this yr on integrating Air Products  Huber businesses "
    },
    {
        "content": "* Says only 1.89 pct in public hand  unable to meet requirement (Adds details on Yingde Gases boardroom battle  takeover approaches)",
        "date": "05052017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "UPDATE 1-Yingde Gases shares suspended as PAG takes over ahead of delisting "
    },
    {
        "content": "* Air Products reports strong fiscal 2017 second quarter results",
        "date": "04272017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products Q2 adjusted earnings per share $1.43 "
    },
    {
        "content": "* Starts up new plant in Chongqing City for China's leading LCD panel fab Source text for Eikon: Further company coverage:",
        "date": "04262017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products and Chemicals starts up new plant in Chongqing City for China's leading LCD panel fab "
    },
    {
        "content": "* announced that it has started up another new oxygen and nitrogen plant in Guangdong province Source text for Eikon: Further company coverage:",
        "date": "04052017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products and Chemicals has started up another new oxygen  nitrogen plant in Guangdong "
    },
    {
        "content": "HONG KONG Air Products and Chemicals Inc  said on Friday it would drop a proposed $1.5 billion bid for China's largest producer of industrial gases  leaving the door open for a competing offer from Hong Kong-based private equity firm PAG.",
        "date": "03242017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "Air Products drops $1.5 billion bid for China's Yingde Gases "
    },
    {
        "content": "HONG KONG  March 24 Air Products and Chemicals Inc said on Friday it would drop a proposed $1.5 billion bid for China's largest producer of industrial gases  leaving the door open for a competing offer from Hong Kong-based private equity firm PAG.",
        "date": "03242017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "Air Products drops $1.5 bln bid for China's Yingde Gases "
    },
    {
        "content": "* Follows purchase of Air Products unit   (Adds confirmation from target company  background)",
        "date": "03132017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "UPDATE 1-Evonik buys cosmetic ingredients maker Dr. Straetmans "
    },
    {
        "content": "* Air Products and Chemicals-determined \"not in best interests of cos' shareholders to continue\" pursuing acquisition of Yingde Gases Group at this time  Source text:(http://bit.ly/2n0W9Tz) Further company coverage:",
        "date": "03242017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "BRIEF-Air Products and Chemicals-Determined \"not in best interests of cos' shareholders to continue\" pursuing acquisition of Yingde Gases Group "
    },
    {
        "content": "HONG KONG  March 24 The messy battle to control China's largest producer of industrial gases has turned into a serendipitous victory for minority investors that could encourage more shareholder activism in Asia.",
        "date": "03242017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "Yingde Gases \"accidental win\" for minorities fans sparks of activism "
    },
    {
        "content": "HONG KONG Shares of Yingde Gases Group Co Ltd climbed 2.4 percent to a near two-year high on Thursday after shareholders voted for major board changes  ending a four-month battle for control of China's top industrial gases company.",
        "date": "03092017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "Yingde Gases jumps to near two-year high after shareholders vote for board change "
    },
    {
        "content": "* Co-founders Sun  Strutt to stay on Yingde board  Zhao voted out",
        "date": "03092017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "UPDATE 2-Yingde Gases shareholders vote for major board change "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - Air Products' bid for Yingde Gases deserves to fly. The U.S. giant has been stuck in a bizarre battle over the Hong Kong-listed company  which it wants to buy for up to $2.8 billion including debt. The target's board finally seems to be seeing sense. Bravo: the suitor is ready to pay a fair EBITDA multiple and a fat premium for shareholders.",
        "date": "02222017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "Air Products' Chinese bid deserves to fly "
    },
    {
        "content": "* Air Products reports strong fiscal 2017 first quarter results",
        "date": "01272017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products posts Q1 adj. earnings $1.47/shr from continuing operations "
    },
    {
        "content": "* Increases quarterly dividend by 10 percent to $0.95 per share  Source text for Eikon:  Further company coverage:",
        "date": "01272017",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "BRIEF-Air Products increases quarterly dividend by 10 percent to $0.95 per share "
    },
    {
        "content": "* Air products and Grupa Azoty Zak\u007fady Azotowe K\u007fdzierzyn S.A. sign new contract for the supply of industrial gases",
        "date": "11282016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products  Grupa Azoty Zak\u007fady Azotowe K\u007fdzierzyn S.A. sign new contract for supply of industrial gases "
    },
    {
        "content": "* Air products and chemicals inc says  it will build a new large air separation unit (lasu) in ulsan  south korea",
        "date": "10252016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products And Chemicals to build a new air separation unit in Ulsan  South Korea "
    },
    {
        "content": "* Air products wins Chemours contract for multiple gases supply",
        "date": "10182016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products wins multiple gases supply contract from Chemours "
    },
    {
        "content": "* Air Products approves separation of Versum Materials  Source text for Eikon:  Further company coverage:",
        "date": "09092016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products approves separation of Versum Materials "
    },
    {
        "content": "* Air Products And Chemicals Updates On Electronic Materials Division Spin-off",
        "date": "08262016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products and Chemicals updates on electronic materials division spin-off "
    },
    {
        "content": "Aug 16 Praxair Inc's contemplated merger with Linde AG would cut the number of global industrial gas suppliers to three from four  posing antitrust challenges and drawing scrutiny from regulators wary of more mega deals.",
        "date": "08162016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "Praxair and Linde's merger would face major antitrust hurdles "
    },
    {
        "content": "* Q4 earnings per share view $1.97 -- Thomson Reuters I/B/E/S",
        "date": "07282016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products Q3 adjusted EPS $1.92 from cont ops "
    },
    {
        "content": "* Will build a new plant and associated infrastructure in Pukou Economic Development Zone (PKEDZ)  Nanjing  Eastern China",
        "date": "07192016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products to build new plant in Pukou Economic Development Zone in Nanjing "
    },
    {
        "content": "* Co and Nippon Steel & Sumikin Pipeline & Engineering Co have constructed and placed onstream their first retail hydrogen fueling station in Tokyo  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05182016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products and NSPE team up to commercialize their first hydrogen fueling station in Japan "
    },
    {
        "content": "FRANKFURT Germany's Evonik Industries AG will buy the specialty and coating additives operations of U.S. industrial gas producer Air Products and Chemicals Inc for $3.8 billion.",
        "date": "05062016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "Evonik to buy specialty chemical ops from Air Products for $3.8 billion "
    },
    {
        "content": "FRANKFURT Evonik's  chief executive said the German group would not put its low-margin Specialty Materials unit up for sale for now  even after Evonik acquired some specialty additives business from Air Products for $3.8 billion.",
        "date": "05062016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "Evonik says sale of specialty materials unit not on the agenda "
    },
    {
        "content": "FRANKFURT Germany's Evonik Industries AG  will buy the specialty and coating additives operations of U.S. industrial gas producer Air Products and Chemicals Inc for $3.8 billion.",
        "date": "05062016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "Evonik to buy specialty chemical ops from Air Products for $3.8 bln "
    },
    {
        "content": "* Evonik is required to pay air products a termination fee of $190 million if purchase agreement is terminated  Source text (http://1.usa.gov/1XchZS7) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05062016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "BRIEF-Evonik required to pay Air Products termination fee of $190 mln if purchase agreement is terminated "
    },
    {
        "content": "* Air products to sell performance materials division of its materials technologies segment to evonik for $3.8 billion",
        "date": "05062016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "BRIEF-Air Products to sell performance materials division to Evonik for $3.8 billion "
    },
    {
        "content": "FRANKFURT  May 6 Germany's Evonik Industries AG  is close to striking a deal to buy the performance materials operations of industrial gas producer Air Products and Chemicals Inc  a person familiar with the matter said on Friday.",
        "date": "05062016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "Evonik nears purchase of Air Products' materials ops -source "
    },
    {
        "content": "* Sees Q3 2016 adjusted earnings per share $1.87 to $1.92 from continuing operations",
        "date": "04282016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products Q2 earnings per share $1.74 from continuing operations "
    },
    {
        "content": "* As a result  efw business segment will be accounted for as a discontinued operation effective in second fiscal quarter",
        "date": "04042016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air products and chemicals will exit energy-from-waste business "
    },
    {
        "content": "April 4 Air Products and Chemicals Inc  said on Monday it would exit its energy-from-waste business and book a related impairment charge of $900 million-$1 billion.",
        "date": "04042016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "Air Products to exit energy-from-waste business "
    },
    {
        "content": "March 16 Industrial gas producer Air Products and Chemicals Inc is in advanced talks to sell its performance materials operations to Germany's Evonik Industries AG  a source familiar with the matter told Reuters.",
        "date": "03162016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "Air Products in talks to sell performance materials unit to Evonik -source "
    },
    {
        "content": "Industrial gas producer Air Products and Chemicals Inc  is in advanced talks to sell its performance materials operations to Germany's Evonik Industries AG   a source familiar with the matter told Reuters.",
        "date": "03172016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "Air Products in talks to sell unit to Evonik: source "
    },
    {
        "content": "* Evonik interested in the unit - source   (Adds Wirtschaftswoche report on interest in Akzo Nobel division)",
        "date": "03172016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "UPDATE 2-Air Products in talks to sell unit to Evonik - source "
    },
    {
        "content": "DUESSELDORF  Germany  March 17 Germany's Evonik Industries AG is interested in industrial gas producer Air Products and Chemicals Inc's performance materials operations  but no decision has been made about whether to pursue a deal  a person familiar with the matter said on Thursday.",
        "date": "03172016",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "Evonik interested in Air Products division - source "
    },
    {
        "content": "Industrial gas producer Air Products and Chemicals Inc said it planned to spin off its materials technologies business into a publicly traded company before September 2016.",
        "date": "09162015",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "Air Products to spin off materials technologies business "
    },
    {
        "content": "Sept 16 Industrial gas producer Air Products and Chemicals Inc said it planned to spin off its materials technologies business into a publicly traded company before September 2016.",
        "date": "09162015",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "UPDATE 1-Air Products to spin off materials technologies business "
    },
    {
        "content": "Sept 16 Air Products and Chemicals Inc  said on Wednesday it planned to spin-off its materials technologies business into a publicly traded company before September next year.",
        "date": "09162015",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "Air Products to spin-off materials technologies business "
    },
    {
        "content": "* Says \"can confirm that an incident occurred at our facility L'Isle-d'Abeau  france  this morning\"",
        "date": "06262015",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "BRIEF-Air Products says can confirm incident occurred at facility in L'Isle-d'Abeau  France "
    },
    {
        "content": "KHOBAR  Saudi Arabia A joint venture between Saudi Arabia's Acwa Holding and U.S.-based Air Products has been awarded a contract to build  own and operate the world's largest industrial gas complex by Saudi Aramco  a statement said on Thursday.",
        "date": "04232015",
        "name": "Air Products and Chemicals Inc",
        "news_type": "topStory",
        "symbol": "APD",
        "title": "Air Products JV gets $2 billion contract for world's biggest industrial gas plant "
    },
    {
        "content": "KHOBAR  Saudi Arabia  April 23 A joint venture between Saudi Arabia's Acwa Holding and U.S.-based Air Products  has been awarded a contract to build  own and operate the world's largest industrial gas complex by Saudi Aramco  a statement said on Thursday.",
        "date": "04232015",
        "name": "Air Products and Chemicals Inc",
        "news_type": "normal",
        "symbol": "APD",
        "title": "Air Products JV gets $2 bln contract for world's biggest industrial gas plant "
    }
]