[
    {
        "content": "* Apollo Global Management  LLC reports third quarter 2017 results",
        "date": "11012017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Apollo Global Management LLC qtrly total revenues $664.2 mln "
    },
    {
        "content": "* ‍BRIMSTONE AND STADIO HOLDINGS HAVE ENTERED INTO AN AGREEMENT WITH COÖPERATIVE APOLLO GLOBAL NETHERLANDS U.A.​",
        "date": "10132017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Brimstone Investment and Stadio says agreement to ‍acquire MBS Education​ "
    },
    {
        "content": "AMSTERDAM  Oct 12 Alteri Investors has agreed to buy Dutch toy store chain Intertoys from Blokker Holding for an undisclosed sum  the Dutch company said on Thursday.",
        "date": "10122017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Dutch retail chain Intertoys sold to Alteri Investors "
    },
    {
        "content": "FRANKFURT  Oct 12 HSH Nordbank expects to receive offers for the German shipping finance provider as a whole and not just for parts of the business  Chief Executive Stefan Ermisch told German weekly WirtschaftsWoche ahead of an end-October deadline for bids.",
        "date": "10122017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "HSH CEO says \"very close\" to solution for bank - WirtschaftsWoche "
    },
    {
        "content": "* Olympus Merger Sub Inc announces termination of change of control offer to purchase 5.375 pct senior notes due 2022 Source text for Eikon: Further company coverage:",
        "date": "10052017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Olympus Merger Sub Inc posts termination of change of control offer to purchase 5.375 pct senior notes "
    },
    {
        "content": "* Olympus Merger Sub  Inc. Extends expiration date to october 6  2017 for tender offer and consent solicitation relating to 5.375 pct senior notes due 2022 of west corporation",
        "date": "10042017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Olympus Merger Sub extends expiration date to Oct 6 for tender offer and consent solicitation relating senior notes of West "
    },
    {
        "content": "* ClubCorp stockholders approve acquisition by an affiliate of certain funds managed by affiliates of Apollo Global Management  LLC Source text for Eikon: Further company coverage:",
        "date": "09152017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-ClubCorp stockholders approve acquisition of certain funds managed by affiliates of Apollo Global Management "
    },
    {
        "content": "LJUBLJANA U.S. investment fund Apollo Global Management  was one of two bidders for a 55 percent stake in Slovenia's Gorenjska Banka  and is now considering making a higher offer  a newspaper reported on Tuesday.",
        "date": "09192017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo considers higher bid for Slovenian bank: report "
    },
    {
        "content": "LJUBLJANA  Sept 19 Joint net profit of Slovenian banks rose to 287.6 million euros  ($344.5 million) in the first seven months of the year from 272.6 million in the same period of 2016  mainly due to lower provisions for bad loans  the Bank of Slovenia said in a report on Tuesday.",
        "date": "09192017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 1-Slovenian banks' Jan-July profit rises  bad loans fall "
    },
    {
        "content": "LJUBLJANA  Sept 19 U.S. investment fund Apollo Global Management was one of two bidders for a 55 percent stake in Slovenia's Gorenjska Banka and is now considering making a higher offer  a newspaper reported on Tuesday.",
        "date": "09192017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo considers higher bid for Slovenian bank -report "
    },
    {
        "content": "* ClubCorp Holdings - co  board  Apollo Global management  parent  merger sub been named defendants in class action lawsuits challenging proposed deal",
        "date": "09072017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-ClubCorp and Apollo Global named defendants in lawsuits challenging proposed deal "
    },
    {
        "content": "Aug 15 American International Group Inc wants to sell a $2 billion portfolio of life insurance policies that would pay out when sick or elderly customers die  two people familiar with the matter said.",
        "date": "08152017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "AIG shops $2 billion death benefits portfolio -sources "
    },
    {
        "content": "* Tiger Global Management LLC ups share stake in Apollo Global Management LLC by 40.9 percent to 32.9 million Class A shares ​",
        "date": "08142017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Tiger Global Management ups share stake in Apollo Global Management LLC by 40.9% to 32.9 mln Class A shares ​ "
    },
    {
        "content": "Buyout firm Carlyle Group LP on Wednesday posted quarterly earnings that topped expectations while rival Apollo Global Management LLC's profits matched estimates as risk-taking investors facing a low-interest rate environment poured more money into their funds.",
        "date": "08022017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Carlyle beats view in second quarter  Apollo matches; both draw more cash "
    },
    {
        "content": "Aug 2 Buyout firm Carlyle Group LP on Wednesday posted quarterly earnings that topped expectations while rival Apollo Global Management LLC's profits matched estimates as risk-taking investors facing a low-interest rate environment poured more money into their funds.",
        "date": "08022017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 1-Carlyle beats view in 2nd qtr  Apollo matches; both draw more cash "
    },
    {
        "content": "LONDON Apollo Global Management LLC  has raised the largest ever private equity fund  a regulatory filing showed  amassing $24.6 billion to be invested in North America and Western Europe  as global fundraising looked set to exceed 2007's record.",
        "date": "07282017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo raises $24.6 billion for largest private equity fund ever "
    },
    {
        "content": "Private equity firm Apollo Global Management LLC  is preparing to take U.S. security company ADT Corp public at a $15 billion plus valuation  just over a year after buying it  sources familiar with the situation said on Thursday.",
        "date": "07202017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo prepares 2018 IPO for ADT Corp: sources "
    },
    {
        "content": "July 20 Private equity firm Apollo Global Management LLC is preparing to take U.S. security company ADT Corp public at a $15 billion plus valuation  just over a year after buying it  sources familiar with the situation said on Thursday.",
        "date": "07202017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo prepares 2018 IPO for ADT Corp -sources "
    },
    {
        "content": "* Apollo Global preparing IPO for ADT; could file paperwork for IPO by the fall and list shares around 2017 year-end - WSJ Source text - (http://on.wsj.com/2ud3Zhj) Further company coverage:",
        "date": "07202017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "BRIEF-Apollo Global is preparing IPO for ADT - WSJ "
    },
    {
        "content": "* Clubcorp enters into a definitive agreement to be acquired by certain investment funds affiliated with apollo global management in an all-cash transaction valued at $1.1 billion",
        "date": "07092017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Clubcorp to be acquired by Apollo Global affiliated investment funds for transaction valued at $1.1 bln "
    },
    {
        "content": " (This version of the July 9 story corrects KSL deal value to show it included debt  adds Apollo deal value including debt as comparison  in paragraph 9)",
        "date": "07112017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Buyout firm Apollo to buy golf course operator ClubCorp for $1.1 billion "
    },
    {
        "content": "July 9 Private equity firm Apollo Global Management LLC said on Sunday it had agreed to acquire ClubCorp Holdings Inc  one of the largest owners and operators of private golf and country clubs in the United States  for $1.1 billion.",
        "date": "07112017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "CORRECTED-Buyout firm Apollo to buy golf course operator ClubCorp for $1.1 bln "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Private equity's cup runneth over. Apollo Global Management just accumulated the largest single pool of capital earmarked for buyouts  at $23.5 billion. The haul adds to a growing stockpile of dry powder that could make outsized returns harder to come by. With yields so low across most markets  however  it should be easier to make fund investors happy.",
        "date": "06282017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo mega-fund includes giant margin for error "
    },
    {
        "content": "June 19 A group of investors led by U.S. private equity firm Apollo Global Management LLC and Ontario Teachers' Pension Plan Board will buy a majority stake in job portal CareerBuilder  the companies said on Monday.",
        "date": "06192017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "UPDATE 1-Apollo Global-led investor group to buy CareerBuilder "
    },
    {
        "content": "A group of investors led by U.S. private equity firm Apollo Global Management LLC  and Ontario Teachers' Pension Plan Board will buy a majority stake in job portal CareerBuilder  the companies said on Monday.",
        "date": "06192017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo Global-led investor group to buy CareerBuilder "
    },
    {
        "content": "* Apollo global management-affiliated funds and ontario teachers’ agree to acquire a controlling interest in careerbuilder",
        "date": "06192017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "BRIEF-Apollo Global Management-affiliated funds and Ontario Teachers’ agree to buy controlling interest in CareerBuilder "
    },
    {
        "content": "* Tegna announces definitive agreement to sell CareerBuilder to Apollo Global Management affiliated-funds and Ontario Teachers'",
        "date": "06192017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "BRIEF-Tegna announces definitive agreement to sell CareerBuilder to Apollo Global Management affiliated-funds and Ontario Teachers' "
    },
    {
        "content": "May 23 Private equity firm Apollo Global Management is in advanced talks to acquire U.S. job-hunting website CareerBuilder LLC after negotiations with another buyout firm ended unsuccessfully  according to people familiar with the matter.",
        "date": "05232017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo Global in advanced talks to buy jobs website CareerBuilder -sources "
    },
    {
        "content": "Private equity firm Apollo Global Management LLC  is in advanced talks to acquire U.S. job-hunting website CareerBuilder LLC after negotiations with another buyout firm ended unsuccessfully  according to people familiar with the matter.",
        "date": "05242017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo Global in advanced talks to buy jobs website CareerBuilder: sources "
    },
    {
        "content": "May 23 Private equity firm Apollo Global Management LLC is in advanced talks to acquire U.S. job-hunting website CareerBuilder LLC after negotiations with another buyout firm ended unsuccessfully  according to people familiar with the matter.",
        "date": "05242017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 1-Apollo Global in advanced talks to buy jobs website CareerBuilder -sources "
    },
    {
        "content": "Private equity firm Apollo Global Management is in advanced talks to acquire U.S. job-hunting website CareerBuilder LLC after negotiations with another buyout firm ended unsuccessfully  according to people familiar with the matter.",
        "date": "05242017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo Global in advanced talks to buy jobs website CareerBuilder -sources "
    },
    {
        "content": "* Tiger Global Management Llc reports open market purchase of 681 672 shares of co's common stock between May 17 and May 18",
        "date": "05192017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Tiger Global Management reports open market purchase of Apollo Global Management's stock "
    },
    {
        "content": "* Tiger Global Management takes share stake of 23.3 million Class A shares in Apollo Global Management - SEC filing",
        "date": "05152017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Tiger Global Management takes share stake in Apollo Global Management  raises share stake in Domino's Pizza "
    },
    {
        "content": "TORONTO  May 11 Home Capital Group  Canada's biggest non-bank lender  is in talks to divest about C$2 billion in assets to help pay down a high-interest loan and delay a potential sale of the entire company  according to people familiar with the situation.",
        "date": "05112017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "EXCLUSIVE-Home Capital plans C$2 bln in asset sales to ease loan burden -sources "
    },
    {
        "content": "U.S. telephone conferencing services provider West Corp  said it had entered into an agreement to be acquired by buyout firm Apollo Global Management LLC  for about $2 billion in cash.",
        "date": "05102017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo Global to buy West Corp for about $2 billion "
    },
    {
        "content": "* West Corporation enters into definitive agreement to be acquired by  certain funds affiliated with apollo global management for $23.50 per share in cash",
        "date": "05092017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-West Corporation to be acquired by certain funds affiliated with Apollo Global Management for $23.50 per share in cash "
    },
    {
        "content": "TORONTO/NEW YORK Buyout firms Apollo Global Management LLC   Blackstone Group LP  and Centerbridge Partners LP are among potential suitors studying bids for Canada's biggest alternative mortgage lender  Home Capital Group Inc   people familiar with the matter told Reuters.",
        "date": "05022017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo  Blackstone among potential bidders for Home Capital - sources "
    },
    {
        "content": "Buyout firm Apollo Global Management LLC  is seeking to convince U.S. telephone conferencing services provider West Corp  to lower its price expectations and accept a $2 billion acquisition offer  according to people familiar with the matter.",
        "date": "05012017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo Global seeks to lower West Corp price tag - sources "
    },
    {
        "content": "NEW YORK Asset manager Apollo Global Management LLC  reported better-than-expected first-quarter earnings on Friday as a rising stock market supported strong gains in private equity investments.",
        "date": "04282017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Stock rally helps buyout firm Apollo Q1 earnings beat forecasts "
    },
    {
        "content": "TORONTO/NEW YORK  May 2 Buyout firms Apollo Global Management LLC  Blackstone Group LP and Centerbridge Partners LP are among potential suitors studying bids for Canada's biggest alternative mortgage lender  Home Capital Group Inc  people familiar with the matter told Reuters.",
        "date": "05022017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 2-Apollo  Blackstone among potential bidders for Home Capital -sources "
    },
    {
        "content": "* Apollo Global Management LLC - qtrly  total revenues $643.6 million versus $120.8 million - SEC filing",
        "date": "04282017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "BRIEF-Apollo Global Management posts qtrly income $0.75/Class A share "
    },
    {
        "content": "TORONTO/NEW YORK  May 2 Buyout firms Apollo Global Management LLC  Blackstone Group LP and Centerbridge Partners LP are among potential suitors studying bids for Canada's biggest alternative mortgage lender  Home Capital Group Inc  which sought emergency funding last week  people familiar with the matter told Reuters.",
        "date": "05022017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo  Centerbridge among potential bidders for Canada's Home Capital -sources "
    },
    {
        "content": "NEW YORK  April 28 When Kentucky's public pension put U.S. buyout firm KKR & Co LP in charge of its hedge fund investments in May 2015  its board expected the deal to save money and boost its returns.",
        "date": "04282017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Kentucky's pension deal offers lessons on risks  cost cuts "
    },
    {
        "content": "Private equity firm Apollo Global Management LLC is in advanced negotiations to acquire U.S. telephone conferencing services provider West Corp  people familiar with the matter said on Thursday.",
        "date": "04282017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Exclusive: Apollo Global in advanced talks to buy West Corp - sources "
    },
    {
        "content": "* Tiger Global Management Llc  reports 12.5 percent passive stake in Apollo Global Management Llc as of March 27 - sec filing",
        "date": "04042017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Tiger Global Management reports 12.5 pct passive stake in Apollo Global Management "
    },
    {
        "content": "Chinese conglomerate HNA Group and Apollo Global Management  are looking to bid for German shipping finance provider HSH Nordbank [HSH.UL]  according to two people familiar with the matter.",
        "date": "04032017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "HNA  Apollo Global among bidders vying for HSH Nordbank: sources "
    },
    {
        "content": "NEW YORK  March 30 Westinghouse Electric Co's financial distress sparked a feeding frenzy among Wall Street lenders keen to give the nuclear developer a lifeline while it reorganizes in bankruptcy  according to court papers and people familiar with the matter.",
        "date": "03302017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "RPT-Toshiba's nuclear woes a hot ticket for bankruptcy financiers "
    },
    {
        "content": "Chisholm Oil & Gas LLC and funds managed by investment firm Apollo Global Management said they would buy oil and gas assets in Oklahoma.",
        "date": "03292017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Chisholm  Apollo Global to buy oil and gas assets in Oklahoma "
    },
    {
        "content": "FRANKFURT  April 3    The DAX top-30 index looked set to open 0.2 percent higher on Monday  according to premarket data from brokerage Lang & Schwarz at 0605 GMT.",
        "date": "04032017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "German stocks - Factors to watch on April 3 "
    },
    {
        "content": "NEW YORK  March 29 Westinghouse Electric Co's financial distress sparked a feeding frenzy among Wall Street lenders keen to give the nuclear developer a lifeline while it reorganizes in bankruptcy  according to court papers and people familiar with the matter.",
        "date": "03302017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Toshiba's nuclear woes a hot ticket for bankruptcy financiers "
    },
    {
        "content": "* Chisholm Oil & Gas and funds affiliated with Apollo Global Management announce strategic partnership and acquisition of stack assets",
        "date": "03292017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "BRIEF-Chisholm Oil ties up with Apollo to buy oil and gas assets "
    },
    {
        "content": "April 3 Chinese conglomerate HNA Group and Apollo Global Management are looking to bid for German shipping finance provider HSH Nordbank  according to two people familiar with the matter.",
        "date": "04032017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "HNA  Apollo Global among bidders vying for HSH Nordbank- sources "
    },
    {
        "content": "* Tiger Global Management LLC reports 7.0 percent passive stake in Apollo Global Management LLC as of March 8 - SEC filing  Source text: (http://bit.ly/2mRZCVw) Further company coverage:",
        "date": "03172017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Tiger Global Management reports 7.0 pct passive stake in Apollo Global Management LLC as of March 8 - SEC filing "
    },
    {
        "content": "* Apollo Global Management - BofA Merrill lynch  Morgan Stanley  UBS Investment Bank and Wells Fargo Securities are acting as joint book-running managers for offering  Source text for Eikon:  Further company coverage:",
        "date": "02282017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Apollo to offer preferred shares "
    },
    {
        "content": "Feb 21 SourceHOV LLC  Novitex Holdings Inc and Quinpario Acquisition Corp 2 agreed to combine in a deal valued at about $2.8 billion  to scale up their businesses in the financial technology and business services industry.",
        "date": "02222017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo affiliate Novitex  SourceHov to merge with Quinpario "
    },
    {
        "content": "Feb 14 The buyout firm that owns Chuck E. Cheese has hired investment banks to help it prepare for either a sale or initial public offering (IPO)  people familiar with the matter said on Tuesday.",
        "date": "02142017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Chuck E. Cheese hires banks to run sale process  IPO -sources "
    },
    {
        "content": "* U.S. blocked takeover of Germany's Aixtron last year   (Adds background on previous blocked deals by CFIUS  details on chemical compounds)",
        "date": "02092017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 2-Infineon  Cree warn U.S. might block Wolfspeed deal "
    },
    {
        "content": "NEW YORK Asset manager Apollo Global Management LLC  said on Friday it is monitoring details of the expected U.S. tax reform after its fourth-quarter earnings beat forecasts  as sturdy financial markets buoyed its buyout investments.",
        "date": "02032017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Buyout firm Apollo fourth-quarter earnings beat forecasts "
    },
    {
        "content": "* Apollo Global Management Llc reports fourth quarter and full year 2016 results",
        "date": "02032017",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "BRIEF-Apollo Global Management Llc reports qtrly earnings per share $0.87 "
    },
    {
        "content": "* Apollo Education Group - on Jan 17  employment of Curtis M. Uehlein  president of Apollo Global was terminated  effective as of february 3  2017  Source text for Eikon:  Further company coverage:",
        "date": "01232017",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Apollo Education Group says terminated employment of president of Apollo Global "
    },
    {
        "content": "Shares of Athene Holding Ltd  jumped as much as 9.2 percent in their debut on Friday  valuing the fixed annuity service provider at about $8.25 billion in the year's largest financial IPO.",
        "date": "12092016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo-backed annuity service provider Athene jumps in IPO debut "
    },
    {
        "content": "* Apollo Global's Athene plans to list shares in December; expected to raise over $1 billion at over $7 billion valuation - WSJ  citing sources  Source text : http://on.wsj.com/2ggAoLY",
        "date": "11232016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Apollo Global's Athene plans December IPO- WSJ "
    },
    {
        "content": "ZURICH A long-awaited deal for miner Anglo American  to sell its Australian coal assets to a consortium headed by private equity group Apollo Global Management  is off  two sources with knowledge of the matter said on Tuesday.",
        "date": "11082016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo-led buy of Anglo American's Australian coal is off: sources "
    },
    {
        "content": "ZURICH  Nov 8 A long-awaited deal for miner Anglo American to sell its Australian coal assets to a consortium headed by private equity group Apollo Global Management is off  two sources with knowledge of the matter said on Tuesday.",
        "date": "11082016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo-led buy of Anglo American's Australian coal is off-sources "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 02 (Fitch) Fitch Ratings has affirmed the Long-Term Issuer  Default Ratings (IDRs) of the various subsidiaries of Apollo Global Management  LLC (collectively  Apollo) at 'A-'. The Rating Outlook is Stable. See the full  list of ratings at the end of this release. Today's rating actions have been taken as part of a periodic peer review of the  Alternative Investment Manager (IM) industry  which comprises seven publicly",
        "date": "11022016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Fitch Affirms Apollo Global Management & Subsidiaries at 'A-'; Outlook Stable "
    },
    {
        "content": "* Apollo Global Management LLC qtrly gaap earnings per share $0.50  Source text [http://bit.ly/2eDfpp0] Further company coverage:",
        "date": "10282016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Apollo Global Management reprots qtrly gaap EPS of $0.50 "
    },
    {
        "content": "NEW YORK Asset manager Apollo Global Management LLC  reported stronger-than-expected third-quarter earnings on Friday as sturdy financial markets buoyed its credit and buyout investments.",
        "date": "10282016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo's third-quarter profit beats estimates  buoyed by market "
    },
    {
        "content": "NEW YORK  Oct 28 Asset manager Apollo Global Management LLC reported stronger-than-expected third-quarter earnings on Friday as sturdy financial markets buoyed its credit and buyout investments.",
        "date": "10282016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 1-Apollo's 3rd-quarter profit beats estimates  buoyed by market "
    },
    {
        "content": "* Apollo Global Management LLC reports third quarter 2016 results",
        "date": "10282016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "BRIEF-Apollo Global Management reports Q3 2016 results "
    },
    {
        "content": "LONDON  Oct 10 (IFR) - Verallia has called off an attempt to issue a \u007f500m payment-in-kind toggle bond  according to an investor  after facing pushback from the buyside.",
        "date": "10102016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Verallia shelves plans to issue \u007f500m PIK toggle - source "
    },
    {
        "content": "SYDNEY/LONDON Anglo American is expected to finalize a $1 billion-plus sale of its Australian coal assets to a group headed by private equity group Apollo Global Management in the coming weeks  three sources with knowledge of the deal said.    \"Anglo American and Apollo entered into a two-week exclusivity period due to expire next week \" said one of the sources in continuous contact with advisers to the deal. \"We think it is going to go to Apollo next week.\"",
        "date": "10132016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Anglo close to selling Australian coal assets to Apollo consortium: sources "
    },
    {
        "content": "SYDNEY/LONDON Oct 13 Anglo American is expected to finalise a $1 billion-plus sale of its Australian coal assets to a group headed by private equity group Apollo Global Management in the coming weeks  three sources with knowledge of the deal said.",
        "date": "10132016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "RPT-UPDATE 1-Anglo close to selling Australian coal assets to Apollo consortium - sources "
    },
    {
        "content": "SYDNEY/LONDON Oct 13 Anglo American is expected to finalise a $1 billion-plus sale of its Australian coal assets to a group headed by private equity group Apollo Global Management in the coming weeks  three sources with knowledge of the deal said.",
        "date": "10132016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 1-Anglo close to selling Australian coal assets to Apollo consortium - sources "
    },
    {
        "content": "* Funds affiliated with Apollo Global Management and Post Oak Energy Capital announce merger of Double Eagle and Veritas Energy  forming premier midland basin E&P operator",
        "date": "10032016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Double Eagle and Veritas Energy forming midland basin E&P operator "
    },
    {
        "content": "Sept 27 Caesars Entertainment Corp said on Tuesday its major creditors supported the proposed terms of a plan to push its main operating unit out of bankruptcy  making it \"optimistic\" of winning approval from other creditors.",
        "date": "09272016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Caesars inches closer to deal with bankrupt unit's creditors "
    },
    {
        "content": "* Affiliates of certain funds managed by affiliates of Apollo Global Management announce successful tender offer for Outerwall",
        "date": "09232016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Affiliates of funds managed by Apollo Global affiliates announce successful tender offer for Outerwall "
    },
    {
        "content": "Caesars Entertainment Corp  said on Monday it remains \"optimistic\" of reaching a $5 billion deal with the bulk of its creditors to push its main operating unit out of bankruptcy  but one hedge fund bondholder said it will pursue litigation.",
        "date": "09262016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Caesars 'optimistic' on deal with bankrupt unit's creditors "
    },
    {
        "content": "Sept 26 Caesars Entertainment Corp said on Monday it remains \"optimistic\" of reaching a $5 billion deal with the bulk of its creditors to push its main operating unit out of bankruptcy  but one hedge fund bondholder said it will pursue litigation.",
        "date": "09262016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 2-Caesars 'optimistic' on deal with bankrupt unit's creditors "
    },
    {
        "content": "SYDNEY Australia-listed miner Terracom Ltd says the steepest rally in coal prices in over half a decade means that mines digging the commodity are becoming more expensive to buy  curbing a wave of purchases in the sector.",
        "date": "09272016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Australia miner says surging coal prices curbing asset sales in sector "
    },
    {
        "content": "Sept 15 Private equity firm Apollo Global Management has increased its bid for Danish telecoms company TDC  Danish news agency Ritzau reports citing Bloomberg News.",
        "date": "09152016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Apollo Global Management ups bid for Denmark's TDC -local media quotes Bloomberg "
    },
    {
        "content": "Sept 19 Accessories retailer Claire's Stores Inc  owned by Apollo Global Management LLC  said it was in advanced talks with a lender to allow its debt exchange program to proceed and release much-needed cash.",
        "date": "09192016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Claire's Stores gets waiver amid debt exchange talks "
    },
    {
        "content": "* Affiliates of certain funds managed by affiliates of Apollo Global Management announce extension of tender offer for all outstanding shares of Diamond Resorts  Source text for Eikon:",
        "date": "08292016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Affiliates of certain funds managed by affiliates of Apollo Global announce extension of tender offer for all outstanding shares of Diamond Resorts "
    },
    {
        "content": "Apollo Global Management LLC  said on Friday it would buy cloud services provider Rackspace Hosting Inc  in a deal valued at $4.3 billion  as the private-equity firm increases its investments in the technology sector.",
        "date": "08262016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo Global to buy Rackspace Hosting in $4.3 billion deal "
    },
    {
        "content": "* Aspen Merger Sub Inc announces tender offers for certain notes of Outerwall Inc.",
        "date": "08252016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Apollo - Aspen announces tender offers for certain notes of Outerwall Inc "
    },
    {
        "content": "In a case full of twists  Caesars Entertainment Corp  late on Monday won a two-week extension on a shield from lawsuits worth billions of dollars just days after a different U.S. court allowed those cases to proceed.",
        "date": "08292016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "In twist  Caesars wins brief extension on lawsuit shield "
    },
    {
        "content": "Aug 26 Apollo Global Management LLC said on Friday it would buy cloud services provider Rackspace Hosting Inc in a deal valued at $4.3 billion  as the private-equity firm increases its investments in the technology sector.",
        "date": "08262016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo Global to buy Rackspace Hosting in $4.3 bln deal "
    },
    {
        "content": "ROME  Aug 22 A tender to sell the good assets of four small banks Italy rescued from bankruptcy in November has been reopened after three binding bids submitted last month were rejected  a source familiar with the matter said on Monday.",
        "date": "08222016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Italy reopens tender for four rescued banks - source "
    },
    {
        "content": "* Affiliates of certain funds managed by affiliates of co determined to further extend offering period of cash tender offer",
        "date": "08232016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Affiliates of certain funds managed by affiliates of Apollo Global Management announce extension of tender offer "
    },
    {
        "content": "Aug 26 Cloud services provider Rackspace Hosting Inc said it agreed to be taken private by Apollo Global Management LLC in a deal valued at $4.3 billion  as the private-equity firm boosts its investments in the technology sector.",
        "date": "08262016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 1-Apollo Global to take Rackspace private in $4.3 bln deal "
    },
    {
        "content": "Four private equity funds affiliated with Apollo Global Management LLC struck a deal with U.S. regulators on Tuesday to pay $52.7 million to settle charges they misled fund investors about fees and a loan agreement.",
        "date": "08232016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo private equity advisers to pay $52.7 mln to settle U.S. SEC case "
    },
    {
        "content": "Four private equity funds affiliated with Apollo Global Management LLC struck a deal with U.S. regulators on Tuesday to pay $52.7 million to settle charges they misled fund investors about fees and a loan agreement.",
        "date": "08232016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo private equity advisers to pay $52.7 million to settle U.S. SEC case "
    },
    {
        "content": "Aug 23 Four private equity funds affiliated with Apollo Global Management LLC struck a deal with U.S. regulators on Tuesday to pay $52.7 million to settle charges they misled fund investors about fees and a loan agreement.",
        "date": "08232016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 2-Apollo private equity advisers to pay $52.7 mln to settle U.S. SEC case "
    },
    {
        "content": "* Affiliates of Apollo Global Management and Nike Inc announce strategic partnership for apparel manufacturing in the Americas",
        "date": "08182016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Nike  Apollo Global in partnership for apparel manufacturing "
    },
    {
        "content": "* Affiliates of certain funds managed by affiliates of apollo global management announce extension of tender offer for all outstanding shares of diamond resorts  Source text for Eikon:",
        "date": "08092016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Affiliates of certain funds managed by affiliates of Apollo Global Management announce extension of tender offer for all outstanding shares of Diamond Resorts "
    },
    {
        "content": "Private equity firm Apollo Global Management LLC  is in discussions to buy Constellis Holdings LLC  the owner of the U.S. military security services business formerly known as Blackwater  a spokeswoman for Constellis said on Friday.",
        "date": "08052016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo Global in talks to buy Constellis "
    },
    {
        "content": "Apollo Global Management LLC  is in discussions to acquire U.S. cloud services provider Rackspace Hosting Inc   people familiar with the matter said  as the buyout firm seeks to step up its investments in the technology sector.",
        "date": "08052016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo Global in talks to acquire Rackspace: sources "
    },
    {
        "content": "NEW YORK Asset manager Apollo Global Management LLC  posted quarterly earnings nearly five times that forecast on Wednesday  helped by a recovery in the oil market and a mark-up in the value of its insurance holding company.",
        "date": "08032016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Private equity firm Apollo's profit trounce forecasts  shares jump "
    },
    {
        "content": "Aug 5 Apollo Global Management LLC is in discussions to acquire U.S. cloud services provider Rackspace Hosting Inc  people familiar with the matter said  as the buyout firm seeks to step up its investments in the technology sector.",
        "date": "08052016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 3-Apollo Global in talks to acquire Rackspace - sources "
    },
    {
        "content": "NEW YORK  Aug 3 Asset manager Apollo Global Management LLC posted quarterly earnings nearly five times that forecast on Wednesday  helped by a recovery in the oil market and a mark-up in the value of its insurance holding company.",
        "date": "08032016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 2-Private equity firm Apollo's profit trounces forecasts  shares jump "
    },
    {
        "content": "Aug 5 Apollo Global Management LLC is in discussions to acquire U.S. cloud services provider Rackspace Hosting Inc  people familiar with the matter said  as the buyout firm seeks to step its investments in the technology sector.",
        "date": "08052016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo Global in talks to acquire Rackspace -sources "
    },
    {
        "content": "* Apollo Global Management Llc reports second quarter 2016 results  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08032016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "BRIEF-Apollo Global Management reports Q2 results "
    },
    {
        "content": "NEW YORK  Aug 3 Asset manager Apollo Global Management LLC reported much higher-than-expected quarterly earnings on Wednesday  boosted by large gains in its credit and private equity investments.",
        "date": "08032016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Private equity firm Apollo's earnings trounce expectations "
    },
    {
        "content": "* Certain funds affiliated with Apollo Global Management announce commencement of tender offer for all outstanding shares of outerwall",
        "date": "08052016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "BRIEF-Certain funds affiliated with Apollo Global Management announce commencement of tender offer for all o/s of outerwall "
    },
    {
        "content": "Creditors in the $18 billion Caesars Entertainment Operating Co Inc bankruptcy who are seeking sanctions against Caesars' owner Apollo Global Management filed their motion in the wrong city  a U.S. judge said on Monday and declined to rule.",
        "date": "08012016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Caesars creditors in 'wrong court' for Apollo sanctions - judge "
    },
    {
        "content": "The U.S. judge overseeing the Caesars casino bankruptcy ordered an emergency hearing for Monday to consider sanctioning the company's private equity sponsor after one of its directors failed to appear at a deposition.",
        "date": "07272016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Caesars junior creditors seek sanctions against Apollo "
    },
    {
        "content": "* Outerwall enters into definitive merger agreement to be acquired by certain funds managed by affiliates of Apollo Global Management for $52.00 per share in cash",
        "date": "07252016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Outerwall to be acquired by Apollo Global Management affiliates "
    },
    {
        "content": "Outerwall Inc   the owner of Redbox video rental kiosks   said it had agreed to be taken private by affiliates of private equity firm Apollo Global Management LLC  in a deal valued at about $1.6 billion.",
        "date": "07252016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo Global affiliates to take Outerwall private in $1.6 billion deal "
    },
    {
        "content": "July 25 Outerwall Inc  the owner of Redbox video rental kiosks   said it had agreed to be taken private by affiliates of private equity firm Apollo Global Management LLC in a deal valued at about $1.6 billion.",
        "date": "07252016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 1-Apollo Global affiliates to take Outerwall private in $1.6 bln deal "
    },
    {
        "content": "July 25 Outerwall Inc  the owner of Redbox video rental kiosks   said it had agreed to be bought by the affiliates of private equity firm Apollo Global Management LLC  in a deal valued at about $1.6 billion.",
        "date": "07252016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo Global affiliates to acquire Outerwall in $1.6 bln deal "
    },
    {
        "content": "* Apollo offer seen at well below banks' 1.4 bln euro book value",
        "date": "07202016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo sole bidder so far for Italy's four rescued banks- sources "
    },
    {
        "content": "July 15 Specialty chemicals company Ferro Corp  turned down acquisition offers from private equity firms Apollo Global Management LLC and CVC Capital Partners Ltd as too low  people familiar with the matter said on Friday.",
        "date": "07152016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Ferro Corp rebuffs bids from Apollo  CVC - sources "
    },
    {
        "content": "* Certain Funds Affiliated With Apollo Global Management announce commencement of cash tender offer to buy all shares of Diamond Resorts International  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07142016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Apollo Global Management's funds announce commencement of cash tender offer "
    },
    {
        "content": "COPENHAGEN  July 8 Shares in Danish telecoms company TDC jumped more than 10 percent on Friday after it said it had rejected a potential takeover approach believed to be from private equity firm Apollo Global Management.",
        "date": "07082016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "TDC receives takeover approach  shares jump "
    },
    {
        "content": "Diamond Resorts International Inc  said it agreed to be bought by private equity firm Apollo Global Management LLC  for about $2.2 billion.",
        "date": "06292016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo Global to buy Diamond Resorts for $2.2 billion "
    },
    {
        "content": "June 29 Diamond Resorts International Inc  said it agreed to be bought by private equity firm Apollo Global Management LLC for about $2.2 billion.",
        "date": "06292016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 2-Apollo Global to buy Diamond Resorts for $2.2 bln "
    },
    {
        "content": "* Diamond Resorts International Inc enters into definitive merger agreement to be acquired by affiliates of certain funds managed by affiliates of Apollo Global Management for $30.25 per share in cash",
        "date": "06292016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "BRIEF-Diamond Resorts International to be acquired by Apollo Global Management "
    },
    {
        "content": "* Apollo Global nears deal to buy Diamond Resorts- WSJ  citing sources",
        "date": "06292016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "BRIEF-Apollo Global nears deal to buy Diamond Resorts- WSJ "
    },
    {
        "content": "CHICAGO  June 15 A U.S. judge on Wednesday temporarily halted lawsuits seeking $11.4 billion in damages from Caesars Entertainment Corp on Wednesday  urging the parties in the bankruptcy of its operating unit to settle before an injunction expires in August.",
        "date": "06152016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 2-U.S. judge gives Caesars temporary reprieve from lawsuits "
    },
    {
        "content": "MILAN  June 15 Monte dei Paschi di Siena has invited bids from investors for a majority stake in a unit that will manage a gross 28 billion euros ($31 billion) in bad loans held by Italy's third-biggest bank  two sources familiar with the matter said.",
        "date": "06152016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Monte dei Paschi invites bids for stake in bad loan unit-sources "
    },
    {
        "content": "* Unit priced previously announced offering of $500 million aggregate principal amount of its 4.400 pct senior notes due 2026",
        "date": "05252016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Apollo Global Management unit's previously annnounced offering of notes priced at 99.912 pct "
    },
    {
        "content": "NEW YORK Asset manager Apollo Global Management LLC warned of a \"very challenging\" investment environment on Thursday as it posted an unexpected first-quarter loss after taking a hit in its private equity investments.",
        "date": "05052016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Asset manager Apollo Global posts unexpected first-quarter loss "
    },
    {
        "content": "MILAN Italian bank Carige  said on Friday its board had rejected an offer by U.S. fund Apollo Global Management  to buy a controlling stake in the lender by acquiring the bulk of a 550-million euro ($559 million) share issue.",
        "date": "04292016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Carige rejects Apollo's offer to take stake in bank "
    },
    {
        "content": "May 2 Funds Managed By Affiliates Of Apollo Global Management  Llc",
        "date": "05022016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Funds affiliated with Apollo Global to acquire Amquip Crane Rental and Maxim Crane Works "
    },
    {
        "content": "* Apollo Global Management  Llc reports first quarter 2016 results",
        "date": "05052016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "BRIEF-Apollo Global Management Q1 loss per share $0.19 "
    },
    {
        "content": "Apollo Global Management LLC  has struck deals to acquire Maxim Crane Works LP and AmQuip Crane Rental LLC  creating a U.S. lifting equipment company valued at close to $1.4 billion  including debt  people familiar with the matter said.",
        "date": "05022016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo to acquire and merge Maxim Crane and AmQuip Crane: sources "
    },
    {
        "content": "For-profit education provider Apollo Education Group Inc  said a group of private-equity firms raised their cash offer for the company by 5 percent to $1.14 billion.",
        "date": "05022016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo Education gets raised offer of $1.14 billion "
    },
    {
        "content": "SAO PAULO/LONDON Vale SA  is considering spinning off its fertilizer assets into a joint venture controlled by Apollo Global Management LLC  if they succeed in a joint bid for Anglo American Plc's fertilizer operations in Brazil  three sources with direct knowledge of the plan told Reuters on Wednesday.",
        "date": "04282016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Exclusive: Apollo  Vale in talks for broad Brazil fertilizer venture - sources "
    },
    {
        "content": "* ADT stockholders approve acquisition by an affiliate of certain funds managed by affiliates of Apollo Global Management  LLC",
        "date": "04222016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-ADT stockholders approve acquisition by affiliates of Apollo Global Management "
    },
    {
        "content": "April 5 The co-founder of Apollo Global Management  Marc Rowan  resigned from the board of Caesars Entertainment Corp's operating unit after an investigation found that he had led a deal that was undervalued and shortchanged the now-bankrupt unit  court documents showed.",
        "date": "04052016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo architect of Caesars deal quits bankrupt unit's board -documents "
    },
    {
        "content": "To access the newsletter  click on the link:    http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_04052016.pdf           FACTORS TO WATCH    10:00 am: Finance Minister Arun Jaitley at capital markets event organized by IFC in New Delhi.    11:00 am: RBI releases bi-monthly monetary policy statement in Mumbai. 11:00 am: Junior Finance Minister Jayant Sinha and Power Minister Piyush Goyal at Confederation of Indian Industry event in New Delhi.    11:10 am: RBI Governor Raghura",
        "date": "04052016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Morning News Call - India  April 5 "
    },
    {
        "content": "April 3 Paul  Weiss  Rifkind  Wharton & Garrison LLP said on Sunday it had hired Scott Barshay  one of rival U.S. law firm Cravath  Swaine & Moore LLP's most prolific dealmakers  as its global head of mergers and acquisitions.",
        "date": "04042016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "CORRECTED-MOVES-Law firm Paul Weiss hires Cravath M&A rainmaker Barshay "
    },
    {
        "content": "By Tracy Rucinski  and Tom Hals     April 1 An extra-marital affair of a restructuring adviser working for the bankrupt unit of Caesars Entertainment Corp has cost the casino operator a team of key advisers just as the unit faces a Monday deadline to submit a plan to end its $18 billion bankruptcy.     The bankrupt operating unit hired financial adviser Melissa Knoll and her team in 2014 to help probe creditor allegations that its parent  Caesars  stripped away its best hotels and le",
        "date": "04012016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Extra-marital affair tangles Caesars bankruptcy planning "
    },
    {
        "content": "* Top investor says proposal does not look in line with market",
        "date": "03312016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Carige set to reject Apollo's bid after top investor picks board "
    },
    {
        "content": "MILAN U.S. fund Apollo Global Management  has offered to buy a controlling stake in Italian bank Carige  by acquiring the bulk of a 550-million euro ($559 million) share issue  the lender said on Tuesday.",
        "date": "03292016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo offers to buy majority of Italy's Carige via 550 million euros cash call "
    },
    {
        "content": "* Carige stock up 6.2 percent   (Recasts with company confirmation  adds details  comment)",
        "date": "03292016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 1-Apollo offers to buy majority of Italy's Carige via 550 mln euros cash call "
    },
    {
        "content": "NEW YORK  March 18 Some cash-strapped U.S. oil and gas companies are considering creating an unusual layer of debt as a way of surviving the rout in oil and gas prices  according to restructuring advisors.",
        "date": "03182016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Struggling U.S. oil and gas companies eye rare financing deals "
    },
    {
        "content": "Specialty chemical maker Ferro Corp  received an offer from investment firm Apollo Global Management LLC   Bloomberg reported  citing people with knowledge of the matter.",
        "date": "03152016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Ferro Corp receives takeover proposal from Apollo Global: Bloomberg "
    },
    {
        "content": "Private equity firm Apollo Global Management LLC  is nearing a deal to acquire Fresh Market Inc   a U.S. specialty grocery retailer  for more than $1.3 billion  people familiar with the matter said on Friday.",
        "date": "03122016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Exclusive: Apollo Global nears deal to acquire Fresh Market - sources "
    },
    {
        "content": "NEW YORK Fresh Market Inc  has signed a deal to be acquired by Apollo Global Management LLC  for about $1.36 billion in cash  as the moribund U.S. specialty grocery retailer looks to the private equity firm for a turnaround. | Video ",
        "date": "03142016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo Global adds grocery chain Fresh Market to shopping cart "
    },
    {
        "content": "* Board unanimously approves deal; Chairman Ray Berry recuses   (Rewrites  adds background on Apollo and Fresh Market)",
        "date": "03142016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 4-Apollo Global adds grocery chain Fresh Market to shopping cart "
    },
    {
        "content": "March 14 Specialty grocery retailer Fresh Market Inc said it agreed to be taken private by funds managed by affiliates of Apollo Global Management LLC for about $1.36 billion in cash.",
        "date": "03142016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo Global to buy grocery retailer Fresh Market for $1.36 bln "
    },
    {
        "content": "NEW YORK  Feb 18 The US$4.7bn financing backing security firm ADT's jumbo US$7bn buyout by Apollo Global Management is expected to provide a litmus test for appetite in the turbulent US leveraged finance market.",
        "date": "02182016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "TRLPC: US loan market braced for ADT's giant US$7bn leveraged buyout "
    },
    {
        "content": "CHICAGO  Feb 10 Senior creditors of Caesars Entertainment Corp's bankrupt operating unit are threatening to abandon a framework agreement and propose their own formal restructuring plan as soon as Monday  court documents showed.",
        "date": "02112016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Caesars senior creditors threaten to tear up framework plan "
    },
    {
        "content": "Feb 16 Electronic security services provider ADT Corp said it had agreed to be acquired by funds affiliated with private equity firm Apollo Global Management LLC  for $7 billion.",
        "date": "02162016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo Global to buy security services provider ADT Corp "
    },
    {
        "content": "Private-equity firm Apollo Global Management  is nearing a deal to acquire ADT Corp  and combine it with another security company Apollo already owns  Protection 1  according to a person familiar with the matter.",
        "date": "02162016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo Global Management nears deal to buy ADT Corp: source "
    },
    {
        "content": "Feb 15 Private-equity firm Apollo Global Management is nearing a deal to acquire ADT Corp  and combine it with another security company Apollo already owns  Protection 1  according to a person familiar with the matter.",
        "date": "02162016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 1-Apollo Global Management nears deal to buy ADT Corp - source "
    },
    {
        "content": "Feb 8 For-profit education provider Apollo Education Group Inc said on Monday it would be taken private for $1.1 billion by a group of private equity firms that have committed to financing the deal without borrowing.",
        "date": "02082016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 2-Apollo Education to be taken private in $1.1 bln deal "
    },
    {
        "content": "NEW YORK Alternative asset manager Apollo Global Management LLC  on Wednesday unveiled a $250 million share buyback after posting a disappointing 69 percent slide in fourth-quarter earnings on the back of falling oil prices.",
        "date": "02032016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Asset manager Apollo unveils buyback as earnings disappoint "
    },
    {
        "content": "CHICAGO  Jan 29 The bankrupt operating unit of Caesars Entertainment Corp will soon ask a U.S. judge to shield its parent from $12 billion of lawsuits to facilitate a debt-cutting rescue deal  but approval could set a bad precedent for creditors.",
        "date": "01292016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Caesars gets fresh chance at halting U.S. creditor lawsuits "
    },
    {
        "content": "Private equity firm Apollo Global Management LLC  is in advanced talks to buy for-profit education provider Apollo Education Group Inc   a source familiar with the matter said on Monday.",
        "date": "01122016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "PE firm Apollo Global in talks to buy Apollo Education: source "
    },
    {
        "content": "Private equity firm Apollo Global Management LLC  is in advanced talks to buy for-profit education provider Apollo Education Group Inc  for about $1 billion  the Wall Street Journal reported.",
        "date": "01112016",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "PE firm Apollo Global in talks to buy Apollo Education: WSJ "
    },
    {
        "content": "Jan 11 Private equity firm Apollo Global Management LLC is in advanced talks to buy for-profit education provider Apollo Education Group Inc  a source familiar with the matter said on Monday.",
        "date": "01122016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 5-PE firm Apollo Global in talks to buy Apollo Education - source "
    },
    {
        "content": "Jan 11 Private equity firm Apollo Global Management LLC is in advanced talks to buy for-profit education provider Apollo Education Group Inc for about $1 billion  the Wall Street Journal reported.",
        "date": "01112016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 4-PE firm Apollo Global in talks to buy Apollo Education - WSJ "
    },
    {
        "content": "Jan 11 Outsourcing company Xchanging Plc  said it did not expect a superior cash offer from Ebix Inc  and urged shareholders to accept a bid from U.S.-based Computer Sciences Corp.",
        "date": "01112016",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Xchanging says does not expect sweetened bid from Ebix "
    },
    {
        "content": "Buyout firm Apollo Global Management LLC  is in advanced talks to acquire Maxim Crane Works LP  one of the largest U.S. providers of lifting equipment  for more than $1 billion including debt  according to people familiar with the matter.",
        "date": "12172015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo in the lead to acquire Maxim Crane: sources "
    },
    {
        "content": "* \u007fHas entered into a strategic partnership with funds managed by affiliates of Apollo Global Management  Llc\u007f",
        "date": "12172015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "BRIEF-Airopack Technology Group: strategic partnership with funds affiliated with Apollo Global Management "
    },
    {
        "content": "VIENNA  Dec 10 Austria's Raiffeisen Bank International (RBI) said on Thursday it had agreed to sell its Slovenian unit for an undisclosed sum to Biser Bidco  run by an affiliate of U.S. investment fund Apollo Global Management.",
        "date": "12102015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "UPDATE 1-Raiffeisen sells Slovenian unit to Apollo Global's Biser Bidco "
    },
    {
        "content": "Dec 9 Technology consulting company Computer Sciences Corp (CSC) will buy Xchanging Plc for about 480 million pounds ($721 million)  the companies said  beating out other suitors in a bidding war for the insurance-focused outsourcing company.",
        "date": "12092015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "CORRECTED-UPDATE 1-Computer Sciences Corp to buy Xchanging for $721 mln "
    },
    {
        "content": "Dec 10 The following bids  mergers  acquisitions and disposals were reported by 1500 GMT on Thursday:",
        "date": "12102015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "VIENNA  Dec 10 Austria's Raiffeisen Bank International (RBI) said on Thursday it had agreed to sell its Slovenian unit for an undisclosed sum to Biser Bidco  run by an affiliate of U.S. investment fund Apollo Global Management.",
        "date": "12102015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Raiffeisen sells Slovenian unit to Apollo Global's Biser Bidco "
    },
    {
        "content": "Dec 10 Insurance software company Ebix Inc  said it was still interested in making an offer for Xchanging Plc  a day after Computer Sciences Corp  agreed to buy the British outsourcing company for about 480 million pounds.",
        "date": "12102015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Ebix says still pursuing Xchanging despite CSC offer "
    },
    {
        "content": "Nov 16 Insurance software maker Ebix Inc  said it made a 450 million-pound ($684 million) takeover approach for Xchanging Plc  making it the latest company to show an interest in the provider of services to the insurance industry.",
        "date": "11162015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 1-Insurance software maker Ebix approaches Xchanging with takeover bid "
    },
    {
        "content": "Private equity firm Apollo Global Management LLC's  deal with entrepreneur Nicholas Schorsch to take control of a real-estate investment business with roughly $19 billion of assets has fallen apart  the Wall Street Journal reported on Friday  citing people familiar with the matter.",
        "date": "11072015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo's bid for real estate business falls apart: WSJ "
    },
    {
        "content": "Nov 4 Insurance-focused outsourcing company Xchanging Plc said U.S.-based private equity firm Apollo Global Management LLC had dropped out of a race to potentially acquire the company.",
        "date": "11042015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Xchanging says Apollo Global drops out of takeover race "
    },
    {
        "content": "Oct 28 Alternative asset managers Carlyle Group LP and Apollo Global Management LLC followed peers on Wednesday in reporting that the third quarter's stock market plunge weighed on their earnings  even as they scored some key wins.",
        "date": "10282015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Carlyle  Apollo hit by third-quarter market rout "
    },
    {
        "content": "* Statement regarding ongoing discussions with Apollo Global Management",
        "date": "10142015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Xchanging Plc confirms offer talks with Apollo "
    },
    {
        "content": "KKR & Co  and Apollo Global Management  are seeking to acquire General Electric Co's  inventory finance arm  Bloomberg reported on Friday.",
        "date": "09112015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "KKR  Apollo Global seek to buy GE's inventory finance arm "
    },
    {
        "content": "Aug 5 Shipping company Teekay Tankers Ltd  said it would buy a fleet of 12 Suezmax tankers for $662 million from Principal Maritime Tankers  backed by Apollo Global Management LLC.",
        "date": "08052015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Teekay to buy 12 tankers from Apollo-backed Principal Maritime "
    },
    {
        "content": "SEOUL  Aug 6 Private equity firms Apollo Global Management LLC and PAG are among suitors who have submitted eight first-round bids for a controlling stake in Uamco Ltd  South Korea's biggest bad asset management firm  a newspaper reported on Thursday.",
        "date": "08062015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo  PAG among bidders for S.Korean bad loan investment firm -report "
    },
    {
        "content": "LONDON  July 23 Royal Bank of Scotland  said it had agreed to sell a portfolio of loans to an entity funded by Deutsche Bank and funds affiliated with Apollo Global Management.",
        "date": "07232015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "RBS to sell loans to Deutsche Bank  Apollo in 400 mln stg deal "
    },
    {
        "content": "NEW YORK Apollo Global Management has raised a $1.1 billion Collateralized Loan Obligation (CLO) fund  which is the largest in the U.S. this year  despite spreads widening to the highest level in three months amid market volatility  sources said.",
        "date": "07162015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo issues largest CLO of the year with $1.1 billion fund "
    },
    {
        "content": "LJUBLJANA US investment fund Apollo Global Management is interested in buying Raiffeisen's bank in Slovenia  daily newspaper Finance reported on Wednesday.",
        "date": "07152015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "U.S. fund Apollo interested in Raiffeisen's Slovenian bank: report "
    },
    {
        "content": "LJUBLJANA  July 15 US investment fund Apollo Global Management is interested in buying Raiffeisen's  bank in Slovenia  daily newspaper Finance reported on Wednesday.",
        "date": "07152015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "U.S. fund Apollo interested in Raiffeisen's Slovenian bank - report "
    },
    {
        "content": "LJUBLJANA U.S. investment firm Apollo Global Management  and the EBRD will buy Slovenia's second-largest bank Nova KBM (NKBM) for 250 million euros ($279 million)  the bank  sale coordinator and the buyers said in a joint statement on Tuesday.",
        "date": "06302015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo  EBRD to buy Slovenian bank NKBM for 250 million euros "
    },
    {
        "content": "LJUBLJANA  June 30 U.S. investment firm Apollo Global Management and the EBRD will buy Slovenia's second-largest bank Nova KBM (NKBM) for 250 million euros ($279 million)  the bank  sale coordinator and the buyers said in a joint statement on Tuesday.",
        "date": "06302015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 1-Apollo  EBRD to buy Slovenian bank NKBM for 250 mln euros "
    },
    {
        "content": "LJUBLJANA  June 30 U.S. investment firm Apollo Global Management and EBRD bank will buy Slovenia's second-largest bank Nova KBM (NKBM) for 250 million euros ($279 million)  the bank  sale coordinator and the buyers said in a joint statement on Tuesday.",
        "date": "06302015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo and EBRD to buy Slovenian bank NKBM for 250 mln euros "
    },
    {
        "content": "Capital One Financial Corp  and Apollo Global Management  have bid for General Electric Co's  health-care finance unit  which could fetch more than $11 billion  Bloomberg reported.",
        "date": "06262015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Capital One  Apollo among bidders for GE health-care lender: Bloomberg "
    },
    {
        "content": "June 25 Capital One Financial Corp and Apollo Global Management have bid for General Electric Co's health-care finance unit  which could fetch more than $11 billion  Bloomberg reported.",
        "date": "06262015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Capital One  Apollo among bidders for GE health-care lender -Bloomberg "
    },
    {
        "content": "LONDON Banks have lined up 2.2 billion euros ($2.48 billion) of loan and bond financing to back private equity firm Apollo Global Management’s  acquisition of Saint-Gobain's glass bottle unit Verallia  banking sources said on Thursday.",
        "date": "06112015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo borrows $2.5 billion to finance Verallia buy "
    },
    {
        "content": "LONDON  June 11 Banks have lined up 2.2 billion euros ($2.48 billion) of loan and bond financing to back private equity firm Apollo Global Management's acquisition of Saint-Gobain's glass bottle unit Verallia  banking sources said on Thursday.",
        "date": "06112015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "LPC-Apollo borrows 2.2 bln euros to finance Verallia buy "
    },
    {
        "content": "PARIS Buyout firm Apollo Global Management has won the bidding for Saint-Gobain's Verallia glass bottle making unit  a source familiar with the situation said.",
        "date": "06072015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo wins auction for St-Gobain's Verallia: source "
    },
    {
        "content": "PARIS Private equity firm Apollo Global Management  has won the bidding for Saint-Gobain's glass bottle unit Verallia with an offer valuing the business at 2.95 billion euros ($3.27 billion)  the French building materials group said on Monday.",
        "date": "06082015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo wins auction for Saint Gobain's glass bottle unit Verallia "
    },
    {
        "content": "PARIS Buyout firm Apollo Global Management is currently the leading bidder to take over Saint-Gobain's Verallia glass bottle making unit  Bloomberg news agency reported on Saturday.",
        "date": "06062015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo leads bids for St-Gobain's Verallia: Bloomberg "
    },
    {
        "content": "PARIS  June 7 Buyout firm Apollo Global Management has won the bidding for Saint-Gobain's  Verallia glass bottle making unit  a source familiar with the situation said.",
        "date": "06072015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 2-Apollo wins auction for St-Gobain's Verallia -source "
    },
    {
        "content": "* Investment fund Bpifrance could also take stake   (Adds background)",
        "date": "06082015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 2-Apollo wins auction for Saint Gobain's glass bottle unit Verallia "
    },
    {
        "content": "PARIS  June 6 Buyout firm Apollo Global Management is currently the leading bidder to take over Saint-Gobain's Verallia glass bottle making unit  Bloomberg news agency reported on Saturday.",
        "date": "06062015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo leads bids for St-Gobain's Verallia - Bloomberg "
    },
    {
        "content": "PARIS  June 7 Buyout firm Apollo Global Management has won the bidding for Saint-Gobain's  Verallia glass bottle making unit with a 2.95 billion euro ($3.27 billion) offer  Le Figaro newspaper reported on Sunday  saying the deal would be made official soon.",
        "date": "06072015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo wins St-Gobain's Verallia with 2.95 bln euro bid -Le Figaro "
    },
    {
        "content": "* Closed on Friday sale of Carige Vita Nuova and Carige Assicurazioni insurance units to Apollo Global Management",
        "date": "06052015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "BRIEF-Italy's Carige closes sale of insurance units to Apollo "
    },
    {
        "content": "PARIS  June 8 Below are company-related news and stories from French and Benelux media which could have an impact on the region's markets or individual stocks.",
        "date": "06082015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "French and Benelux stocks-Factors to watch on June 8 "
    },
    {
        "content": "LONDON  June 8 European equity futures slipped on Monday  with shares in Deutsche Bank in focus after Germany's largest lender named a new chief executive.",
        "date": "06082015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "European Factors to Watch-Equity futures sag  Dt Bank in focus "
    },
    {
        "content": "OM Group Inc   a maker of magnetic and battery technologies and specialty chemicals whose sales have fallen for the past two years  has agreed to be taken private by Apollo Global Management LLC  for about $1.03 billion in cash.",
        "date": "06012015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "OM Group to be taken private by Apollo Global in $1.03 billion deal "
    },
    {
        "content": "June 1 OM Group Inc  a maker of magnetic and battery technologies and specialty chemicals whose sales have fallen for the past two years  has agreed to be taken private by Apollo Global Management LLC for about $1.03 billion in cash.",
        "date": "06012015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 2-OM Group to be taken private by Apollo Global in $1.03 bln deal "
    },
    {
        "content": "LONDON  June 8 European stocks were seen opening mixed on Monday  with shares in Deutsche Bank in focus after Germany's largest lender named a new chief executive.",
        "date": "06082015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "European Factors to Watch-FTSE set to edge up  DAX seen lower "
    },
    {
        "content": "June 1 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Monday:",
        "date": "06012015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "June 1 Private equity firm Apollo Global Management LLC will buy industrial magnet and battery maker OM Group Inc for about $1.03 billion in cash.",
        "date": "06012015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo Global to buy magnet maker OM Group for about $1.03 bln "
    },
    {
        "content": "May 11 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "05112015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Apollo Global Management Llc  is in talks to buy ASG Security and combine it with another home security company it is acquiring  Protection 1  valuing them collectively at about $2 billion  people familiar with the matter said on Monday.",
        "date": "05112015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Exclusive: Apollo in talks to buy ASG Security  combine with other firm - sources "
    },
    {
        "content": "SunTrust Banks Inc  Apollo Global Management and Ares Management LP are considering offers for buying General Electric Co's unit that lends to private-equity firms in the United States  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "04242015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "GE buyout-lending unit draws interest from SunTrust  Apollo  Ares: Bloomberg "
    },
    {
        "content": "April 24 SunTrust Banks Inc  Apollo Global Management and Ares Management LP are considering offers for buying General Electric Co's unit that lends to private-equity firms in the United States  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "04242015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "GE buyout-lending unit draws interest from SunTrust  Apollo  Ares - Bloomberg "
    },
    {
        "content": "DUBAI Apollo Global Management is in talks to expand its business into the Middle East for the first time through a joint venture with a local investment firm  three sources aware of the matter told Reuters on Wednesday.",
        "date": "04082015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo plans to expand into Mideast via Dubai joint venture: sources "
    },
    {
        "content": "DUBAI  April 8 Apollo Global Management  is in talks to expand its business into the Middle East for the first time through a joint venture with a local investment firm  three sources aware of the matter told Reuters on Wednesday.",
        "date": "04082015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Apollo plans to expand into Mideast via Dubai joint venture - sources "
    },
    {
        "content": "TORONTO Amaya Gaming Group Inc  said on Monday it has agreed to sell its Cadillac Jack subsidiary that makes slot machines and electronic bingo games for casinos to an affiliate of private equity firm Apollo Global Management  for C$476 million ($375 million).",
        "date": "03302015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Amaya to sell Cadillac Jack subsidiary to Apollo for $375 million "
    },
    {
        "content": "TORONTO  March 30 Amaya Gaming Group Inc  said on Monday it has agreed to sell its Cadillac Jack subsidiary that makes slot machines and electronic bingo games for casinos to an affiliate of private equity firm Apollo Global Management for C$476 million ($375 million).",
        "date": "03302015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Amaya to sell Cadillac Jack subsidiary to Apollo for $375 mln "
    },
    {
        "content": "March 17 Natural resources conglomerate Freeport-McMoRan Inc has hired Goldman Sachs Group Inc  and Barclays Plc to help find private equity firms that will finance some of its projects  according to people familiar with the matter.",
        "date": "03172015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Freeport taps Goldman  Barclays to help find partners -sources "
    },
    {
        "content": "March 17 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Tuesday:",
        "date": "03172015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "March 17 The following corporate finance-related stories were reported by media:",
        "date": "03172015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 1-Market Chatter-Corporate finance press digest March 17 "
    },
    {
        "content": "March 17 The following corporate finance-related stories were reported by media:",
        "date": "03172015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Market Chatter- Corporate finance press digest March 17 "
    },
    {
        "content": "Buyout firm Apollo Global Management LLC is in advanced talks to acquire most of the assets of Digital First Media  publisher of the Denver Post and San Jose Mercury News  for around $400 million  according to people familiar with the matter.",
        "date": "03162015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Exclusive: Apollo in the lead to buy Digital First Media - sources "
    },
    {
        "content": "Apollo Global Management LLC  said on Thursday its 2014 fourth-quarter profit fell by 79 percent  more than most analysts expected  as a big drop in crude oil prices weighed on the value of its private equity and credit assets.",
        "date": "02052015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo's fourth-quarter earnings plunge on energy exposure "
    },
    {
        "content": "Feb 5 The following bids  mergers  acquisitions and disposals were reported by 1200 GMT on Thursday:",
        "date": "02052015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Private equity firm Apollo Global Management LLC  is exploring a sale or initial public offering of Great Wolf Resorts Inc  the largest U.S. operator of indoor water parks  according to people familiar with the matter.",
        "date": "02042015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Exclusive: Apollo explores sale or IPO of Great Wolf Resorts - sources "
    },
    {
        "content": "Feb 4 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Wednesday:",
        "date": "02042015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Private equity firm Apollo Global Management LLC  is in advanced talks to acquire Protection 1 in a deal that could value the U.S. home security company at close to $1.5 billion  including debt  according to people familiar with the matter.",
        "date": "02042015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Exclusive: Apollo in the lead to acquire Protection 1 - sources "
    },
    {
        "content": "The bankruptcy of the operating unit of Caesars Entertainment Corp's will proceed in Chicago  a victory for the casino company's private equity backers over its hedge fund creditors who wanted the case in Delaware.",
        "date": "01282015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "Caesars' gets its Chicago bankruptcy in win for Apollo "
    },
    {
        "content": "Jan 28 The bankruptcy of the operating unit of Caesars Entertainment Corp's will proceed in Chicago  a victory for the casino company's private equity backers over its hedge fund creditors who wanted the case in Delaware.",
        "date": "01282015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "UPDATE 2-Caesars' gets its Chicago bankruptcy in win for Apollo "
    },
    {
        "content": "NEW YORK  Jan 22 The term debt financing backing Apollo Global Management LLC's buyout of information technology services provider Presidio Inc is facing pushback from loan investors wary of an unpopular sponsor  the deal's high leverage and issues related to the credit itself.",
        "date": "01222015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo to pay more on Presidio amid reputational  credit questions "
    },
    {
        "content": "NEW YORK (This story filed on January 22  2015 has been refiled to clarify proposed creditor terms of the Caesars bankruptcy and related quotation)",
        "date": "01232015",
        "name": "Apollo Global Management LLC",
        "news_type": "topStory",
        "symbol": "APO",
        "title": "Apollo to pay more on Presidio amid reputational  credit questions "
    },
    {
        "content": "NEW YORK  Jan 22 The term debt financing backing Apollo Global Management LLC's buyout of information technology services provider Presidio Inc is facing pushback from loan investors wary of an unpopular sponsor  the deal's high leverage and issues related to the credit itself.",
        "date": "01232015",
        "name": "Apollo Global Management LLC",
        "news_type": "normal",
        "symbol": "APO",
        "title": "REFILE-Apollo to pay more on Presidio amid reputational  credit questions "
    }
]