[
    {
        "content": "* Announced a multi-year cooperative research agreement with Airbus to advance metal 3D printing for aircraft manufacturing​ Source text for Eikon: Further company coverage:",
        "date": "11152017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic inc ‍announces multi-year cooperative research agreement with Airbus "
    },
    {
        "content": "* Paulson & Co Inc dissolves share stake in Facebook Inc ‍​- SEC filing",
        "date": "11142017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Paulson & Co dissolves share stake in Facebook  cuts share stake in Allergan "
    },
    {
        "content": "* Arconic Inc - new CEO Charles Blankenship will receive a base salary at an annual rate of $1.25 million - sec filing‍​",
        "date": "10232017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic new CEO will receive base salary at an annual rate of $1.25 mln "
    },
    {
        "content": "* ‍TSI Incorporated announces a distribution agreement with Arconic Inc​",
        "date": "10232017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-‍TSI Inc announces distribution agreement with Arconic​ "
    },
    {
        "content": "U.S. specialty metals maker Arconic on Monday named a veteran of General Electric as its new chief executive  a move that pleased Arconic's biggest shareholder  which had been closely examining the hiring of a new leader at the company.",
        "date": "10232017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Arconic taps veteran GE exec as CEO  Elliott pleased with choice "
    },
    {
        "content": "Oct 23 U.S. specialty metals maker Arconic on Monday named a veteran of General Electric as its new chief executive  a move that pleased Arconic's biggest shareholder  which had been closely examining the hiring of a new leader at the company.",
        "date": "10232017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "UPDATE 4-Arconic taps veteran GE exec as CEO  Elliott pleased with choice "
    },
    {
        "content": "* ‍Elliott Management Corporation - strongly supports Charles Blankenship as Arconic's next CEO  John Plant as next board chair​ Source text for Eikon: Further company coverage:",
        "date": "10232017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-‍Elliott Management Corp says strongly supports Charles Blankenship as Arconic's next CEO​ "
    },
    {
        "content": "* Arconic Inc - ‍Eric Roegner appointed head of Engineered Products & Solutions​",
        "date": "10232017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic announces business leadership changes "
    },
    {
        "content": "* Arconic appoints Charles “Chip” Blankenship Chief Executive Officer; John Plant named Chair of the Board",
        "date": "10232017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic appoints Charles Blankenship CEO  John Plant named Chair of the Board "
    },
    {
        "content": "Oct 23 U.S. specialty metals maker Arconic Inc said on Monday it appointed former General Electric Co executive Charles \"Chip\" Blankenship as its as chief executive and a member of the company's board  effective Jan. 15.",
        "date": "10232017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Arconic names former GE exec Blankenship as CEO "
    },
    {
        "content": "* Arconic announces mandatory conversion of its 5.375% Class B mandatory convertible preferred stock",
        "date": "09282017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic announces mandatory conversion of its preferred stock "
    },
    {
        "content": "* Arconic Inc director ‍patricia​ Russo reports purchase of 15 000 shares of co's common stock on Aug 15 at average price of $24.57 per share - SEC filing Source text: (http://bit.ly/2uZrRE5) Further company coverage:",
        "date": "08152017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic director Patricia​ Russo buys 15 000 shares of co's common stock on Aug 15 "
    },
    {
        "content": "* Arconic Inc - On July 31  co entered separation agreement with Klaus Kleinfeld  former chairman and ceo of the company‍​ - SEC filing",
        "date": "08022017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic Inc entered separation agreement with Klaus Kleinfeld on July 31‍​ "
    },
    {
        "content": "* Q2 earnings per share view $0.26 -- Thomson Reuters I/B/E/S",
        "date": "07242017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic Q2 adjusted earnings per share $0.32 "
    },
    {
        "content": "NEW YORK A shareholder of Arconic Inc  on Thursday filed a lawsuit accusing the company of defrauding shareholders over its supply of cladding panels used at Grenfell Tower  the London high-rise where at least 80 people died in a fire last month. | Video ",
        "date": "07142017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Arconic sued in United States over fatal London tower fire "
    },
    {
        "content": "NEW YORK A shareholder of Arconic Inc on Thursday filed a lawsuit accusing the company of defrauding shareholders over its supply of cladding panels used at Grenfell Tower  the London high-rise where at least 80 people died in a fire last month.",
        "date": "07132017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Arconic sued in United States over fatal London tower fire "
    },
    {
        "content": "NEW YORK  July 13 A shareholder of Arconic Inc on Thursday filed a lawsuit accusing the company of defrauding shareholders over its supply of cladding panels used at Grenfell Tower  the London high-rise where at least 80 people died in a fire last month.",
        "date": "07142017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "UPDATE 2-Arconic sued in United States over fatal London tower fire "
    },
    {
        "content": "NEW YORK  July 13 A shareholder of Arconic Inc has filed a proposed class-action lawsuit accusing the company of defrauding shareholders in connection with its having supplied cladding panels used at Grenfell Tower  the London high-rise where dozens of people died last month in a fatal fire.",
        "date": "07132017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Arconic is sued in U.S. over fatal London tower fire "
    },
    {
        "content": "July 13 Arconic shareholder files securities fraud lawsuit against company over fatal grenfell tower fire in london -- u.s. Court filing LAWSUIT FILED BY MICHAEL BRAVE IN MANHATTAN FEDERAL COURT AGAINST ARCONIC  ITS FORMER CEO KLAUS KLEINFELD  AND CFO KENNETH GIACOBBE PLAINTIFF ALLEGES THAT ARCONIC MADE FALSE AND MISLEADING STATEMENTS  OR FAILED TO TIMELY DISCLOSE MATTERS  RELATED TO THE FIRE PLAINTIFF SAYS ARCONIC'S CONDUCT SIGNIFICANTLY INCREASED THE RISK OF PROPERTY DAMAGE RELATED",
        "date": "07132017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic is sued in U.S. over fatal fire in London's Grenfell Tower "
    },
    {
        "content": "NEW YORK Arconic Inc said on Monday it will stop global sales of plastic-filled aluminum cladding panels for use in high-rise buildings after a fire in London's Grenfell Tower  which used those Arconic panels  killed at least 79 people.",
        "date": "06272017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Arconic ends sales of panels used at Grenfell Tower for high-rises "
    },
    {
        "content": "NEW YORK  June 26 Arconic Inc said on Monday it will stop global sales of plastic-filled aluminum cladding panels for use in high-rise buildings after a fire in London's Grenfell Tower  which used those Arconic panels  killed at least 79 people.",
        "date": "06262017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "UPDATE 3-Arconic ends sales of panels used at Grenfell Tower for high-rises "
    },
    {
        "content": "LONDON Six emails sent by and to an Arconic Inc  sales manager raise questions about why the company supplied combustible cladding to a distributor for use at Grenfell Tower  despite publicly warning such panels were a fire risk for tall buildings.    The emails  dating from 2014 and seen by Reuters  were between Deborah French  Arconic's UK sales manager  and executives at the contractors involved in the bidding process for the refurbishment contract at Grenfell Tower ",
        "date": "06242017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Arconic knowingly supplied flammable panels for use in tower: emails "
    },
    {
        "content": "LONDON  June 24 Six emails sent by and to an Arconic Inc sales manager raise questions about why the company supplied combustible cladding to a distributor for use at Grenfell Tower  despite publicly warning such panels were a fire risk for tall buildings.",
        "date": "06242017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "UPDATE 1-Arconic knowingly supplied flammable panels for use in tower -emails "
    },
    {
        "content": "LONDON  June 24 Six emails sent by and to an Arconic Inc sales manager raise questions about why the company supplied combustible cladding to a distributor for use at Grenfell Tower  despite publicly warning such panels were a fire risk for tall buildings.",
        "date": "06242017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "REFILE-Arconic knowingly supplied flammable panels for use in tower -emails "
    },
    {
        "content": "* Arconic completes early redemption of 6.50% bonds due 2018 and 6.75% notes due 2018 Source text for Eikon: Further company coverage:",
        "date": "06192017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic completes early redemption of 6.50% bonds due 2018 and 6.75% notes due 2018 "
    },
    {
        "content": "Specialty metals producer Arconic Inc said its shareholders had elected three of Elliott Management Corp's nominees to its board of directors  based on a preliminary vote count following the company's annual meeting on Thursday.",
        "date": "05252017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Arconic shareholders elect three Elliott nominees to board "
    },
    {
        "content": "May 25 Specialty metals producer Arconic Inc said its shareholders had elected three of Elliott Management Corp's nominees to its board of directors  based on a preliminary vote count following the company's annual meeting on Thursday.",
        "date": "05252017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "CORRECTED-Arconic shareholders elect three Elliott nominees to board "
    },
    {
        "content": "* Shareholders approved on an advisory basis  executive compensation programs and policies and resulting 2016 compensation",
        "date": "05252017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic shareholders reject proposal to declassify board "
    },
    {
        "content": "* On May 17  co and David Hess entered letter agreement governing terms of compensation arrangement for Hess in his role as interim CEO",
        "date": "05222017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic and David Hess enters letter agreement governing terms of compensation arrangement "
    },
    {
        "content": "* Arconic Inc - will redeem on June 19  2017 all of its outstanding 6.50% bonds due 2018 and 6.75% notes due 2018 between co  Bank of New York Mellon Trust Company",
        "date": "05182017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic Inc says will redeem all of its outstanding 6.50% bonds due 2018 and 6.75% notes due 2018 "
    },
    {
        "content": "Specialty metals company Arconic Inc  struck a deal with Elliott Management on Monday  ending a battle for control of the company's board that was days away from culminating in a shareholder vote.",
        "date": "05222017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Arconic reaches truce with Elliott after bruising fight "
    },
    {
        "content": "* Paulson & Co Inc takes share stake in Amazon of 5 500 shares - SEC filing",
        "date": "05152017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Paulson & Co Inc takes share stake in Amazon  Arconic - SEC filing "
    },
    {
        "content": "May 22 Specialty metals company Arconic Inc struck a deal with Elliott Management on Monday  ending a battle for control of the company's board that was days away from culminating in a shareholder vote.",
        "date": "05222017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "UPDATE 3-Arconic reaches truce with Elliott after bruising fight "
    },
    {
        "content": "* \"Welcomed recommendation by Institutional Shareholder Services\" for Arconic shareholders to vote on the blue proxy card Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "05152017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott Management says \"welcomed recommendation\" by ISS for Arconic shareholders to vote on blue proxy card "
    },
    {
        "content": "May 22 Specialty metals company Arconic Inc said it would allow Elliott Management Corp to nominate three members to the company's board  ending a proxy contest with the activist investor.",
        "date": "05222017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Arconic to end proxy contest with Elliott "
    },
    {
        "content": "May 15 Proxy advisory firm Institutional Shareholder Services Inc recommended on Monday that shareholders of specialty metals company Arconic Inc vote for two of activist investor Elliott's four board director nominees.",
        "date": "05152017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "ISS recommends Arconic shareholders back two Elliott board nominees "
    },
    {
        "content": "* Says company urges shareholders to vote \"for\" company's new slate of five director nominees and governance proposals Source text for Eikon: Further company coverage:",
        "date": "05092017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic board responds to Elliott "
    },
    {
        "content": "* Elliott Management says \"welcomed decision by Glass  Lewis & Co\" to recommend that all Arconic shareholders vote blue proxy card Source text for Eikon: Further company coverage:",
        "date": "05112017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott Management says \"welcomed decision by Glass  Lewis & Co\" to recommend that all Arconic shareholders vote blue proxy card "
    },
    {
        "content": "* Arconic inc says  board of directors  issued a letter to shareholders",
        "date": "05102017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic says Board issues letter to shareholders "
    },
    {
        "content": "* Arconic Inc says elliott will nominate Christopher L. Ayers  Elmer L. Doty and Patrice E. Merrin for election as directors at upcoming annual meeting",
        "date": "05222017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic and Elliott reach resolution to end proxy contest "
    },
    {
        "content": "May 15 Proxy advisory firm Institutional Shareholder Services Inc recommended on Monday that shareholders of specialty metals company Arconic Inc vote for two of activist investor Elliott's four board director nominees.",
        "date": "05152017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "UPDATE 1-ISS recommends Arconic shareholders back two Elliott board nominees "
    },
    {
        "content": "* Arconic nears deal to give Elliott Management board seats-CNBC  citing DJ",
        "date": "05222017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic nears deal to give Elliott Management board seats-CNBC  citing DJ "
    },
    {
        "content": "* Orbis Investment Management says sent a letter to Arconic's board of directors",
        "date": "05082017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Orbis Investment Management says sent a letter to Arconic's board of directors "
    },
    {
        "content": "* Elliott management releases new letter to arconic shareholders",
        "date": "05082017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott releases new letter to Arconic shareholders "
    },
    {
        "content": "* Arconic completes debt-for-equity exchange of Alcoa Corporation common stock; reduces $800 million of debt year to date",
        "date": "05052017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic says purchased remainder of debt held by Citigroup and Credit Suisse "
    },
    {
        "content": "Arconic Inc on Thursday nominated two directors for its board  as it gears up for a shareholder vote later this month that pits the specialty metals maker against activist investor Elliott Management in a fight for direction of the company and control over the board.",
        "date": "05042017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Arconic taps two directors ahead of shareholder vote "
    },
    {
        "content": "* USW says \"opposes efforts by hedge fund Elliott Management to select next CEO and nominate four new individuals to arconic board\" Source text for Eikon: Further company coverage:",
        "date": "05032017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-USW says opposes efforts by Elliott Management to select next CEO "
    },
    {
        "content": "May 4 Arconic Inc on Thursday nominated two directors for its board  as it gears up for a shareholder vote later this month that pits the specialty metals maker against activist investor Elliott Management in a fight for direction of the company and control over the board.",
        "date": "05042017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "UPDATE 2-Arconic taps two directors ahead of shareholder vote "
    },
    {
        "content": "* Arconic inc- arconic board issues new letter to shareholders",
        "date": "05042017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic board issues new letter to shareholders "
    },
    {
        "content": "May 4 Specialty metals maker Arconic Inc said on Thursday it nominated two director candidates for election to its board of at the company's 2017 annual meeting.",
        "date": "05042017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Arconic nominates two director candidates for election to board "
    },
    {
        "content": "April 26 Specialty metals maker Arconic Inc said on Wednesday it would exit its stake in Alcoa Corp through a debt-for-equity swap with two of its creditors.",
        "date": "04262017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Arconic sheds Alcoa stake through debt-for-equity swap "
    },
    {
        "content": "Tensions between Elliott Management and specialty metals maker Arconic Inc escalated on Tuesday  as the hedge fund spurned a truce offered by the company and urged shareholders to elect all four of its director nominees.",
        "date": "04252017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Elliott spurns offer  forging ahead with Arconic proxy fight "
    },
    {
        "content": "April 24 The shareholder battle between specialty metals maker Arconic Inc and Elliott Management took another turn on Monday after the company said the hedge fund has twice turned down an offer to add two of Elliott's nominees to its board.",
        "date": "04242017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "UPDATE 3-Arconic offers board director deal to Elliott after rebuffs "
    },
    {
        "content": "April 25 Tensions between Elliott Management and specialty metals maker Arconic Inc escalated on Tuesday  as the hedge fund spurned a truce offered by the company and urged shareholders to elect all four of its director nominees.",
        "date": "04252017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "UPDATE 1-Elliott spurns offer  forging ahead with Arconic proxy fight "
    },
    {
        "content": "* Postponing its 2017 annual meeting of shareholders from May 16  2017 to a date toward end of May 2017",
        "date": "04242017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic announces willingness to nominate two of Elliott's director nominees to join board "
    },
    {
        "content": "* Arconic announces debt-for-equity exchange for Alcoa Corporation common stock",
        "date": "04262017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic announces debt-for-equity exchange for Alcoa Corp common stock "
    },
    {
        "content": "April 25 Activist hedge fund Elliott Management on Tuesday issued a fresh letter to specialty metals maker Arconic Inc's shareholders  urging them to elect all of its four shareholder nominees to Arconic's board.",
        "date": "04252017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Elliott urges Arconic to elect all four shareholder nominees "
    },
    {
        "content": "April 24 U.S. specialty metals maker Arconic Inc said on Monday it was willing to nominate two of activist hedge fund Elliott Management's director nominees to its board  in a bid to resolve a long-drawn proxy contest.",
        "date": "04242017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Arconic says willing to nominate two Elliott directors to board "
    },
    {
        "content": "* \"Urges\" election of all four shareholder nominees to Arconic's board",
        "date": "04252017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott Management issues new letter to Arconic shareholders "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  April 21 (Fitch) Elliott Management's proxy battle with Arconic  Inc.  the parts manufacturer formed from the 2016 breakup of Alcoa  Inc.  could evolve into one of the most notable examples of shareholder activism this year  according to Fitch Ratings. U.S. corporations have become increasingly inclined to enter into amicable settlements with dissident investors in lieu of drawn-out proxy battles due to the time and costs invo",
        "date": "04212017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Fitch: Arconic/Elliot Proxy Battle Underscores Activism Trend "
    },
    {
        "content": "The letter by Arconic Inc  CEO Klaus Kleinfeld that led to his resignation earlier this week focused on the alleged behavior of Paul Singer  founder of $33 billion hedge fund Elliott Management  at the 2006 World Cup in Berlin.",
        "date": "04202017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Ex-Arconic CEO targeted Elliott founder's alleged World Cup antics "
    },
    {
        "content": "April 20 The letter by Arconic Inc CEO Klaus Kleinfeld that led to his resignation earlier this week focused on the alleged behavior of Paul Singer  founder of $33 billion hedge fund Elliott Management  at the 2006 World Cup in Berlin.",
        "date": "04202017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "UPDATE 1-Ex-Arconic CEO targeted Elliott founder's alleged World Cup antics "
    },
    {
        "content": "April 20 Activist hedge fund Elliott Management released the private letter written by Arconic Inc's former chief executive  Klaus Kleinfeld  which consequently led to his resignation  and their response to the letter and Arconic's statement on April 17.",
        "date": "04202017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Elliott releases private letters after Arconic CEO's departure "
    },
    {
        "content": " (This story corrects spelling of Elliott in headline; fixes typo in paragraph 3 in April 17 story.)",
        "date": "04182017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Arconic CEO quits over letter sent in 'poor judgment' to Elliott "
    },
    {
        "content": "April 17 Arconic Inc said on Monday Chief Executive Klaus Kleinfeld resigned after the U.S. specialty metals maker found he sent a letter in \"poor judgment\" to Elliott Management  with whom it is embroiled in a proxy war and which used the chance to again criticize the company's board.",
        "date": "04182017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "CORRECTED-UPDATE 4-Arconic CEO quits over letter sent in \"poor judgment\" to Elliott (April 17) "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Arconic's board can at least thank Klaus Kleinfeld for a brief reprieve. The chairman and chief executive of the Alcoa spinoff which makes specialty parts for cars and airplanes was shown the door for inappropriately contacting an activist shareholder. That saves Arconic's directors from having to fire him. But they will still have to answer for why they didn't do that long ago.",
        "date": "04172017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Arconic CEO's foolishness saves its board  for now "
    },
    {
        "content": "* Orbis expresses concerns regarding Arconic board leadership following abrupt resignation of Klaus Kleinfeld",
        "date": "04182017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Orbis expresses concerns regarding Arconic board leadership following abrupt resignation of Klaus Kleinfeld "
    },
    {
        "content": "* Arconic Inc - Patricia F. Russo  lead director  appointed to serve as interim chair",
        "date": "04172017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Klaus Kleinfeld steps down as chair and CEO of Arconic "
    },
    {
        "content": "April 17 U.S. specialty metals maker Arconic Inc's chief executive  Klaus Kleinfeld  has resigned  following attempts by activist hedge fund Elliott Management to overthrow the company's directors and top executives.",
        "date": "04172017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Arconic CEO resigns following pressure from Elliott "
    },
    {
        "content": "* Elliott Management Corp says sent a letter to Arconic's shareholders responding to certain statements made in company's recent communications Source text for Eikon: Further company coverage:",
        "date": "04102017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott issues new letter to Arconic shareholders "
    },
    {
        "content": "* Arconic announces divestiture of its Fusina  Italy Rolling Mill",
        "date": "04062017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic announces divestiture of its Fusina  Italy Rolling Mill "
    },
    {
        "content": "* Announces cash tender offers by citigroup global markets Credit Suisse Securities (USA) LLC for up to $1 billion of co's outstanding debt securities",
        "date": "04052017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic announces cash tender offers by Citigroup Global Markets Credit Suisse Securities (USA) "
    },
    {
        "content": "* Arconic board issues new letter to shareholders; company urges shareholders to vote \"for\" company's nominees and governance proposals Source text for Eikon: Further company coverage:",
        "date": "04052017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic board issues new letter to shareholders "
    },
    {
        "content": "* Elliott Management Corp sends letter to Arconic Inc board  management in response to company's \"refusal to comply with information request\"  Source text for Eikon:",
        "date": "03272017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott Management sends letter to Arconic board in response to Co's \"refusal to comply with information request\" "
    },
    {
        "content": "* Arconic Inc - \"company urges shareholders to vote \"for\" Arconic's highly qualified director nominees and governance proposals on white proxy card\"",
        "date": "03272017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic urges shareholders to vote for co's director nominees "
    },
    {
        "content": "WASHINGTON  March 17 Arconic Inc said on Friday it had dropped its request for a $259 million loan from the U.S. Energy Department  a day after the Trump administration proposed killing the program aimed at boosting manufacturing of advanced technology vehicles.",
        "date": "03172017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Arconic drops request for $259 million U.S. energy fund loan "
    },
    {
        "content": "* says sent a letter to Arconic board for an explanation on a recently disclosed transaction  Source text for Eikon:  Further company coverage:",
        "date": "03162017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott Management says sent letter to Arconic board for explanation on a recently disclosed transaction "
    },
    {
        "content": "March 20 Hedge fund Elliott Management Corp  which is in the throes of a proxy battle with Arconic Inc   demanded on Monday an independent review of the company's voting agreement with private equity firm Oak Hill Capital Partners.",
        "date": "03202017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Elliott demands review of Arconic's voting deal with Oak Hill "
    },
    {
        "content": "SAO PAULO  March 20 Cia de Locação das Américas SA agreed to acquire smaller rival Auto Ricci SA in cash and stock for about 176 million reais ($57 million) on Monday  creating Brazil's largest fleet rental company  according to a securities filing and a person with knowledge of the situation.",
        "date": "03202017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Locamerica buys Ricci to create Brazil's No. 1 fleet rental firm "
    },
    {
        "content": "* Elliott Management Corporation sends a letter to Arconic board demanding a \"full  fair and independent accounting of secret vote-buying agreement\"  Source text for Eikon: Further company coverage:",
        "date": "03202017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott sends a letter to Arconic's board demanding a \"full  fair and independent accounting of secret vote-buying agreement\" "
    },
    {
        "content": "* Elliott International reports 13.2 percent stake in Arconic   as of March 10  2017 - SEC filing  Source text for Eikon: Further company coverage:",
        "date": "03102017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott International reports 13.2 pct stake in Arconic "
    },
    {
        "content": "* Arconic waives limited voting commitment contained in 2016 settlement with Oak Hill Capital",
        "date": "03202017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic waives limited voting commitment contained in 2016 settlement with Oak Hill Capital "
    },
    {
        "content": " (The March 8 story was refiled to correct paragraph 7 to show that Lawson not a nominee; fixes paragraph 9 to show Lawson and Elliott did not see violation of non-compete agreement)",
        "date": "03102017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Spirit AeroSystems says ex-CEO breached retirement deal: Elliott filing "
    },
    {
        "content": "* Announced a multi-year supply deal with Toyota North America; co supplying aluminum to Toyota for its all-new LEXUS RX  Source text for Eikon:  Further company coverage:",
        "date": "03202017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic announces multi-year deal with Toyota "
    },
    {
        "content": "March 8 Elliott Management reported in a regulatory filing that Spirit AeroSystems Holdings has said its former chief executive officer  Larry Lawson  has breached his retirement contract by consulting for the hedge fund during its proxy fight with Arconic Inc.",
        "date": "03102017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "CORRECTED-Spirit AeroSystems says ex-CEO breached retirement deal -Elliott filing "
    },
    {
        "content": "Investment manager Orbis Investment Management Ltd on Friday disclosed a stake of about 2.8 percent in U.S. specialty metals maker Arconic Inc   and said it intends to support hedge fund Elliott Management Corp in its proxy battle against the company.",
        "date": "03032017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Orbis discloses 2.8 percent stake in Arconic  plans to back Elliott "
    },
    {
        "content": "March 3 Investment manager Orbis Investment Management Ltd on Friday disclosed a stake of about 2.8 percent in U.S. specialty metals maker Arconic Inc  and said it intends to support hedge fund Elliott Management Corp in its proxy battle against the company.",
        "date": "03032017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Orbis discloses 2.8 pct stake in Arconic  plans to back Elliott "
    },
    {
        "content": "March 2 U.S. specialty metals maker Arconic Inc  said on Thursday it appointed former United Technologies Corp executive David Hess as an independent director on its board amid a proxy battle with hedge fund Elliott Management Corp.",
        "date": "03022017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Arconic names former UTC exec to board amid proxy fight with Elliott "
    },
    {
        "content": "* Orbis Investment Management says it intends to vote in favour of Elliott Associates' slate of independent nominees to join board of Arconic Inc",
        "date": "03032017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Orbis Investment says to vote in favour of Elliott's slate of nominees for Arconic board "
    },
    {
        "content": "March 2 U.S. specialty metals maker Arconic Inc  said on Thursday it appointed former United Technologies Corp executive David Hess as an independent director on its board amid a proxy battle with hedge fund Elliott Management Corp.",
        "date": "03022017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "UPDATE 2-Arconic names former UTC exec to board amid proxy fight with Elliott "
    },
    {
        "content": "Feb 23 Hedge fund Elliott Management Corp said on Thursday it had raised its stake in specialty metals maker Arconic Inc to about 13 percent and stepped up pressure for the ouster of Chief Executive Klaus Kleinfeld.",
        "date": "02242017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "CORRECTED-Elliott raises stake in Arconic  pushes harder for CEO ouster (Feb 23) "
    },
    {
        "content": "Hedge fund Elliott Management Corp said on Thursday it had raised its stake in specialty metals maker Arconic Inc to about 13 percent and stepped up pressure for the ouster of Chief Executive Klaus Kleinfeld.",
        "date": "02232017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Elliott raises stake in Arconic  pushes harder for CEO ouster "
    },
    {
        "content": "* Announces appointment of David P Hess to board of directors",
        "date": "03022017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic announces appointment of David Hess to board "
    },
    {
        "content": "TOKYO  Feb 20 A major aluminium producer has made an indicative offer of a premium of $125 per tonne to Japanese buyers for April-June primary metal shipments  up 32 percent from the last quarter  three sources directly involved in pricing talks said on Monday.",
        "date": "02202017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Aluminium producer seeks Q2 premium of $125/T from Japan buyers -sources "
    },
    {
        "content": "* Elliott Management Corp sent letter to Arconic board reiterating its recommendation that board consider hiring Larry Lawson as next CEO",
        "date": "02232017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott Management sent letter to Arconic board reiterating to consider hiring Larry Lawson as next CEO "
    },
    {
        "content": "* \"Board has taken Elliott's criticisms very seriously\"  has engaged in thorough review of Arconic's businesses  strategy and performance",
        "date": "03022017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Independent directors of Arconic board say convinced that Co has \"right strategy\" "
    },
    {
        "content": "* Alcoa Corp - company to consolidate number of business units to reduce complexity and lower costs",
        "date": "03022017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Alcoa corporation streamlines company structure "
    },
    {
        "content": "* Elliott Associates LP reports open market purchase of 24 000 shares of Arconic Inc's common stock at average price of $29.48/share on Feb 13 - SEC filing",
        "date": "02142017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott Associates reports open market purchase of Arconic's shares "
    },
    {
        "content": "* Elliott International reports open market purchase of 289 000 shares of Arconic Inc's common stock on Feb 15 at $29.27 per share - SEC filing  Source text:L (http://bit.ly/2lQoKLc) Further company coverage:",
        "date": "02152017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott International buys 289 000 shares of Arconic's common stock on Feb 15 "
    },
    {
        "content": "Arconic Inc   which is under pressure from hedge fund Elliott Management  said it sold nearly two-thirds of its 19.9 percent stake in Alcoa Corp  for about $890 million.",
        "date": "02152017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Arconic sells 60 percent stake in Alcoa for $890 million "
    },
    {
        "content": "Feb 15 Arconic Inc  which is under pressure from hedge fund Elliott Management  said it sold nearly two-thirds of its 19.9 percent stake in Alcoa Corp for about $890 million.",
        "date": "02152017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "UPDATE 1-Arconic sells 60 pct stake in Alcoa for $890 mln "
    },
    {
        "content": "* Says monetized more than 60 percent of 36.3 million shares it retained in Alcoa Corporation",
        "date": "02152017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic says monetized more than 60 pct of 36.3 mln shares it retained in Alcoa Corp "
    },
    {
        "content": "Feb 15 Arconic Inc said on Wednesday it had sold more than 60 percent of its stake in Alcoa Corp  about $890 million.",
        "date": "02152017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Arconic sells 60 pct of its stake in Alcoa for $890 mln "
    },
    {
        "content": "* Confirms 2017 and 2019 targets - SEC Filing  Source text - http://bit.ly/2kng6Tx  Further company coverage:",
        "date": "02082017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic confirms 2017 and 2019 targets - SEC Filing "
    },
    {
        "content": "* Elliott International L.P. reports open market purchase of 34 000 shares of Arconic's common stock at $26.3554  per share on Feb 7 - SEC Filing  Source text: [http://bit.ly/2kjJSrW] Further company coverage:",
        "date": "02072017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott International LP reports open market purchase of 34 000 shares of Arconic's common stock at $26.3554 per share on Feb 7 - SEC Filing "
    },
    {
        "content": "* Elliott Associates  L.P. reports open market purchase of 16 000 Arconic Inc's common stock at $26.3554 per share on Feb 7 - SEC Filing  Source text: [http://bit.ly/2llw68B] Further company coverage:",
        "date": "02072017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott Associates LP reports open market purchase of 16 000 Arconic's common stock at $26.3554 per share on Feb 7 - SEC Filing "
    },
    {
        "content": "Feb 7 Arconic Inc. raised questions on Tuesday about the analysis behind Elliott Management's proxy campaign  further escalating the battle between the specialty metals maker and its largest shareholder.",
        "date": "02072017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Arconic challenges Elliott's revised analysis in proxy fight "
    },
    {
        "content": "* Elliott Management Corporation - Manages funds that collectively beneficially own greater than 12 percent economic interest in Arconic Inc",
        "date": "02072017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott management sends letter to Arconic's board "
    },
    {
        "content": "* Arconic comments on Elliott Management's multiple restatements of its own financial analysis",
        "date": "02072017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic comments on Elliott Management's multiple restatements of its own financial analysis "
    },
    {
        "content": "Feb 7 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "02072017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "PRESS DIGEST - Wall Street Journal - Feb 7 "
    },
    {
        "content": "* Elliott Associates  L.P. reports open market purchase of 24 000 shares of Arconic Inc's common stock at $25.8813 per share on Feb 6- SEC Filing  Source text: [http://bit.ly/2kLWsTW] Further company coverage:",
        "date": "02072017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott Associates LP reports open market purchase of 24 000 shares of Arconic's common stock at $25.88 per share on Feb 6- SEC Filing "
    },
    {
        "content": "A large Arconic Inc.  shareholder said on Monday it supports the effort by hedge fund Elliott Management to shake-up the company's board and urged the firm to avoid a proxy fight.",
        "date": "02062017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Arconic shareholder throws support behind Elliott's directors "
    },
    {
        "content": "Feb 6 A large Arconic Inc. shareholder said on Monday it supports the effort by hedge fund Elliott Management to shake-up the company's board and urged the firm to avoid a proxy fight.",
        "date": "02062017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "UPDATE 1-Arconic shareholder throws support behind Elliott's directors "
    },
    {
        "content": "NEW YORK Arconic Inc  Chief Executive Officer Klaus Kleinfeld  under pressure from hedge fund Elliott Management  on Wednesday defended the metal maker's performance since spinning off from aluminum producer Alcoa Corp .",
        "date": "02012017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Arconic digs in heels against Elliott as proxy fight begins "
    },
    {
        "content": "* Arconic - independent directors of co \"reinforced unanimous support\" of co's strategic direction under continued leadership of chairman  CEO Kleinfeld  Source text for Eikon: (http://bit.ly/2kdhzLV) Further company coverage:",
        "date": "02062017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic says directors \"reinforced unanimous support\" of co's strategic direction under CEO Kleinfeld "
    },
    {
        "content": "NEW YORK  Feb 1 Arconic Inc Chief Executive Officer Klaus Kleinfeld  under pressure from hedge fund Elliott Management  on Wednesday defended the metal maker's performance since spinning off from aluminum producer Alcoa Corp .",
        "date": "02012017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "UPDATE 1-Arconic digs in heels against Elliott as proxy fight begins "
    },
    {
        "content": "Some of Arconic Inc's biggest shareholders are pressing the company to remove Chief Executive Klaus Kleinfeld  the Wall Street Journal reported on Monday  citing people familiar with the matter.",
        "date": "01302017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Investors urge Arconic to oust CEO Klaus Kleinfeld: WSJ "
    },
    {
        "content": "CHICAGO Activist investor Elliott Management Corp on Tuesday launched a proxy fight against Arconic Inc   which makes engineered metal parts for the aerospace  automotive and other industries  campaigning for the ouster of the company's chief executive and saying it had a plan to boost the company's performance.",
        "date": "01312017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Elliott starts proxy fight with Arconic as it posts fourth-quarter loss "
    },
    {
        "content": "* Elliott Associates LP reports purchase of 256 000 shares of Arconic Inc's common stock between Jan 25-27 - SEC filing  Source text: (http://bit.ly/2kbomsn) Further company coverage:",
        "date": "01272017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott Associates buys 256 000 shares of Arconic's common stock between Jan 25-27 "
    },
    {
        "content": "NEW YORK  Feb 1 Arconic Inc Chief Executive Officer Klaus Kleinfeld  under pressure from hedge fund Elliott Management  on Wednesday defended the metal maker's performance since spinning off from aluminum producer Alcoa Corp AA.N>.",
        "date": "02012017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Arconic CEO defends performance as Elliott ramps up pressure "
    },
    {
        "content": "Jan 30 Some of Arconic Inc's biggest shareholders are pressing the company to remove Chief Executive Klaus Kleinfeld  the Wall Street Journal reported on Monday  citing people familiar with the matter.",
        "date": "01302017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "UPDATE 2-Investors urge Arconic to oust CEO Klaus Kleinfeld -WSJ "
    },
    {
        "content": "NEW YORK Elliott Management launched a proxy fight against metals maker Arconic Inc.  nominating five directors on Tuesday to serve on the company's board.",
        "date": "01312017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Elliott nominates 5 directors in Arconic proxy fight "
    },
    {
        "content": "* Elliott International LP reports purchase of 544 000 shares of Arconic Inc's common stock between Jan 25-27 - SEC filing  Source text: (http://bit.ly/2kcxduf) Further company coverage:",
        "date": "01272017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott International buys 544 000 shares of Arconic's common stock between Jan 25-27 "
    },
    {
        "content": "* Says confirmed that its board of directors unanimously supports Klaus Kleinfeld as company's chairman and chief executive officer  Source text for Eikon:  Further company coverage:",
        "date": "02012017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic confirms its board \"unanimously supports\" Klaus Kleinfeld as chairman and CEO "
    },
    {
        "content": "* Elliott Associates and affiliates have combined economic exposure in Arconic Inc of about 11.9 percent of shares of common stock as of Jan. 23",
        "date": "01252017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott associates have combined economic exposure in Arconic Inc of about 11.9 pct of shares "
    },
    {
        "content": "Jan 30 Arconic Inc said on Monday that Chief Executive Officer Klaus Kleinfeld \"has the unanimous support\" of its board  responding to a report of pressure from some of the Alcoa Corp spinoff's biggest shareholders for a leadership change.",
        "date": "01302017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Arconic says CEO Kleinfeld 'has unanimous support' of its board "
    },
    {
        "content": "NEW YORK  Jan 31 Elliott Management launched a proxy fight against metals maker Arconic Inc.  nominating five directors on Tuesday to serve on the company's board.",
        "date": "01312017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "UPDATE 1-Elliott nominates 5 directors in Arconic proxy fight "
    },
    {
        "content": "CHICAGO  Jan 31 Activist investor Elliott Management Corp on Tuesday launched a proxy fight against Arconic Inc  which makes engineered metal parts for the aerospace  automotive and other industries  campaigning for the ouster of the company's chief executive and saying it had a plan to boost the company's performance.",
        "date": "01312017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "UPDATE 2-Elliott starts proxy fight with Arconic as it posts Q4 loss "
    },
    {
        "content": "* Matthew E. Garth joins Minerals Technologies Inc as chief financial officer",
        "date": "01232017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Matthew Garth joins Minerals Technologies as CFO "
    },
    {
        "content": "SYDNEY  Jan 20 AGL Energy Ltd said on Friday it has agreed to supply electricity to an Australian smelter owned Alcoa that was hit by blackouts late last year.",
        "date": "01192017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "AGL and Alcoa agree supply deal as part of smelter rescue package "
    },
    {
        "content": "SYDNEY Plans to provide government support to keep open a 30-year-old aluminum smelter in Australia owned by Alcoa  have made \"progress\"  parties involved in talks said on Monday without giving details.",
        "date": "01162017",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "Australia government  Alcoa say making progress in aluminum smelter talks "
    },
    {
        "content": "Jan 30 Arconic Inc's several biggest shareholders are pressing the company to remove Chief Executive Klaus Kleinfeld  the Wall Street Journal reported on Monday  citing people familiar with the matter.",
        "date": "01302017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Several investors urge Arconic to oust CEO Klaus Kleinfeld - WSJ "
    },
    {
        "content": "NEW YORK  Jan 31 Arconic Inc. is facing a proxy fight from its largest shareholder after Elliott Management on Tuesday nominated five directors to serve on the company's board.",
        "date": "01312017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Elliott nominates 5 directors in proxy fight aimed at Arconic "
    },
    {
        "content": "* Several of Arconic's largest investors are pressing co to oust CEO Klaus Kleinfeld after Alcoa separation - CNBC  citing DJ   Source text: http://bit.ly/2jLaLas",
        "date": "01302017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Several of Arconic's largest investors are pressing co to oust CEO Kleinfeld after Alcoa separation - CNBC "
    },
    {
        "content": "* Q4 adjusted earnings per share $0.12 from continuing operations excluding items",
        "date": "01312017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic reports Q4 loss per share $2.88 "
    },
    {
        "content": "CHICAGO  Jan 31 Arconic Inc <ARNC.N  which makes engineered metal parts for the aerospace  automotive and other industries  on Tuesday reported a quarterly net loss that was driven by charges related to the company's separation from Alcoa Corp last November.",
        "date": "01312017",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Arconic posts loss driven by separation costs from Alcoa "
    },
    {
        "content": "* Negotiations to continue through December   (Recasts with other producers' offers and buyers' comments)",
        "date": "11252016",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "UPDATE 1-Aluminium producers seek Q1 premium of $95-$110/T from Japanese buyers -sources "
    },
    {
        "content": "TOKYO  Nov 25 A major aluminium producer has offered Japanese buyers a premium of $95 per tonne for primary metal shipments in the January to March period  up 27 percent from the previous quarter  four sources directly involved in pricing talks said on Friday.",
        "date": "11252016",
        "name": "Arconic Inc",
        "news_type": "normal",
        "symbol": "ARNC",
        "title": "Aluminium producer seeks Q1 premium of $95/T from Japan buyers -sources "
    },
    {
        "content": "* Elliott  Elliott International and EICA - Collectively have combined economic exposure in Arconic Inc of about 10 percent of the shares of common stock outstanding",
        "date": "11152016",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott and affiliates raise combined economic exposure in Arconic to about 10 pct "
    },
    {
        "content": "* Arconic inc - announced a multi-year contract with airbus valued at approximately $1 billion",
        "date": "11072016",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Arconic wins $1 bln multi-year contract with Airbus "
    },
    {
        "content": "Nov 4 Elliott Associates lp Reports Combined Economic Exposure Of 9.0 Pct In Arconic Inc -",
        "date": "11042016",
        "name": "Arconic Inc",
        "news_type": "topStory",
        "symbol": "ARNC",
        "title": "BRIEF-Elliott Associates reports combined economic exposure of 9 pct in Arconic "
    }
]