[
    {
        "content": "* Arris International Plc - ‍on October 12  2017  Broadcom  Brocade and Arris withdrew and re-filed their joint voluntary notice to CFIUS",
        "date": "10162017",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Arris International  Broadcom and Brocade withdraw and re-file joint voluntary notice to CFIUS "
    },
    {
        "content": "* Arris statement re: Ruckus acquisition  following Broadcom's CFIUS refiling",
        "date": "10032017",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Arris statement re: Ruckus acquisition  following Broadcom's CFIUS refiling "
    },
    {
        "content": "* Eminence Capital  LP reports 5.3 percent passive stake in Arris International Plc as of Sept 12  2017 - SEC Filing Source text: [http://bit.ly/2xu1hrd] Further company coverage:",
        "date": "09222017",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Eminence Capital LP reports 5.3 pct passive stake in Arris International Plc as of Sept 12 - SEC Filing "
    },
    {
        "content": "* FINANCIAL TERMS OF AGREEMENT WERE NOT DISCLOSED Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "07182017",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Kudelski and Arris sign patent license agreement "
    },
    {
        "content": "* On April 26  2017  Arris International Plc and certain subsidiaries entered into second amendment to its credit facility",
        "date": "04282017",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Arris International says co and certain units entered into second amendment to its credit facility "
    },
    {
        "content": "WASHINGTON  April 12 The U.S. International Trade Commission said on Wednesday it has launched a patent infringement investigation of television set-top boxes and other components that Arris International supplies to Comcast Corp and DirecTV for their Xfinity and Genie customers.",
        "date": "04122017",
        "name": "ARRIS International plc",
        "news_type": "normal",
        "symbol": "ARRS",
        "title": "U.S. ITC to investigate Sony patent infringement claims against Arris "
    },
    {
        "content": "* Arris International Plc says executive chairman Robert J. Stanzione's total compensation in 2016 was $9.7 million versus $5.7 million in 2015 - SEC filing Source text for Eikon: Further company coverage:",
        "date": "04052017",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Arris International Plc says executive chairman Robert J. Stanzione's total compensation in 2016 was $9.7 mln "
    },
    {
        "content": "* Arris announces preliminary and unaudited fourth quarter and full year 2016 results",
        "date": "02222017",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Arris announces preliminary and unaudited fourth quarter and full year 2016 results "
    },
    {
        "content": "* Arris to acquire Ruckus Wireless and ICX switch business for $800 million in cash",
        "date": "02222017",
        "name": "ARRIS International plc",
        "news_type": "normal",
        "symbol": "ARRS",
        "title": "BRIEF-Arris to acquire Ruckus Wireless and ICX switch business for $800 million in cash "
    },
    {
        "content": "Feb 21 Set-top box maker Arris International Plc  is nearing a deal to acquire Brocade Communications Systems Inc's networking equipment business for roughly $1 billion  people familiar with the matter said on Tuesday.",
        "date": "02222017",
        "name": "ARRIS International plc",
        "news_type": "normal",
        "symbol": "ARRS",
        "title": "Arris nears deal to acquire Brocade's networking business -sources "
    },
    {
        "content": "* Greenlight Capital dissolves share stake in Aecom - SEC filing",
        "date": "02142017",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Greenlight Capital dissolves share stake in Aecom  Arris International  Geo Group "
    },
    {
        "content": "Set-top box maker Arris International Plc  is in talks to acquire Brocade Communications Systems Inc's  networking equipment business for as much as $1 billion  according to people familiar with the matter.",
        "date": "01132017",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "Arris in bid for Brocade network unit: sources "
    },
    {
        "content": "Jan 13 Set-top box maker Arris International Plc  is in talks to acquire Brocade Communications Systems Inc's networking equipment business for as much as $1 billion  according to people familiar with the matter.",
        "date": "01132017",
        "name": "ARRIS International plc",
        "news_type": "normal",
        "symbol": "ARRS",
        "title": "Arris in bid for Brocade network unit -sources "
    },
    {
        "content": "* Appoints Bruce Mcclelland As New Ceo-Bob Stanzione appointed executive chairman",
        "date": "08232016",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Arris appoints Bruce Mcclelland as new ceo "
    },
    {
        "content": "* Omega Advisors takes 1.49 million shares stake in Nabors Industries Ltd - SEC filing",
        "date": "08152016",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Omega Advisors dissolves share stake in Apple  raises share stake in Allergan "
    },
    {
        "content": "* Arris announces preliminary and unaudited second quarter 2016 results",
        "date": "07272016",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Arris posts Q2 adj. earnings per share $0.84 "
    },
    {
        "content": "* Says \u007freconfirmed its previously issued Q1 2016 guidance ranges for revenues and earnings per share\u007f",
        "date": "03162016",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Arris International Plc \u007freconfirms Q1 2016 guidance "
    },
    {
        "content": "* Announced that DoJ closed its investigation  without condition  under Hart-Scott-Rodino Antitrust Improvements Act of 1976 for Pace deal  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "12022015",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-DOJ closes investigation of Pace deal under U.S. Hart-Scott-Rodino Act "
    },
    {
        "content": "* Acquisition of Pace has received preliminary approval  without restrictions  from Brazil's competition authority CADE  Source text for Eikon:  Further company coverage:",
        "date": "12032015",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Arris' Pace acquisition gets preliminary approval from Brazil's competition authority "
    },
    {
        "content": "* Recommended combination with Arris Group  continues to progress in-line with expectations and  subject to satisfaction  or where relevant  waiver  of all relevant conditions  transaction is expected to close in late 2015",
        "date": "09182015",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Pace says Arris deal on track  cuts 2015 revenue outlook "
    },
    {
        "content": "* Continue to expect Pace acquisition to close in late 2015  Source text for Eikon:  Further company coverage: [PIC.L ARRS.O]",
        "date": "09162015",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Arris continues to expect Pace deal to close in late 2015 "
    },
    {
        "content": "* Solid H1 2015: gross margin up 1.6 ppt to 23.2 pct  operating margin up 1.6 ppt to 10.9 pct and adjusted basic EPS up 11.4 pct to 28.4c",
        "date": "07282015",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Set-top box maker Pace sees FY revenue between $2.65 bln to $2.72 bln "
    },
    {
        "content": "* Expect Pace Plc acquisition to help counter some of these industry conditions as a result of anticipated synergies and a more diversified customer base and product portfolio",
        "date": "07132015",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Arris continues to expect closing of Pace deal in Q4 of 2015 "
    },
    {
        "content": "Network equipment maker Cisco Systems Inc is set to launch a converged cable access platform  enabling cable operators offer download speeds of one gigabit a second or more.",
        "date": "05052015",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "Cisco set to boost Internet speed for cable companies "
    },
    {
        "content": "* Says revenue will be stronger in H2 2015 than H1 2015  similar to 2014",
        "date": "04232015",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "BRIEF-Pace says Arris Group offer \"great fit for both\" "
    },
    {
        "content": "Network gear maker Arris Group Inc said it would buy British set-top box maker Pace Plc in a $2.1 billion cash-and-stock deal to expand its operations outside North America.",
        "date": "04222015",
        "name": "ARRIS International plc",
        "news_type": "topStory",
        "symbol": "ARRS",
        "title": "Arris to buy British set-top box maker Pace in $2.1 billion deal "
    },
    {
        "content": "April 22 Network gear maker Arris Group Inc  said it would buy British set-top box maker Pace Plc  in a $2.1 billion cash-and-stock deal to expand its operations outside North America.",
        "date": "04222015",
        "name": "ARRIS International plc",
        "news_type": "normal",
        "symbol": "ARRS",
        "title": "UPDATE 2-Arris to buy British set-top box maker Pace in $2.1 bln deal "
    },
    {
        "content": "April 22 Communications equipment maker Arris Group Inc said it would buy British set-top box maker Pace Plc in a $2.1 billion stock-and-cash deal.",
        "date": "04222015",
        "name": "ARRIS International plc",
        "news_type": "normal",
        "symbol": "ARRS",
        "title": "Arris to buy set-top box maker Pace in $2.1 bln deal "
    }
]