[
    {
        "content": "* Ashland Global Holdings Inc qtrly preliminary sales grew 17 percent year-over-year to $880 million",
        "date": "11062017",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Ashland Global sees Q1 2018 adjusted earnings per share $0.35 to $0.45 "
    },
    {
        "content": "* Ashland Global - manufacturing facilities in Texas City  Texas  Marl  Germany  resumed operations after shutting down last month due to Hurricane Harvey",
        "date": "09182017",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Ashland Global manufacturing facilities resumed operations after shutting due to hurricane "
    },
    {
        "content": "* Ashland Global - provided update on impact to operations result of fire at manufacturing facility in germany  led to shutdown of production operations on Aug. 10",
        "date": "08232017",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Ashland Global provides update on impact to operations result of fire at manufacturing facility in Germany "
    },
    {
        "content": "* Declared a force majeure in europe on 1.4 butanediol (BDO)  tetrahydrofuran (THF) and formaldehyde",
        "date": "08112017",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Ashland Global Holdings declared force majeure in Europe on 1.4 BDO  THF and formaldehyde "
    },
    {
        "content": "* On July 19  Susan l. Main and Kathleen Wilson-Thompson were elected to serve on board of directors",
        "date": "07192017",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Ashland Global elects Susan Main  Kathleen wilson-Thompson to board "
    },
    {
        "content": "* On May 19  2017  co's unit entered into amendment no. 1 to credit agreement - SEC filing",
        "date": "05222017",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Ashland Global Unit enters into amendment no. 1 to credit agreement "
    },
    {
        "content": "* Ashland Global Holdings Inc - Ashland LLC entered into a credit agreement with lenders",
        "date": "05182017",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Ashland LLC unit of Ashland Global Holdings entered into credit agreement with lenders "
    },
    {
        "content": "* Ashland Global Holdings says board has declared a quarterly cash dividend of 22.5 cents per share on company's common stock - SEC filing",
        "date": "05172017",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Ashland Global's board declares cash dividend of 22.5 cents "
    },
    {
        "content": "BRUSSELS  May 12 U.S. chemicals group Reichhold secured EU antitrust approval on Friday for its proposed buy of Italian polymers maker Polynt after pledging to divest a facility in France to U.S. company Ashland Global Holdings.",
        "date": "05122017",
        "name": "Ashland Global Holdings Inc",
        "news_type": "normal",
        "symbol": "ASH",
        "title": "Reichhold gains conditional EU approval for Polynt buy "
    },
    {
        "content": "* Q4 adjusted earnings per share $1.52 from continuing operations",
        "date": "11082016",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Ashland Global Holdings reports Q4 loss per share of $4.46 "
    },
    {
        "content": "* Ashland announces hiring of Sara Stensrud as Chief People and Communications Officer of Valvoline  Source text for Eikon:  Further company coverage:",
        "date": "08302016",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Ashland announces hiring Chief People & Communications Officer of Valvoline "
    },
    {
        "content": "* Ashland Inc. Reports preliminary financial results for third quarter of fiscal 2016",
        "date": "07262016",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Ashland reports prelim Q3 shr $1.95 from cont ops  expects Q4 sales of $520-$540 mln "
    },
    {
        "content": "* Says  Dempsey Previously Served In Various Executive Positions With Abbott Laboratories From 1982   Source text for Eikon:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07202016",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Ashland appoints William Dempsey to board of directors "
    },
    {
        "content": "* Ashland Inc. Announces pricing of senior notes offering by valvoline finco two llc",
        "date": "07132016",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Ashland announces pricing of senior notes offering by Valvoline Finco Two LLc "
    },
    {
        "content": "* Provides update on its planned separation of Valvoline; Announces offering of senior notes by Valvoline Finco Two LLC",
        "date": "07122016",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Ashland provides update on its planned separation of Valvoline "
    },
    {
        "content": "* Ashland inc. Provides update on its planned separation of valvoline",
        "date": "07112016",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Ashland provides update on planned separation of Valvoline "
    },
    {
        "content": "* Omega Advisors Dissolves Class A Shares Stake In Terraform Global",
        "date": "05162016",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Omega Advisors dissolves share stake in Amazon  Citigroup "
    },
    {
        "content": "* Ashland inc. Reports preliminary financial results for q2 of fiscal 2016",
        "date": "04262016",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Ashland sees q2 earnings from continuing operations equal $1.38/share "
    },
    {
        "content": "* Ashland announced that separation process and timeline remain on track",
        "date": "04132016",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-Ashland Inc provides update on its planned separation of Valvoline "
    },
    {
        "content": "* IMCD and Ashland announce extension of distribution agreement to Turkey  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "03232016",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-IMCD Group and Ashland announce extension of distribution agreement to Turkey "
    },
    {
        "content": "Shares of Ashland Inc  look cheap and investors could reap major benefits from a planned spinoff of its Valvoline engine lubricants unit  according to an article in the latest edition of Barron's.",
        "date": "03132016",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "Ashland shares could benefit amid Valvoline spinoff: Barron's "
    },
    {
        "content": "March 13 Shares of Ashland Inc look cheap and investors could reap major benefits from a planned spinoff of its Valvoline engine lubricants unit  according to an article in the latest edition of Barron's.",
        "date": "03132016",
        "name": "Ashland Global Holdings Inc",
        "news_type": "normal",
        "symbol": "ASH",
        "title": "Ashland shares could benefit amid Valvoline spinoff - Barron's "
    },
    {
        "content": "One of Ashland Inc's  largest shareholders is urging the chemical maker to halt plans to spin off its Valvoline business and instead seek a buyer for its specialty chemicals unit  according to a slide presentation seen by Reuters.",
        "date": "01202016",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "Investor urges Ashland to halt Valvoline spinoff  sell specialty arm "
    },
    {
        "content": "Jan 20 One of Ashland Inc's largest shareholders is urging the chemical maker to halt plans to spin off its Valvoline business and instead seek a buyer for its specialty chemicals unit  according to a slide presentation seen by Reuters.",
        "date": "01202016",
        "name": "Ashland Global Holdings Inc",
        "news_type": "normal",
        "symbol": "ASH",
        "title": "UPDATE 2-Investor urges Ashland to halt Valvoline spinoff  sell specialty arm "
    },
    {
        "content": "Jan 20 One of Ashland Inc's largest shareholders is urging the chemical maker to halt plans to spin off its Valvoline business and instead seek a buyer for its specialty chemicals unit  according to a slide presentation obtained by Reuters.",
        "date": "01202016",
        "name": "Ashland Global Holdings Inc",
        "news_type": "normal",
        "symbol": "ASH",
        "title": "CORRECTED-UPDATE 1-Ashland investor says halt Valvoline spinoff  sell specialty arm "
    },
    {
        "content": "Jan 19 Elmrox Investment Group LLC  one of the largest shareholders of Ashland Inc  is urging the chemical maker to halt plans to spin off its Valvoline business and instead seek a buyer for its specialty-chemicals unit  the Wall Street Journal reported  citing a presentation it reviewed.",
        "date": "01202016",
        "name": "Ashland Global Holdings Inc",
        "news_type": "normal",
        "symbol": "ASH",
        "title": "Shareholder urges Ashland to halt Valvoline spinoff -WSJ "
    },
    {
        "content": "Sept 22 Ashland Inc said it will spin off its engine lubricants unit into a publicly traded company  Valvoline  as it sheds assets that are not part of its core specialty chemicals business.",
        "date": "09222015",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "UPDATE 1-Chemicals maker Ashland to spin off engine lubricants unit "
    },
    {
        "content": "Sept 22 Specialty chemicals maker Ashland Inc  said it will spin off its engine lubricants unit into a publicly traded company  Valvoline  to focus on its higher margin businesses.",
        "date": "09222015",
        "name": "Ashland Global Holdings Inc",
        "news_type": "normal",
        "symbol": "ASH",
        "title": "Chemicals maker Ashland to spin off engine lubricants unit "
    },
    {
        "content": "* Sells Zeta Fraction biofunctional technology to Ashland Inc",
        "date": "07022015",
        "name": "Ashland Global Holdings Inc",
        "news_type": "topStory",
        "symbol": "ASH",
        "title": "BRIEF-AkzoNobel to sell Zeta Fraction biofunctional technology to Ashland "
    }
]