[
    {
        "content": "BARCELONA Dutch semiconductor equipment supplier ASML is currently buying back its own shares and expects to announce a new buyback program in January  its finance chief said on Thursday",
        "date": "11162017",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "ASML expects to announce new share buyback plan in January:  CFO "
    },
    {
        "content": "* Almost 1 bln euros left in current buyback plan at Q3 end (Updates with details  quotes)",
        "date": "11162017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "UPDATE 1-ASML expects to announce new share buyback plan in Jan - CFO "
    },
    {
        "content": "BARCELONA  Nov 16 The finance chief of Dutch semiconductor equipment supplier ASML said on Thursday the company was currently buying back its own shares and expected to announce an new buyback programme in January.",
        "date": "11162017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "ASML CFO: Buying own shares at current prices  will launch new programme in Jan "
    },
    {
        "content": "AMSTERDAM  Oct 18 ASML  the Dutch semiconductor equipment maker  on Wednesday reported third-quarter net profit of 557 million euros ($655 million)  beating market expectations  and repeated 2017 full-year guidance of 25 percent higher sales.",
        "date": "10182017",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "UPDATE 1-Chip equipment maker ASML beats expectations in Q3 "
    },
    {
        "content": "* Q3 NET INCOME OF EUR 557 ‍​MILLION VERSUS EUR 474 MILLION IN REUTERS POLL",
        "date": "10182017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML Holding Q3 net income beats Reuters poll "
    },
    {
        "content": "AMSTERDAM  Oct 18 ASML  the Dutch semiconductor equipment maker  on Wednesday reported third-quarter net profit of 557 million euros ($655 million)  beating market expectations  and repeated 2017 full-year guidance of 25 percent higher sales. ($1 = 0.8501 euros) (Reporting by Anthony Deutsch; Editing by Stephen Coates)",
        "date": "10182017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "Chip equipment maker ASML beats expectations in Q3 "
    },
    {
        "content": "* CFO WOLFGANG NICKL TO LEAVE ASML BY THE END OF APRIL 2018‍​",
        "date": "09122017",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-ASML announces CFO Wolfgang Nickl to leave by end of April 2018‍ "
    },
    {
        "content": "FRANKFURT  Sept 12 German drug and chemicals maker Bayer on Tuesday named Wolfgang Nickl  currently finance chief at Dutch semiconductor equipment maker ASML  to replace its CFO Johannes Dietsch when he leaves the group next year.",
        "date": "09122017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "Bayer names ASML's CFO as its new finance chief "
    },
    {
        "content": "* Q2 NET BOOKINGS EUR 2.38‍​ BILLION VERSUS EUR 1.76 BILLION IN REUTERS POLL",
        "date": "07192017",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "CORRECTED-BRIEF-ASML Holding Q2 net profit up at 466‍​ million euros "
    },
    {
        "content": "* END-QUARTER CASH AND CASH EQUIVALENTS AND SHORT-TERM INVESTMENTS FOR Q2 EUR 2.51 BILLION",
        "date": "07192017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML Holding Q2 net profit rises to 466‍​ million euros "
    },
    {
        "content": "* Reckitt rises after food business sale news (Adds quote and details  updates prices)",
        "date": "07192017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "Earnings lift European shares as ASML boosts tech  Reckitt jumps "
    },
    {
        "content": "AMSTERDAM Dutch semiconductor equipment maker ASML  said on Wednesday its sales in the second quarter rose to 2.1 billion euros ($2.4 billion)  beating estimates due to strong demand from manufacturers of memory chips.",
        "date": "07192017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "Semiconductor firm ASML beats second quarter estimates on strong memory demand "
    },
    {
        "content": "AMSTERDAM  July 19 Dutch semiconductor equipment maker ASML said on Wednesday its sales in the second quarter rose to 2.1 billion euros ($2.4 billion)  beating estimates due to strong demand from manufacturers of memory chips.",
        "date": "07192017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "UPDATE 1-Semiconductor firm ASML beats Q2 estimates on strong memory demand "
    },
    {
        "content": "AMSTERDAM  July 19 Semiconductor equipment maker ASML said on Wednesday its sales in the second quarter rose to 2.1 billion euros ($2.4 billion)  beating its own estimates on strong demand from manufacturers of memory chips.",
        "date": "07192017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "ASML beats estimates on strong memory demand "
    },
    {
        "content": "* ASML OBTAINS REGULATORY APPROVALS FOR STRENGTHENED PARTNERSHIP WITH ZEISS  PREPARES TO CLOSE TRANSACTION Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "06282017",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-ASML obtains regulatory approvals for partnership with Zeiss "
    },
    {
        "content": "AMSTERDAM  June 21 ASML  one of the world's largest equipment suppliers to computer chipmakers  will team up with a public Chinese research consortium to open an education centre in Shanghai  it said on Wednesday.",
        "date": "06212017",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "ASML in Chinese training intiative for semiconductor growth "
    },
    {
        "content": "* ICRD AND ASML SIGN MOU TO ESTABLISH A TRAINING CENTER IN SHANGHAI‍​ Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "06212017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML and ICRD sign MoU to establish training center in Shanghai‍​ "
    },
    {
        "content": "ASML  the world's third largest semiconductor equipment maker  said on Friday it had counter-sued rival Nikon  after the Japanese company launched a wide-ranging patent battle against the Dutch company this week.",
        "date": "04282017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "ASML files patent countersuit against Japan's Nikon "
    },
    {
        "content": "FRANKFURT  April 24 Japan's Nikon filed lawsuits against Netherlands-based ASML  the world's third-largest chip equipment maker  and Germany's Carl Zeiss   saying its lithography technology was illegally used by the two.",
        "date": "04242017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "Nikon files patent case against ASML  Carl Zeiss over lithography tech "
    },
    {
        "content": "* ASML has 80 pct of revs in market vs Nikon  Canon - Fitch (Adds Nikon statement)",
        "date": "04282017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "UPDATE 4-ASML files patent countersuit against Japan's Nikon "
    },
    {
        "content": "FRANKFURT/TOKYO  April 24 Japan's Nikon Corp on Monday said it has initiated legal action against ASML Holding NV and Carl Zeiss AG  saying the Dutch and Germany companies used its lithography technology without its permission.",
        "date": "04242017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "UPDATE 1-Nikon files patent case against ASML  Carl Zeiss over lithography tech "
    },
    {
        "content": "April 28 ASML  Europe's largest supplier to semiconductor manufacturers  said it filed patent infringement cases against Nikon in Japan related to semiconductor manufacturing equipment  flat panel display manufacturing equipment and digital cameras.",
        "date": "04282017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "ASML files patent case against Nikon "
    },
    {
        "content": "* ASML has today filed suits in Japan  both on its own and jointly with its strategic partner Zeiss",
        "date": "04282017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML files patent infringement lawsuits against Nikon "
    },
    {
        "content": "* Notes announcement by Nikon that Nikon has filed a legal claim for alleged patent infringement against ASML in three countries",
        "date": "04242017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML Holding notes announcement by Nikon that Nikon has filed a legal claim for alleged patent infringement against Co in three countries "
    },
    {
        "content": "* ASML: denies infringing Nikon patents  will \"vigorously defend\" against Japanese company's claims. Earlier Monday Nikon announced it was filing suit against ASML and partner Carl Zeiss in the Netherlands  Germany and Japan for alleged patent infringements. Further company coverage:",
        "date": "04242017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML denies infringing Nikon patents "
    },
    {
        "content": "* Says it categorically denies the company has infringed any of Nikon’s patents  repsonding to Nikon suits Further company coverage: (Frankfurt Newsroom)",
        "date": "04242017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML denies it has infringed any of Nikon’s patents "
    },
    {
        "content": "SAN FRANCISCO  April 19 Shares of semiconductor equipment suppliers surged on Wednesday after quarterly earnings reports from Lam Research and ASML Holding suggested a recent wave of spending by chipmakers was far from over.",
        "date": "04192017",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "Chip equipment stocks surge after strong Lam Research  ASML results "
    },
    {
        "content": "FRANKFURT  April 19 Dutch semiconductor equipment supplier ASML on Wednesday reported a doubling in first-quarter net income and said demand looked healthy for the rest of 2017  aided by a surge in spending by memory chip making customers.",
        "date": "04192017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "UPDATE 1-ASML net income doubles in first quarter on strong demand "
    },
    {
        "content": "* Q1 net sales 1.94 billion euros versus 1.82 billion euros in Reuters poll",
        "date": "04192017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML Holding Q1 net income beats consensus "
    },
    {
        "content": "* ASML extends holistic patterning strategy with Cadence  partnership  Source text for Eikon:  Further company coverage:   (Gdynia Newsroom)",
        "date": "02282017",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-ASML announces partnership with Cadence "
    },
    {
        "content": "Jan 27 German antitrust regulator Bundeskartellamt",
        "date": "01272017",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-German antitrust regulator says approves ASML's purchase of stake in Carl Zeiss SMT "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  January 20 (Fitch) Fitch Ratings has assigned Dutch technology company  ASML Holding N.V.'s (ASML) Long-Term Issuer Default Rating (IDR) at 'BBB+' with  Stable Outlook. It has also assigned a final rating of 'BBB+' to the group's  EUR750m senior notes due in 2027. A full list of rating actions is at the end of  this commentary. The ratings reflect ASML's market-leading position and technological expertise  in the manufacturing o",
        "date": "01202017",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "Fitch Affirms ASML at 'BBB+': Outlook Stable "
    },
    {
        "content": "AMSTERDAM  Jan 18 ASML  Europe's largest supplier to semiconductor manufacturers  beat fourth-quarter net income forecasts on Wednesday and said it had almost sold out of its newest  most expensive machines for 2017 and early 2018.",
        "date": "01182017",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "UPDATE 1-ASML beats estimates as orders for newest machines grow "
    },
    {
        "content": "AMSTERDAM  Jan 18 ASML  Europe's largest supplier to semiconductor manufacturers  on Wednesday reported fourth-quarter net income of 524 million euros  and said a growing order backlog of its newest machines bodes well for 2017.",
        "date": "01182017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "ASML beats Q4 income forecast; order backlog of newest machines grows "
    },
    {
        "content": "* FY net sales 6.80 billion euros  ($7.26 billion) versus 6.66 billion in Reuters poll",
        "date": "01182017",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML Holding FY results beat Reuters poll "
    },
    {
        "content": "* Partners with ASML to simplify business processes and enrich stakeholder experience  Source text: http://bit.ly/2ftJUxy Further company coverage:",
        "date": "11242016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-India's TCS partners with ASML to simplify business processes "
    },
    {
        "content": "* ASML successfully places Eurobond offering for 750 million euros ($792.23 million)",
        "date": "11232016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-ASML Holding places Eurobond offering for 750 million euros "
    },
    {
        "content": "* ASML completes acquisition of HMI   Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "11222016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-ASML completes acquisition of HMI "
    },
    {
        "content": "* ASML CEO Peter Wennink: does not expect further consolidation among semiconductor manufacturer suppliers",
        "date": "11172016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-ASML CEO: No further mergers among big computer chip maker suppliers "
    },
    {
        "content": "* Says it will conduct share exchange with ASML Holding NV's wholly owned Taiwan-based subsidiary",
        "date": "11072016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-Hermes Microvision updates share exchange with unit of ASML Holding NV "
    },
    {
        "content": "AMSTERDAM ASML Holding NV  a key supplier to computer chip makers  said on Thursday it would buy a quarter stake in optics company Carl Zeiss's SMT subsidiary for 1 billion euros ($1.1 billion) to deepen their collaboration on ASML's newest generation of products.",
        "date": "11032016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "ASML buys 24.9 percent stake in Carl Zeiss subsidiary SMT for 1 billion euros "
    },
    {
        "content": "AMSTERDAM  Nov 3 ASML Holding NV  a key supplier to computer chip makers  said on Thursday it would buy a quarter stake in optics company Carl Zeiss's  SMT subsidiary for 1 billion euros ($1.1 billion) to deepen their collaboration on ASML's newest generation of products.",
        "date": "11032016",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "ASML buys 24.9 pct stake in Carl Zeiss subsidiary SMT for 1 bln euros "
    },
    {
        "content": "* Zeiss and ASML strengthen partnership for next generation of euv lithography due in early 2020s",
        "date": "11032016",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML buys 24.9 pct of Zeiss unit Carl Zeiss SMT for EUR 1 billion "
    },
    {
        "content": "* Obtained ASML merger clearance from the Taiwanese Fair Trade Commission  the Competition Commission of Singapore and the Korean Fair Trade Commission",
        "date": "10262016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-ASML Holding obtains approvals to acquire HMI "
    },
    {
        "content": "* Confirms its view  first stated at 2014 investor day  of an annual revenue opportunity of 10 billion euros ($10.96 billion)in 2020",
        "date": "10312016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-ASML affirms 2020 growth opportunity "
    },
    {
        "content": "* Sees Q4 revenue at 1.7-1.8 bln euros   (Adds details from earnings  CEO comment)",
        "date": "10192016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "UPDATE 1-ASML Q3 results miss on profit  but sales up on orders of newest machines "
    },
    {
        "content": "* Q3 net sales 1.82 billion euros ($2.00 billion) versus 1.72 billion euros in Reuters poll",
        "date": "10192016",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML Holding Q3 net sales beat Reuters poll "
    },
    {
        "content": "AMSTERDAM  Oct 18 Dutch chip-making equipment manufacturer ASML Holding NV  a supplier to Intel Corp  and Samsung Electronics Co Ltd  on Wednesday reported a 23 percent rise in third-quarter profit  missing analyst estimates.",
        "date": "10192016",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "ASML Q3 net profit rises 23 pct  sees Q4 sales at 1.7-1.8 bln euros "
    },
    {
        "content": "* ASML guides Q4 2016 net sales between 1.7 and 1.8 billion euros and a gross margin between 47 and 48 percent",
        "date": "10192016",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML Holding guides Q4 net sales between 1.7 and 1.8 billion euros "
    },
    {
        "content": "SEOUL  Sept 18 South Korean tech giant Samsung Electronics Co Ltd said on Sunday it sold shares in ASML Holding NV  Rambus Inc  Seagate Technology Plc and Sharp Corp.",
        "date": "09182016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "Samsung Electronics says sold shares in four companies "
    },
    {
        "content": "* Bookrunner says accelerated bookbuilt offering of 6.3 mln ordinary shares of ASML Holding NV",
        "date": "09072016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-Bookrunner announces $681 mln ASML Holding shares placing "
    },
    {
        "content": "SEOUL  Sept 8 Tech giant Samsung Electronics Co Ltd said on Thursday it is selling some of its shares in Dutch semiconductor equipment maker ASML Holding NV .",
        "date": "09082016",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "Samsung Electronics says selling some of its shares in ASML "
    },
    {
        "content": "* Will sell about 6.3 million shares in ASML Holding NV  for about 606 million euros - Bloomberg  Further company coverage:    (Reporting By Se Young Lee)",
        "date": "09082016",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-Samsung Elec to sell ASML Holding shares for about 606 mln euros - Bloomberg "
    },
    {
        "content": "* Says orders machinery equipment worth T$21.3 billion  ($669.73 million)",
        "date": "08292016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-TSMC orders machinery equipment from Ebara  ASML and Applied Materials "
    },
    {
        "content": "AMSTERDAM  Aug 17 Shares in Dutch semiconductor equipment supplier ASML Holding fell after remarks by an Intel official suggested the company may hold off on using ASML's newest tools in commercial production.",
        "date": "08172016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "ASML shares fall on fears Intel could delay use of its newest tool "
    },
    {
        "content": "* Stock top performer in Amsterdam  up 3.1 pct   (Adds CEO comment  EUV orders  analyst quotes)",
        "date": "07202016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "UPDATE 1-ASML's net bookings lifted by orders for its newest machines "
    },
    {
        "content": "LONDON  July 20 Europe's technology shares index climbed to its highest level since early January on Wednesday  boosted by a rally in SAP and ASML after both reported forecast-beating quarterly results.",
        "date": "07202016",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "European tech index hits 6-month high as SAP and ASML climb "
    },
    {
        "content": "July 20 ASML Holding reported a better-than-expected quarterly profit on Wednesday as customers have started taking shipments of its newest tool.",
        "date": "07202016",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "REFILE-ASML's second-quarter profit beats estimates "
    },
    {
        "content": "* Q2 net sales of 1.74 billion euros ($81.50 billion)  gross margin 42.6 percent",
        "date": "07202016",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML Holding reports Q2 net sales of 1.74 billion euros "
    },
    {
        "content": "* Successfully places eurobond offerings for 1.5 billion euros ($1.67 billion)",
        "date": "07042016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-ASML Holding places eurobond offerings for 1.5 billion euros "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  June 24 (Fitch) Fitch Ratings has affirmed Dutch technology group ASML  Holding N.V.'s (ASML) Long-Term Issuer Default Rating (IDR) and senior unsecured  rating at 'BBB+' following the company's announcement to acquire Hermes  Microvision Inc. (HMI). The Outlook is Stable. ASML announced that it intends to acquire Taiwan-based HMI for TWD100bn  (EUR2.75bn). HMI is a leading supplier of pattern verification systems used in  the m",
        "date": "06242016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "Fitch Affirms ASML at 'BBB+' on Planned HMI Buy "
    },
    {
        "content": "* Says it will become a wholly owned subsidiary of ASML Holding NV after share swap",
        "date": "06162016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-Hermes Microvision signs share swap agreement with ASML Holding NV "
    },
    {
        "content": "PARIS  June 16 Below are company-related news and stories from French and Benelux media which could have an impact on the region's markets or individual stocks.",
        "date": "06162016",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "French and Benelux stocks-Factors to watch on June 16 "
    },
    {
        "content": "LONDON  June 16 European equity futures fell on Thursday  with the region's stock markets set to resume a losing streak that has pushed a key European equity index down to a near four-month low as concerns linger over Britain's vote next week on its European Union membership.",
        "date": "06162016",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "European Factors to Watch-Equity futures fall "
    },
    {
        "content": "LONDON  June 16 European stocks were seen opening lower on Thursday  resuming a losing streak that has pushed a key European equity index down to a near four-month low as concerns linger over Britain's vote next week on its membership of the European Union.",
        "date": "06162016",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "European Factors to Watch-Shares seen opening lower "
    },
    {
        "content": "TAIPEI  June 16 Taiwan stocks fell more than 1 percent on Thursday as losses in regional bourses weighed on the market  but Hermes Microvision Inc (HMI) rose by its daily limit of 10 percent after ASML Holdings NV  agreed to buy the company.",
        "date": "06162016",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "Taiwan stocks fall on regional losses; HMI surges "
    },
    {
        "content": "* ASML to acquire HMI to enhance Holistic Lithography product portfolio",
        "date": "06162016",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML to acquire HMI to enhance Holistic Lithography product portfolio "
    },
    {
        "content": "* Q1 net sales 1.33 billion euros  ($1.51 billion) versus 1.32 billion euros in Reuters poll",
        "date": "04202016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-ASML Holding Q1 net income beats Reuters poll "
    },
    {
        "content": "* Partners with Nippon Control System to streamline process flow from design to mask production  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "02222016",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-ASML holding partners with Nippon Control System "
    },
    {
        "content": "* Says orders machinery equipment worth T$2.6 billion  ($79.29 million)",
        "date": "12142015",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-Taiwan's TSMC orders machinery from ASML  Kinmax Tech "
    },
    {
        "content": "* Says orders machinery equipment worth T$870 million  ($26.51 million)",
        "date": "12112015",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-TSMC orders from Grand Plastic  Rudolph Tech  ASML  KLA-Tencor  Tokyo Electron  Chun Yuan Steel "
    },
    {
        "content": "* Says orders machinery equipment worth T$1.6 billion  ($49.25 million)",
        "date": "11202015",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-TSMC orders machinery equipment from ASML  Hitachi High-Technologies "
    },
    {
        "content": "AMSTERDAM  Nov 12 ASML finance chief Wolfgang Nickl said on Thursday that shipments of the semiconductor equipment supplier's newest generation machines would become routine by 2018.",
        "date": "11122015",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "ASML sees next generation machines standard in 2018 "
    },
    {
        "content": "MILAN  Oct 14 European shares were little changed on Wednesday with gains capped by new concerns about deflationary pressures in China  while technology group ASML and builder Skanska slid after weak business updates.",
        "date": "10142015",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "European shares little changed  ASML slides on results "
    },
    {
        "content": "LONDON  Oct 14 European shares fell on Wednesday as new concerns about deflationary pressures in China impacted equity markets  while technology group ASML slid after weak results.",
        "date": "10142015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "European shares fall on weak China data  ASML slides after results "
    },
    {
        "content": "* ASML to ship fewer of newest EUV machines this year   (Adds shares  analyst comment  EUV system sales)",
        "date": "10142015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "UPDATE 1-ASML new orders down after earnings fall short of forecasts "
    },
    {
        "content": "AMSTERDAM  Oct 14 ASML will miss a target of shipping 6 of its newest \"EUV\" systems this year  CFO Wolfgang Nickl said on Wednesday.",
        "date": "10142015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "ASML CFO says company will ship just 4 EUV systems this year "
    },
    {
        "content": "AMSTERDAM  Oct 14 ASML  a supplier to top global semiconductor makers  on Wednesday reported third-quarter earnings slightly below analysts' expectations  and with fewer than expected new bookings.",
        "date": "10142015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "ASML Q3 earnings miss by a hair  but new orders are down "
    },
    {
        "content": "* Reports Q3 net sales of 1.55 billion euros ($1.77 billion)  and a gross margin of 45.4 pct  in line with guidance",
        "date": "10142015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML posts in line Q3 revenues  guides Q4 sales at 1.4 bln euros "
    },
    {
        "content": "LONDON  July 31 The stock market  rather than the real economy  is the big winner of the euro zone's nascent recovery so far this year.",
        "date": "07312015",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "INVESTMENT FOCUS-Eurozone recovery lifts buybacks  clouds capex "
    },
    {
        "content": "* SKF falls 8.6 percent after results   (Adds closing prices  detail)",
        "date": "07152015",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "European shares near three-week high  with focus on Greek vote "
    },
    {
        "content": "FRANKFURT Dutch lithography machine maker ASML forecast a bigger-than-expected rise in 2015 revenue as its customers prepared to add more semiconductor production capacity  lifting its shares more than 4 percent.",
        "date": "07152015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "Chip equipment maker ASML sees possible 2015 sales beat "
    },
    {
        "content": "* Bookings up nearly 500 mln euros in Q2   (Adds CEO comments  background  updates shares)",
        "date": "07152015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "UPDATE 2-Chip equipment maker ASML sees possible 2015 sales beat "
    },
    {
        "content": "FRANKFURT  July 15 ASML Holding  the world's second largest maker of semiconductor production equipment  on Wednesday said its 2015 sales would exceed last year's 5.86 billion euros ($6.44 billion) after reporting broadly in-line second-quarter results.",
        "date": "07152015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "CORRECTED-ASML sees 2015 sales ahead of last year's 5.86 bln euros "
    },
    {
        "content": "* CEO says sees Q4 sales equal to Q3 outlook  \"with some upside potential\"",
        "date": "07152015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML CEO sees 2015 sales higher than 2014's 5.86 bln euros "
    },
    {
        "content": "LONDON  July 15 Financial spreadbetters expected Britain's FTSE 100 to open up 6 to 20 points or as much as 0.3 percent higher  Germany's DAX to open 36 to 49 points or as much as 0.4 percent up  and France's CAC 40 to open 10 to 27 points or as much as 0.5 percent higher.          MAJOR EUROPEAN COMPANIES REPORTING:     SVT.L   Severn Trent PLC            Severn Trent PLC Interim Management                                      Statement Release  BON.OL  Bonheur ASA                 Q",
        "date": "07152015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "European Factors to Watch on June 15 "
    },
    {
        "content": "* Reports Q2 results in line with guidance  company says on track for record 2015 sales",
        "date": "07152015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML Holding Q2 net profit drops to 370 mln euros "
    },
    {
        "content": "* Both companies leaders in an industry facing slowing demand   (Adds industry rankings)",
        "date": "04272015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "UPDATE 3-Applied Materials scraps Tokyo Electron takeover on U.S. anti-trust concerns "
    },
    {
        "content": "AMSTERDAM ASML  Europe's largest supplier to computer chip makers  will sell 15 of its next-generation machines to a single U.S. customer  it said on Wednesday  in a deal that could be worth more than $1 billion.",
        "date": "04222015",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "ASML to sell 15 next-generation systems to U.S. chipmaker "
    },
    {
        "content": "AMSTERDAM  April 22 ASML  Europe's largest supplier to computer chip makers  will sell 15 of its next-generation machines to a single U.S. customer  it said on Wednesday  in a deal that could be worth more than $1 billion.",
        "date": "04222015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "UPDATE 2-ASML to sell 15 next-generation systems to US chipmaker "
    },
    {
        "content": "* Reaches agreement for delivery of minimum of 15 EUV lithography systems",
        "date": "04222015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML Holding says to deliver 15 EUV systems to US customer "
    },
    {
        "content": "AMSTERDAM  April 22 ASML has agreed to sell 15 of its next-generation extreme ultraviolet (EUV) chip etching systems to one of its top U.S. customers  the Dutch semiconductor equipment maker said on Wednesday.",
        "date": "04222015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "ASML to sell 15 of its next-generation EUV systems to U.S. customer "
    },
    {
        "content": "AMSTERDAM  April 17 JPMorgan Securities  which manages assets for high-wealth individuals  has taken a 5.35 percent stake in Dutch semiconductor equipment maker ASML   the Dutch Authority for Financial Markets reported on Friday.",
        "date": "04172015",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "JPMorgan Securities holds 5.35 percent stake in ASML - watchdog "
    },
    {
        "content": "AMSTERDAM Executives of ASML  said on Wednesday that it is possible the company's revenue will be slightly lower in the second half of 2015 than in the first half of the year.",
        "date": "04152015",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "ASML executives flag possible revenue dip in second half of 2015 "
    },
    {
        "content": "* Forecasts Q2 sales of 1.6 bln euros vs. expected 1.64 bln euros",
        "date": "04152015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "UPDATE 1-ASML sales outlook falls short of consensus "
    },
    {
        "content": "* Strong dollar helps customers but hit Q1 margins by 1 pct  Source text for Eikon:  Further company coverage:    (Reporting by Toby Sterling; editing by Jason Neely)",
        "date": "04152015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML CFO: No guidance on H2  company lacks visibility "
    },
    {
        "content": "AMSTERDAM  April 15 ASML Holding NV  a key supplier to top global semiconductor makers  on Wednesday reported first quarter earnings of 403 million euros ($428 million)  in line with analyst forecasts of 402 million euros.",
        "date": "04152015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "ASML posts in-line quarterly profit but vague on 2015 outlook "
    },
    {
        "content": "* ASML Q1 net sales in line with guidance at EUR 1.65 billion  gross margin 47.2 percent",
        "date": "04152015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "BRIEF-ASML Holding sees Q2 net sales of about 1.6 bln euros "
    },
    {
        "content": "AMSTERDAM  March 1 Dutch semiconductor equipment maker ASML said on Sunday its IT systems had been briefly compromised  but it had found no evidence that valuable files were accessed.",
        "date": "03012015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "ASML says computer systems briefly compromised  no key data accessed "
    },
    {
        "content": "AMSTERDAM  March 1 Dutch semiconductor equipment maker ASML said on Sunday that it was investigating an unauthorised intrusion into its IT systems  but it had found no evidence that valuable files were accessed.",
        "date": "03012015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "UPDATE 1-ASML says computer systems briefly compromised  no key data accessed "
    },
    {
        "content": "Further company coverage:    ($1 = 31.4180 Taiwan dollars)   (Reporting by Hong Kong and Singapore newsrooms)",
        "date": "02162015",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-TSMC orders equipment for T$3.5 bln from Hitachi  ASML  Applied Materials "
    },
    {
        "content": "Further company coverage:    ($1 = 31.6250 Taiwan dollars)   (Reporting by Hong Kong and Singapore newsrooms)",
        "date": "01202015",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-Taiwan's TSMC orders equipment from ASML for T$587 mln "
    },
    {
        "content": "AMSTERDAM ASML Holding NV  the world's largest maker of semiconductor production equipment  has reported forecast-beating results on the back of stronger-than-expected demand from memory chip makers  sending its shares to a record high.",
        "date": "01212015",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "ASML shares hit record after fourth quarter tops forecasts "
    },
    {
        "content": "* Shares hit record high before easing  up 0.6 percent   (Updates shares  writes through)",
        "date": "01212015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "UPDATE 5-ASML shares hit record after fourth quarter tops forecasts "
    },
    {
        "content": "PARIS  Jan 21 European shares inched higher in early trade on Wednesday  gaining ground for the fifth session in a row  lifted by expectations the European Central Bank is about to launch a quantitative easing programme to boost the region's economy.",
        "date": "01212015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "European shares extend rally; ASML surges after results "
    },
    {
        "content": "AMSTERDAM  Jan 21 ASML NV  the world's second largest maker of semiconductor production equipment  on Wednesday posted better-than-expected fourth-quarter results  saying demand from memory chip makers was stronger than expected.",
        "date": "01212015",
        "name": "ASML Holding NV",
        "news_type": "normal",
        "symbol": "ASML",
        "title": "ASML beats on Q4 sales  profit; forecasts strong first half "
    },
    {
        "content": "* Says orders equipment from Tokyo Electron for T$1.06 billion ($33.19 million)",
        "date": "01062015",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-Taiwan's UMC orders equipment from ASML  Tokyo Electron for T$1.6 bln "
    },
    {
        "content": "* Says orders equipment from ASML for T$5.6 billion ($175.49 million)",
        "date": "01052015",
        "name": "ASML Holding NV",
        "news_type": "topStory",
        "symbol": "ASML",
        "title": "BRIEF-Taiwan's UMC orders equipment from ASML for T$5.6 bln "
    }
]