[
    {
        "content": "* Autohome Inc. announces unaudited third quarter ended September 30  2017 financial results and declares a special cash dividend",
        "date": "11072017",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "BRIEF-Autohome Q3 earnings per share RMB 3.65 "
    },
    {
        "content": "* Autohome Inc - ‍Jun Zou has been appointed to serve as chief financial officer​",
        "date": "09282017",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "BRIEF-Autohome Inc announces management change "
    },
    {
        "content": "* Autohome Inc announces unaudited second quarter ended June 30  2017 financial results",
        "date": "08092017",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "BRIEF-Autohome Q2 non-GAAP earnings per share RMB 4.80 "
    },
    {
        "content": "* Autohome Inc announces unaudited first quarter ended march 31  2017 financial results",
        "date": "05102017",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "BRIEF-Autohome Inc reports Q1 earnings per share RMB 2.83 "
    },
    {
        "content": "* Autohome inc. Announces unaudited fourth quarter and full year 2016 financial results",
        "date": "03022017",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "BRIEF-Autohome Q4 EPS RMB 3.27 "
    },
    {
        "content": "* Autohome Inc announces transaction between shareholders and board change",
        "date": "02222017",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "BRIEF-Autohome Inc anounces transaction between shareholders and board change "
    },
    {
        "content": "* Telstra has sold its remaining 6.5 per cent interest in chinese online business Autohome to Ping An Insurance Group",
        "date": "02222017",
        "name": "Autohome Inc",
        "news_type": "normal",
        "symbol": "ATHM",
        "title": "BRIEF-Telstra sells remaining stake in Autohome to Ping An Insurance Group "
    },
    {
        "content": "* Autohome Inc announces receipt of withdrawal of going private proposal",
        "date": "10132016",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "BRIEF-Autohome Inc announces receipt of withdrawal of going private proposal "
    },
    {
        "content": "* Yan Kang and Jiun Lang wang have been appointed as directors on board of directors of company",
        "date": "10032016",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "BRIEF-Autohome Inc. announces board change "
    },
    {
        "content": "* Autohome inc. Announces board change  Source text for Eikon:  Further company coverage:",
        "date": "08172016",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "BRIEF-Autohome announces board change "
    },
    {
        "content": "* Autohome inc. Announces unaudited results for the second quarter ended june 30  2016  Source text for Eikon:  Further company coverage:",
        "date": "08162016",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "BRIEF-Autohome announces Q2 results "
    },
    {
        "content": "* Ping An Insurance Company Of China Ltd reports 47.4 percent active stake in Autohome Inc as of June 22  2016  based on class A shares - SEC filing  Source text - http://bit.ly/29iC6Pb Further company coverage:",
        "date": "07052016",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "BRIEF-Ping an insurance company of china says 47.4 pct active stake in Autohome "
    },
    {
        "content": "* Received letter of notice from shareholder  Telstra Holdings Pty Limited;  Telstra appointed Ajinkya Mukhopadhyay as new director on board",
        "date": "05312016",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "BRIEF-Autohome announces appointment of new director "
    },
    {
        "content": "* Petition has been filed under section 94 of Cayman Islands companies law by certain minority shareholders of company",
        "date": "05272016",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "BRIEF-Autohome announces Cayman Islands petition by minority shareholders "
    },
    {
        "content": "SYDNEY Australia's Telstra Corp Ltd on Wednesday said its $1.6 billion sale of a controlling stake in Chinese website operator Autohome Inc to Ping An Insurance Group Co of China Ltd is being challenged by minority shareholders.",
        "date": "05252016",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "Telstra says $1.6 billion Autohome stake sale is being challenged by minority shareholders "
    },
    {
        "content": "SYDNEY  May 25 Australia's Telstra Corp Ltd  on Wednesday said its $1.6 billion sale of a controlling stake in Chinese website operator Autohome Inc  to Ping An Insurance Group Co of China Ltd  is being challenged by minority shareholders.",
        "date": "05252016",
        "name": "Autohome Inc",
        "news_type": "normal",
        "symbol": "ATHM",
        "title": "Telstra says $1.6 bln Autohome stake sale is being challenged by minority shareholders "
    },
    {
        "content": "MELBOURNE/WELLINGTON  May 2 Australia and New Zealand shares fell on Monday  hauled down by  heavyweight banks after no.3 lender Westpac Banking Corp delivered a weaker-than-expected half year profit due to a rise in sour loans.",
        "date": "05022016",
        "name": "Autohome Inc",
        "news_type": "normal",
        "symbol": "ATHM",
        "title": "Australia shares fall as sour loans mar Westpac profit growth "
    },
    {
        "content": "MELBOURNE  May 2 Telstra Corp said on Monday it plans to return at least A$1.5 billion ($1.1 billion) to shareholders on top of its dividend in the first half of the 2017 fiscal year  using cash  from the sale of its stake in China's Autohome Inc.",
        "date": "05012016",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "Australia's Telstra to return at least $1.1 bln to shareholders "
    },
    {
        "content": "* Autohome inc. Announces formation of independent special committee to consider \"going private\" proposal",
        "date": "04262016",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "BRIEF-Autohome forms committee to consider \"going private\" proposal "
    },
    {
        "content": "* Autohome Inc. Announces receipt of preliminary non-binding \"going private\" proposal",
        "date": "04182016",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "BRIEF-Autohome Autohome says board is evaluating non-binding \"going private\" proposal "
    },
    {
        "content": "China's Autohome Inc  on Friday was made an offer to be acquired by a consortium that includes its chief executive and private equity firms in a deal that values the automobile information website operator at $3.57 billion.",
        "date": "04152016",
        "name": "Autohome Inc",
        "news_type": "topStory",
        "symbol": "ATHM",
        "title": "Autohome CEO makes buyout offer that beats top investor's valuation "
    },
    {
        "content": "April 15 China's Autohome Inc on Friday was made an offer to be acquired by a consortium that includes its chief executive and private equity firms in a deal that values the automobile information website operator at $3.57 billion.",
        "date": "04152016",
        "name": "Autohome Inc",
        "news_type": "normal",
        "symbol": "ATHM",
        "title": "UPDATE 1-Autohome CEO makes buyout offer that beats top investor's valuation "
    },
    {
        "content": "* Consortium Submits Preliminary Non Binding proposal to acquire nyse-listed autohome inc.",
        "date": "04152016",
        "name": "Autohome Inc",
        "news_type": "normal",
        "symbol": "ATHM",
        "title": "BRIEF-Consortium submits preliminary non-binding proposal to acquire Autohome Inc "
    },
    {
        "content": "April 15 Autohome Inc has been made an offer to be acquired by a consortium that includes its chief executive in a deal that values the Chinese automobile information website operator at $3.57 billion.",
        "date": "04152016",
        "name": "Autohome Inc",
        "news_type": "normal",
        "symbol": "ATHM",
        "title": "China's Autohome gets $3.57 bln buyout offer from consortium "
    }
]