[
    {
        "content": "* AngloGold cuts exposure to tough domestic industry (Adds shares  details)",
        "date": "10192017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "UPDATE 2-Anglogold Ashanti to raise $307 mln with South African mine sales "
    },
    {
        "content": "JOHANNESBURG  Aug 21 South Africa's AngloGold Ashanti reported a first-half loss on Monday on costs related to layoffs and money set aside for litigation  but stuck to its full-year targets.",
        "date": "08212017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "UPDATE 1-AngloGold Ashanti swings to H1 loss on job cuts  lawsuit "
    },
    {
        "content": "JOHANNESBURG AngloGold Ashanti's chief executive has not ruled out the possibility of separating the gold miner's South African assets from the rest of the portfolio but said its debt remained too high.",
        "date": "08212017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "normal",
        "symbol": "AU",
        "title": "AngloGold Ashanti debt too high for split of assets: CEO "
    },
    {
        "content": "JOHANNESBURG  Aug 21 AngloGold Ashanti's chief executive has not ruled out the possibility of separating the gold miner's South African assets from the rest of the portfolio but said its debt remained too high.",
        "date": "08212017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "normal",
        "symbol": "AU",
        "title": "AngloGold Ashanti debt too high for split of assets- CEO "
    },
    {
        "content": "JOHANNESBURG/LONDON AngloGold Ashanti is considering separating its South African assets from the rest of its portfolio  two sources familiar with the matter told Reuters  three years after shareholders revolted against a similar effort.",
        "date": "08182017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "Exclusive: AngloGold Ashanti revives plans to spin off South Africa mines - sources "
    },
    {
        "content": "JOHANNESBURG South Africa's rand and mining stocks strengthened on Wednesday as the dollar plunged on U.S. stimulus uncertainty  although AngloGold Ashanti fell more than 4 percent after saying it may retrench 8 500 workers.",
        "date": "06282017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "Weak dollar boosts South Africa's rand  mining stocks "
    },
    {
        "content": "JOHANNESBURG  June 28 AngloGold Ashanti is considering laying off 8 500 workers  some 30 percent of its workforce  Africa's biggest gold miner said on Wednesday  as it looks to restructure its South African mines.",
        "date": "06282017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "normal",
        "symbol": "AU",
        "title": "UPDATE 2-AngloGold considers 8 500 job cuts in S.Africa revamp "
    },
    {
        "content": "JOHANNESBURG  June 28 Africa's biggest gold miner AngloGold Ashanti is considering retrenching 8 500 mine workers as part of its restructuring of its South African business \"to ensure their viability\"  sending its shares lower.",
        "date": "06282017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "normal",
        "symbol": "AU",
        "title": "CORRECTED-AngloGold mulls 8 500 jobs at struggling South African mines "
    },
    {
        "content": "* Received formal notification from Blackrock  that it has acquired a beneficial interest in securities of company​",
        "date": "06082017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "BRIEF-Anglogold Ashanti says ‍Blackrock now holds 10 pct stake in the company "
    },
    {
        "content": "JOHANNESBURG  May 8 Africa's biggest gold miner AngloGold Ashanti reported a 16 percent drop in first-quarter profit on Monday following a decline in South African production  sending its shares down nearly 5 percent.",
        "date": "05082017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "UPDATE 1-AngloGold profit down as South Africa underperforms "
    },
    {
        "content": "JOHANNESBURG  May 8 Africa's biggest gold miner AngloGold Ashanti reported a 16 percent drop in quarterly core profit on Monday hit by a weak showing at its South African operations.",
        "date": "05082017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "normal",
        "symbol": "AU",
        "title": "AngloGold Q1 EBITDA down 16 pct as South Africa operations underperform "
    },
    {
        "content": "BOGOTA  April 27 South Africa's AngloGold Ashanti has halted all exploration work at its La Colosa project in central Tolima  Colombia  after voters backed a proposal to ban mining in the municipality  the company said on Thursday.",
        "date": "04272017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "normal",
        "symbol": "AU",
        "title": "AngloGold suspends Colombia project after anti-mining vote "
    },
    {
        "content": "BOGOTA  March 27 Voters in Colombia's Tolima province have backed a proposal to ban mining projects in their municipality  a result that raises questions about the future of an AngloGold Ashanti gold exploration in the area.",
        "date": "03272017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "UPDATE 1-Colombia municipality  home of AngloGold project  votes to ban mining "
    },
    {
        "content": "BOGOTA  March 27 Voters in Colombia's Tolima province have backed a proposal to ban mining projects in their municipality  a result that raises questions about the future of an AngloGold Ashanti gold exploration in the area.",
        "date": "03272017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "normal",
        "symbol": "AU",
        "title": "Colombia municipality  home of AngloGold project  votes to ban mining "
    },
    {
        "content": "* Swings back to headline profit  resumes dividend   (Recasts with Obuasi developments)",
        "date": "02212017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "UPDATE 1-AngloGold lifts force majeure on Obuasi as swings to profit "
    },
    {
        "content": "* Operation may now be sold or mechanised   (Adds details  quotes)",
        "date": "02072017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "UPDATE 1-AngloGold says illegal miners largely cleared out of Ghana mine "
    },
    {
        "content": "CAPE TOWN  Feb 7 Illegal miners have \"largely been cleared\" from AngloGold Ashanti's Obuasi mine in Ghana and the company can now explore a number of options for the asset including its possible sale or redevelopment  its chief executive said on Tuesday.",
        "date": "02072017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "normal",
        "symbol": "AU",
        "title": "AngloGold says illegal miners largely cleared out of Ghana mine "
    },
    {
        "content": "JOHANNESBURG  Jan 24 South African bullion producer Anglogold Ashanti will hold back on job cuts announced last week and will instead redeploy most of the workers within the firm  the National Union of Mineworkers said on Tuesday.",
        "date": "01242017",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "UPDATE 1-South Africa's Anglogold Ashanti to hold back on job cuts - NUM union "
    },
    {
        "content": "CONAKRY South Africa-based gold producer AngloGold Ashanti plans to boost gold output in Guinea by investing over $400 million in the next eight years  according to an agreement reached this week with the West African country.",
        "date": "06292016",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "AngloGold to invest over $400 million in Guinea gold production "
    },
    {
        "content": "* Luna Gold announces Greenfields exploration agreement with AngloGold Ashanti",
        "date": "05272016",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "BRIEF-Luna Gold announces Greenfields exploration agreement with AngloGold Ashanti "
    },
    {
        "content": "JOHANNESBURG Anglo American and AngloGold Ashanti have reached a $30 million settlement with 4 400 gold miners who contracted the fatal lung disease silicosis while working underground  the companies and lawyers said on Friday.",
        "date": "03042016",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "Anglo American  AngloGold reach $30 mln silicosis settlement with miners "
    },
    {
        "content": "JOHANNESBURG Anglo American and AngloGold Ashanti have reached a $30 million settlement with 4 400 gold miners who contracted the fatal lung disease silicosis while working underground  the companies and lawyers said on Friday.",
        "date": "03042016",
        "name": "AngloGold Ashanti Limited",
        "news_type": "normal",
        "symbol": "AU",
        "title": "Anglo American  AngloGold reach $30 million silicosis settlement with miners "
    },
    {
        "content": "ACCRA  Feb 10 AngloGold Ashanti said on Wednesday its head of corporate affairs in Ghana was killed during a riot involving  illegal miners at its Obuasi mine  which is idle as the company waits for a partner for the operation.",
        "date": "02102016",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "UPDATE 2-AngloGold says Ghana manager killed in riot over illegal mining "
    },
    {
        "content": "JOHANNESBURG  Nov 9 AngloGold Ashanti  said on Monday it lost 47 000 ounces in production in South Africa during the three months to the end of September because of government mandated safety stoppages in a quarter in which five of its miners died on the job.",
        "date": "11092015",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "UPDATE 1-AngloGold loses output over safety issues in South Africa "
    },
    {
        "content": "JOHANNESBURG  Oct 5 The Johannesburg stock market  the capitalist heart of South Africa's 'City of Gold'  is close to relegating the last bullion producer in its bluechip index  the latest sign of the precious metal losing its place in an economy it once dominated.",
        "date": "10062015",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "RPT-South Africa's last bullion bluechip battles relegation "
    },
    {
        "content": "JOHANNESBURG  Oct 5 The Johannesburg stock market  the capitalist heart of South Africa's 'City of Gold'  is close to relegating the last bullion producer in its bluechip index  the latest sign of the precious metal losing its place in an economy it once dominated.",
        "date": "10052015",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "South Africa's last bullion bluechip battles relegation "
    },
    {
        "content": "JOHANNESBURG  Sept 16 Africa's biggest gold producer AngloGold Ashanti said on Wednesday it has signed a deal with Randgold Resources to jointly redevelop its aging Obuasi mine in Ghana.",
        "date": "09162015",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "UPDATE 1-AngloGold to redevelop Ghana mine jointly with Randgold "
    },
    {
        "content": "* Bond yields dip as buyers return   (Updates rand  adds stocks closing prices  fresh quotes)",
        "date": "09112015",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "UPDATE 1-Gold shares lead S.Africa bourse lower  rand flat "
    },
    {
        "content": "Talks on Iamgold Corp's possible purchase of AngloGold  Ashanti Ltd's stakes in two gold mines in Mali are moving along well but there is no urgency to do a deal  AngloGold's chief executive said on Monday.",
        "date": "06082015",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "Mali mine sale talks progress but no urgency: AngloGold CEO "
    },
    {
        "content": "Newmont Mining Corp has agreed to buy the Cripple Creek & Victor gold mine in Colorado from AngloGold Ashanti Ltd for $820 million  giving the world's No. 2 gold producer an expanding asset in a mining-friendly jurisdiction.",
        "date": "06082015",
        "name": "AngloGold Ashanti Limited",
        "news_type": "normal",
        "symbol": "AU",
        "title": "Gold miner Newmont to buy Colorado mine from AngloGold "
    },
    {
        "content": "June 8 Newmont Mining Corp has agreed to buy the Cripple Creek & Victor gold mine in Colorado from AngloGold Ashanti Ltd for $820 million  giving the world's No. 2 gold producer an expanding asset in a mining-friendly jurisdiction.",
        "date": "06082015",
        "name": "AngloGold Ashanti Limited",
        "news_type": "normal",
        "symbol": "AU",
        "title": "UPDATE 2-Gold miner Newmont to buy Colorado mine from AngloGold "
    },
    {
        "content": "June 8 Newmont Mining Corp said on Monday it has agreed to buy the Cripple Creek & Victor gold mine in Colorado from AngloGold Ashanti Ltd for $820 million plus a net smelter royalty.",
        "date": "06082015",
        "name": "AngloGold Ashanti Limited",
        "news_type": "normal",
        "symbol": "AU",
        "title": "Gold miner Newmont agrees to buy Colorado mine from AngloGold "
    },
    {
        "content": "TORONTO/VANCOUVER Newmont Mining Corp  is in exclusive talks with AngloGold Ashanti Ltd  as it moves closer toward clinching a deal to buy the African miner's Cripple Creek & Victor gold mine in Colorado  according to two sources familiar with the matter.",
        "date": "06012015",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "AngloGold in exclusive talks with Newmont on Colorado mine: sources "
    },
    {
        "content": "TORONTO/VANCOUVER  June 1 Newmont Mining Corp  is in exclusive talks with AngloGold Ashanti Ltd  as it moves closer toward clinching a deal to buy the African miner's Cripple Creek & Victor gold mine in Colorado  according to two sources familiar with the matter.",
        "date": "06012015",
        "name": "AngloGold Ashanti Limited",
        "news_type": "normal",
        "symbol": "AU",
        "title": "AngloGold in exclusive talks with Newmont on Colorado mine-sources "
    },
    {
        "content": "NEW YORK Africa's top gold mining company AngloGold Ashanti  is entering second-round talks with two potential partners or buyers for its Cripple Creek & Victor (CC&V) mine in the United States  the Financial Times reported on Sunday.",
        "date": "04122015",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "AngloGold in talks to sell part  all of U.S. mine "
    },
    {
        "content": "April 1 Canadian gold miner Iamgold Corp  is in talks with AngloGold Ashanti Ltd on buying AngloGold's stakes in two gold mines in Mali in which they are partners  Iamgold said late on Tuesday.",
        "date": "04012015",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "Iamgold in talks to buy AngloGold's stakes in two Mali mines "
    },
    {
        "content": "March 31 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "03312015",
        "name": "AngloGold Ashanti Limited",
        "news_type": "topStory",
        "symbol": "AU",
        "title": "Deals of the day- Mergers and acquisitions "
    }
]