[
    {
        "content": "Broadcom Ltd said on Friday it closed its acquisition of network gear maker Brocade Communications Systems Inc  giving it a larger share of the data center products market.",
        "date": "11172017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Broadcom closes $5.5 billion Brocade deal "
    },
    {
        "content": "Nov 17 Broadcom Ltd said on Friday it closed its acquisition of network gear maker Brocade Communications Systems Inc  giving it a larger share of the data center products market.",
        "date": "11172017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "UPDATE 1-Broadcom closes $5.5 billion Brocade deal "
    },
    {
        "content": "Nov 17 Broadcom Ltd said on Friday it completed its $5.5 billion acquisition of network gear maker Brocade Communications Systems Inc.",
        "date": "11172017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Broadcom completes Brocade acquisition "
    },
    {
        "content": "* Broadcom completes acquisition of Brocade Communications Systems Source text for Eikon: Further company coverage:",
        "date": "11172017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom completes acquisition of Brocade Communications Systems "
    },
    {
        "content": "Mobile chipmaker Qualcomm Inc on Monday rejected rival Broadcom Ltd's $103-billion takeover bid  saying the offer undervalued the company and would face regulatory hurdles. | Video ",
        "date": "11132017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Qualcomm rejects Broadcom's $103-billion takeover bid "
    },
    {
        "content": "U.S. House will reject total elimination of state and local tax deductions -Brady",
        "date": "11122017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Reuters Business News Schedule at 2130 GMT/4:30 p.m. ET "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - The chipmaker’s hostile tilt at Qualcomm is a rare aggressive move in the sector. Qualcomm has its own issues  awaiting approval for its NXP deal and fighting Apple in court. It all suggests the tech sector is too frothy. Plus: Is Hong Kong losing its moxie as a financial center?",
        "date": "11102017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Breakingviews - Viewsroom: Broadcom $130 bln bid signals market top "
    },
    {
        "content": "Nov 13 Mobile chipmaker Qualcomm Inc on Monday rejected rival Broadcom Ltd's $103-billion takeover bid  saying the offer undervalued the company and would face regulatory hurdles.",
        "date": "11132017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "UPDATE 4-Qualcomm rejects Broadcom's $103-billion takeover bid "
    },
    {
        "content": "* Broadcom is reviewing candidates for Qualcomm director slate- CNBC‍​",
        "date": "11082017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom reviewing candidates for Qualcomm director slate- CNBC‍​ "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Apple may anoint the winner of Broadcom's $105 billion bid for Qualcomm. A dispute over iPhone royalties left the U.S. chipmaker vulnerable to an opportunistic offer from its acquisitive rival. Settling could preserve Qualcomm’s independence – but it all depends on whether Apple thinks a bigger Broadcom would be slavishly devoted to the handset maker  or just surlier.",
        "date": "11092017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Breakingviews - Apple has deciding vote in Broadcom-Qualcomm deal "
    },
    {
        "content": "Nov 13 Mobile chipmaker Qualcomm Inc on Monday rejected rival Broadcom Ltd's $103-billion takeover bid  saying the offer undervalued the company and would face regulatory hurdles.",
        "date": "11132017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "CORRECTED-UPDATE 2-Qualcomm rejects Broadcom's $103-billion takeover bid "
    },
    {
        "content": "Nov 13 Mobile chipmaker Qualcomm Inc on Monday rejected rival Broadcom Ltd's $103 billion takeover bid  saying the offer \"dramatically\" undervalued the U.S. company.",
        "date": "11132017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Qualcomm rejects Broadcom's $103 billion takeover proposal "
    },
    {
        "content": "* Qualcomm board of directors unanimously rejects Broadcom's unsolicited proposal",
        "date": "11132017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "BRIEF-Qualcomm board unanimously rejects Broadcom's unsolicited proposal "
    },
    {
        "content": "** S&P 500 ends 8-week winning streak  though dips just 0.2 pct as tax plan details weigh",
        "date": "11132017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "RPT-BUZZ-U.S. stocks weekly: Cold front "
    },
    {
        "content": "U.S. chipmaker Qualcomm Inc  is making preparations to reject rival Broadcom Ltd's  $103 billion bid as early as this week  four people familiar with the matter said on Sunday  setting the stage for one of the biggest-ever takeover battles.",
        "date": "11132017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Qualcomm draws up plans to rebuff Broadcom's $103 billion offer: sources "
    },
    {
        "content": "Chip maker Broadcom Ltd made an unsolicited $103 billion bid for Qualcomm Inc on Monday  setting the stage for a takeover battle that could reshape the industry at the heart of mobile phone hardware. | Video ",
        "date": "11062017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Broadcom bids $103 billion for Qualcomm  open to going hostile "
    },
    {
        "content": "Nov 12 U.S. chipmaker Qualcomm Inc is making preparations to reject rival Broadcom Ltd's $103 billion bid as early as this week  four people familiar with the matter said on Sunday  setting the stage for one of the biggest-ever takeover battles.",
        "date": "11132017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "REFILE-Qualcomm draws up plans to rebuff Broadcom's $103 billion offer -sources "
    },
    {
        "content": "* Nasdaq hits another record high; dollar in tight range (Adds all three major U.S. indexes closed at record highs)",
        "date": "11062017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "GLOBAL MARKETS-Oil surges to over two-year peak; Wall St climbs to record highs "
    },
    {
        "content": "Communications chipmaker Broadcom Ltd  is planning to unveil a bid for smartphone chip supplier Qualcomm Inc  by Monday  three sources familiar with the matter said on Friday  an attempt to create a roughly $200-billion company through the biggest technology acquisition ever. | Video ",
        "date": "11042017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Broadcom plans record tech deal with Qualcomm bid: sources "
    },
    {
        "content": "Nov 3 Communications chipmaker Broadcom Ltd is planning to unveil a bid for smartphone chip supplier Qualcomm Inc by Monday  three sources familiar with the matter said on Friday  an attempt to create a roughly $200-billion company through the biggest technology acquisition ever.",
        "date": "11032017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "UPDATE 5-Broadcom plans record tech deal with Qualcomm bid -sources "
    },
    {
        "content": "WASHINGTON Chipmaker Broadcom Ltd  plans to redomicile to the United States from Singapore  President Donald Trump said on Thursday at a White House news conference where the company's chief executive cited Republican tax efforts.",
        "date": "11022017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Broadcom redomiciling to U.S. from Singapore "
    },
    {
        "content": "Nov 6 Chip maker Broadcom Ltd made an unsolicited $103 billion bid for Qualcomm Inc on Monday  setting the stage for a takeover battle that could reshape the industry at the heart of mobile phone hardware.",
        "date": "11062017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "UPDATE 6-Broadcom bids $103 bln for Qualcomm  open to going hostile "
    },
    {
        "content": "A surge in shares of heavyweight Apple helped push up major Wall Street indexes on Friday  as investors also assessed a mixed U.S. labor market report. | Video ",
        "date": "11032017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Apple juices Wall St. as indexes climb for another week "
    },
    {
        "content": "WASHINGTON  Nov 2 Chipmaker Broadcom Ltd plans to redomicile to the United States from Singapore  President Donald Trump said on Thursday at a White House news conference where the company's chief executive cited Republican tax efforts.",
        "date": "11022017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "UPDATE 1-Broadcom redomiciling to U.S. from Singapore "
    },
    {
        "content": "Nov 6 The following bids  mergers  acquisitions and disposals were reported by 2030 GMT on Monday:",
        "date": "11062017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Nasdaq hits another record high; dollar in tight range (Updates market indexes  adds Dudley)",
        "date": "11062017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "GLOBAL MARKETS-Oil surges to over two-year peak; shares near flat "
    },
    {
        "content": "Nov 3 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "11032017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "UPDATE 1-Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "WASHINGTON  Nov 2 President Donald Trump said on Thursday that chipmaker Broadcom Ltd is moving its headquarters from Singapore to the United States.",
        "date": "11022017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Broadcom moving headquarters to U.S. from Singapore -Trump "
    },
    {
        "content": "* Broadcom Limited announces intention to redomicile in the United States",
        "date": "11022017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom announces intention to redomicile in the U.S. "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Chipmakers like Freescale Semiconductor and NXP Semiconductors took a high-profile role in the leveraged-buyout binge that preceded the financial crisis – and the distress that followed it. That makes Broadcom’s roughly $105 billion unsolicited offer for Qualcomm on Monday all the more edgy. The borrowing associated with a deal  if it happens  could be in record amounts and may send debt-to-EBITDA ratios uncomfortably high.",
        "date": "11062017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Breakingviews - Broadcom faces down ghost of chip LBOs past "
    },
    {
        "content": "Nov 3 Broadcom Ltd is exploring a deal to buy smartphone chip maker Qualcomm Inc  in what could be the biggest ever acquisition of a chipmaker  Bloomberg News reported on Friday.",
        "date": "11032017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Broadcom explores deal to buy Qualcomm-Bloomberg "
    },
    {
        "content": "* Broadcom Limited updates fourth quarter fiscal year 2017 revenue outlook",
        "date": "11022017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom updates Q4 fiscal year 2017 revenue outlook "
    },
    {
        "content": "* Nasdaq hits new record high; dollar in tight range (Updates with U.S. market open; changes dateline and byline)",
        "date": "11062017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "GLOBAL MARKETS-Oil surges to over two-year peak; shares little changed "
    },
    {
        "content": "* Qualcomm confirms receipt of unsolicited proposal from Broadcom",
        "date": "11062017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "BRIEF-Qualcomm confirms receipt of unsolicited proposal from Broadcom "
    },
    {
        "content": "* Broadcom explores deal to acquire chipmaker Qualcomm- Bloomberg citing sources‍​",
        "date": "11032017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom explores deal to acquire chipmaker Qualcomm- Bloomberg citing sources‍​ "
    },
    {
        "content": "* Qualcomm is set to reject Broadcom’s takeover offer; views rival’s $130 bn proposal as too low and fraught with regulatory risks- FT  citing sources‍​ Source text : http://on.ft.com/2ixBUvG",
        "date": "11062017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "BRIEF-Qualcomm set to reject Broadcom's takeover offer - FT‍​ "
    },
    {
        "content": "* Arris International Plc - ‍on October 12  2017  Broadcom  Brocade and Arris withdrew and re-filed their joint voluntary notice to CFIUS",
        "date": "10162017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Arris International  Broadcom and Brocade withdraw and re-file joint voluntary notice to CFIUS "
    },
    {
        "content": "* Issues statement in response to litigation filed by Taiwan Semiconductor Manufacturing Company Limited against co",
        "date": "10162017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "BRIEF-‍Tessera Technologies issues statement in response to litigation filed by Taiwan Semiconductor Manufacturing Company "
    },
    {
        "content": "* Broadcom announces pricing of private offering of senior notes",
        "date": "10102017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom posts pricing of private offering of senior notes "
    },
    {
        "content": "* Broadcom - German federal patent court issued preliminary opinion that all claims of Invensas patent asserted against co \"should be null and void\"​",
        "date": "10102017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom - German patent court opinion is that Invensas patent claims against co \"should be null and void\"​ "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 10 (Fitch) Fitch Ratings has affirmed Broadcom Limited's (Broadcom) wholly-owned subsidiary  Broadcom Cayman Finance Ltd.'s Long-Term Issuer Default Rating (IDR) at 'BBB'. Fitch has also assigned a 'BBB' rating to the proposed benchmark sized multi-tranche offering of senior unsecured notes. The Rating Outlook remains Positive. The rating actions also affect $13.6 billion of outstanding senior unsecured notes. Broadcom ",
        "date": "10102017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Fitch Affirms Broadcom Cayman Finance Ltd at 'BBB'; Outlook Positive "
    },
    {
        "content": "* Arris statement re: Ruckus acquisition  following Broadcom's CFIUS refiling",
        "date": "10032017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Arris statement re: Ruckus acquisition  following Broadcom's CFIUS refiling "
    },
    {
        "content": "* Broadcom Ltd - ‍On October 2  co  Brocade withdrew and re-filed their joint voluntary notice to CFIUS - SEC filing​",
        "date": "10032017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom and Brocade withdrew and re-filed their joint voluntary notice to CFIUS "
    },
    {
        "content": "* Broadcom Ltd - ‍board of directors has approved a quarterly  interim cash dividend of $1.02 per ordinary share​ Source text for Eikon: Further company coverage:",
        "date": "08292017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom Ltd - ‍board of directors has approved a quarterly  interim cash dividend of $1.02 per ordinary share​ "
    },
    {
        "content": "* Broadcom Ltd announces third quarter fiscal year 2017 financial results",
        "date": "08242017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom reports Q3 non-GAAP earnings per share of $4.10 from continuing operations "
    },
    {
        "content": "BEIJING  Aug 23 China's commerce ministry has conditionally approved chipmaker Broadcom Ltd's acquisition of Brocade Communications Systems  it said on Wednesday.",
        "date": "08232017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "China conditionally approves Broadcom's acquisition of Brocade Comms "
    },
    {
        "content": "* Broadcom Ltd - ‍launching Max Wifi​ Source text for Eikon: Further company coverage:",
        "date": "08152017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom Ltd - ‍launching Max Wifi​ "
    },
    {
        "content": "* Brocade Communications - ‍on July 17  following discussions with CFIUS  co   Broadcom agreed to withdraw  re-file joint voluntary notice to CFIUS",
        "date": "07182017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Brocade Communications agrees to withdraw  re-file joint voluntary notice to CFIUS "
    },
    {
        "content": "WASHINGTON Chipmaker Broadcom Limited  has won U.S. antitrust approval to buy Brocade Communications Systems   the Federal Trade Commission said on Monday.",
        "date": "07032017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Broadcom wins U.S. antitrust consent to buy Brocade: FTC "
    },
    {
        "content": "WASHINGTON  July 3 Chipmaker Broadcom Limited has won U.S. antitrust approval to buy Brocade Communications Systems  the Federal Trade Commission said on Monday.",
        "date": "07032017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "UPDATE 1-Broadcom wins U.S. antitrust consent to buy Brocade -FTC "
    },
    {
        "content": "WASHINGTON  July 3 Chipmaker Broadcom Limited has won U.S. antitrust approval to buy Brocade Communications Systems with conditions  the Federal Trade Commission said on Monday.",
        "date": "07032017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Broadcom wins U.S. antitrust consent to buy Brocade with conditions -FTC "
    },
    {
        "content": "* Tessera receives favorable notice of initial determination in Broadcom ITC investigation",
        "date": "07012017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Tessera receives favorable notice of initial determination in Broadcom ITC investigation "
    },
    {
        "content": "* Broadcom backs away from $20 billion bid for Toshiba chip business - CNBC  citing sources Source text - http://cnb.cx/2sQbqMT Further company coverage: (Bengaluru Newsroom)",
        "date": "06212017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom backs away from $20 bln bid for Toshiba chip business - CNBC  citing sources "
    },
    {
        "content": "TOKYO Toshiba Corp  has chosen a consortium of Bain Capital and Japanese government investors as the preferred bidder for its chip business  aiming to seal a deal worth some $18 billion by next week as it scrambles for funds to cover massive losses. | Video ",
        "date": "06212017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Toshiba picks Bain-Japan government group to buy chip unit  big hurdles remain "
    },
    {
        "content": "* Bain to be main investor  putting up $7.7 bln in equity -sources",
        "date": "06212017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "UPDATE 3-Toshiba picks Bain-Japan govt group to buy chip unit  big hurdles remain "
    },
    {
        "content": "TOKYO/SAN FRANCISCO Toshiba Corp  aims to name a winner for its prized semiconductor business next week  people familiar with the matter said on Wednesday  as a row with one of the bidders over the sale appeared to escalate.",
        "date": "06082017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Exclusive: Toshiba aims to name buyer of $18 billion chips business on June 15 "
    },
    {
        "content": "TOKYO  June 8 Japan's Nikkei share average hovered in positive terrain on Thursday  with the yen moving away from recent highs and Wall Street edging up  but market participants were on guard ahead of key events.",
        "date": "06082017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Nikkei edges up  but caution prevails ahead of global events "
    },
    {
        "content": "TOKYO Shares of Toshiba Corp jumped on Thursday after people familiar with the matter said it aims to name a winner for its prized semiconductor business next week.",
        "date": "06082017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Toshiba shares up after sources say it aims to name chip ops buyer on June 15 "
    },
    {
        "content": "* Broadcom limited announces second quarter fiscal year 2017 financial results and interim dividend",
        "date": "06012017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom reports Q2 EPS $1.05 "
    },
    {
        "content": "TOKYO  June 6 Shares in Toshiba Corp rose as much as 4 percent in early Tuesday trading after Asahi newspaper reported it is considering giving U.S. chipmaker Broadcom Ltd the exclusive rights to negotiate to buy its prized chip unit.",
        "date": "06062017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Toshiba shares rise on report Broadcom chosen as chip unit buyer "
    },
    {
        "content": "* On May 26 Japan Fair Trade Commission granted antitrust clearance of merger with Broadcom Limited - SEC filing Source text for Eikon: Further company coverage:",
        "date": "05262017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Japan Fair Trade Commission granted antitrust clearance of merger of Brocade with Broadcom "
    },
    {
        "content": "BRUSSELS Chipmaker Broadcom secured EU antitrust approval on Friday for its $5.5 billion bid for Brocade after pledging to cooperate with competitors and to protect their confidential data.",
        "date": "05122017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Broadcom wins conditional EU okay for $5.5 billion Brocade buy "
    },
    {
        "content": "BRUSSELS  May 12 Chipmaker Broadcom secured EU antitrust approval on Friday for its $5.5 billion bid for Brocade after pledging to cooperate with competitors and to protect their confidential data.",
        "date": "05122017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Broadcom wins conditional EU okay for $5.5 bln Brocade buy "
    },
    {
        "content": "BRUSSELS Chipmaker Broadcom  is set to win EU antitrust approval for its $5.5 billion bid for Brocade  after agreeing to modest concessions in the latest deal in the chip sector  three people familiar with the matter said on Tuesday.",
        "date": "05092017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Exclusive: EU regulators to approve $5.5 billion Broadcom  Brocade deal "
    },
    {
        "content": "* Not considering bidding for Toshiba chip unit -CFO (Adds CFO comments on existing businesses  Toshiba chip sale)",
        "date": "04262017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "UPDATE 1-Canon raises annual profit outlook on Toshiba medical unit acquisition "
    },
    {
        "content": "TOKYO A Japanese government-backed fund and policy bank are considering a joint bid with Broadcom Ltd  for Toshiba Corp's  semiconductor business  a move that would vault the U.S. chipmaker into the lead to buy the prized unit  the Asahi newspaper said on Wednesday.",
        "date": "04182017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Japan government fund  bank mull bid with Broadcom for Toshiba chip unit: media "
    },
    {
        "content": "TOKYO  April 19 A Japanese government-backed fund and policy bank are considering a joint bid with Broadcom Ltd for Toshiba Corp's semiconductor business  a move that would vault the U.S. chipmaker into the lead to buy the prized unit  the Asahi newspaper said on Wednesday.",
        "date": "04182017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Japan govt fund  bank mull bid with Broadcom for Toshiba chip unit -media "
    },
    {
        "content": "TOKYO Broadcom Ltd  offered about 2.5 trillion yen ($23 billion) for Toshiba Corp's  chip unit  the highest among 10 or so bidders who participated in the first round of offers  a source briefed on the matter said.",
        "date": "04122017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Broadcom makes highest first-round bid of $23 bln for Toshiba chip unit: source "
    },
    {
        "content": "April 10 Taiwan's Foxconn has indicated that it may pay as much as 3 trillion yen ($26.99 billion) for Toshiba Corp's chip business  Bloomberg reported on Monday  citing people familiar with the matter.",
        "date": "04102017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Foxconn could bid up to $27 bln for Toshiba's chip business-Bbg "
    },
    {
        "content": "TOKYO  April 12 Broadcom Ltd offered about 2.5 trillion yen ($23 billion) for Toshiba Corp's chip unit  the highest among 10 or so bidders who participated in the first round of offers  a source briefed on the matter said.",
        "date": "04122017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Broadcom makes highest first-round bid of $23 bln for Toshiba chip unit -source "
    },
    {
        "content": "TOKYO/SAN FRANCISCO Japan's Toshiba Corp  has narrowed down the field of bidders for its chip unit to four suitors including Broadcom Ltd  and Western Digital Corp   two sources with knowledge of the matter said.",
        "date": "04122017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Broadcom  Western Digital among four suitors for Toshiba chip unit - sources "
    },
    {
        "content": "TOKYO/SAN FRANCISCO  April 12 Japan's Toshiba Corp has narrowed down the field of bidders for its chip unit to four suitors including Broadcom Ltd and Western Digital Corp  two sources with knowledge of the matter said.",
        "date": "04122017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Broadcom  Western Digital among four suitors for Toshiba chip unit -sources "
    },
    {
        "content": "TOKYO  March 31 U.S. private equity firm Silver Lake Partners LP and U.S. chipmaker Broadcom Ltd have offered Toshiba Corp about 2 trillion yen ($17.9 billion) for its chip unit  the Nikkei business daily reported on Friday.",
        "date": "03312017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Toshiba offered $17.9 bln for chip unit by Silver Lake and Broadcom-Nikkei "
    },
    {
        "content": "* Arris to acquire Ruckus Wireless and ICX switch business for $800 million in cash",
        "date": "02222017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Arris to acquire Ruckus Wireless and ICX switch business for $800 million in cash "
    },
    {
        "content": "* Broadcom Ltd - CEO Hock E. Tan's 2016 total compensation was $24.7 million versus $4 million in 2015",
        "date": "02172017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom says CEO Hock Tan's 2016 compensation was $24.7 mln vs $4 mln in 2015 "
    },
    {
        "content": "* Third Point LLC takes share stake of 2.7 million shares in Rice Energy Inc - SEC filing",
        "date": "02102017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Third Point takes share stake in Rice Energy  Broadcom  Southwestern Energy "
    },
    {
        "content": "* Brocade Communications Systems-on feb 3  2017  co  broadcom got a request for additional information from FTC relating to merger - sec filing",
        "date": "02072017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom receives request for more merger information from FTC - SEC filing "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 11 (Fitch) Fitch Ratings has taken the following rating actions  on Broadcom Limited (Broadcom) wholly-owned subsidiary  Broadcom Cayman Finance  Limited  following the subsidiary's $12 billion unsecured senior notes private  placement including:  --Long-Term Issuer Default Rating (IDR) upgraded to 'BBB' from 'BBB-'; --$12 billion senior unsecured notes rated 'BBB'.  Fitch also revised the Rating Outlook to Positive fro",
        "date": "01112017",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Fitch Upgrades Broadcom Cayman Finance Ltd. to 'BBB' from 'BBB-'; Outlook Positive "
    },
    {
        "content": "* Broadcom Ltd - net proceeds from sale of notes to repay indebtedness outstanding under Broadcom's credit facility  Source text for Eikon:  Further company coverage:",
        "date": "01112017",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom announces private offering of senior notes "
    },
    {
        "content": "NEW YORK (Reuters LPC) - Six banks will be providing a US$6.5bn financing backing chipmaker Broadcom's acquisition of Brocade  a maker of networking switches  software and storage products  two sources familiar with the financing said.",
        "date": "11082016",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Exclusive: Broadcom lines up $6.5 billion bridge loan for Brocade buy "
    },
    {
        "content": "* Brocade communications systems - upon termination of merger agreement under specified circumstances  co to pay broadcom termination fee of $195 million  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "11022016",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Brocade Communications Systems - To pay Broadcom $195 mln if terminates deal "
    },
    {
        "content": "* Broadcom Limited to acquire Brocade Communications Systems Inc for $5.9 billion",
        "date": "11022016",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom Limited to acquire Brocade Communications Systems Inc for $5.9 billion "
    },
    {
        "content": "SAN FRANCISCO - Chipmaker Broadcom Ltd is nearing a deal to acquire network gear maker Brocade Communications Systems Inc in a deal that could be announced later this week  people familiar with the matter said on Tuesday.",
        "date": "11012016",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Broadcom nears deal to buy Brocade: sources "
    },
    {
        "content": "* Broadcom Limited affirms fourth quarter fiscal year 2016 guidance and tightens revenue to upper end of range. Broadcom limited to announce fourth quarter and fiscal year 2016 financial results on Thursday  December 8  2016",
        "date": "11022016",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom Limited affirms fourth quarter fiscal year 2016 guidance "
    },
    {
        "content": "Nov 2 Chipmaker Broadcom Ltd said on Wednesday it would buy network gear maker Brocade Communications Systems Inc for $5.5 billion in cash  to expand its fibre channel and storage businesses.",
        "date": "11022016",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Chipmaker Broadcom to buy network gear maker Brocade for $5.5 bln "
    },
    {
        "content": "* Broadcom would plan to divest Brocade's IP networking unit-sources",
        "date": "11012016",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "UPDATE 1-Broadcom nears deal to buy Brocade -sources "
    },
    {
        "content": "Nov 1 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "11012016",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Broadcom would plan to divest Brocade's IP networking unit-sources",
        "date": "11012016",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "CORRECTED-Broadcom nears deal to buy Brocade -sources "
    },
    {
        "content": "Oct 21 Qualcomm Inc is nearing a deal to acquire NXP Semiconductors NV for around $37 billion  a person familiar with the matter said on Friday  as the U.S. company seeks to expand the reach of its chips from phones to cars.",
        "date": "10212016",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "UPDATE 1-Qualcomm nears $37 billion deal to buy NXP Semiconductors -source "
    },
    {
        "content": "* Broadcom Ltd - effective Oct 14 Anthony Maslowski's  former senior vice president and cfo  employment with Broadcom  was terminated",
        "date": "10172016",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom: Maslowski's employment with the company has been terminated "
    },
    {
        "content": "NEW YORK  Oct 2 The stock of chipmaker Broadcom Ltd could increase by more than 20 percent thanks to what appears to be a growing relationship with Apple  according to Barron's.",
        "date": "10022016",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Broadcom's stock could increase by more than 20 pct -Barron's "
    },
    {
        "content": "* Closed its previously announced acquisition of wireless Internet of Things (IOT) business and related assets of Broadcom Ltd  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07052016",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Cypress Semiconductor closes acquisition of wireless Internet of Things business and related assets of Broadcom Ltd "
    },
    {
        "content": "* Says it expects to dispose machinery equipment for operation to Broadcom Limited  transaction price up to $56.2 million",
        "date": "06082016",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Taiwan's ASE expects to dispose machinery equipment for operation to Broadcom Ltd "
    },
    {
        "content": "* Broadcom Limited announces second quarter fiscal year 2016 financial results and interim dividend",
        "date": "06022016",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom reports Q2 loss per share $3.02 "
    },
    {
        "content": "* Broadcom is not an existing tessera customer  proceedings announced do not affect q2 guidance of fy revenue guidance",
        "date": "05232016",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Tessera Technologies files legal proceedings against Broadcom "
    },
    {
        "content": "* Announced an expanded  exclusive distribution agreement with Broadcom Limited",
        "date": "05232016",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "BRIEF-Avnet signs distribution agreement with Broadcom "
    },
    {
        "content": "* Third Point Llc Takes Share Stake Of 6.0 Mln Shares In Baxalta Inc",
        "date": "05132016",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Third Point LLC dissolves share stake in Avago  Axalta "
    },
    {
        "content": "* Third Point LLC takes share stake of 225 000 shares in Intercontinental Exchange",
        "date": "05132016",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "BRIEF-Third Point dissolves stake in Morgan Stanley  takes stake in Broadcom "
    },
    {
        "content": "* Cypress to acquire Broadcom's Wireless Internet of Things business",
        "date": "04282016",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Cypress to buy Broadcom's Wireless Internet of Things business "
    },
    {
        "content": "April 28 Chipmaker Cypress Semiconductor Corp  said it agreed to buy Broadcom Ltd's Internet of Things (IoT) business and related assets for $550 million in cash.",
        "date": "04282016",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Cypress Semi to buy Broadcom's Internet of Things business "
    },
    {
        "content": "* Says introduces enterprise 5G-HD Wi-fi platform for next-generation enterprises  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04122016",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Broadcom introduces Enterprise 5G-HD Wi-Fi platform for next-generation enterprises "
    },
    {
        "content": "* Capital World Investors reports 10.1 percent passive stake in Broadcom Ltd as of March 31  2016 - SEC filing    Source text for Eikon:    Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04082016",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Capital World Investors reports 10.1 percent passive stake in Broadcom Ltd "
    },
    {
        "content": "Chipmaker Broadcom Ltd  the company created following the merger of Avago and Broadcom  said it would cut about 1 900 jobs globally across its businesses.",
        "date": "03032016",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Apple supplier Broadcom to slash 1 900 jobs globally "
    },
    {
        "content": "March 3 Chipmaker Broadcom Ltd  the company created following the merger of Avago and Broadcom  said it would cut about 1 900 jobs globally across its businesses.",
        "date": "03032016",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "UPDATE 1-Apple supplier Broadcom to slash 1 900 jobs globally "
    },
    {
        "content": "March 3 Chipmaker Broadcom Ltd  the company created following the merger of Avago and Broadcom  said it would cut about 1 900 jobs across businesses globally.",
        "date": "03032016",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Broadcom to cut 1 900 jobs globally "
    },
    {
        "content": "Virtualization software maker VMWare Inc said it appointed former Broadcom executive Rajiv Ramaswami as general manager and executive vice-president of its networking and security business.",
        "date": "02242016",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Former Broadcom executive Rajiv Ramaswami joins software maker VMWare "
    },
    {
        "content": "Feb 24 Virtualization software maker VMWare Inc  said it appointed former Broadcom executive Rajiv Ramaswami as general manager and executive vice-president of its networking and security business.",
        "date": "02242016",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Former Broadcom exec Rajiv Ramaswami joins software maker VMWare "
    },
    {
        "content": "* Says it acquired the fiber optic products division of Avago Technologies Ltd",
        "date": "01262016",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "BRIEF-Taiwan's Hon Hai unit buys fiber optic division of Avago Technologies "
    },
    {
        "content": "BRUSSELS  Nov 23 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "11232015",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "EU mergers and takeovers (Nov 23) "
    },
    {
        "content": "BRUSSELS European antitrust regulators cleared on Monday Avago Technologies Ltd's  planned $37 billion takeover of  rival chipmaker Broadcom Corp  without conditions.",
        "date": "11232015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Avago secures unconditional EU approval for $37 billion Broadcom buy "
    },
    {
        "content": "BRUSSELS  Nov 23 European antitrust regulators cleared on Monday Avago Technologies Ltd's planned $37 billion takeover of  rival chipmaker Broadcom Corp  without conditions.",
        "date": "11232015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Avago secures unconditional EU approval for $37 bln Broadcom buy "
    },
    {
        "content": "BRUSSELS  Nov 20 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "11202015",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "EU mergers and takeovers (Nov 20) "
    },
    {
        "content": "BRUSSELS U.S. chipmaker Avago Technologies  is set to win unconditional approval by the European Union's competition regulators for its proposed $37 billion takeover of Broadcom Corp   two people familiar with the matter said on Tuesday.",
        "date": "11032015",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Exclusive: EU to clear $37 billion Avago  Broadcom deal without conditions - sources "
    },
    {
        "content": "Oct 8 Dell Inc is in talks with banks to fund a takeover of data storage company EMC Corp  sources familiar with the matter said  as the world's No.3 PC maker looks to beef up its cloud-based offerings for corporate customers.",
        "date": "10082015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "UPDATE 7-Dell looks to EMC deal to boost corporate presence "
    },
    {
        "content": "BRUSSELS  Oct 5 European Union antitrust regulators will rule by Nov. 9 whether to clear a $37 billion bid by U.S. chipmaker Avago Technologies for rival Broadcom Corp  the biggest ever merger in the sector.",
        "date": "10052015",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "EU regulators to decide on $37 bln Avago  Broadcom deal by Nov. 9 "
    },
    {
        "content": "Oct 8 Dell Inc is in talks with banks to fund a $50 billion-plus takeover of data storage company EMC Corp  sources familiar with the matter said  as the world's No.3 PC maker looks to beef up its cloud-based offerings for corporate customers.",
        "date": "10082015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "CORRECTED-UPDATE 5-Dell looking at $50 bln EMC deal to boost corporate presence "
    },
    {
        "content": "NEW YORK  Sept 3 Big issuers of US leveraged loans including cable company Charter Communications Inc  and chipmaker Avago Technologies will test the US leveraged loan market by launching jumbo deals after the Labor Day holiday  but could benefit from a flight to quality after global equity market turmoil.",
        "date": "09032015",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "TRLPC: Stronger US credits to benefit from flight to quality "
    },
    {
        "content": "NEW YORK  July 6 Hedging activity is rising for U.S. semiconductor stocks as investors fear that sector earnings may be weak  and share prices may fall after a recent flourish in mergers and acquisitions.",
        "date": "07062015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Options traders exhibit caution ahead of chip earnings "
    },
    {
        "content": "SINGAPORE/TAIPEI Chip companies are merging  signing $66 billion worth of deals this year alone in preparation for an explosion of demand from all walks of life as the next technological revolution takes hold: the Internet of Things.",
        "date": "06082015",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Connected cows  cars and crockery prod chip mega mergers "
    },
    {
        "content": "NEW YORK Avago Technologies Ltd  has lined up five banks to back its $37 billion acquisition of Broadcom Corp   the largest merger of chipmakers.",
        "date": "06052015",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Avago taps five banks for Broadcom acquisition loan "
    },
    {
        "content": "NEW YORK  June 5 Avago Technologies Ltd  has lined up five banks to back its $37 billion acquisition of Broadcom Corp  the largest merger of chipmakers.",
        "date": "06052015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "TRLPC: Avago taps five for Broadcom acquisition loan "
    },
    {
        "content": "NEW YORK  June 4 Huge takeovers by companies including cable operator Charter Communications Inc and chipmaker Avago Technologies promise to propel merger and acquisition loan volume from strong to certifiably robust as deals were announced at a record-breaking pace in May.",
        "date": "06042015",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "TRLPC: Record M&A fuels investment grade loan issuance "
    },
    {
        "content": " (Corrects May 29 story to correct name in final paragraph to Foerster from Forester)",
        "date": "05292015",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Avago to buy Broadcom for $37 billion in biggest-ever chip deal "
    },
    {
        "content": "* To pay Broadcom shareholders $17 bln in cash  $20 bln in shares",
        "date": "05292015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "CORRECTED-UPDATE 5-Avago to buy Broadcom for $37 bln in biggest-ever chip deal "
    },
    {
        "content": "Avago Technologies Ltd's  $37 billion deal to buy chipmaker Broadcom  Corp  creates new competitive challenges for Qualcomm and may force the world's largest mobile chip maker to radically rethink its own strategy.",
        "date": "05282015",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Avago  Broadcom deal could put pressure on Qualcomm "
    },
    {
        "content": "Avago Technologies Ltd  on Thursday agreed to buy Broadcom Corp  for $37 billion in the largest chip industry deal ever  turning a lesser-known company run by a ferocious dealmaker into one of the biggest industry players.",
        "date": "05282015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Factbox: Notable U.S. semiconductor M&A deals since December 2013 "
    },
    {
        "content": "Avago Technologies Ltd is close to an agreement to acquire fellow chipmaker Broadcom Corp  people familiar with the matter said on Wednesday  in a deal that could boost Avago's clientele of top-tier smartphone companies.",
        "date": "05272015",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Avago nears deal for fellow chipmaker Broadcom: sources "
    },
    {
        "content": "* To pay Broadcom shareholders $17 bln in cash  $20 bln in shares",
        "date": "05282015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "UPDATE 5-Avago to buy Broadcom for $37 bln in biggest-ever chip deal "
    },
    {
        "content": "May 28 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "05282015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "NEW YORK News that chipmaker Broadcom Corp is in talks to be bought by Avago Technologies Ltd spurred a flurry of trades in Broadcom's short-term calls  and timely buyers of the options could reap huge gains.",
        "date": "05272015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Broadcom call buying surges on report of deal with Avago "
    },
    {
        "content": "* Indexes down: Dow 0.35 pct  S&P 0.33 pct  Nasdaq 0.32 pct   (Adds details  changes comment  updates prices)",
        "date": "05282015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "US STOCKS-Wall St lower as Greece  China weighs "
    },
    {
        "content": "* Indexes down: Dow 0.29 pct  S&P 0.2 pct  Nasdaq 0.27 pct   (Adds details  updates prices)",
        "date": "05282015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "US STOCKS-Wall St falls amid Greece worries  China tumble "
    },
    {
        "content": "May 27 Avago Technologies Ltd is close to an agreement to acquire fellow chipmaker Broadcom Corp   people familiar with the matter said on Wednesday  in a deal that could boost Avago's clientele of top-tier smartphone companies.",
        "date": "05272015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "UPDATE 2-Avago nears deal for fellow chipmaker Broadcom - sources "
    },
    {
        "content": "* Futures down: Dow 60 pts  S&P 4.5 pts  Nasdaq 6 pts   (Adds details  comment  updates prices)",
        "date": "05282015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "US STOCKS-Wall St set to open lower amid worries about Greece "
    },
    {
        "content": "* Indexes end up: Dow 0.7 pct  S&P 0.9 pct  Nasdaq 1.5 pct   (Updates to close)",
        "date": "05272015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "US STOCKS-Tech  healthcare lead Wall St higher; Nasdaq hits record "
    },
    {
        "content": "May 28 Avago Technologies Ltd said it would buy fellow chipmaker Broadcom Corp in a cash-and-stock deal valued at $37 billion.",
        "date": "05282015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Avago to buy Broadcom in $37 bln deal "
    },
    {
        "content": "May 27 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "05272015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "May 27 Chipmaker Broadcom Corp is in talks to be bought by Avago Technologies Ltd  the Wall Street Journal reported on Wednesday.",
        "date": "05272015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Broadcom in advanced talks to be bought by Avago - WSJ "
    },
    {
        "content": "May 14 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "05142015",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Avago Technologies Ltd  looking to acquire a fellow chipmaker  has reached out to potential targets including Xilinx Inc  Renesas Electronics Corp and Maxim Integrated Products Inc  according to people familiar with the matter.",
        "date": "05142015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Exclusive: Avago shows interest in Xilinx  Renesas  Maxim - sources "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK  March 6 Avago Technologies Ltd  may be one of the pacesetters among companies looking to make a purchase in the semiconductor industry after its advanced talks last month to acquire Freescale Semiconductor Ltd fell through.",
        "date": "03062015",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "RPT - DEALTALK-Avago's ambitions may spark more semiconductor dealmaking "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK Avago Technologies Ltd   may be one of the pacesetters among companies looking to make a purchase in the semiconductor industry after its advanced talks last month to acquire Freescale Semiconductor Ltd  fell through.",
        "date": "03062015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Avago's ambitions may spark more semiconductor dealmaking "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK  March 6 Avago Technologies Ltd  may be one of the pacesetters among companies looking to make a purchase in the semiconductor industry after its advanced talks last month to acquire Freescale Semiconductor Ltd fell through.",
        "date": "03062015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "DEALTALK-Avago's ambitions may spark more semiconductor dealmaking "
    },
    {
        "content": "March 5 The following corporate finance-related stories were reported by media:",
        "date": "03052015",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "UPDATE 1-Market Chatter-Corporate finance press digest "
    },
    {
        "content": "Avago Technologies Ltd held advanced talks last month to acquire Freescale Semiconductor Ltd  and is still looking for an acquisition that could be transformative  according to four people familiar with the situation.",
        "date": "03042015",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "Exclusive: Avago vied for Freescale  still seeking large deal - sources "
    },
    {
        "content": "March 5 The following corporate finance-related stories were reported by media:",
        "date": "03052015",
        "name": "Broadcom Limited",
        "news_type": "normal",
        "symbol": "AVGO",
        "title": "Market Chatter- Corporate finance press digest "
    },
    {
        "content": "(Corrects to say Avago Technologies is acquiring Emulex) Feb 25 Emulex Corp :  * Avago Technologies Limited to acquire Emulex Corporation for $8 per share in cash  * Says deal expected to be immediately accretive to Avago's EPS  on a non-GAAP basis  * Says Avago expects to fund the transaction with cash available on its balance sheet  * Says deal for about $606 million  * Says Emulex to operate as a business unit within Avago's enterprise storage segment  * Says agreement has been ap",
        "date": "02252015",
        "name": "Broadcom Limited",
        "news_type": "topStory",
        "symbol": "AVGO",
        "title": "CORRECTED-BRIEF-Avago Technologies to acquire Emulex for $8 per share in cash "
    }
]