[
    {
        "content": "* Axis capital holdings ltd qtrly adjusted loss per share $‍5.35​",
        "date": "10262017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital says reports quarterly loss of $‍5.61 per share​ "
    },
    {
        "content": "* Axis Capital provides estimated net financial impact of third quarter 2017 catastrophe losses",
        "date": "10122017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital estimates catastrophe losses for Q3 "
    },
    {
        "content": "BRUSSELS  Oct 6 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10062017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "EU mergers and takeovers (Oct 6) "
    },
    {
        "content": "* Axis Capital Holdings Ltd - deal for ‍of 715 pence per share​",
        "date": "10022017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital acquires shares of Novae Group PLC "
    },
    {
        "content": "BRUSSELS  Sept 18 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "09182017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "EU mergers and takeovers (Sept 18) "
    },
    {
        "content": "BRUSSELS  Sept 15 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "09152017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "EU mergers and takeovers (Sept 15) "
    },
    {
        "content": "* Q2 earnings per share view $1.19 -- Thomson Reuters I/B/E/S",
        "date": "07262017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital Q2 earnings per share $1.01 "
    },
    {
        "content": "* Axis Capital Holdings Ltd -  effective August 4  Axis Managing Agency will assume management of Axis Syndicate 1686 at Lloyd's",
        "date": "07142017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital approves to launch Lloyd’S managing agency "
    },
    {
        "content": "Lloyd's of London insurer Novae Group Plc  has agreed to be taken over by Axis Capital Holdings Ltd   a Bermuda-based specialty insurer and reinsurer  for 467.6 million pounds ($605.07 million) in cash  sending its shares soaring over 20 percent.",
        "date": "07062017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Axis Capital to buy Lloyd's of London insurer Novae for $605 million "
    },
    {
        "content": "* Global Specialty (re)Insurer Axis Capital announces acquisition of Novae",
        "date": "07052017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital to acquire Novae for $604 mln "
    },
    {
        "content": "July 6 Lloyd's of London insurer Novae Group Plc has agreed to be taken over by Axis Capital Holdings Ltd   a Bermuda-based speciality insurer and reinsurer  for 467.6 million pounds ($605.07 million) in cash  sending its shares soaring over 20 percent.",
        "date": "07062017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "UPDATE 2-Axis Capital to buy Lloyd's of London insurer Novae for $605 mln "
    },
    {
        "content": "* Axis Capital Holdings-co  ‍novae group reached agreement on recommended all cash acquisition of entire issued and to be issued share capital of Novae by Axis",
        "date": "07052017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital Holdings  ‍novae Group reach agreement on recommended cash offer "
    },
    {
        "content": "* Axis Capital -on May 4  2017  Joseph Henry notified co of his intention to retire from position as CFO effective January 1  2018",
        "date": "05102017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital's Joseph Henry to retire as CFO "
    },
    {
        "content": "* Axis capital announces chief financial officer joseph henry to retire at year end; peter vogt will become cfo",
        "date": "05102017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "BRIEF-AXIS Capital says Peter Vogt to be CFO "
    },
    {
        "content": "* Diluted book value per common share growth of 1% in quarter and 5% for last twelve months  to $58.89",
        "date": "04262017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital Holdings reports Q1 earnings per share $0.06 "
    },
    {
        "content": "* Axis Capital Holdings Ltd - units amended existing $500 million secured letter of credit facility with Citibank Europe Plc- sec filing",
        "date": "03312017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital Holdings' units amended existing $500 mln secured letter of credit facility with Citibank Europe "
    },
    {
        "content": "* Axis Capital Holdings Ltd - CEO Albert A. Benchimol's 2016 total compensation was $8.5 million versus $8.9 million in 2015 – sec filing Source: (http://bit.ly/2nuH6CY) Further company coverage:",
        "date": "03292017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital CEO Albert Benchimol's 2016 total compensation $8.5 mln "
    },
    {
        "content": "* Axis Capital - announced estimated impact of U.K. ministry of justice's reduction of discount rate to calculate lump sum awards in U.K. bodily injury cases",
        "date": "03062017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital announces estimated impact of ogden rate change "
    },
    {
        "content": "* announced estimated impact of recent UK Ministry of Justice`s reduction of discount rate",
        "date": "03062017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital comments on impact of UK Ministry of Justice`s reduction of discount rate "
    },
    {
        "content": "* John \"Jay\" Nichols resigns as CEO of Axis Re; jan ekberg appointed interim head of reinsurance",
        "date": "02142017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-John Nichols resigns as CEO of AXIS Re "
    },
    {
        "content": "* Axis capital reports fourth quarter net income available to common shareholders of $131 million  or $1.48 per diluted common share",
        "date": "02012017",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital Holdings Q4 earnings per share $1.48 "
    },
    {
        "content": "* Axis Capital says Axis will continue to maintain company's locations in Brussels and Amsterdam  Source text for Eikon:  Further company coverage:",
        "date": "11282016",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital announces acquisition of aviabel "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 01 (Fitch) Fitch Ratings has assigned a 'BBB' rating to AXIS  Capital Holdings Limited's (AXIS Capital) issuance of 22 million depository  shares ($550 million aggregate liquidation preference)  each representing a  1/100th interest in a 5.50% Series E preferred share. Proceeds from the issuance will be used to redeem the $400 million of Series C  6.875% preferred shares. The balance of the proceeds will be used for ge",
        "date": "11012016",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Fitch Rates AXIS Capital Holdings Ltd.'s Depositary Shares Issuance 'BBB' "
    },
    {
        "content": "* Axis accident & health expands presence in dubai market; appoints anees ahmad as vp  business development manager  Source text for Eikon:  Further company coverage:",
        "date": "11022016",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis accident & health appoints Anees Ahmad as vp  business development manager "
    },
    {
        "content": "* Axis Capital Holdings Ltd - Has priced an offering of 22 million depositary shares at a price of $25 per depositary share",
        "date": "10312016",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital prices offering of $550 000 000 of 5.50% Series E preferred shares "
    },
    {
        "content": "* Axis capital reports third quarter net income available to common shareholders of $177 million  or $1.96 per diluted common share",
        "date": "10262016",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital Holdings reports Q3 operating earnings per share of $1.78 "
    },
    {
        "content": "Sept 21 Insurer AXIS Capital Holdings Ltd  named Michiko Kurahashi as chief marketing officer and Joe Cohen as chief communications officer.",
        "date": "09222016",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "MOVES-AXIS Capital Holdings names new chief marketing officer "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 19 (Fitch) Fitch Ratings has affirmed the 'A-' Issuer Default  Rating (IDR) of AXIS Capital Holdings Ltd. (AXIS Capital) and the 'A+' Insurer  Financial Strength (IFS) ratings its operating subsidiaries. The Rating Outlook  is Stable. A full list of rating actions follows below.  KEY RATING DRIVERS AXIS Capital's ratings continue to be supported by a good competitive position  and strong capitalization. Operating results",
        "date": "08192016",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Fitch Affirms AXIS Capital Holdings  Ltd.'s Ratings; Outlook Stable "
    },
    {
        "content": "* Axis Capital reports second quarter net income available to common shareholders of $119 million  or $1.29 per diluted common share",
        "date": "07262016",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital reports Q2 earnings per share $1.29 "
    },
    {
        "content": "* Preliminary estimate of Q2 2016 catastrophe and weather-related pre-tax losses is $104 million",
        "date": "07182016",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "CORRECTED-BRIEF-Axis Capital estimates Q2 catastrophe  weather-related pretax losses of $104 mln "
    },
    {
        "content": "* Axis capital reports first quarter operating income of $101 million  or $1.07 per diluted common share",
        "date": "04262016",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Axis Capital Holdings Q1 operating EPS $1.07 "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  December 15 (Fitch) Fitch Ratings has affirmed the 'A-' Issuer Default  Rating of AXIS Capital Holdings Ltd. (AXIS Capital) and the 'A+' Insurer  Financial Strength ratings of its operating subsidiaries.  The Rating Outlook is  Stable.  See the full list of rating actions below.  KEY RATING DRIVERS AXIS Capital's ratings continue to be supported by a good competitive position  and strong capitalization. Operating results showed",
        "date": "12152015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Fitch Affirms Ratings of AXIS Capital Holdings  Ltd.; Outlook Stable "
    },
    {
        "content": "PartnerRe Ltd   the reinsurance company that has a $6.6 billion merger agreement with Axis Capital Holdings   is now willing to negotiate a new deal with rival suitor Exor SpA   according to people familiar with the matter.",
        "date": "07292015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Exclusive: PartnerRe open to acquisition talks with Exor - sources "
    },
    {
        "content": "MILAN Investment group Exor   which controls carmaker Fiat Chrysler    said on Monday it had signed a deal to buy PartnerRe  for $6.9 billion  trumping a rival bid from Axis Capital  and ending a prolonged battle for the reinsurer.",
        "date": "08032015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Italy's Exor wins battle to buy PartnerRe for $6.9 billion "
    },
    {
        "content": "* Axis likely to become takeover target  analysts say   (Adds Breakingviews link)",
        "date": "08032015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "UPDATE 3-Italy's Exor wins battle to buy PartnerRe for $6.9 bln "
    },
    {
        "content": "MILAN  July 27 Proxy adviser Glass Lewis has recommended that PartnerRe investors vote against the reinsurer's planned merger with Axis Capital Holdings  saying a rival buyout bid by Italian holding company Exor  was superior  Exor said on Monday.",
        "date": "07272015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "Exor says Glass Lewis recommends vote against PartnerRe-Axis tie-up "
    },
    {
        "content": "Shareholder advisory group Institutional Shareholder Services  said it had \"significant concerns\" about a proposed takeover of PartnerRe Ltd by Axis Capital Holdings Ltd and recommended that PartnerRe's shareholders vote against the deal.",
        "date": "07242015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "ISS recommends shareholders vote against Axis-PartnerRe deal "
    },
    {
        "content": "July 24 Shareholder advisory group Institutional Shareholder Services  said it had \"significant concerns\" about a proposed takeover of PartnerRe Ltd by Axis Capital Holdings Ltd and recommended that PartnerRe's shareholders vote against the deal.",
        "date": "07242015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "UPDATE 1-ISS recommends shareholders vote against Axis-PartnerRe deal "
    },
    {
        "content": "July 24 Shareholder advisory group Institutional Shareholder Services (ISS) recommended that Bermuda-based reinsurer PartnerRe's investors vote against a takeover by rival Axis Capital Holdings Ltd.",
        "date": "07242015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "Shareholder group urges 'no' vote for Axis-PartnerRe deal "
    },
    {
        "content": "MILAN  July 20 Italian holding company Exor  has again sweetened its offer for U.S.-listed reinsurer PartnerRe to include a special dividend of $3 per share for common shareholders if it is chosen over rival suitor Axis Capital Holdings.",
        "date": "07202015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "UPDATE 2-Exor sweetens PartnerRe offer again "
    },
    {
        "content": "MILAN Italian holding company Exor  has again sweetened its offer for U.S.-listed reinsurer PartnerRe  to include a special dividend of $3 per share for common shareholders if it is chosen over rival suitor Axis Capital Holdings .",
        "date": "07202015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "Exor sweetens PartnerRe offer again "
    },
    {
        "content": "July 17 The tussle between Axis Capital Holdings Ltd and Exor SpA for control of Bermuda-based reinsurer PartnerRe Ltd could be drawing to a close after a bidding war that began four months ago.",
        "date": "07172015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "TIMELINE-Sweetened Axis bid brings battle for PartnerRe to boiling point "
    },
    {
        "content": "July 21 Bermuda-based reinsurer PartnerRe  said it would seek talks with Exor SpA to discuss the Italian holding company's latest takeover offer  the sixth in its four-month bidding war with Axis Capital Holdings .",
        "date": "07212015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "UPDATE 1-Reinsurer PartnerRe says to seek talks with Exor on latest offer "
    },
    {
        "content": "July 16 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "07162015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Specialty insurer and reinsurer Axis Capital Holdings Ltd  and PartnerRe Ltd  agreed to sweeten the terms of their merger agreement to fend off a rival bid from Italy's Exor SpA .",
        "date": "07162015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "Axis Capital  PartnerRe sweeten deal with higher special dividend "
    },
    {
        "content": "* Companies agree to match Exor's terms for preferred shareholders",
        "date": "07162015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "UPDATE 2-Axis Capital  PartnerRe sweeten deal with higher special dividend "
    },
    {
        "content": "July 16 Reinsurer Axis Capital Holdings Ltd  said it was raising the special dividend component of its offer for PartnerRe Ltd as it looks to fend off a rival offer from Exor SpA.",
        "date": "07162015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "Axis Capital raises special dividend in PartnerRe offer "
    },
    {
        "content": "July 8 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "07082015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "MILAN  July 7 Italian holding company Exor  said on Tuesday it had improved the terms of its offer for PartnerRe as it seeks to convince the reinsurer's shareholders to vote against a rival bid from Axis Capital Holdings.",
        "date": "07072015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Exor says boosts offer terms for PartnerRe shareholders "
    },
    {
        "content": "Reinsurers Axis Capital Holdings Ltd  and PartnerRe Ltd  are considering tweaking their $6.2 billion merger agreement in a bid to fend off a $6.8 billion offer for PartnerRe by Exor SpA   people familiar with the matter said.",
        "date": "07082015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "Exclusive: Axis and PartnerRe mull sweetening merger terms - sources "
    },
    {
        "content": "Axis Capital Holdings Ltd  has not communicated with any potential acquirer  including Arch Capital Ltd   since it engaged in merger talks with competitor PartnerRe Ltd  last fall  people familiar with the matter said on Thursday.",
        "date": "06182015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Axis Capital not engaged in buyout talks with Arch: sources "
    },
    {
        "content": "June 18 Axis Capital Holdings Ltd has not communicated with any potential acquirer  including Arch Capital Ltd  since it engaged in merger talks with competitor PartnerRe Ltd last fall  people familiar with the matter said on Thursday.",
        "date": "06182015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "Axis Capital not engaged in buyout talks with Arch -sources "
    },
    {
        "content": "June 1 Bermuda-based reinsurers PartnerRe Ltd  and Axis Capital Holdings Ltd are embarking on a public campaign this week to convince shareholders of the merits of their $13 billion merger  with their top executives leading the charge.",
        "date": "06012015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "PartnerRe and Axis launch deal charm offensive "
    },
    {
        "content": "June 1 Bermuda-based reinsurers PartnerRe Ltd  and Axis Capital Holdings Ltd are embarking on a public campaign this week to convince shareholders of the merits of their $13 billion merger  with their top executives leading the charge.",
        "date": "06012015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "RPT-PartnerRe and Axis launch deal charm offensive "
    },
    {
        "content": "* No need for plan B on PartnerRe as confident the reinsurer's shareholders will vote against the proposal by Axis Capital Holdings   Further company coverage:     (Reporting by Milan Newsroom)",
        "date": "05292015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "BRIEF-Exor CEO says no need for plan B on PartnerRe "
    },
    {
        "content": "BRUSSELS  May 27 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "05272015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "EU mergers and takeovers (May 27) "
    },
    {
        "content": "MILAN/NEW YORK Bermuda-based reinsurer PartnerRe  will ask its shareholders to vote on a merger with Axis Capital Holdings  agreed in January  after rival bidder Exor  refused to further sweeten its $6.8 billion offer.",
        "date": "05222015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "PartnerRe moves to shareholder vote on Axis merger "
    },
    {
        "content": "MILAN Italian investment holding company Exor  said on Thursday it would not raise its $6.8 billion takeover offer for PartnerRe  but was willing to negotiate with the reinsurer if its board declared its offer superior to that of rival suitor Axis Capital Holdings .",
        "date": "05212015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Exor says will not raise $6.8 billion offer for PartnerRe "
    },
    {
        "content": "May 20 AXIS Capital Holdings Ltd Chief Executive Officer Albert Benchimol told employees on Wednesday that a merger with PartnerRe Ltd was still in the best interests of both reinsurance companies  according to a memo seen by Reuters.",
        "date": "05202015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Axis remains committed to deal with PartnerRe -memo "
    },
    {
        "content": "* Exor says confident its bid will prevail   (Adds Exor statement  Sandell Asset Mgmt comments)",
        "date": "05222015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "UPDATE 2-PartnerRe moves to shareholder vote on Axis merger "
    },
    {
        "content": "MILAN  May 21 Italian investment holding company Exor said on Thursday it would not raise its $6.8 billion takeover offer for PartnerRe but was willing to negotiate with the reinsurer if its board declared its offer superior to that of rival suitor Axis Capital Holdings.",
        "date": "05212015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "UPDATE 1-Exor says will not raise $6.8 bln offer for PartnerRe "
    },
    {
        "content": "Axis Capital Holdings Ltd  is not considering improving on its offer for Bermuda-based reinsurer PartnerRe Ltd  following rival bidder Exor SpA's  raised $6.8 billion bid  a person familiar with the matter said on Sunday.",
        "date": "05172015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Axis will not follow Exor in sweetening PartnerRe bid: source "
    },
    {
        "content": "May 17 Axis Capital Holdings Ltd is not considering improving on its offer for Bermuda-based reinsurer PartnerRe Ltd following rival bidder Exor SpA's  raised $6.8 billion bid  a person familiar with the matter said on Sunday.",
        "date": "05172015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "Axis will not follow Exor in sweetening PartnerRe bid-source "
    },
    {
        "content": "Italian holding company Exor  sweetened its all-cash offer for Bermuda-based reinsurer PartnerRe  to $6.8 billion after its previous attempt to trump a bid by Axis Capital Holdings  was rejected.",
        "date": "05122015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Italy's Exor sweetens offer for PartnerRe to $6.8 billion "
    },
    {
        "content": "* Exor files proxy documents to solicit vote against Axis proposal   (Adds comment from PartnerRe shareholder  Exor)",
        "date": "05122015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "UPDATE 3-Italy's Exor sweetens offer for PartnerRe to $6.8 bln "
    },
    {
        "content": "One of PartnerRe Ltd's  biggest shareholders said Exor SpA's  sweetened offer for the Bermuda-based reinsurer was \"clearly superior\" to Axis Capital Holdings Ltd's  for the company.",
        "date": "05122015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "PartnerRe investor says sweetened Exor offer 'superior' to Axis bid "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 07 (Fitch) Fitch Ratings continues to expect the capitalization of  the combined PartnerRe Ltd. (PRE) and AXIS Capital Holdings Ltd. (AXIS) to be  within its rating guidelines based on additional information reviewed by Fitch  following the agency's non-rating action commentary published on May 4  2015.   Fitch has taken no rating actions on either PRE or AXIS as a result of the  revised PRE-AXIS amalgamation agreement that",
        "date": "05072015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Fitch Provides Additional Comments on PartnerRe-AXIS Capital Management "
    },
    {
        "content": "May 12 One of PartnerRe Ltd's biggest shareholders said Exor SpA's sweetened offer for the Bermuda-based reinsurer was \"clearly superior\" to Axis Capital Holdings Ltd's for the company.",
        "date": "05122015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "PartnerRe investor says sweetened Exor offer \"superior\" to Axis bid "
    },
    {
        "content": "MILAN  May 12 Italian holding company Exor  has raised its all-cash offer for Bermuda-based reinsurer PartnerRe to $137.5 per share after its previous attempt to trump a bid by Axis Capital Holdings  was rejected.",
        "date": "05122015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "Exor raises offer for PartnerRe to $137.5 per share "
    },
    {
        "content": "MILAN/BANGALORE Italy's Exor  said on Monday it remained fully committed to its $6.4 billion offer for PartnerRe  after the Bermuda-based reinsurer rejected its attempt to trump a bid by Axis Capital Holdings .",
        "date": "05042015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Exor committed to $6.4 billion spurned offer for PartnerRe "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 04 (Fitch) Fitch Ratings has taken no rating actions on either  PartnerRe Ltd. (PRE) or AXIS Capital Holdings Ltd. (AXIS) following PRE's  announcement today that it has rejected EXOR S.p.A.'s (EXOR) offer to acquire  PRE for $130 per share in cash ($6.4 billion). A full ratings list follows at  the end of this release. In response to EXOR's rival bid  the PRE-AXIS amalgamation agreement has been  revised to add an $11.50 p",
        "date": "05042015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "Fitch: Ratings on PartnerRe-AXIS Unchanged Following Revised Merger Agreement "
    },
    {
        "content": "MILAN  April 30 Bermuda-based Axis Capital Holdings said in a statement late on Wednesday it continued to believe a merger with reinsurer PartnerRe  was in the best interests of its shareholders.",
        "date": "04302015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Axis Capital still believes PartnerRe merger best for shareholders "
    },
    {
        "content": "PartnerRe Ltd's second-biggest shareholder said Exor SpA's offer for the Bermuda-based reinsurer was \"much superior\" to a deal with Axis Capital Holdings Ltd that was already on the table.",
        "date": "04162015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "PartnerRe investor says Exor offer 'superior' to Axis deal "
    },
    {
        "content": "April 16 PartnerRe Ltd's second-biggest shareholder said Exor SpA's offer for the Bermuda-based reinsurer was \"much superior\" to a deal with Axis Capital Holdings Ltd that was already on the table.",
        "date": "04162015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "UPDATE 2-PartnerRe investor says Exor offer \"superior\" to Axis deal "
    },
    {
        "content": "MILAN Italian holding company Exor  which controls carmaker Fiat Chrysler Automobiles  offered $6.4 billion in cash to buy Bermuda-based reinsurer PartnerRe  trumping an all-share deal with Axis Capital Holdings Ltd.",
        "date": "04142015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Agnellis' Exor bids $6.4 billion for PartnerRe to trump Axis "
    },
    {
        "content": "MILAN A $6.4 billion all-cash offer from Italian holding company Exor  for Bermuda-based reinsurer PartnerRe  has disrupted plans by Axis Capital Holdings  to merge with its rival and could end up triggering a bidding war.",
        "date": "04152015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Agnellis' Exor bids $6.4 billion for PartnerRe to trump Axis "
    },
    {
        "content": "MILAN  April 14 Italian holding company Exor   which controls carmaker Fiat Chrysler Automobiles   offered $6.4 billion in cash to buy Bermuda-based reinsurer PartnerRe  trumping an all-share deal with Axis Capital Holdings Ltd.",
        "date": "04142015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "REFILE-UPDATE 3-Agnellis' Exor bids $6.4 bln for PartnerRe to trump Axis "
    },
    {
        "content": "* Axis says fully committed to PartnerRe tie-up   (Adds details  quotes  analysts  shares; edits throughout)",
        "date": "04152015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "UPDATE 5-Agnellis' Exor bids $6.4 bln for PartnerRe to trump Axis "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 26 (Fitch) Fitch Ratings has placed PartnerRe Ltd.'s (PRE)  ratings on Rating Watch Negative  including its 'A+' IDR and the 'AA-' Insurer  Financial Strength (IFS) rating of Partner Reinsurance Company Ltd.  the  company's principal reinsurance operating subsidiary. A complete list of rating  actions appears below. KEY RATING DRIVERS Fitch's rating action follows the announcement today that PRE and AXIS Capital  Holdin",
        "date": "01262015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "Fitch Places PartnerRe on Watch Negative on AXIS Merger Closing Uncertainties "
    },
    {
        "content": "MUMBAI  Jan 19 Indian drug manufacturer Alkem Laboratories has appointed Nomura and Axis Capital as lead bankers for a planned 15-18 billion rupees ($242.88-$291.45 million) initial public offering  five sources involved in the process told Reuters.",
        "date": "01192015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "topStory",
        "symbol": "AXS",
        "title": "India's Alkem Labs appoints banks for up to $291 mln IPO - sources "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 26 (Fitch) Fitch Ratings has placed the 'A+' Insurer Financial  Strength (IFS) ratings of AXIS Capital Holdings Ltd. (AXIS Capital) and its  operating subsidiaries on Rating Watch Positive following its announced merger  with PartnerRe Ltd. (PRE).  A full list of ratings follows at the end of this  release. KEY RATING DRIVERS Today's affirmation follows the announcement that AXIS Capital entered into a  definitive agree",
        "date": "01262015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "Fitch Places AXIS Capital Holdings on Rating Watch Positive "
    },
    {
        "content": "Jan 26 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Monday:",
        "date": "01262015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Axis Capital Holdings Ltd and PartnerRe Ltd have agreed an all-share $11 billion merger to create one of the world's largest reinsurers  responding to intensifying pressure in the industry to consolidate.",
        "date": "01262015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "Bermuda reinsurers Axis Capital  PartnerRe in $11 bln merger "
    },
    {
        "content": "NEW YORK/FRANKFURT Axis Capital Holdings Ltd  and PartnerRe Ltd  have agreed an all-share $11 billion merger to create one of the world's largest reinsurers  responding to intensifying pressure in the industry to consolidate.",
        "date": "01262015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "Bermuda reinsurers Axis Capital  PartnerRe in $11 billion merger "
    },
    {
        "content": "* PartnerRe shares up 0.6 pct  Axis shares up 4.9 pct   (Comment from conference call  context  shares)",
        "date": "01262015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "UPDATE 2-Bermuda reinsurers Axis Capital  PartnerRe in $11 bln merger "
    },
    {
        "content": "Jan 25 Axis Capital Holdings Ltd and PartnerRe Ltd have agreed to an $11 billion merger to create one of the world's largest reinsurers  PartnerRe said on Sunday.",
        "date": "01262015",
        "name": "Axis Capital Holdings Limited",
        "news_type": "normal",
        "symbol": "AXS",
        "title": "Reinsurers Axis Capital  PartnerRe to merge in $11 billion deal "
    }
]