[
    {
        "content": "FRANKFURT/NEW YORK Dutch paints and coatings giant Akzo Nobel NV  has approached U.S. rival Axalta Coating Systems Ltd  to discuss a possible merger that would create a global coatings giant  according to sources familiar with the matter.",
        "date": "10272017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "Exclusive: Akzo Nobel approaches Axalta about possible merger - sources "
    },
    {
        "content": "* Axalta Coating Systems Ltd - ‍reiterating our outlook for full year 2017​",
        "date": "10262017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta qtrly ‍diluted net income per share $ 0.22​ "
    },
    {
        "content": "FRANKFURT/NEW YORK  Oct 27 Dutch paints and coatings giant Akzo Nobel NV has approached U.S. rival Axalta Coating Systems Ltd to discuss a possible merger that would create a global coatings giant  according to sources familiar with the matter.",
        "date": "10272017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "normal",
        "symbol": "AXTA",
        "title": "EXCLUSIVE-Akzo Nobel approaches Axalta about possible merger -sources "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Akzo Nobel has added another ball to an already tricky juggling act. Fresh from deflecting a takeover from one U.S. rival  the Dutch group confirmed on Monday that it is considering merging its paint unit with another  former DuPont subsidiary Axalta. A combination makes sense. But new Chief Executive Thierry Vanlancker is busy grappling with weak results and a chemicals spinoff.",
        "date": "10302017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "Breakingviews - Axalta deal complicates Akzo's juggling act "
    },
    {
        "content": "AMSTERDAM/FRANKFURT Dutch paints maker Akzo Nobel  seeking to recover after rejecting a takeover offer and issuing two profit warnings  is discussing a merger with smaller U.S. rival Axalta Coating Systems Ltd to create a $30 billion company. | Video ",
        "date": "10302017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "normal",
        "symbol": "AXTA",
        "title": "New Akzo Nobel boss pursues $30 billion deal with Axalta "
    },
    {
        "content": "AMSTERDAM Dutch paints maker Akzo Nobel  under pressure after rejecting a lucrative takeover offer and two profit warnings  has confirmed merger talks with smaller U.S. rival Axalta Coating Systems Ltd to create a $30 billion company.",
        "date": "10302017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "normal",
        "symbol": "AXTA",
        "title": "Akzo Nobel seeks $30 billion merger with smaller U.S. rival Axalta "
    },
    {
        "content": "* Akzo considered buying Axalta in 2014 (Adds industry background  deal rationale  analyst and investor comments)",
        "date": "10302017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "normal",
        "symbol": "AXTA",
        "title": "UPDATE 3-New Akzo Nobel boss pursues $30 billion deal with Axalta "
    },
    {
        "content": "Oct 30 Below are company-related news and stories from French and Benelux media which could have an impact on the region's markets or individual stocks.",
        "date": "10302017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "normal",
        "symbol": "AXTA",
        "title": "French and Benelux stocks-Factors to watch on Oct. 30 "
    },
    {
        "content": "* CONFIRMS CONSTRUCTIVE DISCUSSIONS WITH AXALTA REGARDING POTENTIAL MERGER‍​",
        "date": "10302017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "normal",
        "symbol": "AXTA",
        "title": "BRIEF-Akzo Nobel confirms discussions with Axalta regarding potential merger "
    },
    {
        "content": "AMSTERDAM  Oct 30 Akzo Nobel  the Dutch maker of paints and coatings  confirmed on Monday it was in talks to buy U.S. coatings maker Axalta Coating Systems Ltd .",
        "date": "10302017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "normal",
        "symbol": "AXTA",
        "title": "Akzo Nobel confirms merger talks with Axalta "
    },
    {
        "content": "* Axalta updates financial guidance and highlights recent effects on its business",
        "date": "10092017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta updates financial guidance for Q3 and FY 2017 "
    },
    {
        "content": "* Axalta announces exclusive partnership with National Transportation Center Source text for Eikon: Further company coverage:",
        "date": "09122017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta announces exclusive partnership with National Transportation Center "
    },
    {
        "content": "* Axalta Coating Systems Ltd - ‍restarted production at its Houston-based powder coatings manufacturing center on Sept 1",
        "date": "09052017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems ‍restarts production at its houston-based center "
    },
    {
        "content": "* Axalta Coating Systems Ltd - financial terms of transaction were not disclosed​​",
        "date": "08142017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems to acquire Plascoat Systems Limited "
    },
    {
        "content": "* Axalta Coating Systems Ltd - ‍net sales of $1 088.5 million for Q2 of 2017 increased 2.3%  including 1.5% in unfavorable foreign currency translation impact​",
        "date": "08032017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems qtrly loss per share $0.09 "
    },
    {
        "content": "* Axalta Coating Systems makes binding offer to acquire European and Chinese operations of Wire Enamel Manufacturer IVA",
        "date": "07192017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems to acquire IVA's European and Chinese operations "
    },
    {
        "content": "* Recently signed a new  three-year commercial agreement with Volkswagen Group Italia S.p.A​",
        "date": "07102017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems recently signed a new  3-year agreement with Volkswagen Group Italia S.p.A​ "
    },
    {
        "content": "* Axalta Coating Systems- unit and Axalta Coating Systems U.S. Holdings Inc incurred additional term loans in an amount equal to $1 550 million",
        "date": "06162017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems  unit incurred additional term loans in an amount equal to $1 550 million "
    },
    {
        "content": "* Axalta Coating Systems completes acquisition of Spencer Coatings Group Source text for Eikon: Further company coverage:",
        "date": "06062017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems completes acquisition of Spencer Coatings Group "
    },
    {
        "content": "* Axalta Coating Systems Ltd- units expect to enter into an amendment to credit agreement  dated as of February 1  2013",
        "date": "05122017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems Ltd  units expect to enter into an amendment to credit agreement "
    },
    {
        "content": "* Axalta and Worldskills Australia renew partnership to advance refinish professionals Source text for Eikon: Further company coverage:",
        "date": "05162017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta and Worldskills Australia renew partnership to advance refinish professionals "
    },
    {
        "content": "* Axalta Coating Systems Ltd sees FY 2017 net sales growth of 1-3 pct as-reported",
        "date": "04262017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta posts Q1 earnings per share $0.26 "
    },
    {
        "content": "* Sherwin-Williams and Valspar reach agreement to sell Valspar's North American Industrial Wood Coatings Business to Axalta Coatings Systems",
        "date": "04122017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Sherwin-Williams and Valspar reach agreement to sell Valspar's North American Industrial Wood Coatings Business to Axalta Coatings Systems "
    },
    {
        "content": "* Axalta coating systems to acquire Valspar's North American Industrial Wood Coatings Business",
        "date": "04122017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "normal",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems to acquire Valspar's North American Industrial Wood Coatings Business "
    },
    {
        "content": "* Axalta coating systems ltd - ceo charles w. Shaver's 2016 total compensation was $7.5 million versus $16.8 million in 2015 - sec filing  Source text for Eikon:  Further company coverage:",
        "date": "03152017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating CEO Charles Shaver's 2016 total compensation $7.5 mln vs $16.8 mln "
    },
    {
        "content": "* Axalta Coating Systems announces $675 million share repurchase program authorization",
        "date": "03132017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta announces $675 mln share repurchase program authorization "
    },
    {
        "content": "* Axalta Coating Systems and General Motors UK renew three-year agreement",
        "date": "03012017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems renews 3-year deal with General Motors UK "
    },
    {
        "content": "* Axalta Coating Systems - has appointed Ocean Vietnam International Trading Co as its distributor for Alesta Powder Coatings products in Vietnam  Source text for Eikon:  Further company coverage:",
        "date": "02072017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems appoints Ocean Vietnam Int trading as a distributor "
    },
    {
        "content": "* Axalta coating systems ltd says updating our outlook for full year 2017",
        "date": "02082017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta qtrly loss per share $0.15 "
    },
    {
        "content": "* Axalta Coating Systems to acquire Century Industrial Coatings",
        "date": "02012017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems to acquire Century Industrial Coatings "
    },
    {
        "content": "* Axalta coating systems to acquire business of Ellis Paint Company",
        "date": "01062017",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems to buy business of Ellis Paint Co. "
    },
    {
        "content": "* Axalta coating systems ltd - sees flat net sales in 2016; lower end of 4-6% guidance on a constant currency basis  including acquisition contribution",
        "date": "10272016",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating says sees 2016 adj EBITDA at lower end of $900 mln-940 mln range "
    },
    {
        "content": "* Axalta Coating Systems working with Bombardier on two important London Rail contracts",
        "date": "10182016",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems working with Bombardier on two London Rail contracts "
    },
    {
        "content": "* On Oct 17  units voluntarily prepaid $150 million of outstanding U.S. Dollar term loans under senior secured credit facility  Source text for Eikon: [http://bit.ly/2e1WNyI] Further company coverage:",
        "date": "10182016",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "normal",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems prepaid $150 million U.S. Dollar term loans "
    },
    {
        "content": "* Says its subsidiary  Axalta Coating Systems Dutch Holding intends to offer 450.0 million Euro in total of unsecured notes",
        "date": "09132016",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating's dutch subsidary commences 450 mln euro notes offering "
    },
    {
        "content": "* Axalta coating systems ltd says  appointed Samuel Smolik to board as a Class I director  Source text for Eikon:  Further company coverage:",
        "date": "09082016",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems appointed Samuel Smolik as a Class I director "
    },
    {
        "content": "* Axalta Coating Systems Ltd says also its unit issued eur 335.0 million aggregate principal amount of 4.250% senior notes due 2024 on august 16  Source text - http://bit.ly/2bc3wVo Further company coverage:",
        "date": "08172016",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta says its unit issued $500 million  principal amount of 4.875% senior notes due 2024 "
    },
    {
        "content": "* Operations of Geeraets Autolak will be integrated into Axalta organization  operating under Cromax name  Source text for Eikon:  Further company coverage:",
        "date": "08012016",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems acquires Geeraets Autolak business "
    },
    {
        "content": "* Unit intends to offer $875.0 million (e in aggregate principal amount of senior unsecured notes",
        "date": "08012016",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "normal",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta to offer $875 mln principal amount of senior unsecured notes "
    },
    {
        "content": "* Priced its offering of $500.0 million in aggregate principal amount of 4.875 pct senior notes due 2024",
        "date": "08022016",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems prices notes offering "
    },
    {
        "content": "* Sees for 2016  largely flat net sales  up 4-6% on a constant currency basisSees 2016 capital expenditures of about $150 million",
        "date": "07262016",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems sees flat net sales for 2016 "
    },
    {
        "content": "* Axalta Coating Systems acquires united paint's automotive interior rigid thermoplastics coatings business",
        "date": "07202016",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta buys United Paint's automotive thermoplastics coatings business "
    },
    {
        "content": "* Axalta Coating Systems to acquire coil and spray coatings manufacturer Dura Coat Products",
        "date": "06272016",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems To buy Dura Coat Products "
    },
    {
        "content": "* Axalta appoints Mark Garrett to board of directors  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06202016",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta appoints Mark Garrett to board of directors "
    },
    {
        "content": "* Following offering  Carlyle will continue to own 44.8 million shares  or about 18.8%  of Axalta's outstanding common shares",
        "date": "05242016",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta says Carlyle Group affiliates to sell 25 mln common shares "
    },
    {
        "content": "* Axalta coating systems receives caterpillar approval for aquaec(tm) 6100 for construction and earthmoving markets  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05062016",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "BRIEF-Axalta Coating Systems receives Caterpillar approval for Aquaec 6100 for construction and earthmoving markets "
    },
    {
        "content": "Warren Buffett's Berkshire Hathaway Inc  on Friday said it boosted its stake in cable TV operator Charter Communications Corp  and signaled it may have another large investment planned after agreeing to buy Precision Castparts Corp in its largest-ever purchase.",
        "date": "08142015",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "normal",
        "symbol": "AXTA",
        "title": "Buffett's Berkshire Hathaway hints at new purchase  ups Charter stake "
    },
    {
        "content": "Aug 14 Warren Buffett's Berkshire Hathaway Inc  on Friday said it boosted its stake in cable TV operator Charter Communications Corp  and signaled it may have another large investment planned after agreeing to buy Precision Castparts Corp in its largest-ever purchase.",
        "date": "08142015",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "normal",
        "symbol": "AXTA",
        "title": "UPDATE 1-Buffett's Berkshire Hathaway hints at new purchase  ups Charter stake "
    },
    {
        "content": "Paint maker Axalta Coating Systems Ltd  said Berkshire Hathaway Inc  would buy an 8.7 percent stake in the company from controlling shareholder Carlyle Group  for $560 million.",
        "date": "04072015",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "topStory",
        "symbol": "AXTA",
        "title": "Berkshire takes 8.7 percent stake in Carlyle-controlled Axalta "
    },
    {
        "content": "April 7 Paint maker Axalta Coating Systems Ltd  said Berkshire Hathaway Inc would buy an 8.7 percent stake in the company from controlling shareholder Carlyle Group for $560 million.",
        "date": "04072015",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "normal",
        "symbol": "AXTA",
        "title": "UPDATE 1-Berkshire takes 8.7 pct stake in Carlyle-controlled Axalta "
    },
    {
        "content": "April 7 Paints company Axalta Coating Systems Ltd said Berkshire Hathaway Inc would buy an 8.7 percent stake in the company from controlling shareholder Carlyle Group for $560 million.",
        "date": "04072015",
        "name": "Axalta Coating Systems Ltd",
        "news_type": "normal",
        "symbol": "AXTA",
        "title": "Berkshire takes 8.7 pct stake in Carlyle-controlled Axalta "
    }
]