[
    {
        "content": "* Says pricing Fasenra below the treatment cost of all other biologics in severe asthma",
        "date": "11152017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca pricing new severe asthma drug Fasenra below rivals "
    },
    {
        "content": "* ANNOUNCES ACHIEVEMENT OF $80 MILLION SALES-RELATED MILESTONES FROM AGREEMENT WITH ASTRAZENECA‍​ Source text for Eikon:",
        "date": "11172017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Almirall announces achievement of $80 mln sales-related milestones from agreement with Astrazeneca‍​ "
    },
    {
        "content": "* Astrazeneca - co  Medimmune  announced that U.S. FDA approved fasenra (benralizumab) for severe eosinophilic asthma",
        "date": "11142017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca says  U.S. FDA approved fasenra (benralizumab) for severe eosinophilic asthma "
    },
    {
        "content": " (This version of the Nov.15 story corrects the spelling of the drug in paragraphs 8  9)",
        "date": "11162017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca ticks another box as U.S. approves severe asthma drug "
    },
    {
        "content": "Nov 14 Anglo-Swedish pharmaceutical firm AstraZeneca Plc on Tuesday said the U.S. Food and Drug Administration approved its drug benralizumab  as an add-on treatment for patients with severe asthma aged 12 years and older.",
        "date": "11142017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "U.S. FDA approves AstraZeneca's asthma drug "
    },
    {
        "content": "LONDON  Nov 15 AstraZeneca has achieved another milestone in rebuilding its drug portfolio with U.S. approval of a drug for severe asthma as the company battles to put patent losses on older medicines behind it.",
        "date": "11162017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "REFILE-UPDATE 1-AstraZeneca ticks another box as U.S. approves severe asthma drug "
    },
    {
        "content": "* FASLODEX (FULVESTRANT) RECEIVES EU APPROVAL FOR THE TREATMENT OF HORMONE RECEPTOR-POSITIVE ADVANCED BREAST CANCER IN COMBINATION WITH PALBOCICLIB1 Source text for Eikon: Further company coverage:",
        "date": "11142017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca says EU approves new indication for Faslodex in combination with palbociclib "
    },
    {
        "content": "NEW YORK  Nov 13 Drugmaker Pfizer Inc has promoted Albert Bourla to the newly created post of chief operating officer  freeing up Chief Executive Officer Ian Read to focus more on long-term strategy and engaging with government and industry leaders.",
        "date": "11132017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-Pfizer creates chief operating officer role for Bourla "
    },
    {
        "content": "LONDON  Nov 8 Hedge fund Kerrisdale Capital has taken a short position on drugmaker Prothena  a company backed by UK investor Neil Woodford  calling it \"the next big biotech blowup\".",
        "date": "11082017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Woodford-backed Prothena targeted by short seller Kerrisdale "
    },
    {
        "content": "LONDON  Nov 9 AstraZeneca is enjoying booming drug sales in China  helped by reforms to the country's regulatory system and an increased sales force  in sharp contrast to its British rival GlaxoSmithKline.",
        "date": "11092017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca rides China wave as rival GlaxoSmithKline struggles "
    },
    {
        "content": "* committed to dividend \"today  tomorrow and day after\" Further company coverage: (Reporting by UK bureau)",
        "date": "11092017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca CEO committed to dividend "
    },
    {
        "content": "LONDON AstraZeneca's  drug sales fell again in the third quarter  hit by generic competition to former blockbusters like cholesterol pill Crestor  although the pace of decline slowed as it looks to new cancer treatments to revive its fortunes.",
        "date": "11092017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca sales decline slows as it waits for medicine to work "
    },
    {
        "content": "* 2017 EPS at favourable end of low to mid teens decline (Adds further CEO comments  reaction)",
        "date": "11092017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-AstraZeneca sales decline slows as it waits for medicine to work "
    },
    {
        "content": "LONDON  Nov 9 Supplies of thousands of medicines are at risk of disruption if Britain leaves the European Union without a trade deal  forcing manufacturers to prepare for duplicate product testing to ensure their drugs stay on the market.",
        "date": "11092017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-Thousands of drugs face Brexit risk  makers to duplicate testing "
    },
    {
        "content": "Nov 9 AstraZeneca CEO Pascal Soriot told reporters:",
        "date": "11092017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca CEO still sees 2023 sales above $40 billion at today's FX "
    },
    {
        "content": "LONDON Hedge fund Kerrisdale Capital has taken a short position in drugmaker Prothena   a company backed by UK investor Neil Woodford  calling it \"the next big biotech blowup\".",
        "date": "11092017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Short seller Kerrisdale targets Woodford-backed Prothena "
    },
    {
        "content": "Nov 9 Britain's FTSE 100 index futures are seen opening down 0.1 percent ahead of the cash market open.",
        "date": "11092017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-UK Stocks-Factors to watch on Nov 9 "
    },
    {
        "content": "LONDON  Nov 9 AstraZeneca's drug sales fell 3 percent in the third quarter  hit again by generic competition to former blockbusters like cholesterol pill Crestor  as it looks to new cancer treatments to revive its fortunes.",
        "date": "11092017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca Q3 sales weak as it waits for medicine to work "
    },
    {
        "content": "LONDON  Nov 1 An experimental biotech drug for severe asthma from AstraZeneca has failed in further clinical tests  following an earlier setback in May and disappointing results with a similar drug at Roche.",
        "date": "11012017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca asthma drug tralokinumab disappoints again "
    },
    {
        "content": "LONDON AstraZeneca has won U.S. approval for a new blood cancer drug several months earlier than expected  boosting its oncology portfolio - and requiring it to pay $1.5 billion to shareholders in the biotech company that first discovered the medicine.",
        "date": "10312017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca wins early U.S. approval for blood cancer drug "
    },
    {
        "content": "* Upsher-Smith Laboratories says co's parent Sawai Pharmaceutical entered agreement with AstraZeneca to manufacture & market migraine medication in Japan​",
        "date": "10302017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Upsher-Smith says parent co to manufacture migraine medication in Japan With AstraZeneca "
    },
    {
        "content": "* FDA approval triggers $1.5 bln payment by AstraZeneca (Adds CEO comment  details on competition  sales forecasts)",
        "date": "10312017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-AstraZeneca wins early U.S. approval for blood cancer drug "
    },
    {
        "content": "LONDON Mereo BioPharma has agreed a licensing deal and acquisition option for a rare disease drug from AstraZeneca as the big drugmaker continues to divest non-core assets.",
        "date": "10302017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca licenses genetic disease drug to Mereo BioPharma "
    },
    {
        "content": "* ‍Astra Zeneca asdvised they intend to exclusively distribute proportion of their products direct to pharmacy",
        "date": "10302017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Sigma Healthcare reviewing options to offset earnings impact of Astra Zeneca announcement "
    },
    {
        "content": "* ANNOUNCED TOP-LINE RESULTS OF PHASE III STRATOS 2  TROPOS TRIALS FOR TRALOKINUMAB",
        "date": "11012017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca provides Tralokinumab update in severe asthma​ "
    },
    {
        "content": "Oct 31 The U.S. Food and Drug Administration said on Tuesday it approved AstraZeneca Plc's Calquence as a treatment for a rare type of blood cancer.",
        "date": "10312017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "FDA approves AstraZeneca's Calquence for rare blood cancer "
    },
    {
        "content": "* ASTRAZENECA - ‍UNDER NEW AGREEMENT TERMS  AGI NOW ACQUIRED REMAINING RIGHTS TO INTELLECTUAL PROPERTY  MANUFACTURING KNOW-HOW RELATED TO ANAESTHETIC MEDICINES​ Source text for Eikon: Further company coverage: (Bengaluru Newsroom)",
        "date": "11012017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca ‍and Aspen complete anaesthetics deal​ "
    },
    {
        "content": "LONDON  Oct 31 AstraZeneca is stepping up its bet on immunotherapy combination treatments to fight lung cancer by signing a deal with Incyte under which the two companies will start a final-stage Phase III clinical trial next year.",
        "date": "10312017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca plans new pivotal lung cancer trial with Incyte "
    },
    {
        "content": "* Incyte and AstraZeneca to enter clinical trial collaboration in early lung cancer",
        "date": "10312017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Incyte and AstraZeneca to enter clinical trial collaboration in early lung cancer "
    },
    {
        "content": "* US FDA approves new easy-to-use  once-weekly BYDUREON® BCise™ injectable medicine for patients with Type-2 diabetes",
        "date": "10232017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-US FDA approves new once-weekly BYDUREON® BCise™ injectable medicine for patients with Type-2 diabetes "
    },
    {
        "content": "LONDON An unlisted Swiss biotech company focused on developing \"armed antibodies\" to fight cancer has raised $200 million in a funding round backed by AstraZeneca and other private backers.",
        "date": "10232017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca among backers as Swiss cancer biotech raises $200 million "
    },
    {
        "content": "LONDON  Oct 23 An unlisted Swiss biotech company focused on developing \"armed antibodies\" to fight cancer has raised $200 million in a funding round backed by AstraZeneca and other private backers.",
        "date": "10232017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca among backers as Swiss cancer biotech raises $200 mln "
    },
    {
        "content": "* AstraZeneca and Merck rapidly advance LYNPARZA (olaparib) in Japan with a second regulatory submission",
        "date": "10232017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca and Merck advance LYNPARZA in Japan with a second regulatory submission "
    },
    {
        "content": "* ‍ASTRAZENECA AND MSD RAPIDLY ADVANCE LYNPARZA IN JAPAN WITH A SECOND REGULATORY SUBMISSION​",
        "date": "10232017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca and Merck submit application for breast cancer drug in Japan "
    },
    {
        "content": "* ‍US FDA approves new easy-to-use  once-weekly Bydureon BCise injectable medicine for patients with type-2 diabetes​",
        "date": "10232017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca gains FDA backing for Bydureon BCise "
    },
    {
        "content": "* Roivant Sciences says entered into a development partnership with AstraZeneca for a deprioritized investigational drug in an undisclosed indication​",
        "date": "10192017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Roivant Sciences partners with AstraZeneca for drug development "
    },
    {
        "content": "* Fibrogen announces acceptance by china FDA of roxadustat new drug application (NDA) for treatment of anemia associated with dialysis and non-dialysis chronic kidney disease (CKD)",
        "date": "10182017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Fibrogen announces acceptance by china FDA of roxadustat NDA for treatment of anemia associated with dialysis and non-dialysis kidney disease "
    },
    {
        "content": "LONDON  Oct 18 U.S. regulators have granted a priority review to AstraZeneca's ovarian cancer drug Lynparza as a treatment for breast cancer  putting it on track for potential approval in the new disease area during the first quarter of 2018.",
        "date": "10182017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Astra and Merck win speedy review for Lynparza in breast cancer "
    },
    {
        "content": "* Possible buyers include existing OTC drugmakers and Nestle (Adds Breakingviews link)",
        "date": "10102017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 4-Pfizer weighs $15 bln sale of consumer healthcare business "
    },
    {
        "content": "* Avara Pharmaceutical Services acquires secondary solid dosage form manufacturing  packaging and distribution facility from AstraZeneca in France",
        "date": "10062017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Avara Pharmaceutical Services acquires Reims  France facility from AstraZeneca "
    },
    {
        "content": "LONDON  Oct 5 Britain's pharmaceuticals industry has thrown in the towel in a legal battle over new cost curbs imposed by the state-run health service  after failing to secure a judicial review.",
        "date": "10052017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-Drug industry gives up legal battle over new UK cost curbs "
    },
    {
        "content": "MANCHESTER  England  Oct 2 British companies including pharmaceuticals giant AstraZeneca urged the government on Monday to agree a three-year Brexit transitional deal to ease the uncertainty hampering investment decisions and the economy.",
        "date": "10022017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Tell us how Brexit will work  British companies demand "
    },
    {
        "content": "STOCKHOLM British pharmaceuticals giant AstraZeneca  wants a transition period of at least three years when Britain leaves the European Union in 2019 and more clarity on what will happen in the longer term  its chairman said on Monday.",
        "date": "10022017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Drugs firm AstraZeneca wants three-year Brexit transition "
    },
    {
        "content": "* Newlink Genetics announces clinical collaboration to evaluate IO-based combination therapies in pancreatic cancer",
        "date": "09252017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-NewLink Genetics announces clinical collaboration with AstraZeneca​ "
    },
    {
        "content": "Sept 25 AstraZeneca said it had attained positive top-line results in a trial for bronchodilator inhalation aerosol medicine for treatment of patients with moderate to very severe chronic obstructive pulmonary disease (COPD).",
        "date": "09252017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca reports positive results for COPD drug "
    },
    {
        "content": "PARIS  Sept 15 French biotech company Neovacs is confident that its experimental drug to treat lupus could grab significant market share from standard treatments of the auto-immune disease  its chief executive said.",
        "date": "09152017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "France's Neovacs takes on GSK and AstraZeneca in battle to treat lupus "
    },
    {
        "content": "LONDON AstraZeneca said it had agreed to sell the remaining rights to a portfolio of anesthetics to South Africa's Aspen Group for up to $766 million  a year after Aspen bought the commercial rights outside the United States.",
        "date": "09142017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Aspen to buy remaining AstraZeneca anesthetic rights for up to $766 million "
    },
    {
        "content": "LONDON  Sept 14 AstraZeneca said it had agreed to sell the remaining rights to a portfolio of anaesthetics to South Africa's Aspen Group for up to $766 million  a year after Aspen bought the commercial rights outside the United States.",
        "date": "09142017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "CORRECTED-Aspen to buy remaining AstraZeneca anaesthetic rights for up to $766 mln "
    },
    {
        "content": "Sept 14 Biotech unicorn Modern Therapeutics said on Thursday its heart drug  developed along with British drugmaker AstraZeneca  met the main goal in an early-stage trial.",
        "date": "09142017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Moderna  AstraZeneca heart drug succeeds early-stage trial "
    },
    {
        "content": "MADRID  Sept 10 A combination of two Bristol-Myers Squibb immunotherapy drugs cut the risk of death by 37 percent in a key group of kidney cancer patients  data from a closely watched clinical trial showed on Sunday.",
        "date": "09102017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-Bristol's drug cocktail cuts kidney cancer death risk 37 pct "
    },
    {
        "content": "MADRID  Sept 10 A combination of two Bristol-Myers Squibb immunotherapy drugs cut the risk of death by 37 percent in a key group of kidney cancer patients  data from a closely watched clinical trial showed on Sunday.",
        "date": "09102017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Bristol kidney cancer drug cut death risk 37 pct in key patients "
    },
    {
        "content": "JOHANNESBURG  Sept 14 South Africa's Aspen Pharmacare expanded its anaesthetic drugs portfolio with a $766 million deal with AstraZeneca as it focuses on injectibles rather than making tablets.",
        "date": "09142017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-Aspen Pharmacare shifts the needle to injectibles "
    },
    {
        "content": "MADRID  Sept 9 Two AstraZeneca drugs tackling lung cancer in different ways delivered encouraging results on Saturday  helping the British group offset July's big clinical trial setback in the disease.",
        "date": "09082017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca rebuilds cancer drug hopes with new lung data "
    },
    {
        "content": "* AstraZeneca jumps after positive results for cancer drugs (Adds closing prices)",
        "date": "09112017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "UPDATE 1-Irma  AstraZeneca gives UK's FTSE a leg-up "
    },
    {
        "content": "FRANKFURT  Sept 14 AstraZeneca's Farxiga was shown to help type-1 diabetics when added to standard insulin therapy  possibly opening up a additional market opportunity for the type-2 diabetes drug  the British drugmaker said in a statement on Thursday.",
        "date": "09142017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Astra's Farxiga results may open up type 1 diabetes opportunity "
    },
    {
        "content": "LONDON  Sept 11 Britain's top share index climbed higher on Monday  boosted by gains among insurance stocks and a rise in AstraZeneca's shares after some positive cancer drug news.",
        "date": "09112017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca gives UK's FTSE a leg-up "
    },
    {
        "content": "MADRID  Sept 9 Two AstraZeneca drugs tackling lung cancer in different ways delivered impressive clinical results on Saturday  helping the British group offset July's big clinical trial setback in the disease.",
        "date": "09112017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "RPT-UPDATE 1-AstraZeneca rebuilds cancer drug hopes with new lung data "
    },
    {
        "content": "JOHANNESBURG  Sept 14 South Africa's Aspen Pharmacare reported a 46 percent rise in full-year profit  buoyed by a revenue boost from an anaesthetics portfolio acquired from AstraZeneca and GlaxoSmithKline  the company said on Thursday.",
        "date": "09142017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "South Africa's Aspen Pharmacare posts 46 pct profit jump "
    },
    {
        "content": "MADRID Two AstraZeneca drugs tackling lung cancer in different ways delivered impressive clinical results on Saturday  helping the British group offset July's big clinical trial setback in the disease.",
        "date": "09092017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca rebuilds cancer drug hopes with new lung data "
    },
    {
        "content": "* AstraZeneca shares gain 2 pct in after-hours U.S. trade (Adds further details  more from CEO  share gains)",
        "date": "09092017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca rebuilds cancer drug hopes with new lung data "
    },
    {
        "content": "LONDON  Sept 6 A new kind of injectable biotech treatment for severe asthma from AstraZeneca and Amgen promises to help a much broader range of patients than existing medicines like GlaxoSmithKline’s Nucala.",
        "date": "09062017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "New AstraZeneca  Amgen biotech drug offers broad asthma relief "
    },
    {
        "content": "LONDON  Sept 7 AstraZeneca said its drug Duaklir improved lung function in chronic obstructive pulmonary disease (COPD) patients in a new study  paving the way for a submission in the United States where the rights are held by Britain's Circassia.",
        "date": "09072017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Positive lung drug trial opens path to U.S. market for Circassia "
    },
    {
        "content": "* APPOINTED SHERI MCCOY AND DEBORAH DISANZO AS NON-EXECUTIVE DIRECTORS OF ASTRAZENECA PLC Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "09052017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca names Sheri Mccoy Deborah Disanzo to board "
    },
    {
        "content": "* Circassia CEO says Duaklir has potential U.S. sales of $180 mln",
        "date": "09072017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-Positive lung drug trial opens path to U.S. market for Circassia "
    },
    {
        "content": "LONDON A new kind of injectable biotech treatment for severe asthma from AstraZeneca and Amgen promises to help a much broader range of patients than existing medicines like GlaxoSmithKline’s Nucala.",
        "date": "09072017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "New AstraZeneca  Amgen drug looks strong rival in severe asthma "
    },
    {
        "content": "* Phase III tests later this year or early next (Adds analyst reaction and share price)",
        "date": "09072017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-New AstraZeneca  Amgen drug looks strong rival in severe asthma "
    },
    {
        "content": "* Adherium receives U.S. 510(k) clearance for next generation smartinhaler for Astrazeneca's Symbicort aerosol inhaler Source text for Eikon: Further company coverage:",
        "date": "08312017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Adherium receives U.S. 510(K) clearance for Smartinhaler for Astrazeneca's Symbicort aerosol inhaler "
    },
    {
        "content": "* PHASE III AMPLIFY TRIAL DEMONSTRATED A STATISTICALLY- SIGNIFICANT IMPROVEMENT IN LUNG FUNCTION IN PATIENTS WITH COPD",
        "date": "09072017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca Duaklir improves lung function in COPD patients "
    },
    {
        "content": "TOKYO Japanese drugmaker Daiichi Sankyo denied on Thursday it received a takeover bid last year from Britain's AstraZeneca  following speculation that sent its share price soaring as much as 13 percent and triggered a trade suspension.",
        "date": "08312017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Japan's Daiichi Sankyo denies 2016 takeover bid by AstraZeneca "
    },
    {
        "content": "* Speculation of takeover interest triggered share suspension",
        "date": "08312017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 3-Japan's Daiichi Sankyo denies 2016 takeover bid by AstraZeneca "
    },
    {
        "content": "LONDON Japan's Daiichi Sankyo denied on Thursday it had received a takeover bid last year from British drugmaker AstraZeneca  as reported earlier by the online version of Nikkei Business.",
        "date": "08312017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Daiichi Sankyo denies receiving takeover bid from AstraZeneca "
    },
    {
        "content": "LONDON  Aug 28 AstraZeneca has forged a research collaboration with Boston-based Berg  a specialist in artificial intelligence for drug hunting  in the latest sign of big pharma's interest in using supercomputers for drug discovery.",
        "date": "08282017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca taps AI for drug discovery in deal with Berg "
    },
    {
        "content": "LONDON AstraZeneca is to receive up to $400 million from Takeda Pharmaceutical after striking a deal for the Japanese company to co-develop an early-stage medicine for Parkinson's disease.",
        "date": "08292017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca strikes $400 million Parkinson's drug deal with Takeda "
    },
    {
        "content": "* Britain's AstraZeneca has no comment on report it sought to buy Japan's Daiichi Sankyo last year - spokeswoman Further company coverage: (Reporting by Ben Hirschler; Editing by Edmund Blair)",
        "date": "08312017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca has no comment on report it sought to buy Daiichi Sankyo "
    },
    {
        "content": "LONDON  Aug 29 AstraZeneca is to receive up to $400 million from Takeda Pharmaceutical after striking a deal for the Japanese company to co-develop an early-stage medicine for Parkinson's disease.",
        "date": "08292017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca strikes $400 mln Parkinson's drug deal with Takeda "
    },
    {
        "content": "* ASTRAZENECA AND TAKEDA ESTABLISH COLLABORATION TO DEVELOP AND COMMERCIALISE MEDI1341 FOR PARKINSON'S DISEASE",
        "date": "08292017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca  Takeda collaborate to develop  commercialise MEDI1341 for Parkinson's disease "
    },
    {
        "content": "* Daiichi Sankyo soars after report of rebuffed AstraZeneca offer",
        "date": "08312017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Nikkei climbs to 2-week highs as U.S. data bolsters dollar-yen "
    },
    {
        "content": "TOKYO  Aug 31 Britain's AstraZeneca offered to buy Japanese drugmaker Daiichi Sankyo Co last year  a business magazine reported on Thursday  sending the stock soaring before trade was suspended.",
        "date": "08312017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca sought to buy Japan's Daiichi Sankyo last year -report "
    },
    {
        "content": "The U.S. Food and Drug Administration on Thursday expanded the use of Lynparza  sold by AstraZeneca Plc and Merck & Co Inc  to include ongoing treatment of patients with recurrent ovarian cancer who have responded to platinum-based chemotherapy.",
        "date": "08172017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "FDA expands use of AstraZeneca/Merck ovarian cancer drug "
    },
    {
        "content": "* Champions Oncology announces strategic collaboration with AstraZeneca to develop unique cohorts of patient-derived xenograft (PDX) models",
        "date": "08212017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Champions Oncology announces strategic collaboration with AstraZeneca to develop unique cohorts of PDX models "
    },
    {
        "content": "Aug 17 The U.S. Food and Drug Administration on Thursday expanded the use of Lynparza  sold by AstraZeneca Plc and Merck & Co Inc  to include ongoing treatment of patients with recurrent ovarian cancer who have responded to platinum-based chemotherapy.",
        "date": "08172017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-FDA expands use of AstraZeneca/Merck ovarian cancer drug "
    },
    {
        "content": "Aug 17 The U.S. Food and Drug Administration on Thursday expanded the use of Lynparza  sold by AstraZeneca Plc and Merck & Co Inc  to include ongoing treatment of patients with recurrent ovarian cancer who have responded to platinum-based chemotherapy.",
        "date": "08172017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "FDA approves expanded use of AstraZeneca ovarian cancer drug "
    },
    {
        "content": "FRANKFURT  Aug 21 AstraZeneca has stepped up its investment in messenger RNA drugs  a promising approach in genetic therapy  by spending more than 25 million euros ($29 million) on a research alliance with German biotech start-up Ethris.",
        "date": "08212017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca ups investment in messenger RNA drugs with Ethris deal "
    },
    {
        "content": "* ANNOUNCED A FIVE-YEAR STRATEGIC RESEARCH COLLABORATION WITH ASTRAZENECA AND ITS GLOBAL BIOLOGICS RESEARCH AND DEVELOPMENT ARM  MEDIMMUNE",
        "date": "08212017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Ethris announces five-year research collaboration with Astrazeneca "
    },
    {
        "content": "* BRUCE BURLINGTON WILL RETIRE AS A NON-EXECUTIVE DIRECTOR OF ASTRAZENECA PLC Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "08162017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca says non-exec director Burlington to retire "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  August 01 (Fitch) Fitch Ratings has downgraded UK-based pharmaceutical company AstraZeneca PLC's (AZ) Long-Term Issuer Default Rating (IDR) and senior unsecured rating to 'A-' from 'A'. The Outlook is Negative. The downgrade reflects AstraZeneca's increasing business risk as the pharmaceutical group transitions into next-generation therapies. The company's recent mixed late-stage pipeline developments in oncology - an increasing",
        "date": "08012017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Fitch Downgrades AstraZeneca to 'A-'; Outlook Negative "
    },
    {
        "content": "LONDON Hurdles ranging from existing commercial tie-ups to politics make drugmaker AstraZeneca a problematic takeover target in the wake of last week's big lung cancer setback that hammered the stock and rekindled takeover talk.",
        "date": "08012017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca a tricky takeover target after big cancer drug blow "
    },
    {
        "content": "LONDON  Aug 1 AstraZeneca said on Tuesday that U.S. regulators had awarded its blood cancer drug acalabrutinib \"breakthrough\" status for the treatment of patients with mantle cell lymphoma  a rare type of blood cancer.",
        "date": "08012017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca gets breakthrough status for blood cancer drug "
    },
    {
        "content": "LONDON AstraZeneca hired two senior scientists to bolster its cancer drug work on Monday  signaling confidence in its oncology portfolio despite last week's big setback in a lung cancer clinical trial.",
        "date": "07312017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca fights back in cancer with new hires  fast drug status "
    },
    {
        "content": "LONDON  July 31 AstraZeneca hired two senior scientists to bolster its cancer drug work on Monday  signalling confidence in its oncology portfolio despite last week's big setback in a lung cancer clinical trial.",
        "date": "07312017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca fights back in cancer with new hires  fast drug status "
    },
    {
        "content": "* ‍Jean-Charles Soria joins Medimmune  co's global biologics research and development arm  as senior vice president  head of oncology innovative medicines",
        "date": "07312017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca hires two immuno-oncology experts "
    },
    {
        "content": "LONDON  July 31 AstraZeneca said on Monday its immunotherapy drug Imfinzi had been granted \"breakthrough\" designation by U.S. regulators for treating non-metastatic lung cancer  following the success of the so-called Pacific trial.",
        "date": "07312017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca drug gets breakthrough status in early lung cancer "
    },
    {
        "content": "* Imfinzi granted breakthrough therapy designation by us fda for patients with locally-advanced unresectable non-small cell lung cancer Source text for Eikon: Further company coverage: (Reporting By London Bureau)",
        "date": "07312017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca's Imfinzi cancer drug granted breakthrough therapy designation by FDA "
    },
    {
        "content": "LONDON AstraZeneca's combination of two injectable immunotherapy drugs failed to help patients as hoped in a closely watched advanced lung cancer trial  triggering the biggest ever daily fall in its shares on Thursday.",
        "date": "07272017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca lung cancer failure sparks 16 percent share fall "
    },
    {
        "content": "* But Nestle results disappoint (ADVISORY- Follow European and UK stock markets in real time on the Reuters Live Markets blog on Eikon - see cpurl://apps.cp./cms/?pageId=livemarkets)",
        "date": "07272017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "European shares slip as AstraZeneca tumble drags indexes lower "
    },
    {
        "content": "* Merck gains  Bristol-Myers falls in reaction to news (Adds Merck and Bristol share moves  CEO comment on dividend)",
        "date": "07272017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 7-AstraZeneca lung cancer failure sparks 16 percent share fall "
    },
    {
        "content": "* Tagrisso® (osimertinib) significantly improves progression-free survival in the phase iii flaura trial for lung cancer",
        "date": "07272017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca's lung cancer drug succeeds late-stage trial "
    },
    {
        "content": "* But Nestle results disappoint (Adds details  updates prices)",
        "date": "07272017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca slump dominates European shares on busy earnings day "
    },
    {
        "content": "July 28 Moody's Investors Service said on Friday it changed its outlook on AstraZeneca Plc's long-term debt rating to negative from stable  a day after the company's closely watched advanced lung cancer trial failed.",
        "date": "07282017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Moody's takes negative outlook on AstraZeneca's debt "
    },
    {
        "content": "* ASTRAZENECA AND MERCK ESTABLISH STRATEGIC ONCOLOGY COLLABORATION",
        "date": "07272017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca says establish strategic oncology collaboration with Merck "
    },
    {
        "content": "July 27 Britain's FTSE 100 futures were up 0.3 percent ahead of the cash market open.",
        "date": "07272017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-UK Stocks-Factors to watch on July 27 "
    },
    {
        "content": "LONDON  July 28 Britain's two big drugmakers face very different challenges but they share a common problem: how to convince investors that their dividends are safe.",
        "date": "07282017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Dividends a worry at drugmakers Astra  GSK after dramatic week "
    },
    {
        "content": "LONDON  July 27 AstraZeneca's combination of two immunotherapy drugs  durvalumab and tremelimumab  failed to help patients as hoped  in a closely watched advanced lung cancer trial  the British company said on Thursday. (Reporting by Ben Hirschler)",
        "date": "07272017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca lung cancer drug combination misses goal in key study "
    },
    {
        "content": "* Kyntheum approved in EU for treatment of adults with moderate-to-severe plaque psoriasis Further company coverage: (Bangalore.newsroom@thomsonreuters.com)",
        "date": "07202017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca says Kyntheum approved in EU for treatment of adults with plaque psoriasis "
    },
    {
        "content": "LONDON  July 28 Top AstraZeneca shareholder Neil Woodford said a 16 percent fall in the company's share price on Thursday after the failure of a high-profile medical study was unwarranted and had not led him to change his view on the company.",
        "date": "07282017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca investor Woodford says share fall on Mystic results not justified "
    },
    {
        "content": "LONDON AstraZeneca Chief Executive Pascal Soriot  responding to rumors he might leave the drugmaker to join rival Teva Pharmaceutical Industries  has told staff he expects to work together with employees to see the company succeed.",
        "date": "07212017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca CEO reassures staff  aims to be at September cancer meet "
    },
    {
        "content": "LONDON  July 21 AstraZeneca Chief Executive Pascal Soriot  responding to rumours he might leave the drugmaker to join rival Teva Pharmaceutical Industries   has told staff he expects to work together with employees to see the company succeed.",
        "date": "07212017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca CEO reassures staff  aims to be at Sept cancer meet "
    },
    {
        "content": "LONDON  July 21 AstraZeneca Chief Executive Pascal Soriot  responding to rumours he might leave the drugmaker to join rival Teva Pharmaceutical Industries   has told staff he expects to work \"together\" with employees to see the company succeed.",
        "date": "07212017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca CEO reassures staff  aims to be at Sept cancer meet "
    },
    {
        "content": "LONDON  July 13 Shares in AstraZeneca fell more than 5 percent on Thursday after a media report said Chief Executive Pascal Soriot was about to defect to Israel-based Teva Pharmaceutical Industries.",
        "date": "07132017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca slumps on report CEO is heading to Teva "
    },
    {
        "content": "LONDON Anglo-Swedish pharmaceutical firm AstraZeneca  said on Friday its chief executive  Pascal Soriot  would host a results call with reporters on July 27  after refusing to comment on speculation this week that he was leaving the firm. | Video ",
        "date": "07142017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca says CEO Pascal Soriot will host earnings call "
    },
    {
        "content": "LONDON  July 14 Anglo-Swedish pharmaceutical firm AstraZeneca said on Friday its chief executive  Pascal Soriot  would host a results call with reporters on July 27  after refusing to comment on speculation this week that he was leaving the firm.",
        "date": "07142017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 3-AstraZeneca says CEO Pascal Soriot will host earnings call "
    },
    {
        "content": "TEL AVIV Israel-based Teva Pharmaceutical Industries  is expected to name Anglo-Swedish group AstraZeneca's  Chief Executive Pascal Soriot as Teva's next CEO  the Calcalist financial news website said on Wednesday.",
        "date": "07122017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca's CEO Soriot to join Israeli drugs company Teva: report "
    },
    {
        "content": "LONDON  July 14 Anglo-Swedish pharmaceutical firm AstraZeneca said on Friday its chief executive Pascal Soriot would host a results call with reporters on July 27  after refusing to comment on speculation this week that he was leaving the firm.",
        "date": "07142017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca says CEO Pascal Soriot to host call on results "
    },
    {
        "content": "TEL AVIV  July 12 Israel-based Teva Pharmaceutical Industries is expected to name Anglo-Swedish group AstraZeneca's Chief Executive Pascal Soriot as Teva's next CEO  the Calcalist financial news website said on Wednesday.",
        "date": "07122017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca's CEO Soriot to join Israeli drugs company Teva-report "
    },
    {
        "content": "TEL AVIV  July 12 Israel-based Teva Pharmaceutical Industries will name AstraZeneca chief executive Pascal Soriot as its next CEO  the Calcalist financial news website said on Wednesday.",
        "date": "07122017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca's CEO Soriot to join Israeli drugs company Teva-report "
    },
    {
        "content": "LONDON  July 14 Anglo-Swedish pharmaceutical firm AstraZeneca declined to comment on speculation about the future of its chief executive Pascal Soriot on Friday  after a report quoted Bloomberg news agency saying he would stay in his post.",
        "date": "07142017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca offers no comment after report saying CEO staying "
    },
    {
        "content": "* AstraZeneca CEO said to plan on staying at drugmaker - StreetInsider citing Bloomberg Source text - http://bit.ly/2tRSn4W Further company coverage:",
        "date": "07142017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca CEO said to plan on staying at drugmaker - StreetInsider citing Bloomberg "
    },
    {
        "content": "LONDON  July 14 Shares in AstraZeneca fell for a second day on Friday  as uncertainty over the future of Chief Executive Pascal Soriot weighed on the Anglo-Swedish company ahead of a crucial period.",
        "date": "07142017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca shares fall for a second day over CEO uncertainty "
    },
    {
        "content": "July 3 RECORDATI INDUSTRIA CHIMICA E FARMACEUTICA SPA:",
        "date": "07032017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Recordati acquisition of rights to Astrazeneca’s metoprolol based treatments in Europe completed "
    },
    {
        "content": "LONDON  June 29 AstraZeneca and Hutchison China MediTech said on Thursday they had initiated a global late-stage clinical trial of the experimental drug savolitinib in a relatively rare type of kidney cancer.",
        "date": "06292017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca  Chi-Med take kidney cancer drug into final testing "
    },
    {
        "content": "A federal judge has dismissed claims against AstraZeneca PLC by a Massachusetts lawyer who claimed he was misled into participating in a clinical trial of a cholesterol drug that failed to treat his kidney disease.",
        "date": "06262017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca escapes lawsuit over clinical drug trial "
    },
    {
        "content": "* U.S. near-term put contracts outweigh call options 3.3 times",
        "date": "06272017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca cancer drug trial prompts investors to take options cover "
    },
    {
        "content": "LONDON  June 19 Scientists have developed a new three-in-one blood test that has the potential to turn AstraZeneca's drug Lynparza into a precision medicine for prostate cancer.",
        "date": "06182017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "New test may turn AZ's Lynparza into precision drug for prostate cancer "
    },
    {
        "content": "LONDON GlaxoSmithKline has struck a deal for Luke Miels to start as its new head of pharmaceuticals in September  following a lengthy dispute over his contract with his former employer AstraZeneca.",
        "date": "06192017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "GSK's new pharma head to join in September after AstraZeneca tussle "
    },
    {
        "content": "LONDON  June 19 GlaxoSmithKline has struck a deal for Luke Miels to start as its new head of pharmaceuticals in September  following a lengthy dispute over his contract with his former employer AstraZeneca.",
        "date": "06192017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-GSK's new pharma head to join in September after AstraZeneca tussle "
    },
    {
        "content": "LONDON  June 19 GlaxoSmithKline said on Monday it had reached an agreement for Luke Miels to start as its new head of pharmaceuticals on Sept. 4  following a drawn-out dispute over his contract with former employer AstraZeneca. (Reporting by Ben Hirschler; Editing by Kate Kelland)",
        "date": "06192017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "GSK to get new pharma head in Sept  after AstraZeneca tussle "
    },
    {
        "content": "* Astrazeneca presents new data underpinning safety profile and real-world cv outcomes of farxiga at ada 2017",
        "date": "06122017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca presents new data underpinning safety profile and real-world cv outcomes of Farxiga at ADA 2017 "
    },
    {
        "content": "LONDON AstraZeneca continued its program of divesting old medicines on Wednesday with the sale for up to $302 million of migraine drug Zomig to Germany's Grunenthal.",
        "date": "06072017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca sells migraine drug for up to $302 million "
    },
    {
        "content": "LONDON  June 7 AstraZeneca continued its programme of divesting old medicines on Wednesday with the sale for up to $302 million of migraine drug Zomig to Germany's Grunenthal.",
        "date": "06072017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca sells migraine drug for up to $302 mln "
    },
    {
        "content": "* Announced that it has entered an agreement with Grünenthal for global rights to Zomig (Zolmitriptan) outside Japan​",
        "date": "06072017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca enters agreement for Zomig rights outside Japan​ "
    },
    {
        "content": "* Astrazeneca to present scientific advances in cardiovascular and metabolic diseases at 2017 ADA scientific sessions Source text for Eikon: Further company coverage:",
        "date": "06082017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca to present scientific advances in cardiovascular  metabolic diseases "
    },
    {
        "content": "* Files preliminary prospectus supplement with U.S. SEC related to potential notes offering - SEC filing Source text for Eikon: Further company coverage:",
        "date": "06052017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca files preliminary prospectus supplement with U.S. SEC related to potential notes offering "
    },
    {
        "content": "* Eleven Biotherapeutics to collaborate with Astrazeneca and National Cancer Institute on development of vicinium in combination with durvalumab",
        "date": "06062017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Eleven Biotherapeutics to collaborate with Astrazeneca  National Cancer Institute "
    },
    {
        "content": "Women with advanced breast cancer who carry specific genetic mutations experienced double the response rate and delayed disease progression when treated with AstraZeneca Plc's Lynparza compared with standard chemotherapy  according to data from a late-stage trial presented on Sunday.",
        "date": "06042017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca's Lynparza slows advanced breast cancer progression: study "
    },
    {
        "content": "* Astrazeneca presents Tagrisso (osimertinib) data in patients with egfr t790m-mutation positive lung cancer and central nervous system metastases",
        "date": "06062017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca presents Tagrisso trial data "
    },
    {
        "content": "June 4 Women with advanced breast cancer who carry specific genetic mutations experienced double the response rate and delayed disease progression when treated with AstraZeneca Plc's Lynparza compared with standard chemotherapy  according to data from a late-stage trial presented on Sunday.",
        "date": "06042017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca's Lynparza slows advanced breast cancer progression -study "
    },
    {
        "content": "* Orexo receives USD 2.5 million milestone payment from AstraZeneca as OX-CLI advances into clinical trials Source text for Eikon: Further company coverage:",
        "date": "06022017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Orexo receives USD 2.5 mln milestone payment from AstraZeneca "
    },
    {
        "content": "* Expects to use net proceeds of issue for general corporate purposes which may include refinancing of existing indebtedness",
        "date": "06062017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca says prices $2bn bond issue "
    },
    {
        "content": "* Appoints professor nazneen rahman to its board of directors and science committee",
        "date": "05312017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca appoints Nazneen Rahman as a non-exec "
    },
    {
        "content": "* Astrazeneca initiates voluntary nationwide recall of one lot of brilinta 90mg professional sample bottles due to report of another medicine in one bottle from that lot",
        "date": "05252017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca recalls one lot of Brilinta professional sample bottles "
    },
    {
        "content": "LONDON  May 25 The number of new drugs approved for sale in United States and Europe has bounced back this year  suggesting a marked slowdown in 2016 was an aberration rather than a sign of flagging research and development productivity.",
        "date": "05252017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Drug approvals bounce back as R&D labs churn out new winners "
    },
    {
        "content": "LONDON AstraZeneca's experimental injection for severe asthma cut substantially the need for patients to take problematic oral steroid drugs in a late-stage study  boosting hopes for a medicine that is expected to reach the market later this year.",
        "date": "05232017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca asthma shot hits goal but diabetes drug lags rival "
    },
    {
        "content": "LONDON  May 22 AstraZeneca's experimental injection for severe asthma cut substantially the need for patients to take problematic oral steroids drugs in a late-stage study  boosting hopes for a medicine that is expected to reach the market later this year.",
        "date": "05222017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Severe asthma drug shows AstraZeneca promise beyond cancer "
    },
    {
        "content": "LONDON AstraZeneca  has sold the European rights to its aging beta-blocker heart drug Seloken to Italy's Recordati  for $300 million  as part of a continuing drive by the British drugmaker to spin off non-core assets.",
        "date": "05222017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca sells aging beta-blocker to Recordati for $300 million "
    },
    {
        "content": "LONDON  May 22 AstraZeneca has sold the European rights to its ageing beta-blocker heart drug Seloken to Italy's Recordati for $300 million  as part of a continuing drive by the British drugmaker to spin off non-core assets.",
        "date": "05222017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca sells ageing beta-blocker to Recordati for $300 mln "
    },
    {
        "content": "* Bydureon fails to show heart risk reduction in diabetes (Wraps asthma and diabetes drug news)",
        "date": "05232017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca asthma shot hits goal but diabetes drug lags rival "
    },
    {
        "content": "* Astrazeneca enters agreement with Recordati for seloken in europe",
        "date": "05222017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca sells rights for beat-blocker Seloken to Recordati "
    },
    {
        "content": "May 22 RECORDATI INDUSTRIA CHIMICA E FARMACEUTICA SPA:",
        "date": "05222017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Recordati acquires from AstraZeneca European rights to Metoprolol based products "
    },
    {
        "content": "* GENOMIC VISION TO ENTER INTO TECHNOLOGICAL COLLABORATION WITH ASTRAZENECA IN ONCOLOGY",
        "date": "05232017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Genomic Vision to enter into technological collaboration with AstraZeneca in oncology "
    },
    {
        "content": "* Bydureon EXSCEL trial meets primary safety objective in type-2 diabetes patients at wide range of cardiovascular risk",
        "date": "05232017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca says Bydureon EXSCEL trial meets safety objective in diabetes patients "
    },
    {
        "content": "LONDON  May 15 Sales forecasts for AstraZeneca's all-important new cancer immunotherapy drug Imfinzi are set to rise after the drugmaker received an unexpectedly early boost for the medicine in lung cancer last week.",
        "date": "05152017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "How AstraZeneca cancer drug forecasts are set to rise "
    },
    {
        "content": "* Hikma extends losses (ADVISORY- Follow European and UK stock markets in real time on the Reuters Live Markets blog on Eikon  see cpurl://apps.cp./cms/?pageId=livemarkets)",
        "date": "05122017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Record close for Britain's FTSE as AstraZeneca soars "
    },
    {
        "content": "LONDON A trial of AstraZeneca's key immunotherapy drug durvalumab showed it reduced disease progression in lung cancer patients  sending the company's shares higher and giving it a lead over rivals as it seeks to transform its oncology business.",
        "date": "05122017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca shares surge after key drug shows promise in lung cancer trial "
    },
    {
        "content": "* AstraZeneca seeking to mitigate loss of patents (Adds milestones  detail)",
        "date": "05122017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 3-AstraZeneca shares surge after key drug shows promise in lung cancer trial "
    },
    {
        "content": "LONDON  May 12 Britain's top share index rose on Friday  on track for its third successive week of gains as pharmaceutical stock AstraZeneca rose after a positive drug trial and broker upgrades buoyed individual firms.",
        "date": "05122017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Britain's FTSE heads for third straight week of gains as AstraZeneca rises "
    },
    {
        "content": "LONDON  May 12 AstraZeneca's key immunotherapy drug durvalumab was shown to reduce the risk of stage III lung cancer worsening or causing death in a trial  the pharmaceutical company said on Friday.",
        "date": "05122017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca's durvalumab shown in trial to reduce risk of death from lung cancer "
    },
    {
        "content": "An experimental biotech drug for severe asthma from AstraZeneca failed to meet its goal of significantly reducing attacks in a late-stage study  dealing a blow to an approach that had already run into problems at Roche  .",
        "date": "05102017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca asthma drug fails  after similar setback at Roche "
    },
    {
        "content": "* Inovio provides update on MedImmune launch of combination trial for hpv-associated head & neck cancer",
        "date": "05102017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Inovio pharmaceuticals says AstraZeneca's MedImmune will start new clinical trial "
    },
    {
        "content": "May 10 An experimental biotech drug for severe asthma from AstraZeneca failed to meet its goal of significantly reducing attacks in a late-stage study  dealing a blow to an approach that had already run into problems at Roche .",
        "date": "05102017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca asthma drug fails  after similar setback at Roche "
    },
    {
        "content": "May 10 Drugmaker AstraZeneca Plc said its asthma drug failed to meet the main goal of significantly reducing the annual asthma exacerbation rate in a late-stage study.",
        "date": "05102017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca's asthma drug fails in study "
    },
    {
        "content": "* Says average wholesale acquisition cost of durvalumab around $15 000/month  following FDA approval of drug for bladder cancer Further company coverage: (Reporting by UK bureau)",
        "date": "05012017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca's durvalumab average monthly cost around $15 000 "
    },
    {
        "content": "U.S. regulators have approved AstraZeneca's key immunotherapy drug durvalumab as a treatment for bladder cancer  marking the first commercial green light for a product the company hopes will go on to sell billions of dollars.",
        "date": "05022017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca immunotherapy wins first approval in bladder cancer "
    },
    {
        "content": "April 26 GlaxoSmithKline Plc CEO Emma Walmsley told analysts:",
        "date": "04262017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-GSK still in talks with AstraZeneca about start date for Luke Miels "
    },
    {
        "content": "May 1 The U.S. Food and Drug Administration on Monday granted accelerated approval to AstraZeneca Plc's immuno-oncology drug to treat a type of bladder cancer in patients whose disease progressed despite chemotherapy.",
        "date": "05012017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-U.S. FDA approves AstraZeneca's immunotherapy for bladder cancer "
    },
    {
        "content": "* AstraZeneca sets durvalumab price at $15 000/month (Adds analyst reaction  sales forecast  latest shares)",
        "date": "05022017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 3-AstraZeneca immunotherapy wins first approval in bladder cancer "
    },
    {
        "content": "May 1 The U.S. Food and Drug Administration on Monday granted accelerated approval to AstraZeneca Plc's immuno-oncology drug to treat a type of bladder cancer in patients whose disease progressed following chemotherapy.",
        "date": "05012017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "U.S. FDA approves AstraZeneca's bladder cancer drug "
    },
    {
        "content": "* 61.17 percent votes cast in favor to approve annual report on remuneration for year ended December 31  2016 at AGM  38.83 percent against",
        "date": "04272017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca AGM approves directors' remuneration policy "
    },
    {
        "content": "* Focus on pivotal lung cancer trial results due mid-year (Adds further CEO comment cancer drugs  more reaction  details)",
        "date": "04272017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-AstraZeneca aims to escape drug sales trough in second half "
    },
    {
        "content": "LONDON British biotech firm Synairgen lost nearly half its value on Thursday as partner AstraZeneca pulled the plug on an experimental drug designed to help patients fight common cold viruses.",
        "date": "04272017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Synairgen loses half its value as AstraZeneca dumps drug "
    },
    {
        "content": "LONDON  April 27 AstraZeneca's chief executive said on Thursday his company remained \"very committed\" to investment in Britain  despite challenges in the UK market.",
        "date": "04272017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca committed to UK  despite market challenges "
    },
    {
        "content": "LONDON  April 25 AstraZeneca's move to the English university city of Cambridge will cost more and take longer than initially expected  following increased expenditure on new technology and equipment.",
        "date": "04252017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca moving costs rise as new HQ nears completion "
    },
    {
        "content": "* European Commission has granted full marketing authorisation for Tagrisso (osimertinib)",
        "date": "04252017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca's lung cancer drug receives full EU approval "
    },
    {
        "content": "LONDON Three years after Pfizer's failed bid for AstraZeneca  the British drugmaker aims to prove in the coming weeks that its cancer immunotherapy can deliver on bold sales forecasts made during that takeover battle.",
        "date": "04192017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Analysis -As AstraZeneca chases rivals  immuno-oncology gets complicated "
    },
    {
        "content": "LONDON Three years after Pfizer's failed bid for AstraZeneca  the British drugmaker aims to prove in the coming weeks that its cancer immunotherapy can deliver on bold sales forecasts made during that takeover battle.",
        "date": "04192017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "As AstraZeneca chases rivals  immuno-oncology gets complicated "
    },
    {
        "content": "LONDON  April 3 An experimental drug spun off by AstraZeneca last year to an unlisted U.S. biotech firm could cut menopausal hot flashes by nearly three-quarters  according to results from a small mid-stage clinical trial.",
        "date": "04032017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Drug spun off by AstraZeneca shows promise in hot flashes "
    },
    {
        "content": "* Potential medicine for neuromyelitis optica spectrum disorder receives orphan designation in europe Source text for Eikon: Further company coverage: (Reporting By London Bureau)",
        "date": "03292017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca's autoimmune disease drug receives orphan designation "
    },
    {
        "content": "* Astrazeneca - announced new results data evaluating cost-effectiveness of synagis for respiratory syncytial virus in preterm infants 29-34 weeks gestational age",
        "date": "03282017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca announced new results data evaluating cost-effectiveness of synagis "
    },
    {
        "content": "LONDON AstraZeneca has won approval for its lung cancer pill Tagrisso in China  a key market for the potential blockbuster medicine.",
        "date": "03272017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Chinese drug approval boosts AstraZeneca's lung cancer hopes "
    },
    {
        "content": "* First drug approved under Chinese priority review pathway   (Adds further details on drug  executive comment)",
        "date": "03272017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-Chinese drug approval boosts AstraZeneca's lung cancer hopes "
    },
    {
        "content": "LONDON  March 27 AstraZeneca said on Monday it had won approval for its lung cancer pill Tagrisso in China  a key market for the potential blockbuster medicine.",
        "date": "03272017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca wins approval for lung cancer pill in China "
    },
    {
        "content": "LONDON  March 23 Britain's GlaxoSmithKline  and U.S.-based Regeneron Pharmaceuticals are embarking on a joint project with UK Biobank  the world's most detailed biomedical database  to hunt for new clues linking genes and disease.",
        "date": "03232017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "GSK and Regeneron to mine gene data from 500 000 Britons "
    },
    {
        "content": "LONDON  March 17 Britain's Circassia has secured the U.S. rights from AstraZeneca for two drugs to treat chronic obstructive pulmonary disease (COPD)  a progressive lung condition affecting millions of people  for up to $230 million.",
        "date": "03172017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Circassia strikes deal with AstraZeneca for respiratory drugs "
    },
    {
        "content": "LONDON  March 17 U.S. regulators have dealt a fresh blow to AstraZeneca's new medicine to treat high potassium levels  indicating it still has concerns over the manufacturing process of the drug.",
        "date": "03172017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca receives FDA setback for high potassium drug "
    },
    {
        "content": "LONDON  March 17 AstraZeneca said on Friday that U.S. regulators had rejected the British company's new drug for high potassium levels  in the latest setback to the product.",
        "date": "03172017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca receives fresh blow to potassium drug "
    },
    {
        "content": "* Astrazeneca enters into a strategic collaboration with Circassia for the development and commercialization of Tudorza and Duaklir in the United States",
        "date": "03172017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca signs deal with Circassia over Almirall's products "
    },
    {
        "content": "* Receives complete response letter from US FDA for zs-9 (sodium zirconium cyclosilicate) for hyperkalaemia",
        "date": "03172017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca receives FDA response to hyperkalaemia drug application "
    },
    {
        "content": "LONDON  March 14 AstraZeneca's ovarian cancer drug Lynparza slowed disease progression sharply in a closely watched clinical trial  boosting hopes for a product that belongs to a novel drug class called PARP inhibitors.",
        "date": "03142017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca ovarian cancer drug slows disease markedly in study "
    },
    {
        "content": "* Proposed collaboration and securing of certain U.S. Commercial rights to Tudorza And Duaklir from Astrazeneca",
        "date": "03172017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Circassia to secure certain U.S. commercial rights to Tudorza  Duaklir from AstraZeneca "
    },
    {
        "content": "JOHANNESBURG  March 9 South African drugmaker Aspen Pharmacare Holdings Ltd reported a 6 percent rise in first-half profit on Thursday  helped by the results of a recently acquired portfolio of medicines from AstraZeneca .",
        "date": "03092017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "South Africa's Aspen posts 6 pct rise in H1 profit "
    },
    {
        "content": "* Medi8897 is a monoclonal antibody (mab) for prevention of lower respiratory tract illness (lrti) caused by respiratory syncytial virus",
        "date": "03032017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca ties up with Sanofi on respiratory drug "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  February 22 (Fitch) Fitch Rating has affirmed UK-based pharmaceutical  company AstraZeneca PLC's (AZ) Long-Term Issuer Default Rating (IDR) and senior  unsecured rating at 'A'. The Outlook is Stable. The rating remains underpinned by AZ's leading position in the global  pharmaceutical sector  supported by a business risk profile characterised by  scale  diversification  and focus on innovation. The group is accelerating the  dev",
        "date": "02222017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Fitch Affirms Astrazeneca at 'A'; Stable Outlook "
    },
    {
        "content": "* Enters agreement with tersera therapeutics for zoladex in us and canada",
        "date": "02202017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca sells U.S. Zoladex rights to tersera "
    },
    {
        "content": "LONDON Top AstraZeneca  shareholder Woodford Investment Management said on Wednesday it had added to its stake in the pharmaceutical firm and was confident in its growth outlook.",
        "date": "02162017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Top AstraZeneca shareholder Woodford adds to stake  bullish on outlook "
    },
    {
        "content": "LONDON  Feb 16 Top AstraZeneca  shareholder Woodford Investment Management said on Wednesday it had added to its stake in the pharmaceutical firm and was confident in its growth outlook.",
        "date": "02162017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "REFILE-Top AstraZeneca shareholder Woodford adds to stake  bullish on outlook "
    },
    {
        "content": "* Partner Valeant Pharmaceuticals announced that US FDA has approved Siliq (Brodalumab) injection for treatment of adult patients with moderate-to-severe plaque psoriasis",
        "date": "02162017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca says will get $130 mln as milestone payment after Brodalumab approval "
    },
    {
        "content": "Feb 17 AstraZeneca Plc said Lynparza  already approved to treat ovarian cancer  met the main goal of helping breast cancer patients live longer without their condition worsening in a late-stage study.",
        "date": "02172017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca's Lynparza meets main goal in breast cancer study "
    },
    {
        "content": "* Astrazeneca Plc reports a 4.5 percent passive stake in Catabasis Pharmaceuticals as of February 3  2017 - SEC filing  Source text : [ID:http://bit.ly/2lyYl4w] Further company coverage:",
        "date": "02102017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca Plc reports a 4.5 percent passive stake in Catabasis Pharmaceuticals as of February 3  2017 "
    },
    {
        "content": "* Renews supply contract with AstraZeneca for the peptide active substance Goserelin",
        "date": "02072017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Bachem Holding renews supply contract with AstraZeneca "
    },
    {
        "content": "* FibroGen's Roxadustat (FG-4592) meets primary endpoints in two phase 3 anemia studies in China",
        "date": "01302017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-FibroGen's Roxadustat (FG-4592) meets primary endpoints in two phase 3 anemia studies in China "
    },
    {
        "content": "LONDON AstraZeneca  warned on Thursday that profit and revenue would both fall this year as cheap generic versions of its cholesterol drug Crestor continue to hit sales.",
        "date": "02022017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca flags tough 2017  yet confident on key cancer trial "
    },
    {
        "content": "* Still confident on prospects for lung cancer trial   (Adds more from CEO on cancer trial  long-term forecast  updates shares)",
        "date": "02022017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 4-AstraZeneca flags tough 2017  yet confident on key cancer trial "
    },
    {
        "content": "LONDON AstraZeneca's  chief executive remains confident in the drugmaker's ability to reach more than $40 billion in annual revenue in 2023  despite weakening sales of older medicines and uncertainty about those in the pipeline.",
        "date": "02022017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca stands by 2023 sales above $40 billion at today's FX "
    },
    {
        "content": "LONDON  Feb 2 Drugmaker AstraZeneca  warned on Thursday that profit  and revenue would fall again this year as cheap generic versions of its cholesterol drug Crestor continue to hit sales.",
        "date": "02022017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca faces falling 2017 profits as key drug data awaited "
    },
    {
        "content": "New YORK  Jan 20 Bristol-Myers Squibb Co  shares fell 11 percent on Friday following Thursday's announcement that it would not seek accelerated approval of its immunotherapy drug combination in first-line lung cancer  further solidifying Merck & Co Inc's leading position in the burgeoning immuno-oncolgy field.",
        "date": "01202017",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-Bristol-Myers lung cancer delay slams shares  keeps Merck in lead "
    },
    {
        "content": "* Agreement regards all of about 2 500 AstraZeneca employees in Göteborg  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "01122017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Feelgood Svenska signs deal with AstraZeneca "
    },
    {
        "content": "A federal judge in Delaware has dismissed a whistleblower lawsuit accusing pharmacy benefit manager Medco Health Solutions Inc  now part of Express Scripts Holding Co  of taking kickbacks from AstraZeneca PLC to promote its drugs  finding the case was barred by earlier  similar lawsuits.",
        "date": "01092017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Whistleblower case against Express Scripts dismissed "
    },
    {
        "content": "LONDON Credit Suisse and AstraZeneca are among Bank of America-Merrill Lynch's top picks for the first quarter of 2017  as the market is overly pessimistic on both stocks  according to analysts at the bank.",
        "date": "01032017",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Credit Suisse  AstraZeneca among top BofA-ML's top European picks for first quarter "
    },
    {
        "content": "LONDON AstraZeneca is losing its head of oncology  Mondher Mahjoubi  who is departing to lead French biotech company Innate Pharma.",
        "date": "12192016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca oncology head jumps ship to become Innate CEO "
    },
    {
        "content": "FRANKFURT AstraZeneca's immunotherapy drug durvalumab  the British drugmaker's most important pipeline medicine  has been accepted for review by U.S. regulators against bladder cancer  potentially its first use.",
        "date": "12092016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca's immunotherapy enters U.S. approval process "
    },
    {
        "content": "LONDON AstraZeneca's pill Tagrisso cut the risk of lung cancer progressing by 70 percent compared to standard chemotherapy in a major clinical trial  lifting prospects for a drug that is key to the company's lofty long-term sales goals.",
        "date": "12062016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca pill slashes lung cancer progression in study "
    },
    {
        "content": "LONDON AstraZeneca has signed a wide-ranging deal with private biotech firm Bicycle Therapeutics to develop a novel class of small molecule medicines for treating respiratory  cardiovascular and metabolic diseases.",
        "date": "12012016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca in broad drug deal with Bicycle worth up to $1 billion "
    },
    {
        "content": "LONDON  Nov 25 Britain's top share index looked set for a third straight week of gains on Friday  with its heavily weighted commodity sector benefiting from bets on rising inflation even as a broader equity rally stalled.",
        "date": "11252016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Britain's FTSE looks set for third straight week of gains "
    },
    {
        "content": "LONDON GlaxoSmithKline has started pivotal trials of an experimental anemia drug  chasing AstraZeneca in the race to develop a medicine that mimics the body's response to high altitude.",
        "date": "11242016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "GSK chases Astra with start of big anemia drug trials "
    },
    {
        "content": "* Trials involve AstraZeneca's immunotherapy durvalumab   (Adds shares  further details on immunotherapy)",
        "date": "11222016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca cleared to resume enrolment in cancer drug trials "
    },
    {
        "content": "LONDON  Nov 24 GlaxoSmithKline has started pivotal trials of an experimental anaemia drug  chasing AstraZeneca in the race to develop a medicine that mimics the body's response to high altitude.",
        "date": "11242016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "GSK chases Astra with start of big anaemia drug trials "
    },
    {
        "content": "* Astrazeneca head and neck cancer trials resume new patient enrolment as fda lifts partial clinical hold",
        "date": "11222016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca resumes cancer trials after FDA lifts partial hold "
    },
    {
        "content": "Nov 21 A U.S. appeals court upheld AstraZeneca Plc and Ranbaxy Laboratories' victory in a lawsuit accusing them of reaching an illegal deal to delay the launch of a generic version of AstraZeneca's heartburn drug Nexium.",
        "date": "11212016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "U.S. court upholds AstraZeneca  Ranbaxy win in Nexium antitrust trial "
    },
    {
        "content": "* AstraZeneca announces study results show SYMBICORT improves lung function in pediatric asthma patients  Source text for Eikon:  Further company coverage:",
        "date": "11112016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca announces study results show SYMBICORT improves lung function in pediatric asthma patients "
    },
    {
        "content": "LONDON Drugmaker AstraZeneca  expects major U.S. healthcare changes after Donald Trump's election victory but its chief executive warned on Thursday that pricing pressures in the world's biggest drugs market would not go away.",
        "date": "11102016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca sees big healthcare changes under Trump "
    },
    {
        "content": "* Q3 core EPS $1.32 vs consensus 97 cents   (Adds comments by CEO on U.S. market  analyst's comment  updates share price)",
        "date": "11102016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 3-AstraZeneca sees big healthcare changes under Trump "
    },
    {
        "content": "Nov 10 Astrazeneca executives comment to reporters after Q3 results:",
        "date": "11102016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca CEO: drug price pressure won't go away under Trump "
    },
    {
        "content": "LONDON  Nov 10 AstraZeneca said on Thursday it had given up on the idea of seeking an early approval of its immunotherapy drug durvalumab in head and neck cancer using mid-stage Phase II clinical trials data.",
        "date": "11102016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca drops early head and neck cancer drug plans "
    },
    {
        "content": "Nov 10 Britain's FTSE 100 index is seen opening 34 to 35 points higher  or up 0.5 percent on Thursday  according to financial bookmakers  with futures up 0.87 percent ahead of the cash market open.",
        "date": "11102016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-UK Stocks-Factors to watch on Nov 10 "
    },
    {
        "content": "BOSTON  Oct 31 A bigger bet on European stocks in the last quarter helped U.S. hedge fund Viking Global Investors improve returns after a difficult start to the year.",
        "date": "10312016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Hedge fund Viking got boost from European stocks in 3rd qtr "
    },
    {
        "content": "* Move does not affect other immunotherapy drug trials   (Adds more comment from company and analysts  details on bleeding)",
        "date": "10272016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca pauses two cancer drug trials' enrolment due to bleeding "
    },
    {
        "content": "* FDA moves cement Merck's leading position in lung cancer   (Adds more detail on approval  competition  analyst comment)",
        "date": "10252016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-Merck wins early U.S. approval for Keytruda in untreated lung cancer "
    },
    {
        "content": "* FDA accepts for review new drug application for sodium zirconium cyclosilicate (zs-9) for the treatment of Hyperkalaemia",
        "date": "10182016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-FDA accepts AstraZeneca's new Hyperkalaemia drug application for review "
    },
    {
        "content": "* Updates on exclusive License Agreement With Astrazeneca in respect of Byetta And Bydureon",
        "date": "10102016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-3Sbio updates on license agreement with Astrazeneca "
    },
    {
        "content": "COPENHAGEN The failure of Bristol-Myers Squibb's blockbuster Opdivo immunotherapy in previously untreated lung cancer patients has opened up the market for AstraZeneca  its chief executive believes.",
        "date": "10082016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Bristol drug flop opens big cancer opportunity: AstraZeneca CEO "
    },
    {
        "content": "* Enters agreement with Cilag GMBH International to divest rights to Rhinocort Aqua outside US",
        "date": "10072016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca divests rights to Rhinocort Aqua outside US "
    },
    {
        "content": "Oct 5 Drugmaker Insmed Inc said it on Wednesday it had bought the rights to an experimental early-stage respiratory drug from Britain's AstraZeneca Plc  in a deal worth $150 million.",
        "date": "10052016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca licenses respiratory drug to Insmed "
    },
    {
        "content": "Oct 5 Drugmaker Insmed Inc said on Wednesday it had bought the rights to an experimental early-stage respiratory drug from Britain's AstraZeneca Plc  in a deal worth $150 million.",
        "date": "10052016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca licenses respiratory drug to Insmed "
    },
    {
        "content": "* Insmed will pay AstraZeneca an upfront payment of $30 million",
        "date": "10052016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Insmed announces worldwide license agreement with AstraZeneca for oral DPP1 inhibitor "
    },
    {
        "content": "Synairgen Plc said its partner AstraZeneca Plc stopped a mid-stage study for testing Synairgen's drug candidate as a potential treatment for severe asthma  putting the brakes on the lead product in Synairgen's pipeline.",
        "date": "10122016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Synairgen slumps by a third as AstraZeneca ditches asthma drug study "
    },
    {
        "content": "Oct 12 Synairgen Plc said its partner AstraZeneca Plc stopped a mid-stage study for testing Synairgen's drug candidate as a potential treatment for severe asthma  putting the brakes on the lead product in Synairgen's pipeline.",
        "date": "10122016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-Synairgen slumps by a third as AstraZeneca ditches asthma drug study "
    },
    {
        "content": "Oct 12 Drug developer Synairgen Plc  said its partner AstraZeneca Plc stopped a mid-stage study that was testing Synairgen's drug candidate as a potential treatment for severe asthma.",
        "date": "10122016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Synairgen says AstraZeneca stops mid-stage asthma drug study "
    },
    {
        "content": "LONDON AstraZeneca's heart drug Brilinta has failed to help patients with serious circulatory problems in their legs  prompting the company to scrap a $3.5 billion-a-year sales target for the medicine by 2023.",
        "date": "10042016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca cuts Brilinta sales hopes on artery disease failure "
    },
    {
        "content": "LONDON  Oct 3 Britain's AstraZeneca said it had licensed a potential medicine for inflammatory diseases to Allergan for an upfront payment of $250 million and potential additional payments of up to $1.27 billion.",
        "date": "10032016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca licenses inflammatory disease candidate to Allergan "
    },
    {
        "content": "* Received Inexas clinical trial update from AstraZeneca relating to AZD9412",
        "date": "10122016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Synairgen says AstraZeneca decided to stop phase IIa AZD9412 trial "
    },
    {
        "content": "* Drugmaker sells rights to Toprol-XL for up to $223 mln   (Adds executive interview  latest shares)",
        "date": "10042016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-AstraZeneca cuts Brilinta sales hopes on artery disease failure "
    },
    {
        "content": "* Executive Ludovic Helfgott tells Reuters $3.5 billion sales goal for Brilinta no longer attainable  Further company coverage:    (Reporting by UK bureau)",
        "date": "10042016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca exec: $3.5 bln Brilinta sales goal no longer attainable "
    },
    {
        "content": "LONDON  Oct 4 AstraZeneca said on Tuesday its heart drug Brilinta failed to show any benefit over an existing medicine in treating peripheral artery disease (PAD) in a large-scale clinical trial.",
        "date": "10042016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca's Brilinta fails in peripheral artery disease trial "
    },
    {
        "content": "* U.S. FDA has approved a blood-based companion diagnostic for Tagrisso (osimertinib)  Source text for Eikon:  Further company coverage:",
        "date": "09292016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-FDA approves Astrazeneca's blood-based companion diagnostic for Tagrisso (osimertinib) "
    },
    {
        "content": "LONDON  Sept 21 AstraZeneca has pulled an application seeking European approval to sell its experimental cancer drug cediranib in combination with chemotherapy to treat ovarian cancer because of late-stage questions raised by regulators reviewing the product.",
        "date": "09212016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca pulls cancer drug application in Europe "
    },
    {
        "content": "* Phase 3 combination trial of BYDUREON and FARXIGA shows significant blood sugar reduction in patients with type 2 diabetes",
        "date": "09162016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca announces phase 3 combination trial of BYDUREON and FARXIGA "
    },
    {
        "content": "* To withdraw marketing authorisation application submitted to European Medicines Agency's Committee for Medicinal Products for Human Use in June 2015 for Cediranib",
        "date": "09212016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca says to withdraw EU marketing application for cancer drug "
    },
    {
        "content": "JOHANNESBURG South Africa's Aspen Pharmacare Holdings  will use its recent acquisitions of GlaxoSmithKline and AstraZeneca product lines to move into China  the firm's chief executive said.",
        "date": "09142016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Aspen Pharmacare moves into China as South Africa sales dip "
    },
    {
        "content": "* Completes commercialisation agreement with Aspen for anaesthetics portfolio",
        "date": "09012016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca completes Aspen agreement "
    },
    {
        "content": "* Avara Pharmaceutical Services -About 210 Avlon employees will remain employed; plant will continue to manufacture Astrazeneca products on contract  Source text for Eikon:  Further company coverage:",
        "date": "09062016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Avara acquires Astrazeneca UK manufacturing facility "
    },
    {
        "content": "* SYMBICORT demonstrated comparable risk of serious asthma-related events and lower risk of asthma exacerbations compared to Budesonide alone",
        "date": "08312016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca announces results from SYMBICORT study "
    },
    {
        "content": "LONDON AstraZeneca hopes to convince doctors its experimental injection for severe asthma has an edge over two approved rivals after clinical trials data on Monday showed it worked well when given just once every two months.",
        "date": "09052016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca seeks edge over rivals in severe asthma treatment "
    },
    {
        "content": "* Had signed an agreement with AstraZeneca whereby AGI will acquire exclusive rights to commercialise astrazeneca's global (excluding USA) anaesthetics portfolio",
        "date": "09012016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Aspen Pharmacare to buy exclusive rights to commercialise AstraZeneca's anaesthetics portfolio "
    },
    {
        "content": "NEW YORK  Aug 30 U.S. regulators said on Tuesday that AstraZeneca Plc will pay $5.52 million to resolve a foreign bribery probe into improper payments by its sales and marketing staff to officials at state-controlled health care providers in China and Russia.",
        "date": "08302016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca to pay $5.52 mln to resolve U.S. SEC foreign bribery case "
    },
    {
        "content": "U.S. regulators said on Tuesday that AstraZeneca Plc  will pay $5.52 million to resolve a foreign bribery probe into improper payments by its sales and marketing staff to state-employed healthcare officials in China and Russia.",
        "date": "08302016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca to pay $5.52 million to resolve SEC foreign bribery case "
    },
    {
        "content": "Aug 30 U.S. regulators said on Tuesday that AstraZeneca Plc will pay $5.52 million to resolve a foreign bribery probe into improper payments by its sales and marketing staff to state-employed healthcare officials in China and Russia.",
        "date": "08302016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca to pay $5.52 mln to resolve U.S. SEC foreign bribery case "
    },
    {
        "content": "LONDON Pharmaceutical company AstraZeneca  has agreed to sell its small molecule antibiotics business to Pfizer Inc  in a deal that could be valued at more than $1.5 billion. | Video ",
        "date": "08242016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Pfizer to buy antibiotics business from AstraZeneca "
    },
    {
        "content": "* Says deal fits strategy of focusing on cancer and other areas",
        "date": "08242016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-Pfizer to buy antibiotics business from AstraZeneca "
    },
    {
        "content": "LONDON  Aug 24 Pharmaceutical company AstraZeneca said it had agreed to sell its small molecule antibiotics business to Pfizer in a deal that could reach more than $1.5 billion.",
        "date": "08242016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca to sell antibiotics business to Pfizer "
    },
    {
        "content": "* AstraZeneca and Lilly receive FDA fast track designation for AZD3293  an investigational treatment for early Alzheimer'S disease  Source text for Eikon:     Further company coverage:    (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "08222016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca  Lilly receive FDA fast track designation for AZD3293 "
    },
    {
        "content": "* Lilly and Astrazeneca receive FDA fast track designation for AZD3293  an investigational treatment for early Alzheimer's disease",
        "date": "08222016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Lilly and Astrazeneca receive FDA fast track designation for AZD3293 "
    },
    {
        "content": "LONDON AstraZeneca has invested another $140 million in  Moderna Therapeutics  the U.S. biotech \"unicorn\" which already has a cash pile of around $1 billion and is developing drugs based on a molecule known as messenger RNA.",
        "date": "08102016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca bets another $140 million on Moderna's 'messenger' drugs "
    },
    {
        "content": "LONDON  Aug 12 Long term use of AstraZeneca's  blood thinner Brilinta has been recommended as a cost-effective option for treating  patients after a heart attack  Britain's healthcare cost watchdog NICE said on Friday.",
        "date": "08112016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca wins UK cost approval for longer use of heart drug "
    },
    {
        "content": "LONDON  Aug 10 AstraZeneca has invested another $140 million in  Moderna Therapeutics  the U.S. biotech \"unicorn\" which already has a cash pile of around $1 billion and is developing drugs based on a molecule known as messenger RNA.",
        "date": "08102016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca bets another $140 mln on Moderna's \"messenger\" drugs "
    },
    {
        "content": "* Astrazeneca announces positive top-line data from two phase III SYMBICORT studies",
        "date": "08102016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca announces positive top-line data from two phase III SYMBICORT studies "
    },
    {
        "content": "* Selumetinib did not meet trial endpoint of progression-free survival in Krasm nsclc patients",
        "date": "08092016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca's selumetinib fails to meet endpoint in lung cancer trial "
    },
    {
        "content": "LONDON AstraZeneca  shares hit a record high on Friday  breaching for the first time the 55 pounds a share level offered by Pfizer  in 2014 during the U.S. group's abortive $100 billion attempt to buy the drugmaker.",
        "date": "08052016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca hits 2014 Pfizer bid price  helped by Bristol's woes "
    },
    {
        "content": "* Astrazeneca and Moderna announce filing of first clinical trial application in messenger RNA therapeutics(tm) collaboration",
        "date": "07262016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca and Moderna files first clinical trial application in RNA therapeutics "
    },
    {
        "content": "* Novartis stock down 1.8 percent   (Adds latest AstraZeneca and Novartis shares)",
        "date": "07282016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "UPDATE 2-AstraZeneca a bid target again? CEO says someone may spot value "
    },
    {
        "content": "LONDON  July 28 Generic competition to cholesterol fighter Crestor in the key U.S. market hit second-quarter earnings at drugmaker AstraZeneca  which is now banking on new cancer medicines to revive its fortunes.",
        "date": "07282016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca earnings hit by waning cholesterol drug sales "
    },
    {
        "content": "* Co and astrazeneca amend co-development agreement to accelerate savolitinib global development program;",
        "date": "08012016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Hutchison China  AstraZeneca amend savolitinib co-development agreement "
    },
    {
        "content": "July 18 AstraZeneca Plc said its experimental lung cancer drug Tagrisso met its primary endpoint in a late-stage study.",
        "date": "07182016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca's lung cancer drug meets main goal in late-stage trial "
    },
    {
        "content": "* Objective response rate  disease control rate  duration of response achieved clinically meaningful improvement versus chemotherapy",
        "date": "07182016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca's lung cancer drug meets primary endpoint in late-stage trial "
    },
    {
        "content": "July 18 AstraZeneca Plc said its experimental lung cancer drug Tagrisso met its main goal in a late-stage study.",
        "date": "07182016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca's lung cancer drug meets main goal in late-stage trial "
    },
    {
        "content": "July 13 British drugmaker AstraZeneca Plc  said on Wednesday it has entered into an agreement with Sandoz  the generic pharmaceuticals division of Novartis AG   to resolve Faslodex patent litigation in the U.S.",
        "date": "07132016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca resolves Faslodex patent litigation in U.S. "
    },
    {
        "content": "* Tagrisso approved by Health Canada as treatment for patients with locally advanced or metastatic EGFR T790M mutation-positive non-small cell lung cancer  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "07112016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca says Health Canada approves tagrisso for treatment of non-small cell lung cancer "
    },
    {
        "content": "* Fibrogen announces receipt of $62 million license payment  from Astrazeneca",
        "date": "07082016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Fibrogen announces receipt of $62 million license payment from Astrazeneca "
    },
    {
        "content": "* Says Heptares Therapeutics  the wholly-owned subsidiary of Sosei Group Corporation  reported that it has been notified by its partner AstraZeneca that the first subject has been dosed with immuno-oncology candidate HTL1071 (AZD4635) in a Phase 1 clinical study  triggering a US$10 million payment from AstraZeneca",
        "date": "07062016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Sosei Group says $10 million milestone payment from Astrazeneca to Heptares "
    },
    {
        "content": "July 1 British drugmaker AstraZeneca Plc  said it sold the rights to develop an experimental mid-stage drug to treat atopic dermatitis to privately-held LEO Pharma.",
        "date": "07012016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca sells two dermatology drug rights to LEO Pharma "
    },
    {
        "content": "July 1 British drugmaker AstraZeneca Plc  said it sold the rights to develop an experimental mid-stage drug to treat atopic dermatitis to privately-held LEO Pharma.",
        "date": "07012016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca sells two dermatology drug rights to LEO Pharma "
    },
    {
        "content": "* Enters licensing agreements with Leo Pharma in skin diseases",
        "date": "07012016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca enters licensing agreements with Leo Pharma in skin diseases "
    },
    {
        "content": "July 1 Valeant Pharmaceuticals International Inc  :",
        "date": "07012016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Valeant Pharmaceuticals announces new licensing arrangement for Brodalumab in Europe "
    },
    {
        "content": "LONDON/CHICAGO - U.S. health officials have advised doctors not to use AstraZeneca's FluMist in the upcoming flu season based on three years of U.S. data showing that the nasal spray vaccine is not effective at preventing influenza.",
        "date": "06232016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "U.S. spurns AstraZeneca's nasal spray flu vaccine as ineffective "
    },
    {
        "content": "LONDON/CHICAGO  June 23 U.S. health officials have advised doctors not to use AstraZeneca's FluMist in the upcoming flu season based on three years of U.S. data showing that the nasal spray vaccine is not effective at preventing influenza.",
        "date": "06232016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 3-U.S. spurns AstraZeneca's nasal spray flu vaccine as ineffective "
    },
    {
        "content": "LONDON/CHICAGO  June 23 U.S. health officials have advised doctors not to use AstraZeneca's FluMist in the upcoming flu season based on three years of U.S. data showing that the nasal spray vaccine is not effective at preventing influenza.",
        "date": "06232016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2- U.S. spurns AstraZeneca's nasal spray flu vaccine as ineffective "
    },
    {
        "content": "LONDON  June 23 AstraZeneca said it would take an $80 million writedown on stocks of its flu vaccine Flumist Quadrivalent  which is sprayed into the nose  after U.S. health authorities decided they would not use the product.",
        "date": "06232016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca takes $80 mln hit as U.S. spurns nasal flu vaccine "
    },
    {
        "content": "* Confirmed that ACIP center of CDC has provided interim recommendation on use of flumist quadrivalent live attenuated influenza vaccine  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom)",
        "date": "06232016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca confirms CDC interim recommendation on flu vaccine "
    },
    {
        "content": "* Christer Betsholtz appointed new head of Karolinska Institutet and AstraZeneca's integrated cardio metabolic centre  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "06152016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca names a head for its integrated cardio metabolic centre "
    },
    {
        "content": "LONDON AstraZeneca  has sold the marketing rights to a portfolio of anesthetics for up to $770 million in the latest so-called externalization deal to raise funds for investment in new drugs.",
        "date": "06092016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca sells rights to anesthetics for up to $770 million "
    },
    {
        "content": "* Aspen shares jump 10 percent  AstraZeneca stock slips   (Adds context on externalisation drive  market reaction)",
        "date": "06092016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca sells rights to anaesthetics for up to $770 mln "
    },
    {
        "content": "* Continental and Harwood capital in process of evaluating and preparing for possible offer for Source Bioscience Plc  Source text for Eikon:",
        "date": "06032016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Continental Investment  Harwood Capital evaluating possible offer for Source Bioscience "
    },
    {
        "content": "LONDON  June 2 AstraZeneca has sold the European and Latin American rights to its new gout drug Zurampic to private German drugmaker Gruenenthal for up to $230 million  following a similar disposal of U.S. rights to the medicine.",
        "date": "06022016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca sells EU  Latam gout drug rights to Gruenenthal "
    },
    {
        "content": "* Grünenthal and astrazeneca enter into license agreement for lesinurad in europe and latin america",
        "date": "06022016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca licenses Zurampic to Grünenthal in Europe and Latin America "
    },
    {
        "content": "May 27 A panel that advises the European drugs regulator has supported an approval for AstraZeneca Plc's  diabetes drug combination.",
        "date": "05272016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "REFILE-EU regulator's advisory panel backs AstraZeneca diabetes drug "
    },
    {
        "content": "* Astrazeneca receives complete response letter from us fda for sodium zirconium cyclosilicate (zs-9) for oral suspension for treatment of hyperkalaemia",
        "date": "05272016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca receives complete response letter from U.S. FDA for sodium zirconium cyclosilicate "
    },
    {
        "content": "* Announced positive results from phase III falcon trial comparing faslodex 500mg (fulvestrant) to arimidex 1mg",
        "date": "05272016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca announces positive results in breast cancer trial "
    },
    {
        "content": "SHANGHAI/LONDON Chinese health authorities announced price cuts of up to two-thirds for three drugs on Friday in the latest move to reduce the cost of healthcare for patients in the world's second-biggest economy.",
        "date": "05202016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Drugmakers eye volume growth as China cuts prices by up to 67 percent "
    },
    {
        "content": "SHANGHAI/LONDON  May 20 Chinese health authorities announced price cuts of up to two-thirds for three expensive drugs on Friday in the latest move to reduce the cost of healthcare for patients in the world's second-biggest economy.",
        "date": "05202016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "China slashes GSK  AstraZeneca drug prices in cost-cutting drive "
    },
    {
        "content": "LONDON AstraZeneca Chief Executive Pascal Soriot is a big believer in science  and the biggest experiment of his career is the reinvention of the drugmaker.",
        "date": "05182016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Pascal Soriot's big experiment: reinventing AstraZeneca "
    },
    {
        "content": "LONDON AstraZeneca's  drive to rebuild its portfolio of new medicines received a boost with positive results for an experimental biotech drug for severe asthma that the company previously flagged as a potential $2 billion-a-year seller.",
        "date": "05172016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca asthma drug hits goal  to enter competitive market "
    },
    {
        "content": "LONDON  May 18 AstraZeneca Chief Executive Pascal Soriot is a big believer in science  and the biggest experiment of his career is the reinvention of the drugmaker.",
        "date": "05182016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "INSIGHT-Pascal Soriot's big experiment: reinventing AstraZeneca "
    },
    {
        "content": "* AstraZeneca facing a wave of patent expiries   (Adds analyst comment  detail on Japan option)",
        "date": "05172016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-AstraZeneca asthma drug hits goal  to enter competitive market "
    },
    {
        "content": "* Provides top-line results from Lynparza gold trial in advanced gastric cancer",
        "date": "05182016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca says Lynparza plus paclitaxel disappoints in tests "
    },
    {
        "content": "LONDON Drugs targeting DNA repair mechanisms inside cells are showing real promise for a range of tumors and AstraZeneca believes it is well ahead of rivals in the emerging cancer field.",
        "date": "05132016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Beyond immuno-oncology  AstraZeneca builds up 'DNA damage' drugs "
    },
    {
        "content": "LONDON  May 17 AstraZeneca's drive to rebuild its portfolio of new medicines received a boost on Tuesday with positive results for a biotech drug for severe asthma that the company has previously flagged as a potential $2 billion-a-year product.",
        "date": "05172016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca boosted by good results for biotech asthma drug "
    },
    {
        "content": "* Announces positive results from benralizumab phase III programme in severe asthma",
        "date": "05172016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca says benralizumab succeeds late-stage study "
    },
    {
        "content": "LONDON AstraZeneca is to cut costs by $1 billion and increase its focus on cancer treatments after underlying earnings  hit by drug patent expiries  fell 12 percent in the first quarter  broadly in line with analyst expectations.",
        "date": "04292016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca cuts costs and doubles down on cancer drugs "
    },
    {
        "content": "* AstraZeneca CEO says some jobs to go in cost cutting  minimal cuts in UK",
        "date": "04292016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca CEO sets high bar for M&A  no comment on Medivation "
    },
    {
        "content": "British drugmaker AstraZeneca Plc  said on Tuesday Ironwood Pharmaceuticals Inc  would buy the U.S. marketing rights for its newly approved gout drug for up to $265 million.",
        "date": "04262016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca sells U.S. gout drug rights to Ironwood for up to $265 million "
    },
    {
        "content": "April 26 British drugmaker AstraZeneca Plc  said on Tuesday Ironwood Pharmaceuticals Inc  would buy the U.S. marketing rights for its newly approved gout drug for up to $265 million.",
        "date": "04262016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca sells U.S. gout drug rights to Ironwood for up to $265 mln "
    },
    {
        "content": "* Ironwood Pharmaceuticals enters into U.S. licensing agreement with AstraZeneca for Lesinurad",
        "date": "04262016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Ironwood  AstraZeneca enter U.S. licensing agreement for lesinurad "
    },
    {
        "content": "April 26 British drugmaker AstraZeneca Plc  said Ironwood Pharmaceuticals Inc would buy the U.S. marketing rights for its newly-approved gout drug for up to $265 million.",
        "date": "04262016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "CORRECTED-AstraZeneca to sell US rights for gout drug for up to $265 mln "
    },
    {
        "content": "* Agreement includes U.S. rights to zurampic and lesinurad/allopurinol fixed-dose combination in gout",
        "date": "04262016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca  Ironwood agree U.S. licensing agreement "
    },
    {
        "content": "CAMBRIDGE  England  April 22 AstraZeneca   working with genome pioneer Craig Venter  is launching a massive gene hunt in the most comprehensive bet yet by a pharmaceutical firm on the potential of genetic variations to unlock routes to new medicines.",
        "date": "04212016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca taps gene pioneer Venter for huge drug-hunting sweep "
    },
    {
        "content": "* Human longevity Inc announces 10 year deal with Astrazeneca to sequence and analyze patient samples from Astrazeneca clinical trials",
        "date": "04212016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Human Longevity Inc. announces 10 year deal with Astrazeneca "
    },
    {
        "content": "* TapImmune announces phase 2 ovarian cancer trial study with Astrazeneca/Medimmune and Sloan Kettering Cancer Institute",
        "date": "04212016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-TapImmune announces phase 2 ovarian cancer trial study with Astrazeneca "
    },
    {
        "content": "April 17 Drugmaker AstraZeneca Plc has held internal talks about a bid for Medivation Inc but has yet to make a formal offer  the Sunday Times reported  citing sources.",
        "date": "04172016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca has held internal talks for Medivation bid -Sunday Times "
    },
    {
        "content": "* Eli Lilly and Company and AstraZeneca announce continuation of pivotal clinical trial for people with early Alzheimer's disease",
        "date": "04082016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Eli Lilly  AstraZeneca announce continuation of clinical trial for AMARANTH "
    },
    {
        "content": "LONDON  March 29 French drugmaker Sanofi  has poached one of AstraZeneca's top scientists to be its new research head in another high-profile departure for the British drugmaker.",
        "date": "03292016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Sanofi poaches AstraZeneca scientist as new research head "
    },
    {
        "content": "LONDON  March 29 French drugmaker Sanofi  has poached one of AstraZeneca's top scientists to be its new research head in another high-profile departure for the British drugmaker.",
        "date": "03292016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-Sanofi poaches AstraZeneca scientist as new research head "
    },
    {
        "content": "LONDON  March 23 AstraZeneca said on Wednesday its blood-thinning drug Brilinta failed to help stroke patients as hoped in a major clinical trial  dealing a blow to a product viewed as an important driver of future sales and profits.",
        "date": "03232016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca heart drug fails in key stroke trial "
    },
    {
        "content": "* Failure is setback for $3.5 billion drug sales target   (Adds analyst's cut to sales forecast  more on share price performance)",
        "date": "03232016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 3-AstraZeneca heart drug fails in key stroke trial "
    },
    {
        "content": "* Astrazeneca reports top-line results from Brilinta Socrates trial in stroke",
        "date": "03232016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca says Brilinta Socrates study misses main goal "
    },
    {
        "content": "LONDON  March 14 AstraZeneca is looking at ways to link pay for Chief Executive Pascal Soriot and other top managers more directly to the drugmaker's target of achieving revenue of $45 billion by 2023  a company spokesman said on Monday.",
        "date": "03142016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca weighs linking CEO pay more closely to sales target "
    },
    {
        "content": "* AstraZeneca's potential medicine for neuromyelitis optica receives FDA orphan drug designation",
        "date": "03092016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca says U.S. FDA grants orphan drug status for potential eye drug "
    },
    {
        "content": "LONDON  March 1 Novo Nordisk and AstraZeneca  two drugmakers whose financial outlooks disappointed investors last month  are both hoping for a boost in the coming weeks from results of two closely watched clinical trials.",
        "date": "03012016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Novo Nordisk and AstraZeneca seek tonic from key drug trials "
    },
    {
        "content": "LONDON AstraZeneca has sold rights to a non-core drug to a unit of Kyowa Hakko Kirin for an upfront payment of $70 million  a day after getting $500 million for two ageing heart medicines.",
        "date": "03012016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca sells drug for $70 million as divestment drive continues "
    },
    {
        "content": "LONDON  March 1 AstraZeneca has sold rights to a non-core drug to a unit of Kyowa Hakko Kirin  for an upfront payment of $70 million  a day after getting $500 million for two ageing heart medicines.",
        "date": "03012016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca sells drug for $70 mln as divestment drive continues "
    },
    {
        "content": "* \u007fAstraZeneca enters into agreement with Prostrakan for rights to moventig in Europe\u007f",
        "date": "03012016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca to sell rights for constipation drug in Europe "
    },
    {
        "content": "LONDON A closely watched AstraZeneca drug did not extend lives of patients with the rare cancer mesothelioma when given on its own  but the drugmaker said it still believed the medicine had a role to play in combination treatments.",
        "date": "02292016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Closely watched AstraZeneca cancer drug fails in mesothelioma "
    },
    {
        "content": "LONDON  Feb 29 AstraZeneca said on Monday it had sold the rights to two ageing heart drugs to China Medical System Holdings for $500 million  marking the latest step in an ongoing programme of divestments for non-core assets.",
        "date": "02292016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca sells two heart drugs to China Medical for $500 mln "
    },
    {
        "content": "* \u007fCMS will pay AstraZeneca $310 million for license to sell Plendil in china\u007f",
        "date": "02292016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca enters licensing deal with China Medical System "
    },
    {
        "content": "LONDON AstraZeneca's  bold move to buy 55 percent of privately held biotech firm Acerta Pharma for $4 billion in December has been vindicated  at least in part  by the award of special \"orphan\" status to the key experimental drug involved.",
        "date": "02252016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca's $4 billion Acerta deal endorsed by orphan drug status "
    },
    {
        "content": "LONDON  Feb 25 AstraZeneca's bold move to buy 55 percent of privately held biotech firm Acerta Pharma for $4 billion in December has been vindicated  at least in part  by the award of special \"orphan\" status to the key experimental drug involved.",
        "date": "02252016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca's $4 bln Acerta deal endorsed by orphan drug status "
    },
    {
        "content": "LONDON  Feb 25 AstraZeneca's bold move to buy 55 percent of privately held biotech firm Acerta Pharma for $4 billion in December has been vindicated  at least in part  by the award of special \"orphan\" status to the key drug involved.",
        "date": "02252016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca's $4 bln Acerta deal endorsed by orphan drug status "
    },
    {
        "content": "* \u007fBrilique (Ticagrelor) approved in EU for extended treatment of patients with history of heart attack\u007f",
        "date": "02192016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca's says Brilique approved in EU for heart attack patients\u007f "
    },
    {
        "content": "* European Commission granted marketing authorisation for lesinurad for adult gout patients\u007f   Source text for Eikon:  Further company coverage:",
        "date": "02192016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca says Zurampic approved in EU for gout patients "
    },
    {
        "content": "LONDON  Feb 4 After a three-year rebuild  Chief Executive Pascal Soriot reckons AstraZeneca's drug pipeline is now \"full\"  but he's still hungry for acquisitions that pay for themselves straight away.",
        "date": "02042016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca CEO open for deals that pay from day one "
    },
    {
        "content": "LONDON AstraZeneca  warned on Thursday that revenue and earnings would drop this year due to the arrival of cheap generic rivals to Crestor  its top-selling cholesterol drug  which will offset growth in sales of newer medicines.",
        "date": "02042016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca warns on profits in 2016 as Crestor patent loss weighs "
    },
    {
        "content": "* Q4 revenue $6.40 billion vs consensus $6.29 billion   (Adds details on management incentives  further reaction)",
        "date": "02042016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 3-AstraZeneca warns on profits in 2016 as Crestor patent loss weighs "
    },
    {
        "content": "** AstraZeneca down over 3 pct  top FTSE 100  loser after drugmaker warns of a low to mid single-digit pct decline in 2016 rev  core EPS",
        "date": "02042016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BUZZ-AstraZeneca: bottom of FTSE after tepid 2016 forecast "
    },
    {
        "content": "LONDON  Feb 4 AstraZeneca expects a low to mid single-digit percentage decline in earnings in 2016 as the arrival of cheap generic copies of cholesterol fighter Crestor offsets growth in sales of new medicines  the British-based drugmaker said on Thursday.",
        "date": "02042016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca sees fall in 2016 earnings as Crestor loss weighs "
    },
    {
        "content": "* \u007f\u007fAstraZeneca and Incyte announce new lung cancer clinical trial collaboration\u007f",
        "date": "01112016",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca \u007fand Incyte announce lung cancer clinical trial collaboration\u007f "
    },
    {
        "content": "* Co and Moderna Therapeutics announce new collaboration to co-develop and co-commercialise immuno-oncology mRNA Therapeutics\u007f\u007f",
        "date": "01112016",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca says ties up with Moderna to co-develop immuno-oncology mRNA "
    },
    {
        "content": "* \u007fProposal to appoint PriceWaterhouseCoopers LLP as its external auditor for financial year ending Dec. 31  2017\u007f  Source text for Eikon:  Further company coverage:",
        "date": "12232015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca proposes to appoint PWC as external auditor "
    },
    {
        "content": "* Recommends granting a conditional marketing authorisation for AstraZeneca's lung cancer drug Osimertinib",
        "date": "12182015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-EU Medicines Agency recommends approval of AstraZeneca's gout drug "
    },
    {
        "content": "LONDON Britain's AstraZeneca  has agreed to buy Takeda Pharmaceutical's  respiratory business  including expanded rights to roflumilast  a treatment for chronic obstructive pulmonary disease (COPD).",
        "date": "12162015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca boosts respiratory unit with $575 million Takeda deal "
    },
    {
        "content": "LONDON AstraZeneca is to buy 55 percent of privately held biotech firm Acerta Pharma for $4 billion to give it access to a new kind of blood cancer drug  boosting its long-term growth at the cost of a near-term hit to earnings. | Video ",
        "date": "12172015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca buys most of Acerta for $4 billion to add cancer drug "
    },
    {
        "content": "LONDON  Dec 16 Britain's AstraZeneca has agreed to buy Takeda Pharmaceutical's respiratory business  including expanded rights to roflumilast  a treatment for chronic obstructive pulmonary disease (COPD).",
        "date": "12162015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca boosts respiratory unit with $575 mln Takeda deal "
    },
    {
        "content": "* Believes acalabrutinib superior to rival AbbVie/J&J drug   (Adds further CEO comment  reaction  advisers on deal)",
        "date": "12172015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-AstraZeneca buys most of Acerta for $4 bln to add cancer drug "
    },
    {
        "content": "LONDON  Dec 16 Britain's AstraZeneca has agreed to buy Takeda Pharmaceutical's respiratory business  including expanded rights to roflumilast  a treatment for chronic obstructive pulmonary disease (COPD).",
        "date": "12162015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca boosts respiratory unit with $575 mln Takeda deal "
    },
    {
        "content": "* \u007fHas completed its agreement with Perrigo Company Plc for divestment of US rights to Entocort (budesonide)\u007f",
        "date": "12152015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca says completes deal with Perrigo for divestment of US rights to Entocort "
    },
    {
        "content": "Dec 17 AstraZeneca Plc tells reporters in conference call:",
        "date": "12172015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca sees Acerta drug superior to AbbVie/J&J's Imbruvica "
    },
    {
        "content": "LONDON  Dec 17 AstraZeneca said on Thursday it had agreed to buy a 55 percent stake in privately held biotech firm Acerta Pharma for $4.0 billion to give it access to a new kind of drug for fighting blood cancers.",
        "date": "12172015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca to buy 55 pct of cancer firm Acerta for $4.0 bln "
    },
    {
        "content": "* \u007fDeal will include expansion of rights to roflumilast  only approved oral pde4 inhibitor for treatment of copd",
        "date": "12162015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca to buy Takeda's respiratory business for $575 mln "
    },
    {
        "content": "LONDON  Dec 16 AstraZeneca aims to build up its already strong position in China by making and developing more medicines locally  and will invest more than $800 million in the country over the next 10 years  it said on Wednesday.",
        "date": "12162015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca investing $800 mln to go local in China "
    },
    {
        "content": "LONDON AstraZeneca said on Monday it was in talks that might lead to the acquisition of privately held biotech firm Acerta Pharma  a potential $5 billion-plus deal designed to build up its cancer drug portfolio.",
        "date": "12142015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca chases Acerta to secure next cancer drug winner "
    },
    {
        "content": "* \"No certainty\" that any deal will be agreed   (Adds comment on other potential bidders for Acerta)",
        "date": "12142015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-AstraZeneca chases Acerta to secure next cancer drug winner "
    },
    {
        "content": "LONDON  Dec 14 AstraZeneca said on Monday it was in talks with privately held cancer drug developer Acerta Pharma  after the Wall Street Journal reported on Friday it was looking to acquire the business for more than $5 billion.",
        "date": "12142015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca confirms talks with cancer drug firm Acerta "
    },
    {
        "content": "British drugmaker AstraZeneca Plc  is in advanced talks to buy privately held cancer drug developer Acerta Pharma BV for more than $5 billion  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "12112015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca in talks to buy cancer drugmaker Acerta for $5 billion: WSJ "
    },
    {
        "content": "Dec 11 British drugmaker AstraZeneca Plc  is in advanced talks to buy privately held cancer drug developer Acerta Pharma BV for more than $5 billion  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "12112015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca in talks to buy cancer drugmaker Acerta for $5 bln-WSJ "
    },
    {
        "content": "Dec 11 British drugmaker AstraZeneca Plc  is in advanced talks to buy privately held drug developer Acerta Pharma BV for more than $5 billion  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "12112015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca in talks to buy private drugmaker Acerta Pharma-WSJ "
    },
    {
        "content": "LONDON AstraZeneca is diving into the world of proteins secreted by cells - collectively known as the secretome - in the hunt for new drugs and better \"cell factories\" for making biotech medicines.",
        "date": "12112015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "After the genome  AstraZeneca taps 'secretome' for novel drugs "
    },
    {
        "content": "LONDON  Dec 11 AstraZeneca is diving into the world of proteins secreted by cells - collectively known as the secretome - in the hunt for new drugs and better \"cell factories\" for making biotech medicines.",
        "date": "12112015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "After the genome  AstraZeneca taps \"secretome\" for novel drugs "
    },
    {
        "content": "Nov 20 Sanofi and AstraZeneca  said on Friday that they will exchange 210 000 chemical compounds in a deal aimed at widening the diversity of the chemicals they can use to develop new drugs.",
        "date": "11202015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "CORRECTED-Sanofi and AstraZeneca to exchange 210 000 chemical compounds "
    },
    {
        "content": "AstraZeneca  said on Monday it had finalised plans to divest its Crohn’s disease drug Entocort by selling U.S. rights to the medicine to Perrigo  for $380 million.",
        "date": "11232015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca sells U.S. drug rights to Perrigo for $380 million "
    },
    {
        "content": "* Mega-merger may be exception amid bolt-ons  divestments   (Adds Breakingviews link)",
        "date": "11232015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-Pfizer-Allergan to take healthcare M&A deals to above $600 bln in 2015 "
    },
    {
        "content": "Nov 23 Pfizer Inc's looming deal to buy Botox maker Allergan Plc for more than $150 billion will cap a record-breaking run for mergers and acquisitions in the healthcare sector  taking the cumulative value of deals in 2015 to more than $600 billion.",
        "date": "11232015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Pfizer-Allergan to take healthcare M&A deals to above $600 bln in 2015 "
    },
    {
        "content": "Nov 23 AstraZeneca said on Monday it had finalised plans to divest its Crohn's disease drug Entocort by selling U.S. rights to the medicine to Perrigo for $380 million.",
        "date": "11232015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca sells U.S. drug rights to Perrigo for $380 mln "
    },
    {
        "content": "* Astrazeneca enters into agreement with Perrigo for rights to Entocort \u007f in us",
        "date": "11232015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca  Perrigo sign deal for US rights to Entocort "
    },
    {
        "content": "Clovis Oncology Inc's shares plunged nearly 75 percent on Monday after U.S. heath regulators asked for more data on the company's lung cancer drug  potentially delaying its approval and giving a head start to AstraZeneca's rival treatment that was approved on Friday.",
        "date": "11162015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Clovis shares dive as FDA asks for more data on lung cancer drug "
    },
    {
        "content": "LONDON  Nov 17 AstraZeneca's new lung cancer pill Tagrisso  which won early U.S. approval on Friday  will cost $12 750 for a month's supply.",
        "date": "11172015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca's Tagrisso to cost $12 750 for a month's supply "
    },
    {
        "content": "* Shares plunge as much as 73.8 pct  wipes off $2.8 bln   (Adds analysts comments  background; updates shares)",
        "date": "11162015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-Clovis shares dive as FDA asks for more data on lung cancer drug "
    },
    {
        "content": "LONDON Nov 16 Britain's top share index ended higher on Monday  helped by a rally in AstraZeneca after a delay in the approval for a rival drug and strong gains by builder Taylor Wimpey on a brighter earnings outlook.",
        "date": "11162015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UK's FTSE closes higher  helped by AstraZeneca  Taylor Wimpey "
    },
    {
        "content": "LONDON  Nov 17 AstraZeneca's new lung cancer pill Tagrisso  which won early U.S. approval on Friday  will cost $12 750 for a month's supply.",
        "date": "11172015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca's Tagrisso to cost $12 750 for a month's supply "
    },
    {
        "content": "LONDON Nov 16 Britain's top share index climbed higher on Monday  helped by a rally in AstraZeneca after a delay in the approval for a rival drug and strong gains by builder Taylor Wimpey on a brighter earnings outlook.",
        "date": "11162015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UK's FTSE rises  led by AstraZeneca  Taylor Wimpey; tourism stocks slump "
    },
    {
        "content": "LONDON A new lung cancer pill from AstraZeneca   designed for patients whose disease has worsened after treatment with other therapies  won early U.S. approval on Friday  in a boost for the British drugmaker.",
        "date": "11132015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca's potential $3 billion cancer pill wins early approval "
    },
    {
        "content": "* Rival medicine from Clovis also waiting approval   (Adds more on timing of decision  analyst comment)",
        "date": "11132015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-AstraZeneca's potential $3 bln cancer pill wins early approval "
    },
    {
        "content": "LONDON  Nov 13 A new lung cancer pill from AstraZeneca  designed for patients whose disease has worsened after treatment with other therapies  was approved by U.S. regulators on Friday  in a boost for the British drugmaker.",
        "date": "11132015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca wins FDA approval for key new lung cancer pill "
    },
    {
        "content": "Nov 6 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "11062015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "WASHINGTON  Nov 6 Pfizer Chief Executive Ian Read  who has been lobbying Congress regularly for a corporate tax cut  is trying for the second time in as many years to do a deal with a foreign company that could produce the savings he has been unable to extract from Washington.",
        "date": "11062015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "RPT-After big spending and hard lobbying  Pfizer eyes new tax home "
    },
    {
        "content": "* Says plans late-stage pipeline conference call 2 december 2015  Source text for Eikon:  Further company coverage:",
        "date": "11052015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca says plans late-stage pipeline conference call 2 december 2015 "
    },
    {
        "content": "LONDON Britain's AstraZeneca  said on Friday it had agreed to buy U.S biotech company ZS Pharma  for $2.7 billion  pipping Swiss firm Actelion  to the prize in the latest bout of deal-making for the hyperactive healthcare sector.",
        "date": "11062015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca buys ZS Pharma for $2.7 billion  pips Actelion "
    },
    {
        "content": "LONDON  Nov 5 Drugmaker AstraZeneca  lifted its full-year forecast for revenue and earnings on Thursday  after reporting third-quarter results broadly in line with analyst expectations.",
        "date": "11052015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca lifts full-year forecast after in-line Q3 "
    },
    {
        "content": "LONDON  Nov 6 Britain's AstraZeneca said on Friday it had agreed to buy U.S biotech company ZS Pharma  for $2.7 billion  pipping Swiss firm Actelion  to the prize in the latest bout of deal-making for the hyperactive healthcare sector.",
        "date": "11062015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca buys ZS Pharma for $2.7 billion  pips Actelion "
    },
    {
        "content": "Nov 4 Drugmakers AstraZeneca Plc   and Cephalon  a unit of Teva Pharmaceutical Industries Ltd    reached a multistate accord on Wednesday over civil charges they overbilled state Medicaid programs  the New York Attorney General announced.",
        "date": "11042015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca  Teva reach deal with states in Medicaid pricing case "
    },
    {
        "content": "LONDON  Nov 6 Britain's AstraZeneca Plc  said on Friday it had agreed to buy ZS Pharma  paying a total $2.7 billion for its proprietary technology to develop novel treatments for hyperkalaemia  or high potassium levels.",
        "date": "11062015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca agrees to buy ZS Pharma for $2.7 billion "
    },
    {
        "content": "WASHINGTON  Nov 6 Pfizer Chief Executive Ian Read  who has been lobbying Congress regularly for a corporate tax cut  is trying for the second time in as many years to do a deal with a foreign company that could produce the savings he has been unable to extract from Washington.",
        "date": "11062015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "After big spending and hard lobbying  Pfizer eyes new tax home "
    },
    {
        "content": "Nov 4 Drugmakers AstraZeneca Plc   and Cephalon  a unit of Teva Pharmaceutical Industries Ltd    reached a multistate accord on Wednesday over civil charges they overbilled state Medicaid programs  the New York Attorney General announced.",
        "date": "11042015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca  Teva reach deal with states in Medicaid pricing case "
    },
    {
        "content": "Oct 29 Pfizer Inc  the No. 1 U.S. drugmaker  and Botox maker Allergan Plc said they were in friendly talks to create a pharmaceutical colossus but the prospect that the company would seek to avoid U.S. taxes sounded political alarm bells.",
        "date": "10292015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 5-Pfizer  Allergan drug merger talks raise tax hackles in U.S. "
    },
    {
        "content": " ",
        "date": "10292015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 3-Pfizer  Allergan in talks to forge world's biggest drugmaker "
    },
    {
        "content": "Allergan Plc's shares soared as much as 16 percent in premarket trading on Thursday  a day after media reports that  Pfizer Inc had held early talks with the Botox-maker about a deal that would create the world's biggest drugmaker.",
        "date": "10292015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Pfizer needs a big deal  analysts say; Allergan 'makes sense' "
    },
    {
        "content": "Oct 29 Allergan Plc's shares soared as much as 16 percent in premarket trading on Thursday  a day after media reports that  Pfizer Inc had held early talks with the Botox-maker about a deal that would create the world's biggest drugmaker.",
        "date": "10292015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Pfizer needs a big deal  analysts say; Allergan \"makes sense\" "
    },
    {
        "content": "Oct 21 U.S. Food and Drug Administration staff reviewers have raised concerns about kidney- and heart-related side effects noted in trials on AstraZeneca Plc's   gout treatment  especially at higher doses.",
        "date": "10212015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "UPDATE 2-FDA reviewers question safety of AstraZeneca's gout drug "
    },
    {
        "content": "Oct 21 U.S. Food and Drug Administration staff reviewers have raised questions about the safety of AstraZeneca Plc's  gout treatment  lesinurad.",
        "date": "10212015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "FDA staff reviewers question safety of AstraZeneca's gout drug "
    },
    {
        "content": "Oct 23 An independent panel of advisers to the U.S. Food and Drug Administration on Friday voted in favor of approving AstraZeneca Plc's gout drug  lesinurad.",
        "date": "10232015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "FDA panel votes in favor of approving AstraZeneca's gout drug "
    },
    {
        "content": "LONDON AstraZeneca opened a new $224 million drug manufacturing and packaging factory in Russia on Tuesday in a move Chief Executive Pascal Soriot said reinforced its long-term commitment to the country.",
        "date": "10202015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca opens new $224 million drug factory in Russia "
    },
    {
        "content": "Oct 23 An independent panel of advisers to the U.S. Food and Drug Administration on Friday voted 10-4 in favor of approving AstraZeneca Plc's gout drug.",
        "date": "10232015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-FDA panel votes in favor of approving AstraZeneca's gout drug "
    },
    {
        "content": "LONDON  Oct 20 AstraZeneca opened a new $224 million drug manufacturing and packaging factory in Russia on Tuesday in a move Chief Executive Pascal Soriot said reinforced its long-term commitment to the country.",
        "date": "10202015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca opens new $224 mln drug factory in Russia "
    },
    {
        "content": "LONDON U.S. health regulators declined to approve a fixed-dose diabetes drug combination from AstraZeneca  delaying its launch and dealing a blow to an important plank of the drugmaker's business.",
        "date": "10162015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca diabetes drug combination faces delay after FDA rebuff "
    },
    {
        "content": "* AstraZeneca predicted $3 bln sales for combination   (Adds analyst comments on likely length of delay)",
        "date": "10162015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-AstraZeneca diabetes drug combination faces delay after FDA rebuff "
    },
    {
        "content": "** AstraZeneca down c.2 pct and top loser on a positive Stoxx 600 healthcare index after U.S. health regulators declines to approve pharma co's fixed-dose combination of the diabetes drugs saxagliptin and dapagliflozin",
        "date": "10162015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BUZZ-AstraZeneca: hit as diabetes drug combo denied approval "
    },
    {
        "content": "* Astrazeneca receives complete response letter from US FDA for saxagliptin / dapagliflozin",
        "date": "10162015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca gets FDA complete response letter on diabetes drug combination "
    },
    {
        "content": "LONDON  Oct 9 AstraZeneca has temporarily halted two clinical trials combining experimental drugs to treat lung cancer  following reports of lung disease in some patients  the company said on Friday.",
        "date": "10092015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca pauses two lung cancer drug combination trials "
    },
    {
        "content": "ZURICH  Sept 27 Roche 's new immune-system boosting cancer drug has given positive results in tests on patients suffering from some lung and bladder cancers  according to data released on Sunday at the European Cancer Congress in Vienna that the company hopes will help it win quick regulatory approval.",
        "date": "09272015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Roche says new drug shows benefits in lung  bladder cancer tests "
    },
    {
        "content": "LONDON  Sept 22 Drugmaker AstraZeneca is harnessing the wisdom of crowds to help mix tomorrow's cancer drug cocktails.",
        "date": "09222015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca taps crowd sourcing to find cancer drug cocktails "
    },
    {
        "content": "The U.S. Department of Health and Human Services (HHS) said on Wednesday it signed a deal with British drugmaker AstraZeneca Plc to develop antibiotics.",
        "date": "09162015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Department of Health and Human Services  AstraZeneca to develop antibiotics "
    },
    {
        "content": "Sept 16 The U.S. Department of Health and Human Services (HHS) said on Wednesday it signed a deal with British drugmaker AstraZenaca Plc to develop antibiotics.",
        "date": "09162015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Dept of Health and Human Services  AstraZeneca to develop antibiotics "
    },
    {
        "content": "* Shares touch a year low   (Adds analyst comment  updates share)",
        "date": "09152015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-XenoPort's psoriasis drug shows higher side effects; shares fall "
    },
    {
        "content": "* Purchases us biologics manufacturing facility to support growing pipeline",
        "date": "09112015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca buys manufacturing facility in U.S. from Amgen "
    },
    {
        "content": "* Astrazeneca to invest 11.5 million stg in new clinical oncology bioinformatics collaboration with the University of Manchester  Further company coverage:    (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "09082015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca says to invest in oncology bioinformatics collaboration "
    },
    {
        "content": "U.S. regulators have approved a new dose of AstraZeneca's blood thinner Brilinta for longer-term use in patients with a history of heart attacks  boosting prospects for a drug the company thinks will eventually sell $3.5 billion a year.",
        "date": "09042015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca wins U.S. approval for longer use of blood thinner "
    },
    {
        "content": "* AstraZeneca targeting Brilinta sales of $3.5 bln by 2023   (Adds executive and analyst comments on Brilinta growth)",
        "date": "09042015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-AstraZeneca wins U.S. approval for longer use of blood thinner "
    },
    {
        "content": "* AstraZeneca enters license agreement with Daiichi Sankyo for development and commercialisation of Flumist in Japan",
        "date": "09022015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca enters license agreement with Daiichi Sankyo "
    },
    {
        "content": "AstraZeneca Plc on Thursday said the U.S. Food and Drug Administration approved a new dose of its blood thinner Brilinta intended for longer-term use in patients with a history of heart attack or a condition known as acute coronary syndrome.",
        "date": "09032015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "FDA approves longer-term use of AstraZeneca blood thinner "
    },
    {
        "content": "Sept 3 AstraZeneca Plc on Thursday said the U.S. Food and Drug Administration approved a new dose of its blood thinner Brilinta intended for longer-term use in patients with a history of heart attack or a condition known as acute coronary syndrome.",
        "date": "09032015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-FDA approves longer-term use of AstraZeneca blood thinner "
    },
    {
        "content": "Canada's Valeant Pharmaceuticals International Inc   is buying rights to AstraZeneca Plc's  late-stage experimental psoriasis drug brodalumab after it was dropped by Amgen Inc  in May.",
        "date": "09012015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Valeant picks up AstraZeneca psoriasis drug after Amgen exit "
    },
    {
        "content": "Sept 3 AstraZeneca Plc said the U.S. Food and Drug Administration had approved a new dose of its blood thinner  Brilinta  for patients with a history of heart attack beyond the first year.",
        "date": "09032015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "FDA approves expanded indication for AstraZeneca's blood thinner "
    },
    {
        "content": "Sept 1 Canada's Valeant Pharmaceuticals International Inc  is buying rights to AstraZeneca Plc's late-stage experimental psoriasis drug brodalumab after it was dropped by Amgen Inc in May.",
        "date": "09012015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-Valeant picks up AstraZeneca psoriasis drug after Amgen exit "
    },
    {
        "content": "Sept 1 Canada's Valeant Pharmaceuticals International Inc  said it has been granted an exclusive license by AstraZeneca Plc to develop and commercialize its late-stage experimental psoriasis drug brodalumab.",
        "date": "09012015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Valeant gets right to develop AstraZeneca's psoriasis drug "
    },
    {
        "content": "LONDON  Aug 24 British pharmaceutical company AstraZeneca named Sean Bohen as its chief medical officer  in an appointment that it said could help accelerate the development of new oncology and immunology medicines.",
        "date": "08242015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca names Genentech's Bohen as chief medical officer "
    },
    {
        "content": "* Astrazeneca and Peregrine Pharmaceuticals to collaborate on immuno-oncology combination clinical trial",
        "date": "08242015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca and Peregrine Pharma to collaborate on immuno-oncology combination clinical trial "
    },
    {
        "content": "* Appoints Dr Sean Bohen as executive vice president of global medicines development and chief medical officer  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "08242015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca appoints Sean Bohen as chief medical officer "
    },
    {
        "content": "LONDON  Aug 10 AstraZeneca has clinched its third deal in less than a week to bolster its strategically important cancer drug pipeline by signing up rights to an experimental immune system-boosting medicine from Inovio Pharmaceuticals.",
        "date": "08102015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca bags another cancer drug deal  this time with Inovio "
    },
    {
        "content": "* Medimmune enters into strategic cancer vaccine collaboration and license agreement with inovio pharmaceuticals",
        "date": "08102015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca in cancer vaccine collaboration with Medimmune "
    },
    {
        "content": "LONDON AstraZeneca expanded its push into cancer immunotherapy on Thursday by striking a deal potentially worth more than $500 million with Sosei's biotech unit Heptares  giving it rights to an experimental treatment.",
        "date": "08062015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca widens cancer push with up to $500 million Heptares deal "
    },
    {
        "content": "LONDON  Aug 6 AstraZeneca expanded its push into cancer immunotherapy on Thursday by striking a deal potentially worth more than $500 million with Sosei's  biotech unit Heptares  giving it rights to an experimental treatment.",
        "date": "08062015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca widens cancer push with up to $500 mln Heptares deal "
    },
    {
        "content": "* And Heptares Therapeutics enter agreement to develop novel immuno-oncology treatments",
        "date": "08062015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca signs immuno-oncology deal with Sosei unit Heptares "
    },
    {
        "content": "* AstraZeneca and Isis Pharmaceuticals to discover and develop antisense drugs for cardiovascular  metabolic and renal diseases",
        "date": "08032015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca  Isis Pharmaceuticals announce strategic collaboration "
    },
    {
        "content": "* Medimmune and Mirati Therapeutics partner on immuno-oncology combination in lung cancer 5 August 2015",
        "date": "08052015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca's Medimmune partners Mirati for immuno-oncology combination in lung cancer "
    },
    {
        "content": "LONDON  July 30 AstraZeneca revenue fell by a smaller-than-expected 7 percent in the second quarter  as income from spinning off assets offset generic competition to older medicines and a strong dollar.",
        "date": "07302015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca beats profit forecasts  helped by external deals "
    },
    {
        "content": "July 30 AstraZeneca CEO Pascal Soriot told reporters:  * CEO says absolutely on track to meet mid and long-term targets  * CEO says externalisation deal-making will continue in H2  * CFO says externalisation deal-making revenues will be lower in H2 * For more news  please click here",
        "date": "07302015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca CEO says absolutely on track to meet mid and long-term targets "
    },
    {
        "content": "* Q2 externalisation income $471 million   (Adds details on drugs  latest shares)",
        "date": "07302015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-AstraZeneca beats profit forecasts  helped by external deals "
    },
    {
        "content": "LONDON  July 24 AstraZeneca is dipping its toe in the biosimilars market  as a way to make future cancer drug cocktails more affordable  by linking with a Japanese group to develop a copy of Roche's blockbuster medicine Avastin.",
        "date": "07242015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca chases biosimilar Avastin drug with Japanese group "
    },
    {
        "content": "LONDON AstraZeneca   under pressure from falling sales of older drugs  is selling a medicine for a rare type of cancer to Sanofi  as it continues a drive to raise cash by divesting certain assets.",
        "date": "07272015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca sells rare cancer drug to Sanofi for up to $300 million "
    },
    {
        "content": "LONDON  July 27 AstraZeneca  under pressure from falling sales of older drugs  is selling a medicine for a rare type of cancer to Sanofi as it continues a drive to raise cash by divesting certain assets.",
        "date": "07272015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca sells rare cancer drug to Sanofi for up to $300 mln "
    },
    {
        "content": "LONDON  July 27 European equities were seen starting the week on a downbeat note  with futures trading lower after lingering fears over China's economic growth prospects and a sharp commodities sell-off rippling through global markets.",
        "date": "07272015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "European Factors-Futures lower as China woes spread "
    },
    {
        "content": "LONDON  July 27 AstraZeneca  under pressure from falling sales of older drugs  is selling a medicine for a rare type of cancer to Sanofi as it continues a drive to raise cash by divesting certain assets.",
        "date": "07272015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca sells rare cancer drug to Sanofi for up $300 mln "
    },
    {
        "content": "* Sanofi and its subsidiary Henzyme said in a statement they have entered into a definitive agreement with AstraZeneca to acquire Caprelsa\u007f (vandetanib)   Further company coverage:",
        "date": "07272015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Sanofi to acquire Caprelsa from Astrazeneca "
    },
    {
        "content": "LONDON AstraZeneca's much anticipated cancer drug pipeline suffered a modest blow on Wednesday when the experimental drug selumetinib failed to meet its goal in a late-stage trial for a rare cancer of the eye.",
        "date": "07222015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca suffers setback as drug fails in eye cancer "
    },
    {
        "content": "* Entered into a definitive agreement with genzyme to divest Caprelsa (vandetanib)  a rare disease medicine.",
        "date": "07272015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca to sell cancer medicine Caprelsa to Genzyme "
    },
    {
        "content": "* 2020 consensus sales forecast for selumetinib $305 mln   (Adds sales forecast  analyst comment  disease details)",
        "date": "07222015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca suffers setback as drug fails in eye cancer "
    },
    {
        "content": "* Astrazeneca provides update on Selumetinib in uveal melanoma",
        "date": "07222015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca's phase III study on metastatic uveal melanoma treatment fails to meet primary endpoint "
    },
    {
        "content": "ATHENS  July 14 Greece has decided to ban the export of 25 types of drugs  the Health Ministry said on Tuesday  following warnings of possible shortages that risked leading to a humanitarian crisis.",
        "date": "07142015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "UPDATE 3-Greece bans export of 25 drugs after pharmacists' supply warnings "
    },
    {
        "content": "The U.S. Food and Drug Administration approved AstraZeneca Plc's drug  Iressa  as a first-line treatment for a common form of lung cancer.",
        "date": "07132015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca lung cancer drug approved as first-line treatment "
    },
    {
        "content": "* U.S. food and drug administration has approved iressa (gefitinib) tablets  250mg once daily  for first-line treatment of patients with metastatic non-small cell lung cancer",
        "date": "07142015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca says U.S. FDA approves lung cancer drug "
    },
    {
        "content": "July 13 The U.S. Food and Drug Administration approved AstraZeneca Plc's drug  Iressa  as a first-line treatment for a common form of lung cancer.",
        "date": "07132015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca lung cancer drug approved as first-line treatment "
    },
    {
        "content": "July 13 The U.S. Food and Drug Administration has approved AstraZeneca Plc's drug  Iressa  as a first-line treatment for a common form of lung cancer.",
        "date": "07132015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "FDA approves AstraZeneca's lung cancer drug as first-line treatment "
    },
    {
        "content": "LONDON AstraZeneca struck a further \"externalization\" deal on Thursday to help fill its short-term revenue gap by divesting its gastrointestinal drug Entocort for $215 million.",
        "date": "07092015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca divests gastrointestinal drug for $215 million "
    },
    {
        "content": "LONDON  July 9 AstraZeneca struck a further \"externalisation\" deal on Thursday to help fill its short-term revenue gap by divesting its gastrointestinal drug Entocort for $215 million.",
        "date": "07092015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca divests gastrointestinal drug for $215 mln "
    },
    {
        "content": "* Entered into an agreement with Tillotts Pharma AG  part of Zeria Group  for divestment of global rights  outside US  to Entocort",
        "date": "07092015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca sells non-US global rights for gastroenterology drug to Tillotts Pharma "
    },
    {
        "content": "* Announces that the co-development and commercialization agreement with AstraZeneca on Innate Pharma's proprietary anti-NKG2A antibody  IPH2201  received HSR clearance",
        "date": "07072015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Clearance of Innate Pharma co-development with Astrazeneca "
    },
    {
        "content": "LONDON AstraZeneca has lost a second senior executive in a fortnight with the departure of its respiratory and inflammatory medicines head James Ward-Lilley to become chief executive of lung drug specialist Vectura.",
        "date": "06242015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca loses second top executive as Vectura gets new CEO "
    },
    {
        "content": "LONDON  June 24 AstraZeneca has lost a second senior executive in a fortnight with the departure of its respiratory and inflammatory medicines head James Ward-Lilley to become chief executive of lung drug specialist Vectura.",
        "date": "06242015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca loses second top executive as Vectura gets new CEO "
    },
    {
        "content": "June 24 Respiratory drugs specialist Vectura Group Plc appointed AstraZeneca executive James Ward-Lilley as chief executive officer effective Oct. 1.",
        "date": "06242015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Vectura Group appoints AstraZeneca executive as CEO "
    },
    {
        "content": "* Corline Pharma has been connected to AstraZeneca BioVentureHub in Mölndal",
        "date": "06182015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Corline Biomedical says Corline Pharma connected to AstraZeneca BioVentureHub "
    },
    {
        "content": "* Appoints Pam Cheng as Executive Vice President  Operations and IT",
        "date": "06162015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca names Pam Cheng as Executive VP  Operations and IT "
    },
    {
        "content": "LONDON  June 15 AstraZeneca's outgoing chief medical officer and head of global late-stage drug development Briggs Morrison  whose departure from the British drugmaker was announced last week  is to head U.S. cancer firm Syndax Pharmaceuticals.",
        "date": "06152015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca R&D executive Morrison to lead cancer firm Syndax "
    },
    {
        "content": "LONDON  June 10 AstraZeneca's chief medical officer and head of global late-stage drug development Briggs Morrison is to leave the company  creating a gap at the top of the group's research operations.",
        "date": "06102015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca R&D boss Morrison leaves to head private drugmaker "
    },
    {
        "content": "LONDON  June 10 AstraZeneca's chief medical officer and head of global late-stage drug development Briggs Morrison is to leave the company  creating a gap at the top of the group's research operations.",
        "date": "06102015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca research head Morrison leaves to head biotech firm "
    },
    {
        "content": "WASHINGTON  June 9 Two California-based stock brokers have been criminally charged with using material non-public information to trade in Ardea Biosciences Inc  a biotechnology firm later acquired by AstraZeneca  the U.S. Securities and Exchange Commission said on Tuesday.",
        "date": "06092015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "U.S. SEC says two stock brokers face criminal insider-trading charges "
    },
    {
        "content": "* Says signed agreements with AstraZeneca to advance its business growth in Cambodia and Thailand through strategic outsourcing",
        "date": "06112015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-DKSH and AstraZeneca expand relationship in South East Asia "
    },
    {
        "content": "June 2 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "06022015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "AstraZeneca Plc   would consider acquiring a developer of a new type of cancer therapy aimed at supercharging the body's immune response  Bloomberg quoted Chief Executive Pascal Soriot as saying on Tuesday.",
        "date": "06022015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca would consider buying immune-therapy company: Bloomberg "
    },
    {
        "content": "LONDON  June 1 European shares held steady at the start of the month on Monday  with a rally in some drug stocks on the back of positive company updates offset by lingering concerns over Greece's debt situation and weaker commodity stocks.",
        "date": "06012015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "CORRECTED-European shares steady  weaker commodity stocks offset pharma rally "
    },
    {
        "content": "June 2 AstraZeneca Plc  would consider acquiring a developer of a new type of cancer therapy aimed at supercharging the body's immune response  Bloomberg quoted Chief Executive Pascal Soriot as saying on Tuesday.",
        "date": "06022015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "CORRECTED-UPDATE 2-AstraZeneca would consider buying immune-therapy company - Bbg "
    },
    {
        "content": "* FTSE 100 down 0.1 pct     * UK  China PMIs see early gains evaporate     * AstraZeneca boosted by positive product update     * Lloyds edges up as UK to launch Lloyds retail share sale   (Recasts  adds detail  quotes)     By Alistair Smout     LONDON  June 1 Britain's top equity index stalled after disappointing domestic and international economic data pointed to a weak manufacturing outlook.     Britain's FTSE 100 turned negative following a positive open  after the closely watche",
        "date": "06012015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Britain's FTSE edges lower  hinder by manufacturing surveys "
    },
    {
        "content": "* FTSE 100 climbs back over 7 000 points     * AstraZeneca boosted by positive product update     * Lloyds edges up as UK to launch Lloyds retail share sale     * Index up around 7 pct since start of 2015      By Sudip Kar-Gupta     LONDON  June 1 Britain's top equity index moved higher on Monday  lifted by gains in AstraZeneca after the pharmaceutical group published a positive update on one of its anti-cancer drugs.     The blue-chip FTSE 100 index was up by 0.6 percent at 7 027.95",
        "date": "06012015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Britain's FTSE gains ground  lifted by AstraZeneca "
    },
    {
        "content": "* Economic slowdown may be more than temporary-Fed's Brainard",
        "date": "06022015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "US STOCKS-Wall St pares losses as data  Fed comments allay rate hike fears "
    },
    {
        "content": "LONDON  June 1 European shares kicked off June on a positive note on Monday  helped by a rise in pharma stocks  although main indexes were still stuck in their recent range as uncertainty persisted over Greece's future.",
        "date": "06012015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Roche  AstraZeneca help European shares start June on high note "
    },
    {
        "content": "June 2 AstraZeneca Plc  would consider buying a company such as Juno Therapeutics Inc   Bloomberg reported  AstraZeneca's CEO as saying  according to StreetInsider.",
        "date": "06022015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca may consider buying company such as Juno - Bloomberg "
    },
    {
        "content": "LONDON  May 26 AstraZeneca's hopes of topping $45 billion in revenue by 2023 have been dealt a blow by a problem with an experimental psoriasis drug that the drugmaker had viewed as a potential billion-dollar plus seller.",
        "date": "05262015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca hit after psoriasis drug linked to suicide fears "
    },
    {
        "content": "NEW YORK  May 29 Bristol-Myers Squibb  has sued a top cancer immunotherapy executive for violating confidentiality and non-compete agreements after he left for direct competitor AstraZeneca  court documents show.",
        "date": "05292015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Bristol-Myers sues immunotherapy exec who left for AstraZeneca "
    },
    {
        "content": "Amgen Inc said it will terminate a collaboration with AstraZeneca Plc to develop a psoriasis drug after it observed suicidal thoughts in the subjects of a trial.",
        "date": "05222015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Amgen ends partnership with AstraZeneca on psoriasis drug "
    },
    {
        "content": "LONDON  May 29 AstraZeneca and Eli Lilly  are to combine two of their cancer drugs in a new clinical trial against solid tumours in the latest sign that such cocktails may be the way forward in fighting the disease.",
        "date": "05292015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca and Lilly to test new cancer drug combination "
    },
    {
        "content": "May 22 Amgen Inc said it will terminate a collaboration with AstraZeneca Plc  to develop a psoriasis drug after it observed suicidal thoughts in the subjects of a trial.",
        "date": "05222015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-Amgen ends partnership with AstraZeneca on psoriasis drug "
    },
    {
        "content": "* Astrazeneca and lilly to collaborate on immuno-oncology combination clinical trial in solid tumours",
        "date": "05292015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca to collaborate with Lilly on solid tumours clinical trial "
    },
    {
        "content": "May 22 Amgen Inc said it will terminate a collaboration with AstraZeneca Plc  to develop an inflammation drug after it observed suicidal thoughts in subjects of a trial.",
        "date": "05222015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Amgen ends collaboration with AstraZeneca on inflammation drug "
    },
    {
        "content": "LONDON  May 18 AstraZeneca is investing $285 million to expand biotech drug manufacturing in Sweden as the company bets on the future of high-tech medicine for future growth.",
        "date": "05182015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca to invest $285 mln in Swedish biotech drug factory "
    },
    {
        "content": "* To invest in new biologics manufacturing facility in Södertälje  Sweden  to support accelerating biologics portfolio",
        "date": "05182015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "CORRECTED-BRIEF-Astrazeneca to invest $285 mln in biologics facility in Sweden "
    },
    {
        "content": "LONDON  May 18 AstraZeneca is investing $285 million to expand biotech drug manufacturing in Sweden as the company bets on the future of high-tech medicine for future growth.",
        "date": "05182015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca to invest $285 mln in Swedish biotech factory "
    },
    {
        "content": "The U.S. Food and Drug Administration on Friday warned that a widely used newer class of type 2 diabetes drugs sold by AstraZeneca  Johnson & Johnson and Eli Lilly in partnership with Boehringer Ingleheim may cause dangerously high levels of blood acids that could require hospitalization.",
        "date": "05152015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "FDA warns on newer class of type 2 diabetes drugs "
    },
    {
        "content": "* Astrazeneca to invest in new biologics manufacturing facility in Södertälje  Sweden  to support accelerating biologics portfolio",
        "date": "05182015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca to invest in biologics manufacturing facility in Sweden "
    },
    {
        "content": "May 13 A closely watched immune system-boosting drug cocktail from Britain's AstraZeneca shows promise in advanced lung cancer  despite adverse side effects in a number of patients.",
        "date": "05132015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca drug combination on track to fight lung cancer "
    },
    {
        "content": "May 15 The U.S. Food and Drug Administration on Friday warned that a widely used newer class of type 2 diabetes drugs sold by AstraZeneca  Johnson & Johnson and Eli Lilly in partnership with Boehringer Ingleheim may cause dangerously high levels of blood acids that could require hospitalization.",
        "date": "05152015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-U.S. FDA warns on newer class of type 2 diabetes drugs "
    },
    {
        "content": "LONDON  May 13 AstraZeneca is diving deeper into personalised healthcare with two projects that move the concept beyond cancer into respiratory disorders and heart disease.",
        "date": "05122015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca digs into precision medicine with lung  heart deals "
    },
    {
        "content": "* Signed a two-year extension of service agreement with global biopharmaceutical company AstraZeneca in Sweden",
        "date": "05072015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Caverion and AstraZeneca extend service agreement in Sweden "
    },
    {
        "content": "* Alexion offers $225.92 per Synageva share in cash and stock",
        "date": "05062015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "UPDATE 4-Alexion to bolster rare disease offering with $8.4 bln deal "
    },
    {
        "content": "LONDON  April 29 U.S. regulators are to fast-track the review of a new use of AstraZeneca's  heart drug Brilinta  meaning it could get the green light in the third quarter to be given to patients with a history of heart attacks.",
        "date": "04292015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca heart drug in regulatory fast lane for wider use "
    },
    {
        "content": "LONDON  April 28 Britain's top share index pulled away from all-time highs on Tuesday  weighed down by a drop in drugs firm AstraZeneca and Asia-focused bank Standard Charted.",
        "date": "04282015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "REFILE-AstraZeneca's slide drags Britain's FTSE away from all-time high "
    },
    {
        "content": "LONDON  April 28 Britain's top share index pulled away from all-time highs on Tuesday  weighed down by a drop in pharmaceutical stocks  although the market was supported by forecast-beating results from oil giant BP.",
        "date": "04282015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca's slide helps push Britain's FTSE away from all-time high "
    },
    {
        "content": "PARIS Shares in Innate Pharma surged to a record high on Friday as investors cheered a deal with AstraZeneca to accelerate and broaden development of its immune-boosting anti-cancer medicines that could earn the French firm $1.275 billion.",
        "date": "04242015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Astrazeneca drug deal hoists Innate Pharma shares to record high "
    },
    {
        "content": "LONDON AstraZeneca  is getting a $450 million windfall by letting Celgene  develop a prized immunotherapy drug for blood cancers but its chief executive insists the deal is about strategy  not cash.",
        "date": "04242015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca insists Celgene deal about strategy  not cash "
    },
    {
        "content": "April 23 A unit of AstraZeneca Plc   has teamed up with Juno Therapeutics Inc to develop combination treatments that use the body's immune system to kill cancer cells.",
        "date": "04232015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca  Juno latest to collaborate on immuno-oncology drugs "
    },
    {
        "content": "LONDON  April 24 AstraZeneca is getting a $450 million windfall by letting Celgene develop a prized immunotherapy drug for blood cancers but its chief executive insists the deal is about strategy  not cash.",
        "date": "04242015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "CORRECTED-AstraZeneca insists Celgene deal about strategy  not cash "
    },
    {
        "content": "* CEO says no comment on Pfizer  completely focused on developing pipeline",
        "date": "04242015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca open to acquisitions  smaller deals more likely "
    },
    {
        "content": "LONDON AstraZeneca  has sharpened its focus on cancer drugs with two new deals as it looks beyond a hit to sales and profits from the launch of cheap copies of its popular stomach acid pill Nexium in the vital U.S. market.",
        "date": "04242015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca looks beyond Nexium hit with new cancer deals "
    },
    {
        "content": "* Drugmaker reiterates financial forecasts for year   (Adds analyst comment  latest shares)",
        "date": "04242015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-AstraZeneca looks beyond Nexium hit with new cancer deals "
    },
    {
        "content": "LONDON  April 24 AstraZeneca's sales fell by a slightly less-than-expected 6 percent in the first quarter  hit by the launch of generic copies of its popular stomach acid pill Nexium in the vital U.S. market and the strong dollar.",
        "date": "04242015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca hit by copycat Nexium and strong dollar in Q1 "
    },
    {
        "content": "* Fy 2015 guidance is unchanged from that provided on 6 march 2015",
        "date": "04242015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca holds 2015 guidance after Q1 core EPS of $1.08 "
    },
    {
        "content": "* Astrazeneca announces updated progression free survival data for investigational non-small cell lung cancer medicine AZD9291",
        "date": "04172015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca lung cancer drug delays disease by more than a year "
    },
    {
        "content": "* Announces global agreement with AstraZeneca for IPH2201 in immuno-oncology",
        "date": "04242015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Innate Pharma and AstraZeneca announce immuno-oncology agreement "
    },
    {
        "content": "LONDON  April 17 An experimental lung cancer pill from AstraZeneca delays disease progression by more than a year  according to new data presented at a medical meeting on Friday.",
        "date": "04172015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca lung cancer drug delays disease by more than a year "
    },
    {
        "content": "* Astrazeneca and PatientsLikeMe announce global research collaboration",
        "date": "04132015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca and PatientsLikeMe sign research agreement "
    },
    {
        "content": "WASHINGTON AstraZeneca Plc's diabetes drug Onglyza and Takeda Pharmaceutical Co.'s rival product Nesina should carry information about the risk of heart failure  an advisory committee to the U.S. Food and Drug Administration said on Tuesday.",
        "date": "04142015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "FDA panel backs safety updates for AstraZeneca  Takeda drugs "
    },
    {
        "content": "* U.S. FDA has granted orphan drug designation for mek inhibitor selumetinib  for treatment of uveal melanoma  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "04172015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca gets orphan drug status for uveal melanoma treatment "
    },
    {
        "content": "* New drugs make progress  high hopes in lung cancer treatment",
        "date": "04152015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca science is on the move  one year on from Pfizer bid "
    },
    {
        "content": "WASHINGTON  April 14 AstraZeneca Plc's  diabetes drug Onglyza and Takeda Pharmaceutical Co.'s  rival product Nesina should carry information about the risk of heart failure  an advisory committee to the U.S. Food and Drug Administration said on Tuesday.",
        "date": "04142015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 3-FDA panel backs safety updates for AstraZeneca  Takeda drugs "
    },
    {
        "content": "April 15 Pfizer Inc said on Wednesday the first formal late-stage trial of its approved treatment for advanced breast cancer  Ibrance  was stopped early after the medicine met its goal of delaying progression of the disease in previously treated patients.",
        "date": "04152015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Approved Pfizer breast cancer drug impresses in latest study "
    },
    {
        "content": "* Medimmune unit entered into collaboration to conduct clinical trials in immuno-oncology with privately-held  immunocore limited",
        "date": "04162015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca  Immunocore tie-up to conduct immuno-oncology trials "
    },
    {
        "content": "AstraZeneca Plc's diabetes drug Onglyza may be associated with an increased rate of death  according to a preliminary review of data by the U.S. Food and Drug Administration.",
        "date": "04102015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca's diabetes drug Onglyza may increase death rate -FDA "
    },
    {
        "content": "April 10 AstraZeneca Plc's diabetes drug Onglyza may be associated with an increased rate of death  according to a preliminary review of data by the U.S. Food and Drug Administration.",
        "date": "04102015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 3-AstraZeneca's diabetes drug Onglyza may increase death rate -FDA "
    },
    {
        "content": "* AstraZeneca boosted as medicine gains orphan status in U.S.",
        "date": "04152015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Britain's FTSE sets fresh record high; Dixons  Next rally "
    },
    {
        "content": "NEW YORK A U.S. appeals court said Tuesday that the $76 million in damages awarded to AstraZeneca in a patent infringement case involving its heartburn drug Prilosec must be cut back because of an improper calculation by the district court judge in the case.",
        "date": "04072015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "Appeals court cuts damages to Astra Zeneca over Prilosec generic "
    },
    {
        "content": "LONDON  April 10 Britain's top equity index sprinted to new record highs on Friday  as real-estate stocks extended gains from a rebound in property prices and drugmaker Shire got a lift from a positive product review.",
        "date": "04102015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UK's FTSE races to new record high as Shire shines "
    },
    {
        "content": "LONDON  April 10 Britain's top equity index advanced on Friday  nearing record highs  as real-estate stocks extended gains from a rebound in property prices and drugmaker Shire got a lift from a positive product review.",
        "date": "04102015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Britain's FTSE nears record high as Shire shines "
    },
    {
        "content": "* To collaborate with Harvard Stem Cell Institute in diabetesFurther company coverage:     (Reporting By Ben Hirschler)",
        "date": "03252015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca to collaborate with Harvard Stem Cell Institute in diabetes "
    },
    {
        "content": "* Under terms of agreement  Daiichi Sankyo Inc will pay a $200 mln up-front fee and subsequent sales-related payments of up to $625 mln",
        "date": "03192015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca announces collaboration with Japan's Daiichi Sankyo "
    },
    {
        "content": "LONDON  March 18 AstraZeneca said on Wednesday its experimental lung drug PT003 for chronic lung disease had proved successful in two final-stage Phase III trials  boosting hopes for the company's respiratory pipeline.",
        "date": "03182015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca two-in-one drug succeeds in lung disease test "
    },
    {
        "content": "LONDON New clinical trial results with AstraZeneca's heart drug Brilinta are positive but bleeding risks suggest the company's sales force still has its work cut out to get the medicine widely adopted for long-term use.",
        "date": "03162015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca heart drug results positive but not knock-out "
    },
    {
        "content": "* PT003 is first LAMA/LABA combination to be delivered in a pressurised metered dose inhaler",
        "date": "03182015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca reports positive Phase III results for PT003 in COPD "
    },
    {
        "content": "LONDON  March 12 UK shares rose on Thursday  led by domestic bank TSB after it received a takeover offer  and by drugs group AstraZeneca on optimism about key trial results.",
        "date": "03122015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "TSB leads rise in UK stocks as Sabadell makes takeover bid "
    },
    {
        "content": "LONDON  March 14 Long-term use of AstraZeneca's  drug Brilinta can cut the risk of death  another heart attack or stroke in patients with a history of past attacks by 16 percent  a keenly awaited clinical trial showed on Saturday.",
        "date": "03142015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Long-term use of AstraZeneca heart drug brings benefits  some risks "
    },
    {
        "content": "LONDON  March 6 Drugmaker AstraZeneca  said on Friday it would change the way it reported results with effect from the first quarter of 2015 to make revenue from so-called externalisation deals more visible to investors.",
        "date": "03062015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca keeps 2015 outlook after financial reporting change "
    },
    {
        "content": "LONDON  March 4 The idea of using vaccines to fight cancer has received a shot in the arm from a $1 billion deal between Bristol-Myers Squibb and Bavarian Nordic .",
        "date": "03042015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Bristol's $1 bln Bavarian deal may signal cancer vaccine revival "
    },
    {
        "content": "* Completed transaction to acquire rights to actavis' branded respiratory business in us and canada.  Source text for Eikon:  Further company coverage:",
        "date": "03032015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca completes buy of Actavis' portfolio in North America "
    },
    {
        "content": "LONDON Drugmaker AstraZeneca  has decided to carve out its early-stage antibiotic research by creating a stand-alone subsidiary company  as it sharpens its focus on other therapy areas.",
        "date": "02272015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca to carve out antibiotic R&D into separate firm "
    },
    {
        "content": "LONDON  Feb 27 Drugmaker AstraZeneca has decided to carve out its early-stage antibiotic research by creating a stand-alone subsidiary company  as it sharpens its focus on other therapy areas.",
        "date": "02272015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 1-AstraZeneca to carve out antibiotic R&D into separate firm "
    },
    {
        "content": "LONDON  Feb 27 Drugmaker AstraZeneca has decided to carve out its early-stage antibiotic research by creating a stand-alone subsidiary company  as it sharpens its focus on other therapy areas.",
        "date": "02272015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca carving out antibiotic R&D into separate firm "
    },
    {
        "content": "LONDON  Feb 25 AstraZeneca has boosted its early-stage research in autoimmune disease by signing a three-year research deal with start-up firm Orca Pharmaceuticals  a small British biotech company formed in 2013  on a new class of drugs.",
        "date": "02252015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca taps biotech firm Orca for autoimmune disease drugs "
    },
    {
        "content": "* Says receives $150 million in milestones payments related to deal with Astrazeneca",
        "date": "02132015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Almirall receives $150 million in milestones from Astrazeneca "
    },
    {
        "content": "NEW YORK  Feb 15 A U.S. federal judge ruled late on Friday that AstraZeneca PLC's patent on its Pulmicort Repsules treatment for asthma was invalid  opening up the market to a second  cheaper generic version.",
        "date": "02162015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca's patent on asthma drug invalidated by U.S. court "
    },
    {
        "content": "Feb 11 AstraZeneca PLC :  * U.S. says Astrazeneca to pay $7.9 million to resolve kickback",
        "date": "02112015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca to pay $7.9 million to resolve US kickback probe "
    },
    {
        "content": "LONDON AstraZeneca  said on Thursday it would buy Actavis'  branded respiratory drug business in the United States and Canada for an initial $600 million as it reported disappointing fourth-quarter earnings. | Video ",
        "date": "02052015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca to buy Actavis lung drugs as earnings fall short "
    },
    {
        "content": "* Q4 core EPS 76 cents vs consensus 82 cents   (Adds further CEO comments on deals  Breakingviews link)",
        "date": "02052015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 3-AstraZeneca to buy Actavis lung drugs as earnings fall short "
    },
    {
        "content": "Feb 5 AstraZeneca PLC CEO Pascal Soriot tells reporters:  * CEO says 55 pounds per share offer from Pfizer would likely never have",
        "date": "02052015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-AstraZeneca CEO says 55 stg/shr Pfizer offer would likely never have happened "
    },
    {
        "content": "* FTSE 100 down 0.6 pct     * BT rises after confirming deal for EE     * Energy sector falls after renewed slump in oil     * Mixed results see AstraZeneca miss expectations      By Alistair Smout     LONDON  Feb 5 Britain's top share index fell on Thursday  dragged down by an oil-price-related slump in commodity stocks but outperforming most European markets as a strategic acquisition boosted telecom firm BT Group.     BT rose 4.5 percent to a 14-year high after saying it agreed a ",
        "date": "02052015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Britain's FTSE falls but outpaces most of euro zone  BT boosted by EE deal "
    },
    {
        "content": "* Says agrees for AstraZeneca to acquire the US and Canada rights for aclidinium bromide from Actavis",
        "date": "02052015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Almirall agrees for AstraZeneca to buy US and Canada rights for aclidinium bromide "
    },
    {
        "content": "LONDON  Feb 5 AstraZeneca said on Thursday it had agreed to buy Actavis' branded respiratory drug business in the United States and Canada for an initial payment of $600 million as it seeks external deals to ensure growth.",
        "date": "02052015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca to buy Actavis lung drugs as Q4 earnings fall short "
    },
    {
        "content": "* Astrazeneca receives planning consent for new global research and development centre and corporate headquarters in cambridge  uk",
        "date": "02042015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca gets nod to build global R&D  HQ facility in Cambridge "
    },
    {
        "content": "LONDON AstraZeneca said on Thursday it had struck four research agreements in the hot area of genome editing as it bets on a new \"genetic scissors\" technology to deliver better and more precise drugs for a range of diseases.",
        "date": "01292015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca bets on 'genetic scissors' for range of new drugs "
    },
    {
        "content": "* Builds on in-house CRISPR programme at drugmaker   (Adds further details on promise of new technology)",
        "date": "01292015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-AstraZeneca bets on \"genetic scissors\" for range of new drugs "
    },
    {
        "content": "The U.S. Food and Drug Administration said it approved Teva Pharmaceutical Industries Ltd's   generic version of AstraZeneca Plc's blockbuster heartburn drug Nexium  the agency's first such approval for the drug.",
        "date": "01282015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "FDA approves Teva's generic version of AstraZeneca's Nexium "
    },
    {
        "content": "Jan 26 The U.S. Food and Drug Administration said it approved Teva Pharmaceutical Industries Ltd's   generic version of AstraZeneca Plc's  blockbuster heartburn drug Nexium  the agency's first such approval for the drug.",
        "date": "01262015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "UPDATE 1-FDA approves Teva's generic version of AstraZeneca's Nexium "
    },
    {
        "content": "KARLSRUHE  Germany  Jan 13 Britain's AstraZeneca Plc on Tuesday lost an appeal in Germany's Federal Court against generic drugmakers selling cheap copies of its anti-psychotic drug Seroquel XR.",
        "date": "01132015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca loses German court appeal over Seroquel XR drug patent "
    },
    {
        "content": "KARLSRUHE  Germany Britain's AstraZeneca Plc on Tuesday lost an appeal in Germany's Federal Court against generic drugmakers selling cheap copies of its anti-psychotic drug Seroquel XR.",
        "date": "01132015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca loses German court appeal over Seroquel XR drug patent "
    },
    {
        "content": "LONDON AstraZeneca's blood-thinning drug Brilinta cut the risk of death or heart attack in patients with a history of previous attacks  according to a major clinical trial that will boost hopes for the closely watched product.",
        "date": "01142015",
        "name": "Astrazeneca PLC",
        "news_type": "topStory",
        "symbol": "AZN",
        "title": "AstraZeneca heart drug boosted by major clinical trial success "
    },
    {
        "content": "* AstraZeneca shares up 1.5 percent   (Adds executive interview  consensus sales forecast  more reaction)",
        "date": "01142015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "UPDATE 2-AstraZeneca heart drug boosted by major clinical trial success "
    },
    {
        "content": "LONDON  Jan 14 European shares fell at the open on Wednesday  mirroring a slump in copper and oil prices after the World Bank cut its global growth forecast for this year.",
        "date": "01142015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Europe shares fall as growth fears hit energy  miners "
    },
    {
        "content": "Jan 12 Bristol-Myers Squibb and Merck & Co broke further away from rival drugmakers in the race to treat lung cancer with a new generation of immune system therapies  adding pressure on the likes of Roche and AstraZeneca to play catch-up.",
        "date": "01122015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Merck  Bristol heat up immunotherapy race in lung cancer "
    },
    {
        "content": "LONDON  Jan 12 AstraZeneca said on Monday its MedImmune biotech unit had struck a deal with unlisted U.S. company Omnis Pharmaceuticals on the development of cancer-fighting oncolytic viruses.",
        "date": "01122015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "AstraZeneca in cancer viruses deal with Omnis Pharmaceuticals "
    },
    {
        "content": "* MedImmune enters licensing agreement with Omnis Pharmaceuticals for oncolytic viruses in immuno-oncology",
        "date": "01122015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "BRIEF-Astrazeneca's MedImmune signs licensing deal with Omnis Pharmaceuticals "
    },
    {
        "content": "* Immune-boosting cancer drugs critical to company's future",
        "date": "01052015",
        "name": "Astrazeneca PLC",
        "news_type": "normal",
        "symbol": "AZN",
        "title": "Shake-up at AstraZeneca as two immuno-oncology leaders leave "
    }
]