[
    {
        "content": "* Aspen technology announces financial results for the first quarter of fiscal 2018",
        "date": "10262017",
        "name": "Aspen Technology Inc",
        "news_type": "topStory",
        "symbol": "AZPN",
        "title": "BRIEF-Aspen Technology Q1 non-GAAP earnings per share $0.53 "
    },
    {
        "content": "JOHANNESBURG Britain's competition regulator has launched an investigation into Africa's biggest generic drug maker Aspen Pharmacare over alleged anticompetitive conduct in the supply of blood pressure and arthritis drugs  Aspen said on Friday.",
        "date": "10132017",
        "name": "Aspen Technology Inc",
        "news_type": "topStory",
        "symbol": "AZPN",
        "title": "UK anti-trust regulator investigates South Africa's Aspen Pharmacare "
    },
    {
        "content": "JOHANNESBURG  Oct 13 Britain's competition regulator has launched an investigation into Africa's biggest generic drug maker Aspen Pharmacare over alleged anticompetitive conduct in the supply of blood pressure and arthritis drugs  Aspen said on Friday.",
        "date": "10132017",
        "name": "Aspen Technology Inc",
        "news_type": "normal",
        "symbol": "AZPN",
        "title": "UK anti-trust regulator investigates S.Africa's Aspen Pharmacare "
    },
    {
        "content": "JOHANNESBURG South Africa's competition watchdog has dropped an investigation into Aspen Pharmacare and Equity Pharmaceutical  saying a case against them for over-charging for cancer medicines \"cannot be sustained.\"",
        "date": "10042017",
        "name": "Aspen Technology Inc",
        "news_type": "topStory",
        "symbol": "AZPN",
        "title": "South Africa watchdog drops over-charging probe into Aspen  Equity "
    },
    {
        "content": "JOHANNESBURG  Oct 4 South Africa's competition watchdog has dropped an investigation into Aspen Pharmacare and Equity Pharmaceutical  saying a case against them for over-charging for cancer medicines \"cannot be sustained.\"",
        "date": "10042017",
        "name": "Aspen Technology Inc",
        "news_type": "normal",
        "symbol": "AZPN",
        "title": "UPDATE 1-S.Africa watchdog drops over-charging probe into Aspen  Equity "
    },
    {
        "content": "JOHANNESBURG  Oct 4 South Africa's competition watchdog has dropped an investigation into Aspen Pharmacare and Equity Pharmaceutical  saying a case against them for over-charging for cancer medicines \"cannot be sustained.\"",
        "date": "10042017",
        "name": "Aspen Technology Inc",
        "news_type": "normal",
        "symbol": "AZPN",
        "title": "S.Africa watchdog drops over-charging probe into Aspen  Equity "
    },
    {
        "content": "JOHANNESBURG  Aug 30 South African drugmaker Aspen Pharmacare said on Wednesday that it expects full-year profit to climb by as much as 48 percent from last year when it was hit by a writedown on its Venezuelan business.",
        "date": "08302017",
        "name": "Aspen Technology Inc",
        "news_type": "topStory",
        "symbol": "AZPN",
        "title": "CORRECTED-South Africa's Aspen Pharmacare flags jump in full-year profit "
    },
    {
        "content": "* Aspen Technology announces financial results for the fourth quarter and fiscal year 2017",
        "date": "08102017",
        "name": "Aspen Technology Inc",
        "news_type": "topStory",
        "symbol": "AZPN",
        "title": "BRIEF-Aspen Technology Q4 non-GAAP earnings per share $0.79 "
    },
    {
        "content": "BRUSSELS EU antitrust regulators will investigate whether Aspen Pharmacare is charging excessive prices for five key cancer drugs in a move which could lead to a hefty fine for Africa's largest generic drugmaker.",
        "date": "05152017",
        "name": "Aspen Technology Inc",
        "news_type": "normal",
        "symbol": "AZPN",
        "title": "Aspen under EU antitrust spotlight over excessive cancer drug prices "
    },
    {
        "content": "BRUSSELS  May 15 EU antitrust regulators will investigate whether Aspen Pharmacare is charging excessive prices for five key cancer drugs in a move which could lead to a hefty fine for Africa's largest generic drugmaker.",
        "date": "05152017",
        "name": "Aspen Technology Inc",
        "news_type": "normal",
        "symbol": "AZPN",
        "title": "UPDATE 2-Aspen under EU antitrust spotlight over excessive cancer drug prices "
    },
    {
        "content": "* Aspen Technology announces financial results for the third quarter of fiscal 2017",
        "date": "05022017",
        "name": "Aspen Technology Inc",
        "news_type": "topStory",
        "symbol": "AZPN",
        "title": "BRIEF-Aspen Technology announces Q3 earnings per share $0.47 "
    },
    {
        "content": "* Aspen technology announces financial results for the second quarter of fiscal 2017",
        "date": "01262017",
        "name": "Aspen Technology Inc",
        "news_type": "topStory",
        "symbol": "AZPN",
        "title": "BRIEF-Aspen technology reports Q2 adj EPS $0.52 "
    },
    {
        "content": "* Aspen Technology announces financial results for the first quarter of fiscal 2017",
        "date": "10272016",
        "name": "Aspen Technology Inc",
        "news_type": "topStory",
        "symbol": "AZPN",
        "title": "BRIEF-Aspen Technology posts Q1 adj. earnings per share $0.49 "
    },
    {
        "content": "* Aspen Technology announces financial results for the fourth quarter and fiscal year 2016",
        "date": "08112016",
        "name": "Aspen Technology Inc",
        "news_type": "topStory",
        "symbol": "AZPN",
        "title": "BRIEF-Aspen Technology Q4 earnings per share view $0.39 "
    },
    {
        "content": "* Aspen shares jump 10 percent  AstraZeneca stock slips   (Adds context on externalisation drive  market reaction)",
        "date": "06092016",
        "name": "Aspen Technology Inc",
        "news_type": "topStory",
        "symbol": "AZPN",
        "title": "UPDATE 1-AstraZeneca sells rights to anaesthetics for up to $770 mln "
    },
    {
        "content": "* AspenTech acquires Fidelis Group LLC  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06062016",
        "name": "Aspen Technology Inc",
        "news_type": "topStory",
        "symbol": "AZPN",
        "title": "BRIEF-AspenTech acquires Fidelis Group "
    },
    {
        "content": "* Aspen technology announces financial results for the third quarter of fiscal 2016",
        "date": "04282016",
        "name": "Aspen Technology Inc",
        "news_type": "topStory",
        "symbol": "AZPN",
        "title": "BRIEF-Aspen Technology Q3 non-gaap earnings per share $0.49 "
    },
    {
        "content": "* Co  KBC agreed a recommended all cash acquisition by Global Optimisation of entire issued and to be issued share capital of KBC\u007f",
        "date": "01122016",
        "name": "Aspen Technology Inc",
        "news_type": "topStory",
        "symbol": "AZPN",
        "title": "BRIEF-Aspen Tech to buy KBC Advanced for about 158 mln stg "
    },
    {
        "content": "JOHANNESBURG  May 11 South Africa's biggest drugmaker Aspen Pharmacare said on Monday it will sell a part of its local business to a unit of Endo International Plc  for 1.6 billion rand ($134 million).",
        "date": "05112015",
        "name": "Aspen Technology Inc",
        "news_type": "topStory",
        "symbol": "AZPN",
        "title": "S.Africa's Aspen sells part of local unit to Endo for $134 mln "
    },
    {
        "content": "* British group retains 6.2 percent stake in Aspen   (Updates with actual amount raised following sale)",
        "date": "03132015",
        "name": "Aspen Technology Inc",
        "news_type": "topStory",
        "symbol": "AZPN",
        "title": "UPDATE 2-GSK raises $853 mln by halving stake in S.African drugmaker "
    }
]