[
    {
        "content": "U.S. post-financial crisis rules that place strong trading restrictions on banks has fueled the rise of private trading firms that have grabbed market share  a top Bank of America Corp executive said on Tuesday.",
        "date": "11142017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America executive: Volcker Rule fuels private trading firms' rise "
    },
    {
        "content": "NEW YORK  Nov 14 Warren Buffett's Berkshire Hathaway Inc has sold another large piece of its stake in IBM Corp  backing further away from an investment that the billionaire has admitted was not one of his best.",
        "date": "11142017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Buffett's Berkshire slashes IBM stake  adds to Apple "
    },
    {
        "content": "Nov 14 U.S. post-financial crisis rules that place strong trading restrictions on banks has fueled the rise of private trading firms that have grabbed market share  a top Bank of America Corp executive said on Tuesday.",
        "date": "11142017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Bank of America exec: Volcker Rule fuels private trading firms' rise "
    },
    {
        "content": "* Appaloosa Lp cuts share stake in Chesapeake Energy Corp to 766 000 shares from 3.6 million shares - sec filing",
        "date": "11142017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Appaloosa Lp cuts share stake in Chesapeake  Bank of America "
    },
    {
        "content": "A trio of Bank of America Corp investment bankers who focus on advising consumer companies are departing for rival Citigroup Inc  people familiar with the matter said on Tuesday.",
        "date": "11072017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America consumer bankers depart for Citigroup: sources "
    },
    {
        "content": "Nov 7 A trio of Bank of America Corp investment bankers who focus on advising consumer companies are departing for rival Citigroup Inc  people familiar with the matter said on Tuesday.",
        "date": "11072017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-Bank of America consumer bankers depart for Citigroup -sources "
    },
    {
        "content": "* Stone Energy Corp - ‍on Nov 8  co  received notice from Bank Of America that its borrowing base under credit agreement had been reduced to $100 million",
        "date": "11082017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Stone Energy Corp receives notice from Bank Of America "
    },
    {
        "content": "Nov 3 Credit Suisse Group AG has hired Paul Galietto as head of Americas equities trading  according to an internal memo seen by Reuters  in a move to further boost its stock business.",
        "date": "11042017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-MOVES-Credit Suisse names Galietto to head U.S. stock trading "
    },
    {
        "content": "NEW YORK  Nov 2 Bank of America has agreed to pay $66.6 million to end a lawsuit accusing it of collecting unlawfully high rates of interest  styled as fees  from customers who let their checking accounts stay overdrawn for several days.",
        "date": "11022017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America settles overdraft lawsuit for $66.6 million "
    },
    {
        "content": "NEW YORK A proposal by Republicans in the U.S. House of Representatives for a deep corporate tax cut and cutbacks in certain deductions will probably face opposition from lobbying groups and some federal lawmakers  Bank of America Merrill Lynch economists said.",
        "date": "11032017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America sees challenges for Republicans' U.S. tax plan to pass "
    },
    {
        "content": "HONG KONG  Nov 2 China's HNA Group is issuing a high coupon  short-dated bond to global investors in a sign that the acquisitive  airline-to-property conglomerate is under pressure to refinance its debt-laden balance sheet  analysts said.",
        "date": "11022017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "China's HNA selling short-dated bond at \"scary\" high 9 pct coupon "
    },
    {
        "content": "Nov 3 Credit Suisse Group AG has hired Paul Galietto as head of Americas equities trading from UBS Group AG  according to an internal memo seen by Reuters  as the Swiss bank continues to hire traders from rival banks to boost its stock business.",
        "date": "11032017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-Credit Suisse names UBS's Galietto as head of U.S. stock trading "
    },
    {
        "content": "HONG KONG  Nov 3 China's HNA Group sold $300 million worth of a high yielding  short-dated bond to global investors in a sign that the acquisitive  airline-to-property conglomerate is under pressure to refinance its debt-laden balance sheet  analysts said.",
        "date": "11032017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "RPT-UPDATE 3-China's HNA sells short-dated bond at \"scary\" high yield "
    },
    {
        "content": "* HNA has $2.84 bln worth of bonds maturing before end-2018 (Adds issue statistics in last three paragraphs)",
        "date": "11032017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 3-China's HNA sells short-dated bond at \"scary\" high yield "
    },
    {
        "content": "Oct 26 More than a year after Britons voted to leave the European Union  Bank of America Corp Chief Executive Brian Moynihan said he still sees no potential upside from the decision.",
        "date": "10262017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America CEO still sees no upside from Brexit "
    },
    {
        "content": "Oct 26 More than a year after Britons voted to leave the European Union  Bank of America Corp Chief Executive Brian Moynihan said he still sees no potential upside from the decision.",
        "date": "10262017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Bank of America CEO still sees no upside from Brexit "
    },
    {
        "content": "NEW YORK Many investors would like to see the Libor global interest rate benchmark to remain with improvements and to co-exist with a risk-free alternative  a Bank of America Merrill Lynch survey released late Wednesday showed.",
        "date": "10262017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Many investors want Libor to stay with improvements: Bank of America survey "
    },
    {
        "content": "NEW YORK  Oct 26 Many investors would like to see the Libor global interest rate benchmark to remain with improvements and to co-exist with a risk-free alternative  a Bank of America Merrill Lynch survey released late Wednesday showed.",
        "date": "10262017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Many investors want Libor to stay with improvements - Bank of America survey "
    },
    {
        "content": "BRASILIA/SAO PAULO  Oct 20 BK Brasil Operação e Assessoria a Restaurantes SA  operator of the Burger King fast-food chain in Brazil  will list an undisclosed amount of new shares on the country's stock exchange  the latest in a year-long wave of initial public offerings.",
        "date": "10202017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Burger King operator BK Brasil files for IPO in wave of listings "
    },
    {
        "content": "Oct 23 Bank of America Corp will start using an additional layer of authentication for online banking  the bank said on Monday  amid a wave of high-profile data breaches at several big U.S. companies.",
        "date": "10232017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America beefs up security for online banking "
    },
    {
        "content": "* To begin implementing Intel Online Connect technology into online banking platform  to provide added security for online‍​ banking",
        "date": "10232017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America to expand use of biometrics for online banking "
    },
    {
        "content": "* Bank of America - credit card delinquency rate ‍​ 1.56 percent at September end versus 1.55 percent at August end - SEC filing",
        "date": "10162017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America says credit card delinquency rate ‍was 1.56 pct at September end "
    },
    {
        "content": "NEW YORK Bank of America Corp  has been quickly expanding its reach to those who are not wealthy enough to be customers of financial advisors within its Merrill Lynch brokerage  but have enough money to open an investment account.",
        "date": "10132017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America grows Merrill Edge reach to customers with thousands  not millions "
    },
    {
        "content": "NEW YORK  Oct 13 Bank of America Corp has been quickly expanding its reach to those who are not wealthy enough to be customers of financial advisors within its Merrill Lynch brokerage  but have enough money to open an investment account.",
        "date": "10132017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "CORRECTED-Bank of America grows Merrill Edge reach to customers with thousands  not millions "
    },
    {
        "content": "NEW YORK  Oct 11 Recent options market activity shows traders have turned less bullish on a key financial sector exchange-traded fund  analysts said  just ahead of earnings reports from some of the largest U.S. banks.",
        "date": "10112017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bullish flows into financial ETF belie worries ahead of bank results "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 13 (Fitch) Bank of America Corporation's (BAC) third quarter 2017 (3Q17) earnings continued the company's trend of improving earnings performance  according to Fitch Ratings. Net income of $5.6 billion in 3Q17 was 12.8% higher than in the year-ago quarter. These results equated to a 0.98% annualized return on average assets (ROAA)  an increase of eight basis points from the year-ago quarter. Similarly  BAC's annualized ",
        "date": "10132017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Fitch: Strong Earnings Momentum for Bank of America in 3Q17 "
    },
    {
        "content": "* Qtrly revenue  net of interest expense  increased 1% to $21.8 billion from $21.6 billion",
        "date": "10132017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America posts qtrly ‍​earnings per share of $0.48‍​‍​ "
    },
    {
        "content": "Oct 13 Bank of America Corp  the second-largest U.S. bank by assets  reported a 15 percent rise in quarterly profit as the lender kept a tight leash on costs and benefited from higher interest rates.",
        "date": "10132017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America profit rises 15 percent on lower costs "
    },
    {
        "content": "Please click on the link below for Bank of America's quarterly earnings press release: Source text:",
        "date": "10132017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America Q3 results press release "
    },
    {
        "content": "* John Kerry named chairman of bank of america global advisory council‍​",
        "date": "10042017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-John Kerry joins Bank of America's global advisory council‍​ as chairman "
    },
    {
        "content": "Oct 1 Bank of America said on Sunday that it had named Katy Knox president of its private bank  U.S. Trust  replacing Keith Banks. Banks  who had led U.S. Trust since 2009  will continue as head of the chief investment office and investment solutions groups reporting to Terry Laughlin  vice chairman of Bank of America and head of global wealth & investment management the company said. Knox has led business banking since 2014. Banks and Knox will work together on the leadership transi",
        "date": "10012017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Katy Knox replacing Keith Banks as U.S. Trust president "
    },
    {
        "content": "* Coeur Mining-on Sept 29 co entered into credit agreement as borrower  units as guarantors  Bank Of America  N.A as administrative agent-sec filing​",
        "date": "10022017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Coeur Mining entered into credit agreement as borrower  units as guarantors  Bank of America  as administrative agent on Sept 29 "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  September 28 (Fitch) Fitch Ratings has affirmed Bank of America Corporation's (BAC's) Long-Term and Short-Term Issuer Default Ratings (IDR) at 'A'/'F1'  respectively. The Rating Outlook is Stable. The rating affirmations have been taken in conjunction with Fitch's periodic review of the Global Trading and Universal Banks (GTUBs). KEY RATING DRIVERS IDRs  VR  SENIOR DEBT  AND DERIVATIVE COUNTERPARTY RATING Today's rating action ",
        "date": "09282017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Fitch Affirms Bank of America's Long-Term IDR at 'A'; Outlook Stable "
    },
    {
        "content": "* LAUNCH OF ACCELERATED BOOKBUILDING BY SANY EUROPE TO INSTITUTIONAL INVESTORS OF UP TO 900 000 SHARES IN PALFINGER‍​",
        "date": "09282017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Sany Group looks to sell down stake in Palfinger via placing "
    },
    {
        "content": "Sept 27 Bank of America Corp named former CFO Bruce Thompson as the new leader of its European global banking and markets operations to be based in Dublin  according to a company memo from Chief Operating Officer Tom Montag.",
        "date": "09272017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Bank of America names leaders for new European hub "
    },
    {
        "content": "* Bank of America venture trims 10 pct of staff as part of digital push; about 250 employees lose jobs as part of restructuring - WSJ  citing sources Source: http://on.wsj.com/2xvLPeM Further company coverage:",
        "date": "09262017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America venture trims 10 pct of staff as part of digital push - WSJ "
    },
    {
        "content": "Bank of America Corp  will continue to favor share buybacks over a dividend increase to avoid putting itself in a position where it may have to reduce the dividend in the future  Chief Executive Brian Moynihan said at a conference in London on Wednesday.",
        "date": "09272017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America will continue share buybacks  CEO says "
    },
    {
        "content": "BEIJING  Sept 26 HNA Group  the high-flying Chinese conglomerate caught in the cross-sights of Beijing  has hit turbulence as deals stall and scrutiny of its finances and shareholding structure intensifies.",
        "date": "09262017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "High-flying HNA Group comes back to earth as scrutiny hits dealmaking "
    },
    {
        "content": "Sept 27 Bank of America Corp will continue to favor share buybacks over a dividend increase to avoid putting itself in a position where it may have to reduce the dividend in the future  Chief Executive Brian Moynihan said at a conference in London on Wednesday.",
        "date": "09272017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Bank of America will continue share buybacks  CEO says "
    },
    {
        "content": "Sept 27 Bank of America Corp will continue to favor share buybacks to a dividend increase as the bank does not want to put itself into a position where it may have to reduce the dividend  Chief Executive Brian Moynihan said at a conference in London Wednesday.",
        "date": "09272017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "REFILE-Bank of America will continue share buybacks  CEO says "
    },
    {
        "content": "LONDON/PARIS  Sept 27 Bank of America is looking to lease more office space in Paris as the bank prepares to expand its operations in the French capital to cope with the impact of Britain's exit from the European Union  according to two sources familiar with the matter.",
        "date": "09272017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Bank of America looking for more office space in Paris after Brexit - sources "
    },
    {
        "content": "LONDON  Sept 27 Bank of America is looking to lease more office space in Paris as the bank prepares to expand its operations in the French capital to cope with the impact of Britain's exit from the European Union  according to two sources familiar with the matter.",
        "date": "09272017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America looking for more office space in Paris after Brexit - source "
    },
    {
        "content": "LONDON  Sept 20 Bank of America Merrill Lynch has promoted Jim O'Neil to co-head its corporate and investment bank in Europe  Middle East and Africa (EMEA)  according to a memo seen by Reuters on Wednesday.",
        "date": "09202017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Bank of America promotes Jim O'Neil to co-head of CIB EMEA - memo "
    },
    {
        "content": "* Bank of America - credit card charge-off rate was 2.80‍​ percent in August versus 2.53 percent in July",
        "date": "09152017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America credit card delinquency  charge-off rate for August "
    },
    {
        "content": " (Adds final results)     By Guillermo Parra-Bernal and Paul Kilby     SAO PAULO/NEW YORK  Sept 18 State-controlled Petróleo Brasileiro SA raised $2 billion from the sale of seven- and 10-year securities  replacing more expensive shorter-dated bonds as it seeks to trim a debt burden that is the largest among major oil firms.     Two people with direct knowledge of the deal said on Monday that Petrobras sold $1 billion each worth of senior unsecured bonds due in 2025 and 2028  respect",
        "date": "09182017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-Petrobras sells $2 billion in bonds  replacing costlier debt "
    },
    {
        "content": "* Baosteel replaces Shanghai Sino-Poland as buyer in ANZ sale",
        "date": "09182017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-ANZ swaps buyer in $1.4 bln Shanghai bank sale; Baosteel in "
    },
    {
        "content": "Sept 12 Bank of America Corp expects a more modest increase in net interest income than it had forecast at the end of the second quarter  Chief Financial Officer Paul Donofrio said Tuesday at an industry conference.",
        "date": "09122017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America sees more modest interest income rise in Q3 "
    },
    {
        "content": "SAO PAULO  Sept 12 Shares in Magazine Luiza SA  the Brazilian appliance retailer whose market value has quintupled this year  slumped the most in four months on Tuesday  after disclosing plans for a bigger-than-expected offering of 24 million new and existing shares.",
        "date": "09122017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-Magazine Luiza slumps on plans for Brazil share offering "
    },
    {
        "content": "* Bank of America Corp - ‍announced an agreement to extend contactless payment capabilities to a range of new devices​",
        "date": "09072017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America -‍announced agreement to extend contactless payment capabilities to a range of new devices​ "
    },
    {
        "content": "Aug 29 Warren Buffett's Berkshire Hathaway Inc has become the largest shareholder of Bank of America Corp by exercising its right to acquire 700 million shares at a steep discount  more than tripling an investment it made six years ago.",
        "date": "08292017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Buffett becomes Bank of America's top shareholder "
    },
    {
        "content": "* Berkshire also largest shareholder of Wells Fargo (Adds details on investment  comment from Bank of America CEO  background  byline)",
        "date": "08292017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Buffett becomes Bank of America's top shareholder "
    },
    {
        "content": "* Berkshire Hathaway exercises warrants to acquire Bank of America common stock‍​",
        "date": "08292017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Berkshire Hathaway exercises warrants to acquire Bank of America common stock‍​ "
    },
    {
        "content": "* Credit card delinquency rate was 1.55  percent at July end versus 1.51 percent at June end - SEC filing",
        "date": "08152017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank Of America Corp says credit card delinquency rate was 1.55 pct at July end "
    },
    {
        "content": "NEW YORK  July 28 Morgan Stanley  Royal Bank of Canada and three other banks agreed to pay a combined $111.2 million to settle U.S. litigation accusing them of rigging prices in the roughly $5 trillion-a-day foreign exchange market.",
        "date": "07282017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Morgan Stanley  RBC  others settle currency rigging lawsuit in U.S. "
    },
    {
        "content": "* Bank Of America and Paypal partner to enable in-store payments and account linking",
        "date": "07262017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America  Paypal partner to enable in-store payments and account linking "
    },
    {
        "content": "* Dublin  Frankfurt emerge as early winners for post-Brexit business",
        "date": "07272017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Ireland confident it can attract more broker-dealers to Dublin "
    },
    {
        "content": "July 26 Digital payments company PayPal Holdings Inc raised its earnings outlook on Wednesday after reporting better-than-expected quarterly results  driven by growth in users and transaction volumes.",
        "date": "07262017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-PayPal raises 2017 forecasts on growth in users  payment volumes "
    },
    {
        "content": "Bank of America has agreed to pay $42 million to military families across the country to resolve allegations that it failed to give them reduced interest rates on credit cards and mortgages required by federal law.",
        "date": "07212017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America settles lawsuit over military loans for $42 mln "
    },
    {
        "content": "LONDON/DUBLIN  July 21 Bank of America on Friday became the first Wall Street lender to pick Dublin as its new base for its European Union operations as Britain prepares to leave the bloc.",
        "date": "07212017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Bank of America picks Dublin as EU base after Brexit "
    },
    {
        "content": "LONDON  July 21 Bank of America has become the first Wall Street bank to pick Dublin to be its new base for its European Union operations as Britain prepares to leave the bloc  the firm said in a statement on Friday.",
        "date": "07212017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America picks Dublin as EU hub post Brexit "
    },
    {
        "content": "Bank of America Corp reported a higher-than-expected quarterly profit on strength in its consumer bank and cost cuts that are beginning to bear fruit after years of branch closures  staff cuts and efforts to reduce technology and paper-related expenses.",
        "date": "07182017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America profit rises as consumer bank hits profit \"milestone\" "
    },
    {
        "content": "Bank of America Corp reported a higher-than-expected quarterly profit on strength in its consumer bank and cost cuts that are beginning to bear fruit after years of branch closures  staff cuts and efforts to reduce technology and paper-related expenses.",
        "date": "07182017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America profit rises as consumer bank hits profit 'milestone' "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 19 (Fitch) Bank of America Corporation's (BAC) second quarter 2017 (2Q17) earnings were good  and continued the company's trend of improving earnings performance  according to Fitch Ratings. Net income of $5.3 billion in 2Q17 was 10.2% higher than in the year-ago quarter. These results equated to a 0.93% annualized return on average assets (ROAA) in 2Q17  up from 0.88% from last year's second quarter. Similarly  the compan",
        "date": "07192017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Fitch: Continued Earnings Momentum for Bank of America in 2Q17 "
    },
    {
        "content": "* Bank of America - Credit card delinquency rate was 1.51 percent at June end versus 1.52 percent at May end - SEC filing",
        "date": "07172017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-BofA credit card delinquency  charge-off rate for June "
    },
    {
        "content": "July 18 Bank of America Corp reported a higher-than-expected quarterly profit on strength in its consumer bank and cost cuts that are beginning to bear fruit after years of branch closures  staff cuts and efforts to reduce technology and paper-related expenses.",
        "date": "07182017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 4-Bank of America profit rises as consumer bank hits profit \"milestone\" "
    },
    {
        "content": "* Says Bank Of America Corp increased deemed interest in Co to 11.22 percent from 10.99 percent Source text for Eikon: Further company coverage:",
        "date": "07192017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Global Logistic Properties says Bank Of America Corp raised deemed interest in Co "
    },
    {
        "content": "July 18 Bank of America Corp reported a higher-than-expected quarterly profit on strength in its consumer bank and cost cuts that are beginning to bear fruit after years of branch closures  staff cuts and efforts to reduce technology and paper-related expenses.",
        "date": "07182017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "CORRECTED-UPDATE 2-Bank of America beats Wall Street view on consumer banking  cost cuts "
    },
    {
        "content": "* Reports Q2-17 net income of $5.3 billion  EPS up 12 percent to $0.46",
        "date": "07182017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America reports Q2 earnings per share of $0.46 "
    },
    {
        "content": "* Bank Of America files final term sheet related to its $2.5 billion offering of 2.369Ppct fixed/floating rate senior notes  due July 2021 Source text: (http://bit.ly/2tFjSeO) Further company coverage:",
        "date": "07192017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank Of America files final term sheet related to its $2.5 billion offering "
    },
    {
        "content": "* Bank Of America files final term sheet related to its offering of $1 billion floating rate senior notes  due July 2021 Source text: (http://bit.ly/2tG1X7z) Further company coverage:",
        "date": "07192017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank Of America files final term sheet related to its offering of $1 billion floating rate senior notes "
    },
    {
        "content": "July 18 Bank of America Corp  the second-largest U.S. lender by assets  reported an 11 percent rise in quarterly profit on Tuesday as net interest income increased.",
        "date": "07182017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America's quarterly profit rises 11 pct "
    },
    {
        "content": "LONDON Investors jumped back into riskier assets this week as a more dovish tone from the Fed rekindled enthusiasm for stocks  which benefit from a higher relative yield to bonds.",
        "date": "07142017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Risk-on week of flows as Fed tone relieves investors: BAML "
    },
    {
        "content": "LONDON  July 14 Investors jumped back into riskier assets this week as a more dovish tone from the Fed rekindled enthusiasm for stocks  which benefit from a higher relative yield to bonds.",
        "date": "07142017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Risk-on week of flows as Fed tone relieves investors - BAML "
    },
    {
        "content": "SAO PAULO  July 11 Bank of America Merrill Lynch has hired Diogo Aragão as its Brazil head of mergers and acquisitions.",
        "date": "07112017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America Merrill Lynch hires Aragão as Brazil M&A head "
    },
    {
        "content": "* Centerbridge to acquire Clearlake-backed enterprise software providers Syncsort and Vision Solutions",
        "date": "07062017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Centerbridge to acquire Clearlake-backed enterprise software providers Syncsort and Vision Solutions "
    },
    {
        "content": "* Ameresco Inc - on June 29  2017  Ameresco Inc entered into an amendment to its third amended and restated bank credit facility with Bank Of America",
        "date": "07062017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Ameresco Inc enters into an amendment to its third amended and restated bank credit facility with Bank Of America "
    },
    {
        "content": "LONDON  July 3 Bank of America Merrill Lynch has appointed Anya Weaving as managing director of the bank's global natural resources unit  according to a memo seen by Reuters on Monday.",
        "date": "07032017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Bank of America Merrill Lynch hires new global natural resources MD "
    },
    {
        "content": "* Flex Ltd says entered into a new $2.2525 billion credit agreement with Bank Of America  several banks and lenders - SEC filing",
        "date": "06302017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Flex enters into new credit agreement with Bank Of America  several banks and lenders "
    },
    {
        "content": "Warren Buffett's company will become the biggest shareholder in Bank of America Corp   after Berkshire Hathaway Inc  on Friday invoked its right to acquire 700 million shares of the second-largest U.S. bank. | Video ",
        "date": "06302017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Buffett's company to become Bank of America's top shareholder "
    },
    {
        "content": "* Says on June 29  co entered into a third amended and restated credit agreement with Bank Of America  other lenders - SEC filing",
        "date": "06302017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-BorgWarner enters into third amended and restated credit agreement with Bank Of America  other lenders "
    },
    {
        "content": "* Berkshire also largest shareholder of Wells Fargo (Recasts to include additional transaction details  Buffett comments on Bank of America  updated stock price  bylines)",
        "date": "06302017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 3-Buffett's company to become Bank of America's top shareholder "
    },
    {
        "content": "June 30 Berkshire Hathaway Inc said it would swap its preferred shares in Bank of America Corp to buy 700 million common shares  following the bank's plan to raise its dividend.",
        "date": "06302017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Berkshire to swap BofA preferred stock for 700 mln common shares "
    },
    {
        "content": "* Bank of America Corp announced plans to increase quarterly dividend to $0.12 per share on June 28",
        "date": "06302017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Berkshire says will exercise warrants to acquire 700 mln shares of Bank of America "
    },
    {
        "content": "June 27 BlackRock  the world's biggest asset manager  on Tuesday said it would buy a software company that helps businesses invest their cash  marking its second investment in a technology firm this month.",
        "date": "06272017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BlackRock makes technology deal in cash management business "
    },
    {
        "content": "* Bank of America selected company's cloud-based ERP and financial applications for its international general ledger and its broker-dealer systems Source text for Eikon: Further company coverage:",
        "date": "06262017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America selects Oracle Cloud for ERP and Financials "
    },
    {
        "content": "* Oracle inks new cloud deal with Bank of America - CNBC Source text - http://cnb.cx/2te1EFc Further company coverage: (Bengaluru Newsroom)",
        "date": "06262017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Oracle inks new cloud deal with Bank of America - CNBC "
    },
    {
        "content": "* Bank of America announces increases to quarterly common stock dividend and common share repurchase program‍​",
        "date": "06282017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank Of America announces repurchase of $12 billion in common stock from July 1  2017 through June 30  2018 "
    },
    {
        "content": "SAO PAULO Omega Geração SA  a Brazilian renewable energy firm  and shareholders expect to raise between 1.7 billion reais and 2 billion reais ($517 million and $608.25 million) in an initial public offering that could price as early as next month  a person with knowledge of the plan said on Wednesday.",
        "date": "06282017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Exclusive: Brazil's Omega targets $608 million IPO  source says "
    },
    {
        "content": "NEW YORK Bank of America Merrill Lynch on Friday downgraded its outlook on U.S. gross domestic product in 2018 to 2.1 percent from an earlier forecast of 2.5 percent  citing fading prospects on tax reform  policy uncertainty in Washington and likely weaker auto production.",
        "date": "06232017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America cuts 2018 U.S. GDP view to 2.1 percent "
    },
    {
        "content": "NEW YORK Persistent output slack and sluggish economic activity will likely keep inflation and interest rates low around the world in the foreseeable future  Bank of America Merrill Lynch economists said on Friday.",
        "date": "06232017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America sees no end to low-inflation  low-rate climate "
    },
    {
        "content": "WASHINGTON/NEW YORK  June 22 The 34 largest U.S. banks have all cleared the first stage of an annual stress test  showing they would be able to maintain enough capital in an extreme recession to meet regulatory requirements  the Federal Reserve said on Thursday.",
        "date": "06222017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Biggest U.S. banks clear first hurdle in Fed's annual stress tests "
    },
    {
        "content": "* Bank of America Corp - names Jeff Adams market president for rochester",
        "date": "06202017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America names Jeff Adams market president for Rochester "
    },
    {
        "content": "* Nortech Systems and Bank Of America Merrill Lynch announce new commercial banking agreement",
        "date": "06152017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Nortech Systems and Bank Of America Merrill Lynch announce new commercial banking agreement "
    },
    {
        "content": "June 15 Bank of America Corp has begun laying off employees in its operations and technology division  part of the second-largest U.S. bank's plan to cut costs.",
        "date": "06152017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America to lay off more workers "
    },
    {
        "content": "NEW YORK Jonathan Yalmokas has resigned as Bank of America Corp's head of prime brokerage in the Americas to lead an equity financing business at Royal Bank of Canada  a person familiar with the move said on Wednesday.",
        "date": "06142017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America prime brokerage executive jumps to RBC "
    },
    {
        "content": "Washington  June 15    The Federal Reserve announced Thursday it had terminated a 2010 enforcement action taken against Bank of America after the bank admitted to bid-rigging in the municipal debt market.",
        "date": "06152017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Federal Reserve terminates 2010 enforcement action against Bank of America "
    },
    {
        "content": "NEW YORK  June 14 Jonathan Yalmokas has resigned as Bank of America Corp's head of prime brokerage in the Americas to lead an equity financing business at Royal Bank of Canada  a person familiar with the move said on Wednesday.",
        "date": "06142017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-MOVES-Bank of America prime brokerage executive jumps to RBC "
    },
    {
        "content": "* Bank of America Corp - Credit card charge-off rate was 2.77 percent in May versus 2.70 percent in April",
        "date": "06152017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-BofA credit card charge-off and delinquency rate for May "
    },
    {
        "content": "NEW YORK  June 14 Jonathan Yalmokas has resigned as Bank of America Corp's head of prime brokerage in the Americas to lead an equity financing business at Royal Bank of Canada  a person familiar with the move said on Wednesday.",
        "date": "06142017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-Bank of America prime brokerage executive jumps to RBC "
    },
    {
        "content": "June 14 Bank of America Corp. sees room to grow in  international cash management  a low margin business that can lead to lots of other revenue opportunities with corporate clients  COO Tom Montag said at an industry conference Wednesday.",
        "date": "06142017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America targets growth in international cash management "
    },
    {
        "content": "June 14 Bank of America Corp sees continued room to grow in  international cash management  a low margin business that can lead to lots of other revenue opportunities with corporate clients  Chief Operating Officer Tom Montag said at an industry conference on Wednesday.",
        "date": "06142017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Bank of America targets growth in international cash management "
    },
    {
        "content": "* Wells fargo selects Andrew Rowe to lead community banking customer segments team",
        "date": "06132017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Wells Fargo names Andrew Rowe head of Wells Fargo’s Community Banking Customer Segments team "
    },
    {
        "content": "May 31 Bank of America Corp second-quarter earnings will be hurt by a drop in trading revenue  lower-than-expected interest rates and the sale or shuttering of certain assets  according to comments from Chief Executive Brian Moynihan on Wednesday.",
        "date": "05312017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America CEO talks down second-quarter expectations "
    },
    {
        "content": "May 31 Shares in U.S. banks tumbled on Wednesday with the S&P 500 bank index hitting its lowest level since early December after JPMorgan Chase and Bank of America Corp warned of revenue weakness in the current quarter.",
        "date": "05312017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "U.S. banks tumble on JPMorgan  BofA warnings of revenue weakness "
    },
    {
        "content": "* Bank of America - expects to complete sale of consumer credit card business in U.K.  MBNA Ltd.  to Lloyds Banking Group on June 1",
        "date": "05312017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America expects to complete sale of consumer credit card business in UK  MBNA Ltd  to Lloyds Banking Group on June 1 "
    },
    {
        "content": "A federal appeals court on Wednesday revived a former Bank of America executive's defamation and blacklisting claims against the bank for reporting her to a company that maintains a database for financial institutions of workers terminated for causing financial loss.",
        "date": "05172017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "9th Circuit revives former Bank of America exec's blacklisting lawsuit "
    },
    {
        "content": "LONDON  May 18 Bank of America Merrill Lynch has reorganised its energy  power and mining investment banking teams  combining them under the leadership of Julian Mylchreest  according to a memo seen by Reuters on Thursday.",
        "date": "05182017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Bank of America Merrill Lynch combines energy  mining teams - memo "
    },
    {
        "content": "May 18 The head of Bank of America Corp  the United State's fourth-biggest mortgage lender  said on Thursday banks would be able to supply a bigger share of funding for home purchases if the standard down payment for buyers was cut to 10 percent from 20 percent.",
        "date": "05182017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BofA opens debate on lowering mortgage down payments "
    },
    {
        "content": "May 16 Bank of America Merrill Lynch said it hired Lisa Margeson to lead its newly formed retirement client experience and communications group.",
        "date": "05162017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Bank of America Merrill Lynch hires lead for retirement business "
    },
    {
        "content": "* Credit card charge-off rate was 2.70 percent in April versus 3.06 percent in March",
        "date": "05152017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America says credit card charge-off rate was 2.70 pct in April vs. 3.06 pct in March "
    },
    {
        "content": "HONG KONG  May 12 Bank of America Merrill Lynch Corp's Asia Pacific head of mergers and acquisitions  Stephen Gore  plans to leave after a five-year stint at the Wall Street bank  a person with knowledge of the matter said on Friday.",
        "date": "05122017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Bank of America Asia Pacific M&A head plans to leave - source "
    },
    {
        "content": "NEW YORK  May 11 Bank of America Corp's brokerage  Merrill Lynch  said on  Thursday it will roll out a commissions-paying retirement account compatible with a new U.S. Labor Department regulation that raises the standards for client care.",
        "date": "05122017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America's Merrill Lynch to debut fiduciary-friendly account option "
    },
    {
        "content": "May 3 Credit Suisse Group AG has hired Matt Walsh as a managing director and co-head of its technology  media & telecom (TMT) equity capital markets (ECM) group  according to an internal memo seen by Reuters and confirmed by a spokesman on Wednesday.",
        "date": "05032017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Credit Suisse hires IPO banker Walsh from Bank of America "
    },
    {
        "content": "A U.S. banking regulator has more than doubled its claim against Bank of America Corp in a dispute over deposit insurance and interest  according to a securities filing on Tuesday.",
        "date": "05032017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "FDIC boosts claim against Bank of America in payment dispute "
    },
    {
        "content": "A U.S. banking regulator has more than doubled its claim against Bank of America Corp  in a dispute over deposit insurance and interest  according to a securities filing on Tuesday.",
        "date": "05022017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "FDIC boosts claim against Bank of America in payment dispute "
    },
    {
        "content": "May 2 A U.S. banking regulator has more than doubled its claim against Bank of America Corp in a dispute over deposit insurance and interest  according to a securities filing on Tuesday.",
        "date": "05022017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-FDIC boosts claim against Bank of America in payment dispute "
    },
    {
        "content": "May 2 A U.S. banking regulator has increased its claim against Bank of America Corp by $583 million in a dispute over deposit insurance and interest  the second-largest U.S. bank disclosed on Tuesday in its first-quarter financial filing.",
        "date": "05022017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "FDIC increases claim against Bank of America in payment dispute "
    },
    {
        "content": "NEW YORK  May 2 At an annual gathering of the world's most powerful thinkers and trendsetters in Beverly Hills this week  business leaders and major investors said they have gotten used to dismissing most things that President Donald Trump says or tweets.",
        "date": "05022017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Wall Street elite find it hard to bank on Trump's breakup talk "
    },
    {
        "content": "LONDON  April 26 Charles Wickham has left Bank of America Merrill Lynch where he was co-head of Europe  Middle East and Africa (EMEA) loan capital markets.",
        "date": "04262017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Wickham leaves Bank of America Merrill Lynch "
    },
    {
        "content": "Bank of America has agreed to pay $1 million to settle 24-year-old allegations that it systematically denied entry level jobs to black applicants  the U.S. Labor Department announced on Monday.",
        "date": "04172017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America to pay $1 mln to settle racially biased hiring allegations "
    },
    {
        "content": "* Credit card charge-off rate was 3.06 percent in March versus 2.40 percent in February",
        "date": "04172017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America says credit card charge-off rate was 3.06 percent in March "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 19 (Fitch) Bank of America Corporation's (BAC) first quarter 2017 (1Q17) earnings continued to show improvement. Reported net income of $4.86 billion in 1Q17 increased 3.4% inclusive of annual compensation accruals from the sequential quarter and 39.8% from the weaker year-ago quarter. The improvements were broad based  with each of the company's business segments generating positive operating leverage on a year-over-year",
        "date": "04192017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Fitch: Bank of America's Earnings Continue to Improve "
    },
    {
        "content": "NEW YORK Bank of America's  wealth business reported revenue climbed 3 percent to $4.6 billion in the first quarter this year from last year on higher client assets under management and fees  Bank of America Chief Financial Officer Paul Donofrio said Tuesday.",
        "date": "04182017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America's wealth revenue rises on assets under management  fees "
    },
    {
        "content": "NEW YORK  April 18 Bank of America's wealth business reported revenue climbed 3 percent to $4.6 billion in the first quarter this year from last year on higher client assets under management and fees  Bank of America Chief Financial Officer Paul Donofrio said Tuesday.",
        "date": "04182017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-Bank of America's wealth revenue rises on assets under management  fees "
    },
    {
        "content": "NEW YORK  April 18 Bank of America's wealth business reported revenue climbed 3 percent to $4.6 billion in the first quarter this year from last year on higher client assets under management and fees  Bank of America Chief Financial Officer Paul Donofrio said Tuesday.",
        "date": "04182017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America's wealth revenue surges on assets under management  fees "
    },
    {
        "content": "* Said on Thursday under the leadership of Bank of America Merrill Lynch  company had signed a syndicated loan agreement with 14 international banks amounting to $375.0 million  broken down as $136.0 million and 225.1 million euros ($238.92 million)",
        "date": "04142017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Ulker Biskuvi secures $375.0 million equivalent syndication loan "
    },
    {
        "content": "* Bank of America reports Q1-17 net income of $4.9 billion  EPS of $0.41",
        "date": "04182017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America posts Q1 EPS of $0.41 "
    },
    {
        "content": "Please click on the link below for Bank of America's quarterly earnings press release: Source text:",
        "date": "04182017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America quarterly results press release "
    },
    {
        "content": "SAO PAULO  April 13 Bank of America Merrill Lynch tapped Eduardo Alcalay  currently the head of private equity at GP Investimentos Ltda  as its new Brazil chief executive officer  the bank said in a statement on Thursday.",
        "date": "04132017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America Merrill Lynch taps Alcalay as new Brazil CEO "
    },
    {
        "content": "A federal judge in San Diego has allowed Bank of America to seek an immediate appeal of a ruling that fees it charges when customers leave their bank accounts overdrawn for several days may constitute unlawful interest.",
        "date": "04122017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Judge lets Bank of America appeal decision on overdraft fees "
    },
    {
        "content": "* Says co's stock will be delisted from Tokyo Stock Exchange (TSE) on May 1",
        "date": "03302017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America to be delisted from TSE on May 1 "
    },
    {
        "content": "LONDON  March 27 (IFR) - Three senior debt capital markets bankers at Bank of America Merrill Lynch are expected to leave the US bank in the coming weeks  according to multiple sources.",
        "date": "03272017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Senior debt bankers to leave Bank of America Merrill Lynch "
    },
    {
        "content": "NEW YORK Bank of America's  Merrill Lynch cut its number of national business divisions to six from 10 and changed some of the executives leading those units as part of a broader leadership restructuring  according to a memo sent to employees on Wednesday.",
        "date": "03292017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Merrill Lynch restructures national business regions  leadership "
    },
    {
        "content": "* Says co submits application on March 23 for delisting from Tokyo Stock Exchange",
        "date": "03232017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America submits application for delisting from TSE "
    },
    {
        "content": "March 21 U.S. organic food delivery service Sun Basket has hired banks for an initial public offering (IPO) that could come in the second half of the year  sources familiar with the situation said on Tuesday.",
        "date": "03222017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "U.S. food delivery service Sun Basket hires banks for IPO - sources "
    },
    {
        "content": "* Sonoco Products Co - on March 13  2017  co entered into a three-year  $150 million term loan facility with Bank of America - SEC filing",
        "date": "03162017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Sonoco Products Co entered into a three-year  $150 million term loan facility with Bank of America "
    },
    {
        "content": "March 21 Shares in U.S. banks tumbled on Tuesday as investors shrunk back from a post-election rally on worries that President Donald Trump would not be able to live up to his promises for large-scale relief on tax and regulation.",
        "date": "03212017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "U.S. bank stocks fall as investor hope wanes for policy boosts "
    },
    {
        "content": "March 20 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "03202017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Bank Of America  Alcentra Group  Crestline Investors "
    },
    {
        "content": "NEW YORK  March 15 Bank of America Corp Chairman and Chief Executive Brian Moynihan will once again face a shareholder vote on whether he should maintain both roles  according to the bank's proxy filing on Wednesday.",
        "date": "03152017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America shareholders revive chairman debate "
    },
    {
        "content": "March 20 Bank of America Corp has hired Eric Bischof from Morgan Stanley to co-head its global Financial Institutions Group (FIG)  according to an internal memo seen by Reuters.",
        "date": "03202017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-Bank of America hires Bischof from Morgan Stanley to co-head unit "
    },
    {
        "content": "NEW YORK  March 15 Bank of America Corp Chairman and Chief Executive Brian Moynihan will once again face a shareholder vote on whether he should maintain both roles  according to the bank's proxy filing on Wednesday.",
        "date": "03152017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-Bank of America shareholders revive chairman debate "
    },
    {
        "content": "SAO PAULO Brazil's BRF SA is analyzing other options instead of an initial public offering for halal food unit One Foods Holdings Ltd   and has engaged in talks for a private stake sale to sovereign wealth and buyout funds  four people familiar with the plan said on Wednesday.",
        "date": "03152017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Exclusive: Brazil's BRF mulls options to halal unit IPO - sources "
    },
    {
        "content": "* Bank Of America Corp - CEO Brian Moynihan's FY 2016 total compensation $15.9 million versus $13.8 million in FY 2015 - sec filing",
        "date": "03152017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank Of America CEO Brian Moynihan's FY 2016 total compensation $15.9 mln "
    },
    {
        "content": "* Credit card delinquency rate was 1.63 percent at February end versus 1.60 percent at January end - SEC filing",
        "date": "03152017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America's credit card delinquency rate was 1.63 pct at Feb end "
    },
    {
        "content": "NEW YORK  March 14 Bank of America Corp Vice Chairman Gary Lynch will retire on April 1  the lender's chief executive told employees on Tuesday in a memo seen by Reuters.",
        "date": "03142017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Bank of America's Vice Chairman Lynch to retire "
    },
    {
        "content": "FRANKFURT Dublin is Bank of America's  default option for a new base within the European Union once Britain leaves the bloc  but other centers are on the table and no decision has yet been made  an executive said in Germany on Tuesday.",
        "date": "03142017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BofA exec says Dublin 'default' Brexit option but no decision yet "
    },
    {
        "content": "FRANKFURT  March 14 Dublin is Bank of America's  default option for a new base within the European Union once Britain leaves the bloc  but other centres are on the table and no decision has yet been made  an executive said in Germany on Tuesday.",
        "date": "03142017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BofA exec says Dublin \"default\" Brexit option but no decision yet "
    },
    {
        "content": "March 10 Bank of America Corp has appointed Ricardo Fernandez Rebolledo as the head of its investment banking business in Mexico  according to an internal memo seen by Reuters on Friday.",
        "date": "03102017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Bank of America appoints new head of Mexico investment banking "
    },
    {
        "content": "March 10 Bank of America Corp has appointed Jim Cooney as head of its Americas Equity Capital Markets(ECM) business  according to an internal memo seen by Reuters.",
        "date": "03102017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-Bank of America appoints Jim Cooney Head of Americas ECM -memo "
    },
    {
        "content": "SAO PAULO  March 7 Brazil's National Treasury has mandated the investment-banking units of Citigroup Inc  Bank of America Corp and BNP Paribas SA to manage the reopening of the 6 percent dollar-denominated bond maturing in April 2026   taking advantage of robust demand for the country's assets.",
        "date": "03072017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Brazil hires Citigroup  BofA  BNP for reopening of 2026 bond "
    },
    {
        "content": "Feb 25 Warren Buffett said on Saturday he plans to stick with the shrewd bet that his Berkshire Hathaway Inc  made on Bank of America Corp  but might eventually swap the preferred stock that Berkshire owns into common stock.",
        "date": "02252017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Buffett mulls change to canny Bank of America stake if dividend rises "
    },
    {
        "content": "* Says it decides to apply for delisting from Tokyo Stock Exchange (TSE)",
        "date": "02242017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America decides to delist from TSE "
    },
    {
        "content": "* On February 22  2017  Parexel International entered into a supplier receivables purchase agreement with Bank of America",
        "date": "02232017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Parexel International enters into a supplier receivables purchase agreement with BofA "
    },
    {
        "content": "* Bank of America says at Dec 31  2016  total liabilities were about $1.9 trillion  up $32.8 billion from Dec 31  2015 - SEC filing",
        "date": "02232017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-BofA says total liabilities were about $1.9 trillion at end of Dec 2016 "
    },
    {
        "content": "NEW YORK Bank of America Corp's  board awarded Chief Executive Officer Brian Moynihan $20 million for his work last year  the largest pay package he has received since taking the helm of the bank in the aftermath of the 2008 financial crisis.",
        "date": "02172017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America CEO Moynihan gets biggest payday yet "
    },
    {
        "content": "NEW YORK  Feb 17 Bank of America Corp's board awarded Chief Executive Officer Brian Moynihan $20 million for his work last year  the largest pay package he has received since taking the helm of the bank in the aftermath of the 2008 financial crisis.",
        "date": "02172017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-Bank of America CEO Moynihan gets biggest payday yet "
    },
    {
        "content": "NEW YORK  Feb 17 Bank of America Corp raised Chief Executive Officer and Chairman Brian Moynihan's compensation by 25 percent in 2016 after the second-largest U.S. bank grew profits by 13 percent.",
        "date": "02172017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America CEO Moynihan awarded $20 million for 2016 "
    },
    {
        "content": "* Credit card charge-off rate was 2.51 percent in January versus. 2.54 percent in December",
        "date": "02152017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America Corp says credit card charge-off rate was 2.51 percent in January "
    },
    {
        "content": "* Third Point Llc dissolves share stake in Allergan Plc - SEC Filing",
        "date": "02102017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Third Point LLC takes share stake in JPMorgan  Bank of America - SEC Filing "
    },
    {
        "content": "Bank of America Corp has opened three completely automated branches over the past month  where customers can use ATMs and have video conferences with employees at other branches  according to spokeswoman Anne Pace.",
        "date": "02072017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America opens branches without employees "
    },
    {
        "content": "Feb 7 Bank of America Corp has opened three completely automated branches over the past month  where customers can use ATMs and have video conferences with employees at other branches  according to spokeswoman Anne Pace.",
        "date": "02072017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-Bank of America opens branches without employees "
    },
    {
        "content": "Feb 7 Bank of America Corp will open 50 to 60 new branches over the next year  Dean Athanasia  co-head of its consumer banking unit  said during a question and answer session Tuesday at a conference hosted by Credit Suisse.",
        "date": "02072017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America to open 50 to 60 branches over the next year "
    },
    {
        "content": "Bank of America Corp will more clearly disclose the fees it charges clients of its Merrill Lynch wealth management business  according to a statement from bank spokeswoman Susan McCabe.",
        "date": "02012017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America to disclose client brokerage fees more clearly "
    },
    {
        "content": "SAO PAULO  Jan 30 France's Carrefour SA  aims to price the initial public offering of its fast-growing Brazilian unit as early as the second quarter  two people with direct knowledge of the plan said on Monday  a sign demand for new equity offerings in Latin America's No. 1 economy is gaining traction rapidly.",
        "date": "01302017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Carrefour seeks Brazil unit IPO in second quarter  sources say "
    },
    {
        "content": "Jan 31 Bank of America Corp will more clearly disclose the fees it charges clients of its Merrill Lynch wealth management business  according to a statement from bank spokeswoman Susan McCabe.",
        "date": "01312017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America to disclose client brokerage fees more clearly "
    },
    {
        "content": "NEW YORK Raymond James Financial is rolling out a new digital platform with robo-adviser-like technology this year  the St. Petersburg  Florida-based firm said on Monday.",
        "date": "01312017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Raymond James to roll out robo-adviser in 2017 "
    },
    {
        "content": "* REVOLUTION LIGHTING TECHNOLOGIES AMENDS AND EXTENDS LOAN AND SECURITY AGREEMENT WITH BANK OF AMERICA",
        "date": "01262017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-REVOLUTION LIGHTING TECHNOLOGIES AMENDS AND EXTENDS LOAN AND SECURITY AGREEMENT WITH BANK OF AMERICA "
    },
    {
        "content": "* Credit Card 60+ day delinquency rate was 1.56 percent at Dec-end versus 1.58 percent at Nov-end - SEC filing",
        "date": "01172017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America's credit card charge-off rate was 2.54 pct in December "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 13 (Fitch) Bank of America's (BAC) fourth quarter 2016 (4Q16)  showed some improvement  according to Fitch Ratings. Reported net income to  common shareholders equity was seasonally down only 2.63% from the sequential  quarter and grew 46.75% from the year-ago quarter  weaker year-ago quarter. On a  full-year basis  BAC's 2016 reported net income to common shareholders equity  grew to $16.2 billion  a 13.04% increase fr",
        "date": "01132017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Fitch: Bank of America's Earnings Show Improvement "
    },
    {
        "content": "Bank of America Corp  reported a near-50-percent jump in fourth-quarter profit on Friday due to cost cuts and higher trading revenue  and its finance chief forecast sturdy income growth ahead thanks to rising interest rates.",
        "date": "01132017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America profits surge on cost cuts  trading gains "
    },
    {
        "content": "Jan 13 Bank of America Corp reported a near-50-percent jump in fourth-quarter profit on Friday due to cost cuts and higher trading revenue  and its finance chief forecast sturdy income growth ahead thanks to rising interest rates.",
        "date": "01132017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-Bank of America profits surge on cost cuts  trading gains "
    },
    {
        "content": "Jan 13 Bank of America Corp reported a 46.8 percent rise in quarterly profit on Friday  kicking off what is expected to be a strong period for U.S. banks following an upswing in market activity in the wake of the U.S. presidential election.",
        "date": "01132017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BofA's profit rises 46.8 pct as Trump's victory spurs trading "
    },
    {
        "content": "Please click on the link below for Bank of America's earnings presentation:  Source text:",
        "date": "01132017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America earnings presentation "
    },
    {
        "content": "* Bank of America reports Q4-16 net income of $4.7 billion  EPS of $0.40",
        "date": "01132017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America reports Q4 EPS of $0.40 "
    },
    {
        "content": "Please click on the link below for Bank of America's fourth-quarter earnings press release:  Source text: (http://bit.ly/2j7Aisq)",
        "date": "01132017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America Q4 results press release "
    },
    {
        "content": "The U.S. Federal Deposit Insurance Corporation sued Bank of America Corp  over $542 million in deposit insurance which it says the second-largest U.S. bank \"refuses to pay \" according to a complaint filed Monday in a U.S. district court.",
        "date": "01092017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "FDIC sues Bank of America over payment dispute "
    },
    {
        "content": "WASHINGTON Jan 9 A banking regulator on Monday sued Bank of America Corp over $542 million in deposit insurance that it said the second-largest U.S. bank \"refuses to pay.\"",
        "date": "01092017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-U.S. regulator sues Bank of America over payment dispute "
    },
    {
        "content": "Jan 9 The U.S. Federal Deposit Insurance Corporation sued Bank of America Corp over $542 million in deposit insurance which it says the second-largest U.S. bank \"refuses to pay \" according to a complaint filed Monday in a U.S. district court.",
        "date": "01092017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "U.S. FDIC sues Bank of America over payment dispute "
    },
    {
        "content": "WASHINGTON The U.S. Department of Housing and Urban Development (HUD) filed charges on Friday against Bank of America and two of its employees  saying they wrongfully discriminated against prospective Hispanic mortgage borrowers in South Carolina.",
        "date": "01062017",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "U.S. housing regulator accuses Bank of America of bias in lending "
    },
    {
        "content": "WASHINGTON  Jan 6 The U.S. Department of Housing and Urban Development (HUD) filed charges on Friday against Bank of America and two of its employees  saying they wrongfully discriminated against prospective Hispanic mortgage borrowers in South Carolina.",
        "date": "01062017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-U.S. housing regulator accuses Bank of America of bias in lending "
    },
    {
        "content": "SAO PAULO Brazilian food exporter BRF SA is seeking to raise about $1.5 billion from the sale of a 20 percent stake of a unit focused on the halal processed food market via an initial public offering  two people with direct knowledge of the plan said on Thursday.",
        "date": "01052017",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Exclusive: BRF sees $1.5 billion Halal unit IPO by late March - sources "
    },
    {
        "content": "NEW YORK  Nov 29 It may be more than a decade before banks see substantial benefits from investments they are now making in new payments technologies  Bank of America Corp  Chief Executive Brian Moynihan said on Tuesday.",
        "date": "11292016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America CEO sees long road ahead for payments technology payoff "
    },
    {
        "content": "NEW YORK  Nov 15 Bank of America Corp is on track to report better fourth-quarter trading revenue because of higher volumes around the U.S. presidential election  Chief Operating Officer Tom Montag said on Tuesday.",
        "date": "11152016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America's Montag sees trading boost  cost saves from Trump win "
    },
    {
        "content": "Wells Fargo & Co is set to announce a partnership with SigFig for clients to use the robo-adviser's technology and wealth management investment tools.",
        "date": "11152016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Exclusive: Wells Fargo to unveil robo-adviser partnership with SigFig "
    },
    {
        "content": "LONDON  Nov 11 Bank of America Merrill Lynch (BAML) on Friday downgraded its rating on European miners to \"neutral\" saying that a recent strong rally had made the sector \"overbought\".",
        "date": "11112016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BAML downgrades European miners to \"neutral\"  upgrades tech sector "
    },
    {
        "content": "* Bank of America Corp - Credit card delinquency rate 1.55 percent at October end versus 1.51 percent at September end - SEC filing",
        "date": "11152016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-BofA credit card delinquency and charge-off rate for October "
    },
    {
        "content": "WASHINGTON  Nov 8 The U.S. Supreme Court on Tuesday indicated it could allow Miami to pursue lawsuits accusing major banks of predatory mortgage lending to black and Hispanic home buyers resulting in loan defaults that drove down city tax revenues and property values.",
        "date": "11082016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-U.S. justices could allow Miami to sue banks over lending bias "
    },
    {
        "content": "The U.S. Supreme Court on Tuesday indicated it could allow Miami to pursue lawsuits accusing major banks of predatory mortgage lending to black and Hispanic home buyers resulting in loan defaults that drove down city tax revenues and property values.",
        "date": "11082016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "U.S. justices could allow Miami to sue banks over lending bias "
    },
    {
        "content": "NEW YORK  Nov 4 Bank of America Corp has been hit with a proposed class action accusing it of charging exorbitant fees to thousands of former Arizona prison inmates who were issued debit cards when they were released.",
        "date": "11042016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America accused of gouging ex-inmates with card fees "
    },
    {
        "content": "Oct 27 Bank of America on Thursday named Karin Kimbrough as head of investment strategy for Merrill Lynch Wealth Management.",
        "date": "10272016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "CORRECTED-MOVES-BofA names Merrill Lynch investment strategy chief "
    },
    {
        "content": "* Board of directors declared a regular quarterly cash dividend on bank of america common stock of $0.075 per share",
        "date": "10272016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America declares quarterly dividend of $0.075/share "
    },
    {
        "content": "* Says it plans to inject capital of $5 million into its Mexico-based motor parts sale sub-subsidiary TECHNO ASSOCIE DE MEXICO S.A.DE C.V.  in Nov.  due to increased demand in Mexico",
        "date": "10282016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Techno Associe to inject $5 mln capital to Mexico-based unit "
    },
    {
        "content": "Oct 19 In the latest apparent spoof on a U.S. securities regulator's online filing system  a Chicago-area artist with a fondness for inspirational quotes claimed to have acquired about $88 billion worth of Bank of America Corp  shares on Wednesday.",
        "date": "10192016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Apparent fake filing says artist bought $88 bln of Bank of America stock "
    },
    {
        "content": "Morgan Stanley reported a better-than-expected profit on Wednesday  boosted by a surge in bond trading that helped all Wall Street banks last quarter. | Video ",
        "date": "10192016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Morgan Stanley profit jumps on bond-trading comeback "
    },
    {
        "content": "Oct 19 Morgan Stanley reported a better-than-expected profit on Wednesday  boosted by a surge in bond trading that helped all Wall Street banks last quarter.",
        "date": "10192016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 4-Morgan Stanley profit jumps on bond-trading comeback "
    },
    {
        "content": "SAO PAULO  Oct 19 Cia Energética de Minas Gerais SA  Brazil's no. 3 power utility  and an investiment vehicle will raise up to 1.29 billion reais ($405 million) with the sale of a stake in Transmissora Aliança de Energia Elétrica SA  according to a securities filing.",
        "date": "10192016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Brazil's Cemig  FIP Coliseu to raise up to $405 mln with Taesa stake sale "
    },
    {
        "content": "Oct 16 Mentor Graphics Corp  a company that makes software for designing semiconductors  is working with Bank of America Corp to explore strategic alternatives  including a potential sale  according to people familiar with the matter.",
        "date": "10162016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Mentor Graphics working with Bank of America to explore sale-sources "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 17 (Fitch) Bank of America's (BAC) third quarter 2016 (3Q16)  earnings improved relative to both the sequential and year-ago periods due to  improvements across all of its businesses but particularly in the Global Markets  businesses  according to Fitch Ratings.  BAC's overall return on average assets (ROA) was 0.90%  up 2 basis points (bps)  from the sequential quarter and 6 bps from the year-ago quarter.  The company'",
        "date": "10172016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Fitch: Improved Markets Results Drive Bank of America's Better 3Q16 Earnings "
    },
    {
        "content": "Bank of America Corp   the second-largest U.S. bank by assets  reported its first profit increase in three quarters on Monday  foiling expectations for another drop  as bond trading surged and expenses fell. | Video ",
        "date": "10172016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America profit rises on bond trading  cost cuts "
    },
    {
        "content": "* Bank of America reports Q3-16 net income of $5.0 billion  EPS of $0.41",
        "date": "10172016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America Q3 EPS $0.41 "
    },
    {
        "content": "Oct 17 Bank of America Corp  the second-largest U.S. bank by assets  reported its first rise in profit in three quarters on Monday  boosted by strong results from bond trading.",
        "date": "10172016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America profit rises 6.6 pct as bond trading picks up "
    },
    {
        "content": "CONCORD  N.C. -- Jimmie Johnson claimed his third win of the 2016 NASCAR Sprint Cup Series season  but his first since winning at Auto Club Speedway in Fontana  Calif.  in March  with his victory in the Bank of America 500 at Charlotte Motor Speedway on Sunday.",
        "date": "10092016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Johnson dominates rain-delayed Bank of America 500 "
    },
    {
        "content": "Andy Sieg will be the next head of Bank of America Corp's  wealth management unit at the end of the year  when John Thiel steps down  the bank said on Thursday.",
        "date": "10062016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America names Sieg as new wealth management head "
    },
    {
        "content": "Oct 6 Andy Sieg will be the next head of Bank of America Corp's wealth management unit at the end of the year  when John Thiel steps down  the bank said on Thursday.",
        "date": "10062016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-Bank of America names Sieg as new wealth management head "
    },
    {
        "content": "* Bank Of America announces Merrill Lynch Wealth Management leadership changes",
        "date": "10062016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank Of America says Merrill Lynch Wealth Management head John Thiel to step down "
    },
    {
        "content": "WASHINGTON/NEW YORK  Sept 29 U.S. lawmakers called on Thursday for Wells Fargo & Co chief John Stumpf to resign and a top House Democrat demanded the bank be broken up because it is too big to manage.",
        "date": "09292016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 6-U.S. House panel lambastes Wells Fargo boss over phantom accounts "
    },
    {
        "content": "Sept 26 Bank of America Corp agreed to pay a $12.5 million fine to settle U.S. regulatory charges that its Merrill Lynch unit's controls failed to prevent erroneous trading orders  causing \"mini-flash crashes\" in companies' stocks.",
        "date": "09262016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BofA to pay $12.5 mln SEC fine for causing 'mini-flash crashes' "
    },
    {
        "content": "HONG KONG Bank of America's head of South Korea investment banking Peter Kim is leaving the bank  IFR reported  citing people with knowledge of the matter  as part of the U.S. bank's move to cut some investment banking jobs in Asia.",
        "date": "09282016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America senior South Korea  Australia bankers to leave: IFR "
    },
    {
        "content": "SINGAPORE/HONG KONG  Sept 26 Bank of America  is set to cut about two dozen investment banking (IB) jobs in Asia  including some top dealmakers starting this week  according to people familiar with the matter.",
        "date": "09262016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America set to cut about two dozen Asia investment banking jobs-sources "
    },
    {
        "content": "HONG KONG  Sept 28 Bank of America's  head of South Korea investment banking Peter Kim is leaving the bank  IFR reported  citing people with knowledge of the matter  as part of the U.S. bank's move to cut some investment banking jobs in Asia.",
        "date": "09282016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America senior S.Korea  Australia bankers to leave - IFR "
    },
    {
        "content": "* Plans to eliminate about dozen senior positions at its corporate and investment banking operations in Asia - Bloomberg  citing sources",
        "date": "09262016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America  plans to eliminate about dozen senior positions at its corporate and investment banking operations in Asia - Bloomberg  citing sources "
    },
    {
        "content": "Sept 20 Todd Combs  one of Warren Buffett's stockpicking deputies at Berkshire Hathaway Inc  has joined the board of JPMorgan Chase & Co  expanding the conglomerate's already deep ties to the financial services industry.",
        "date": "09202016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Buffett investing deputy Combs joins JPMorgan board "
    },
    {
        "content": "Sept 15 Bank of America Corp's Merrill Lynch hired three financial advisers from UBS Group AG  for its Manhattan East complex.",
        "date": "09152016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-BofA Merrill Lynch hires three advisers from UBS "
    },
    {
        "content": "* Credit Suisse acting with Bank Of America Merrill Lynch as lead financial advisors and structuring banks to Bayer in addition to providing committed financing for the Bayer/Monsanto deal    (Reporting by Zurich Newsroom)",
        "date": "09142016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Credit Suisse  Bank Of America lead financial advisors to Bayer in Monsanto deal "
    },
    {
        "content": "Sept 12 Bank of America Corp. is on track to post higher third quarter revenues in its investment banking business compared to the second quarter  the head of the unit said at an industry event Monday.",
        "date": "09122016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America investment banking on track for improvement in third quarter "
    },
    {
        "content": "NEW YORK  Sept 8 Former Merrill Lynch advisers who were fired after Bank of America merged with the brokerage in 2008 won back some of the deferred compensation on which they had missed out  according to a settlement filed this week in a North Carolina district court.",
        "date": "09082016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America agrees to pay ex-Merrill Lynch brokers $12.8 mln "
    },
    {
        "content": "NEW YORK Former Merrill Lynch advisers who were fired after Bank of America merged with the brokerage in 2008 won back some of the deferred compensation on which they had missed out  according to a settlement filed this week in a North Carolina district court.",
        "date": "09082016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America agrees to pay ex-Merrill Lynch brokers $12.8 million "
    },
    {
        "content": "* Bank Of America CEO Brian Moynihan on CNBC - Prepared for any rate scenario",
        "date": "09082016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank Of America CEO Moynihan on CNBC - Prepared for any rate scenario "
    },
    {
        "content": "LONDON  Aug 31 Bank of America Merrill Lynch has appointed Philippe Chryssicopoulos as its head of power  utilities and renewables investment banking for Europe  Middle East and Africa  according to a memo seen by Reuters.",
        "date": "08312016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-BAML names Chryssicopoulos EMEA power  utilities and renewables head "
    },
    {
        "content": "Aug 24 PharMerica Corp  a U.S. pharmacy manager for long-term care facilities  is exploring strategic alternatives including a potential sale  according to people familiar with the matter.",
        "date": "08242016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Pharmacy manager PharMerica explores possible sale -sources "
    },
    {
        "content": "Aug 24 PharMerica Corp  a U.S. pharmacy manager for long-term care facilities  is exploring strategic alternatives  including a potential sale  according to people familiar with the matter.",
        "date": "08242016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Specialty pharmacy PharMerica explores possible sale -sources "
    },
    {
        "content": "* Team Inc says  on August 17 co entered into certain third amendment to credit agreement with Bank Of America",
        "date": "08232016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Team Inc enters into certain third amendment to credit agreement with Bank Of America "
    },
    {
        "content": "NEW YORK  Aug 22 A U.S. appeals court on Monday refused to reconsider its decision to overturn a $1.27 billion penalty against Bank of America Corp and a jury verdict finding it liable for mortgage fraud leading up to the 2008 financial crisis.",
        "date": "08222016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "U.S. appeals court declines to reconsider Bank of America ruling "
    },
    {
        "content": "NEW YORK  Aug 22 A U.S. appeals court refused on Monday to reconsider its decision to overturn a $1.27 billion penalty against Bank of America Corp and a jury verdict finding it liable for mortgage fraud leading up to the 2008 financial crisis.",
        "date": "08222016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-U.S. appeals court declines to reconsider Bank of America ruling "
    },
    {
        "content": "Bank of America and a Colorado outsourcing firm will have to face a lawsuit accusing them of sabotaging homeowners' efforts to modify their mortgages  a federal appeals court has ruled.",
        "date": "08162016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "10th Circuit revives racketeering claims against Bank of America "
    },
    {
        "content": "* Change In Holdings Are As Of June 30  2016 And Compared With The Previous Quarter Ended As Of March 31  2016",
        "date": "08152016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Soros Fund Management takes stake in Bank of America  General Motors "
    },
    {
        "content": "* Bank of America Corp - Credit card delinquency rate 1.48 percent at July end versus 1.49 percent at June end - SEC filing",
        "date": "08152016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-BofA credit card delinquency and net-charge off rates for July "
    },
    {
        "content": "* Says Dissolves Class A Share Stake In Facebook Inc - Sec Filing",
        "date": "08122016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Appaloosa LP dissolves stake in Valeant  Bank Of America "
    },
    {
        "content": "SAO PAULO  Aug 11 Carlyle Group LP and Brazilian investor Guilherme Paulus raised a combined 1.230 billion reais ($394 million) from the partial sale of their stakes in Brazilian travel agency CVC Brasil Operadora SA  a sign investors are slowly returning to Latin America's largest equity market.",
        "date": "08112016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Carlyle  founder raise $394 mln in partial exit from Brazil's CVC "
    },
    {
        "content": "HONG KONG  Aug 11 The British banker accused of murdering of two women  one found in a suitcase on the balcony of his luxury Hong Kong apartment and the other inside with neck and buttock wounds  attended a pre-trial hearing on Thursday ahead of his October trial.",
        "date": "08112016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "British banker attends pre-trial hearing over HK double murder case "
    },
    {
        "content": "* IVG said to plan $1 billion IPO with Bank Of America  Berenberg- Bloomberg  citing sources",
        "date": "08102016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-IVG said to plan $1 billion IPO with Bank Of America  Berenberg - Bloomberg "
    },
    {
        "content": "HONG KONG  Aug 10 HSBC  and Bank of America Merrill Lynch said on Wednesday they had created the world's first application using blockchain technology to simplify one of the most cumbersome aspects of trade finance.",
        "date": "08102016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "HSBC  BofA apply blockchain to trade finance  seek more partners "
    },
    {
        "content": "NEW YORK  Aug 5 The U.S. government has asked a federal appeals court to reconsider its decision to overturn a $1.27 billion penalty against Bank of America Corp and a jury verdict finding it liable for mortgage fraud leading up to the 2008 financial crisis.",
        "date": "08052016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "U.S. asks appeals court to reconsider Bank of America ruling "
    },
    {
        "content": "LONDON  Aug 5 (IFR) - Bank of America Merrill Lynch said Izumi Devalier is to join the US bank from HSBC as head of Japan Economics.",
        "date": "08052016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-MOVES-BAML hires Devalier as head of Japan economics "
    },
    {
        "content": "* Bank of America Corporation announce 5.24 pct shareholding in Ablynx  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "08042016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America Corporation announce 5.24 pct shareholding in Ablynx "
    },
    {
        "content": "Aug 1 Bank of America Corp said its business  results and operational model could be adversely affected if economic volatility stemming from Britain's vote to exit the European Union continues.",
        "date": "08012016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BofA warns of impact if Brexit uncertainty continues "
    },
    {
        "content": "NEW YORK Big U.S. brokerages are redefining the term \"wealthy\" in their pursuit of ever-richer clients to prop up margins eroded by historically low interest rates and growing regulatory burdens.",
        "date": "07292016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Big U.S. brokerages chase the rich in departure from retail roots "
    },
    {
        "content": "NEW YORK  July 29 Big U.S. brokerages are redefining the term \"wealthy\" in their pursuit of ever-richer clients to prop up margins eroded by historically low interest rates and growing regulatory burdens.",
        "date": "07292016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Big US brokerages chase the rich in departure from retail roots "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 19 (Fitch) Bank of America's (BAC) second quarter 2016 earnings  improved relative to the sequential period due to better market conditions and  continued expense management efforts  according to Fitch Ratings.  BAC's total revenue expanded 4.5% from the sequential quarter but declined 7%  from the year-ago quarter. Overall return on average assets (ROA) was 0.78% in  2Q16  up from 0.50% in the sequential quarter but down ",
        "date": "07192016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Fitch: Bank of America's Earnings Improve in 2Q16 "
    },
    {
        "content": "NEW YORK Bank of America's  wealth unit is losing financial advisers who cannot meet performance targets because their books of business are too small  Chief Executive Brian Moynihan said on Monday.",
        "date": "07182016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America wealth management loses small brokers "
    },
    {
        "content": "NEW YORK  July 18 Bank of America's  wealth unit is losing financial advisers who cannot meet performance targets because their books of business are too small  Chief Executive Brian Moynihan said on Monday.",
        "date": "07182016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Bank of America wealth management loses small brokers "
    },
    {
        "content": "NEW YORK  July 18 Bank of America's  wealth unit is losing financial advisers with small books of business who cannot meet performance targets  Chief Executive Brian Moynihan said on Monday.",
        "date": "07182016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "CORRECTED-Bank of America wealth management loses small brokers "
    },
    {
        "content": "* Says on July 15  2016 entered into an unsecured credit agreement with Bank of America - SEC filing",
        "date": "07182016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-NVR says entered into unsecured credit agreement with Bank of America - SEC filing "
    },
    {
        "content": "NEW YORK  July 15 Just as mortgage bankers were preparing for the end of a historic boom driven by low interest rates  borrowers have begun knocking at their doors again.",
        "date": "07182016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Rate-starved U.S. banks happily gobble mortgage business "
    },
    {
        "content": "* Credit card delinquency rate percent at June-end 1.49 percent versus 1.50 percent at May-end - SEC filing",
        "date": "07152016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America reports credit card delinquency and charge-off rate for June-end "
    },
    {
        "content": "* Bank Of America reports Q2-16 net income of $4.2 billion  EPS of $0.36",
        "date": "07182016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America reports 2nd-qtr EPS of $0.36 "
    },
    {
        "content": "July 18 Bank of America Corp  the second-largest U.S. bank by assets  reported a 19.4 percent fall in quarterly profit on Monday as it set aside more money to cover potential bad loans and earned less on its loans.",
        "date": "07182016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America profit falls 19.4 pct as provisions rise "
    },
    {
        "content": "* Effective April 1  2016  corporation changed its basis of presentation of operations by eliminating legacy assets & servicing segment",
        "date": "07122016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America says corporation changed basis of presentation of operations by eliminating legacy assets & servicing segment  effective April 1 "
    },
    {
        "content": "* Plans to increase quarterly dividend paid on shares of corporation's common stock to $0.075 per share",
        "date": "06292016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America authorized repurchase of $5 bln of common stock "
    },
    {
        "content": "HONG KONG  June 29 Hong Kong's securities regulator has publicly censured two units of Bank of America  for breaches of the city's takeover codes in relation to two transactions last year.",
        "date": "06292016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Hong Kong regulator censures Bank of America units for takeover code breaches "
    },
    {
        "content": "* Says bank units failed to disclose equity swaps in both deals",
        "date": "06292016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Hong Kong regulator censures Bank of America units for takeover code breaches "
    },
    {
        "content": "LONDON Bank of America Merrill Lynch and Goldman Sachs cut their near-term forecasts for sterling to just below current levels on Friday  both saying that further losses after last week's shock Brexit vote may be limited by the end of this year.",
        "date": "06272016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Goldman  Bank of America cut sterling forecasts "
    },
    {
        "content": "June 23 Bank of America Corp said it appointed Michael White as a director to its board  effective immediately.",
        "date": "06232016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America appoints ex-DirecTV CEO to board "
    },
    {
        "content": "* White is recently retired Chairman  President and CEO of DIRECTV  Source text for Eikon:  Further company coverage:",
        "date": "06232016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America board appoints ex-DIRECTV CEO Michael White as new director "
    },
    {
        "content": "LONDON  June 23 Bank of America Merrill Lynch  has appointed former Greenhill co-CEO Luca Ferrari head of mergers and acquisitions (M&A) for Europe  Middle East and Africa (EMEA)  according to a memo sent on Thursday.",
        "date": "06232016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-BAML appoints former Greenhill co-CEO head of EMEA M&A- memo "
    },
    {
        "content": "June 23 Bank of America Corp's Merrill Lynch unit will pay a $10 million penalty to settle charges its offering materials for a risky type of note misled investors  the U.S. Securities and Exchange Commission said on Thursday.",
        "date": "06232016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-BofA's Merrill Lynch unit fined for failing to disclose note fees "
    },
    {
        "content": "June 16 Suncor Energy Inc has launched an auction of its Petro-Canada lubricants division  whose white mineral oils are sprayed on gummy bear candy to make it shiny and prevent sticking  people familiar with the matter said.",
        "date": "06162016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Suncor begins auction of lubricants business -sources "
    },
    {
        "content": "June 16 Suncor Energy Inc has launched an auction of its Petro-Canada lubricants division  whose white mineral oils are sprayed on gummy bear candy to make it shiny and prevent sticking  people familiar with the matter said.",
        "date": "06162016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Suncor begins sale of lubricants business -sources "
    },
    {
        "content": "June 14 Bank of America will continue to increase the number of salespeople as it scales back on support staff  a senior executive said on Tuesday.",
        "date": "06142016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America executive says growth of sales force will continue "
    },
    {
        "content": "* Says credit card delinquency rate 1.50 percent at may end versus 1.55 percent at april end - sec filing",
        "date": "06152016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America reports credit card rates for May "
    },
    {
        "content": "June 9 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "06092016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES- Credit Suisse  Bank Sohar  Bank Of America Merrill Lynch "
    },
    {
        "content": "Bank of America Corp  is on track for mid-single digit revenue growth in its trading businesses in the second quarter from a year ago  according to Chief Executive Officer Brian Moynihan.",
        "date": "06022016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America CEO says trading revenue on track for growth "
    },
    {
        "content": "June 2 Bank of America Corp is on track for mid-single digit revenue growth in its trading businesses in the second quarter from a year ago  according to Chief Executive Officer Brian Moynihan.",
        "date": "06022016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Bank of America CEO says trading revenue on track for growth "
    },
    {
        "content": "June 2 Bank of America Corp is on track for mid-single digit revenue growth in its trading businesses in the second quarter compared to a year ago  according to Chief Executive Brian Moynihan.",
        "date": "06022016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America CEO says trading revenues on track for growth "
    },
    {
        "content": "June 1 Bank of America Corp Chairman and Chief Executive Officer Brian Moynihan on Wednesday played down the impact on the bank if Donald Trump is elected as the next president of the United States.",
        "date": "06022016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Trump presidency? Bank of America CEO Moynihan says company will be fine "
    },
    {
        "content": "May 31 Bank of America Corp's U.S. Trust business  plans to add more than 100 financial advisers who cater to the super-rich as part of its strategy to grow wealth-management revenue  a U.S. Trust executive said on Tuesday.",
        "date": "05312016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America targets wealthiest clients with more advisers "
    },
    {
        "content": "FRANKFURT  May 31 Bank of America has named Marc-Olivier Regulla co-head investment banking for Germany  Austria and Switzerland  alongside Christof Bechtel  the lender said in an internal memo to staff on Tuesday.",
        "date": "05312016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-Bank of America names Regulla co-head investment banking Germany "
    },
    {
        "content": " (This story corrects headline and first paragraph to reflect that foreign exchange was not part of Wednesday's settlements)",
        "date": "05262016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Citigroup to pay $425 million over attempted interest rate manipulation "
    },
    {
        "content": " ",
        "date": "05262016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Citigroup to pay $425 mln over attempted forex  rate manipulation "
    },
    {
        "content": "NEW YORK A U.S. appeals court on Monday threw out a jury's finding that Bank of America Corp was liable for mortgage fraud leading up to the 2008 financial crisis  voiding a $1.27 billion penalty and dealing the U.S. Department of Justice a major setback.",
        "date": "05232016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America $1.27 bln U.S. mortgage penalty is voided "
    },
    {
        "content": "NEW YORK A U.S. appeals court on Monday threw out a jury's finding that Bank of America Corp was liable for mortgage fraud leading up to the 2008 financial crisis  voiding a $1.27 billion penalty and dealing the U.S. Department of Justice a major setback.",
        "date": "05232016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America $1.27 billion U.S. mortgage penalty is voided "
    },
    {
        "content": "NEW YORK  May 23 A U.S. appeals court on Monday threw out a jury's finding that Bank of America Corp was liable for mortgage fraud leading up to the 2008 financial crisis  voiding a $1.27 billion penalty and dealing the U.S. Department of Justice a major setback.",
        "date": "05232016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 4-Bank of America $1.27 bln U.S. mortgage penalty is voided "
    },
    {
        "content": "NEW YORK  May 23 A U.S. appeals court on Monday threw out Bank of America Corp's $1.27 billion penalty in a fraud case over defective mortgages sold by its Countrywide unit  dealing the U.S. Justice Department a major setback.",
        "date": "05232016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "REFILE-Bank of America wins reversal of $1.27 billion penalty in \"Hustle\" case "
    },
    {
        "content": "NEW YORK A senior female fixed-income banker at Bank of America Corp  has filed a lawsuit accusing the bank of underpaying her and other women  and retaliating when she complained about illegal or unethical practices by her colleagues.",
        "date": "05172016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Senior female executive at Bank of America sues over 'bro's club' "
    },
    {
        "content": "NEW YORK A senior female fixed-income banker at Bank of America Corp has filed a lawsuit accusing the bank of underpaying her and other women  and retaliating when she complained about illegal or unethical practices by her colleagues.",
        "date": "05172016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Senior female exec at Bank of America sues over 'bro's club' "
    },
    {
        "content": "* Credit card delinquency rate 1.55 percent at april end versus 1.60 percent at march end - sec filing",
        "date": "05162016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America reports credit card rates for April "
    },
    {
        "content": "NEW YORK  May 17 A senior female fixed-income banker at Bank of America Corp has filed a lawsuit accusing the bank of underpaying her and other women  and retaliating when she complained about illegal or unethical practices by her colleagues.",
        "date": "05172016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Senior female exec at Bank of America sues over 'bro's club' "
    },
    {
        "content": "May 16 UBS Group AG's Americas wealth unit is partnering with online financial advisor SigFig Wealth Management to develop technology and investment tools for the Swiss bank  UBS said on Monday.",
        "date": "05162016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "REFILE-UBS Americas wealth unit partners with robo-adviser SigFig "
    },
    {
        "content": "* Takes share stake in Bank of America Corp of 7 million shares",
        "date": "05132016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Appaloosa LP takes share stake in Bank Of America  Facebook "
    },
    {
        "content": "The Chemetall unit is a global supplier of specialty chemicals used in surface treatment of metals and plastics.",
        "date": "05132016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Albemarle exploring sale of unit worth $3 billion: Bbg "
    },
    {
        "content": "Bank of America will provide research coverage on all of its mutual fund offerings  a move that will require it to get rid of some underperforming and unpopular funds  a company spokesman said on Friday.",
        "date": "05062016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America overhauling mutual fund offerings "
    },
    {
        "content": "A federal judge in Atlanta has dismissed a lawsuit by three Georgia counties accusing Bank of America of mortgage discrimination  saying the local governments did not offer enough specifics to support their claims.",
        "date": "05042016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Georgia counties' discrimination claims against Bank of America tossed "
    },
    {
        "content": "Bank of America Corp  reached a $190 million settlement with a federal home loan bank over four mortgage-related complaints  according to a securities filing on Monday.",
        "date": "05022016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America reaches $190 million mortgage settlement "
    },
    {
        "content": "April 27 Bank of America Corp  shareholders elected all 13 directors nominated by the bank at its annual meeting on Wednesday  while approving compensation for top executives in a non-binding decision.",
        "date": "04272016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BofA shareholders approve pay for top executives "
    },
    {
        "content": "April 28 Bank of America appointed Glenn Koh head of global equities trading  a newly created role  as part of a broad reshuffle.",
        "date": "04282016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-BofA names Glenn Koh head of global equities trading "
    },
    {
        "content": "LONDON  April 25 (IFR) - Bank of America Merrill Lynch has appointed Luigi Rizzo as head of its investment banking in Europe and named a trio of bankers as co-heads of global mergers and acquisitions.",
        "date": "04252016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-BAML names Rizzo head of EMEA investment banking "
    },
    {
        "content": "LONDON  April 25 Bank of America Merrill Lynch  has promoted Luigi Rizzo to head of investment banking for Europe  Middle East and Africa (EMEA)  according to a memo sent on Monday.",
        "date": "04252016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-Bank of America Merrill Lynch promotes Rizzo to head of investment banking EMEA "
    },
    {
        "content": "LONDON Bank of America Merrill Lynch (BAML) said on Tuesday it was turning \"structurally bullish\" on emerging equities  revising its five-year long negative view on the sector.",
        "date": "04192016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Time to turn 'structurally bullish' on emerging stocks: BAML "
    },
    {
        "content": "April 19 Five large U.S. banks cut more than $5 billion from their expenses during the first three months of the year  but it was still not enough to stop the financial bleeding in what was by many measures the worst quarter for Wall Street since the financial crisis.",
        "date": "04192016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Big U.S. banks grapple with costs as they face an ominous 2016 "
    },
    {
        "content": "* Credit card delinquency rate 1.60 percent at march end versus 1.65 percent at february end - sec filing",
        "date": "04152016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America credit card rates for March "
    },
    {
        "content": "* Fitch: Bank of America's Q1 2016 results impacted by energy  capital markets",
        "date": "04152016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Fitch says Bank of America's Q1 results impacted by energy  capital markets "
    },
    {
        "content": "Troubles in the U.S. oil industry amplified profit pressures on Wells Fargo & Co  and Bank of America Corp  on Thursday as rising bad loans added to a tough climate for trading bonds and currencies  along with persistently low interest rates. | Video ",
        "date": "04152016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "No end in sight for energy pain at Wells Fargo  Bank of America "
    },
    {
        "content": "Rick Stoddard has been named Bank of America Corp's new head of global capital commitments  according to a memo seen by Reuters.",
        "date": "04152016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America names new global capital commitments head "
    },
    {
        "content": "April 14 Rick Stoddard has been named Bank of America Corp's new head of global capital commitments  according to a memo seen by Reuters.",
        "date": "04152016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-Bank of America names new global capital commitments head "
    },
    {
        "content": "Troubles in the U.S. oil industry amplified profit pressures on Wells Fargo & Co and Bank of America Corp on Thursday as rising bad loans added to a tough climate for trading bonds and currencies  along with persistently low interest rates.",
        "date": "04142016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "No end in sight for energy pain at Wells Fargo  Bank of America "
    },
    {
        "content": "April 14 Troubles in the U.S. oil industry amplified profit pressures on Wells Fargo & Co and Bank of America Corp on Thursday as rising bad loans added to a tough climate for trading bonds and currencies  along with persistently low interest rates.",
        "date": "04142016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "WRAPUP 1-No end in sight for energy pain at Wells Fargo  Bank of America "
    },
    {
        "content": "* Q1 earnings per share view $0.21 -- Thomson Reuters I/B/E/S  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04142016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America reports Q1 earnings per share of $0.21 "
    },
    {
        "content": "April 14Bank of America Corp  the No. 2 U.S. bank by assets  reported an 18 percent slide in quarterly profit as concerns about a global economic slowdown and uncertainty about the pace of U.S. interest rate increases dampened bond and stock trading.",
        "date": "04142016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America profit slides on weak trading "
    },
    {
        "content": "LONDON  April 13 (IFR) - Bank of America Merrill Lynch said Burri Rao-Kathi  its head of Americas equity-linked capital markets  has decided to leave the company and named Shiv Vasisht in the role.",
        "date": "04132016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-BAML names Vasisht to equity-linked capital Americas role "
    },
    {
        "content": "WASHINGTON U.S. regulators gave a failing grade to five big banks on Wednesday  including JPMorgan Chase & Co  and Wells Fargo & Co  on their plans for a bankruptcy that would not rely on taxpayer money  giving them until Oct. 1 to make amends or risk sanctions.",
        "date": "04132016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "U.S. regulators fail 'living wills' at 5 of 8 big banks "
    },
    {
        "content": "WASHINGTON  April 13 U.S. regulators gave a failing grade to five big banks on Wednesday  including JPMorgan Chase & Co and Wells Fargo & Co  on their plans for a bankruptcy that would not rely on taxpayer money  giving them until Oct. 1 to make amends or risk sanctions.",
        "date": "04132016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 6-U.S. regulators fail 'living wills' at 5 of 8 big banks "
    },
    {
        "content": "WASHINGTON  April 13 U.S. regulators failed five big banks on Wednesday  including JP Morgan and Wells Fargo  on their plans for a bankruptcy that would not rely on taxpayer money  giving them until Oct. 1 to make amends or risk sanctions.",
        "date": "04132016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "RPT-UPDATE 3-U.S. regulators fail 'living wills' at 5 of 8 big banks "
    },
    {
        "content": "April 6 Bank of America Corp's Merrill Lynch wealth management chief John Thiel said a Department of Labor rule aimed at protecting financial advisory clients addresses many practical concerns raised by the financial services industry.",
        "date": "04062016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Merrill Lynch sees many industry concerns addressed in retirement advice rule "
    },
    {
        "content": "April 5 Bank of America Corp on Tuesday appointed Andrei Magasiner as treasurer  replacing Greg Hackworth who is retiring  according to a source familiar with the matter.",
        "date": "04062016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-Bank of America appoints Andrei Magasiner as treasurer "
    },
    {
        "content": "* Treasurer Greg Hackworth to retire; Andrei Magasiner appointed as new treasurer - source    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "04052016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America treasurer Greg Hackworth to retire  Andrei Magasiner appointed new treasurer - source "
    },
    {
        "content": "LONDON  March 31 Finance minister George Osborne has appointed a former Bank of America Merrill Lynch  executive to oversee the sale of the government's stakes in Britain's banks.",
        "date": "03312016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Former Bank of America Merrill Lynch banker to head UKFI "
    },
    {
        "content": "* Says terminated financing and security agreement dated April 30  2010  as amended  between co and Bank Of America  N.A",
        "date": "03282016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-Liquidity Services says terminated financing and security agreement between co and Bank Of America  N.A "
    },
    {
        "content": "March 18 Bank of America Corp said its board has authorized share repurchase of up to $800 million  in addition to the $4 billion share buyback announced earlier.",
        "date": "03182016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BofA raises share buyback by up to $800 mln "
    },
    {
        "content": "* Bank Of America Corp says board of directors has authorized corporation to repurchase up to $800 million of Corporation's common stock",
        "date": "03182016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America's board authorizes repurchase of up to $800 mln common stock "
    },
    {
        "content": "March 14 Bank of America Corp on Monday said it named A.J. Murphy as head of global capital markets  taking over from Jim Probert.",
        "date": "03142016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BofA names A.J. Murphy as head of global capital markets "
    },
    {
        "content": "A federal court sided with Bank of America Corp in a long-running battle over employee pensions on Friday  scheduling a November trial to determine whether the bank retained profits from a discredited investment strategy that led to a $10 million fine from the Internal Revenue Service.",
        "date": "03142016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America wins round in ongoing pension-plan dispute "
    },
    {
        "content": "* Bank of America fired at least 15 senior bankers at its investment-banking unit in Asia this week as it pares jobs globally -Bloomberg  citing sources",
        "date": "03112016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BRIEF-BofA fires 15 senior bankers at Asia investment-banking unit -Bbg "
    },
    {
        "content": "Bank of America Corp is hiring a new team of investment bankers who cater to midsized companies  four years after dismantling a similar business  three people familiar with the matter told Reuters.",
        "date": "03102016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Exclusive: Bank of America hiring bankers for new middle-market push - sources "
    },
    {
        "content": "LONDON  March 7 Symphony  the WhatsApp for the financial world  will significantly increase its user base this year at major institutions including a top asset manager  shareholder Goldman Sachs said on Monday.",
        "date": "03072016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Symphony financial messaging set for wide rollout this year - Goldman "
    },
    {
        "content": "LONDON  March 7 Barclays has hired a team of bankers from boutique firm CMC Capital  including founding partner Carlo Calabria  to beef up its investment banking team in Europe  the British lender said on Monday.",
        "date": "03072016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-Barclays hires investment bankers from boutique CMC Capital "
    },
    {
        "content": "March 3 Bank of America is making a big push into auto lending just as regulators are sending warning signals  losses from auto loans are rising  and rivals are growing more cautious after years of strong returns.",
        "date": "03042016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "CORRECTED-UPDATE 1-Bank of America revs up auto loans business despite warning signs "
    },
    {
        "content": "March 3 Bank of America is making a big push into auto lending just as regulators are sending warning signals  losses from auto loans are rising  and rivals are growing more cautious after years of strong returns.",
        "date": "03032016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "RPT-Bank of America revs up auto loans business despite warning signs "
    },
    {
        "content": "March 3 Bank of America is making a big push into auto lending just as regulators are sending warning signals  losses from auto loans are rising  and rivals are growing more cautious after years of strong returns.",
        "date": "03032016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America revs up auto loans business despite warning signs "
    },
    {
        "content": "AMSTERDAM  Feb 26 Bank of America has taken a 6.26 percent stake in embattled Dutch insurer Delta Lloyd  according to a filing published by the Netherlands' Financial Markets Authority.",
        "date": "02262016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America takes 6.3 pct stake in Delta Lloyd "
    },
    {
        "content": "NEW YORK UBS AG and five other banks and brokerages agreed to pay roughly $103 million to settle claims that they conspired to rig prices for U.S. municipal securities.",
        "date": "02242016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UBS  others reach $103 million muni bond rigging settlements "
    },
    {
        "content": "Sabina McCarthy will take on the newly created role of vice chairman at Merrill Lynch Wealth Management  Bank of America Corp's global wealth and investment management business  according to an internal memo reviewed by Reuters.",
        "date": "02242016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Merrill Lynch names Sabina McCarthy vice chairman "
    },
    {
        "content": "* Natixis  Societe Generale settle with U.S. states   (Adds Natixis  Societe Generale settlements with U.S. states; adds second byline)",
        "date": "02242016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-UBS  others reach $103 million muni bond rigging settlements "
    },
    {
        "content": "Feb 24 Sabina McCarthy will take on the newly created role of vice chairman at Merrill Lynch Wealth Management  Bank of America Corp's global wealth and investment management business  according to an internal memo reviewed by Reuters.",
        "date": "02242016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "ON THE MOVE-Merrill Lynch names Sabina McCarthy vice chairman "
    },
    {
        "content": "WASHINGTON/NEW YORK Republican Marco Rubio's presidential run has drawn more money from Wall Street donors than any other candidate  according to a Reuters review of campaign finance disclosures  shoring up his position as his party's establishment alternative to front-runner Donald Trump.",
        "date": "02222016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Republican Marco Rubio winning Wall Street fundraising race "
    },
    {
        "content": "Goldman Sachs Group Inc  has scaled back its estimate of the legal costs it may face  beyond what it has set aside  by more than half to $2 billion.",
        "date": "02222016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Goldman scales back estimate of legal costs "
    },
    {
        "content": "Feb 22 Goldman Sachs Group Inc has scaled back its estimate of the legal costs it may face  beyond what it has set aside  by more than half to $2 billion.",
        "date": "02222016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-Goldman scales back estimate of legal costs "
    },
    {
        "content": "NEW YORK/LONDON  Feb 19 When the U.S. Federal Reserve's newest policymaker Neel Kashkari dropped a bombshell with a call to break up big banks on Tuesday  it was met with a predictably indignant response from their lobbyists. One described his comments as \"blind.\"",
        "date": "02192016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "INSIGHT-Big banks see the need to shrink - but face a path full of obstacles "
    },
    {
        "content": "NEW YORK Bank of America Merrill Lynch on Wednesday reduced its forecast for the number of times the Federal Reserve will raise U.S. interest rates this year to two from its earlier projection of three to four due to recent market turbulence.",
        "date": "02172016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America Merrill Lynch pares U.S. rate hike outlook for 2016 "
    },
    {
        "content": "Bank of America Corp  raised Chairman and Chief Executive Officer Brian Moynihan's compensation by 23 percent in 2015  a year the bank more than doubled its profits.",
        "date": "02122016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America chief Moynihan gets 23 percent pay hike "
    },
    {
        "content": "FRANKFURT  Feb 8 Allianz and Bank of America are investing in two U.S. wind parks developed by French utility EDF  the German insurer said on Monday.",
        "date": "02082016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Allianz  Bank of America invest in U.S. wind farms "
    },
    {
        "content": "* Insurers increase spending on renewable assets   (Recasts  adds details  background)",
        "date": "02082016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Allianz  Bank of America invest in U.S. wind farms "
    },
    {
        "content": "LONDON  Feb 4 If the bond market is to be believed  the world is heading for recession.",
        "date": "02052016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "CORRECTED-Yield curve moves flash global recession warning signs "
    },
    {
        "content": "Jan 29 Credit Suisse Group AG said Friday it has hired Paula Dominick from Bank of America Corp  to the position of chief compliance officer for the Americas.",
        "date": "02012016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "CORRECTED-MOVES-Credit Suisse hires Bank of America executive for compliance "
    },
    {
        "content": "LONDON  Jan 27 Bonds worth around 25 billion euros are currently at risk of losing their investment grade credit ratings and joining the category known as \"Fallen Angels\"  Bank of America/Merrill (BAML) said on Wednesday.",
        "date": "01272016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bonds worth 25bln euro risk becoming \"Fallen Angels\" in Europe-BAML "
    },
    {
        "content": "Jan 20 Bank of America Corp appointed Samuel Losada and James Fleming co-heads of equity capital markets for Europe  the Middle East and Africa  Bloomberg reported.",
        "date": "01202016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-BofA names 2 co-heads for EMEA equity capital markets - Bloomberg "
    },
    {
        "content": "LONDON  Jan 20 Bank of America Merrill Lynch  has named two European co-heads of equity capital markets (ECM) from its own ranks  according to a memo seen by Reuters on Wednesday.",
        "date": "01202016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-BofA Merrill Lynch appoints EMEA ECM co-heads -memo "
    },
    {
        "content": "LONDON Royal Bank of Scotland could reach a settlement within weeks on claims it misled investors in selling U.S. mortgage-backed securities  passing another milestone in its recovery from the financial crisis  analysts said on Friday.",
        "date": "01152016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "RBS settlement on U.S. mortgages could come within weeks: analysts "
    },
    {
        "content": "LONDON  Jan 15 Royal Bank of Scotland  could reach a settlement within weeks on claims it misled investors in selling U.S. mortgage-backed securities  passing another milestone in its recovery from the financial crisis  analysts said on Friday.",
        "date": "01152016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "RBS settlement on U.S. mortgages could come within weeks  -analysts "
    },
    {
        "content": "CHICAGO  Jan 14 Bank of America Merrill Lynch won $480 million of Illinois general obligation bonds on Thursday with a bid that resulted in an overall interest cost of 3.9989 percent for the fiscally shaky state  which has not issued any debt in 20 months.",
        "date": "01142016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Illinois sells $480 mln bonds at overall rate near 4 pct "
    },
    {
        "content": "HONG KONG  Jan 14 Bank of America Merrill Lynch  has named Elif Bilgi Zapparoli as its new co-head of corporate and investment banking for the Asia Pacific region  according to an internal memo seen by Reuters on Thursday.",
        "date": "01142016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-Bank of America names new co-head of investment banking for Asia Pacific - memo "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 19 (Fitch) According to Fitch Ratings  the key to improved  earnings for Bank of America Corporation (BAC) over the near-term is a continued  focus on expense management. Overall expenses for BAC were down relative to the  year-ago quarter  and essentially flat from the sequential quarter.  However  Fitch expects BAC to continue to reduce expenses in its Legacy Assets &  Servicing segment  continue to optimize multiple ",
        "date": "01192016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Fitch: Expense Management Remains Key for Bank of America "
    },
    {
        "content": " ",
        "date": "01192016",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America's quarterly profit rises 9.8 pct "
    },
    {
        "content": "BOSTON  Jan 4 Fidelity Investments said on Monday it is dropping long-time credit card partners American Express Co and Bank of America Corp  ending a 12-year partnership that has generated billions of dollars in fees.",
        "date": "01042016",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "REFILE-Fidelity drops credit card partners American Express  Bank of America "
    },
    {
        "content": "WASHINGTON Bank of America has produced a satisfactory update of its capital plan  the Federal Reserve announced on Thursday  saying the U.S. bank had made progress strengthening its \"loss and revenue modeling practices and its internal controls.\"",
        "date": "12102015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America's new capital plan gets approval from Fed "
    },
    {
        "content": "WASHINGTON  Dec 10 Bank of America has produced a satisfactory update of its capital plan  the Federal Reserve announced on Thursday  saying the U.S. bank had made progress strengthening its \"loss and revenue modeling practices and its internal controls.\"",
        "date": "12102015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-Bank of America's new capital plan gets approval from Fed "
    },
    {
        "content": "WASHINGTON  Dec 10 The Federal Reserve on Thursday said it had not objected to a resubmitted capital plan from Bank of America  saying the U.S. bank had made progress strengthening its \"loss and revenue modeling practices and its internal controls.\"   (Reporting by Jason Lange; Editing by Chizu Nomiyama)",
        "date": "12102015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Fed says does not object to capital plan from Bank of America "
    },
    {
        "content": "Dec 3 Standard & Poor's cut its nonoperating holding company (NOHC) ratings on eight U.S. \"global systemically important banks\" by one notch  citing uncertainty about the U.S. government's willingness to provide support to the banking system if it came under stress.",
        "date": "12032015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "S&P downgrades holding companies of eight U.S. banks "
    },
    {
        "content": "LUANDA  Nov 26 Bank of America will stop supplying U.S. dollars to Angola at the end of this month  two foreign exchange sources said on Thursday  a move that could pile pressure on the oil exporter's ailing kwanza  currency.",
        "date": "11262015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "UPDATE 1-Bank of America to halt dollar supplies to Angola - sources "
    },
    {
        "content": "Nov 12 Bank of America Corp appointed David Leitch as global general counsel  replacing Gary Lynch.",
        "date": "11122015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Bank of America names David Leitch general counsel "
    },
    {
        "content": "Bank of America Corp  is close to naming outgoing Ford Motor Co  General Counsel David Leitch  as its new general counsel  The Wall Street Journal reported on Wednesday.",
        "date": "11042015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America close to naming new general counsel: WSJ "
    },
    {
        "content": "Nov 4 Bank of America Corp is close to naming outgoing Ford Motor Co General Counsel David Leitch  as its new general counsel  The Wall Street Journal reported on Wednesday.",
        "date": "11042015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America close to naming new general counsel -WSJ "
    },
    {
        "content": "NEW YORK Bank of America Corp  the No. 2 U.S. bank  has agreed to sell its $87 billion money-market fund business to BlackRock Inc in one of the cash-management industry's largest deals ever.",
        "date": "11032015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BlackRock to buy Bank of America's $87 billion money-market fund business "
    },
    {
        "content": "NEW YORK  Nov 3 Bank of America Corp  the No. 2 U.S. bank  has agreed to sell its $87 billion money-market fund business to BlackRock Inc in one of the cash-management industry's largest deals ever.",
        "date": "11032015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-BlackRock to buy Bank of America's $87 bln money-market fund business "
    },
    {
        "content": "* Co and Bank Of America's asset management business  BOFA Global Capital Management have entered agreement",
        "date": "11032015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America to sell $87 bln of investment management responsibilities to BlackRock "
    },
    {
        "content": "NEW YORK  Nov 3 Bank of America Corp  the No. 2 U.S. bank  has agreed to sell responsibility for about $87 billion in money-market funds and other products it manages to BlackRock Inc in one of the money market industry's largest deals ever.",
        "date": "11032015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America to sell $87 bln money-market fund business to BlackRock "
    },
    {
        "content": "A lawsuit against Bank of America Corp alleging the bank's Countrywide mortgage unit fraudulently induced an insurer to cover more than $25 billion of mortgage-backed securities can proceed  a New York judge has ruled.",
        "date": "10292015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America must face Ambac lawsuit over mortgage securities "
    },
    {
        "content": "LONDON  Oct 16 Investors betting on a delay to U.S. policy tightening put new money into emerging equity and bonds funds for the first time in at least three months  while global stocks saw the first inflow in four weeks  Bank of America/Merrill Lynch said on Friday.",
        "date": "10162015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Cash flows to emerging market funds for first time in 3 mths-BAML "
    },
    {
        "content": "Consumers accusing Bank of America of making illegal robocalls to market credit cards have standing to sue under federal law even if they were called unintentionally  a federal appeals court ruled  reviving a proposed class action against the bank.",
        "date": "10152015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "3rd Circuit revives robocall lawsuit against Bank of America "
    },
    {
        "content": "NEW YORK  Oct 14 Bank of America Corp  said its wealth management business' income plunged 19 percent in the third quarter  underscoring how stock market selloffs can torpedo even an area that banks see as relatively safe and stable.",
        "date": "10142015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America wealth earnings slammed by stock market rout "
    },
    {
        "content": "Bank of America Corp  reported a profit for the third quarter  compared with a year-earlier loss  as Chief Executive Brian Moynihan's cost-cutting efforts helped the bank mitigate the impact of weak revenue in three of its four main businesses. | Video ",
        "date": "10142015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BofA's cost cuts cushion blow from weak rates  muted trading "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 14 (Fitch) While Bank of America Corporation's (BAC) reported  third quarter 2015 (3Q15) returns are below Fitch Ratings' estimate of the  long-term cost of equity assumption for the company  they represent a good base  from which BAC can continue to work to improve.  The reported net income of $4.51 billion was down from $5.32 billion in the  sequential quarter  but up from a loss in the year ago quarter which was marr",
        "date": "10142015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Fitch: Bank of America's Earnings Highlight Expense Management Efforts "
    },
    {
        "content": "Oct 14 Bank of America Corp reported a quarterly profit  compared with a year-earlier loss related to a multi-billion dollar settlement with the U.S. government over mortgages.",
        "date": "10142015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BofA posts profit on lower expenses "
    },
    {
        "content": "* Bank of America  Citic CLSA  Deutsche mandated for $1 bln HK IPO",
        "date": "10142015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-CDB mandates three banks for $1 bln HK IPO of leasing unit-IFR "
    },
    {
        "content": "HONG KONG  Oct 14 State-owned China Development Bank (CDB) has mandated Bank of America Merrill Lynch  Citic CLSA and Deutsche Bank to manage a Hong Kong initial public offering worth about $1 billion for its leasing unit  IFR reported on Wednesday.",
        "date": "10142015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "CDB mandates three banks for $1 bln HK IPO of leasing unit-IFR "
    },
    {
        "content": "Sept 29 Bank of America Corp is planning \"a couple of hundred\" job cuts at its global banking and markets unit  the Wall Street Journal reported.",
        "date": "09292015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BofA to cut \"a couple of hundred\" jobs - WSJ "
    },
    {
        "content": "Former Wells Fargo chairman and chief executive Richard Kovacevich said that Bank of America shareholders are wrong to try to strip Bank of America CEO Brian Moynihan of his chairman title.",
        "date": "09182015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Ex-Wells CEO says Bank of America investors should back off "
    },
    {
        "content": "Sept 18 Bank of America Corp named Deutsche Bank AG senior executive John Utendahl as executive vice chairman of its global corporate and investment banking  Bloomberg reported.",
        "date": "09182015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-Bank of America hires Utendahl from Deutsche Bank -Bloomberg "
    },
    {
        "content": "HONG KONG  Sept 24 Bank of America Merrill Lynch has named Yang Xia as head of greater China equities  according to an internal memo seen by Reuters on Thursday.",
        "date": "09242015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-BofA Merrill Lynch names ex-UBS banker Yang head of greater China equities-memo "
    },
    {
        "content": "BOSTON  Sept 22 An executive for State Street Global Advisors said it voted to let Bank of America  Chief Executive Brian Moynihan keep his additional title of chairman  votes that helped him retain the role at the bank's shareholder meeting held earlier on Tuesday.",
        "date": "09222015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "State Street  a top B of A shareholder  says supported Moynihan in vote "
    },
    {
        "content": "The Canada Pension Plan Investment Board said on Tuesday it has voted to strip Bank of America Corp Chief Executive Officer Brian Moynihan of his chairman's title  the biggest shareholder so far to declare its intentions in a closely watched corporate governance contest.",
        "date": "09222015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Canada pension fund votes to separate Bank of America roles "
    },
    {
        "content": "Sept 22 The Canada Pension Plan Investment Board said on Tuesday it has voted to strip Bank of America Corp  Chief Executive Officer Brian Moynihan of his chairman's title  the biggest shareholder so far to declare its intentions in a closely watched corporate governance contest.",
        "date": "09222015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Canada pension fund votes to separate Bank of America roles "
    },
    {
        "content": "BOSTON  Sept 22 The Canada Pension Plan Investment Board said on Tuesday it has voted its large stake in Bank of America Corp against bylaw changes allowing the bank's chief executive officer  Brian Moynihan  to also serve as chairman.",
        "date": "09222015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Canada pension fund votes against Bank of America bylaw changes "
    },
    {
        "content": "Sept 17 New York City's $165 billion pension funds will vote to strip Bank of America CEO Brian Moynihan of his chairman title  a spokesman for the funds told Reuters on Thursday.",
        "date": "09172015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "NYC to vote to strip Bank of America CEO of chairmanship "
    },
    {
        "content": "LONDON Investors pulled another $19 billion from equity funds over the past week as they sought safety in government bond funds  which have enjoyed the longest run of inflows in four years  Bank of America/Merrill Lynch said on Friday.",
        "date": "09112015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Equity funds shed $46 billion in four-week run of outflows: BAML "
    },
    {
        "content": "LONDON  Sept 11 Investors pulled another $19 billion from equity funds over the past week as they sought safety in government bond funds  which have enjoyed the longest run of inflows in four years  Bank of America/Merrill Lynch said on Friday.",
        "date": "09112015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Equity funds shed $46 bln in four-week run of outflows -BAML "
    },
    {
        "content": "NEW YORK Some Bank of America Corp  officials told investors they could lose an upcoming shareholder vote on having Brian Moynihan continue as chairman and chief executive of the company  the Wall Street Journal reported on Sunday.",
        "date": "09142015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America officials worried about Moynihan vote: WSJ "
    },
    {
        "content": "Sept 1 Two of America's biggest public pension funds have come together to oppose an amendment of bylaws at Bank of America Corp that would allow Brian Moynihan to continue as both chief executive and chairman of the No. 2 U.S. bank by assets.",
        "date": "09012015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Calpers  Calstrs oppose joint CEO-chairman role at Bank of America "
    },
    {
        "content": "Sept 1 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "09012015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "PRESS DIGEST - Wall Street Journal - Sept 1 "
    },
    {
        "content": "Lawyers are asking a federal appeals court to revive a proposed class action accusing Bank of America of collecting unlawfully high interest rates  styled as fees  from customers who let their checking accounts stay overdrawn for several days.",
        "date": "08282015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America customers appeal dismissal of overdraft lawsuit "
    },
    {
        "content": "WASHINGTON  Sept 3 U.S. banking regulators gave Bank of America the green light on Thursday to use its own internal models to compute their capital requirements.",
        "date": "09032015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America gets U.S. approval to use internal models for capital "
    },
    {
        "content": "BOSTON Bank of America Merrill Lynch is telling its financial advisers to pull clients' money from billionaire hedge fund manager John Paulson's Advantage fund and said they are not permitted to put new money into one of his other portfolios.",
        "date": "08052015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America tells advisers to exit Paulson hedge fund: memo "
    },
    {
        "content": "BOSTON  Aug 5 Bank of America Merrill Lynch  is telling its financial advisers to pull clients' money from billionaire hedge fund manager John Paulson's Advantage fund and said they are not permitted to put new money into one of his other portfolios.",
        "date": "08052015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Bank of America tells advisers to exit Paulson hedge fund -memo "
    },
    {
        "content": "BOSTON  Aug 5 Bank of America Merrill Lynch  is telling its financial advisers to pull clients' money out of billionaire hedge fund manager John Paulson's Advantage Funds and said they are not permitted to put new money into one of his other portfolios.",
        "date": "08052015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America tells advisers to exit Paulson hedge fund "
    },
    {
        "content": "Aug 4 Bank of America Corp's Merrill Lynch said on Tuesday it has hired three financial advisers from Morgan Stanley.",
        "date": "08042015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "ON THE MOVE-BofA Merrill Lynch hires three advisers from Morgan Stanley "
    },
    {
        "content": "NEW YORK  July 31 Bank of America is likely to hold a shareholder vote this year to determine whether Chief Executive Brian Moynihan should be allowed to retain his title of chairman of the bank's board  a person familiar with the matter said on Friday.",
        "date": "07312015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BofA likely to hold vote this year on Moynihan chairmanship- source "
    },
    {
        "content": "July 29 Bank of America Corp's Merrill Lynch said it had hired two private wealth advisers from the recently sold U.S. wealth management unit of Barclays Plc .",
        "date": "07292015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "ON THE MOVE-Merrill Lynch hires two more advisers from Barclays "
    },
    {
        "content": "NEW YORK Bank of America Corp  has been interviewing possible successors to Gary Lynch  the company’s general counsel  who will move into a more advisory role  the Wall Street Journal reported on Friday.",
        "date": "07242015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America top lawyer Lynch moving to advisory role: WSJ "
    },
    {
        "content": "NEW YORK  July 24 Bank of America Corp  has been interviewing possible successors to Gary Lynch  the company's general counsel  who will move into a more advisory role  the Wall Street Journal reported on Friday.",
        "date": "07242015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America top lawyer Lynch moving to advisory role -WSJ "
    },
    {
        "content": "Bank of America Corp said on Wednesday it would replace its chief financial officer and its wealth management chief  a week after the bank reported its biggest quarterly profit in nearly four years.",
        "date": "07222015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America replaces CFO in management shake-up "
    },
    {
        "content": "July 22 Bank of America Corp said on Wednesday it would replace its chief financial officer and its wealth management chief  a week after the bank reported its biggest quarterly profit in nearly four years.",
        "date": "07222015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Bank of America replaces CFO in management shake-up "
    },
    {
        "content": "July 22 Bank of America Corp is replacing its chief financial officer  its wealth-management chief and naming a new official to oversee the firm's stress tests with the Federal Reserve  the Wall Street Journal reported  quoting an internal memo.",
        "date": "07222015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America replaces CFO Bruce Thompson  - WSJ "
    },
    {
        "content": "* Graphic on nuclear deal: http://graphics.thomsonreuters.com/15/irannuclear/index.html",
        "date": "07222015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Iran deal offers faint hope for Iranian-American banking woes "
    },
    {
        "content": "Bank of America Corp said on Wednesday it would replace its chief financial officer and some other top executives in a management shakeup  four months after the bank barely scraped by in a U.S. Federal Reserve stress test.",
        "date": "07232015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America replaces CFO in management shake-up "
    },
    {
        "content": "* Graphic on nuclear deal: http://graphics.thomsonreuters.com/15/irannuclear/index.html   (Adds comment from the U.S. Treasury Department about OFAC licenses in 15th paragraph)",
        "date": "07222015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Iran deal offers faint hope for Iranian-American banking woes "
    },
    {
        "content": "* Graphic on nuclear deal: http://graphics.thomsonreuters.com/15/irannuclear/index.html",
        "date": "07222015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "RPT-Iran deal offers faint hope for Iranian-American banking woes "
    },
    {
        "content": "July 23 Bank of America Corp's surprise move to replace Chief Financial Officer Bruce Thompson got a less-than-enthusiastic reception from at least two prominent Wall Street analysts.",
        "date": "07232015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Departing BofA CFO Thompson will be missed - analysts "
    },
    {
        "content": "July 22 Bank of America Corp said on Wednesday it would replace its chief financial officer and some other top executives in a management shakeup  four months after the bank barely scraped by in a U.S. Federal Reserve stress test.",
        "date": "07232015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 3-Bank of America replaces CFO in management shake-up "
    },
    {
        "content": "NEW YORK  July 17 A federal judge has dismissed National Football League star Dwight Freeney's lawsuit against Bank of America Corp and a stockbroker  ruling that Freeney sued the wrong parties in alleging that he was defrauded of more than $20 million.",
        "date": "07172015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "U.S. judge dismisses NFL star's $20 mln case against Bank of America "
    },
    {
        "content": "NEW YORK A federal judge has dismissed National Football League star Dwight Freeney's lawsuit against Bank of America Corp and a stockbroker  ruling that Freeney sued the wrong parties in alleging that he was defrauded of more than $20 million.",
        "date": "07172015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "U.S. judge dismisses NFL star's $20 million case against Bank of America "
    },
    {
        "content": "NEW YORK  July 17 Bank of America  Merrill Lynch Wealth Management's Chief Investment Officer Ashvin Chhabra is stepping down to run a family office  the bank said Friday.",
        "date": "07172015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "ON THE MOVE-Merrill Lynch CIO leaves during reorganization "
    },
    {
        "content": "* Bank of America  Morgan Stanley global coordinators - sources",
        "date": "07172015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Buyout group Cinven prepares CeramTec listing - sources "
    },
    {
        "content": "NEW YORK Bank of America Corp  Chief Executive Brian Moynihan has been hiring more sales staff in areas ranging from commercial lending to wealth management  in his latest effort to boost revenue that has barely budged for years.",
        "date": "07152015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America hires sales staff in latest effort to boost revenue "
    },
    {
        "content": "Bank of America Corp   the No. 2 U.S. bank by assets  reported its biggest quarterly profit in nearly four years as expenses fell to their lowest since the financial crisis.",
        "date": "07152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BofA profit soars as costs fall to lowest since 2008 "
    },
    {
        "content": "NEW YORK  July 15 Bank of America Corp  Chief Executive Brian Moynihan has been hiring more sales staff in areas ranging from commercial lending to wealth management  in his latest effort to boost revenue that has barely budged for years.",
        "date": "07152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Bank of America hires sales staff in latest effort to boost revenue "
    },
    {
        "content": "NEW YORK  July 15 Bank of America Corp  Chief Executive Brian Moynihan has been hiring more sales staff  in areas ranging from commercial lending to wealth management  in his latest effort to boost revenue that has barely budged for years.",
        "date": "07152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "CORRECTED-Bank of America hires sales staff in latest effort to boost revenue "
    },
    {
        "content": "* Futures up: Dow 2 pts  S&P 0.5 pts  Nasdaq 8 pts   (Adds details  comment  updates prices)",
        "date": "07152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "US STOCKS-Futures flat as Fed stays on course for 2015 rate hike "
    },
    {
        "content": "July 15 Bank of America Corp  the second-largest U.S. bank by assets  said its quarterly profit more than doubled from the same period last year  when earnings were hit by big legal bills.",
        "date": "07152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America profit more than doubles on lower legal costs "
    },
    {
        "content": "NEW YORK  July 10 With a slew of big banks reporting results next week  the key financial exchange traded fund has been drawing strong inflows  and trading in its options appears bullish.",
        "date": "07102015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Financial ETF investors look for boost from bank earnings "
    },
    {
        "content": "July 8 ConAgra Foods Inc has hired Centerview Partners to explore a sale of its private label unit Ralcorp  just two years after it acquired the troubled business with advice from the same investment bank  people familiar with the matter said.",
        "date": "07082015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "ConAgra turns to Centerview again for advice on Ralcorp -sources "
    },
    {
        "content": "July 2 Bank of America Merrill Lynch said it made three appointments to its global equities prime brokerage division this week.",
        "date": "07022015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Bill Murphy joins global equities prime brokerage team at BofA "
    },
    {
        "content": "NEW YORK  June 30 Bank of America's Merrill Lynch said Tuesday it hired three more financial advisers from the recently sold Barclays Plc's U.S. wealth and investment management unit  adding to a cadre of advisers Merrill has poached from the Barclays unit this month.",
        "date": "06302015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "ON THE MOVE-Merrill Lynch nabs three more brokers from Barclays "
    },
    {
        "content": "June 26 The following financial services industry appointments were announced on Friday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "06262015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES- Bank of America  Deloitte  Bank of Georgia "
    },
    {
        "content": "HONG KONG  June 26 Bank of America Corp  has named Chris Gammons and Alex To as co-heads of Asia-Pacific investment banking  according to an internal memo obtained by Reuters on Friday.",
        "date": "06262015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-BofA names Gammons  To as co-heads of Asia-Pacific investment banking-memo "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  June 11 (Fitch) This announcement amends a previous release regarding  Bank of America Corporation and subsidiaries published on May 19  2015. The  correction includes revising the Rating Outlook for the company's Bank of  America Merrill Lynch International subsidiary to Positive from Stable.  Fitch Ratings has upgraded Bank of America's (BAC) Viability Rating (VR) to 'a'  from 'a-'. At the same time  the agency has affirmed B",
        "date": "06112015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Correction: Fitch Upgrades Bank of America's VR to 'a'; Outlook Revised to Stable "
    },
    {
        "content": "LONDON Royal Bank of Scotland is set to appoint Bank of America as its new corporate broker  a person familiar with the matter said on Thursday.",
        "date": "06112015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "RBS set to appoint Bank of America as corporate broker: source "
    },
    {
        "content": "LONDON  June 11 Royal Bank of Scotland  is set to appoint Bank of America as its new corporate broker  a person familiar with the matter said on Thursday.",
        "date": "06112015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "RBS set to appoint Bank of America as corporate broker -source "
    },
    {
        "content": "A U.S. appeals court on Monday revived a class action suit filed more than a decade ago against Bank of America Corp by employees looking to recoup profits they say the company made investing their retirement contributions.",
        "date": "06082015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Court revives long-running battle over Bank of America pensions "
    },
    {
        "content": "June 10 Bank of America Merrill Lynch appointed JPMorgan banker Jeffrey Hamilton to lead its energy investment banking operations in Canada  the Wall Street Journal reported  citing an internal BofA Merrill Lynch memo.",
        "date": "06102015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-BofA Merrill Lynch hires Canada energy investment banking head "
    },
    {
        "content": "Bank of America Corp  agreed with U.S. regulators to improve its compliance practices and pay a fine for violations in lending rules toward military personnel.",
        "date": "05292015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America to improve compliance practices  pay $30 million fine to OCC "
    },
    {
        "content": "May 29 Bank of America Corp agreed with U.S. regulators to improve its compliance practices and pay a fine for violations in lending rules toward military personnel.",
        "date": "05292015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America to improve compliance practices  pay $30 mln fine to OCC "
    },
    {
        "content": "June 2 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "06022015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES- Bank of America  Ernst & Young  JP Morgan "
    },
    {
        "content": "June 2 Bank of America's Merrill Lynch said it hired a team of two advisers from UBS Group AG.",
        "date": "06022015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "ON THE MOVE-Merrill Lynch hires two advisers from UBS "
    },
    {
        "content": "June 1 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "06012015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Morgan Stanley  Citigroup  BoFA  Prudential "
    },
    {
        "content": "WASHINGTON The U.S. Supreme Court on Monday handed a win to Bank of America Corp by ruling that a second mortgage on an \"underwater\" home - one with a mortgage balance exceeding its current value - cannot by voided during bankruptcy.",
        "date": "06012015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "U.S. top court says 2nd mortgages on 'underwater' homes cannot be voided in bankruptcy "
    },
    {
        "content": "NEW YORK  May 18 U.S. Bancorp and Bank of America Corp won a dismissal of claims in lawsuits accusing them of breaching their duties as trustees for residential mortgage-backed securities that suffered losses tied to the global financial crisis.",
        "date": "05182015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "US Bank  Bank of America win dismissal of mortgage claims "
    },
    {
        "content": "May 18 A former Bank of America Corp  executive was sentenced to 2 years and two months in prison on Monday after pleading guilty to participating in a scheme to defraud cities and towns by rigging bids to invest municipal bond proceeds.",
        "date": "05182015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Ex-Bank of America executive gets 26 months in prison for muni bond scheme "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  May 19 (Fitch) Fitch Ratings has upgraded Bank of America's (BAC)  Viability Rating (VR) to 'a' from 'a-'. At the same time  the agency has  affirmed BAC's Long-Term and Short-Term Issuer-Default Ratings (IDRs) at 'A' and  'F1'  respectively. The Rating Outlooks for the Long-Term IDRs are Stable. BAC's's Long-Term IDR is now driven by its VR  which has been upgraded to 'a'  from 'a-'. The upgrade of BAC's's material legal operat",
        "date": "05192015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Fitch Upgrades Bank of America's VR to 'a'; Outlook Revised to Stable "
    },
    {
        "content": "NEW YORK  May 19 Bank of America's  Merrill Lynch said Tuesday it hired an elite team of three brokers away from rival brokerage Morgan Stanley  where they had produced nearly $4 million in fees and revenues last year.",
        "date": "05192015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "ON THE MOVE-Merrill Lynch lands $4 million team from Morgan Stanley "
    },
    {
        "content": "NEW YORK U.S. Bancorp and Bank of America Corp won a dismissal of claims in lawsuits accusing them of breaching their duties as trustees for residential mortgage-backed securities that suffered losses tied to the global financial crisis.",
        "date": "05192015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "US Bank  Bank of America win dismissal of mortgage claims "
    },
    {
        "content": "May 11 Barclays Plc has hired Mark Garcia  a semiconductor specialist from Bank of America  in a move to help build out its team in one of the most active sectors of technology banking.",
        "date": "05112015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Barclays hires semiconductor banker from Bank of America-source "
    },
    {
        "content": "NEW YORK Four Bank of America Corp  directors on the board's governance committee received unusually small majorities of votes for re-election at this week's annual meeting  according to tallies the company released on Thursday.",
        "date": "05072015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America directors lose support from shareholders "
    },
    {
        "content": "NEW YORK  May 7 Four Bank of America Corp  directors on the board's governance committee received unusually small majorities of votes for re-election at this week's annual meeting  according to tallies the company released on Thursday.",
        "date": "05072015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Bank of America directors lose support from shareholders "
    },
    {
        "content": "NEW YORK  May 4 Bank of America Corp  plans to hold a shareholder vote on the change the board made to company bylaws in October to allow CEO Brian Moynihan to also be chairman.",
        "date": "05042015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America plans vote on change allowing CEO to be chairman "
    },
    {
        "content": "NEW YORK  May 4 Bank of America Corp  plans to hold a shareholder vote on the change the board made in October to company bylaws to allow Chief Executive Officer Brian Moynihan to also be chairman.",
        "date": "05042015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-Bank of America plans vote on change allowing CEO to be chairman "
    },
    {
        "content": "WASHINGTON  May 6 Bank of America announced Wednesday it will reduce its financial exposure to coal companies  acknowledging the risk that future regulation and competition from natural gas pose on the industry.",
        "date": "05062015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America's new policy to limit credit exposure to coal "
    },
    {
        "content": "May 5 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "05052015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES- Bank of America  TPG Capital  Citigroup "
    },
    {
        "content": "May 4 Chris Cormier  former head of technology equity capital markets at Deutsche Bank AG  is joining Bank of America Merrill Lynch to focus on technology  media  telecom and industrial IPOs  according to an internal memo on Monday.",
        "date": "05042015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-Deutsche Bank tech ECM head leaves for Bank of America "
    },
    {
        "content": "May 4 Patterson Cos Inc said it would buy privately held Animal Health International Inc for $1.1 billion to expand in the fast-growing veterinary products market.",
        "date": "05042015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Patterson to buy private veterinary products maker for $1.1 bln "
    },
    {
        "content": "NEW YORK Shareholders voted to back Bank of America Corp's  executive compensation  board nominations and opposition to shareholder proposals at the annual meeting on Wednesday  despite earlier complaints about bylaws being changed.",
        "date": "05062015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America shareholders back board despite criticism "
    },
    {
        "content": "NEW YORK  May 6 Shareholders voted to back Bank of America Corp's executive compensation  board nominations and opposition to shareholder proposals at the annual meeting on Wednesday  despite earlier complaints about bylaws being changed.",
        "date": "05062015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-Bank of America shareholders back board despite criticism "
    },
    {
        "content": "NEW YORK  May 6 Investors in Bank of America Corp backed the company's executive compensation  board nominations and opposition to shareholder proposals in votes at their annual meeting on Wednesday.",
        "date": "05062015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America shareholders side with board as director admits fault "
    },
    {
        "content": "May 5 Mexican conglomerate Alfa Sab de CV  and Harbour Energy Ltd have agreed to acquire Canadian oil and gas company Pacific Rubiales Energy Corp  for C$6 billion ($4.97 billion)  including debt  a person familiar with the matter said on Tuesday.",
        "date": "05062015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 3-Alfa  Harbour Energy to buy Pacific Rubiales for $5 bln -source "
    },
    {
        "content": "The U.S. Securities and Exchange Commission is investigating whether Bank of America Corp violated customer-protection rules and put retail-brokerage funds at risk to increase profits  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "04282015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "SEC investigates customer protection violation by Bank of America: WSJ "
    },
    {
        "content": "April 28 The U.S. Securities and Exchange Commission is investigating whether Bank of America Corp  violated customer-protection rules and put retail-brokerage funds at risk to increase profits  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "04282015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-SEC investigates customer protection violation by Bank of America-WSJ "
    },
    {
        "content": "April 28 The Securities and Exchange Commission is investigating whether Bank of America Corp violated customer-protection rules and put retail-brokerage funds at risk to increase profits  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "04282015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "SEC investigates customer protection violation by Bank of America-WSJ "
    },
    {
        "content": "April 22 Bank of America Merrill Lynch  appointed former Deutsche Bank executive Armin von Falkenhayn as country executive for Germany and head of corporate and investment banking for Germany  Austria and Switzerland.",
        "date": "04222015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-BofA Merrill hires Armin von Falkenhayn for Germany "
    },
    {
        "content": "LONDON  April 22 Britain's markets regulator has fined Bank of America Merrill Lynch a record 13.2 million pounds ($20 million) for failing to report transactions properly over a seven year period.",
        "date": "04222015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UK watchdog fines BoA's Merrill Lynch $20 million for reporting failures "
    },
    {
        "content": "April 21 New York's banking regulator will not settle with Barclays Plc over foreign exchange trading in coming weeks unless the deal excludes a probe of the possible rigging of rates through computer programs  the agency's superintendent said on Tuesday.",
        "date": "04212015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-New York won't settle with Barclays soon over FX computer programs "
    },
    {
        "content": "* Bank says problems dealt with as quickly as possible   (Adds Bank of America statement  more detail)",
        "date": "04222015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-UK watchdog fines BoA's Merrill Lynch $20 million for reporting failures "
    },
    {
        "content": "WASHINGTON On March 6  the day of the U.S. Supreme Court's deadline for legal briefs backing same-sex marriage  gay rights activists quietly celebrated a victory on Wall Street.",
        "date": "04232015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "How Wall Street came out on gay marriage "
    },
    {
        "content": "WASHINGTON  April 23 On March 6  the day of the U.S. Supreme Court's deadline for legal briefs backing same-sex marriage  gay rights activists quietly celebrated a victory on Wall Street.",
        "date": "04232015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "RPT-INSIGHT-How Wall Street came out on gay marriage "
    },
    {
        "content": "WASHINGTON  April 23 On March 6  the day of the U.S. Supreme Court's deadline for legal briefs backing same-sex marriage  gay rights activists quietly celebrated a victory on Wall Street.",
        "date": "04232015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "INSIGHT-How Wall Street came out on gay marriage "
    },
    {
        "content": "NEW YORK Bank of America Corp  has settled its portion of a U.S. antitrust lawsuit in which investors accused 12 major banks of rigging prices in the foreign exchange market.",
        "date": "04162015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America settles currency-rigging lawsuit "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 15 (Fitch) Bank of America Corporation's (BAC) reported first  quarter 2015 (1Q'15) earnings of $3.36 billion were improved  according to Fitch  Ratings. The company's earnings improved relative to both the sequential  quarter  which is typically seasonally slower  and the prior year quarter  which  was marred by significant litigation charges.   Fitch calculated pre-tax profits  which excluded DVA/FVA adjustments and var",
        "date": "04152015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Fitch: Improving 1Q'15 Earnings for Bank of America "
    },
    {
        "content": "Bank of America Corp  the No. 2 U.S. bank by assets  reported a better-than-expected first-quarter profit  reversing from a year-earlier loss  as legal costs fell steeply and the bank earned more from mortgage lending. | Video ",
        "date": "04152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America profit beats expectations as legal expenses fall "
    },
    {
        "content": "* Shares fall 1.2 pct   (Adds Oppenheimer calculation of expenses  updates shares)",
        "date": "04152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 5-Bank of America profit beats expectations as legal expenses fall "
    },
    {
        "content": "* Indexes up: Dow 0.3 pct  S&P 0.4 pct  Nasdaq 0.4 pct   (Updates to midday)",
        "date": "04152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "US STOCKS-Wall St up as earnings worries recede  oil jumps "
    },
    {
        "content": "April 15 U.S. stocks rose higher on Wednesday as earnings from major companies beat lowered expectations and investors' worries about a poor quarterly season receded.",
        "date": "04152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "REFILE-US STOCKS-Wall St edges higher as earnings worries recede "
    },
    {
        "content": "* Futures up: Dow 57 pts  S&P 5.5 pts  Nasdaq 10 pts   (Adds details  comments  updates prices)",
        "date": "04152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "US STOCKS-Wall St set to rise as earnings beat low expectations "
    },
    {
        "content": "April 15 Bank of America Corp  the No. 2 U.S. bank by assets  reported a first-quarter profit of $2.98 billion  compared with a surprise loss a year earlier when it took a charge of $6 billion for litigation expenses.",
        "date": "04152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America reports quarterly profit "
    },
    {
        "content": "New York's attorney general has sent letters to 13 national retailers  including Gap Inc  Target Corp and JC Penney Co Inc  about \"on-call shifts\" in which workers are told whether to report to work a day or less before a scheduled shift.",
        "date": "04132015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "New York questions big retailers over 'on-call' staffing "
    },
    {
        "content": "NEW YORK Several high-ranking bankers have left their jobs at major investment banks in the last 13 months amid a surge in U.S. healthcare deal activity to seek better compensation at boutique investment banks as well as to participate in the growth of the industry at biotech companies themselves.",
        "date": "04142015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Banks see talent flee amid healthcare M&A boom "
    },
    {
        "content": "NEW YORK  April 14 Several high-ranking bankers have left their jobs at major investment banks in the last 13 months amid a surge in U.S. healthcare deal activity to seek better compensation at boutique investment banks as well as to participate in the growth of the industry at biotech companies themselves.",
        "date": "04142015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "INSIGHT-Banks see talent flee amid healthcare M&A boom "
    },
    {
        "content": "LONDON  April 10 (IFR) - Bank of America Merrill Lynch has hired Eamon Brabazon to be its head of financial sponsors mergers and acquisitions for Europe  the Middle-East and Africa. He will join the firm in August and be based in London.",
        "date": "04102015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-BofA Merrill hires Brabazon from JP Morgan for M&A team "
    },
    {
        "content": "April 6 Bank of America Merrill Lynch  has hired Michael Wise as vice chairman of global equity capital markets from Goldman Sachs Inc  the New York Times reported on Monday  citing the company's internal memo.",
        "date": "04062015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-BofA Merrill hires equity capital markets banker from Goldman-NYT "
    },
    {
        "content": "April 8 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "04082015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES- Bank Of America  BNP Paribas  RBC Capital Markets "
    },
    {
        "content": "LONDON  April 8 (IFR) - \u007fBank of America Merrill Lynch has promoted two of its most senior investment bankers to co-head the new position of global investment banking as part of plans to enhance its coverage efforts  according to an internal memo seen by IFR.",
        "date": "04082015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-Assef  De Giorgi to head global investment banking at BofA "
    },
    {
        "content": "April 7 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "04072015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Barclays  BofA Merrill Lynch  U.S. Bank  Standard Chartered "
    },
    {
        "content": "April 8 Bank of America Corp appointed Karim Assef and Diego De Giorgi co-heads of global investment banking  according to an internal memo seen by Reuters.",
        "date": "04082015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America appoints co-heads of global investment banking "
    },
    {
        "content": "April 7 Bank of America Merrill Lynch hired Michael Casey from Morgan Stanley as director of its Nevada Boise complex.",
        "date": "04072015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-BofA Merrill Lynch hires Michael Casey from Morgan Stanley "
    },
    {
        "content": "NEW YORK  April 2 Bank of America's  Merrill Lynch said on Thursday it hired a broker away from Janney Montgomery Scott LLC in Scranton  Pennsylvania.",
        "date": "04022015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "ON THE MOVE-Merrill Lynch lands $100 mln managers from Janney Montgomery "
    },
    {
        "content": "WASHINGTON  April 1 As the U.S. Supreme Court on Wednesday considered the case of a Massachusetts homeowner battling his mortgage lender over a bankruptcy plan  several justices focused their attention on his unlikely ally: Bank of America Corp.",
        "date": "04012015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America at center stage in U.S. top court bankruptcy case "
    },
    {
        "content": "March 26 Bank of America Corp's John Addis  a senior Merrill Lynch executive in the firm's equities division  left the company as jobs were cut  Bloomberg reported on Thursday  citing people familiar with the matter.",
        "date": "03262015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-BofA's John Addis leaves amid job cuts - Bloomberg "
    },
    {
        "content": "BOSTON Bank of America Corp will not hold a shareholder vote on its decision to reunite the roles of chairman and chief executive officer  according to the bank's proxy statement filed on Thursday.",
        "date": "03262015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America skips vote sought by funds on CEO's roles "
    },
    {
        "content": "BOSTON  March 26 Bank of America Corp  will not hold a shareholder vote on its decision to reunite the roles of chairman and chief executive officer  according to the bank's proxy statement filed on Thursday.",
        "date": "03262015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Bank of America skips vote sought by funds on CEO's roles "
    },
    {
        "content": "BOSTON  March 26 Bank of America Corp  will not hold a shareholder vote on its decision to reunite the roles of chairman and chief executive officer  according to the bank's proxy statement filed on Thursday.",
        "date": "03262015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America skips vote sought by funds on Moynihan's roles "
    },
    {
        "content": "NEW YORK Bank of America Corp's Merrill Lynch unit has hired a southern California regional manager  Mark Kremers  from rival brokerage Morgan Stanley  BofA said Monday.",
        "date": "03232015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Merrill Lynch hires Morgan Stanley manager "
    },
    {
        "content": "NEW YORK  March 23 Bank of America Corp's  Merrill Lynch unit has hired a southern California regional manager  Mark Kremers  from rival brokerage Morgan Stanley  BofA said Monday.",
        "date": "03232015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "ON THE MOVE-Merrill Lynch hires Morgan Stanley manager "
    },
    {
        "content": "LONDON  March 23 Bank of America Merrill Lynch  has appointed Kevin Latter as head of investment banking in South Africa  according to an internal memo seen by Reuters on Monday.",
        "date": "03232015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-BofA names Kevin Latter head of South Africa investment banking "
    },
    {
        "content": "ZURICH/MILAN Switzerland's attorney general has seized more than 30 million Swiss francs ($32 million) in a criminal investigation linked to dairy group Parmalat and has charged an unnamed Italian citizen with money-laundering  bribery and forgery.",
        "date": "05282015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Swiss charge ex-Bank of America employee in Parmalat probe "
    },
    {
        "content": "ZURICH/MILAN  May 28 Switzerland's attorney general has seized more than 30 million Swiss francs ($32 million) in a criminal investigation linked to dairy group Parmalat and has charged an unnamed Italian citizen with money-laundering  bribery and forgery.",
        "date": "05282015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Swiss charge ex-Bank of America employee in Parmalat probe "
    },
    {
        "content": "ZURICH  May 28 Switzerland's attorney general said on Thursday it has seized more than 30 million Swiss francs ($31.67 million) in a criminal investigation linked to Parmalat and is charging an unnamed Italian citizen with money-laundering  bribery and forgery.",
        "date": "05282015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Swiss charge ex Bank of America employee in Parmalat probe "
    },
    {
        "content": "A federal judge rejected Bank of America Corp's request to dismiss a lawsuit in which Cook County  Illinois  accused the lender of targeting black and Hispanic borrowers in the Chicago area with subprime mortgages.",
        "date": "03202015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America must face Chicago-area predatory lending lawsuit "
    },
    {
        "content": "WASHINGTON Bank of America must allow its shareholders to vote on a proposal that calls for the company to spin off its investment banking business  after U.S. regulators told the bank it cannot exclude the proposal from its corporate ballot.",
        "date": "03182015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America must allow shareholder vote on breakup: SEC letter "
    },
    {
        "content": "March 17 Bank of America Corp appointed Ann Limberg as the head of philanthropic solutions and the family office of U.S. Trust  its ultra-high net worth unit.",
        "date": "03172015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Ann Limberg to head BofA US Trust's philanthropic  family offices "
    },
    {
        "content": "WASHINGTON  March 18 Bank of America  must allow shareholders to vote on a proposal that calls for the company to consider spinning off its investment banking business  after U.S. regulators told the bank it cannot exclude the proposal from its corporate ballot.",
        "date": "03182015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Bank of America must allow shareholder vote on breakup -SEC letter "
    },
    {
        "content": "WASHINGTON  March 18 Bank of America  must allow its shareholders to vote on a proposal that calls for the company to spin off its investment banking business  after U.S. regulators told the bank it cannot exclude the proposal from its corporate ballot.",
        "date": "03182015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America must allow shareholder vote on breakup -SEC letter "
    },
    {
        "content": "March 10 Bank of America Corp's Merrill Lynch unit has hired financial adviser Ronald Slevin and his wealth management team from Royal Bank of Canada for its New York office.",
        "date": "03102015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "ON THE MOVE-BofA Merrill Lynch hires adviser from RBC "
    },
    {
        "content": "March 6 Bank of America Corp's Merrill Lynch unit said it hired financial adviser Robert Debbs and his team from UBS Group AG for its Palm Beach  Florida office.",
        "date": "03062015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "ON THE MOVE-BofA Merrill Lynch hires advisers from UBS "
    },
    {
        "content": "NEW YORK A New York state appeals court on Thursday approved Bank of America Corp's $8.5 billion settlement with mortgage securities investors in its entirety.",
        "date": "03052015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BofA's $8.5 billion mortgage bond settlement wins approval "
    },
    {
        "content": "March 5 CBRE Group Inc  the world's largest commercial real estate services firm  is in talks to acquire Johnson Controls Inc's global workplace solutions business for more than $1 billion  according to people familiar with the matter.",
        "date": "03052015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "CBRE seeks to buy Johnson Controls' workplace solutions -sources "
    },
    {
        "content": "NEW YORK  March 5 Bank of America Corp's proposed $8.5 billion settlement with investors in mortgage-backed securities has upheld by a New York state appeals court.",
        "date": "03052015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BofA's $8.5 billion mortgage settlement upheld by appeals court "
    },
    {
        "content": "March 5   * New York state appeals court upholds Bank of America Corp  $8.5",
        "date": "03052015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-NYS appeals court approves Bank of America $8.5 billion mortgage securities settlement "
    },
    {
        "content": "March 3 Bank of America Corp's Merrill Lynch unit has hired Lewis Steinberg from Credit Suisse Group AG  to serve as its in-house tax expert  the New York Times reported  citing an internal memo.",
        "date": "03032015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Merrill Lynch hires Lewis Steinberg from Credit Suisse - NYT "
    },
    {
        "content": "A U.S. appeals court has reinstated claims against Bank of America Corp by a former call center employee who says the harassment she faced when she began dating a female coworker led to her termination.",
        "date": "03022015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "1st Circuit revives bisexual worker's claims against Bank of America "
    },
    {
        "content": "SINGAPORE Loh Boon Chye  head of Asia-Pacific global markets for Bank of America Merrill Lynch  has decided to leave the firm  an internal note said  more than two years after joining the U.S. bank from Deutsche Bank.",
        "date": "03022015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America-Merrill's Asia global markets head quits: note "
    },
    {
        "content": "SINGAPORE  March 2 Loh Boon Chye  head of Asia-Pacific global markets for Bank of America Merrill Lynch  has decided to leave the firm  an internal note said  more than two years after joining the U.S. bank from Deutsche Bank.",
        "date": "03022015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Bank of America-Merrill's Asia global markets head quits - note "
    },
    {
        "content": "SINGAPORE  March 2 Boon Chye Loh  head of Asia-Pacific global markets for Bank of America Merrill Lynch  has decided to leave the firm  an internal note said.",
        "date": "03022015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "MOVES-Bank of America-Merrill's Asia global markets head Boon Chye leaves firm-note "
    },
    {
        "content": "Bank of America Corp  said on Thursday that two members of its board of directors and its chief accounting officer will be leaving the company in coming weeks.",
        "date": "02262015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America accounting chief  two directors to step down "
    },
    {
        "content": "Feb 26 Bank of America Corp said on Thursday that two members of its board of directors and its chief accounting officer will be leaving the company in coming weeks.",
        "date": "02262015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 1-Bank of America accounting chief  two directors to step down "
    },
    {
        "content": "Feb 26 Bank of America Corp said Rudolf Bless will succeed Neil Cotty as chief accounting officer.",
        "date": "02262015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America names Rudolf Bless chief accounting officer "
    },
    {
        "content": "Feb 26 Oil and gas producer Penn Virginia Corp  is considering selling itself  the Wall Street Journal reported on Thursday  citing people familiar with the matter.",
        "date": "02262015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Oil and gas producer Penn Virginia looking to sell itself - WSJ "
    },
    {
        "content": "Morgan Stanley said it will pay $2.6 billion to the U.S. government to resolve potential claims stemming from the sale of mortgage bonds before the financial crisis  reducing its 2014 profit by more than half.",
        "date": "02262015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Morgan Stanley to pay $2.6 bln to settle mortgage-bond claims "
    },
    {
        "content": "Feb 25 Morgan Stanley said it will pay $2.6 billion to the U.S. government to resolve potential claims stemming from the sale of mortgage bonds before the financial crisis  reducing its 2014 profit by more than half.",
        "date": "02262015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-Morgan Stanley to pay $2.6 bln to settle mortgage-bond claims "
    },
    {
        "content": "NEW YORK For the last decade  Wall Street brokerages have had a pact not to sue brokers that leave their firms and try to take clients with them. Now Bank of America BAC.N Merrill Lynch  one of the founding signers of the truce  is taking steps to erode the agreement  industry lawyers say.",
        "date": "02232015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America chips away at brokerage industry truce "
    },
    {
        "content": "NEW YORK  Feb 25 (IFR) - Bank of America Merrill Lynch's head of equities for the Americas Henry Mulholland will retire after more than 25 years with the bank  according to an internal memo obtained by IFR.",
        "date": "02252015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "MOVES-Bank of America Americas equities boss Mulholland retires "
    },
    {
        "content": "Bank of America Corp  on Wednesday said it reached a $300 million settlement of a lawsuit brought by lenders that helped finance construction of the failed Fontainebleau Resort and Casino in Las Vegas  which filed for bankruptcy protection in June 2009.",
        "date": "02262015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America in $300 million Fontainebleau Las Vegas settlement "
    },
    {
        "content": "Feb 23 Goldman Sachs Group Inc said it could face a federal civil lawsuit after a government probe concluded that the bank had violated laws related to sale of residential mortgage-backed securities before the financial crisis.",
        "date": "02232015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-Goldman warns of federal lawsuit risk over mortgage bond sales "
    },
    {
        "content": "NEW YORK  Feb 23 For the last decade  Wall Street brokerages have had a pact not to sue brokers that leave their firms and try to take clients with them. Now Bank of America Merrill Lynch  one of the founding signers of the truce  is taking steps to erode the agreement  industry lawyers say.",
        "date": "02232015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "RPT - INSIGHT-Bank of America chips away at brokerage industry truce "
    },
    {
        "content": "Feb 25 Bank of America Corp on Wednesday said it reached a $300 million settlement of a lawsuit brought by lenders that helped finance construction of the failed Fontainebleau Resort and Casino in Las Vegas  which filed for bankruptcy protection in June 2009.",
        "date": "02262015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America in $300 mln Fontainebleau Las Vegas settlement "
    },
    {
        "content": "NEW YORK  Feb 23 For the last decade  Wall Street brokerages have had a pact not to sue brokers that leave their firms and try to take clients with them. Now Bank of America Merrill Lynch  one of the founding signers of the truce  is taking steps to erode the agreement  industry lawyers say.",
        "date": "02232015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "INSIGHT-Bank of America chips away at brokerage industry truce "
    },
    {
        "content": "NEW YORK Investors worldwide poured $7.1 billion into bond funds in the week ended Feb. 18  with riskier high-yield bond funds attracting fresh inflows on signs global growth is improving  data from a Bank of America Merrill Lynch Global Research report showed on Friday.",
        "date": "02202015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bond funds worldwide attract $7.1 billion  7th straight week of inflows: BofA "
    },
    {
        "content": "WASHINGTON U.S. Attorney General Eric Holder said on Tuesday he has given federal prosecutors a 90-day deadline to decide whether they can bring cases against individuals for their roles in the 2008 financial crisis.",
        "date": "02172015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "U.S. identifying people to target for role in mortgage crisis "
    },
    {
        "content": "WASHINGTON  Feb 17 U.S. Attorney General Eric Holder said on Tuesday he has given federal prosecutors a 90-day deadline to decide whether they can bring cases against individuals for their roles in the 2008 financial crisis.",
        "date": "02172015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 2-U.S. identifying people to target for role in mortgage crisis "
    },
    {
        "content": "NEW YORK Bank of America Corp  cut Chairman and Chief Executive Officer Brian Moynihan's pay by 7 percent in 2014  a source familiar with the matter said on Tuesday  as its full-year profit fell 58 percent on higher legal settlements.",
        "date": "02182015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BofA chief Moynihan's pay cut 7 percent to $13 million: source "
    },
    {
        "content": "NEW YORK  Feb 17 Top U.S. hedge fund management firms  including David Einhorn's Greenlight Capital and Philippe Laffont's Coatue Management  reduced their stakes in Apple Inc  during the fourth quarter  ahead of the iPhone maker's strong rally in 2015  according to regulatory filings.",
        "date": "02172015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "HIGHLIGHTS-Top U.S. hedge funds cut Apple stakes ahead of all-time high "
    },
    {
        "content": "NEW YORK Top U.S. hedge fund management firms  including David Einhorn's Greenlight Capital and Philippe Laffont's Coatue Management  reduced their stakes in Apple Inc during the fourth quarter  ahead of the iPhone maker's strong rally in 2015  according to regulatory filings.",
        "date": "02182015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Top U.S. hedge funds cut Apple stakes ahead of all-time high "
    },
    {
        "content": "NEW YORK  Feb 17 Top U.S. hedge fund management firms  including David Einhorn's Greenlight Capital and Philippe Laffont's Coatue Management  cut their stakes in Apple Inc  during the fourth quarter  ahead of the iPhone maker's strong rally this year  according to regulatory filings.",
        "date": "02172015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "CORRECTED-HIGHLIGHTS-Top U.S. hedge funds scale back on Apple ahead of all-time high "
    },
    {
        "content": "Bank of America Corp used its government-backed U.S. banking unit for years to finance controversial trades that helped clients avoid taxes  the Wall Street Journal reported  citing internal documents and people familiar with the matter.",
        "date": "02112015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America's U.S. banking unit helped fund tax-minimization trades: WSJ "
    },
    {
        "content": "Feb 11 Bank of America Corp used its government-backed U.S. banking unit for years to finance controversial trades that helped clients avoid taxes  the Wall Street Journal reported  citing internal documents and people familiar with the matter.",
        "date": "02112015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BofA's U.S. banking unit helped fund tax-minimization trades-WSJ "
    },
    {
        "content": "Deutsche Bank said it expects Citigroup Inc  to buy back $1 billion in shares every quarter and other U.S. banks to modestly boost dividends and share buybacks as part of their capital deployment plans under the Federal Reserve's stress test.",
        "date": "02102015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Deutsche Bank expects Citi to buy back $1 billion in shares every quarter "
    },
    {
        "content": "* Federally insured U.S. banking unit financed tax trades for hedge funds  others  Wall Street Journal says",
        "date": "02112015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America's U.S. deposit-taking unit financed tax trades -WSJ "
    },
    {
        "content": "HONG KONG/SINGAPORE  Feb 9 Tesco Plc  rebuffed an approach from billionaire Dhanin Chearavanont in December to buy the British retailer's Thai unit  but undeterred  the tycoon is building financial firepower for another attempt  people familiar with the matter said.",
        "date": "02102015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "RPT-UPDATE 1-Tycoon Dhanin unfazed after Tesco rebuffs approach for Thai unit-sources "
    },
    {
        "content": "NEW YORK A federal judge on Tuesday rejected Bank of America Corp's bid to throw out a jury verdict finding it liable for the sale of questionable loans to Fannie Mae and Freddie Mac before the financial crisis  which led to a $1.27 billion civil penalty.",
        "date": "02032015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "BofA fails to overturn $1.27 billion Countrywide fraud verdict "
    },
    {
        "content": "NEW YORK  Feb 3 A federal judge on Tuesday rejected Bank of America Corp's bid to throw out a jury verdict finding it liable for the sale of questionable loans to Fannie Mae and Freddie Mac before the financial crisis  which led to a $1.27 billion civil penalty.",
        "date": "02032015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America fails to overturn Countrywide fraud verdict "
    },
    {
        "content": "Feb 3   * U.S. judge rejects Bank of America Corp bid to overturn jury verdict",
        "date": "02032015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-Bank of America loses bid to void \"Hustle\" mortgage fraud verdict "
    },
    {
        "content": "Diversified chemical maker Tronox Ltd is nearing a deal to buy a soda-ash business from rival FMC Corp for more than $1.5 billion  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "02032015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Tronox to buy FMC's soda-ash unit for more than $1.5 billion: WSJ "
    },
    {
        "content": "Feb 3 Diversified chemical maker Tronox Ltd  is nearing a deal to buy a soda-ash business from rival FMC Corp for more than $1.5 billion  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "02032015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Tronox to buy FMC's soda-ash unit for more than $1.5 bln - WSJ "
    },
    {
        "content": "NEW YORK The rising value of the U.S. dollar could force big American banks  including Citigroup Inc  to hold more capital  reducing their profitability and attractiveness to stock investors  according to executives and an analyst.",
        "date": "02032015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "U.S. dollar's strength to add to banks' capital needs "
    },
    {
        "content": "HONG KONG/SHANGHAI Lender BOC Hong Kong Holdings Ltd  is considering a sale of subsidiary Nanyang Commercial Bank (NCB) that could fetch about $6 billion  in a bid to stop cannibalising the China business of its parent  people familiar with the matter said.",
        "date": "01292015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Exclusive: BOC Hong Kong considering sale of $6 billion bank unit - sources "
    },
    {
        "content": "NEW YORK  Jan 26 JPMorgan Chase & Co  Bank of America Corp and Wells Fargo & Co are closing branches early in the New York City region on Monday  spokespeople said  due to a snow storm that is expected to dump feet of snow across the area. Here is what the banks said:",
        "date": "01262015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "JPMorgan  BofA  Wells Fargo closing NYC branches early "
    },
    {
        "content": "NEW YORK  Jan 20 U.S. Trust  Bank of America Corp's private wealth management arm for high net worth clients  said on Tuesday it hired 15 advisers across the U.S. during December.",
        "date": "01202015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "ON THE MOVE-Bank of America's U.S. Trust hires 15 in December "
    },
    {
        "content": "* Swiss National Bank scraps three-year-old euro cap on franc",
        "date": "01152015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "US STOCKS-Wall St drops for 5th day on global weakness worry; Intel down late "
    },
    {
        "content": "* Indexes off: Dow 0.4 pct  S&P 0.6 pct  Nasdaq 1.1 pct   (Updates to early afternoon)",
        "date": "01152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "US STOCKS-Wall St drops for 5th day on global economy  earnings concern "
    },
    {
        "content": "Bank of America Corp   the second largest U.S. bank by assets  reported a 14 percent fall in quarterly profit as a decline in bond yields further crimped earnings.",
        "date": "01152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America fourth-quarter profit hurt by low interest rates "
    },
    {
        "content": "* Bond trading revenue falls 30 pct to $1.46 bln   (Adds links to BreakingViews column  graphic and story about wealth unit results)",
        "date": "01152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "UPDATE 5-Bank of America 4th-qtr profit hurt by low interest rates "
    },
    {
        "content": "* Swiss National Bank moves to scrap 3-year euro cap on the franc",
        "date": "01152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "US STOCKS-Wall St falls for 5th day on global economy  earnings concern "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 15 (Fitch) Bank of America Corporation's (BAC) stated full tax  equivalent fourth quarter earnings of $3.05 billion were relatively clean   according to Fitch Ratings. It was the first quarter in some time not to be  overly marred by sizable litigation charges. Nevertheless the company did incur  $400 million of litigation expense this quarter  though this is down  significantly from the other quarters this past year wh",
        "date": "01152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Fitch: Good  Clean Fourth Quarter Earnings for Bank of America "
    },
    {
        "content": "* Indexes off: Dow 0.1 pct  S&P 0.2 pct  Nasdaq 0.4 pct   (Updates to late morning  adds Philly Fed data)",
        "date": "01152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "US STOCKS-Wall St flat in volatile trade after Swiss move "
    },
    {
        "content": "* Indexes off: Dow 0.37 pct  S&P 0.41 pct  Nasdaq 0.62 pct   (Updates to market open)",
        "date": "01152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "US STOCKS-Wall St drops after Swiss move; banks tumble "
    },
    {
        "content": "Jan 15 Bank of America Corp Chief Financial Officer Bruce Thompson said Thursday on a conference call with analysts:  * Asset sensitivity increased in Q4  bank now expects to earn $3.7 billion from rise in rates  * In Q1 2015  the bank expects to shift reporting segments  * BofA is moving its small business banking unit out of consumer bank and into commercial bank  * BofA is also moving its mortgage unit back into its consumer bank  * Bank hopes to have legacy asset servicing expens",
        "date": "01152015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "BRIEF-BofA CFO: expect more benefit from rising rates "
    },
    {
        "content": "ST. LOUIS Under pressure from its U.S. regulator  Bank of America has  shifted its compliance group from its legal department to its risk oversight group  a source familiar with the matter said.",
        "date": "01082015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bank of America shifts compliance team out of legal unit after OCC pressure: source "
    },
    {
        "content": "ST. LOUIS  Jan 7 Under pressure from its U.S. regulator  Bank of America has  shifted its compliance group from its legal department to its risk oversight group  a source familiar with the matter said.",
        "date": "01082015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Bank of America shifts compliance team out of legal unit after OCC pressure -source "
    },
    {
        "content": "NEW YORK Investors worldwide poured $21.5 billion into bond funds in the weekly reporting period ended Wednesday  before Friday's data showing U.S. job growth rose solidly in January  data from a Bank of America Merrill Lynch Global Research report showed on Friday.",
        "date": "02062015",
        "name": "Bank of America Corporation",
        "news_type": "topStory",
        "symbol": "BAC",
        "title": "Bond funds worldwide attract most inflows since Sept '09: BofA "
    },
    {
        "content": "NEW YORK A startup backed by Wall Street banks plans to create a digital marketplace for research and data products in a potentially ambitious foray into the financial technology and information businesses  people familiar with the matter said.",
        "date": "02062015",
        "name": "Bank of America Corporation",
        "news_type": "normal",
        "symbol": "BAC",
        "title": "Exclusive: Startup backed by Goldman  other banks may offer new research  data platform "
    }
]