[
    {
        "content": "* Booz Allen Hamilton Holding Corp announces second quarter fiscal 2018 results",
        "date": "11062017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen Hamilton Holding reports Q2 earnings per share $0.47 "
    },
    {
        "content": "* U.S. Army awards Booz Allen a Basic Ordering Agreement to support the Army Cloud Computing Enterprise Transformation",
        "date": "10262017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen wins Basic Ordering Agreement from U.S. Army "
    },
    {
        "content": "* BOOZ ALLEN HAMILTON ENTERS INTO AGREEMENT TO ACQUIRE MORPHICK  INC. EXTENDING BOOZ ALLEN’S LEADERSHIP IN ADVANCED CYBER DEFENSE SERVICES Source text for Eikon: Further company coverage:",
        "date": "10202017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-BOOZ ALLEN HAMILTON ENTERS AGREEMENT TO ACQUIRE MORPHICK INC "
    },
    {
        "content": "* Joint Navy and Marine Corps Partnership awards Booz Allen $87.2m contract to advance strategic initiatives of the Naval Aviation enterprise",
        "date": "09282017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Joint Navy and Marine Corps partnership awards Booz Allen $87.2m contract "
    },
    {
        "content": "* Joint Navy and Marine Corps Partnership awards Booz Allen $87.2m contract to advance strategic initiatives of the naval aviation enterprise",
        "date": "09282017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "normal",
        "symbol": "BAH",
        "title": "BRIEF-Joint navy and Marine Corps Partnership awards Booz Allen with $87.2 mln contract "
    },
    {
        "content": "* Booz Allen Hamilton announces first quarter fiscal 2018 results",
        "date": "08072017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen Hamilton reports Q1 adjusted earnings of $0.53/shr "
    },
    {
        "content": "Booz Allen Hamilton Holding Corp said the U.S. Department of Justice (DOJ) was investigating some of its cost accounting and indirect cost charging practices with the government  sending its shares down 12 percent after the bell.",
        "date": "06152017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "normal",
        "symbol": "BAH",
        "title": "Booz Allen Hamilton says DOJ investigating its accounting practices "
    },
    {
        "content": "June 15 The U.S. Department of Justice is investigating some of the ways Booz Allen Hamilton Holding Corp   one of the largest consulting firms in the world  charges the government for  services and accounts for costs  the company said in a filing on Thursday that sent its shares down 12 percent after the bell.",
        "date": "06152017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "normal",
        "symbol": "BAH",
        "title": "UPDATE 3-Booz Allen Hamilton says DOJ investigating its accounting practices "
    },
    {
        "content": "June 15 Booz Allen Hamilton Holding Corp said on Thursday that the U.S. Department of Justice was conducting an investigation related to some of its cost accounting and indirect cost charging practices with the U.S. government.",
        "date": "06152017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "normal",
        "symbol": "BAH",
        "title": "REFILE-Booz Allen Hamilton says DOJ investigating accounting practices "
    },
    {
        "content": "* Booz Allen awarded 5-year  $72 million contract to support U.S. Navy Command and Control Systems Program Office",
        "date": "05302017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen awarded 5-year contract to support U.S. Navy Command & Control Systems Program Office "
    },
    {
        "content": "* Booz allen hamilton announces fourth quarter and full-year fiscal 2017 results",
        "date": "05222017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen Hamilton Holding Q4 earnings per share $0.44 "
    },
    {
        "content": "* Navy’s Tactical Networks Program Office awards Booz Allen $96.1M contract to provide secure  reliable networks for U.S. Navy forces",
        "date": "05172017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen says awarded $96.1 mln contract by U.S. Navy’s Tactical Networks Program Office "
    },
    {
        "content": "* Firm expects to increase Clements Ferry facility headcount by more than 90 this year",
        "date": "05112017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen Hamilton Holding opens new  expanded office in Charleston  S.C. "
    },
    {
        "content": "* Booz Allen Hamilton announces pricing of senior notes offering",
        "date": "04202017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen Hamilton announces pricing of senior notes offering "
    },
    {
        "content": "* Booz Allen Hamilton announces launch of senior notes offering",
        "date": "04172017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen Hamilton announces launch of senior notes offering "
    },
    {
        "content": "* Booz Allen Hamilton Holding Corp - on April 6  unit of co entered into an interest rate swap agreement",
        "date": "04112017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen Hamilton Holding Corp- unit of co enters into an interest rate swap agreement "
    },
    {
        "content": "* Asx alert-d13 mesmer technology licensed to Booz Allen Hamilton-d13.ax",
        "date": "03162017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Department 13 International says mesmer technology licensed to Booz Allen Hamilton "
    },
    {
        "content": "* Booz Allen Hamilton Holding Corp - units entered fourth amendment to credit agreement  dated as of July 31  2012 - sec filing",
        "date": "02072017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen Hamilton- units enter 4th amendment to credit agreement "
    },
    {
        "content": "* Booz Allen Hamilton announces third quarter fiscal 2017 results",
        "date": "01302017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen Hamilton reports Q3 earnings per share $0.37 "
    },
    {
        "content": "* Announced that company's management is exploring possible repricing for borrower's existing term loan B credit facility",
        "date": "01232017",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen Hamilton explores possible repricing for borrower's existing term loan B credit facility "
    },
    {
        "content": "* Booz Allen Hamilton agrees to acquire digital service business aquilent",
        "date": "11292016",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen Hamilton agrees to acquire digital service business Aquilent "
    },
    {
        "content": "* FY2017 earnings per share view $1.73  revenue view $5.64 billion -- Thomson Reuters I/B/E/S",
        "date": "11022016",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen Hamilton reports Q2 earnings per share $0.41 "
    },
    {
        "content": "WASHINGTON Booz Allen Hamilton said on Thursday it had hired a former FBI chief to conduct an external review of its security practices  after the consulting firm learned for the second time in three years that an employee working under contract with the National Security Agency had been charged with stealing classified information.",
        "date": "10272016",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "Booz Allen reviewing security after arrest of NSA contractor "
    },
    {
        "content": "* Issued statement on actions following arrest of former employee  from Craig Veith  vice president  external relations",
        "date": "10272016",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "normal",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen Hamilton asks ex-FBI director to conduct external review "
    },
    {
        "content": "* Moody's changes rating outlook of Booz Allen Hamilton to negative",
        "date": "10072016",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Moody's changes rating outlook of Booz Allen Hamilton to negative "
    },
    {
        "content": "WASHINGTON  Oct 5 The FBI has arrested a National Security Agency contractor on charges of stealing highly classified information and is investigating possible links to a recent leak of secret hacking tools used to break into the computers of adversaries such as Russia and China  U.S. officials said on Wednesday.",
        "date": "10052016",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "UPDATE 3-NSA contractor charged with stealing secret data "
    },
    {
        "content": "* U.S. Marine Corps awards Booz Allen Hamilton $48.6 million contract to help improve resource allocation  Source text for Eikon:  Further company coverage:",
        "date": "09152016",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-U.S. Marine Corps awards Booz Allen Hamilton $48.6 mln contract "
    },
    {
        "content": "NEW YORK Stocks on Wall Street rose Wednesday led by the energy sector as oil prices rallied and as financials gained on the increasing likelihood of an interest rate hike after strong economic data. | Video ",
        "date": "10052016",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "normal",
        "symbol": "BAH",
        "title": "Energy  bank stocks lead Wall Street higher "
    },
    {
        "content": "* Indexes up: Dow 0.62 pct  S&P 0.43 pct  Nasdaq 0.5 pct   (Updates to market close)",
        "date": "10052016",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "normal",
        "symbol": "BAH",
        "title": "US STOCKS-Energy  bank stocks lead Wall St higher "
    },
    {
        "content": "* \"continue to cooperate fully with government on its investigation into this serious matter\"",
        "date": "10052016",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "normal",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen issues statement concerning arrest by FBI of one of Co's employees "
    },
    {
        "content": "A U.S. appeals court on Tuesday said a federal judge erred in tossing out a lawyer's age and gender bias claims against Booz Allen Hamilton Inc without first reviewing the testimony of other female former employees of the consulting firm who said they faced the same glass ceiling.",
        "date": "08242016",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "Judge must review Booz Allen workers' testimony in bias case -  4th Circuit "
    },
    {
        "content": "* Revolving credit facility and term loan a (TLA) matures on June 30  2021 and term loan b (TLB) matures on June 30  2023",
        "date": "07182016",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen Hamilton Holding closes third amendment to credit agreement "
    },
    {
        "content": "* Management is exploring possible repricing  maturity extension amendment for borrower's outstanding $1 618 million of indebtedness",
        "date": "06172016",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen Hamilton Holding is exploring possible repricing  maturity extension amendment for borrower's outstanding $1 618 mln of indebtedness "
    },
    {
        "content": "* Upon completion of offering  Carlyle will own approximately 11.3% of outstanding common stock of booz allen",
        "date": "05242016",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen Hamilton says Carlyle Group affiliate's 13 mln shares priced at $28.20 per share "
    },
    {
        "content": "* Q4 earnings per share view $0.41  revenue view $1.37 billion -- Thomson Reuters I/B/E/S",
        "date": "05182016",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen Hamilton posts Q4 adj. earnings $0.41/shr "
    },
    {
        "content": "* Announced sale of an aggregate of 13 million shares of class a common stock by an affiliate of Carlyle Group (",
        "date": "05232016",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "BRIEF-Booz Allen says Carlyle Group affiliate to sell 13 mln shares "
    },
    {
        "content": "Lockheed Martin Corp is exploring merging some of its information technology and services businesses  with a value of about $4 billion  with another government services contractor  people familiar with the matter said on Friday.",
        "date": "10022015",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "normal",
        "symbol": "BAH",
        "title": "Lockheed Martin mulls merger of some services units with peer -sources "
    },
    {
        "content": "CACI International Inc  Booz Allen Hamilton Holdings and Leidos Holdings Inc have held exploratory discussions to acquire Computer Sciences Corp's public sector division  people familiar with the matter said on Thursday.",
        "date": "06042015",
        "name": "Booz Allen Hamilton Holding Corporation",
        "news_type": "topStory",
        "symbol": "BAH",
        "title": "Exclusive: CACI  Booz Allen  Leidos eye CSC's government unit - sources "
    }
]