[
    {
        "content": "SAO PAULO  Nov 17 Brazil's Braskem  the largest producer of thermoplastic resins in the Americas  will build a pilot plant in partnership with Denmark's Haldor Topsoe to test the use of sugar to produce a key ingredient in PET making.",
        "date": "11172017",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Braskem to build plant in test using sugar to make plastic bottles "
    },
    {
        "content": "SAO PAULO  Oct 31 Brazilian petrochemical producer Braskem SA on Tuesday denied reports that LyondellBasell Industries NV had approached it with a takeover offer.",
        "date": "10312017",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Braskem denies report of LyondellBasell takeover offer "
    },
    {
        "content": "SAO PAULO Brazilian construction conglomerate Odebrecht SA said on Monday that it wants to keep Braskem SA  in its investment portfolio  after a report that LyondellBasell Industries NV  had approached the petrochemicals producer about a potential takeover.",
        "date": "10312017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Odebrecht says it wants to keep Braskem stake  following takeover report "
    },
    {
        "content": "SAO PAULO  Oct 30 Brazilian construction conglomerate Odebrecht SA said on Monday that it wants to keep Braskem SA in its investment portfolio  after a report that LyondellBasell Industries NV had approached the petrochemicals producer about a potential takeover.",
        "date": "10302017",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "UPDATE 1-Odebrecht says it wants to keep Braskem stake  following takeover report "
    },
    {
        "content": "SAO PAULO  Oct 30 Brazil's construction conglomerate Odebrecht SA said in a statement on Monday the company intends to \"maintain Braskem as part of the group's investments\".",
        "date": "10302017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Brazil's Odebrecht says wants to keep Braskem as part of the group's investments "
    },
    {
        "content": "LyondellBasell Industries NV  has approached Brazil's Braskem SA   for a potential takeover  valuing the petrochemicals company at more than $10 billion  the Wall Street Journal reported on Monday.",
        "date": "10302017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "LyondellBasell approaches Brazil's Braskem for takeover: WSJ "
    },
    {
        "content": "Oct 30 LyondellBasell Industries NV has approached Brazil's Braskem SA  for a potential takeover  valuing the petrochemicals company at more than $10 billion  the Wall Street Journal reported on Monday.",
        "date": "10302017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "UPDATE 1-LyondellBasell approaches Brazil's Braskem for takeover-WSJ "
    },
    {
        "content": "Oct 30 LyondellBasell Industries NV has approached Brazil's Braskem SA  for a potential takeover  valuing the petrochemicals company at more than $10 billion  the Wall Street Journal reported on Monday.",
        "date": "10302017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "LyondellBasell approaches Brazil's Braskem for takeover-WSJ "
    },
    {
        "content": "* LyondellBasell makes takeover approach to Braskem - WSJ  citing sources",
        "date": "10302017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "BRIEF-LyondellBasell makes takeover approach to Braskem - WSJ "
    },
    {
        "content": "HOUSTON/SAO PAULO Brazil's Braskem has terminated a contract to buy light virgin naphtha and natural gasoline from Venezuela's state-run oil company PDVSA that would expire this month  the petrochemical company said on Thursday.",
        "date": "09222017",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Exclusive: Brazil's Braskem terminates supply contract with Venezuela's PDVSA "
    },
    {
        "content": "BRASILIA  Sept 20 Brazilian petrochemical company Braskem SA said it is not studying a possible share restructuring  according to a securities filing late on Wednesday.",
        "date": "09202017",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Braskem denies reports on merger of stock classes "
    },
    {
        "content": "RIO DE JANEIRO Brazilian petrochemical company Braskem SA said on Thursday it has signed an agreement to settle a class action lawsuit with a $10 million payment.",
        "date": "09142017",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Braskem agrees to settle U.S. class action for $10 million "
    },
    {
        "content": "RIO DE JANEIRO  Sept 14 Brazilian petrochemical company Braskem SA said on Thursday it has signed an agreement to settle a class action lawsuit with a $10 million payment.",
        "date": "09142017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Brazil's Braskem agrees to settle U.S. class action for $10 mln "
    },
    {
        "content": "SAO PAULO  Aug 16 Brazil's Braskem SA   Latin America's largest petrochemical company  posted second-quarter net income of 1.142 billion reais ($360 million)  up from 275 milion reais a year earlier  according to a securities filing on Wednesday.",
        "date": "08162017",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Braskem second-quarter net income jumps to 1.142 bln reais "
    },
    {
        "content": "SAO PAULO The controlling shareholders of Brazil-based petrochemical producer Braskem SA are considering moving to a U.S. headquarters as they study options to simplify its ownership structure and improve corporate governance  newspapers reported on Friday.",
        "date": "08042017",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Braskem eyes U.S. move amid changes to shareholder pact: media reports "
    },
    {
        "content": "SAO PAULO  Aug 4 The controlling shareholders of Brazil-based petrochemical producer Braskem SA are considering moving to a U.S. headquarters as they study options to simplify its ownership structure and improve corporate governance  newspapers reported on Friday.",
        "date": "08042017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Braskem eyes U.S. move amid changes to shareholder pact -media reports "
    },
    {
        "content": "SAO PAULO Brazil's Petroleo Brasileiro SA began discussions with construction company Odebrecht SA [ODBES.UL] to revise the shareholder accord in petrochemical company Braskem SA  the oil company said on Tuesday.",
        "date": "07182017",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Petrobras and Odebrecht in talks to revise Braskem shareholder accord: filing "
    },
    {
        "content": "SAO PAULO  July 18 Brazil's Petroleo Brasileiro SA began discussions with construction company Odebrecht SA to revise the shareholder accord in petrochemical company Braskem SA  the oil company said on Tuesday.",
        "date": "07182017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Brazil's Petrobras and Odebrecht in talks to revise Braskem shareholder accord -filing "
    },
    {
        "content": "SAO PAULO  July 5 Brazilian petrochemical company Braskem may be suspended from Level 1 trading at the São Paulo Stock Exchange after failing to submit certain financial statements within a deadline  stock market operator B3 told Reuters on Wednesday.",
        "date": "07052017",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "UPDATE 2-Brazil's Braskem faces stock market suspension "
    },
    {
        "content": "SAO PAULO  July 5 Brazilian petrochemical company Braskem may be suspended from Level 1 trading at the São Paulo Stock Exchange after failing to submit certain financial statements within a deadline  stock market operator B3 told Reuters in an emailed statement on Wednesday.",
        "date": "07052017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Brazil's Braskem faces stock market suspension "
    },
    {
        "content": "* Braskem SA says  board formally approved final investment decision to proceed with polypropylene production line in americas",
        "date": "06222017",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "BRIEF-Braskem approves construction of polypropylene production line "
    },
    {
        "content": "BRASILIA  June 22 Braskem SA  Latin America's largest petrochemical company  will invest $675 million to build a sixth U.S.-based polypropylene-production plant  the company said on Wednesday.",
        "date": "06222017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Braskem to invest $675 mln in 6th U.S.-based polypropylene plant "
    },
    {
        "content": "BRASILIA  June 6 Braskem SA  Latin America's largest petrochemical company  said on Tuesday that it had obtained approval from a Brazilian court for its leniency deal in a corruption case involving political kickbacks at Brazil's Petrobras .",
        "date": "06062017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Braskem says wins final approval in global leniency deal "
    },
    {
        "content": "SAO PAULO  May 15 Braskem SA  Latin America's largest petrochemical company  on Monday gave a mixed 2017 forecast after its first-quarter profit more than doubled on a growing Mexican operation and stronger demand from Brazilian builders and carmakers.",
        "date": "05152017",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "UPDATE 2-Brazil's Braskem gives mixed forecast after strong first quarter "
    },
    {
        "content": "* Braskem executive says company expects to boost sales volumes in the second half on a sequential basis",
        "date": "05152017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "BRIEF-Braskem aims to boost sales sequentially in second half of 2017 "
    },
    {
        "content": "SAO PAULO  May 15 Braskem SA has seen an improvement in Brazilian demand for its plastics and other petrochemical products  especially in the automotive and construction industries  Chief Executive Fernando Musa told journalists on Monday.",
        "date": "05152017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Braskem seeing stronger demand from Brazil's auto  building sectors "
    },
    {
        "content": "NEW YORK  March 31 Brazilian petrochemical company Braskem SA must face the main part of a shareholder lawsuit over its role in a massive bribery scandal that engulfed Brazil's state-owned oil company Petrobras SA   a U.S. judge has ruled.",
        "date": "03312017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Brazil's Braskem must face U.S. lawsuit over Petrobras scandal "
    },
    {
        "content": "SAO PAULO  Feb 22 Petrochemical producer Braskem SA expects demand for plastic resins to grow around 2 percent this year from 2016  Chief Executive Fernando Musa said on a Wednesday earnings call.",
        "date": "02222017",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Braskem sees Brazil plastics market growing 2 pct in 2017 -CEO "
    },
    {
        "content": "SAO PAULO  Feb 22 Brazil's Braskem SA is trimming investments this year as it winds down spending on a new plant in Mexico and cuts back strategic new projects after a bribery settlement hammered earnings last year  according to a Wednesday securities filing.",
        "date": "02222017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Brazil's Braskem cuts capex after fine hits earnings "
    },
    {
        "content": "SAO PAULO Brazil's state-run oil company Petróleo Brasileiro SA on Friday denied a report it is challenging an accord closed by Brazilian petrochemical company Braskem in U.S. courts.",
        "date": "02032017",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Petrobras denies challenging Braskem accord in U.S. courts "
    },
    {
        "content": "SAO PAULO  Jan 27 Brazilian petrochemical company Braskem SA agreed to buy a controlling stake in environmental services company Cetrel SA for 610 million reais ($194 million) from Odebrecht Utilities SA  Braskem said on Friday in a securities filing.",
        "date": "01272017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Braskem buys Odebrecht stake in Brazil environmental services firm Cetrel "
    },
    {
        "content": "NEW YORK  Jan 26 A U.S. judge on Thursday sentenced the Brazilian petrochemical company Braskem SA  to pay a $632.6 million criminal fine  in connection with a corruption case that led to the largest foreign bribery settlement in U.S. history.",
        "date": "01262017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "U.S. judge approves Braskem $633 mln fine in record corruption case "
    },
    {
        "content": "* Braskem sa - announces startup of its new utec ultra high molecular weight polyethylene (uhmwpe) production plant at its la porte  texas site  Source text for Eikon:  Further company coverage:",
        "date": "01182017",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "BRIEF-Braskem SA announces startup of UTEC ultra high molecular weight polyethylene production plant at Texas site "
    },
    {
        "content": "SAO PAULO  Jan 6 Stricter legal and regulatory scrutiny may slow mergers and acquisitions in Brazil this year  compounding the impact of a harsh recession and lingering political turmoil that is keeping buyers and sellers at odds over valuations  bankers and lawyers said.",
        "date": "01062017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "UPDATE 2-Brazil's M&A deals may slow this year because of stricter due diligence "
    },
    {
        "content": "SAO PAULO  Jan 6 Stricter legal and regulatory scrutiny may slow mergers and acquisitions in Brazil this year  compounding the impact of a harsh recession and lingering political turmoil that is keeping buyers and sellers at odds over valuations  bankers and lawyers said.",
        "date": "01062017",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Stricter due diligence may slow Brazil M&A deals this year "
    },
    {
        "content": "SAO PAULO The Brazilian construction firm Odebrecht SA [ODBES.UL] and petrochemical company Braskem SA  will pay 1.4 billion reais ($417.5 million) to the U.S. and Swiss governments as part of a settlement in a sweeping corruption case  a source close to the negotiations told Reuters Tuesday",
        "date": "12202016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Odebrecht  Braskem to pay $417.5 million in fines to U.S.  Swiss governments: report "
    },
    {
        "content": "SAO PAULO Shares in Braskem SA soared 10 percent in their biggest intraday gain in more than two months on Friday after Latin America's largest petrochemical firm said it is in advanced talks with authorities in Brazil and the United States for a leniency agreement related to a massive corruption scandal.",
        "date": "12022016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Braskem shares jump as deal in graft probe seen imminent "
    },
    {
        "content": "SAO PAULO  Nov 10 Brazil's Braskem SA   the largest petrochemical producer in Latin America  is watching to see if U.S. President-elect Donald Trump's protectionist campaign talk affects its huge new plant in Mexico  Chief Executive Officer Fernando Musa said on Thursday.",
        "date": "11102016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "UPDATE 1-Braskem CEO watching if Trump presidency affects Mexican plant "
    },
    {
        "content": "SAO PAULO  Nov 10 Brazil's Braskem SA   Latin America's largest petrochemical producer  posted third-quarter net income of 818 million reais ($253 million)  down 45 percent from a year earlier  a securities filing showed on Thursday.",
        "date": "11102016",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Brazil's Braskem posts 45 pct drop in third-quarter profit "
    },
    {
        "content": "SAO PAULO  Oct 20 Brazilian petrochemical company Braskem SA said there was no formal agreement to sell its chemical products distributing unit known as quantiQ  according to a securities filing on Thursday  in the wake of media reports saying the unit may be sold.",
        "date": "10202016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Braskem says no formal pact to sell unit quantiQ "
    },
    {
        "content": "SAO PAULO  Oct 6 A former chief executive of Braskem SA is working with investigators in Brazil to establish the petrochemical company's responsibility in a political graft scandal involving its shareholders  according to a newspaper report on Thursday.",
        "date": "10062016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Braskem ex-CEO eyes plea bargain in Brazil corruption probe -Valor "
    },
    {
        "content": "SAO PAULO  Oct 3 Brazil's Braskem SA  Latin America's largest petrochemical producer  said on Monday it had entered talks with the U.S. Department of Justice and the Securities and Exchange Commission regarding an internal graft probe started in 2015.",
        "date": "10032016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "UPDATE 1-Braskem enters talks with U.S. officials in graft case "
    },
    {
        "content": "SAO PAULO  Oct 3 Brazil's Braskem SA  Latin America's largest petrochemical producer  said on Monday it had entered talks with the U.S. Department of Justice and the Securities and Exchange Commission regarding an internal graft probe started in 2015.",
        "date": "10032016",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Brazil's Braskem enters talks with U.S. authorities in graft case "
    },
    {
        "content": "Braskem SA  Latin America's largest petrochemical company  said on Thursday it will start talks with U.S. authorities over accusations of corruption linked to a massive graft investigation in Brazil.",
        "date": "08042016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Braskem to start talks with U.S. authorities over corruption accusations "
    },
    {
        "content": "SAO PAULO  Aug 4 Braskem SA  Latin America's largest petrochemical company  said on Thursday it will start talks with U.S. authorities over accusations of corruption linked to a massive graft investigation in Brazil.",
        "date": "08042016",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "UPDATE 1-Braskem to start talks with US authorities over corruption accusations "
    },
    {
        "content": "SAO PAULO Braskem SA said on Tuesday controlling shareholder Odebrecht Serviços e Participações SA has placed the entire stake it has in the firm as collateral for outstanding bank loans  in a sign of Odebrecht's challenging debt refinancing outlook.",
        "date": "07202016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Odebrecht puts Braskem stake as collateral for loans "
    },
    {
        "content": "SAO PAULO  July 19 Braskem SA  Latin America's biggest petrochemical firm  said on Tuesday that controlling shareholder Odebrecht Serviços e Participações SA has placed its entire stake as collateral for loan contracts with creditors.",
        "date": "07192016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Odebrecht places Braskem stake as collateral for lenders "
    },
    {
        "content": " ",
        "date": "07202016",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "UPDATE 1-Brazil's Odebrecht puts Braskem stake as collateral for loans "
    },
    {
        "content": "* Parente vows corruption probe to continue   (Recasts to focus on fuels unit bids  divestment plan  Petrobras scandal)",
        "date": "06172016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "UPDATE 2-Petrobras received bids for fuels unit in recent days -CEO "
    },
    {
        "content": "SAO PAULO  May 5 Brazil's Braskem SA  Latin America's largest petrochemical company  reported on Thursday that first-quarter net income tripled from a year earlier to 747 million reais  ($212.60 million).",
        "date": "05052016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Braskem posts sharp rise in Q1 net income "
    },
    {
        "content": "By Guillermo Parra-Bernal and Tatiana Bautzer     SAO PAULO  April 13 Brazil's harshest recession in decades and deepening political turmoil are preventing buyers and sellers from finalizing dozens of mergers and acquisitions amid wide disagreements over valuations  according to dealmakers.     Mergers in Latin America's biggest economy got off to their worst start in more than a decade in the first quarter as buyers  wary of growing economic imbalances and fallout from a corruption ",
        "date": "04132016",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Brazil M&A deals tougher to close amid economic and political turmoil "
    },
    {
        "content": "SAO PAULO  March 29 The U.S. Department of Justice is investigating possible corruption in contracts among Brazilian petrochemical company Braskem  engineering conglomerate Odebrecht and the country's state-run oil company Petrobras  a newspaper said on Tuesday.",
        "date": "03292016",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "U.S. probes Brazil's Odebrecht  Braskem for corruption -Valor "
    },
    {
        "content": "BRASILIA  March 21 Brazilian petrochemical company Braskem SA signed a 10-year contract with U.S.-based Enterprise Products Partners LP for the supply of ethane imported from the United States  Braskem said in a statement on Monday.",
        "date": "03212016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Braskem contracts to buy ethane from Enterprise Products "
    },
    {
        "content": "BRASILIA China's CNOOC Ltd  is interested in purchasing a minority stake in Brazilian petrochemical company Braskem SA  from state-run Petroleo Brasileiro SA   a Brazilian newspaper said on Monday.",
        "date": "03142016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "China's CNOOC eyes Petrobras' stake in Braskem: paper "
    },
    {
        "content": "SAO PAULO Grupo Odebrecht SA [ODBES.UL]  Latin America's largest engineering conglomerate  is considering selling its stake in petrochemical producer Braskem SA   according to three sources with direct knowledge of the situation.",
        "date": "03112016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Odebrecht mulls sale of Braskem's stake: sources "
    },
    {
        "content": "BRASILIA  March 14 China's CNOOC Ltd  is interested in purchasing a minority stake in Brazilian petrochemical company Braskem SA from state-run Petroleo Brasileiro SA  a Brazilian newspaper said on Monday.",
        "date": "03142016",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "UPDATE 1-China's CNOOC eyes Petrobras' stake in Braskem -paper "
    },
    {
        "content": "BRASILIA  March 14 China's CNOOC Ltd  is interested in purchasing a minority stake in Brazilian petrochemical company Braskem SA from state-run Petroleo Brasileiro SA  newspaper Valor said on Monday.",
        "date": "03142016",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "China's CNOOC eyes Petrobras' stake in Braskem - paper "
    },
    {
        "content": "SAO PAULO  March 11 Grupo Odebrecht SA   Latin America's largest engineering conglomerate  is considering selling its stake in petrochemical producer Braskem SA  according to three sources with direct knowledge of the situation.",
        "date": "03112016",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "UPDATE 2-Brazil's Odebrecht mulls sale of Braskem's stake -sources "
    },
    {
        "content": "SAO PAULO  March 11 Grupo Odebrecht SA   Latin America's largest engineering conglomerate  is considering selling the majority stake it has in petrochemical producer Braskem SA  according to three sources with direct knowledge of the situation.",
        "date": "03112016",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Brazil's Odebrecht mulls sale of Braskem's majority stake -sources "
    },
    {
        "content": "SAO PAULO  Feb 18 Braskem SA  Latin America's largest petrochemical company  plans to increase investment by more than 50 percent this year as it starts new production lines in Mexico and the United States  making the most of cheaper raw materials and a stronger dollar.",
        "date": "02192016",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "CORRECTED-UPDATE 1-Braskem boosts investment  ready to fire up Mexico plant "
    },
    {
        "content": "SAO PAULO  Feb 18 Brazilian petrochemical company Braskem SA posted fourth-quarter net income of 158 million reais ($39 million) on Thursday  reversing a year-earlier loss due to a favorable exchange rate and falling crude oil prices.",
        "date": "02182016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Braskem posts $39 mln quarterly profit "
    },
    {
        "content": "RIO DE JANEIRO Brazil's state-led oil company Petroleo Brasileiro SA  is on the verge of selling its stake in Brazilian petrochemical company Braskem SA  and expects to complete the sale by the end of June  a Petrobras source told Reuters on Friday.",
        "date": "01222016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Petrobras close to selling Braskem stake: source "
    },
    {
        "content": "* Company has ruled out fuel-price cut in 2016   (Adds value of Petrobras shares in Braskem  paragraph 3)",
        "date": "01222016",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "UPDATE 2-Brazil's Petrobras close to selling Braskem stake -source "
    },
    {
        "content": "RIO DE JANEIRO  Jan 22 Brazil's state-led oil company Petroleo Brasileiro SA is on the verge of selling its stake in Brazilian petrochemical company Braskem SA  and expects to complete the sale by the end of June  a Petrobras source told Reuters on Friday.",
        "date": "01222016",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Brazil's Petrobras close to selling Braskem stake -source "
    },
    {
        "content": "SAO PAULO  Jan 14 Petróleo Brasileiro SA  the Brazilian state-controlled firm at the center of a massive corruption investigation  said asset divestments hinged on a number of undetermined \"global and external factors\"  as regulators questioned it over the sale of a stake in petrochemical giant Braskem SA.",
        "date": "01142016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Petrobras says asset sale plan depends on many factors "
    },
    {
        "content": "SAO PAULO/BRASILIA  Jan 13 Shares of Brazil's Braskem SA dropped for a second day on Wednesday on speculation that No. 2 shareholder Petróleo Brasileiro SA is selling the 36.1 percent stake it owns in Latin America's largest petrochemical producer.",
        "date": "01132016",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "UPDATE 2-Brazil's Braskem drops on speculation over Petrobras exit "
    },
    {
        "content": "BRASILIA  Jan 13 Brazil's state-controlled oil producer Petrobras is seeking to sell its 5.8 billion Brazilian real ($1.4 billion) stake in petrochemical producer Braskem SA  newspaper Folha de S. Paulo reported on Wednesday.",
        "date": "01132016",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Brazil's Petrobras mulls sale of Braskem stake - newspaper "
    },
    {
        "content": "SAO PAULO  Dec 23 Brazil's state-controlled oil producer Petroleo Brasileiro SA agreed on Wednesday to sign a naphtha supply contract with Braskem SA  Latin America's largest petrochemical producer  for five years.",
        "date": "12232015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Braskem  Petrobras sign five-year naphtha supply contract "
    },
    {
        "content": "SAO PAULO  Dec 11 Brazil's energy minister Eduardo Braga said on Friday that he expects Brazil's state-run oil company Petroleo Brasileiro SA to sign a naphtha supply contract with Brazilian petrochemical company Braskem SA  by Dec. 15.",
        "date": "12112015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil minister expects Braskem-Petrobras naphtha deal by Dec 15 "
    },
    {
        "content": "SAO PAULO  Nov 7 Brazil's state-run oil company Petroleo Brasileiro SA said on Friday two amendments to its contract to supply naphtha to Braskem SA  Latin America's largest petrochemical company are worth 950 million reais ($252 million).",
        "date": "11072015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "REFILE-Brazil's Petrobras says Braskem naphtha extension worth $252 mln "
    },
    {
        "content": "RIO DE JANEIRO Brazil's state-controlled oil company Petróleo Brasileiro SA agreed to buy 82 000 cubic meters (515 764 barrels) of gasoline from Braskem SA in November  bolstering supplies of the fuel as Petrobras faces its biggest strike in 20 years.",
        "date": "11042015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Petrobras buys gasoline from Braskem in November "
    },
    {
        "content": "SAO PAULO  Oct 30 Brazil's state-run oil company Petrobras said on Friday it approved a deal to supply naphtha to petrochemical company Braskem for 45 more days  according to a filling to Brazil's market regulator.",
        "date": "10302015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Petrobras to supply naphtha to Braskem for 45 more days "
    },
    {
        "content": "SAO PAULO  Sept 10 Brazil's state-run oil company Petroleo Brasileiro SA said on Thursday it agreed to supply naphtha to Latin America's largest petrochemical producer Braskem for two more months as the companies keep negotiating a long-term contract.",
        "date": "09102015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Petrobras agrees two-month deal supplying naphtha to Braskem "
    },
    {
        "content": "RIO DE JANEIRO  Sept 4 Brazilian petrochemical firm Braskem SA said on Friday it signed a naphtha contract with state-run oil firm Petrobras  valid until the end of October.",
        "date": "09042015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Braskem signs naphtha contract with Petrobras "
    },
    {
        "content": "SAO PAULO  Aug 7 The chief executive of Braskem SA said on Friday that Latin America's largest petrochemical company is not currently facing legal action related to a naphtha supply contract with its second largest shareholder  Brazil's Petrobras.",
        "date": "08072015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Braskem CEO sees \"no grounds\" for Petrobras deal accusation "
    },
    {
        "content": "SAO PAULO  Aug 6 Brazilian petrochemical giant Braskem SA on Thursday reported a sharp jump in quarterly profit  and its chief executive said it had proposed a flexible new supply contract with state-run oil firm Petrobras .",
        "date": "08062015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "UPDATE 1-Braskem posts strong profit  offers new Petrobras contract "
    },
    {
        "content": "SAO PAULO  Aug 6 Brazil's Braskem SA  Latin America's largest petrochemical company  reported second-quarter profit of 1.055 billion reais ($300 million)  up from 204 million reais a year ago  according to a Thursday securities filing.",
        "date": "08062015",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Brazil's Braskem posts higher 2nd-qtr profit "
    },
    {
        "content": "CURITIBA  Brazil  July 24 Brazilian prosecutors  declaring war on what they called a culture of impunity  presented charges on Friday against the CEO of Latin America's largest engineering firm as part of a  landmark investigation of a kickback and bribery scandal.",
        "date": "07242015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "UPDATE 3-Brazil prosecutors present charges against Odebrecht CEO "
    },
    {
        "content": "SAO PAULO  July 21 Brazil's state-run oil firm Petrobras confirmed on Tuesday it had found irregularities in the approval of a 2009 contract to provide naphtha to petrochemical company Braskem SA and had reported the issue to public prosecutors.",
        "date": "07222015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Petrobras confirms irregularities in 2009 Braskem deal "
    },
    {
        "content": "SAO PAULO  July 6 State-controlled oil producer Petróleo Brasileiro SA could sell a stake in Brazil's Braskem SA and build provisions against tax debts nearing 40 billion reais ($12.7 billion) to reduce costs and make finances sustainable  Valor Econômico newspaper said on Monday.",
        "date": "07062015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Petrobras may sell Braskem stake  build tax provisions  Valor says "
    },
    {
        "content": "SAO PAULO A Braskem SA shareholder sued the Brazilian petrochemical producer on Wednesday  accusing it of involvement in a graft scandal that has engulfed key stakeholders Odebrecht and Petrobras and led to a selloff in Braskem's U.S.-traded stock.",
        "date": "07012015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Braskem sued in New York court over Petrobras scandal "
    },
    {
        "content": "SAO PAULO  July 1 A Braskem SA shareholder sued the Brazilian petrochemical producer on Wednesday  accusing it of involvement in a graft scandal that has engulfed key stakeholders Odebrecht and Petrobras and led to a selloff in Braskem's U.S.-traded stock.",
        "date": "07012015",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "UPDATE 1-Brazil's Braskem sued in New York court over Petrobras scandal "
    },
    {
        "content": "SAO PAULO  July 1 A Braskem SA shareholder has sued the Brazilian petrochemical producer  accusing it of being involved in a graft scandal that has engulfed key stakeholders Odebrecht and Petrobras and led to a selloff in Braskem's U.S.-traded stock.",
        "date": "07012015",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Brazil's Braskem sued in N.Y. court over Petrobras scandal "
    },
    {
        "content": "SAO PAULO  June 19 Brazil's Braskem SA   Latin America's largest petrochemical company  said on Friday that federal police were carrying out a search warrant for documents related to a graft probe involving its two major shareholders.",
        "date": "06192015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Braskem confirms document search in Petrobras graft probe "
    },
    {
        "content": "SAO PAULO  May 7 Brazil's Braskem SA  Latin America's largest petrochemical company  said on Thursday it was reconsidering a West Virginia shale gas project and planned to cut over $100 million in annual spending due to a drop in global oil prices.",
        "date": "05072015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "UPDATE 1-Braskem reconsiders U.S. shale gas project  to cut costs "
    },
    {
        "content": "SAO PAULO  May 7 Brazil's Braskem SA  Latin America's largest petrochemical company  on Thursday posted a net profit of 204 million reais ($67 million) for the first quarter  down 49 percent from a year earlier.",
        "date": "05072015",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Brazil's Braskem reports 49 pct drop in Q1 profit "
    },
    {
        "content": "RIO DE JANEIRO  April 13 Shares of Brazil's Petrobras rose nearly 4 percent on Monday after local media reported that the state-run oil company plans to sell a stake in petrochemicals firm Braskem SA for around 2.8 billion reais ($903 million).",
        "date": "04132015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "UPDATE 2-Petrobras shares jump on report of plans to sell Braskem stake "
    },
    {
        "content": "RIO DE JANEIRO  April 13 Shares in Brazil's Petrobras rose 6 percent on Monday after local media reported that the state-run oil company plans to sell a stake in petrochemicals firm Braskem SA for around 2.8 billion reais ($903 million).",
        "date": "04132015",
        "name": "Braskem SA",
        "news_type": "normal",
        "symbol": "BAK",
        "title": "Petrobras shares jump on report of plans to sell Braskem stake "
    },
    {
        "content": "SAO PAULO  April 1 Brazilian petrochemical producer Braskem started an internal investigation into allegations of improper payments to state-run oil firm Petroleo Brasileiro SA despite not being summoned in official investigations in Brazil or abroad  the company said in a Wednesday securities filing.",
        "date": "04012015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Braskem starts internal investigation into Petrobras payments "
    },
    {
        "content": "RIO DE JANEIRO  Feb 27 Brazil's Braskem SA   Latin America's largest petrochemical company  said on Friday it had agreed to a revised naphtha supply contract with shareholder Petrobras  staving off a threatened shutdown of its Brazilian plants.",
        "date": "02282015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Brazil's Braskem to sign revised naphtha contract with Petrobras "
    },
    {
        "content": "BRASILIA  Feb 9 Braskem SA  Latin America's largest petrochemical company  may halt production at most of its plants in March if it fails to extend a supply agreement with oil company and key shareholder Petrobras   Braskem's CEO said in a newspaper interview on Monday.",
        "date": "02092015",
        "name": "Braskem SA",
        "news_type": "topStory",
        "symbol": "BAK",
        "title": "Braskem CEO says Petrobras crisis threatens its production -paper "
    }
]