[
    {
        "content": "* Brookfield Asset Management - ‍It held final close on Brookfield Real Estate Finance Fund V with aggregate equity commitments of about  $3.0 billion​",
        "date": "11142017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield closes $3 bln U.S. commercial real estate finance fund "
    },
    {
        "content": "* Brookfield Asset Management reports third quarter 2017 results",
        "date": "11092017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management reports qtrly earnings per share $0.20​ "
    },
    {
        "content": "NEW DELHI  Nov 4 A unit of Canada's Brookfield Asset Management said it is evaluating a number of telecom tower portfolios in India to scale its presence after talks to acquire over 40 000 towers from debt-laden Reliance Communications hit a snag.",
        "date": "11042017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brookfield eyes mobile towers in India as deal with RCom stumbles "
    },
    {
        "content": "SAO PAULO  Oct 17 Brazilian renewable energy company Renova Energia SA said the period for exclusive talks with Canada's Brookfield Asset Management Inc expired on Tuesday with no deal.",
        "date": "10172017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brazil's Renova says exclusive period ends for Brookfield talks "
    },
    {
        "content": "* Latest large asset manager to buy MLP-focused investment firm",
        "date": "10102017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brookfield unit to buy energy infra investment firm Center Coast Capital "
    },
    {
        "content": "SINGAPORE  Oct 2 Asia's biggest warehouse operator  Global Logistic Properties (GLP)  agreed to acquire European logistics platform Gazeley for about $2.8 billion  marking its first push into Europe and underscoring consolidation in the buoyant sector.",
        "date": "10022017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 1-Global Logistic Properties buys European logistics firm for $2.8 bln "
    },
    {
        "content": "SAO PAULO Brookfield Asset Management Inc  has refrained from improving an original bid for Brazilian renewable power company Renova Energia SA   after due diligence proceedings showed liabilities that were unaccounted for  a person with direct knowledge of the situation said on Thursday.",
        "date": "10052017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brookfield refrains from higher bid for Brazil's Renova: source "
    },
    {
        "content": "SAO PAULO  Oct 5 Brookfield Asset Management Inc has refrained from improving an original bid for Brazilian renewable power company Renova Energia SA  after due diligence proceedings showed liabilities that were unaccounted for  a person with direct knowledge of the situation said on Thursday.",
        "date": "10052017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brookfield refrains from higher bid for Brazil's Renova -source "
    },
    {
        "content": "Toronto-based Brookfield Asset Management Inc  is in advanced talks to buy Abengoa SA's  41.5 percent stake in its U.S. unit Atlantica Yield Plc   Bloomberg reported  citing people familiar with the matter.",
        "date": "10052017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brookfield Asset in talks to buy Abengoa's stake in Atlantica: Bloomberg "
    },
    {
        "content": "Oct 5 Toronto-based Brookfield Asset Management Inc is in advanced talks to buy Abengoa SA's 41.5 percent stake in its U.S. unit Atlantica Yield Plc  Bloomberg reported  citing people familiar with the matter.",
        "date": "10052017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brookfield Asset in talks to buy Abengoa's stake in Atlantica-BBG "
    },
    {
        "content": "* Brookfield Asset Management Inc files for debt shelf of up to $1.5 billion - SEC filing‍​ Source text: (http://bit.ly/2fXGPWm) Further company coverage:",
        "date": "09292017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management files for debt shelf of up to $1.5 bln "
    },
    {
        "content": "Sept 29 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "09292017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "SAO PAULO  Sept 29 Cia Energética de Minas Gerais SA and a subsidiary plan to exit their controlling stake in Brazilian renewable power company Renova Energia SA as Brookfield Asset Management Inc considers raising a takeover bid more than initially expected  two people with direct knowledge of the matter said on Friday.",
        "date": "09292017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 2-Cemig to exit Brazil's Renova as Brookfield hints at higher bid: sources "
    },
    {
        "content": "Sept 29 Cia Energética de Minas Gerais SA and a subsidiary plan to exit their controlling stake in Brazilian renewable power company Renova Energia SA as Brookfield Asset Management Inc considers raising a takeover bid more than initially expected  two people with direct knowledge of the matter said on Friday.",
        "date": "09292017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Cemig to exit Brazil's Renova as Brookfield signals higher bid  sources say "
    },
    {
        "content": "SAO PAULO Brookfield Asset Management Inc  is considering increasing a takeover offer for Renova Energia SA by 25 percent  in a bid to sway the two largest shareholders in the Brazilian renewable power firm to exit their controlling stakes  two people with direct knowledge of the matter said on Tuesday.",
        "date": "09192017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Exclusive: Brookfield mulls raising bid for Brazil's Renova - sources "
    },
    {
        "content": "SAO PAULO  Sept 15 Brazilian renewable energy company Renova Energia SA has extended the deadline for exclusivity talks with a unit of Canada's Brookfield Asset Management for a capital injection to Oct. 17.",
        "date": "09152017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brazil's Renova extends exclusivity talks with Brookfield "
    },
    {
        "content": "* Brookfield Asset Management Inc announces pricing of US$550 million note offering",
        "date": "09112017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management announces pricing of US$550 mln note offering "
    },
    {
        "content": "* Brookfield Asset Management announces proposed offering of notes",
        "date": "09112017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management announces proposed offering of notes "
    },
    {
        "content": "* Brookfield Asset Management Inc - ‍underwriters have exercised their option to increase size of offering to 12 million class A preferred shares  series 48​",
        "date": "09062017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield announces exercise of Underwriters' option "
    },
    {
        "content": "* Says agreed to issue 10 million Class A preferred shares Series 48 at a price of C$25.00 per share​ Source text for Eikon: Further company coverage:",
        "date": "09062017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield to issue C$250 million of preferred shares "
    },
    {
        "content": "* Brookfield Asset Management announces renewal of normal course issuer bid for preferred shares",
        "date": "08162017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management announces renewal of normal course issuer bid for preferred shares "
    },
    {
        "content": "* Freddie Mac prices $643 million multifamily K-Deal  K-BF1  backed by properties controlled by Brookfield Asset Management",
        "date": "08152017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Freddie Mac prices $643 million multifamily K-Deal  K-BF1 "
    },
    {
        "content": "SAO PAULO Canada's Brookfield Asset Management Inc  is in talks with Odebrecht SA to buy seven Brazilian highways operated by the conglomerate's transportation unit  two sources with knowledge of the matter said on Thursday.",
        "date": "07202017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Exclusive: Brookfield in talks to buy Odebrecht's Brazil toll roads - sources "
    },
    {
        "content": "SAO PAULO  July 19 The board of Brazilian utility Light SA has given its approval for Canada's Brookfield Asset Management Inc to enter exclusive negotiations to acquire its stake in renewable company Renova Energia SA  the company said in a securities filing.",
        "date": "07192017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brazil's Light authorizes Renova to enter exclusive talks with Brookfield "
    },
    {
        "content": "SAO PAULO The reluctance of Renova Energia SA's largest shareholder to give up management of the debt-laden Brazilian renewable power firm threatens to derail takeover talks with Brookfield Asset Management Inc   three people familiar with the matter said on Thursday.",
        "date": "07132017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brookfield  Renova talks cool over management rights  sources say "
    },
    {
        "content": "SAO PAULO  July 12 Canada's Brookfield Asset Management has signed an exclusivity agreement to acquire power transmission lines owned by Brazil's J&F Investimentos SA  which is selling off assets to pay a record corruption-related fine  two people with knowledge of the matter said on Wednesday.",
        "date": "07122017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Canada's Brookfield in talks to buy J&F power lines  sources say "
    },
    {
        "content": "SAO PAULO  July 13 The reluctance of Renova Energia SA's largest shareholder to give up management of the debt-laden Brazilian renewable power firm threatens to derail takeover talks with Brookfield Asset Management Inc  three people familiar with the matter said on Thursday.",
        "date": "07132017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 1-Brookfield  Renova talks cool over management rights  sources say "
    },
    {
        "content": "SAO PAULO  July 13 The reluctance of Renova Energia SA's largest shareholder to give up management of the debt-laden Brazilian renewable power firm threatens to derail takeover talks with Brookfield Asset Management Inc  three people familiar with the matter said on Thursday.",
        "date": "07132017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Talks between Brookfield  Renova cool over management rights  sources say "
    },
    {
        "content": "SAO PAULO Brookfield Asset Management Inc  has proposed buying out Renova Energia SA's controlling bloc as part of a sweetened bid to take over the debt-laden Brazilian renewable energy firm  two people with knowledge of the deal said on Friday.",
        "date": "07072017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brookfield proposes Brazil's Renova buyout: sources "
    },
    {
        "content": "SAO PAULO  July 7 Brookfield Asset Management Inc has proposed buying out Renova Energia SA's controlling bloc as part of a sweetened bid to take over the debt-laden Brazilian renewable energy firm  two people with knowledge of the deal said on Friday.",
        "date": "07072017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 1-Brookfield proposes Brazil's Renova buyout -sources "
    },
    {
        "content": "SAO PAULO  July 7 Brookfield Asset Management Inc has extended a formal bid for control of Renova Energia SA the Brazilian renewable energy company's entire controlling bloc  two people with direct knowledge of the situation said on Friday.",
        "date": "07072017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brookfield extends Renova bid to controlling bloc -sources "
    },
    {
        "content": "SAO PAULO  July 4 Brazil's renewable energy company Renova Energia SA confirmed in a securities filing on Tuesday having received a formal bid from Canada's Brookfield Asset Management Inc.",
        "date": "07042017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brazil's Renova confirms receiving formal bid from Brookfield "
    },
    {
        "content": "SAO PAULO  July 3 Brookfield Asset Management Inc placed on Monday a formal bid for control of Renova Energia SA  which would include 800 million reais ($242 million) in fresh capital for the Brazilian renewable energy company  two people with knowledge of the situation said.",
        "date": "07042017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brookfield places formal bid for Brazil's Renova  sources say "
    },
    {
        "content": "SAO PAULO Canada's Brookfield Asset Management Inc  has agreed to buy Light SA's  stake in Brazilian renewable energy company Renova Energia SA  and eventually become controlling shareholder  one source with direct knowledge of the talks said on Friday.",
        "date": "05152017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Canada's Brookfield to take control of Brazil's Renova "
    },
    {
        "content": "SAO PAULO  May 12 Canada's Brookfield Asset Management Inc has agreed to buy Light SA's stake in Brazilian renewable energy company Renova Energia SA and eventually become controlling shareholder  one source with direct knowledge of the talks said on Friday.",
        "date": "05152017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "CORRECTED-UPDATE 1-Canada's Brookfield to take control of Brazil's Renova "
    },
    {
        "content": "* Brookfield Asset Management announces renewal of normal course issuer bid",
        "date": "05192017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management reports renewal of normal course issuer bid "
    },
    {
        "content": "SAO PAULO Canada's Brookfield Asset Management Inc  has agreed to buy Light SA's  stake in Brazilian renewable energy company Renova Energia SA  and eventually become controlling shareholder  one source with direct knowledge of the talks said on Friday.",
        "date": "05122017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Canada's Brookfield to take control of Brazil's Renova "
    },
    {
        "content": "SAO PAULO  May 12 Canada's Brookfield Asset Management Inc has agreed to buy Light SA's stake in Brazilian renewable energy company Renova Energia SA to become controlling shareholder later  one source with direct knowledge of the talks said on Friday.",
        "date": "05122017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Canada's Brookfield to become controlling shareholder in Brazil's Renova "
    },
    {
        "content": "* Brookfield Asset Management Inc qtrly funds from operations per Brookfield share $0.65",
        "date": "05112017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management posts qtrly FFO $0.65/shr "
    },
    {
        "content": "May 3 Canada's Brookfield Asset Management Inc is joining a group of Oi SA's bondholders being advised by Moelis & Co as the Brazilian telecommunications company restructures  Bloomberg reported on Wednesday citing sources.",
        "date": "05042017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Canada's Brookfield joining group of Oi bondholders -Bloomberg "
    },
    {
        "content": "* SunEdison Shareholder Group: SunEdison equity shareholders needed to help stop fire sale of assets and total loss of investments",
        "date": "04212017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-SunEdison Shareholder Group opposes proposed yieldco sale to Brookfield Asset Management "
    },
    {
        "content": "BEIJING  April 5 China's sovereign wealth fund China Investment Corp said it has joined hands with Canada's Brookfield Asset Management Inc in acquiring 90 percent of a natural gas pipeline unit from Brazil's state oil firm Petrobras.",
        "date": "04052017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-China CIC  Canada's Brookfield acquire Petrobras pipeline unit "
    },
    {
        "content": "SAO PAULO  March 31 Brazil's renewable power generation company Renova Energia SA will finalize the sale of wind farm Alto Sertão II to the Brazilian unit of AES Corp for about 700 million reais ($223 million) as early as Monday  two people with direct knowledge of the matter said.",
        "date": "03312017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 2-Brazil's Renova to finalize project sale to AES on Monday -sources "
    },
    {
        "content": "SAO PAULO  March 31 Brazil's renewable power generation company Renova Energia SA will finalize the sale of wind farm Alto Sertao II to the Brazilian unit of AES Corp for about 700 million reais ($223 million) as early as Monday  two people with direct knowledge of the matter said.",
        "date": "03312017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brazil's Renova to finalize wind farm sale to AES unit Monday - sources "
    },
    {
        "content": "* Brookfield asset management announces pricing of us$750 million note offering",
        "date": "03072017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management announces pricing of $750 mln note offering "
    },
    {
        "content": "Brookfield Asset Management Inc   said on Tuesday it would buy one of the two \"yieldcos\" of bankrupt U.S. solar company SunEdison Inc  and take a 51 percent stake in the other  for a total of about $1.41 billion.",
        "date": "03072017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brookfield to take control of SunEdison units for $1.41 billion "
    },
    {
        "content": "March 7 Brookfield Asset Management Inc  said on Tuesday it would buy one of the two \"yieldcos\" of bankrupt U.S. solar company SunEdison Inc and take a 51 percent stake in the other  for a total of about $1.41 billion.",
        "date": "03072017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 3-Brookfield to take control of SunEdison units for $1.41 bln "
    },
    {
        "content": "March 7 Brookfield Asset Management Inc  said on Tuesday it would buy one of the two \"yieldcos\" of bankrupt U.S. solar company SunEdison Inc and take a 51 percent stake in the other  for a total of about $1.41 billion.",
        "date": "03072017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "CORRECTED-UPDATE 2-Brookfield to take control of SunEdison units for $1.41 bln "
    },
    {
        "content": "* Brookfield asset management announces proposed offering of notes",
        "date": "03072017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management announces proposed offering of $500 mln of notes "
    },
    {
        "content": "March 7 Brookfield Asset Management Inc  said on Tuesday it would buy TerraForm Global Inc  for about $787 million and acquire 51 percent of TerraForm Power Inc.",
        "date": "03072017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brookfield to buy TerraForm Global  51 pct of TerraForm Power "
    },
    {
        "content": "SAO PAULO Brookfield Asset Management Inc is nearing an accord to buy a 30 percent stake in Renova Energia SA   which would include 800 million reais ($258 million) in fresh capital for the Brazilian renewable energy company  a person directly involved in the transaction said on Wednesday.",
        "date": "03012017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Exclusive: Brookfield close to buying stake in Brazil's Renova  source says "
    },
    {
        "content": "* Partners Value Investments Lp reports a 8.7 percent stake in Brookfield Asset Management Inc as of Feb 17  2017 - sec filing  Source text- http://bit.ly/2lsyMoJ Further company coverage:",
        "date": "02172017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Partners Value Investments reports 8.7 pct stake in Brookfield Asset Management "
    },
    {
        "content": "RIO DE JANEIRO  Feb 10 A Brazilian federal court suspended on Friday the $5.2 billion sale of state-controlled Petróleo Brasileiro SA's natural gas pipeline unit to a group of investors led by Canada's Brookfield Asset Management Inc .",
        "date": "02102017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "UPDATE 1-Brazil court suspends $5.2 bln sale of Petrobras unit to Brookfield "
    },
    {
        "content": "RIO DE JANEIRO  Feb 10 A Brazilian federal court suspended on Friday the $5.2 billion sale of state-controlled Petróleo Brasileiro SA's natural gas pipeline unit to a group of investors led by Canada's Brookfield Asset Management Inc .",
        "date": "02102017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brazil court suspends $5.2 bln sale of Petrobras unit to Brookfield "
    },
    {
        "content": "* Brookfield finance inc files for shelf of up to $2.5 billion - sec filing",
        "date": "02102017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Finance files for shelf of up to $2.5 bln "
    },
    {
        "content": "* BROOKFIELD OFFICE PROPERTIES TO ISSUE C$200 MILLION OF PREFERRED SHARES",
        "date": "02092017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-BROOKFIELD OFFICE PROPERTIES TO ISSUE C$200 MILLION OF PREFERRED SHARES "
    },
    {
        "content": "* Brookfield Asset Management Inc qtrly earnings per share  $0.14",
        "date": "02092017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management posts qrtly earnings $0.14/shr "
    },
    {
        "content": "* Terraform Global announces exclusivity agreement with Brookfield Asset Management regarding potential transaction",
        "date": "01232017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Terraform Global  Brookfield Asset Management enter exclusivity agreement "
    },
    {
        "content": "Brookfield Asset Management Inc  said it had submitted alternative proposals regarding its interest in buying bankrupt solar company SunEdison Inc's  \"yieldco\"  TerraForm Power Inc .",
        "date": "01112017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brookfield Asset lists proposals for potential TerraForm Power deal "
    },
    {
        "content": "Jan 10 Brookfield Asset Management Inc  said it had submitted alternative proposals regarding its interest in buying bankrupt solar company SunEdison Inc's  \"yieldco\"  TerraForm Power Inc.",
        "date": "01102017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brookfield Asset lists proposals for potential TerraForm Power deal "
    },
    {
        "content": "Jan 10 Brookfield Asset Management Says None Of The Four Proposals For Terraform Power Inc",
        "date": "01102017",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield submits alternative proposals to Terraform's advisors related to potential deal "
    },
    {
        "content": "Brookfield Asset Management Inc  proposed on Friday to take a 50-60 percent stake in bankrupt solar company SunEdison Inc  unit TerraForm Power Inc   a week after it expressed interest in buying the \"yieldco\".",
        "date": "11182016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brookfield Asset proposes to take 50-60 percent stake in TerraForm Power "
    },
    {
        "content": "Nov 18 Brookfield Asset Management Inc  proposed on Friday to take a 50-60 percent stake in bankrupt solar company SunEdison Inc unit TerraForm Power Inc   a week after it expressed interest in buying the \"yieldco\".",
        "date": "11182016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 1-Brookfield Asset proposes to take 50-60 pct stake in TerraForm Power "
    },
    {
        "content": "Nov 18 Brookfield Asset Management Inc  proposed on Friday to take a 50-60 percent stake in bankrupt solar company SunEdison Inc unit TerraForm Power Inc   a week after it expressed interest in buying the unit.",
        "date": "11182016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brookfield Asset proposes to take 50-60 pct stake in TerraForm Power "
    },
    {
        "content": "* On November 9  representatives of Brookfield met with independent members of board of directors of Terraform Global",
        "date": "11102016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management says it discussed possibility of potential deals involving Terraform Global  Terraform Power "
    },
    {
        "content": "* Macy's forms strategic alliance with Brookfield Asset Management to expand opportunities to enhance real estate portfolio value  Source text for Eikon:  Further company coverage:",
        "date": "11102016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "BRIEF-Macy's forms strategic alliance with Brookfield Asset Management "
    },
    {
        "content": "SAO PAULO  Oct 31 Petróleo Brasileiro SA has secured 20-year contracts for the transport of natural gas through Nova Transportadora do Sudeste SA  which the Brazilian state-controlled oil company recently sold to Brookfield Asset Management Inc for $5.19 billion.",
        "date": "10312016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Petrobras secures gas contracts in sale of NTS to Brookfield "
    },
    {
        "content": "Oct 11 Brookfield Asset Management Inc   Canada's largest alternative-asset manager  is considering a bid for troubled hockey gear-maker Performance Sports Group Ltd  Bloomberg reported  citing people familiar with the matter.",
        "date": "10112016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brookfield Asset Management mulls bid for Performance Sports-Bbg "
    },
    {
        "content": "* Brookfield Asset Management and Brookfield Finance file for potential mixed shelf of upto $3.5 billion - SEC filing  Source text for Eikon: (http://bit.ly/2dr8Fu1) Further company coverage:",
        "date": "09302016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management  Brookfield Finance file for potential mixed shelf of upto $3.5 bln "
    },
    {
        "content": "RIO DE JANEIRO  Sept 23 Brazil's state-owned oil producer Petrobras agreed to sell 90 percent of a natural gas pipeline unit to a group led by Canada's Brookfield Asset Management Inc for $5.2 billion  the companies said Friday.",
        "date": "09232016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "UPDATE 3-Brookfield-led group to pay $5.2 bln for Petrobras natgas unit "
    },
    {
        "content": "RIO DE JANEIRO Brazil's state-owned oil producer Petrobras agreed to sell 90 percent of a natural gas pipeline unit to a group led by Canada's Brookfield Asset Management Inc  for $5.2 billion  the companies said on Friday.",
        "date": "09232016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brookfield-led group to pay $5.2 billion for Petrobras natgas unit "
    },
    {
        "content": "RIO DE JANEIRO  Sept 23 Brazil's state-owned Petrobras said on Friday that its agreement to sell a 90 percent stake in its NTS pipeline system unit for $5.2 billion to a group led by Canada's Brookfield Asset Management Inc would not affect existing natural gas contracts.",
        "date": "09232016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Petrobras says pipeline sale to Brookfield won't affect gas contracts "
    },
    {
        "content": "RIO DE JANEIRO  Sept 8 Brazil's state-run oil company Petroleo Brasileiro SA said on Thursday it concluded negotiations over the sale of natural gas pipeline unit Nova Transportadora do Sudeste to a group of investors led by Brookfield Asset Management Inc.",
        "date": "09082016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brazil's Petrobras says to sell pipeline unit to Brookfield "
    },
    {
        "content": "SAO PAULO  Sept 6 Brazil's Petroleo Brasileiro SA  agreed to sell 90 percent of its natural gas pipeline unit to a group of investors led by Canada's Brookfield Asset Management Inc for $5.2 billion  a source with direct knowledge of the deal said on Tuesday.",
        "date": "09062016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brookfield group to buy Petrobras pipeline unit for $5.2 bln-source "
    },
    {
        "content": "SAO PAULO  Aug 23 Spain's energy company Grupo Isolux Corsan SA  said on Tuesday it is in talks to sell operating rights on Brazilian power transmission lines to Toronto-based Brookfield Asset Management Inc.",
        "date": "08232016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "UPDATE 1-Spain's Isolux says in talks to sell Brazil assets to Brookfield "
    },
    {
        "content": "SAO PAULO  Aug 23 Spain's energy company Grupo Isolux Corsan SA  said on Tuesday it is in talks to sell operating rights on Brazilian power transmission lines to Toronto-based Brookfield Asset Management Inc.",
        "date": "08232016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Spain's Isolux says in talks to sell Brazilian assets to Brookfield "
    },
    {
        "content": "* Brookfield Asset Management winds up original GGP Consortium with approximately $10 billion of aggregate gains",
        "date": "08222016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management winds up original GGP Consortium "
    },
    {
        "content": "PARIS Canada's Brookfield Asset Management has signed a preliminary contract to buy Brazilian engineering conglomerate Grupo Odebrecht's 70 percent stake in water and sewage group Odebrecht Ambiental  an industry source told Reuters on Wednesday.",
        "date": "08172016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Canada's Brookfield to buy Odebrecht Ambiental: source "
    },
    {
        "content": "* Brazil corruption scandal ends IPO  global expansion   (Adds details on other potential bidders)",
        "date": "08172016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 1-Canada's Brookfield to buy Odebrecht Ambiental - source "
    },
    {
        "content": "PARIS  Aug 17 Canada's Brookfield Asset Management Inc has signed a preliminary contract to buy Brazilian engineering conglomerate Grupo Odebrecht's 70 percent stake in water and sewage group Odebrecht Ambiental  an industry source told Reuters on Wednesday.",
        "date": "08172016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Canada's Brookfield to buy Odebrecht Ambiental - source "
    },
    {
        "content": "* Approval for proposed NCIB to buy up to 10 percent of public float of each of outstanding class a preference shares listed on TSX",
        "date": "08152016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management announces renewal of normal course issuer bid for preferred shares "
    },
    {
        "content": "* Q2 FFO per share view $0.46 -- Thomson Reuters I/B/E/S  Source text for Eikon:  Further company coverage:",
        "date": "08122016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management posts Q2 FFO of $0.62/share "
    },
    {
        "content": "July 25 SunEdison Inc's unit TerraForm Power Inc said it had adopted a shareholders rights plan to prevent any sale of a significant number of Class A shares in the company.",
        "date": "07252016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 1-SunEdison unit TerraForm Power adopts poison pill "
    },
    {
        "content": "* On July 22 Brookfield and Appaloosa entered into letter agreement - SEC filing",
        "date": "07222016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management and Appaloosa entered into letter agreement on July 22 "
    },
    {
        "content": "* Brookfield  SBI to set up JV to invest in distressed assets",
        "date": "07202016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "UPDATE 1-Canada's Brookfield plans $1 bln investment in Indian distressed assets "
    },
    {
        "content": "MUMBAI  July 20 Canada's Brookfield Asset Management Inc aims to pump in about $1 billion into a proposed joint venture with India's top lender State Bank of India that will invest in distressed assets in the South Asian nation  the companies said on Wednesday.",
        "date": "07202016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brookfield to invest $1 bln in JV with SBI for Indian distressed assets "
    },
    {
        "content": "July 13 Futures pointed to a higher start for Canada's main stock index on Wednesday ahead of the Bank of Canada's quarterly monetary policy report.",
        "date": "07132016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "CANADA STOCKS-Futures higher ahead of BoC rate decision "
    },
    {
        "content": "SAO PAULO  July 12 State-controlled Petróleo Brasileiro SA will extend for 30 days an exclusive negotiation with Canada's Brookfield Asset Management Inc  over the sale of natural gas pipeline unit Nova Transportadora do Sudeste SA  the company said in a securities filing on Tuesday.",
        "date": "07122016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brazil's Petrobras  Brookfield extend exclusive talks over gas pipeline unit "
    },
    {
        "content": "SAO PAULO Odebrecht Agroindustrial SA  the sugar and ethanol unit of engineering conglomerate Grupo Odebrecht SA  has concluded the restructuring of 11 billion reais ($3.3 billion) in bank loans  with a cash infusion from the parent company.",
        "date": "07052016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Odebrecht Agroindustial says concluded $3.3 billion bank loan restructuring "
    },
    {
        "content": "Brookfield Asset Management Inc  reported a 12.13 percent stake in TerraForm Power Inc   one of the two units of bankrupt solar company SunEdison Inc .",
        "date": "06292016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brookfield Asset Management takes 12.13 percent stake in SunEdison unit "
    },
    {
        "content": "June 29 Brookfield Asset Management Inc  reported a 12.13 percent stake in TerraForm Power Inc   one of the two units of bankrupt solar company SunEdison Inc.",
        "date": "06292016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 1-Brookfield Asset Management takes 12.13 pct stake in SunEdison unit "
    },
    {
        "content": "June 29 Brookfield Asset Management Inc  reported a 12.13 percent stake in TerraForm Power Inc   one of the two units of bankrupt solar company SunEdison Inc.",
        "date": "06292016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brookfield Asset Management takes 12.13 pct stake in SunEdison unit "
    },
    {
        "content": "SAO PAULO  June 27 Odebrecht SA has sold a 57 percent stake in a Peruvian toll road project to Brookfield Asset Management Inc  as Latin America's largest engineering firm sheds assets to cope with fallout from a sweeping corruption probe on its home turf.",
        "date": "06272016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Odebrecht sells Peru toll road project to Brookfield "
    },
    {
        "content": "June 27 The following bids  mergers  acquisitions and disposals were reported by 1100 GMT on Monday:",
        "date": "06272016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "SYDNEY Australian freight giant Asciano Ltd  on Monday said it has resolved a legal dispute with a trucking subsidiary that had threatened to delay a A$9.1 billion ($6.8 billion) buyout led by Canada's Brookfield Asset Management Inc .",
        "date": "06272016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Australia's Asciano resolves dispute gnawing at $6.8 billion buyout "
    },
    {
        "content": "* Shares trading below offer price on uncertainty   (Adds regulatory decision date  shares)",
        "date": "06272016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 1-Australia's Asciano resolves dispute gnawing at $6.8 bln buyout "
    },
    {
        "content": "SYDNEY  June 3 Shareholders of Australian ports and rail freight giant Asciano Ltd voted for a A$9.1 billion ($6.6 billion) buyout by a global consortium led by Canada's Brookfield Asset Management Inc  leaving the company's future in the hands of regulators.",
        "date": "06032016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Australia's Asciano shareholders vote for $6.6 bln Brookfield buyout "
    },
    {
        "content": "June 3 Futures pointed to a higher start for Canada's main stock index on Friday as metal prices rose and oil prices stayed close to $50 per barrel.",
        "date": "06032016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "CANADA STOCKS-TSX futures higher ahead of U.S. jobs report "
    },
    {
        "content": "* Due to investor demand  size of offering was increased from $350 million to $500 million",
        "date": "05252016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management prices $500 mln notes offering "
    },
    {
        "content": "* Commencing a public offering  subject to market and other conditions  of US$350 million of notes due 2026",
        "date": "05252016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset commencing a public offering of $350 mln of notes due 2026 "
    },
    {
        "content": "* Tsx approval to purchase up to 83.8 million class a limited voting shares  representing 10% of public float of  class a shares",
        "date": "05192016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield asset announces renewal of normal course issuer bid "
    },
    {
        "content": "* Brookfield Asset Management reports first quarter 2016 results",
        "date": "05132016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "BRIEF-Brookfield Asset Management Q1 net income per share $0.23 "
    },
    {
        "content": "SAO PAULO  May 12 State-controlled Petróleo Brasileiro SA has entered exclusive talks with Brookfield Asset Management Inc over the sale of natural gas pipeline unit Nova Transportadora do Sudeste SA  as part of a plan to dispose of $15 billion of non-essential assets by year-end.",
        "date": "05122016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 1-Brazil's Petrobras  Brookfield enter talks over pipeline unit "
    },
    {
        "content": "BRASILIA  April 29 Canada's Brookfield Asset Management Inc is in advanced talks to buy a controlling stake in the water and sewage unit of Brazilian engineering conglomerate Grupo Odebrecht for up to 6 billion reais ($1.72 billion)  newspaper Valor Econômico said on Friday.",
        "date": "04292016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brookfield near buying Brazil's Odebrecht Ambiental -Valor "
    },
    {
        "content": "MADRID  April 18 Spain's Abertis said on Monday that  together with a unit of Canada's Brookfield Asset Management  it will launch a bid for the shares of Brazil's Arteris it doesn't already own for 10.15 reais ($2.87) per share.",
        "date": "04182016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Spain's Abertis  Brookfield to launch bid for Brazil's Arteris "
    },
    {
        "content": "SYDNEY  March 29 Australia's Qube Holdings Ltd  and Canada's Brookfield Asset Management Inc  are raising a A$1 billion ($753 million) loan to help pay for the ports business of Asciano Ltd  in a carve-up of Australia's largest ports and rail operator  people familiar with the transaction said on Tuesday.",
        "date": "03292016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "RPT-Qube  Brookfield raising A$1 bln loan for Asciano's ports -sources "
    },
    {
        "content": "SYDNEY  March 29 Australia's Qube Holdings Ltd  and Canada's Brookfield Asset Management Inc  are raising a A$1 billion ($753 million) loan to help pay for the ports business of Asciano Ltd  in a carve-up of Australia's largest ports and rail operator  people familiar with the transaction said on Tuesday.",
        "date": "03292016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Qube  Brookfield raising A$1 bln loan for Asciano's ports -sources "
    },
    {
        "content": "* China Investment Corp grabs share of railway assets   (Recasts throughout  adds deal context  analyst quote)",
        "date": "03152016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "UPDATE 2-Australia's Asciano bows to $6.8 bln break-up bid "
    },
    {
        "content": "SYDNEY  March 15 Australia's Qube Holdings Ltd  said it has joined Canada's Brookfield Asset Management Inc and international partners to make a A$9.1 billion ($6.8 billion) bid for ports and rail freight company Asciano Ltd.",
        "date": "03152016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Australia's Qube Holdings files $6.8 bln joint bid for Asciano "
    },
    {
        "content": "SYDNEY  March 10 U.S. data management company Iron Mountain Inc will sell its Australian unit to ease regulatory concerns hampering its A$2.7 billion ($2 billion) buyout of Sydney-listed rival Recall Holdings Ltd  a regulator said.",
        "date": "03102016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "U.S.-based Iron Mountain to sell Australian assets for acquisition - regulator "
    },
    {
        "content": "U.S. real estate investment trust Rouse Properties Inc  said Canadian asset manager Brookfield Asset Management Inc   agreed to buy the company in a sweetened deal valued at about $2.8 billion  including debt.",
        "date": "02252016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Rouse Properties agrees to sweetened Brookfield offer "
    },
    {
        "content": "* Canada's Brookfield and CPPIB  France's Engie may bid -paper",
        "date": "02252016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 1-Petrobras may get $6 bln in sale of natgas pipeline unit - paper "
    },
    {
        "content": "* Move could circumvent regulatory hurdles - lawyers   (Recasts  adds quotes  shares)",
        "date": "02232016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "UPDATE 2-Australia's Asciano says suitors weigh truce  $6.5 bln joint bid "
    },
    {
        "content": "Feb 25 U.S. real estate investment trust Rouse Properties Inc said Canadian asset manager Brookfield Asset Management Inc  agreed to buy the company in a sweetened deal valued at about $2.8 billion  including debt.",
        "date": "02252016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 1-Rouse Properties agrees to sweetened Brookfield offer "
    },
    {
        "content": "* Canada's Brookfield and CPPIB  France's Engie may bid -paper",
        "date": "02252016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Petrobras may get $6 bln in sale of gas pipeline system  paper says "
    },
    {
        "content": "SYDNEY  Feb 23 Consortiums led by Canada's Brookfield Asset Management Inc and Australia's Qube Holdings are considering joining forces to bid for Asciano Ltd  the Australian port and rail giant said on Tuesday.",
        "date": "02222016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Canada's Brookfield  Australia's Qube weigh joint Asciano bid "
    },
    {
        "content": "Feb 25 Real estate investment trust Rouse Properties Inc said asset manager Brookfield Asset Management Inc  agreed to buy the company in a deal valued at about $2.8 billion  including debt.",
        "date": "02252016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brookfield Asset Management to buy Rouse Properties "
    },
    {
        "content": "SYDNEY  Feb 16 Australian ports and rail giant Asciano Ltd formally dumped an A$8.9 billion ($6.4 billion) buyout from Canada's Brookfield Asset Management Inc  after it failed to match a higher offer from local rival Qube Holdings Ltd.",
        "date": "02152016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Australia's Asciano bins $6.4 bln Brookfield bid it had endorsed "
    },
    {
        "content": "SYDNEY  Feb 8 Australia's Qube Holdings Ltd  said it raised its proposed takeover bid for port and rail operator Asciano Ltd to A$9 billion ($6.4 billion) and that the target prefers its approach to that of Brookfield Asset Management Inc.",
        "date": "02072016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Australia's Qube raises Asciano approach to $6.4 bln  trumping Brookfield "
    },
    {
        "content": "TORONTO  Feb 5 Canada's biggest pension funds say they are walking away from more and more global infrastructure deals  citing concerns that intense competition for assets has driven valuations too far.",
        "date": "02052016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Canada pension funds pull back on infrastructure as prices climb "
    },
    {
        "content": "SYDNEY The bidding war for Australian freight giant Asciano Ltd  heated up on Monday as local rival Qube Holdings Ltd  upped its proposal to A$9 billion ($6.4 billion)  trumping Canada's Brookfield Asset Management Inc .",
        "date": "02082016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Bidding war for Australia's Asciano heats up as Qube trumps Brookfield "
    },
    {
        "content": "* Qube bid raises prospect of partial Chinese ownership   (Recasts  Adds Asciano and Qube quotes  deal context  shares)",
        "date": "02082016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 1-Bidding war for Australia's Asciano heats up as Qube trumps Brookfield "
    },
    {
        "content": "SAO PAULO  Feb 1 Brookfield Asset Management Inc  has withdrawn an offer to buy the 24.4 percent stake in infrastructure company Invepar held by Brazil's Grupo OAS SA because Brookfield would not have full management control of the company  two sources with direct knowledge of the situation said on Monday.",
        "date": "02012016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brookfield withdraws offer to buy Invepar stake  sources say "
    },
    {
        "content": "SAO PAULO  Jan 28 A Brazilian bankruptcy court upheld a restructuring plan for embattled engineering conglomerate Grupo OAS  paving the way for a slew of asset sales aimed at helping pay over 8 billion reais ($2 billion) in liabilities.",
        "date": "01282016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brazil court upholds OAS bankruptcy plan  paving way for asset sales "
    },
    {
        "content": "SAO PAULO  Feb 1 Canada's Brookfield Asset Management Inc has withdrawn an offer to buy the 24.4 percent stake in infrastructure company Invepar held by Brazil's Grupo OAS SA  the Canadian firm said on Monday.",
        "date": "02022016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "UPDATE 2-Brookfield withdraws bid for Brazil's Invepar stake "
    },
    {
        "content": "SYDNEY  Jan 28 Australian port operator Qube Holdings Ltd said the state-owned China Investment Corp  joined its consortium as it made an A$8.9 billion offer for ports and rail giant Asciano Ltd.",
        "date": "01272016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "China Investment Corp joins rival bidder for Australia's Asciano "
    },
    {
        "content": "BOGOTA  Jan 13 The Colombian government sold its 57.6 percent controlling stake in power generator Isagen  to Canada's Brookfield Asset Management for $1.99 billion  Finance Minister Mauricio Cardenas said on Wednesday.",
        "date": "01132016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "UPDATE 2-Colombia sells Isagen controlling stake to Brookfield for $1.99 bln "
    },
    {
        "content": "BOGOTA  Jan 13 The Colombian government sold its 57.6 percent controlling stake in power generator Isagen  to Canada's Brookfield Asset Management Inc  for $1.99 billion  Finance Minister Mauricio Cardenas said on Wednesday.",
        "date": "01132016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Colombia sells Isagen controlling stake to Brookfield for $1.99 bln "
    },
    {
        "content": "BOGOTA  Jan 13 Canada's Brookfield Asset Management looks set to buy up the controlling stake in Colombian power generator Isagen  valued at nearly $2 billion  on Wednesday after another possible bidder withdrew from the auction this week.",
        "date": "01132016",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Canada's Brookfield poised to snap up Colombia generator in auction "
    },
    {
        "content": "SYDNEY  Dec 22 Australia's antitrust regulator said it will consider a watered down version of Canadian infrastructure giant Brookfield Asset Management Inc's  $6.5 billion bid for freight firm Asciano Ltd  reviving the prospect of a deal.",
        "date": "12212015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "UPDATE 1-Canada's Brookfield offers asset sale to clear $6.5 bln Asciano deal "
    },
    {
        "content": "SYDNEY  Dec 22 Canadian infrastructure giant Brookfield Asset Management Inc offered to sell a host of assets to get antitrust clearance for a proposed $6.5 billion buyout of Australian port and rail firm Asciano Ltd  an Australia regulator said.",
        "date": "12212015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Canada's Brookfield would sell assets to clear $6.5 bln Asciano deal: Australian regulator "
    },
    {
        "content": "* Bodes well for rival proposal from smaller Qube Holdings   (Adds Brookfield comment  updates shares)",
        "date": "11262015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "UPDATE 2-Brookfield bid for Australian rail  port assets hits regulatory red light "
    },
    {
        "content": "SYDNEY  Nov 24 The Australian government may order the country's freight industry to restructure if port and rail giant Asciano Ltd is sold to Canada's Brookfield Asset Management Inc  a rival bidder said on Tuesday.",
        "date": "11242015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Rival to Canadian Brookfield's Australia port deal invokes national interest "
    },
    {
        "content": "SYDNEY  Nov 26 Australia's competition regulator said it rejected undertakings by Canadian infrastructure giant Brookfield Asset Management Inc meant to address antitrust concerns over its A$9 billion ($6.53 billion) bid for port and rail giant Asciano Ltd.",
        "date": "11252015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Australian regulator dismisses Brookfield's promises in $6.5 bln rail and port bid "
    },
    {
        "content": "* Australia's Qube already has 19.9 pct  vows to block Brookfield",
        "date": "11062015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "UPDATE 2-Brookfield ups ante on $6.5 bln approach for Australia's Asciano "
    },
    {
        "content": "* Australia's Qube already has 19.9 pct  vows to block Brookfield",
        "date": "11082015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "RPT-UPDATE 2-Brookfield ups ante on $6.5 bln approach for Australia's Asciano "
    },
    {
        "content": "Nov 10 Australian port and rail firm Asciano Ltd  said on Tuesday it had received a takeover proposal from a consortium led by Qube Holdings  challenging a rival offer from Canada's Brookfield Asset Management.",
        "date": "11092015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "UPDATE 1-Australia's Qube challenges Brookfield with $6.35 bln Asciano bid "
    },
    {
        "content": "SYDNEY  Nov 5 Canada's Brookfield Asset Management Inc said it bought a 19.2 percent stake of Asciano Ltd  matching a rival suitor's stake for the Australian ports and rail giant and upping the bid competition for the $6.5 billion target.",
        "date": "11052015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "UPDATE 1-Brookfield says buying 19.2 pct stake in Australia's Asciano "
    },
    {
        "content": "SYDNEY  Nov 5 Canada's Brookfield Asset Management Inc has  purchased nearly 15 percent of Australian ports and rail operator Asciano Ltd as part of an agreed $6.5 billion takeover that has raised antitrust regulators' eyebrows  The Australian Financial Review (AFR) reported on Thursday.",
        "date": "11052015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "RPT-Brookfield buys near 15 pct stake in Asciano - Australian Financial Review "
    },
    {
        "content": "SYDNEY  Nov 5 Canada's Brookfield Asset Management Inc has  purchased nearly 15 percent of Australian ports and rail operator Asciano Ltd as part of an agreed $6.5 billion takeover that has raised antitrust regulators' eyebrows  The Australian Financial Review (AFR) reported on Thursday.",
        "date": "11052015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brookfield buys near 15 pct stake in Asciano - Australian Financial Review "
    },
    {
        "content": "SYDNEY Australian logistics firm Qube Holdings Ltd  said on Friday it and partners had bought a near 20 percent stake in freight firm Asciano Ltd   seeking to block a $6.5 billion bid from Canada's Brookfield Asset Management .",
        "date": "10292015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Australia's Qube seeks to block Brookfield's bid for Asciano with stake "
    },
    {
        "content": "* Qube  partners pick up 19.99 pct stake in late Thursday raid",
        "date": "10292015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 1-Australia's Qube seeks to block Brookfield's bid for Asciano with stake "
    },
    {
        "content": "SYDNEY  Oct 30 Australian logistics firm Qube Holdings Ltd said on Friday it and partners had bought a near 20 percent stake in freight firm Asciano Ltd  seeking to block a $6.5 billion bid from Canada's Brookfield Asset Management.",
        "date": "10292015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Australia's QUBE grabs 20 pct Asciano stake  blocking $6.5 bln Brookfield bid "
    },
    {
        "content": "MELBOURNE  Oct 29 Australia's Qube Holdings Ltd   a logistics services provider  has taken a near 20 percent stake in freight firm Asciano Ltd  potentially blocking a bid from a large Canadian rival  a source familiar with the transaction said on Thursday.",
        "date": "10292015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "RPT-QUBE takes near 20 pct stake in Asciano  eyes Brookfield block "
    },
    {
        "content": "MELBOURNE  Oct 29 Australia's Qube Holdings Ltd   a logistics services provider  has taken a near 20 percent stake in freight firm Asciano Ltd  potentially blocking a bid from a large Canadian rival  a source familiar with the transaction said on Thursday.",
        "date": "10292015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "QUBE takes near 20 pct stake in Asciano  eyes Brookfield block "
    },
    {
        "content": "SYDNEY  Oct 15 Australia's competition regulator said a proposed A$8.9 billion  ($6.50 billion) takeover by Canada's Brookfield Asset Management of local port and rail freight firm Asciano Ltd may hurt competition for other coal haulage operators.",
        "date": "10142015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Australian regulator sees antitrust concerns on Brookfield Asciano buyout "
    },
    {
        "content": "SYDNEY An Australian regulator raised antitrust concerns over a planned $6.5 billion takeover by Canada's Brookfield Asset Management  of freight firm Asciano Ltd   potentially jeopardizing the country's biggest inbound deal in four years.",
        "date": "10152015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Australia regulator throws Brookfield's $6.5 billion Asciano buyout into doubt "
    },
    {
        "content": "* Shares down on delay concerns   (Adds comments from Brookfield)",
        "date": "10152015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 3-Australia regulator throws Brookfield's $6.5 bln Asciano buyout into doubt "
    },
    {
        "content": "Oct 7 Canada's Brookfield Asset Management Inc   said it would spin off 35 percent of Brookfield Business Partners LP   which will own almost all of the asset manager's business services and industrial operations assets.",
        "date": "10072015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "UPDATE 1-Brookfield Asset Management to spin off and list unit "
    },
    {
        "content": "Oct 7 Canada's Brookfield Asset Management Inc  said it would spinoff 35 percent of Brookfield Business Partners LP  the asset manager's business services and industrial operations in its private equity unit.",
        "date": "10072015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brookfield Asset Management to spin off 35 pct of unit "
    },
    {
        "content": "NEW DELHI  Aug 28 Canada's Brookfield Asset Management made its first significant investment in Indian infrastructure  buying six road and three power projects on Friday from India's Gammon Infrastructure Projects Limited .",
        "date": "08282015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "UPDATE 1-Brookfield buys into Indian infrastructure with road & power deal "
    },
    {
        "content": "NEW DELHI  Aug 28 Canada's Brookfield Asset Management on Friday made its first significant investment in Indian infrastructure  buying six road and three power projects from India's Gammon Infrastructure Projects Limited.",
        "date": "08282015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brookfield buys into Indian infrastructure with road & power deal "
    },
    {
        "content": "SYDNEY Canada's Brookfield Asset Management is buying Australian port and rail freight firm Asciano for $6.6 billion to form a global logistics player  scooping up an asset that has been made cheaper by a slump in coal prices.",
        "date": "08182015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Canada's Brookfield buying Australia freight firm Asciano for $6.6 billion "
    },
    {
        "content": "A group led by Canada's Brookfield Asset Management will buy Australian logistics firm Asciano Ltd for A$8.9 billion ($6.56 billion)  creating a global port and rail freight business.",
        "date": "08172015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brookfield in $6.5 billion deal for Australian freight firm Asciano "
    },
    {
        "content": "* Offer at 13 pct premium to Asciano's Friday price   (Recasts throughout; adds analyst and company quotes)",
        "date": "08182015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 5-Canada's Brookfield buying Australia freight firm Asciano for $6.6 bln "
    },
    {
        "content": "* Brookfield Infra shares fall as much as 7 percent   (Updates throughout  includes Asciano profit)",
        "date": "08172015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 4-Brookfield in $6.5 bln deal for Australian freight firm Asciano "
    },
    {
        "content": "* Media report says company to recommend Brookfield takeover deal",
        "date": "08172015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "CORRECTED-Australia's Asciano halts trading  media report says to recommend $6.5 bln Brookfield offer "
    },
    {
        "content": "SYDNEY Canada's Brookfield Asset Management  has approached Australia's Asciano Ltd  with a $6.8 billion takeover bid  but uncertainty about whether the deal would go through capped gains in the stock price of the rail freight firm.",
        "date": "07012015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Canada's Brookfield makes $6.8 billion play for Australian freight major Asciano "
    },
    {
        "content": " ",
        "date": "07012015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "UPDATE 2-Canada's Brookfield makes $6.8 bln play for Australian freight major Asciano "
    },
    {
        "content": "TORONTO  May 6 Brookfield Asset Management Inc   one of Canada's top investment management firms  is actively scouting for oil assets in the oil-rich Western Canadian province of Alberta  said Chief Executive Bruce Flatt on Wednesday.",
        "date": "05062015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brookfield says scouting for oil assets in Alberta "
    },
    {
        "content": "MADRID  May 1 Spanish infrastructure group Abertis said on Friday it was launching an offer to buy out the listed shares in its Brazilian motorways operator Arteris  alongside its partner  a unit of Canada's Brookfield Asset Management.",
        "date": "05012015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Abertis  Brookfield bid to buy out rest of Brazil motorways business "
    },
    {
        "content": "Associated Estates Realty Corp  agreed to be bought by Canada's Brookfield Asset Management Inc  for about $1.66 billion  months after activist investor Jonathan Litt asked for a sale of the U.S. real estate investment trust.",
        "date": "04222015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Associated Estates to sell itself as investor piles pressure "
    },
    {
        "content": "April 22 Brookfield Asset Management Inc  said it had agreed to buy Associated Estates Realty Corp for about $2.5 billion in cash  including debt.",
        "date": "04222015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "normal",
        "symbol": "BAM",
        "title": "Brookfield Asset to buy Associated Estates Realty for $2.5 bln "
    },
    {
        "content": "TORONTO  April 20 Brookfield Asset Management Inc  said on Monday it is raising $1.1 billion through a new equity issue that will help the alternative asset manager fund some of the deals it is currently eyeing.",
        "date": "04202015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brookfield announce $1 billion equity offering to fund growth "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 11 (Fitch) Fitch Ratings has downgraded the long-term IDR and  senior unsecured debt ratings of Brookfield Asset Management Inc. (BAM) to  'BBB-' from 'BBB'. The Rating Outlook is Stable. The ratings were previously on  Rating Watch Negative. KEY RATING DRIVERS  The rating action reflects Fitch's application of the 'Rating Investment Holding  Companies' criteria  in particular the quality and diversification of dividend ",
        "date": "03112015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Fitch Downgrades Brookfield Asset Management's IDR to 'BBB-'; Outlook Stable "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  February 24 (Fitch) Fitch Ratings has placed the Issuer Default Rating  (IDR) and outstanding credit ratings of Brookfield Asset Management  Inc. on  Rating Watch Negative as follows: --IDR 'BBB'; --Senior unsecured notes 'BBB'. KEY RATING DRIVERS The Rating Watch Negative is driven by the application of Fitch's 'Rating  Investment Holding Companies' criteria  specifically Fitch's concerns regarding  the quality and diversific",
        "date": "02242015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Fitch Places Brookfield Asset Management on Rating Watch Negative "
    },
    {
        "content": "TORONTO  Jan 23 Brookfield Asset Management Inc  said on Friday it has reached an agreement to acquire the 50 percent interest of its Canadian and Australian facilities management businesses that it does not already own from Johnson Controls Inc for about $200 million.",
        "date": "01232015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Brookfield to establish global facilities management business "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 13 (Fitch) Fitch Ratings assigns a 'BBB' rating to Brookfield  Asset Management's (BAM) $500 million 4.0% senior unsecured notes due 2025. The  rating Outlook is Stable. Proceeds will be used for general corporate purposes.  KEY RATING DRIVERS Positive: --Diversified and stable revenue sources from a global investment portfolio; --Underlying commercial real estate  power generation and infrastructure assets  are indivi",
        "date": "01132015",
        "name": "Brookfield Asset Management Inc",
        "news_type": "topStory",
        "symbol": "BAM",
        "title": "Fitch Rates Brookfield Asset Management's Senior Unsecured Notes 'BBB'; Outlook Stable "
    }
]