[
    {
        "content": "LIMA Peruvian financial holding company Credicorp on Monday reported 920.2 million soles ($283.75 million) in its second-quarter net profit  up 5.3 percent from the same period a year earlier.",
        "date": "08072017",
        "name": "Credicorp Ltd",
        "news_type": "topStory",
        "symbol": "BAP",
        "title": "Peru's Credicorp posts 5.3 percent rise in net profit in second quarter "
    },
    {
        "content": "LIMA  Aug 7 Peruvian financial holding company Credicorp  on Monday reported 920.2 million soles ($283.75 million) in its second-quarter net profit  up 5.3 percent from the same period a year earlier.",
        "date": "08072017",
        "name": "Credicorp Ltd",
        "news_type": "normal",
        "symbol": "BAP",
        "title": "Peru's Credicorp posts 5.3 pct rise in net profit in 2nd qtr "
    },
    {
        "content": "LIMA  May 4 Peruvian financial holding company Credicorp  reported 889.6 million soles ($271.05 million) in first-quarter net profit on Thursday  up 11.8 percent from the same period a year earlier. That was down 0.6 percent from the prior quarter  Credicorp said  adding that its results were hit by a strong El Nino phenomenon. Storms and flooding linked to El Nino in February and March killed hundreds  damaged infrastructure  and prompted Peru's government to slash growth expectatio",
        "date": "05042017",
        "name": "Credicorp Ltd",
        "news_type": "topStory",
        "symbol": "BAP",
        "title": "Peru's Credicorp reports 11.8 pct rise in Q1 net profit "
    },
    {
        "content": "LIMA  Feb 6 Peruvian financial holding company Credicorp  reported 895 million soles ($275 million) in fourth-quarter net profit on Monday  up 22.4 percent from the same period a year earlier.",
        "date": "02072017",
        "name": "Credicorp Ltd",
        "news_type": "topStory",
        "symbol": "BAP",
        "title": "Peru's Credicorp reports 22.4 pct rise in Q4 net profit "
    },
    {
        "content": "* Said on Thursday that it transferred to its unit Grupo Credito 268.5 million shares  that is a 3.80 percent stake  in Banco de Credito del Peru (BCP) in an operation carried out on Lima Stock Exchange at 5.51 soles ($1.64) per share",
        "date": "01132017",
        "name": "Credicorp Ltd",
        "news_type": "topStory",
        "symbol": "BAP",
        "title": "BRIEF-Credicorp transfers 3.80 pct stake in Peru's BCP to its unit "
    },
    {
        "content": "LIMA  Nov 4 Peruvian financial holding company Credicorp reported third-quarter profits up by 10.8 percent from a year earlier  helped by an increase in net interest income despite negligible loan growth.",
        "date": "11042016",
        "name": "Credicorp Ltd",
        "news_type": "topStory",
        "symbol": "BAP",
        "title": "Credicorp reports 11 pct rise in net profit in Q3 yr/yr "
    },
    {
        "content": "Aug 19 Brazil and Argentina have seized the emerging markets spotlight in recent months thanks to investor-friendly political upheavals  but much smaller Peru is quietly stealing the show.",
        "date": "08192016",
        "name": "Credicorp Ltd",
        "news_type": "normal",
        "symbol": "BAP",
        "title": "RPT-Peru's stealth rally upstages emerging market rivals "
    },
    {
        "content": "LIMA  Aug 8 Peruvian financial holding company Credicorp said on Monday that its net profit jumped 16.7 percent in the second quarter from the same period in 2015  helped by an increase in net interest income despite negligible loan growth.",
        "date": "08092016",
        "name": "Credicorp Ltd",
        "news_type": "topStory",
        "symbol": "BAP",
        "title": "Credicorp reports 16.7 pct rise in net profit in Q2 yr/yr "
    },
    {
        "content": "LIMA  Aug 10 Credicorp  Peru's biggest financial holding company  said Monday that its net profit rose 28 percent in the second quarter from the same period in 2014  helped by an expansion of bank loans and higher interest income.",
        "date": "08102015",
        "name": "Credicorp Ltd",
        "news_type": "topStory",
        "symbol": "BAP",
        "title": "UPDATE 1-Credicorp says second-quarter net profit rose 28 pct "
    },
    {
        "content": "LIMA  May 7 Credicorp  Peru's biggest financial holding company  said Thursday that its net profit rose 21.5 percent in the first quarter from a year ago  in part because of a 107 million soles ($33.97 million) boost from a business merger.",
        "date": "05082015",
        "name": "Credicorp Ltd",
        "news_type": "topStory",
        "symbol": "BAP",
        "title": "UPDATE 1-Credicorp reports 21.5 pct rise in quarterly net profit "
    },
    {
        "content": "LIMA  May 7 Credicorp  Peru's biggest financial holding company  said on Thursday that its net profit rose 21.5 percent in the first quarter compared with the same period a year ago  beating market expectations.",
        "date": "05082015",
        "name": "Credicorp Ltd",
        "news_type": "normal",
        "symbol": "BAP",
        "title": "Credicorp reports 21.5 pct rise in quarterly net profit "
    },
    {
        "content": "LIMA  Feb 9 Credicorp Ltd   Peru's biggest financial holding company  said on Monday its fourth-quarter net income rose 17 percent year over year to 495.6 million soles ($165.2 million)  below market expectations.",
        "date": "02102015",
        "name": "Credicorp Ltd",
        "news_type": "topStory",
        "symbol": "BAP",
        "title": "Credicorp reports 17 pct rise in fourth-quarter net profit on year "
    }
]