[
    {
        "content": "U.S. hospital products maker Baxter International Inc on Wednesday forecast a nearly $70 million hit to its fourth-quarter revenue  due to manufacturing disruptions arising from Hurricane Maria.",
        "date": "10252017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "Baxter expects $70 million hit to fourth-quarter sales from Hurricane Maria "
    },
    {
        "content": "* Shares slightly lower (Adds share price  CEO comments from analyst call)",
        "date": "10252017",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "UPDATE 2-Baxter expects $70 mln hit to 4th-qtr sales from Hurricane Maria "
    },
    {
        "content": "Oct 25 Hospital products maker Baxter International Inc on Wednesday forecast a nearly $70 million hit to its fourth-quarter revenue due to manufacturing disruptions arising from Hurricane Maria.",
        "date": "10252017",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "Baxter expects $70 mln hit to 4th-qtr sales from Hurricane Maria "
    },
    {
        "content": "* Baxter provides update on Puerto Rico recovery status post Hurricane Maria",
        "date": "10122017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter provides update on Puerto Rico recovery status post Hurricane Maria "
    },
    {
        "content": "* Baxter launches first 3-in-1 set for use in continuous renal replacement therapy and sepsis management protocols",
        "date": "09262017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter International ‍announces commercial launch of new indication for oXiris set​ "
    },
    {
        "content": "* Baxter International Inc - ‍launches DeviceVue Advanced Asset Tracking System for Sigma Spectrum Infusion System​ Source text for Eikon: Further company coverage: (Bangalore.newsroom@thomsonreuters.com)",
        "date": "09272017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter International Inc - ‍launches DeviceVue Advanced Asset Tracking System for Sigma Spectrum Infusion System​ "
    },
    {
        "content": "* Baxter and MATTER Healthcare Incubator Partner on patient-driven innovation",
        "date": "08312017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter and MATTER Healthcare on patient-driven innovation "
    },
    {
        "content": "NEW YORK Several big-name hedge fund investors trimmed their stakes in healthcare companies in the second quarter as the sector led the broad U.S. stock market higher  rallying amid a Republican effort to repeal and replace President Obama's signature healthcare law.",
        "date": "08142017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "Big-name U.S. hedge funds shed healthcare stocks during the rally in second-quarter "
    },
    {
        "content": "WASHINGTON  July 20 Baxter International Inc and Claris Lifesciences Ltd have agreed to divest two types of pharmaceutical products to settle U.S. Federal Trade Commission charges that Baxter's proposed acquisition of Claris’ injectable drugs business is anticompetitive  the agency said on Thursday.",
        "date": "07202017",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "U.S. FTC approves Baxter's acquisition of Claris business with condition "
    },
    {
        "content": "* Appointed Cathy R. Smith  executive vice president and cfo of target corp  to its board ​",
        "date": "07172017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter appoints Cathy R. Smith to its board "
    },
    {
        "content": "* Baxter announces agreement with dorizoe lifesciences to further expand generic injectables pipeline",
        "date": "06142017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter announces agreement with Dorizoe Lifesciences to further expand generic injectables pipeline "
    },
    {
        "content": "* Baxter announces U.S. FDA approval and commercial launch of ready-to-use clindamycin injection in saline",
        "date": "06072017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter announces U.S. FDA approval  commercial launch of ready-to-use clindamycin injection in saline "
    },
    {
        "content": "* Third Point Llc reports a stake of 7.5 percent in Baxter International as of June 1",
        "date": "06022017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Third Point Llc reports a stake of 7.5 pct in Baxter International "
    },
    {
        "content": "* Baxter and Mayo Clinic launch research and development collaboration to transform patient care",
        "date": "05312017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter and Mayo Clinic launch R&D collaboration to transform patient care "
    },
    {
        "content": "* Third Point LLC dissolves share stake in Apple Inc - sec filing",
        "date": "05122017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Third Point LLC dissolves share stake in Apple  Goldman Sachs "
    },
    {
        "content": "* in April 2017  co became aware of criminal investigation by U.S. DOJ  antitrust division and federal jury in U.S. District court for eastern district of Pennsylvania-filing",
        "date": "05042017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter International says in April became aware of criminal investigation by antitrust division of DOJ- SEC filing "
    },
    {
        "content": "* Baxter International Inc -  received guidance from FDA clarifying regulatory pathway for new peritoneal dialysis technology",
        "date": "05032017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter International says received guidance from FDA clarifying regulatory pathway for new peritoneal dialysis technology "
    },
    {
        "content": "* Baxter International Inc - sets qtrly dividend of 13 cents per share Source text for Eikon: Further company coverage:",
        "date": "05022017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter raises quarterly dividend "
    },
    {
        "content": "* Baxter reports first-quarter 2017 results and increases financial outlook for full-year 2017",
        "date": "04262017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter International Q1 revenue $2.5 billion "
    },
    {
        "content": "* José E. Almeida  chairman and ceo of Baxter International  elected to Walgreens Boots Alliance board of directors",
        "date": "04192017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Walgreens Boots Alliance elects Baxter International CEO José Almeida to its board "
    },
    {
        "content": "* Ceo josé almeida's fy 2016 total compensation $5.8 million versus $7.95 million in fy 2015 - sec filing  Source text for Eikon:  Further company coverage:",
        "date": "03172017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter CEO José Almeida's FY 2016 compensation $5.8 mln vs $7.95 mln in FY 2015 "
    },
    {
        "content": "NEW YORK  March 13 Investors are seeking shelter in shares of U.S. medical device and supply companies  encouraged by their solid growth prospects and wary that U.S. President Donald Trump's criticism of drug prices makes owning pharmaceutical and biotechnology stocks risky.",
        "date": "03132017",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "U.S. medtech shares gain as investors seek shelter from drug price debate "
    },
    {
        "content": "* Entered into a Good Manufacturing Practice (GMP) agreement with Baxter Laboratories Pty Ltd",
        "date": "03082017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Skin Elements enters into agreement with Baxter Laboratories "
    },
    {
        "content": "* Ameren corp- ceo warner l. Baxter's total 2016 compensation was $6.6 million versus $6.5 million in 2015  Source text for Eikon:  Further company coverage:",
        "date": "03152017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Ameren CEO Warner L. Baxter's 2016 compensation $6.6 mln vs $6.5 mln in 2015 "
    },
    {
        "content": "* Third Point LLC says on Feb 28  it sold about 5.9 mln shares of Baxter International Inc's common stock in a block trade at $50.35 per share",
        "date": "03012017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Third Point sells 5.9 mln shares of Baxter International's common stock in block trade on Feb 28 "
    },
    {
        "content": "* Baxter and Scinopharm announce exclusive strategic partnership for generic oncology injectables",
        "date": "02282017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter and Scinopharm announce partnership for generic oncology injectables "
    },
    {
        "content": "* Baxter debuts enteral nutrition ENFit syringe and accessory line during clinical nutrition week 2017",
        "date": "02162017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter debuts enteral nutrition ENFit syringe and accessory line in clinical nutrition week 2017 "
    },
    {
        "content": "* Appointment brings total number serving on board to 12  Source text for Eikon:  Further company coverage:",
        "date": "02082017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter appoints Stephen Oesterle to its board "
    },
    {
        "content": "* Baxter's renal therapy services significantly reduced peritonitis infections among home dialysis patients",
        "date": "01192017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter's renal therapy services significantly reduced peritonitis infections among home dialysis patients "
    },
    {
        "content": "WASHINGTON Baxter International has agreed to pay $18 million to resolve its criminal and civil liability over claims its unit ignored mold in air filters at a plant where sterile intravenous solutions were made  the U.S. Justice Department said on Thursday.",
        "date": "01132017",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "Baxter to pay $18 million over mold at North Carolina plant "
    },
    {
        "content": "WASHINGTON  Jan 12 Baxter International  has agreed to pay $18 million to resolve its criminal and civil liability over claims its unit ignored mold in air filters at a plant where sterile intravenous solutions were made  the U.S. Justice Department said on Thursday.",
        "date": "01132017",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "UPDATE 2-Baxter to pay $18 mln over mold at North Carolina plant "
    },
    {
        "content": "* Baxter International Inc - presented exploratory research on the removal of inflammation-related molecules during extracorporeal blood purification therapy",
        "date": "11222016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter presented exploratory research on the removal of inflammation-related molecules during extracorporeal blood purification therapy "
    },
    {
        "content": "* Baxter declares quarterly dividend and announces expanded share repurchase authorization",
        "date": "11082016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter declares quarterly dividend and announces expanded share repurchase authorization "
    },
    {
        "content": "* Baxter reports third quarter 2016 results and increases financial outlook for full-year 2016",
        "date": "10252016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter Q3 adj earnings per share $0.56 from continuing operations excluding items "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 03 (Fitch) Fitch Ratings has affirmed Baxter International  Inc.'s (BAX/Baxter) Long-Term Issuer Default Rating at 'BBB+'. The Rating  Outlook is Stable. Baxter had approximately $3.2 billion in outstanding debt at June 30  2016. A  full list of Baxter's ratings follows at the end of this release.  KEY RATING DRIVERS --The 'BBB+' rating reflects Baxter's significant deleveraging and strong  operating performance post th",
        "date": "10032016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "Fitch Affirms Baxter International Inc.'s IDR at 'BBB+'; Outlook Stable "
    },
    {
        "content": "* Sunshine Heart announces strategic acquisition of Aquadex product line from Baxter and a new credit facility with Silicon Valley Bank",
        "date": "08082016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Sunshine Heart buys Baxter's Aquadex product line "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 10 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to Baxter  International Inc.'s (Baxter) senior unsecured notes offering. Fitch expects the  net proceeds from the issuance to be used to pay down existing debt and  short-term borrowings  as well as other general corporate purposes. Baxter had approximately $3.2 billion in outstanding debt at June 30  2016. A  full list of Baxter's ratings follows at the end of this ",
        "date": "08102016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "Fitch Rates Baxter International Inc.'s Notes Offering 'BBB+' "
    },
    {
        "content": "July 26 Baxter Reports Second Quarter 2016 Results And Raises Financial Outlook For Full",
        "date": "07262016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter Q2 earnings $2.19/shr from cont ops "
    },
    {
        "content": "* Baxter presents new evidence demonstrating REVACLEAR Dialyzer associated with lower drug use during hemodialysis",
        "date": "07272016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter presents results of study related to REVACLEAR dialyzer "
    },
    {
        "content": "* Sets quarterly dividend of $0.13 per share  Source text for Eikon:  Further company coverage:",
        "date": "07192016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter International sets quarterly dividend of $0.13 per share "
    },
    {
        "content": "* Bauerfeind AG indirectly holds a blocking minority of 25 pct of the shares in Co.Don AG  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "07122016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Co Don says Bauerfeind AG is new major shareholder "
    },
    {
        "content": "* Baxter international says announces health canada approval of AMIA automated peritoneal dialysis system with sharesource connectivity platform",
        "date": "06292016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter International announces health canada approval of AMIA automated peritoneal dialysis system "
    },
    {
        "content": "* Data shows sigma spectrum infusion system users achieved 97 percent drug library compliance rate within the first month of implementation1  Source text for Eikon:  Further company coverage:",
        "date": "06162016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter International reports data results from infusion system "
    },
    {
        "content": "Blood-testing company Theranos Inc was sued on Thursday  accused of endangering customer health through \"massive failures\" that misrepresented the accuracy and quality of its blood tests  according to court papers.",
        "date": "05272016",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "Theranos sued over blood tests  in proposed class action "
    },
    {
        "content": "May 26 Blood-testing company Theranos Inc was sued on Thursday  accused of endangering customer health through \"massive failures\" that misrepresented the accuracy and quality of its blood tests  according to court papers.",
        "date": "05272016",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "UPDATE 1-Theranos sued over blood tests  in proposed class action "
    },
    {
        "content": "May 18 Blood-testing firm Theranos Inc notified the U.S. federal health regulators that it voided results from its Edison blood-testing devices for two years  the Wall Street Journal reported on Wednesday  citing a person familiar with the matter.",
        "date": "05192016",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "Theranos voids two years of Edison test results - WSJ "
    },
    {
        "content": "* Baxter announces final exchange ratio of 1.1591 for baxalta exchange offer",
        "date": "05172016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter International announces final exchange ratio of 1.1591 for Baxalta exchange offer "
    },
    {
        "content": "* Establishes scientific advisory board  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "05102016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Co Don establishes scientific advisory board "
    },
    {
        "content": "* Expects to grow sales 3 to 4 percent on a compounded annual basis at constant currency rates from 2016 through 2018",
        "date": "05092016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter expects to generate free cash flow of about $1.75 bln in 2020 "
    },
    {
        "content": "* Baxter increases the size of its previously announced offer to exchange shares of baxter for shares of baxalta",
        "date": "05042016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter International says to increase size of its offer to exchange shares of company for shares of Baxalta "
    },
    {
        "content": "* Board declared a 13 percent increase in company's quarterly dividend rate to $0.13 per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05032016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter raises quarterly dividend by 13 pct to $0.13 per share "
    },
    {
        "content": "* Baxter receives marketing authorization in the united kingdom and denmark for numeta g13e ready-to-use iv nutrition for preterm newborns",
        "date": "04202016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter receives marketing authorization in UK  Denmark for NUMETA G13E "
    },
    {
        "content": "* Baxter announces u.s. Launch of premix drug vancomycin injection in sodium chloride",
        "date": "04192016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter announces U.S. launch of Vancomycin injection in sodium chloride "
    },
    {
        "content": "* Execs say \"transformative M&A is not in the cards\" right now - Conf call  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04262016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter execs say \"transformative M&A is not in the cards\" right now "
    },
    {
        "content": "Baxter International Inc  reported a better-than-expected quarterly profit and lifted its adjusted earnings forecast for 2016.",
        "date": "04262016",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "Baxter lifts 2016 adjusted profit forecast after strong quarter "
    },
    {
        "content": "* Baxter initiates offer to exchange shares of baxter for shares of baxalta",
        "date": "04212016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Baxter International initiates offer to exchange shares for shares of Baxalta "
    },
    {
        "content": "April 26 Baxter International Inc  reported a better-than-expected quarterly profit and lifted its adjusted earnings forecast for 2016.",
        "date": "04262016",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "UPDATE 1-Baxter lifts 2016 adjusted profit forecast after strong quarter "
    },
    {
        "content": "* Reports first quarter 2016 results and provides updated financial outlook for full-year 2016",
        "date": "04262016",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "BRIEF-Baxter reports Q1 adj. earnings $0.36/shr from continuing operations "
    },
    {
        "content": "April 26 Baxter International Inc  reported a near 1 percent fall in first-quarter net sales  constrained by the dollar's strength.",
        "date": "04262016",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "Baxter's sales dip 1 pct  hurt by strong dollar "
    },
    {
        "content": "* Revenue for Q1 of 2016 came to 1.635 million euros (previous year: 1.326 million euros)  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "04122016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Co don Q1 revenue up at EUR 1.635 mln "
    },
    {
        "content": "NEW YORK/BOSTON  Feb 16 Top U.S. hedge fund management firms  including Visium Asset Management  took stakes in embattled renewable energy company SunEdison Inc  during the fourth quarter.",
        "date": "02162016",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "HIGHLIGHTS-Hedge funds pile into SunEdison shares ahead of plunge "
    },
    {
        "content": "Baxter International Inc  reported lower quarterly revenue and forecast current-quarter earnings below analysts' estimates  hurt by a strong dollar and rising generic competition for its chemotherapy treatment in the United States.",
        "date": "02022016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "Baxter forecasts current-quarter profit below estimates "
    },
    {
        "content": "* Sees Q1 adj earnings 28-30 cents/shr vs est 31 cents/share   (Adds details  shares)",
        "date": "02022016",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "UPDATE 2-Baxter forecasts current-quarter profit below estimates "
    },
    {
        "content": "Feb 2 Hospital products and drug maker Baxter International Inc's quarterly revenue fell 7 percent  hurt by a strong dollar and increased generic competition for its chemotherapy treatment in the United States.",
        "date": "02022016",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "CORRECTED-UPDATE 1-Baxter revenue falls 7 percent hit by dollar "
    },
    {
        "content": "Feb 2 Baxter International Inc reported a 78 percent fall in quarterly profit  hurt by lower sales of its hospital products.",
        "date": "02022016",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "Baxter profit falls 78 pct "
    },
    {
        "content": "* Unit Eczacibasi Baxter Hastane Urunleri decides to terminate production in Ayazaga  Istanbul facility until Dec. 31 gradually due to urban transformation project in Ayazaga and Baxter's group's worldwide reorganization plans",
        "date": "01222016",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Eis Eczacibasi Ilac unit Eczacibasi Baxter to terminate production in Ayazaga facility "
    },
    {
        "content": "Oct 27 Baxter International Inc said on Tuesday it plans to cut about 1 400 jobs worldwide  or about 5 percent of its non-manufacturing workforce  as part of a broad effort to reduce costs and boost profits.",
        "date": "10272015",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "Baxter to cut 1 400 jobs worldwide to boost profits "
    },
    {
        "content": "Oct 28 Hospital products maker Baxter International said it named José Almeida chief executive officer  succeeding Robert Parkinson  who retires on Jan. 1.",
        "date": "10282015",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "Baxter names former Covidien chief José Almeida CEO "
    },
    {
        "content": "Oct 28 Hospital products maker Baxter International said José Almeida  former chief executive of Covidien Plc  will succeed Robert Parkinson as its top executive on Jan. 1.",
        "date": "10282015",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "UPDATE 1-Baxter names former Covidien chief José Almeida CEO "
    },
    {
        "content": "Sept 30 Drugmaker Baxter International Inc  said it agreed to name Third Point LLC's Munib Islam to its board nearly two months after the hedge fund disclosed a stake in the company.",
        "date": "09302015",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "UPDATE 1-Drugmaker Baxter names Third Point's partner to board "
    },
    {
        "content": "Sept 30 Drugmaker Baxter International Inc  said it agreed to name Third Point LLC's Munib Islam to its board and would add another  \"mutually agreed upon\" independent director in the near-term.",
        "date": "09302015",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "Drugmaker Baxter names Third Point's partner to board "
    },
    {
        "content": "BOSTON  Aug 5 Billionaire investor Daniel Loeb on Wednesday asked for two board seats at Baxter International  after publicly unveiling the roughly $2 billion stake his hedge fund  Third Point  recently took in the healthcare company.",
        "date": "08052015",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "Loeb asks for board seats at Baxter  discloses new stake "
    },
    {
        "content": "LONDON Drugmaker Shire  said on Tuesday it was seeking to buy Baxalta   a company spun-off by Baxter International  last month  for $30 billion to forge the leading global specialist in rare diseases.",
        "date": "08042015",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "Drugmaker Shire bids $30 billion for Baxter spin-off Baxalta "
    },
    {
        "content": "BOSTON  Aug 5 Billionaire investor Daniel Loeb on Wednesday asked for two board seats at Baxter International  after publicly unveiling the roughly $2 billion stake his hedge fund  Third Point  recently took in the healthcare company.",
        "date": "08052015",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "UPDATE 1-Loeb asks for board seats at Baxter  discloses new stake "
    },
    {
        "content": "* Goes public with all-share offer after private approach rebuffed",
        "date": "08042015",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "UPDATE 5-Drugmaker Shire bids $30 bln for Baxter spin-off Baxalta "
    },
    {
        "content": "Aug 4 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Tuesday:",
        "date": "08042015",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Announces presentation of the results of the Phase 2 trial in Chicago",
        "date": "06032015",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Co Don presents results of Phase 2 trial in Chicago "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 29 (Fitch) Fitch Ratings has downgraded Baxter International Inc.'s  (Baxter) long-term Issuer Default Rating (IDR) by two notches to 'BBB+' and  assigned a Stable Rating Outlook. In addition  Fitch downgraded the company's  short-term IDR to 'F2' from 'F1'. Baxter had approximately $10 billion in outstanding debt at March 31  2015. A  full list of Fitch's ratings actions follows at the end of this release. KEY RATING DRIVE",
        "date": "05292015",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "Fitch Downgrades Baxter International Inc. to 'BBB+'; Outlook Stable "
    },
    {
        "content": "Novo Nordisk on Wednesday rejected claims by Baxter International that its drug used substances developed by the U.S. rival  following the launch this week of a U.S. investigation into possible patent infringement.",
        "date": "05202015",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "Novo Nordisk  Baxter clash over haemophilia drug patent "
    },
    {
        "content": "COPENHAGEN Novo Nordisk on Wednesday rejected claims by Baxter International that its drug used substances developed by the U.S. rival  following the launch this week of a U.S. investigation into possible patent infringement.",
        "date": "05202015",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "Novo Nordisk  Baxter clash over hemophilia drug patent "
    },
    {
        "content": "COPENHAGEN  May 20 Novo Nordisk on Wednesday rejected claims by Baxter International that its drug used substances developed by the U.S. rival  following the launch this week of a U.S. investigation into possible patent infringement.",
        "date": "05202015",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "UPDATE 1-Novo Nordisk  Baxter clash over haemophilia drug patent "
    },
    {
        "content": "COPENHAGEN  May 20 Novo Nordisk said on Wednesday it rejected claims by U.S. rival Baxter International that it had infringed patents on drugs to treat the bleeding disorder haemophilia  the Danish company said on Wednesday.",
        "date": "05202015",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "Novo Nordisk rejects Baxter patent claim over Novoeight "
    },
    {
        "content": "Baxter International Inc  said it agreed to buy two drugs to treat a rare form of blood cancer from Italian drugmaker Sigma-Tau Finanziaria SpA for $900 million  before expenses.",
        "date": "05122015",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "Baxter buys cancer drugs from Italian drugmaker for $900 million "
    },
    {
        "content": "May 12 Baxter International Inc said it agreed to buy two drugs to treat a rare form of blood cancer from Italian drugmaker Sigma-Tau Finanziaria SpA for $900 million  before expenses.",
        "date": "05122015",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "UPDATE 1-Baxter buys cancer drugs from Italian drugmaker for $900 mln "
    },
    {
        "content": "May 12 Baxter International Inc said it agreed to buy Italian drugmaker Sigma-Tau Finanziaria SpA's portfolio of drugs to treat rare forms of blood cancer for $900 million  before expenses.",
        "date": "05122015",
        "name": "Baxter International Inc",
        "news_type": "normal",
        "symbol": "BAX",
        "title": "Baxter buys cancer drugs from Italian drugmaker for $900 mln "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 20 (Fitch) Fitch Ratings has maintained Baxter International  Inc.'s (Baxter; NYSE: BAX) long- and short-term ratings on Rating Watch  Negative. Fitch placed the company's ratings on Negative Watch in March 2014  when Baxter announced it plans to spin off its BioScience business. A full list  of the company's ratings follows at the end of this press release.  The ratings apply to approximately $9.21 billion of debt outsta",
        "date": "03202015",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "Fitch Maintains Baxter International on Rating Watch Negative "
    },
    {
        "content": "* Reaches milestone for EU-wide approval: successful patient recruitment for phase III clinical trial  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "01122015",
        "name": "Baxter International Inc",
        "news_type": "topStory",
        "symbol": "BAX",
        "title": "BRIEF-Co don AG reaches milestone for EU-wide approval "
    }
]