[
    {
        "content": "TORONTO  Nov 17 BlackBerry Ltd Chief Operating Officer Marty Beard has resigned from the Canadian software company  effective Dec. 1  to help family members deal with health issues  a person familiar with the plans told Reuters on Friday.",
        "date": "11172017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "UPDATE 2-BlackBerry COO resigns to deal with family issues -source "
    },
    {
        "content": "TORONTO  Nov 17 BlackBerry Ltd Chief Operating Officer Marty Beard has resigned from the Canadian software company  effective Dec. 1  to help family members deal with health issues  a person familiar with the plans told Reuters on Friday.",
        "date": "11172017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry COO Beard resigns to deal with family health issues -source "
    },
    {
        "content": "TORONTO Canada's BlackBerry Ltd   announced the outsourcing of a significant part of its patent licensing efforts on Wednesday to a unit of the U.S.-based Marconi Group.",
        "date": "11162017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry shifts patent strategy through outsourcing deal "
    },
    {
        "content": "Nov 15 Canada's BlackBerry Ltd said on Wednesday it agreed to allow Teletry  a unit of patent licensing firm Marconi Group  to sub-license a broad range of its patents to global smartphone manufacturers.",
        "date": "11152017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry signs patent licensing deal with Teletry "
    },
    {
        "content": "TORONTO  Nov 15 Canada's BlackBerry Ltd announced the outsourcing of a significant part of its patent licensing efforts on Wednesday to a unit of the U.S.-based Marconi Group.",
        "date": "11162017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 1-BlackBerry shifts patent strategy through outsourcing deal "
    },
    {
        "content": "* Says co partners with BlackBerry to give integration  customization services for BlackBerry's embedded software solutions Source text: http://bit.ly/2zqSO9I Further company coverage:",
        "date": "11082017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-Tata Elxsi partners with BlackBerry to offer embedded software solutions "
    },
    {
        "content": "* Blackberry in talks with Tata Motors' Jaguar Land Rover for software deal- WSJ  citing sources Source text : http://on.wsj.com/2Agzg5T Further company coverage:",
        "date": "11032017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-Blackberry in talks with Tata Motors' Jaguar Land Rover for software deal- WSJ "
    },
    {
        "content": "BlackBerry Ltd's   U.S.-listed shares fell more than 1 percent on Monday  their first day of trading on the New York Stock Exchange  after a second senior executive at its patent licensing unit quit this month.",
        "date": "10162017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry shares down after another top exec leaves "
    },
    {
        "content": "TORONTO  Oct 16 BlackBerry Ltd Chief Executive John Chen said on Monday the company's strategy for generating licensing revenue from its patent portfolio remains on track following the recent departures of two people from the team negotiating deals.",
        "date": "10162017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry CEO says patent plans on track after departures "
    },
    {
        "content": "Oct 16 BlackBerry Ltd's U.S.-listed shares fell more than 1 percent on Monday  their first day of trading on the New York Stock Exchange  after a second senior executive at its patent licensing unit quit this month.",
        "date": "10162017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 1-BlackBerry shares down after another top exec leaves "
    },
    {
        "content": "Oct 16 BlackBerry's  U.S.-listed shares fell almost 4 percent to $11.12 on Monday after a second senior executive from its licensing unit quit this month.",
        "date": "10162017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "REFILE-BlackBerry shares down after another top exec leaves "
    },
    {
        "content": "TORONTO  Oct 13 A key attorney executing BlackBerry Ltd's patent licensing strategy has left the company  the second recent departure from the team tasked with making money from the Canadian company's intellectual property.",
        "date": "10132017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry patent licensing director says he has left company "
    },
    {
        "content": "TORONTO/NEW YORK BlackBerry Ltd  said a licensing deal it signed with low-end Android handset maker BLU Products Inc will bring it recurring revenue  ending a legal dispute over patents that rival Google has asked the U.S. government to revoke.",
        "date": "10122017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry details patent deal with Android maker BLU "
    },
    {
        "content": "TORONTO/NEW YORK  Oct 12 BlackBerry Ltd said a licensing deal it signed with low-end Android handset maker BLU Products Inc will bring it recurring revenue  ending a legal dispute over patents that rival Google has asked the U.S. government to revoke.",
        "date": "10122017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 1-BlackBerry details patent deal with Android maker BLU "
    },
    {
        "content": "Oct 12 BlackBerry Ltd said on Thursday it signed a new license agreement with BLU Products Inc  a Florida-based maker of low-end Android phones  that would end patent disputes between the two companies.",
        "date": "10122017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry signs license deal with Florida's BLU  ends patent dispute "
    },
    {
        "content": "* Blackberry and Blu Products enter into patent license agreement",
        "date": "10122017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry and Blu Products enter into patent license agreement "
    },
    {
        "content": "* Blackberry expands its channel ecosystem with six new partners in India",
        "date": "10032017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-Blackberry expands channel ecosystem with 6 new partners in India "
    },
    {
        "content": "* Blackberry announces plan to move to the New York Stock Exchange",
        "date": "10032017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry announces plan to move to the New York Stock Exchange "
    },
    {
        "content": "TORONTO  Oct 2 The man who was leading BlackBerry Ltd's efforts to make money from its patent portfolio has left to join a health technology company  two sources with knowledge of the move said on Monday.",
        "date": "10022017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry's patent strategy head exits  joins health tech firm -sources "
    },
    {
        "content": "TORONTO Canada's BlackBerry Ltd reported stronger-than-expected quarterly profit on Thursday as high-margin software sales hit a record  boosting investor confidence in its turnaround and sending shares up 14 percent.",
        "date": "09282017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry shares soar as software sales hit record "
    },
    {
        "content": "* BlackBerry QNX selected by Yanfeng Visteon for digital instrument cluster project",
        "date": "10022017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-BlackBerry QNX selected by Yanfeng Visteon for digital instrument cluster project "
    },
    {
        "content": "TORONTO  Sept 28 Canada's BlackBerry Ltd reported stronger-than-expected quarterly profit on Thursday as high-margin software sales hit a record  boosting investor confidence in its turnaround and sending shares up 14 percent.",
        "date": "09282017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 4-BlackBerry shares soar as software sales hit record "
    },
    {
        "content": "TORONTO  Sept 28 Canada's main stock index held steady on Thursday as broader declines were offset by a strong rally in BlackBerry Ltd and Bombardier Inc stocks.",
        "date": "09282017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX little changed as BlackBerry  Bombardier offset broader losses "
    },
    {
        "content": "TORONTO  Sept 28 Canada's main stock index turned positive shortly after the open  driven higher by better-than-expected results from BlackBerry Ltd and buoyant energy stocks amid higher crude prices.",
        "date": "09282017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX turns positive  buoyed by BlackBerry  oils "
    },
    {
        "content": "* Blackberry signs its first Blackberry Secure Licensing deal",
        "date": "09282017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry signs its first Blackberry Secure Licensing deal "
    },
    {
        "content": "* Blackberry reports record software and services revenue in fiscal 2018 second quarter",
        "date": "09282017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry reports record software and services revenue in fiscal 2018 Q2 "
    },
    {
        "content": "TORONTO  Sept 20 Canada's benchmark stock index rallied to a 14-week high on Wednesday  propelled by energy and financial stocks  as well as a surge in Air Canada and BlackBerry Ltd shares.",
        "date": "09202017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX rallies broadly led by energy  Air Canada  BlackBerry "
    },
    {
        "content": "TORONTO  Sept 28 BlackBerry Ltd posted a rise in second-quarter adjusted profit on lower revenue on Thursday as sales at its closely watched software business hit a record.",
        "date": "09282017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry Q2 profit rises on back of software sales "
    },
    {
        "content": "Auto suppliers Delphi Automotive Plc and BlackBerry Ltd will partner on a software operating system for self-driving cars  the companies said on Wednesday.",
        "date": "09202017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "Delphi  BlackBerry partner on self-driving software system "
    },
    {
        "content": "Sept 20 Auto suppliers Delphi Automotive Plc and BlackBerry Ltd  will partner on a software operating system for self-driving cars  the companies said on Wednesday.",
        "date": "09202017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 3-Delphi  BlackBerry partner on self-driving software system "
    },
    {
        "content": "* Blackberry  Fleet Complete announced they have entered into reselling partnership that will expand Fleet Complete's current fleet tracking & monitoring solution Source text for Eikon: Further company coverage:",
        "date": "09202017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry  Fleet Complete enter into reselling partnership "
    },
    {
        "content": "* Entire BlackBerry enterprise mobility suite been updated to fully support Apple's newly launched iOS 11 mobile operating system​ Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "09122017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-Blackberry updates enterprise mobility suite to support iOS 11 "
    },
    {
        "content": "* Financial structure of deal includes on-going royalty payments from Timex to Blackberry​ Source text for Eikon: Further company coverage:",
        "date": "09132017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-Blackberry and Timex Group enter patent license agreement "
    },
    {
        "content": "TORONTO  Aug 18 BlackBerry Ltd shares have been plunging from their more than two-year high hit in June after lackluster earnings and competitive threats have raised doubts about prospects for a turnaround at the business software maker.",
        "date": "08182017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry rally derailed as investors lose patience on turnaround "
    },
    {
        "content": "* Blackberry and Appdome enable codeless integration of secure voice  video and messaging Source text for Eikon: Further company coverage:",
        "date": "08152017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-Blackberry and Appdome enable codeless integration of secure voice  video and messaging "
    },
    {
        "content": "TORONTO BlackBerry Ltd  shares fell as much as 3.6 percent on the Toronto Stock Exchange on Tuesday after brokerage Goldman Sachs issued a \"sell\" recommendation on the stock  citing concerns about rising competition in its mobile software business.",
        "date": "08082017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry shares slide after Goldman 'sell' recommendation "
    },
    {
        "content": "TORONTO  Aug 8 Canada's main stock index was modestly higher on Tuesday as positive earnings results and a deal in the gaming sector helped offset declines in BlackBerry Ltd and other tech shares.",
        "date": "08082017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX up on Valeant  Ritchie results; BlackBerry falls on sell rating "
    },
    {
        "content": "TORONTO BlackBerry Ltd  said on Thursday it has won the right to sell tools for encrypting phone calls and text messages to the U.S. federal government  garnering an endorsement from the National Security Agency for the products.",
        "date": "07202017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry wins right to sell secure messaging tools to U.S. government "
    },
    {
        "content": "TORONTO  June 27 Software maker BlackBerry Ltd's long-running recovery effort has been slowed by a dearth of salespeople to promote its revamped and more complex products  with CEO John Chen pledging to hire more sales specialists to help achieve its growth target.",
        "date": "06272017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry seeks sales force to match software focus "
    },
    {
        "content": "WATERLOO  Ontario BlackBerry Ltd   posted quarterly revenue that missed analysts' forecasts due to an unexpected sales decline  pushing shares down as much as 13 percent  which would be their biggest one-day drop in more than two years.",
        "date": "06232017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry misses sales forecasts  shares tumble "
    },
    {
        "content": "* U.S.- and Canada-listed shares both fall more than 10 pct (Adds comments from BlackBerry CEO)",
        "date": "06232017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 5-BlackBerry misses sales forecasts  shares tumble "
    },
    {
        "content": "* BlackBerry CEO John Chen says expects software sales to rise 10-15 percent this year from $687 million in prior year",
        "date": "06232017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-BlackBerry CEO says needs to \"catch up\" to make software sales target "
    },
    {
        "content": "Western tech firms bow to Russian demands to share cyber secrets",
        "date": "06232017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "Reuters Business News Schedule at 1500 GMT/11 AM ET "
    },
    {
        "content": "TORONTO  June 23 Canada's main stock index opened moderately higher on Friday  as the index's heavyweight sectors offset sharp losses in BlackBerry Ltd shares  which tumbled after first quarter sales missed expectations.",
        "date": "06232017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX rises as resources lift  BlackBerry tumbles on miss "
    },
    {
        "content": "* BlackBerry CEO says Q1 sales drop due to decline professional services revenue  \"we feel comfortable\" on software license sales - conference call",
        "date": "06232017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-BlackBerry CEO says \"going to be more of second half growth\" for software and services business "
    },
    {
        "content": " (Corrects 27th paragraph of June 9 story to show Raymond James analyst expects Radar to garner 10 percent of an addressable market of 8 million trailers  not that Radar would sign up 8 million trailers) | Video ",
        "date": "06132017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "Born-again BlackBerry: Canadian icon hopes to ride trucks to growth "
    },
    {
        "content": "* Blackberry reports profitability in fiscal 2018 first quarter",
        "date": "06232017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry reports Q1 GAAP earnings of $1.23 per share "
    },
    {
        "content": "BOLTON  Ontario  June 9 A visit to trucking firm Titanium Transportation helps explain why BlackBerry's stock is once again a darling in Canadian markets  having soared 70 percent in two months.",
        "date": "06132017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "CORRECTED-Born-again BlackBerry: Canadian icon hopes to ride trucks to growth "
    },
    {
        "content": "* Blackberry Ltd - with respect to a normal course issuer bid (\"NCIB\") to purchase for cancellation up to 31 million blackberry common shares",
        "date": "06232017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry announces common share purchase program "
    },
    {
        "content": "June 23 Canada's BlackBerry Ltd reported a quarterly profit on Friday  helped by a $940 million arbitration payment from U.S. chipmaker Qualcomm Inc.",
        "date": "06232017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry reports quarterly profit on Qualcomm payment "
    },
    {
        "content": "* Blackberry Ltd Q1 non-GAAP EPS of $0.02; qtrly GAAP EPS of $1.23",
        "date": "06232017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry Q1 non-GAAP EPS of $0.02 "
    },
    {
        "content": "TORONTO BlackBerry Ltd   said on Wednesday it has developed new software for running complex computer systems on vehicles  giving the once dominant smartphone maker a leg up in a burgeoning segment of the technology market.",
        "date": "06072017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry offers software for running computer systems on cars "
    },
    {
        "content": "TORONTO  June 7 BlackBerry Ltd said on Wednesday it has developed new software for running complex computer systems on vehicles  giving the once dominant smartphone maker a leg up in a burgeoning segment of the technology market.",
        "date": "06072017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 1-BlackBerry offers software for running computer systems on cars "
    },
    {
        "content": "TORONTO BlackBerry Ltd on Monday downplayed news that Toyota Motor Corp would adopt rival software for its future vehicle consoles  saying it was more focused on the faster-growing market for autonomous driving technology.",
        "date": "06052017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry downplays Toyota's use of rival software "
    },
    {
        "content": "TORONTO  June 7 Blackberry Ltd. said on Wednesday it has developed new software for running complex computer systems on vehicles that will be bundled with semiconductors sold by Qualcomm Inc.",
        "date": "06072017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "Blackberry introduces auto software  will bundle with Qualcomm chips "
    },
    {
        "content": "TORONTO  June 5 BlackBerry Ltd on Monday downplayed news that Toyota Motor Corp would adopt rival software for its future vehicle consoles  saying it was more focused on the faster-growing market for autonomous driving technology.",
        "date": "06052017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 1-BlackBerry downplays Toyota's use of rival software "
    },
    {
        "content": "* Blackberry AtHoc signs new customers and partners in Australia and New Zealand Source text for Eikon: Further company coverage:",
        "date": "06052017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry AtHoc signs new customers and partners in Australia and New Zealand "
    },
    {
        "content": "TORONTO  June 5 BlackBerry Ltd on Monday downplayed news that Toyota Motor Corp would stop using its QNX software to run vehicle consoles  saying it is more focused on the faster-growing market for autonomous driving technology.",
        "date": "06052017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry downplays Toyota's move to rival software maker "
    },
    {
        "content": "TORONTO  June 1 Canada's main stock index rose on Thursday to a more than one-week high in a broad rally led by energy and financial shares  while BlackBerry Ltd jumped after an influential investment firm said the technology company's stock could double.",
        "date": "06012017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX rises to 1-week high  helped by jump in BlackBerry "
    },
    {
        "content": "TORONTO BlackBerry Ltd  shares jumped as much as 10 percent on Thursday  extending recent gains after an influential investment firm said the Canadian technology company's stock could double as a multiyear turnaround effort starts to show fruit.",
        "date": "06012017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry shares jump after bullish investment report "
    },
    {
        "content": "TORONTO  June 1 Canada's main stock index rose on Thursday in a broad rally led by steady oil prices that bolstered energy stocks  and a surge in BlackBerry Ltd shares.",
        "date": "06012017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX rises as BlackBerry  energy stocks lead rally "
    },
    {
        "content": "May 26 Canada's BlackBerry Ltd said on Friday that U.S. chipmaker Qualcomm Inc has agreed to pay the software maker $940 million  including interest and legal fees  to settle a royalty dispute.",
        "date": "05262017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry  Qualcomm decide on final amount to resolve royalty dispute "
    },
    {
        "content": "* Blackberry Ltd - reached an agreement with qualcomm incorporated resolving all amounts payable in connection with interim arbitration decision announced on April 12  2017​",
        "date": "05262017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry ltd announces final award in Qualcomm arbitration "
    },
    {
        "content": "TORONTO  May 23 Canada's main stock index rose on Tuesday  bolstered by bank stocks ahead of the release of earnings reports and a surge in BlackBerry Ltd shares  as trading resumed a day after the Victoria Day holiday.",
        "date": "05232017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX rises as bank shares climb ahead of earnings  BlackBerry jumps "
    },
    {
        "content": "TORONTO BlackBerry Ltd shares   surged to a four-year high in Toronto on Tuesday  extending a two-month rally spurred on by expectations for strong growth in the fast-expanding cyber security and automotive software markets.",
        "date": "05232017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry climbs on hopes for growth in security  autos "
    },
    {
        "content": "TORONTO  May 23 BlackBerry Ltd shares surged to a four-year high in Toronto on Tuesday  extending a two-month rally spurred on by expectations for strong growth in the fast-expanding cyber security and automotive software markets.",
        "date": "05232017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 1-BlackBerry climbs on hopes for growth in security  autos "
    },
    {
        "content": "TORONTO  May 23 Canada's main stock index rose on Tuesday after the Victoria Day holiday Monday  bolstered by bank stocks and a surge in BlackBerry Ltd shares.",
        "date": "05232017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX rises on financials and BlackBerry but energy weighs "
    },
    {
        "content": "TORONTO  May 23 BlackBerry Ltd's Toronto-listed shares surged 8.5 percent on Tuesday as investors raised expectations that the technology company's cyber security and automotive software will post strong growth  an analyst said.",
        "date": "05232017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry shares jump on hopes for growth in security  auto markets "
    },
    {
        "content": "TORONTO BlackBerry Ltd  is working with at least two automakers to develop a security service that would remotely scan vehicles for computer viruses and tell drivers to pull over if they were in critical danger  according to a financial analyst.",
        "date": "05172017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry working with automakers on anti-hack tool: analyst "
    },
    {
        "content": "TORONTO  May 16 BlackBerry Ltd is working with at least two automakers to develop a security service that would remotely scan vehicles for computer viruses and tell drivers to pull over if they were in critical danger  according to a financial analyst.",
        "date": "05162017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry working with automakers on anti-hack tool -analyst "
    },
    {
        "content": "* Blackberry -expanding capability of crisis communication software to enable government agencies  large organizations to account for their people in real-time",
        "date": "05172017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry to expand capability of crisis communication software "
    },
    {
        "content": "Smartphone maker BlackBerry Ltd won a court order on Tuesday temporarily lifting the stay in the bankruptcy of Avaya Inc to press a patent infringement case that the telecommunications company warned would threaten its reorganization efforts.",
        "date": "04252017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "Avaya's bankruptcy stay lifted to allow BlackBerry lawsuit "
    },
    {
        "content": "April 19 Qualcomm Inc  the largest maker of chips used in smartphones  reported 9.6 percent fall in quarterly revenue  hurt by an arbitration decision to pay Canada's BlackBerry Ltd for previously received royalties.",
        "date": "04192017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "CORRECTED-Chipmaker Qualcomm's revenue falls 9.6 pct "
    },
    {
        "content": "* New initiative with Allied World assurance where Allied will provide its cyber policyholders with direct access to co's cybersecurity services Source text for Eikon: Further company coverage:",
        "date": "04192017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry expands cybersecurity services reach via Allied World "
    },
    {
        "content": "TORONTO  April 12 Canada's main stock index ended lower on Wednesday  weighed down by losses among its heavyweight financial and natural resource sectors  while BlackBerry Ltd surged after a favorable arbitration ruling.",
        "date": "04122017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX ends lower as heavyweight sectors drag; BlackBerry jumps "
    },
    {
        "content": "April 12 BlackBerry Ltd said on Wednesday Qualcomm Inc was asked to pay the Canadian company about $814.9 million in an interim arbitration decision over royalty overpayments.",
        "date": "04122017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry awarded $814.9 mln in Qualcomm arbitration "
    },
    {
        "content": "Chipmaker Qualcomm Inc said on Wednesday it was asked to refund Canada's BlackBerry Ltd $814.9 million in an arbitration over royalties for certain past sales.",
        "date": "04122017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "Qualcomm to pay BlackBerry $814.9 million to settle royalties dispute "
    },
    {
        "content": "* Does not agree with the decision - Qualcomm (Adds details  analysts comment)",
        "date": "04122017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 2-Qualcomm to pay BlackBerry $814.9 mln to settle royalties dispute "
    },
    {
        "content": "TORONTO  April 12 Canada's main stock index slipped in morning trade on Wednesday  as losses for its heavyweight financial and natural resource sectors offset a sharp boost in BlackBerry Ltd shares after it won an arbitration ruling against chipmaker Qualcomm Inc.",
        "date": "04122017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX falls; BlackBerry jumps to 1-year high on arbitration win "
    },
    {
        "content": "TORONTO  April 12 Canada's main stock index opened slightly lower on Wednesday  while BlackBerry Ltd shares received a sharp boost after an arbitration panel ruled that chipmaker Qualcomm Inc must refund it $814.9 million in royalty payments.",
        "date": "04122017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX slips early; BlackBerry surges after arbitration win "
    },
    {
        "content": "* Qualcomm - announced binding interim arbitration award requiring co to refund a sum of $814.9 million  plus interest and attorneys' fees  to BlackBerry",
        "date": "04122017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-BlackBerry awarded $814.9 mln in Qualcomm arbitration "
    },
    {
        "content": "* Blackberry awarded U.S. $814 868 350.00 in arbitration against Qualcomm",
        "date": "04122017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry awarded $814.9 mln in Qualcomm arbitration "
    },
    {
        "content": "BlackBerry Ltd reported better-than-expected adjusted earnings for the sixth straight quarter  as the smartphone pioneer's shift to the higher-margin software business paid off.",
        "date": "03312017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry's profit beats expectations on software push "
    },
    {
        "content": "* Six of the TSX's 10 main groups were lower (Adds details  analyst comment  updates with close)",
        "date": "03312017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX slips but BlackBerry tempers decline; index up on quarter "
    },
    {
        "content": "TORONTO Although BlackBerry Ltd  has extricated itself from the smartphone handsets that weighed on its recent fortunes  the Canadian firm faces a tough slog to convince skeptics it can return to its glory days through an enlarged software business.",
        "date": "03302017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry  freed of handsets  looks to software for return to glory "
    },
    {
        "content": "March 31 Canada's BlackBerry Ltd  reported a smaller quarterly loss on Friday as operating costs nearly halved.",
        "date": "03312017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "RPT-BlackBerry posts smaller quarterly loss as costs fall "
    },
    {
        "content": "March 31 Canada's BlackBerry Ltd  reported better-than-expected quarterly earnings on Friday  as operating costs nearly halved  and said it expects to be profitable on an adjusted basis in 2018.",
        "date": "03312017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 1-BlackBerry's profit beats expectations "
    },
    {
        "content": "SAN FRANCISCO  March 8 WikiLeaks documents showing the U.S. Central Intelligence Agency considered a \"mission\" against connected car technology underscores auto industry concern that the science behind the next generation of vehicles could be turned against them.",
        "date": "03092017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "CIA 'mission' on cars shows concern about next-generation vehicles "
    },
    {
        "content": "TORONTO  March 2 Jim Mackey  the head of corporate development and strategy at BlackBerry Ltd   left the company in mid-February  he told Reuters on Thursday.",
        "date": "03022017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry's M&A head Mackey says left company in February "
    },
    {
        "content": "TORONTO  March 2 Jim Mackey  BlackBerry Ltd's   head of corporate development and strategy  left the technology company in mid-February  he said on Thursday  leaving a leadership gap as it transitions to software from smartphone hardware.",
        "date": "03022017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 2-BlackBerry's M&A head Mackey says left company in February "
    },
    {
        "content": "BARCELONA  Spain  Feb 25 Blackberry Ltd may have exited the device business  but fans of the pioneering email machine need not despair as Chinese smartphone maker TCL Communication has introduced its first Blackberry-licensed phone with the physical keyboard that was long its key allure.",
        "date": "02252017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "TCL carries flickering BlackBerry flame with new phone launch "
    },
    {
        "content": "BARCELONA Once famous mobile phones such as Nokia's classic 3310 from the turn of the century have been given a new lease of life as Chinese manufacturers revive Western brands to get an edge in an increasingly cut-throat handset market.",
        "date": "03022017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "Vintage Western phone brands resurrected by Chinese players "
    },
    {
        "content": "In the latest sign that Blackberry Ltd will be aggressively monetizing its patent portfolio  the struggling Canadian smartphone pioneer sued Nokia on Tuesday for infringing patents considered essential to wireless communications technology.",
        "date": "02162017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "Blackberry hits Nokia with lawsuit over wireless patents "
    },
    {
        "content": "* Blackberry ltd - announced partnership with isara corporation  a provider of quantum-resistant cryptography  Source text for Eikon:  Further company coverage:",
        "date": "02132017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-Blackberry partners with Isara Corp "
    },
    {
        "content": "TORONTO  Feb 6 BlackBerry Ltd has signed a hardware licensing agreement covering India and nearby countries  the Canadian company said on Monday  filling in the last markets where a third-party will manufacture its once-ubiquitous devices as it turns fully to software.",
        "date": "02062017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry inks hardware licensing deal covering India "
    },
    {
        "content": "* Blackberry announces its next major mobile software licensing agreement with Optiemus in India",
        "date": "02062017",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry announces mobile software licensing agreement with Optiemus in India "
    },
    {
        "content": "* Blackberry advances global expansion of its Athoc crisis communication software  Source text for Eikon:  Further company coverage:",
        "date": "01312017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-Blackberry advances global expansion of its Athoc crisis communication software "
    },
    {
        "content": "* Says \"I am disheartened and do not agree with the sharpness of President Trump's executive order and immigration ban\"  Source text - (http://blck.by/2jw2pjM) Further company coverage:",
        "date": "01302017",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-BlackBerry CEO \"disheartened\" with Trump's executive order  immigration ban "
    },
    {
        "content": "WATERLOO  Ontario BlackBerry Ltd    helped by its higher-margin software business  reported better-than-expected adjusted earnings and raised its full-year growth forecast on Tuesday  though concerns about overall revenue growth reversed early share gains.",
        "date": "12202016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry boosts outlook on software growth; concerns remain "
    },
    {
        "content": "OTTAWA Canada's BlackBerry Ltd plans to invest C$100 million ($75 million) in a new autonomous vehicle testing hub over several years  the company's chief executive said on Monday  as the fallen smartphone pioneer looks elsewhere for growth.",
        "date": "12192016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry spending $75 million on autos hub over several years "
    },
    {
        "content": "OTTAWA Canada's BlackBerry Ltd  will open an autonomous driving research center on Monday  as it tries to make itself an indispensable under-the-hood piece of the automotive industry's weaponry in the self-driving vehicle arms race.",
        "date": "12192016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "Switching gears  Canada's BlackBerry to open autonomous vehicle hub "
    },
    {
        "content": "* Says BlackBerry and Optiemus in India announce agreement to distribute BlackBerry mobile handsets  Source text: http://bit.ly/2fv8n4s Further company coverage:    (Bengaluru newsroom)",
        "date": "11072016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-Optiemus Infracom  BlackBerry to distribute BlackBerry handsets in India "
    },
    {
        "content": "* Blackberry signs agreement with Ford Motor Company for expanded use of Blackberry's QNX and security software",
        "date": "10312016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-Blackberry signs agreement with Ford for expanded use of its QNX and security software "
    },
    {
        "content": "TORONTO/BOSTON  Oct 31 BlackBerry Ltd   has signed a deal to work directly with Ford Motor Co to expand the carmaker's use of its QNX secure operating system  the Canadian technology company said on Monday  as Ford develops increasingly automated vehicles.",
        "date": "10312016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry in software deal with Ford  first with an automaker "
    },
    {
        "content": "TORONTO BlackBerry Ltd  launched its third Android-based phone on Tuesday  the last device whose success will be the company's financial responsibility  opting to price its top-end device well below Apple Inc's  iPhone 7.",
        "date": "10252016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry launches last phone it will carry on its books "
    },
    {
        "content": "TORONTO  Oct 25 BlackBerry Ltd   launched its third Android-based phone on Tuesday  the last device whose success will be the company's financial responsibility  opting to price its top-end device well below Apple Inc's iPhone 7.",
        "date": "10252016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 1-BlackBerry launches last phone it will carry on its books "
    },
    {
        "content": "* Blackberry announces DTEK60  latest android device with Blackberry's industry leading security software  Source text for Eikon:  Further company coverage:    (Bangalore.newsroom@thomsonreuters.com)",
        "date": "10252016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry announces DTEK60 "
    },
    {
        "content": "TORONTO  Oct 25 BlackBerry Ltd   launched its third Android-based phone on Tuesday  opting to price the device cheaper than competing products like Apple Inc's iPhone 7 and Android-maker Alphabet Inc's  Pixel.",
        "date": "10252016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry launches its third Android-based phone "
    },
    {
        "content": "TORONTO BlackBerry Ltd Chief Executive John Chen said on Monday he was two-thirds of the way toward achieving his goal of turning the Canadian technology company's fortunes around.",
        "date": "09262016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry CEO says turnaround two-thirds complete "
    },
    {
        "content": "TORONTO  Sept 26 BlackBerry Ltd   Chief Executive John Chen said on Monday he was two-thirds of the way toward achieving his goal of turning the Canadian technology company's fortunes around.",
        "date": "09262016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 1-BlackBerry CEO says turnaround two-thirds complete "
    },
    {
        "content": "WATERLOO  Ontario BlackBerry Ltd's decision to outsource the development of its smartphones helps it avoid the risks of a competitive market and focus on its more lucrative businesses of software and managing rival devices  its chief executive said on Wednesday. | Video ",
        "date": "09282016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry avoids smartphone risk with outsource move: CEO "
    },
    {
        "content": "* Blackberry Ltd and Zimperium Inc partnering to deliver customers with comprehensive mobile threat detection  risk analysis  prevention for ios android devices  Source text for Eikon:  Further company coverage:",
        "date": "09212016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-Blackberry and Zimperium partner to deliver customers with comprehensive mobile threat detection "
    },
    {
        "content": "WATERLOO  Ontario  Sept 28 BlackBerry Ltd's decision to outsource the development of its smartphones helps it avoid the risks of a competitive market and focus on its more lucrative businesses of software and managing rival devices  its chief executive said on Wednesday.",
        "date": "09282016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 5-BlackBerry avoids smartphone risk with outsource move -CEO "
    },
    {
        "content": "TORONTO  Sept 21 BlackBerry Ltd   has agreed to offer anti-hacking software from a startup that last year discovered a major Android bug  it said on Wednesday  as the once-dominant smartphone company seeks to leverage ties to corporate and government clients to boost its software revenue.",
        "date": "09212016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry to resell app from startup that found major Android bug "
    },
    {
        "content": "WATERLOO  Ontario The chief executive officer of BlackBerry Ltd  said fewer than 100 jobs will be cut with its latest move away from hardware  given reductions already made  and that he had not decided whether to launch a device the company has already produced.",
        "date": "09282016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry to cut fewer than 100 jobs with hardware move: CEO "
    },
    {
        "content": "WATERLOO  Ontario  Sept 28 The chief executive officer of BlackBerry Ltd  said fewer than 100 jobs will be cut with its latest move away from hardware  given reductions already made  and that he had not decided whether to launch a device the company has already produced.",
        "date": "09282016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry to cut fewer than 100 jobs with hardware move -CEO "
    },
    {
        "content": "TORONTO  Sept 28 Canada's main stock index rose on Wednesday  with energy and financial stocks leading broad based gains  while BlackBerry Ltd rallied after the company said it will outsource the development and design of its flagship smartphone.",
        "date": "09282016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX rises  led by energy and financials; BlackBerry rallies "
    },
    {
        "content": "*  CEO John Chen says company showed solid progress on overall operating profitability in Q2",
        "date": "09282016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry CEO says expects new hardware strategy to increase unit volumes  improve margins "
    },
    {
        "content": "* Blackberry announces first major device software licensing agreement with joint venture PT BB Merah Putih",
        "date": "09282016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry announces first major device software licensing agreement with joint venture PT BB Merah Putih "
    },
    {
        "content": "* Blackberry announces appointment of Steven Capelli as Chief Financial Officer",
        "date": "09282016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry announces appointment of Steven Capelli as CFO "
    },
    {
        "content": "TORONTO  Sept 28 BlackBerry Ltd   posted a 31.8 percent fall in second-quarter revenue and it said it would end all internal hardware development  including its well known smartphones.",
        "date": "09282016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry revenue slumps; company outsources hardware "
    },
    {
        "content": "* Qtrly non-GAAP software and services revenue of $156 million",
        "date": "09282016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry reports Q2 GAAP net loss $0.71 per basic share "
    },
    {
        "content": "* None of 6% debentures were converted into common shares of BlackBerry prior to redemption",
        "date": "09072016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-BlackBerry announces completion of debt restructuring "
    },
    {
        "content": "TORONTO BlackBerry Ltd said on Friday that its encryption technology is being used to toughen a \"spy-proof\" Samsung tablet that is being used by German government agencies dealing with classified information.",
        "date": "09022016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry teams with Samsung for 'spy-proof' tablet for Germany "
    },
    {
        "content": "TORONTO  Sept 2 BlackBerry Ltd said on Friday that its encryption technology is being used to toughen a \"spy-proof\" Samsung tablet that is being used by German government agencies dealing with classified information.",
        "date": "09022016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry teams with Samsung for \"spy-proof\" tablet for Germany "
    },
    {
        "content": "Troubled smartphone maker BlackBerry Ltd   said it would raise about $605 million by selling convertible debentures to shareholder Fairfax Financial Holdings Ltd  and other investors.",
        "date": "08262016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry to raise $605 million from shareholder Fairfax  others "
    },
    {
        "content": "Aug 26 Troubled smartphone maker BlackBerry Ltd   said it would raise about $605 million by selling convertible debentures to shareholder Fairfax Financial Holdings Ltd and other investors.",
        "date": "08262016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 1-BlackBerry to raise $605 mln from shareholder Fairfax  others "
    },
    {
        "content": "NEW YORK A U.S. appeals court on Wednesday upheld the dismissal of a lawsuit accusing BlackBerry Ltd of fraudulently inflating its stock price by painting an upbeat picture of the prospects for its BlackBerry Z10 smartphone line that was misleading.",
        "date": "08242016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "U.S. appeals court sends BlackBerry lawsuit back to lower court "
    },
    {
        "content": "Aug 26 BlackBerry Ltd  said on Friday it would raise about $605 million by selling convertible debentures to Fairfax Financial Holdings Ltd and other investors.",
        "date": "08262016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry to sell $605 mln of convertible debt to Fairfax  others "
    },
    {
        "content": "* Blackberry announces redemption of existing convertible debentures and issuance of new convertible debentures",
        "date": "08262016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry says Fairfax  other investors to subscribe for some of its debentures "
    },
    {
        "content": "NEW YORK  Aug 24 A U.S. appeals court on Wednesday upheld the dismissal of a lawsuit accusing BlackBerry Ltd of fraudulently inflating its stock price by painting an upbeat picture of the prospects for its BlackBerry Z10 smartphone line that was misleading.",
        "date": "08242016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 1-U.S. appeals court sends BlackBerry lawsuit back to lower court "
    },
    {
        "content": "Aug 24 A U.S. appeals court on Wednesday upheld the dismissal of a lawsuit accusing BlackBerry Ltd of fraudulently inflating its stock price by painting a misleadingly upbeat picture of the prospects for its BlackBerry 10 smartphone line.",
        "date": "08242016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry beats court appeal in U.S. shareholder lawsuit "
    },
    {
        "content": "* To purchase up to US$125 mln principal amount of its 6 percent unsecured convertible debentures",
        "date": "08042016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-Blackberry to purchase up to US$125 mln principal amount of its 6 pct unsecured convertible debentures "
    },
    {
        "content": "* Launches software licensing program for its mobility solutions business  Source text for Eikon:  Further company coverage:",
        "date": "08032016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-Blackberry launches software licensing program for its mobility solutions business "
    },
    {
        "content": "TORONTO BlackBerry Ltd unveiled a second Android-based handset on Tuesday  a device combining Alphabet Inc's popular software and broad app catalog with the Canadian company's security and productivity features at a lower price.",
        "date": "07262016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry unveils second  cheaper  Android device "
    },
    {
        "content": "* Blackberry wins U.S. patent infringement lawsuit brought by Mobile Telecommunications LLC  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07222016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-Blackberry wins U.S. patent infringement lawsuit "
    },
    {
        "content": "TORONTO  July 26 BlackBerry Ltd   unveiled a second Android-based handset on Tuesday  a device combining Alphabet Inc's popular software and broad app catalog with the Canadian company's security and productivity features at a lower price.",
        "date": "07262016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 2-BlackBerry unveils second  cheaper  Android device "
    },
    {
        "content": "NEW YORK/TORONTO BlackBerry Ltd  sought to bolster its security credentials with a string of small deals on Tuesday but analysts said the jury was still out on the success of its turnaround and push into software.",
        "date": "07192016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry inks security software deals  shares slip "
    },
    {
        "content": "NEW YORK/TORONTO  July 19 BlackBerry Ltd  sought to bolster its security credentials with a string of small deals on Tuesday but analysts said the jury was still out on the success of its turnaround and push into software.",
        "date": "07192016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 3-BlackBerry inks security software deals  shares slip "
    },
    {
        "content": "July 19 BlackBerry Ltd said it had signed a five-year  multi-million dollar deal to run emergency notifications for the U.S. Senate  among a handful of small deals the company has signed as the company shifts its focus to software from smartphones.",
        "date": "07192016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry signs U.S. government deals in software push "
    },
    {
        "content": "TORONTO BlackBerry Ltd  said on Tuesday it will stop making its Classic model  raising further doubts about the future of the smartphone pioneer's money-losing handset business as the company shifts its focus to software.",
        "date": "07052016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry ditches Classic  adding to smartphone future doubts "
    },
    {
        "content": "TORONTO  July 5 BlackBerry Ltd   said on Tuesday it will stop making its Classic model  raising further doubts about the future of the smartphone pioneer's money-losing handset business as the company shifts its focus to software.",
        "date": "07052016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 4-BlackBerry ditches Classic  adding to smartphone future doubts "
    },
    {
        "content": " ",
        "date": "07052016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 4-BlackBerry CEO confident on handset profit; results top expectations "
    },
    {
        "content": "WATERLOO  Ontario/TORONTO BlackBerry Ltd Chief Executive John Chen expressed confidence on Thursday that he can make the company's trimmed-down handset business profitable by a self-imposed September deadline  as the smartphone pioneer posted results that beat expectations.",
        "date": "06232016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry CEO confident on handset profit; results top expectations "
    },
    {
        "content": "TORONTO  June 23 BlackBerry Ltd posted a 35 percent fall in first-quarter revenue and a third straight quarterly loss on Thursday as it paid heavily to restructure its operations and write down the value of some assets.",
        "date": "06232016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry reports first-quarter slump in revenue  net loss "
    },
    {
        "content": "* Eight nominees were elected as directors to serve until next annual meeting of shareholders or until successors are elected or appointed  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06222016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-BlackBerry announces election results of Board of Directors "
    },
    {
        "content": "WATERLOO  Ontario BlackBerry Ltd's top priority this year is making its devices business profitable  its chief executive said on Wednesday  even as it weighs the future of its hardware operation.",
        "date": "06222016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry's top goal to make devices profitable this year: CEO "
    },
    {
        "content": "WATERLOO  Ontario  June 22 BlackBerry Ltd's  top priority this year is making its devices business profitable  its chief executive said on Wednesday  even as it weighs the future of its hardware operation.",
        "date": "06222016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 1-BlackBerry's top goal to make devices profitable this year -CEO "
    },
    {
        "content": "WATERLOO  Ontario  June 22 BlackBerry Ltd's  top priority for this year is making its devices business profitable  its chief executive said on Wednesday  even as it weighs the future of its hardware operation.",
        "date": "06222016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry's top goal to make devices profitable this year -CEO "
    },
    {
        "content": "WATERLOO  Ontario  June 22 BlackBerry Ltd's  top priority for this year is making its devices business profitable  its chief executive said on Wednesday  even as it weighs the future of its hardware operation.",
        "date": "06222016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry top priority this year is making devices profitable- CEO "
    },
    {
        "content": "* Announced strengthening of its enterprise partner program for solutions providers  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05092016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BRIEF-Blackberry Ltd strengthens enterprise partner program "
    },
    {
        "content": "WATERLOO  Ontario/TORONTO BlackBerry Ltd  plans to make a decision by September on the future of its beleaguered smartphone business  but its Chief Executive John Chen stressed on Friday he remains confident the company will have a profitable hardware segment by then.",
        "date": "04012016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry revenue miss puts hardware future in focus "
    },
    {
        "content": "WATERLOO  Ontario/TORONTO  April 1 BlackBerry Ltd plans to make a decision by September on the future of its beleaguered smartphone business  but its Chief Executive John Chen stressed on Friday he remains confident the company will have a profitable hardware segment by then.",
        "date": "04012016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 5-BlackBerry revenue miss puts hardware future in focus "
    },
    {
        "content": "TORONTO  April 1 Canada's main stock index fell on Friday  dragged down by a fall in BlackBerry Ltd  shares on disappointing earnings and a retreat in oil prices that weighed on energy companies.",
        "date": "04012016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX falls as lower oil prices  BlackBerry weigh "
    },
    {
        "content": "TORONTO  April 1 Canada's main stock index fell more than 1 percent on Friday  dragged down by a fall in BlackBerry Ltd shares on disappointing earnings and a retreat in oil prices that weighed on energy companies.",
        "date": "04012016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX falls as oil slump hurts energy stocks; BlackBerry tumbles "
    },
    {
        "content": "* Blackberry reports software and services growth of 106 percent for Q4 and 113 percent for fiscal 2016",
        "date": "04012016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry Q4 non-gaap loss per share $0.03 "
    },
    {
        "content": "BARCELONA/TORONTO  Feb 24 BlackBerry   said on Wednesday that it has acquired U.K.-based cyber security consultancy Encription  moving the company deeper into the services business as it continues to morph into a more software-focused entity amid its ongoing turnaround.",
        "date": "02242016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry buys cyber security consultancy; moves deeper into services "
    },
    {
        "content": "TORONTO  Feb 5 BlackBerry Ltd is cutting 200 jobs at its hometown headquarters in Ontario and in Florida in order to trim costs  it said on Friday  as the smartphone maker moves to turn around its fortunes and put more emphasis on its enterprise software business.",
        "date": "02062016",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry cuts 200 jobs in Ontario and Florida to trim costs "
    },
    {
        "content": "TORONTO BlackBerry Ltd has received approval from the Toronto Stock Exchange to more than double its existing share buyback program and repurchase up to 5.8 percent of its public float  the smartphone maker said on Friday.",
        "date": "01292016",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry wins approval to expand share buyback program "
    },
    {
        "content": "TORONTO BlackBerry's pivot to software began to show traction on Friday  after the company reported a smaller quarterly loss and its first quarter-to-quarter revenue increase in over two years  sending its stock soaring 13 percent.",
        "date": "12182015",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry results trounce expectations on software; shares rally "
    },
    {
        "content": "TORONTO  Dec 18 BlackBerry's pivot to software began to show traction on Friday  after the company reported a smaller quarterly loss and its first quarter-to-quarter revenue increase in over two years  sending its stock soaring 13 percent.",
        "date": "12182015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 4-BlackBerry results trounce expectations on software; shares rally "
    },
    {
        "content": "TORONTO  Dec 18 BlackBerry Ltd   reported a fiscal third-quarter loss as widely anticipated on Friday  but the company posted its first quarter-to-quarter revenue gain in over two years  indicating that turnaround efforts may be gaining traction.",
        "date": "12182015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry 3rd-quarter revenues top expectations "
    },
    {
        "content": "TORONTO  Dec 1 A Canadian start-up backed by one of BlackBerry's founders unveiled a technology on Tuesday for tracking wireless signals that it says can be used for detecting intruders  managing crowds or finding victims of natural disasters.",
        "date": "12012015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "Canadian start-up backed by BlackBerry founder unveils wireless tracking technology "
    },
    {
        "content": "TORONTO  Nov 6 BlackBerry Ltd   launched its first Android-based device on Friday  with the future of the company's hardware business riding on a slick smartphone called Priv that boasts an impressive array of features and a hefty price tag.",
        "date": "11062015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry Priv wins plaudits  but price tag questioned "
    },
    {
        "content": "Nov 2 AT&T Inc said on Monday it would offer BlackBerry Ltd's new Android-powered smartphone in its retail stores in the United States and online from Friday.",
        "date": "11022015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "AT&T to offer BlackBerry's new Android phone from Friday "
    },
    {
        "content": "TORONTO Smartphone maker BlackBerry Ltd reported weaker-than-expected quarterly results on Friday but forecast higher revenue and said it might replace its operating system with Google Inc's Android platform.",
        "date": "09252015",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry posts weaker-than-expected results  pledges revenue gain "
    },
    {
        "content": "WATERLOO  Ontario BlackBerry Ltd's decision to roll out a smartphone powered by Google's Android platform was hotly debated internally but the gamble is necessary to test whether the company's handset business is viable  Chief Executive John Chen said on Friday.",
        "date": "09252015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry devices future rides on fortunes of new Android phone: CEO "
    },
    {
        "content": "WATERLOO  Ontario  Sept 25 BlackBerry Ltd's  decision to roll out a smartphone powered by Google's  Android platform was hotly debated internally but the gamble is necessary to test whether the company's handset business is viable  Chief Executive John Chen said on Friday.",
        "date": "09252015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry devices future rides on fortunes of new Android phone-CEO "
    },
    {
        "content": "TORONTO  Sept 25 Canada's main stock index rose on Friday  recouping some of this week's losses  following comments from the Federal Reserve that soothed broader concerns about global growth and data that showed the U.S. economy  Canada's largest trading partner  expanded more than forecast.",
        "date": "09252015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX rebounds on Fed  global growth outlook; BlackBerry falls "
    },
    {
        "content": "TORONTO Tech giants such as Google Inc  and upstarts like Shopify Inc   are rapidly expanding their presence in and around BlackBerry's  hometown of Waterloo  Ontario  even as the smartphone maker further pares back some of its teams.",
        "date": "09212015",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "Exclusive: Shopify  Google boosting presence in BlackBerry's hometown "
    },
    {
        "content": "TORONTO  Sept 25 Smartphone maker BlackBerry Ltd   reported weaker-than-expected quarterly results on Friday but forecast higher revenue and said it might replace its operating system with Google Inc's Android platform.",
        "date": "09252015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 3-BlackBerry posts weaker-than-expected results  pledges revenue gain "
    },
    {
        "content": "TORONTO  Sept 25 BlackBerry Ltd   reported a second-quarter adjusted loss on Friday as the company's turnaround continued and it attempted to boost revenue from its software division.",
        "date": "09252015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry posts quarterly loss as turnaround continues "
    },
    {
        "content": "WATERLOO  Ontario  Sept 17 BlackBerry Ltd  sees its massive patent portfolio as one of the key elements in its turnaround strategy as it pivots to focus more on its software and enterprise business  Chief Executive John Chen said on Thursday.",
        "date": "09172015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry CEO sees company patents as key to turnaround strategy "
    },
    {
        "content": "TORONTO Canada's BlackBerry Ltd  said on Friday it will buy rival mobile software provider Good Technology Corp  for $425 million  to boost its ability to help corporate clients manage smartphones running on different operating systems.",
        "date": "09042015",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry to buy rival Good Technology for $425 million "
    },
    {
        "content": "TORONTO  Sept 4 Canada's BlackBerry Ltd  said on Friday it will buy rival mobile software provider Good Technology Corp for $425 million  to boost its ability to help corporate clients manage smartphones running on different operating systems.",
        "date": "09042015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 2-BlackBerry to buy rival Good Technology for $425 mln "
    },
    {
        "content": "(Corrects company name in headline and first  fourth bullet)  Sept 4 BlackBerry :  * To acquire Good Technology  * Deal for $425 million  * Says company anticipates the acquisition to be accretive to earnings and cash flow within the first year after closing  * BlackBerry also expects to realize approximately $160 million in GAAP revenue from Good Technology in the first year   * Source text for Eikon   * Further company coverage",
        "date": "09042015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "REFILE-BRIEF-BlackBerry to acquire Good Technology "
    },
    {
        "content": "Sept 4 Canadian smartphone maker BlackBerry Ltd  said it would acquire software security provider Good Technology for $425 million in cash.",
        "date": "09042015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry to acquire Good Technology for $425 mln "
    },
    {
        "content": "NEW YORK  July 23 BlackBerry Ltd on Thursday showcased a suite of security products that safeguard everything from medical devices to Hollywood movie scripts  though its CEO acknowledged that his effort to transform the company remains a work in progress.",
        "date": "07232015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry lays out security strategy as turnaround takes shape "
    },
    {
        "content": "TORONTO  July 22 BlackBerry Ltd said on Wednesday it is buying privately-held AtHoc  a provider of secure  networked crisis communications  as it moves to broaden its software offering and generate revenue from its BBM messaging service.",
        "date": "07222015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry to buy messaging alerts firm AtHoc to expand software base "
    },
    {
        "content": "TORONTO  July 10 BlackBerry Ltd  which has been coy about its ambitions to make a mainstream Android smartphone  fueled more speculation about its plans this week when it scooped up two Android-related domain names.",
        "date": "07102015",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry snags two new domain names as Android chatter heats up "
    },
    {
        "content": "TORONTO BlackBerry Ltd named Carl Wiese as head of global sales on Monday  an appointment that comes at a critical juncture for the smartphone industry pioneer  which needs to spur top-line growth in order for its turnaround efforts to succeed.",
        "date": "07132015",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry names Cisco veteran as new global head of sales "
    },
    {
        "content": "TORONTO  July 13 BlackBerry Ltd named Carl Wiese as head of global sales on Monday  an appointment that comes at a critical juncture for the smartphone industry pioneer  which needs to spur top-line growth in order for its turnaround efforts to succeed.",
        "date": "07132015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 2-BlackBerry names Cisco veteran as new global head of sales "
    },
    {
        "content": "TORONTO  July 13 BlackBerry Ltd   named Carl Wiese as global head of sales on Monday  an appointment that comes at a critical juncture for the company  which needs to spur top-line growth in order for its turnaround efforts to succeed.",
        "date": "07132015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry names Cisco veteran as global head of sales "
    },
    {
        "content": "WATERLOO  Ontario BlackBerry  shares fell on Tuesday as doubts surfaced about the sustainability of the sharp growth the former smartphone pioneer reported in crucial software revenues  an area BlackBerry's CEO said he will augment via acquisitions.",
        "date": "06232015",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry shares fall as doubts on software revenue emerge "
    },
    {
        "content": "WATERLOO  Ontario  June 23 BlackBerry  shares fell on Tuesday as doubts surfaced about the sustainability of the sharp growth the former smartphone pioneer reported in crucial software revenues  an area BlackBerry's CEO said he will augment via acquisitions.",
        "date": "06232015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 4-BlackBerry shares fall as doubts on software revenue emerge "
    },
    {
        "content": "WASHINGTON - President Barack Obama's quest for a Pacific Rim trade deal to strengthen U.S. ties with Asia advances  with the Senate moving toward a final vote on granting Obama the power to speed trade agreements through Congress. (USA-TRADE/ (UPDATE 2)  moved  by Krista Hughes and Richard Cowan  500 words)",
        "date": "06232015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "REUTERS BUSINESS NEWS SCHEDULE AT 1830 GMT/2:30 PM ET "
    },
    {
        "content": "* Shares reverse course after earnings call  down 2.7 percent at $8.95 in pre-market Nasdaq trade  Further company coverage:    (Reporting by Alastair Sharp)",
        "date": "06232015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-BlackBerry shares turn negative after earnings call  down 2.7 pct "
    },
    {
        "content": "TORONTO  June 12 BlackBerry Ltd's move to embrace Android may be aimed at lifting revenue from its software and device management segment  but analysts say it may inadvertently give its device arm a fillip and a new lease on life.",
        "date": "06152015",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "RPT-BlackBerry move to embrace Android may bring unexpected reward "
    },
    {
        "content": "TORONTO  June 12 BlackBerry Ltd's move to embrace Android may be aimed at lifting revenue from its software and device management segment  but analysts say it may inadvertently give its device arm a fillip and a new lease on life.",
        "date": "06132015",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "REFILE-BlackBerry move to embrace Android may bring unexpected reward "
    },
    {
        "content": "TORONTO BlackBerry  is considering equipping an upcoming smartphone with Google Inc.'s  Android software for the first time  an acknowledgement that its revamped line of devices has failed to win mass appeal  according to four sources familiar with the matter.",
        "date": "06112015",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "Exclusive: BlackBerry may put Android system on new device: sources "
    },
    {
        "content": "TORONTO  June 12 BlackBerry Ltd's move to embrace Android may be aimed at lifting revenue from its software and device management segment  but analysts say it may inadvertently give its device arm a fillip and a new lease on life.",
        "date": "06122015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry move to embrace Android may bring unexpected reward "
    },
    {
        "content": "TORONTO BlackBerry  is considering equipping an upcoming smartphone with Google Inc.'s  Android software for the first time  an acknowledgement that its revamped line of devices has failed to win mass appeal  according to four sources familiar with the matter. | Video ",
        "date": "06122015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "Exclusive: BlackBerry may put Android system on new device: sources "
    },
    {
        "content": "TORONTO  June 1 BlackBerry Ltd and television host Ryan Seacrest's keyboard company Typo Products have agreed to settle a patent dispute over the sale of smartphone keyboards of a certain size  the Canadian smartphone maker said on Monday.",
        "date": "06012015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry settles patent dispute with Seacrest's company Typo "
    },
    {
        "content": "May 22 Canadian smartphone maker BlackBerry Ltd   is cutting jobs across the world  the company said on Friday  as it consolidates its software  hardware and applications business.",
        "date": "05232015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry cuts jobs worldwide as it consolidates businesses "
    },
    {
        "content": "Canadian smartphone maker BlackBerry Ltd   said it plans to buy back 12 million shares  sending its stock up nearly 2 percent in extended trading in the United States.",
        "date": "05212015",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry to buy up to 12 million shares for cancellation "
    },
    {
        "content": "May 21 Canadian smartphone maker BlackBerry Ltd   said it plans to buy back 12 million shares  sending its stock up nearly 2 percent in extended trading in the United States.",
        "date": "05212015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry to buy up to 12 mln shares for cancellation "
    },
    {
        "content": "BlackBerry Ltd is considering closing its offices in Sweden  a move that would result in the loss of up to 100 jobs  a company spokesperson told Reuters.",
        "date": "04242015",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry considers closing Sweden operations "
    },
    {
        "content": "April 24 BlackBerry Ltd  is considering closing its offices in Sweden  a move that would result in the loss of up to 100 jobs  a company spokesperson told Reuters.",
        "date": "04242015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 1-BlackBerry considers closing Sweden operations "
    },
    {
        "content": "April 24 BlackBerry Ltd  is considering closing its offices in Sweden  a move that would result in the loss of up to 100 jobs  the Wall Street Journal reported  quoting a company spokeswoman.",
        "date": "04242015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry considers closing Sweden operations - WSJ "
    },
    {
        "content": "TORONTO  April 21 BlackBerry Ltd   said on Tuesday it is launching a new certificate service that will help bring the security level it offers on smartphones to a slew of devices from cars to smart meters.",
        "date": "04212015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry introduces security offering for IoT devices "
    },
    {
        "content": "April 21 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "04212015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "TORONTO  April 21 BlackBerry Ltd   said on Tuesday it is acquiring privately-held U.S. tech company WatchDox  which makes software that secures files for clients ranging from private equity firms to Hollywood studios  in a bid to boost its security offerings.",
        "date": "04212015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 1-BlackBerry to buy WatchDox to bolster data security "
    },
    {
        "content": "TORONTO  April 21 BlackBerry Ltd   said on Tuesday it is acquiring privately-held U.S. tech company WatchDox  which makes software that secures files  in a bid to further bolster its security credentials.",
        "date": "04212015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry to buy WatchDox to bolster data security "
    },
    {
        "content": "TORONTO BlackBerry Ltd  posted a surprise quarterly profit on Friday and said it is pushing to end a slide in its revenue in this fiscal year  sending the stock up as much as 5.1 percent.",
        "date": "03272015",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry posts fourth-quarter profit; seeks to end revenue slide "
    },
    {
        "content": "WATERLOO  Ontario  March 27 BlackBerry Ltd  is likely to see a part of its targeted software revenue growth in the coming fiscal year come from the acquisition of companies that will allow it to sell more value-added services  Chief Executive John Chen said on Friday.",
        "date": "03272015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry sees part of software growth coming from acquisitions "
    },
    {
        "content": "TORONTO  March 27 BlackBerry Ltd   posted a surprise quarterly profit on Friday and said it is pushing to end a slide in its revenue in this fiscal year  sending the stock up as much as 5.1 percent.",
        "date": "03272015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 3-BlackBerry posts 4th-qtr profit; seeks to end revenue slide "
    },
    {
        "content": "TORONTO  March 27 BlackBerry Ltd   posted a fiscal fourth-quarter profit on Friday  offering some signs its turnaround efforts may be beginning to gain traction.",
        "date": "03272015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry reports fiscal fourth-quarter profit "
    },
    {
        "content": "March 14 Seeking to extend its range of secure mobile devices  BlackBerry Ltd said on Saturday it was launching a high-security tablet  developed with International Business Machines Corp and Samsung Electronics Co Ltd .",
        "date": "03142015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "Blackberry launches new secure tablet "
    },
    {
        "content": "March 13 BlackBerry Ltd  on Friday won the dismissal of a U.S. lawsuit accusing it of fraudulently inflating its stock price by painting a misleadingly upbeat picture of the prospects for its BlackBerry 10 smartphone line.",
        "date": "03132015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry wins dismissal of U.S. lawsuit over BlackBerry 10 "
    },
    {
        "content": "TORONTO  March 9 Canada's main stock index hit its lowest level in five weeks on Monday  as energy shares fell with weaker Brent oil prices and smartphone maker BlackBerry Ltd dropped after a downgrade by Goldman Sachs.",
        "date": "03092015",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX closes at five-week low as energy  BlackBerry slump "
    },
    {
        "content": "TORONTO  March 9 Canada's main stock index hit its lowest level in five weeks on Monday  as energy shares fell with weaker Brent oil prices and smartphone maker BlackBerry Ltd dropped after a downgrade by Goldman Sachs.",
        "date": "03092015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX hits five-week low  led by energy  BlackBerry "
    },
    {
        "content": "March 13 BlackBerry Ltd  on Friday won the dismissal of a U.S. lawsuit accusing it of fraudulently inflating its stock price by painting a misleadingly upbeat picture of the prospects for its BlackBerry 10 smartphone line.",
        "date": "03132015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 1-BlackBerry wins dismissal of U.S. lawsuit over BlackBerry 10 "
    },
    {
        "content": "TORONTO  March 9 Canada's main stock index declined in choppy trading on Monday as energy shares fell on lower oil prices and smartphone maker BlackBerry Ltd  dropped after a downgrade by Goldman Sachs.",
        "date": "03092015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "CANADA STOCKS-TSX declines as energy  BlackBerry shares drop "
    },
    {
        "content": "** Smartphone maker's U.S.-listed shares down 4.2 pct at $10.22 premarket after the first downgrade in four months",
        "date": "03092015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BUZZ-BlackBerry Ltd: Goldman Sachs says \"sell\"  forecasts wider losses "
    },
    {
        "content": "TORONTO  March 1 BlackBerry   announced on Sunday that it plans to expand its cross-platform strategy and deliver its often admired security  productivity and communication tools to any smartphone or tablet device running iOS  Android or Windows.",
        "date": "03012015",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry to broaden its cross-platform strategy "
    },
    {
        "content": "BARCELONA/TORONTO  March 3 BlackBerry unveiled a new mid-market smartphone on Tuesday dubbed the BlackBerry Leap that is set to replace the Z3 device launched a year ago  in a move to woo buyers in certain emerging markets where BlackBerry still has a fairly large client base.",
        "date": "03032015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry unveils new mid-market Leap smartphone "
    },
    {
        "content": "March 13 BlackBerry Ltd :  * Wins dismissal of U.S. shareholder lawsuit over BlackBerry 10 -- court ruling  * U.S. district judge thomas griesa says plaintiffs failed to properly alleged",
        "date": "03132015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-BlackBerry wins dismissal of U.S. shareholder lawsuit over BlackBerry 10 "
    },
    {
        "content": "* CEO says will be able to stabilise revenue and turn to revenue growth  Further company coverage:    (Reporting by Harro Ten Wolde)",
        "date": "03032015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BRIEF-Blackberry CEO says to stabilise revenue "
    },
    {
        "content": "TORONTO  Feb 25 BlackBerry Ltd said on Wednesday that it is working with Google Inc to enable its software to manage and secure some of Google's Android devices  a move that builds on BlackBerry's recent partnership with Samsung Electronics Co.",
        "date": "02252015",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "BlackBerry working with Google to secure Android devices "
    },
    {
        "content": "TORONTO  Feb 10 BlackBerry Ltd named David Kleidermacher as its chief security officer on Tuesday  moving to further bolster the smartphone maker's credentials with security-conscious clients  including big players in the defense  automotive and healthcare sectors.",
        "date": "02102015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry names new chief security officer "
    },
    {
        "content": "TORONTO  Feb 4 A U.S. district court on Wednesday sanctioned television host Ryan Seacrest's Typo Products LLC for violating an injunction barring it from selling a $99 iPhone case found to have likely infringed on BlackBerry Ltd patents.",
        "date": "02042015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "Seacrest's Typo products fined over BlackBerry injunction "
    },
    {
        "content": "NEW YORK/SEOUL Samsung Electronics recently offered to buy BlackBerry Ltd   for as much as $7.5 billion  seeking its valuable patents as it battles Apple  in the corporate market  according to a person familiar with the matter and documents seen by Reuters.",
        "date": "01152015",
        "name": "BlackBerry Limited",
        "news_type": "topStory",
        "symbol": "BB",
        "title": "Exclusive: Samsung talks to BlackBerry about $7.5 billion buyout - source "
    },
    {
        "content": "SEOUL  Jan 15 With a bid for Blackberry Ltd   South Korean tech giant Samsung Electronics  may be signalling that it has run out of internal options to reverse its sliding profits and protect its shrinking lead in the global smartphone market.",
        "date": "01152015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "Dwindling growth options push Samsung Elec to M&A "
    },
    {
        "content": "SEOUL With a bid for Blackberry Ltd  South Korean tech giant Samsung Electronics may be signaling that it has run out of internal options to reverse its sliding profits and protect its shrinking lead in the global smartphone market.",
        "date": "01152015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "Dwindling growth options push Samsung Electronics to M&A "
    },
    {
        "content": "OTTAWA  Jan 14 A possible bid for BlackBerry Ltd   by South Korea's Samsung Electronics Co Ltd  would be unlikely to raise Canadian government security concerns  sources familiar with Ottawa's thinking said on Wednesday.",
        "date": "01142015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "South Korean firms not seen raising Canadian security concerns "
    },
    {
        "content": "SEOUL South Korea's Samsung Electronics Co Ltd said on Thursday that it had no plan to buy Canada's Blackberry Ltd  denying a Reuters report on a takeover approach.",
        "date": "01152015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "Samsung Electronics says has no plan to acquire Blackberry "
    },
    {
        "content": "NEW YORK Samsung Electronics recently offered to buy BlackBerry Ltd  for as much as $7.5 billion  seeking its valuable patents as it battles Apple in the corporate market  according to a person familiar with the matter and documents seen by Reuters.",
        "date": "01152015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "Samsung talks to BlackBerry about $7.5 bln buyout -source "
    },
    {
        "content": "OTTAWA A possible bid for BlackBerry Ltd by South Korea's Samsung Electronics Co Ltd would be unlikely to raise Canadian government security concerns  sources familiar with Ottawa's thinking said on Wednesday.",
        "date": "01152015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "South Korean BlackBerry bid not seen raising Canadian concerns "
    },
    {
        "content": "OTTAWA  Jan 14 A possible bid for BlackBerry Ltd   by South Korea's Samsung Electronics Co Ltd  would be unlikely to raise Canadian government security concerns  sources familiar with Ottawa's thinking said on Wednesday.",
        "date": "01152015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "UPDATE 1-S.Korean BlackBerry bid not seen raising Canadian concerns "
    },
    {
        "content": "NEW YORK  Jan 14 Options activity in BlackBerry Ltd jumped after a Reuters report that Samsung Electronics Co Ltd had approached the Canadian company about a possible takeover deal.",
        "date": "01142015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "BlackBerry options activity surges on Samsung approach report "
    },
    {
        "content": "SEOUL  Jan 15 South Korea's Samsung Electronics Co Ltd has denied that it made an offer to acquire Canada's BlackBerry Ltd and has no plans to do so  South Korea's Yonhap News Agency reported on Thursday.",
        "date": "01152015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "Samsung Elec says not seeking to acquire Blackberry - Yonhap "
    },
    {
        "content": "OTTAWA  Jan 14 A spokesman for Canadian Prime Minister Stephen Harper on Wednesday declined to comment on a Reuters report that said Samsung Electronics Co Ltd  had approached BlackBerry about a buyout.",
        "date": "01142015",
        "name": "BlackBerry Limited",
        "news_type": "normal",
        "symbol": "BB",
        "title": "Canada PM's office won't comment on reported Samsung bid for BlackBerry "
    }
]