[
    {
        "content": "NEW YORK  Nov 16 Buyout firms' interest in Brazilian targets is growing stronger as interest rates head to all-time lows  a senior executive at the nation's No. 3 listed bank Banco Bradesco SA said on Thursday.",
        "date": "11162017",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Bradesco expects more demand from buyout firms in Brazilian M&As "
    },
    {
        "content": "NEW YORK  Nov 14 Banco Bradesco SA expects Brazilian companies to raise up to 15 billion reais ($4.5 billion) in new share offerings by year-end as Latin America's largest economy continues to recover.",
        "date": "11142017",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "UPDATE 1-Bradesco expects companies to raise up to $4.5 bln by year-end "
    },
    {
        "content": "SAO PAULO  Nov 1 Banco Bradesco SA  Brazil's No. 3 listed bank  expects to increase lending in 2018 as the nation's financial sector emerges from the deepest recession in a century.",
        "date": "11012017",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "UPDATE 2-Brazil's Bradesco expects 2018 loan book growth  cuts provisions "
    },
    {
        "content": "SAO PAULO  Nov 1 Banco Bradesco SA  Brazil's No. 3 listed bank  on Wednesday beat net income forecasts as lower loan-loss provisions offset a contraction in its loan book.",
        "date": "11012017",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Banco Bradesco beats Q3 profit estimates as provisions fall "
    },
    {
        "content": "SAO PAULO  Oct 30 Brazil's Banco Bradesco SA will unveil an all-digital bank this week called Next  marking the biggest effort by a major bank in Latin America's top economy to take on the country's burgeoning financial technology startups.",
        "date": "10302017",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "UPDATE 1-Bradesco launches digital bank  facing down Brazil fintechs "
    },
    {
        "content": "SAO PAULO  Oct 30 Brazil's Banco Bradesco SA will present an all-digital franchise this week called Next  marking the biggest campaign of a major bank in Latin America's top economy to go head-to-head with financial technology startups  or fintechs.",
        "date": "10302017",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Bradesco launches digital bank  facing down Brazil fintechs "
    },
    {
        "content": "SAO PAULO  Oct 11 Brazil's Banco Bradesco SA Chief Executive Luiz Carlos Trabuco said on Wednesday the lender will choose his successor from a group of internal candidates in the coming months  the day after the bank's longtime chairman resigned.",
        "date": "10112017",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "UPDATE 2-Banco Bradesco CEO says looking for replacement internally "
    },
    {
        "content": "SAO PAULO  Oct 10 The chairman of Banco Bradesco SA  91-year-old Lázaro de Mello Brandão  is stepping down after running its board for nearly three decades  accelerating the succession process for Brazil's second-largest private lender.",
        "date": "10102017",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "UPDATE 1-Banco Bradesco chairman steps down  CEO takes role "
    },
    {
        "content": "SAO PAULO  Oct 10 The chairman of Brazilian lender Banco Bradesco SA  Lázaro de Mello Brandão  is stepping down from his role on the board  to be replaced by Chief Executive Luiz Carlos Trabuco  the company said in a Tuesday securities filing.",
        "date": "10102017",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Banco Bradesco chairman steps down  CEO takes role "
    },
    {
        "content": "(The following statement was released by the rating agency) SAO PAULO/RIO DE JANEIRO  August 29 (Fitch) Fitch Ratings has today affirmed the ratings for Banco Bradesco S.A. (Bradesco)  including the Long-Term Foreign and Local Currency IDRs at 'BB+'/Outlook Negative. A full list of rating actions follows at the end of this release. KEY RATING DRIVERS IDRS  NATIONAL RATINGS AND SENIOR DEBT Bradesco's LT Foreign- and Local-Currency IDRs are driven by the bank's 'bb+' Viability Rating (VR) and refl",
        "date": "08292017",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Fitch Affirms Banco Bradesco S.A.'s IDRs; Outlook Negative "
    },
    {
        "content": "SAO PAULO Banco Bradesco SA's acquisition of HSBC Bank Brasil Banco Múltiplo SA will have generated as much as 3.5 billion reais ($1.11 billion) in cost savings and synergies by the end of next year  Chief Financial Officer Alexandre Glüher said on Thursday.",
        "date": "08242017",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Bradesco's HSBC Brasil deal to generate $1.1 billion pre-tax savings "
    },
    {
        "content": "SAO PAULO  Aug 24 Banco Bradesco SA's acquisition of HSBC Bank Brasil Banco Múltiplo SA will have generated as much as 3.5 billion reais ($1.11 billion) in cost savings and synergies by the end of next year  Chief Financial Officer Alexandre Glüher said on Thursday.",
        "date": "08242017",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Bradesco's HSBC Brasil deal to generate $1.1 bln pre-tax savings "
    },
    {
        "content": "SAO PAULO  Aug 2 Some Banco Bradesco SA customers struggled to access online and branch services on Wednesday  after Brazil's third largest listed lender was hit by an intermittent glitch that slowed transaction systems.",
        "date": "08022017",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco web  branch services hit by intermittent glitch "
    },
    {
        "content": "SAO PAULO  July 27 Banco Bradesco SA  Brazil's No. 3 listed bank  expects to continue cutting loan-loss provisions as credit quality improves in coming quarters  though a slow economic recovery should keep a lid on lending.",
        "date": "07272017",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "UPDATE 3-Brazil's Banco Bradesco sees lower provisions  slow lending recovery "
    },
    {
        "content": "SAO PAULO  July 27 Banco Bradesco SA  Brazil's No. 3 listed bank  beat second-quarter profit estimates on Thursday as a strong performance from its insurance division and higher fee income offset an increase in loan-loss provisions.",
        "date": "07272017",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco beats profit estimates despite higher provisions "
    },
    {
        "content": "SAO PAULO Banco Bradesco SA  Brazil's No. 3 listed bank   plans to repurchase a total 15 million common and preferred shares in the year through June 26  2018  according to a Monday securities filing.",
        "date": "06262017",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco plans to buy back 15 milion shares for a year "
    },
    {
        "content": "SAO PAULO  June 26 Banco Bradesco SA  Brazil's No. 3 listed bank   plans to repurchase a total 15 million common and preferred shares in the year through June 26  2018  according to a Monday securities filing.",
        "date": "06262017",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco plans to buy back 15 mln shares for a year "
    },
    {
        "content": "SAO PAULO A Brazilian court has cleared Banco Bradesco SA Chief Executive Officer Luiz Carlos Trabuco of trying to illegally dodge a tax fine of 3 billion reais ($911 million)  spurring the biggest jump in shares of the nation's No. 3 bank in a month.",
        "date": "06142017",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Brazil court clears Bradesco CEO in tax probe  shares jump "
    },
    {
        "content": "SAO PAULO  June 14 A Brazilian court has cleared Banco Bradesco SA Chief Executive Officer Luiz Carlos Trabuco of trying to illegally dodge a tax fine of 3 billion reais ($911 million)  spurring the biggest jump in shares of the nation's No. 3 bank in a month.",
        "date": "06142017",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "UPDATE 2-Brazil court clears Bradesco CEO in tax probe  shares jump "
    },
    {
        "content": "SAO PAULO (This version of the May 23rd story corrects headline and paragraph 1 to say \"asked\" instead of \"hired.\" Corrects paragraphs 7 and 8 to show that Bradesco was told to seek buyers for Vigor and advise on plans to merge Alpargatas SA's different classes of stock  not to sell the company.)",
        "date": "05242017",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Exclusive: Brazil's JBS and controlling family asked Bradesco to find buyers for assets - sources "
    },
    {
        "content": "SAO PAULO  April 28 General and administrative expenses at Banco Bradesco SA will probably grow at the lowest end of a project range this year  as Brazil's No. 3 listed bank captures more cost savings stemming from the acquisition of HSBC Holding Plc's local unit  executives said on Friday.",
        "date": "04282017",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Bradesco sees expense growth at bottom of guidance this year "
    },
    {
        "content": "SAO PAULO  April 27 The pace and extent of Brazil's economic recovery will dictate future trends for defaults and loan-loss provisions at Banco Bradesco SA  which saw corporate defaults climbing during the first quarter  Chief Financial Officer Alexandre Glüher said on Thursday.",
        "date": "04272017",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "UPDATE 2-Bradesco sees Brazil recovery dictating default trends "
    },
    {
        "content": "SAO PAULO  April 27 Banco Bradesco SA beat first-quarter profit estimates on Thursday as Brazil's No. 3 listed bank cut loan-loss provisions by more than expected  offsetting large impairments and lackluster fee and interest income performance.",
        "date": "04272017",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco beats profit estimates as provisions fall "
    },
    {
        "content": "SAO PAULO  March 9 Brazil's Banco Bradesco SA is cutting rates charged on rollover credit card loans by more than a third to comply with new rules to reduce the cost of borrowing for cash-strapped consumers and companies in Latin America's largest economy.",
        "date": "03092017",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco cuts rollover card rates to comply with new rules "
    },
    {
        "content": "SAO PAULO  Feb 6 The board of Banco Bradesco SA    Brazil's third-largest listed bank  will propose to shareholders a capital increase of 8 billion reais ($2.6 billion)  granting new shares to current shareholders  the company said on Monday.",
        "date": "02062017",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco says board proposes $2.6 bln capital increase "
    },
    {
        "content": "SAO PAULO Brazilian healthcare services provider NotreDame Intermédica Sistema de Saude SA has hired banks to manage its initial public offering  which could be launched with a series of investor meetings as early as this week  two people with direct knowledge of the plans said on Monday.",
        "date": "02062017",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazilian healthcare insurer Intermédica hires banks for IPO : sources "
    },
    {
        "content": "* Recurring profit of 4.4 bln reais misses estimates   (Adds comments  updates share performance)",
        "date": "02022017",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "UPDATE 4-Bradesco sets cautious goals as profit miss highlights Brazil risks "
    },
    {
        "content": "* Banco Bradesco SA   Brazil's No. 2 private-sector bank by assets  announced on Thursday the following operating estimates for this year:",
        "date": "02022017",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco sees loan book growth  lower provisions this year "
    },
    {
        "content": "SAO PAULO  Nov 24 Banco Bradesco SA will spend three years enhancing existing banking technology platforms to lure younger clients and stem potential competition from financial technology startups that are becoming more appealing  Chief Executive Officer Luiz Carlos Trabuco said on Thursday.",
        "date": "11242016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "UPDATE 2-Brazil's Bradesco to focus on mobility as fintech appeal grows "
    },
    {
        "content": "SAO PAULO  Nov 24 Banco Bradesco SA plans to enhance existing mobile phone banking platforms to lure younger clients and stem potential competition from financial technology start-ups that are turning more appealing to customers  a senior executive said on Thursday.",
        "date": "11242016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco to boost mobile platform as fintech tools thrive "
    },
    {
        "content": "SAO PAULO Shares in Brazil appliance retailer Via Varejo SA soared on Thursday by the most since March on reports that three suitors have expressed interest in a controlling stake in the company.",
        "date": "11242016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Via Varejo soars on reports of Falabella  Steinhoff interests "
    },
    {
        "content": "SAO PAULO  Nov 10 Early indicators are pointing to a recovery in Brazil's economic activity  which could help feed into demand for credit or prevent loan defaults from hitting records in coming months  executives at Banco Bradesco SA said on Thursday.",
        "date": "11102016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "UPDATE 2-Bradesco sees Brazil recovery round the corner "
    },
    {
        "content": "SAO PAULO  Nov 10 Banco Bradesco SA beat third-quarter profit estimates on Thursday as the integration of HSBC Holdings Plc's local unit helped Brazil's No. 3 listed bank grow revenue faster than loan-loss provisions and other expenses.",
        "date": "11102016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco beats profit estimates  adjusts annual targets "
    },
    {
        "content": "* Said on Tuesday it will pay own capital interest for November 2016 at a gross value of 0.0172 Brazilian real ($0.0054) per ordinary share and 0.019 real per preferred share  corresponding to a net value of 0.0147 real per ordinary share and 0.0161 real per preferred share",
        "date": "10192016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "BRIEF-Banco Bradesco announces own capital interest payment for Nov. 2016 "
    },
    {
        "content": "ZURICH  Oct 13 Swiss Re and Brazil's Bradesco Group have launched a joint venture to create a commercial large-risk insurer in Brazil  the Swiss reinsurer said on Thursday.",
        "date": "10132016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Swiss Re  Bradesco launch commercial insurance venture in Brazil "
    },
    {
        "content": "* Said on Friday it will pay own capital interest for October 2016 at a gross value of 0.0172 real ($0.0053) per ordinary share and 0.019 real per preferred share  corresponding to a net value of 0.0147 real per ordinary share and 0.0161 real per preferred share",
        "date": "09192016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "BRIEF-Banco Bradesco announces own capital interest payment for Oct. 2016 "
    },
    {
        "content": "SAO PAULO  Sept 5 Shareholders of Brazil's Banco Bradesco SA will vote on Oct. 7 on a proposal to change the age limit for its chief executive to 67 years from the current 65 years  the bank said in a securities filing on Monday.",
        "date": "09052016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Brazil's Banco Bradesco raising age limit to keep CEO Trabuco -source "
    },
    {
        "content": "BRASILIA  Aug 1 Bradesco SA  Brazil's No. 2 private-sector bank  on Monday denied reports it was planning to pick a new chief executive officer in the wake of a corruption scandal.",
        "date": "08012016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco denies it plans to name new CEO "
    },
    {
        "content": "SAO PAULO Shares in Banco Bradesco SA sank on Thursday as a grimmer outlook for loan-loss provisions this year reignited concerns that a harsh recession and a deluge of refinancing requests may hamper profits at Brazil's No. 3 listed lender.",
        "date": "07282016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Bradesco shares sink as outlook for loan-loss provisions worsens "
    },
    {
        "content": "BRASILIA The chief executive of Bradesco SA  Brazil's No. 2 private-sector bank  will stand trial for trying to influence a tax appeal board  a court representative said on Thursday.",
        "date": "07282016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Bradesco CEO to stand trial over tax plot in Brazil "
    },
    {
        "content": "BRASILIA  July 28 The chief executive of Bradesco SA  Brazil's No. 2 private-sector bank  will stand trial for trying to influence a tax appeal board  a court representative said on Thursday.",
        "date": "07282016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "UPDATE 2-Bradesco CEO to stand trial over tax plot in Brazil "
    },
    {
        "content": "SAO PAULO  July 28 Shares in Banco Bradesco SA sank on Thursday as a grimmer outlook for loan-loss provisions this year reignited concerns that a harsh recession and a deluge of refinancing requests may hamper profits at Brazil's No. 3 listed lender.",
        "date": "07282016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "UPDATE 4-Bradesco shares sink as outlook for loan-loss provisions worsens "
    },
    {
        "content": "BRASILIA  July 28 A federal judge in Brazil has accepted criminal charges against Luiz Carlos Trabuco  the chief executive of Bradesco SA  Brazil's No. 2 private-sector bank  a court representative in Brasilia said on Thursday.",
        "date": "07282016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil judge accepts charges against Bradesco CEO "
    },
    {
        "content": "SAO PAULO  July 28 Banco Bradesco SA missed second-quarter profit estimates and raised the forecast for loan-loss provision expenses this year  as Brazil's third-biggest listed lender faces a deluge of requests from debt-laden corporate customers to stretch out loan terms.",
        "date": "07282016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco misses profit estimate  ups provision forecast "
    },
    {
        "content": "BRASILIA  June 24 Brazilian lender Banco Bradesco SA said in a securities filing on Friday that its board approved plans to buy back as many as 15 million shares by June 26  2017.",
        "date": "06242016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco says board approved share buyback "
    },
    {
        "content": "SAO PAULO/BRASILIA Brazil's antitrust watchdog on Wednesday approved Banco Bradesco SA's purchase of HSBC Holdings Plc's  local unit with some conditions  marking the latest departure of a foreign lender from one of the world's most concentrated banking markets.",
        "date": "06092016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Bradesco wins Brazil approval for $5.2 billion purchase of HSBC unit "
    },
    {
        "content": "SAO PAULO/BRASILIA  June 8 Brazil's antitrust watchdog on Wednesday approved Banco Bradesco SA's purchase of HSBC Holdings Plc's local unit with some conditions  marking the latest departure of a foreign lender from one of the world's most concentrated banking markets.",
        "date": "06092016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "CORRECTED-UPDATE 2-Bradesco wins Brazil approval for $5.2 bln purchase of HSBC unit "
    },
    {
        "content": "SAO PAULO  June 8 Brazil's antitrust watchdog Cade approved on Wednesday Banco Bradesco SA's acquisition of HSBC Holdings Plc's local unit under certain conditions.",
        "date": "06092016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "CORRECTED-Brazil watchdog approves Bradesco purchase of HSBC local unit "
    },
    {
        "content": "NEW YORK  June 3 Banco Bradesco SA  was sued on Friday in a U.S. court by shareholders who accused it of concealing its involvement in a bribery scheme  an effort to avoid a 3 billion Brazilian reais  ($850.89 million) tax fine  and weaknesses in its internal controls.",
        "date": "06032016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Banco Bradesco faces shareholder lawsuit in U.S. "
    },
    {
        "content": "NEW YORK  June 3 Banco Bradesco SA  was sued on Friday in a U.S. court by shareholders who accused the Brazilian lender of fraudulently concealing its involvement in a bribery scheme  its alleged effort to avoid a 3 billion Brazilian reais ($850.89 million) tax fine  and weaknesses in its internal controls.",
        "date": "06032016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "UPDATE 1-Banco Bradesco faces shareholder lawsuit in U.S. "
    },
    {
        "content": "SAO PAULO Brazil's federal police accused Banco Bradesco SA  Chief Executive Officer Luiz Carlos Trabuco and two senior executives on Tuesday of plotting to avoid a 3 billion-real ($828 million) tax fine  the latest episode of alleged white-collar crime in Latin America's largest economy.",
        "date": "05312016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Bradesco CEO Trabuco faces accusations in Brazil tax probe "
    },
    {
        "content": "SAO PAULO  May 31 Brazil's federal police accused Banco Bradesco SA Chief Executive Officer Luiz Carlos Trabuco and two senior executives on Tuesday of plotting to avoid a 3 billion-real ($828 million) tax fine  the latest episode of alleged white-collar crime in Latin America's largest economy.",
        "date": "05312016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "UPDATE 4-Bradesco CEO Trabuco faces accusations in Brazil tax probe "
    },
    {
        "content": "SAO PAULO  May 31 Shares in Banco Bradesco SA  Brazil's No. 2 private-sector bank  posted their biggest intraday drop in almost seven months on Tuesday after the federal police accused Chief Executive Officer Luiz Carlos Trabuco and two senior executives of wrongdoing in a sweeping tax probe.",
        "date": "05312016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "CORRECTED-UPDATE 1-Bradesco stock slumps as CEO Trabuco accused in Brazil tax probe "
    },
    {
        "content": "SAO PAULO The premium in the shares of Brazilian lender Itaú Unibanco Holding SA over smaller rival Banco Bradesco SA narrowed on Wednesday as investors fretted that Itaú faces a tougher time coping with a painful recession.",
        "date": "05042016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Itaú loses ground to Bradesco as outlooks for Brazil banks diverge "
    },
    {
        "content": "SAO PAULO Banco Bradesco SA expects loan-loss provisions to end the year within target even if defaults climbed further  executives said on Thursday  trying to allay concerns that a harsh recession will lead Brazil's third-largest listed bank to accelerate loan refinancings for troubled individual and corporate borrowers.",
        "date": "04282016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Bradesco sees provisions within goal despite rising Brazil defaults "
    },
    {
        "content": "SAO PAULO  April 28 Banco Bradesco SA expects loan-loss provisions to end the year within target even if defaults climbed further  executives said on Thursday  trying to allay concerns that a harsh recession will lead Brazil's third-largest listed bank to accelerate loan refinancings for troubled individual and corporate borrowers.",
        "date": "04282016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "UPDATE 4-Bradesco sees provisions within goal despite rising Brazil defaults "
    },
    {
        "content": "SAO PAULO  April 28 Banco Bradesco SA missed first-quarter profit estimates on Thursday  after a harsh recession and rising defaults forced Brazil's third-largest listed bank to raise loan-loss provisions and step up renegotiations with some large corporate borrowers.",
        "date": "04282016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco misses estimates as provisions jump "
    },
    {
        "content": "SAO PAULO Banco Bradesco SA  said on Monday it had received central bank permission to raise up to 8 billion reais ($2.2 billion) in fresh capital through a share offering.",
        "date": "04042016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Brazil authorizes Bradesco's $2.2 billion capital increase plan "
    },
    {
        "content": "SAO PAULO  April 4 Banco Bradesco SA  said on Monday it had received central bank permission to raise up to 8 billion reais ($2.2 billion) in fresh capital through a share offering.",
        "date": "04042016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil authorizes Bradesco's $2.2 bln capital increase plan "
    },
    {
        "content": "BRASILIA  April 4 A preliminary report by Brazil's antitrust regulator recommended imposing restrictions on Bradesco SA's purchase of the Brazilian unit of HSBC Holdings PLC  according to the official gazette on Monday.",
        "date": "04042016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's antitrust body recommends restrictions on HSBC-Bradesco deal "
    },
    {
        "content": "SAO PAULO  Feb 5 Itaú Unibanco Holding SA   Brazil's largest private-sector bank  has for years traded at a premium to rival Banco Bradesco SA but many investors are betting the gap will narrow amid sharply diverging outlooks from the lenders.",
        "date": "02052016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Bradesco closes in on Itaú amid diverging Brazil outlook "
    },
    {
        "content": "SAO PAULO  Feb 3 Brazil's Banco Bradesco SA   the country's second largest private bank  proposed on Wednesday a capital increase of 8 billion reais ($2.05 billion) using its own reserves and granting new shares to current shareholders free of charge  the bank said in a regulatory filing.",
        "date": "02032016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Brazil's Banco Bradesco proposes $2 bln capital increase "
    },
    {
        "content": "SAO PAULO  Jan 29 Many of Brazil's biggest corporate loan defaults cases have already happened and been dealt with  a senior executive at giant private-sector lender Banco Bradesco said on Friday  underscoring a prudent tack on loan book quality as the nation struggles with a deep recession.",
        "date": "01292016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Worst Brazil default cases already happened  Bradesco CFO says "
    },
    {
        "content": "SAO PAULO  Jan 28 Banco Bradesco SA  Brazil's No. 2 private sector bank  expects loan book growth to slow and loan-loss provisions to rise significantly this year  highlighting the headwinds facing Latin America's largest economy.",
        "date": "01282016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "UPDATE 3-Bradesco's cautious targets underpin extent of Brazil woes "
    },
    {
        "content": "SAO PAULO  Jan 28 Banco Bradesco SA    Brazil's second-largest private-sector bank  announced on Thursday the following operating estimates for this year:  1) Bradesco expects to grow lending between 1 percent and 5 percent this year  compared with an expansion of 4.2 percent in 2015. 2) Bradesco expects to grow disbursements of corporate loans between 0 percent and 4 percent  and consumer credit between 4 percent and 8 percent this year. 3) The bank forecasts interest income  or rev",
        "date": "01282016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco sees loan book growing 1 pct-5 pct this year "
    },
    {
        "content": "SAO PAULO Brazilian lenders Banco Bradesco  and Banco do Brasil  are in talks to buy Citigroup's  stake in a credit card processing joint venture with Elavon Inc  a source with knowledge of the negotiations said on Saturday.",
        "date": "01092016",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Banco do Brasil  Bradesco in Citigroup venture talks: source "
    },
    {
        "content": "SAO PAULO  Jan 9 Brazilian lenders Banco Bradesco and Banco do Brasil are in talks to buy Citigroup's stake in a credit card processing joint venture with Elavon Inc  a source with knowledge of the negotiations said on Saturday.",
        "date": "01092016",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Banco do Brasil  Bradesco in Citigroup venture talks-source "
    },
    {
        "content": "SAO PAULO Brazilian lender Banco Bradesco SA has not been approached about buying assets from investment bank BTG Pactual SA  its chief executive said on Monday.",
        "date": "11302015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco not approached to buy BTG Pactual assets: CEO "
    },
    {
        "content": "SAO PAULO  Nov 30 Brazilian lender Banco Bradesco SA has not been approached about buying assets from investment bank BTG Pactual SA  its chief executive said on Monday.",
        "date": "11302015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco not approached to buy BTG Pactual assets -CEO "
    },
    {
        "content": "SAO PAULO  Nov 11 Marco Antonio Rossi  the top executive at the insurance arm of  Brazil's second-largest private-sector lender Banco Bradesco SA  was killed in a plane crash  the bank said in a statement on Wednesday.",
        "date": "11112015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "UPDATE 3-Senior Bradesco executive killed in Brazil plane crash "
    },
    {
        "content": "SAO PAULO  Nov 16 Banco Bradesco SA  Brazil's No. 2 private-sector lender  plans to seek shareholder approval to raise about 3 billion reais ($780 million) to bolster capital following a ramp-up in loan-loss provisions and the purchase of HSBC Holdings Plc's local unit.",
        "date": "11162015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "UPDATE 1-Brazil's Bradesco seeks approval for $780 mln offering; shares fall "
    },
    {
        "content": "SAO PAULO  Nov 11 Marco Antonio Rossi  the top executive at the insurance arm of  Brazil's second largest private lender Banco Bradesco SA  was killed in a plane crash on Tuesday  two people with knowledge of the matter told Reuters.",
        "date": "11112015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "UPDATE 2-Senior Bradesco executive killed in Brazil plane crash - sources "
    },
    {
        "content": "SAO PAULO  Nov 16 Banco Bradesco SA  Brazil's No. 2 private-sector lender  plans to seek shareholder approval to raise about 3 billion reais ($780 million) to bolster capital following a ramp-up in loan-loss provisions and the purchase of HSBC Holdings Plc's local unit.",
        "date": "11162015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco seeks approval for $780 mln offering; shares fall "
    },
    {
        "content": "SAO PAULO  Oct 30 Defaults among large corporate borrowers in Brazil probably peaked  following months of steady increases  as industrial  farming and services firms actively seek to refinance their debts  executives at Banco Bradesco SA said on Friday.",
        "date": "10302015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "UPDATE 1-Brazl's Bradesco sees large corporate defaults peaking "
    },
    {
        "content": "SAO PAULO  Oct 29 Banco Bradesco SA  Brazil's No. 2 private-sector bank  is comfortable with loan-loss provisions at current levels even as the nation's worst recession in a quarter century and fallout from a massive corruption scandal at state firms threaten to hamper earnings in coming quarters  executives said on Thursday.",
        "date": "10292015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "UPDATE 2-Bradesco provision buffer enough to counter Brazil defaults "
    },
    {
        "content": "SAO PAULO  Oct 30 A gradual increase in loan defaults in Brazil is unlikely to weigh down the quality of Banco Bradesco SA's loan book  as the nation's No. 2 private-sector lender has for years shifted focus towards less risky credit segments  executives said on Friday.",
        "date": "10302015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Bradesco CFO sees loan book quality strong despite Brazil woes "
    },
    {
        "content": "SAO PAULO  Oct 29 Loan-loss provisions at Banco Bradesco SA are currently at levels deemed comfortable  as Brazil's No. 2 private-sector bank expects defaults to rise slightly and gradually over the coming quarters  executives said on Thursday.",
        "date": "10292015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Bradesco comfortable with provisions as Brazil defaults stabilize "
    },
    {
        "content": "SAO PAULO  Oct 29 Banco Bradesco SA    Brazil's second largest private-sector bank  kept loan book growth estimates for this year unchanged  following the release of third-quarter results on Thursday.",
        "date": "10292015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco keeps outlook for loan book  revenue unchanged "
    },
    {
        "content": "SAO PAULO  Aug 21 Shareholders of re-insurer IRB Brasil RE SA have decided to file for permission from Brazil's CVM securities regulator to hold a share offering  Banco Bradesco SA said in a securities filing on Friday.",
        "date": "08212015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "IRB Brasil shareholders approve share offering - Banco Bradesco "
    },
    {
        "content": "SAO PAULO  Aug 4 Brazilian bankers' unions said on Tuesday that management from Banco Bradesco SA and HSBC Holdings promised there would be no mass layoffs due to the sale of HSBC's Brazilian operation  announced this week.",
        "date": "08042015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Brazil bank unions say HSBC and Bradesco promise no mass layoffs "
    },
    {
        "content": "SAO PAULO Banco Bradesco SA  agreed to buy HSBC Holdings Plc's  Brazilian unit for a surprisingly high 17.6 billion reais ($5.2 billion)  narrowing the gap with larger rivals while boosting its base of affluent customers in Latin America's largest economy.",
        "date": "08032015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Bradesco to acquire HSBC Brazil unit  biggest-ever buy "
    },
    {
        "content": "SAO PAULO  Aug 3 Banco Bradesco SA  sat on the sidelines for years while Brazilian banking rivals bulked up through a series of takeovers. On Monday  it made a grab for HSBC Holdings Plc's domestic business  one that will boost its assets by 16 percent.",
        "date": "08032015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "HSBC acquisition poses big test for Bradesco CEO Trabuco "
    },
    {
        "content": "* HSBC struggled with competition  high costs in Brazil   (Adds Breakingviews link)",
        "date": "08032015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "UPDATE 5-Bradesco to acquire HSBC Brazil unit  biggest-ever buy "
    },
    {
        "content": "SAO PAULO  Aug 3 Banco Bradesco SA  agreed to buy HSBC Holdings Plc's Brazilian unit for 17.6 billion reais ($5.2 billion)  narrowing the gap with larger rivals while boosting its base of affluent customers in Latin America's largest economy.",
        "date": "08032015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "REFILE-UPDATE 3-Bradesco to pay $5.2 billion for HSBC Brazil unit  biggest-ever buy "
    },
    {
        "content": "SAO PAULO  July 30 Banco Bradesco SA  Brazil's second-largest private-sector bank  beat second-quarter profit estimates on Thursday after fee income came in stronger than expected and loan-loss provisions peaked despite an uptick in defaults.",
        "date": "07302015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "UPDATE 2-Soaring fees help Brazilian lender Bradesco beat profit forecasts "
    },
    {
        "content": "HONG KONG/LONDON  Aug 3 HSBC Holdings  beat expectations with a 10 percent rise in first-half profit thanks to a strong performance in Hong Kong and has agreed a $5.2 billion sale of its business in Brazil.",
        "date": "08032015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "UPDATE 4-HSBC sells up in Brazil as profits jump on Hong Kong boom "
    },
    {
        "content": "SAO PAULO  July 30 Banco Bradesco SA  Brazil's second-largest private-sector bank  beat second-quarter profit estimates on Thursday after income from the sale of financial services came stronger than expected.",
        "date": "07302015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco beats profit estimates on strong fee income "
    },
    {
        "content": "SAO PAULO  Aug 3 Banco Bradesco SA  Brazil's No. 2 private-sector bank  agreed to purchase HSBC Holdings Plc's business in the country  according to a securities filing early on Monday.",
        "date": "08032015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco confirms purchase of HSBC's Brazilian business "
    },
    {
        "content": "SAO PAULO  Aug 2 Banco Bradesco SA  Brazil's No. 2 private-sector bank  has agreed to pay 17.6 billion reais ($5.2 billion) for HSBC Holdings Plc's  Brazilian unit  magazine Veja's Radar blog reported late on Sunday.",
        "date": "08032015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Bradesco to pay $5.2 bln for HSBC's Brazilian unit - magazine says "
    },
    {
        "content": "SAO PAULO  July 20 Banco Bradesco SA  Brazil's No. 2 private-sector bank  late on Monday began exclusive talks to acquire HSBC Holdings Plc's  Brazilian unit  according to a person with direct knowledge of the transaction.",
        "date": "07212015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Bradesco enters exclusive talks to buy HSBC Brasil  source says "
    },
    {
        "content": "SAO PAULO  June 24 Brazilian lender Banco Bradesco SA said in a securities filing on Wednesday that its board approved plans to buy back as many as 15 million shares over the next year.",
        "date": "06242015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Brazil's Banco Bradesco to buy back 15 mln shares "
    },
    {
        "content": "SAO PAULO Banco Bradesco SA  Brazil's No. 2 private-sector bank  will make a binding offer to buy HSBC Holdings Plc's Brazilian unit next month  the newswire service of O Estado de S. Paulo newspaper said on Wednesday.",
        "date": "06172015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco to bid for HSBC Brasil  newswire says "
    },
    {
        "content": "SAO PAULO  June 17 Banco Bradesco SA  Brazil's No. 2 private-sector bank  will make a binding offer to buy HSBC Holdings Plc's Brazilian unit next month  the newswire service of O Estado de S. Paulo newspaper said on Wednesday.",
        "date": "06172015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "UPDATE 1-Brazil's Bradesco to bid for HSBC Brasil  newswire says "
    },
    {
        "content": "SAO PAULO  June 17 Banco Bradesco SA  Brazil's No. 2 private-sector bank  will make a binding offer for HSBC Holdings Plc's Brazilian unit next month  the newswire service of O Estado de S. Paulo newspaper said on Wednesday.",
        "date": "06172015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco to place bid for HSBC Brasil  Estado says "
    },
    {
        "content": "SAO PAULO Banco Bradesco SA  Brazil's second-largest private-sector lender  would face a capital shortfall should a reported bid for the local unit of HSBC Holdings Plc succeed  UBS Securities analysts said on Monday.",
        "date": "06082015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Bradesco capital may fall in HSBC Brasil deal  UBS says "
    },
    {
        "content": "SAO PAULO  June 8 Banco Bradesco SA  Brazil's second-largest private-sector lender  would face a capital shortfall should a reported bid for the local unit of HSBC Holdings Plc succeed  UBS Securities analysts said on Monday.",
        "date": "06082015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "UPDATE 1-Bradesco capital may fall in HSBC Brasil deal  UBS says "
    },
    {
        "content": "SAO PAULO  June 8 Banco Bradesco SA  Brazil's second-largest private-sector lender  would face a capital shortfall should a reported bid of 10 billion reais ($3.2 billion) for the local unit of HSBC Holdings Plc succeed  UBS Securities analysts said on Monday.",
        "date": "06082015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Bradesco faces capital shortfall in HSBC Brasil deal  UBS says "
    },
    {
        "content": "SAO PAULO  April 30 Loan defaults in Brazil will remain stable throughout the year  with delinquencies among small- and mid-sized corporate borrowers staying elevated relative to other segments  Chief Executive Officer Luiz Carlos Angelotti said on Thursday.",
        "date": "04302015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Bradesco sees default ratio declining despite Brazil woes "
    },
    {
        "content": "SAO PAULO  April 29 Banco Bradesco SA  is prepared to deliver return on equity around 20 percent this year even if loan-loss provisions rise faster than loan book growth in the months ahead  Chief Financial Officer Luiz Carlos Angelotti said on Wednesday.",
        "date": "04292015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "UPDATE 3-Bradesco sees ROE unscathed despite faster provision growth "
    },
    {
        "content": "SAO PAULO  April 29 A 0.5 percentage point jump in short-term loan delinquencies at Banco Bradesco SA in the first quarter was strictly due to seasonal factors  officials said on a conference call on Wednesday.",
        "date": "04292015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Surge in Bradesco short-term defaults was seasonal  official says "
    },
    {
        "content": "SAO PAULO  April 29 Banco Bradesco SA   Brazil's second-largest private-sector bank  slightly beat first-quarter earnings estimates on Wednesday after taking advantage of climbing interest rates to reprice new loans.",
        "date": "04292015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco slightly beats first-quarter profit estimates "
    },
    {
        "content": "SAO PAULO  April 7 Banco Bradesco SA's investment-banking arm is confident that improved investor sentiment may unleash a flurry of local bond and stock offerings that murky market conditions have held back for months  a senior executive said on Tuesday.",
        "date": "04072015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Improving investor sentiment may spur Brazilian deals -Bradesco "
    },
    {
        "content": "SAO PAULO  April 6 A group of commercial banks and state-controlled oil producer Petróleo Brasileiro SA are close to extending loan refinancing to ailing oil rig producer Sete Brasil Participações SA  the top executive of Banco Bradesco SA said on Monday.",
        "date": "04062015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Sete Brasil close to obtaining loan relief  Bradesco CEO says "
    },
    {
        "content": "SAO PAULO  March 17 State-controlled Petróleo Brasileiro SA  hired several investment banks to help sell $13.7 billion worth of assets including gasoline stations  stakes in oil fields and electricity investments  Folha de S. Paulo reported on Monday.",
        "date": "03172015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Petrobras hires banks to handle asset sales  Folha says "
    },
    {
        "content": "SAO PAULO  Feb 4 Banco Bradesco SA  Brazil's second-largest private-sector bank  created on Wednesday a new seniot vice president slot for the fast-growing card business  a segment that is responsible for the biggest portion of growth in fee income.",
        "date": "02042015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco creates vice president slot for card business "
    },
    {
        "content": "SAO PAULO Banco Bradesco SA  is prepared to weather an expected wave of corporate defaults and debt restructurings in Brazil  executives said on Friday  expecting strict risk assessment and provision policies to protect the loan book of Brazil's No. 2 private sector lender.",
        "date": "01302015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco says ready to weather corporate defaults "
    },
    {
        "content": "SAO PAULO  Jan 30 Banco Bradesco SA  is prepared to weather an expected wave of corporate defaults and debt restructurings in Brazil  executives said on Friday  expecting strict risk assessment and provision policies to protect the loan book of Brazil's No. 2 private sector lender.",
        "date": "01302015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "UPDATE 1-Brazil's Bradesco says ready to weather corporate defaults "
    },
    {
        "content": "SAO PAULO  Jan 29 Loan delinquencies and loan-loss provisions are likely to remain stable in coming months for Banco Bradesco SA   Brazil's second largest private-sector bank  Chief Financial Officer Luiz Carlos Angelotti said on Thursday.",
        "date": "01292015",
        "name": "Banco Bradesco Sa",
        "news_type": "topStory",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco sees stable defaults  provisions this year "
    },
    {
        "content": "SAO PAULO  Jan 30 Banco Bradesco SA's   Brazil's second largest private-sector bank  is unlikely to be affected by a potential wave of corporate defaults and restructurings in Brazil thanks to its strict and careful risk assessment policies  executives said on Friday.",
        "date": "01302015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Bradesco prepared to deal with potential Brazil credit events "
    },
    {
        "content": "SAO PAULO Banco Bradesco SA   Brazil's second-biggest private sector bank  on Thursday forecast lower lending growth for this year than it estimated for 2014  highlighting the economic headwinds facing Latin America's largest economy.",
        "date": "01292015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco sets lower loan book growth forecast "
    },
    {
        "content": "SAO PAULO  Jan 29 Banco Bradesco SA  Brazil's second-biggest private sector bank  on Thursday forecast lower lending growth for this year than it estimated for 2014  highlighting the economic headwinds facing Latin America's largest economy.",
        "date": "01292015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "UPDATE 3-Brazil's Bradesco sets lower loan book growth forecast "
    },
    {
        "content": "SAO PAULO  Jan 29 Banco Bradesco SA    Brazil's second-biggest non-government bank  announced on Thursday the following operating estimates for this year:",
        "date": "01292015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco sees loan book growing 5 pct-9 pct this year "
    },
    {
        "content": "SAO PAULO  Jan 29 Banco Bradesco SA  Brazil's second-largest private-sector bank  beat fourth-quarter earnings estimates on Thursday after taking advantage of climbing interest rates to reprice new loans.",
        "date": "01292015",
        "name": "Banco Bradesco Sa",
        "news_type": "normal",
        "symbol": "BBDO",
        "title": "Brazil's Bradesco beats profit estimates in fourth quarter "
    }
]