[
    {
        "content": "SYDNEY  Nov 17 Shanghai nickel prices fell on Friday on worries about growth in Chinese steel markets  with the sector heading into a low consumption period over winter.",
        "date": "11172017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "METALS-Nickel prices drop on worries China steel demand is losing its shine "
    },
    {
        "content": "SYDNEY BHP Billiton said on Thursday it hopes to fully divest its troubled U.S. onshore shale business in around two years and is also seeking a buyer for its nickel business in Australia.",
        "date": "11162017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP eyes two-year exit from shale; also selling nickel "
    },
    {
        "content": "* Also looking to exit \"non-core\" nickel business (Releads  adds details of nickel asset sale  ceo comments)",
        "date": "11162017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-BHP eyes two-year exit from shale; also selling nickel "
    },
    {
        "content": "SYDNEY  Nov 15 Global fund manager Aberdeen Standard Investments fully supports activist investor Elliott Management's push for widespread structural changes at mining giant BHP Billiton  a senior Aberdeen manager said on Wednesday.",
        "date": "11152017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "CORRECTED-Aberdeen fund '100 pct' behind Elliott's push for change at BHP "
    },
    {
        "content": "Global miner BHP Billiton reported a 4 percent drop in quarterly iron ore output following a fire at its Mount Whaleback mine in Australia in June  but said it still expects to hit its annual production target.",
        "date": "10172017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP first-quarter iron ore output hurt by mine fire  guidance intact "
    },
    {
        "content": "Oct 18 Global miner BHP Billiton reported a 4 percent drop in quarterly iron ore output following a fire at its Mount Whaleback mine in Australia in June  but said it still expects to hit its annual production target.",
        "date": "10172017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP Q1 iron ore output hurt by mine fire  guidance intact "
    },
    {
        "content": "    Oct 10 Britain's FTSE 100 index is seen opening 5 points lower at 7 502.8 on Tuesday  according to financial bookmakers.               * BHP BILLITON: Activist investor Elliott has embarked on an international tour of BHP Billiton's biggest shareholders as it presses ahead with its campaign to force a radical shake-up of the FTSE 100 mining giant  sources familiar with the matter told Reuters.     * MICRO FOCUS: British tech firm Micro Focus International  the new owner of ArcSig",
        "date": "10102017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Stocks-Factors to watch on Oct 10 "
    },
    {
        "content": "LONDON Activist investor Elliott has embarked on an international tour of BHP Billiton's biggest shareholders as it presses ahead with its campaign to force a radical shake-up of the FTSE 100 mining giant  sources familiar with the matter told Reuters.",
        "date": "10092017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Elliott tours BHP investors in renewed push for radical shake-up: sources "
    },
    {
        "content": "* Elliott met investors in London  South Africa and Australia",
        "date": "10092017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Elliott tours BHP investors in renewed push for radical shake-up -sources "
    },
    {
        "content": "HOUSTON  Oct 6 BHP Billiton  has completed the evacuation of its Shenzi and Neptune deepwater oil and gas platforms in the Gulf of Mexico ahead of Tropical Storm Nate  the firm said on Friday.",
        "date": "10062017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton evacuates Shenzi  Neptune platforms ahead of Nate "
    },
    {
        "content": "SANTIAGO  Oct 12 Japan's Mitsui & Co plans to build a desalination plant for BHP Billiton Plc's Spence copper mine in Chile  it said on Thurday.",
        "date": "10122017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Mitsui to build BHP desalination plant in Chile "
    },
    {
        "content": "LONDON BHP Billiton    the world's largest miner  has hired Barclays  and Citigroup  to help it exit its  underperforming U.S. shale oil and gas business  which could fetch around $10 billion  two banking sources said.",
        "date": "08312017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP hires Barclays  Citi for U.S. shale gas divestment: sources "
    },
    {
        "content": "LONDON  Aug 31 BHP Billiton   the world's largest miner  has hired Barclays and Citigroup to help it exit its  underperforming U.S. shale oil and gas business  which could fetch around $10 billion  two banking sources said.",
        "date": "08312017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP hires Barclays  Citi for U.S. shale gas divestment - sources "
    },
    {
        "content": "LAUNCESTON  Australia It's tempting to think that BHP Billiton has caved into demands by activist investor Elliott Advisors by agreeing to sell its U.S. onshore oil and gas business and by boosting the returns to shareholders.",
        "date": "08252017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Elliott's BHP adventure pays dividends  but not total victory: Russell "
    },
    {
        "content": "SYDNEY  Aug 23 BHP Billiton  on Wednesday unveiled a board shakeup that will see controversial director Grant King step down six months after joining the company amid concerns among investors over oil investments.",
        "date": "08232017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton to replace two directors in board shake-up "
    },
    {
        "content": "* Fund critical of board applauds changes (Adds fund manager comment  details  share price)",
        "date": "08232017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP Billiton to replace two directors in board shake-up "
    },
    {
        "content": "SYDNEY BHP Billiton  the world's largest miner  reported a surge in underlying full-year profit on Tuesday and said it would exit its underperforming U.S. shale oil and gas business  pleasing disgruntled shareholders who called for a sale.",
        "date": "08222017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP to quit U.S. shale business as annual profit surges "
    },
    {
        "content": "LAUNCESTON  Australia  Aug 22 It's tempting to think that BHP Billiton has caved into demands by activist investor Elliott Advisors by agreeing to sell its U.S. onshore oil and gas business and by boosting the returns to shareholders.",
        "date": "08222017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-COLUMN-Elliott's BHP adventure pays dividends  but not total victory: Russell "
    },
    {
        "content": "Aug 22 Global mining giant BHP Billiton posted a five-fold rise in annual underlying profit on Tuesday to $6.7 billion on the back of a recovery in industrial commodities markets  but missed analysts' forecasts.",
        "date": "08212017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "CORRECTED-BHP misses annual profit forecast; focus on paying down debt "
    },
    {
        "content": " (Updates prices)     By Melanie Burton     MELBOURNE  Aug 22 London copper rose to a fresh three-year high on Tuesday after a string of results from mining companies buoyed sentiment towards the sector  which also found wider support from robust gains in steel material prices in China.     \"The wider sector continues to benefit from an increasingly positive sentiment as economic growth betters expectations amid a (broadly) weaker USD \" said ANZ in a report.     The dollar inched hig",
        "date": "08222017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "METALS-London copper hits 3-yr high as miners rally on strong results "
    },
    {
        "content": "    Aug 22 Britain's FTSE 100 index is seen opening up 25 points at 7318.88 on Tuesday  according to financial bookmakers.          * BHP: Global mining giant BHP Billiton committed to quitting its underperforming U.S. shale oil and gas business on Tuesday  as it posted a surge in annual underlying profit to $6.7 billion.     * LLOYDS: Ex-CEO of Lloyds Banking Group Plc is suing the bank in a move that might spark public outrage  The Times reported on Monday. http://bit.ly/2g1MPAx   ",
        "date": "08222017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Stocks-Factors to watch on Aug 22 "
    },
    {
        "content": "Aug 22 Australian shares edged up on Tuesday thanks to some encouraging results including for BHP Billiton  whose stock jumped after the global miner posted robust annual earnings and said it was putting its U.S. shale assets for sale.",
        "date": "08222017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia shares up as BHP jumps after strong profits; NZ slightly up "
    },
    {
        "content": "LAUNCESTON  Australia  Aug 22 It's tempting to think that BHP Billiton has caved into demands by activist investor Elliott Advisors by agreeing to sell its U.S. onshore oil and gas business and by boosting the returns to shareholders.",
        "date": "08222017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-Elliott's BHP adventure pays dividends  but not total victory: Russell "
    },
    {
        "content": "MELBOURNE/LONDON Hedge fund Elliott Management has upped the stakes at BHP    gaining powers to push for change by raising its holding in the miner's London-listed arm to 5 percent.",
        "date": "08162017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Hedge fund Elliott ups stakes at BHP by crossing threshold "
    },
    {
        "content": "* Ken MacKenzie becomes chairman on Sept. 1 (Releads  adds significance of 5 pct threshold)",
        "date": "08162017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 4-Hedge fund Elliott ups stakes at BHP by crossing threshold "
    },
    {
        "content": "MELBOURNE  Aug 16 Hedge fund Elliott Management has raised its stake in BHP Billiton  to 5 percent  stepping up a campaign to pressure the top global miner into quitting its U.S. shale business  boosting returns and ditching its dual listing.",
        "date": "08152017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Elliott Management raises stake in BHP to 5 pct "
    },
    {
        "content": "* Elliott says discloses that it now holds 5% of issued shares of bhp billiton plc Source text for Eikon: Further company coverage:",
        "date": "08152017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BRIEF-Elliott discloses 5 pct Shareholding in BHP Billiton PLC "
    },
    {
        "content": "SANTIAGO A consortium made up of Mitsui & Co and Grupo Cobra is in exclusive talks with BHP Billiton Plc to build an $800 million desalination plant at its Spence copper mine in Chile  two sources with knowledge of the process told Reuters this week.",
        "date": "08102017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Exclusive: Mitsui  Cobra in talks with BHP over desalination plant - sources "
    },
    {
        "content": "BRASILIA  Aug 7 A judge in Brazil has temporarily suspended criminal proceedings against 22 people and four companies accused of killing 19 people in the 2015 Samarco mine disaster  over the legality of phone intercepts between executives involved and other evidence.",
        "date": "08072017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Brazil suspends murder trial in Samarco disaster over possible illegal evidence "
    },
    {
        "content": "MELBOURNE  Aug 4 BHP Billiton is looking for ways to shore up power supply and bring down power costs at its Olympic Dam copper mine in Australia  as it plans to expand following a string of electrical outages  the mine's head said on Friday.",
        "date": "08042017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP presses for cheaper power ahead of Olympic Dam mine expansion "
    },
    {
        "content": "SYDNEY/RIO DE JANEIRO BHP Billiton on Tuesday denied commentary in a Brazilian newspaper that it has agreed to sell its stake in the Samarco iron ore mine to its partner Vale.",
        "date": "08012017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP denies it has agreed to sell Samarco stake to Vale "
    },
    {
        "content": "LONDON/VANCOUVER  July 21 Mining giant Glencore Plc is working with a Canadian pension fund to create a standalone 50:50 joint venture for its portfolio of royalty assets  two sources with knowledge with the matter said on Friday.",
        "date": "07212017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Glencore in talks with Canadian pension fund on royalties JV-sources "
    },
    {
        "content": "SANTIAGO Chilean authorities have approved a $2.5 billion expansion of BHP Billiton's Spence copper mine  a local newspaper reported on Wednesday  though the company has not yet decided whether to go ahead with the project.",
        "date": "07192017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Chile approves expansion at BHP's Spence mine: paper "
    },
    {
        "content": "July 19 Australian shares advanced on Wednesday  unfazed by a slip in BHP Billiton  as the \"Big Four\" banks surged after declaring comfort with new capital rules designed to make them \"unquestionably strong\".",
        "date": "07192017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia shares rebound as bank stocks surge  New Zealand up too "
    },
    {
        "content": "BHP Billiton's fiscal fourth quarter iron ore output rose 8 percent from a year ago  enabling the world's third largest producer to meet its full-year guidance and set a bigger target for the current year.",
        "date": "07182017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP hits full year iron ore guidance  sets higher target "
    },
    {
        "content": "* Flags $546 mln exceptional item due to copper strike (Adds quotes  details)",
        "date": "07182017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP hits full year iron ore guidance  sets higher target "
    },
    {
        "content": "July 19 BHP Billiton's  fiscal fourth quarter iron ore output rose 8 percent from a year ago  enabling the world number three producer to meet its full year guidance.",
        "date": "07182017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP hits full year iron ore guidance after strong Q4 "
    },
    {
        "content": "SYDNEY BHP Billiton's Chairman Jac Nasser said on Thursday BHP's $20 billion investment in U.S. shale oil and gas six years ago was  in hindsight  a mistake.",
        "date": "06292017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP chairman says $20 billion investment in shale was a mistake "
    },
    {
        "content": "SYDNEY  June 29 BHP Billiton's Chairman Jac Nasser said on Thursday BHP's $20 billion investment in U.S. shale oil and gas six years ago was  in hindsight  a mistake.",
        "date": "06292017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP chairman says $20 bln investment in shale was a mistake "
    },
    {
        "content": "SYDNEY BHP Billiton   and Vale  have won a four-month extension from a Brazilian court to negotiate a settlement to a $47 billion claim stemming from the Samarco mine disaster in 2015  BHP said on Friday.",
        "date": "06302017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Court gives BHP  Vale until October 30 to settle $47 billion Samarco claim "
    },
    {
        "content": "SYDNEY/MELBOURNE Mining giant BHP on Friday named successful packaging executive Ken MacKenzie as its next chairman  handing him the job of tackling calls to dump its oil business and overhaul the board.",
        "date": "06162017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP names packaging guru MacKenzie as new chairman "
    },
    {
        "content": "LAUNCESTON  Australia  June 19 There has been no shortage of advice doled out to incoming BHP Billiton chairman Ken MacKenzie on how to boost the world's largest mining company  but ultimately his role comes down to a fairly straightforward choice.",
        "date": "06192017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "RPT-COLUMN-BHP's new chairman has choice between exciting and boring: Russell "
    },
    {
        "content": "LAUNCESTON  Australia There has been no shortage of advice doled out to incoming BHP Billiton chairman Ken MacKenzie on how to boost the world's largest mining company  but ultimately his role comes down to a fairly straightforward choice.",
        "date": "06192017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP's new chairman has choice between exciting and boring: Russell "
    },
    {
        "content": "SYDNEY Activist shareholder Elliott Management called on BHP  on Wednesday to \"upgrade\" its board of directors as the mining giant prepares to select a new chairman this week.",
        "date": "06142017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Elliott calls for BHP board overhaul as new chairman looms "
    },
    {
        "content": "SYDNEY  June 16 Mining giant BHP Billiton on Friday named former Australian packaging executive Ken MacKenzie as its next chairman. MacKenzie  53  succeeds Jac Nasser  as of September 1.",
        "date": "06152017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP names Ken MacKenzie as new chairman "
    },
    {
        "content": "LAUNCESTON  Australia  June 19 There has been no shortage of advice doled out to incoming BHP Billiton chairman Ken MacKenzie on how to boost the world's largest mining company  but ultimately his role comes down to a fairly straightforward choice.",
        "date": "06192017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-BHP's new chairman has choice between exciting and boring: Russell "
    },
    {
        "content": "SYDNEY  June 14 Activist shareholder Elliott Management called on BHP Billiton on Wednesday to \"upgrade\" its board of directors as the mining giant prepares to select a new chairman.",
        "date": "06142017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "REFILE-Elliott calls for BHP board overhaul as new chairman looms "
    },
    {
        "content": "TOKYO  June 5 BHP Billiton Chief Executive Andrew Mackenzie said on Monday he has not met with activist investor Elliott Management since their talks in Barcelona last month and declined to comment on whether another meeting was scheduled.",
        "date": "06052017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP CEO says he has not met with Elliott since Barcelona "
    },
    {
        "content": "TOKYO  June 5 BHP Billiton Chief Executive Andrew Mackenzie said on Monday he has not met with activist hedge fund Elliott Management since their talks in Barcelona last month and declined to comment on whether another meeting was scheduled.",
        "date": "06052017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP CEO says he has not met with Elliott since Barcelona "
    },
    {
        "content": "SYDNEY  June 1 BHP Billiton said on Thursday it had lifted a declaration of force majeure at its Escondida copper mine in Chile.",
        "date": "06012017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP lifts force majeure declaration at Escondida copper mine "
    },
    {
        "content": "SYDNEY BHP Billiton is seeking environmental approval to dig two new mines to extend the life of its Nickel West unit in the state of Western Australia  which is facing a shortfall in ore supply.",
        "date": "05242017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP applies to dig new nickel mines in Western Australia "
    },
    {
        "content": "SYDNEY  May 18 Activist investor Elliott Management on Thursday said a meeting with BHP Billiton Chief Executive  Andrew Mackenzie in Barcelona had been \"constructive\".",
        "date": "05182017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-Elliott Management says Barcelona meeting with BHP CEO was \"constructive\" "
    },
    {
        "content": "* Rio uses most renewable power for energy-intensive aluminium",
        "date": "05162017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Miners increase green energy use to power their pits "
    },
    {
        "content": "SYDNEY/LONDON Activist investor Elliott Management raised the pressure for strategic changes at BHP   on Tuesday  calling for an independent review of the mining giant's petroleum business.",
        "date": "05162017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Elliott increases pressure on BHP to ditch petroleum "
    },
    {
        "content": "SYDNEY/LONDON  May 12 BHP Billiton Chief Executive Andrew Mackenzie  batting off an attack by activist funds  will tell investors in Barcelona next week that the top global miner can pump more for less out of its unloved shale assets.",
        "date": "05142017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "RPT-Wooing investors after Elliott  BHP boss to play up shale "
    },
    {
        "content": "SYDNEY  May 16 Elliott Management on Tuesday revised its proposal for an overhaul of BHP Billiton's corporate structure  calling for the mining giant to remain incorporated in Australia.",
        "date": "05162017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Elliott wants BHP to remain Australia-incorporated "
    },
    {
        "content": "SYDNEY  May 15 One of the last reminders of a merger 16 years ago that created the world's biggest mining house will be erased on Monday when BHP Billiton changes its name back to just BHP.",
        "date": "05142017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia's BHP heads back to roots  drops Billiton from its name "
    },
    {
        "content": "TORONTO/LONDON Canada's Teck Resources  Lundin Mining and HudBay Minerals are among a number of suitors that have submitted bids for BHP Billiton's Cerro Colorado copper mine in Chile  people familiar with the matter said.",
        "date": "05122017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Canadian miners among suitors for BHP's Chile copper mine: sources "
    },
    {
        "content": "SYDNEY Elliott Management is willing to back a board member of BHP Billiton   to be its chairman upon the retirement of Jac Nasser despite deep reservations about its top management  a source close to the activist shareholder said on Thursday.",
        "date": "05112017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Elliott willing to back BHP board candidate as next chairman: source "
    },
    {
        "content": "TORONTO/LONDON  May 12 Canada's Teck Resources   Lundin Mining and HudBay Minerals are among a number of suitors that have submitted bids for BHP Billiton's Cerro Colorado copper mine in Chile  people familiar with the matter said.",
        "date": "05122017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Canadian miners among suitors for BHP's Chile copper mine-sources "
    },
    {
        "content": "SYDNEY  May 11 Elliott Management is willing to back a board member of BHP Billiton  to be its chairman upon the retirement of Jac Nasser despite deep reservations about its top management  a source close to the activist shareholder said on Thursday.",
        "date": "05112017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Elliott willing to back BHP board candidate as next chairman-source "
    },
    {
        "content": "SANTIAGO Workers at BHP Billiton's Cerro Colorado copper mine in Chile will strike for 24 hours in the coming weeks to protest recent layoffs and the company's general attitude toward miners  the main union told Reuters on Wednesday.",
        "date": "05102017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Workers at BHP's Cerro Colorado mine in Chile plan 24-hour walk-off "
    },
    {
        "content": "SYDNEY/LONDON May 12 BHP Billiton Chief Executive Andrew Mackenzie  batting off an attack by activist funds  will tell investors in Barcelona next week that the top global miner can pump more for less out of its unloved shale assets.",
        "date": "05122017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Wooing investors after Elliott  BHP boss to play up shale "
    },
    {
        "content": "SANTIAGO  May 10 Workers at BHP Billiton's Cerro Colorado copper mine in Chile will strike for 24 hours in the coming weeks to protest recent layoffs and the company's general attitude toward miners  the main union told Reuters on Wednesday.",
        "date": "05102017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-Workers at BHP's Cerro Colorado mine in Chile plan 24-hour walk-off "
    },
    {
        "content": "SANTIAGO  May 10 Workers at BHP Billiton's Cerro Colorado copper mine in Chile temporarily blocked a road leading to the facility on Wednesday  protesting a series of layoffs and what it calls the company's hostile attitude  the main union told Reuters.",
        "date": "05102017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Workers briefly block access to BHP's Cerro Colorado mine in Chile "
    },
    {
        "content": "SYDNEY BHP Billiton   said on Wednesday it has started a sales process to potentially divest its Cerro Colorado copper mine in Chile  one of its smaller operations in South America.",
        "date": "05102017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP starts process to sell its Cerro Colorado copper mine "
    },
    {
        "content": "MELBOURNE  May 4 Australia warned on Thursday that a push by activist investor Elliott Management to ditch global miner BHP Billiton's dual listing may be a criminal offence and could be subject to civil penalties.",
        "date": "05032017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Australia says may penalize any move of BHP Billiton offshore "
    },
    {
        "content": "MELBOURNE  May 5 Australian fund Tribeca Investment Partners wants BHP Billiton to dump its chief executive  Andrew Mackenzie  saying he was appointed by a board that has overseen a number of bad decisions and wasted $30 billion in capital.",
        "date": "05052017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australian fund Tribeca calls for BHP Billiton CEO's removal "
    },
    {
        "content": "LONDON/VANCOUVER Mining-trading group Glencore Plc has hired the Bank of Nova Scotia to sell a portfolio of royalty assets  including one for the Antamina copper-zinc mine in Peru  four people familiar with the process have told Reuters.",
        "date": "05032017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Glencore in talks to sell Peru  other mining royalties: sources "
    },
    {
        "content": "LIMA  May 5 Peruvian miners voted on Friday to approve a national strike in June to protest \"anti-labor\" government proposals  Ricardo Juarez  secretary general of the National Federation of Miners  Metallurgists and Steelworkers  told Reuters.",
        "date": "05052017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-Peru mine workers vote to approve June nationwide strike "
    },
    {
        "content": "May 5 The following bids  mergers  acquisitions and disposals were reported by 1930 GMT on Friday:",
        "date": "05052017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "MELBOURNE Australia warned on Thursday that a push by activist investor Elliott Management to ditch global miner BHP Billiton's dual listing may be a criminal offense and was against the national interest.",
        "date": "05042017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Australia would bar move of BHP Billiton offshore - Treasurer "
    },
    {
        "content": "LONDON/VANCOUVER  May 3 Mining-trading group Glencore Plc has hired the Bank of Nova Scotia to sell a portfolio of royalty assets  including one for the Antamina copper-zinc mine in Peru  four people familiar with the process have told Reuters.",
        "date": "05032017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-Glencore in talks to sell Peru  other mining royalties -sources "
    },
    {
        "content": "May 4 Britain's FTSE 100 index is seen opening 16 points higher on Thursday  according to financial bookmakers  with futures up 0.5 percent ahead of the cash market open.",
        "date": "05042017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-UK Stocks-Factors to watch on May 4 "
    },
    {
        "content": "    MELBOURNE  May 4 London copper fell on Thursday after a big build-up in exchange stocks and as traders priced in two U.S. interest rate rises expected this year that could curb interest in dollar-denominated metals.           FUNDAMENTALS     * LME COPPER: Three-month copper on the London Metal Exchange edged down 0.2 percent to $5 589 a tonne by 0243 GMT  having earlier hit $5 567 a tonne  the weakest since April 20. Prices extended losses from the previous session when they rec",
        "date": "05042017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "METALS-London copper near 2-week low on U.S. rate rise expectations "
    },
    {
        "content": "SYDNEY  May 3 Proposals by activist investor Elliott Management to boost shareholder returns at BHP Billiton would be \"credit negative\" for the global miner  ratings agency Moody's said on Wednesday.",
        "date": "05032017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Moody's says Elliott plan would be \"credit negative\" for BHP "
    },
    {
        "content": "    May 2 Britain's FTSE 100 index is seen to open 24.6 points higher on Tuesday  according to financial bookmakers.           * ASTRAZENECA: The U.S. Food and Drug Administration on Monday granted accelerated approval to AstraZeneca Plc's immuno-oncology drug to treat a type of bladder cancer in patients whose disease progressed following chemotherapy.     * LLOYDS: British bank Lloyds Banking Group denied claims of a credit card 'time bomb' and shrugged off concerns that its practi",
        "date": "05022017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Stocks-Factors to watch on May 2 "
    },
    {
        "content": "    April 28 Britain's FTSE 100 index is seen opening up 1 point at 7 238 on Friday  according to financial bookmakers.           * BARCLAYS: British bank Barclays Plc faces shareholder revolt over whistleblower inquiry after a corporate governance firm advised shareholders not to back his re-election to the board  The Times reported on Friday. (http://bit.ly/2qdvJ63)                  * BP: BP Plc was restoring production on Thursday afternoon at two crude distillation units at its 4",
        "date": "04282017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Stocks-Factors to watch on April 28 "
    },
    {
        "content": "* BHP could face civil penalties if Australia listing scrapped",
        "date": "05042017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 3-Australia would bar move of BHP Billiton offshore - Treasurer "
    },
    {
        "content": "SYDNEY Elliott Management will meet with BHP Billiton's   Australian shareholders this week as the activist investor pushes for strategic changes at the world's biggest miner  two sources familiar with the matter said on Monday.",
        "date": "05012017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Elliott to court BHP's Australian shareholders on overhaul: sources "
    },
    {
        "content": "* Focus on U.S. oil division (Adds Elliott in U.S. unavailable for immediate comment)",
        "date": "05012017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-Elliott to court BHP's Australian shareholders on overhaul -sources "
    },
    {
        "content": "SYDNEY  April 26 BHP Billiton has put its Fayetteville shale gas assets in the United States back on the block  the world's largest miner said on Wednesday  as it seeks to focus on more lucrative opportunities in oil.",
        "date": "04262017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton puts U.S. shale gas assets on the block again "
    },
    {
        "content": "SANTIAGO  April 27 BHP Billiton is advancing with the sale of its small Cerro Colorado copper mine in Chile as a number of interested parties have emerged  although a final deal will likely take some months  the mine's union said on Thursday.",
        "date": "04272017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP advances toward sale of Chile's Cerro Colorado copper mine-union "
    },
    {
        "content": "SANTIAGO  April 27 BHP Billiton is advancing with the sale of its small Cerro Colorado copper mine in Chile and there are a number of interested parties  although finalizing the deal will likely take some months  the mine's union said on Thursday.",
        "date": "04272017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP advancing in sale of Chile's Cerro Colorado copper mine -union "
    },
    {
        "content": "LONDON/SYDNEY  April 27 Two weeks after Elliott Management's surprise assault on BHP Billiton   the fund manager's three-point demand for change is gaining little traction with investors  prompting expectations a second strike is imminent.",
        "date": "04272017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Investors eye Elliott's Plan B as BHP shake-up push falters "
    },
    {
        "content": "SANTIAGO  April 13 State copper commission Cochilco forecast on Thursday that Chile would produce slightly less than 5.6 million tonnes of copper in 2017  down from a previous forecast of 5.79 million  due largely to a strike at BHP Billiton's Escondida mine.",
        "date": "04132017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-Chile to produce less than 5.6 mln tonnes of copper in 2017 -Cochilco "
    },
    {
        "content": "SYDNEY Anglo-Australian miner BHP Billiton said on Wednesday a minor shareholder's proposal to overhaul its corporate structure and spin off its U.S. oil division was flawed and would involve costs far beyond any benefits.",
        "date": "04122017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP rejects Elliott's overhaul proposals as flawed  costly "
    },
    {
        "content": "* Elliott wants to end dual corporate structure  spin off oil",
        "date": "04122017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 4-BHP rejects Elliott's overhaul proposals as flawed  costly "
    },
    {
        "content": "* BHP vs peers over two and 15 years: http://reut.rs/2oQXpNR http://reut.rs/2oQXCR9)",
        "date": "04122017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-COLUMN-Elliott's BHP plan was doomed  but the ulterior motive isn't: Russell "
    },
    {
        "content": "April 12 Australian shares ended little changed on Wednesday as gains in financial stocks outweighed a sell-off in some telecom companies.",
        "date": "04122017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia  NZ stocks end little changed as geopolitical risks weigh "
    },
    {
        "content": "    April 12 Britain's FTSE 100 index is seen opening 6 points higher on Wednesday  according to financial bookmakers.          * BHP: Anglo-Australian miner BHP Billiton  on Wednesday dismissed a wide-ranging proposal by shareholder Elliott Advisors to overhaul its corporate strategy and sell off oil interests  saying the costs would far outweigh the benefits.     * BARCLAYS: Investors have warned that it is “entirely possible” that British regulators would force Barclays' chief exe",
        "date": "04122017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Stocks-Factors to watch on April 12 "
    },
    {
        "content": "* BHP vs peers over two and 15 years: http://reut.rs/2oQXpNR http://reut.rs/2oQXCR9)",
        "date": "04122017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-Elliott's BHP plan was doomed  but the ulterior motive isn't: Russell "
    },
    {
        "content": "April 10 Elliott Management Corp's activist campaign to shake up Anglo-Australian mining group BHP Billiton relies on tested U.S. shareholder activism strategies to deliver one of the hedge fund's biggest ever bets on a company.",
        "date": "04102017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Elliott applies U.S. activist investor tactics to BHP offensive "
    },
    {
        "content": "LONDON/SYDNEY Activist hedge fund Elliott Advisors on Tuesday urged BHP Billiton to reconsider its plan to restructure the company  saying it should be discussed with other investors.",
        "date": "04122017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Activist Elliott says BHP should reconsider overhaul plan "
    },
    {
        "content": "    April 11 Australian shares are set to open flat on Tuesday  while BHP Billiton           saw its U.S.-listed shares rise after the miner rejected a plan by activist shareholder Elliott Advisors to scrap its dual company structure.     BHP Billiton on Monday shot down a plan by activist shareholder Elliott Advisors to scrap the miner's dual company structure saying the costs would outweigh any benefits.                  The local share price index futures          dipped 2 points ",
        "date": "04102017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia shares set to open flat; NZ up "
    },
    {
        "content": "* Australian government confirms 'national interest' test (Adds investor quotes  bullet points  share price)",
        "date": "04112017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-Activist Elliott says BHP should reconsider overhaul plan "
    },
    {
        "content": "* Precious metals miners drop (ADVISORY- Follow European and UK stock markets in real time on the Reuters Live Markets blog on Eikon - see cpurl://apps.cp./cms/?pageId=livemarkets)",
        "date": "04102017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Britain's FTSE bobs along; mid  small caps reach record highs "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Elliott Advisors’ plan to unlock more value from BHP Billiton has some merits. Tidying up and then breaking up could make shareholders in the Anglo-Australian miner roughly 50 percent better off  the activist investor argues. Elliott isn’t saying anything BHP hadn’t already considered  and a full split looks a stretch – but it may prompt a helpful spring clean.",
        "date": "04102017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton activist's plan has some merits "
    },
    {
        "content": "SYDNEY Chinese iron ore futures were firmer on Tuesday  but remained under pressure from concerns demand is slowing in the world's biggest market for industrial materials.",
        "date": "04112017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Chinese iron ore futures firm  sector remains under pressure "
    },
    {
        "content": "April 11 Britain's FTSE 100 index is seen opening 9.5 points lower on Tuesday  according to financial bookmakers  with futures down 0.2 percent ahead of the cash market open.",
        "date": "04112017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-UK Stocks-Factors to watch on April 11 "
    },
    {
        "content": "LONDON  April 10 The second-biggest shareholder in mining company BHP Billiton said an overhaul of the company's structure suggested by activist hedge fund Elliott Advisors was OK in principle but may prove complex.",
        "date": "04102017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Elliott plan for BHP Billiton OK in principle  may be complex - Aberdeen "
    },
    {
        "content": "SYDNEY Any significant changes to the corporate structure of Anglo-Australian miner BHP Billiton   would need to be consistent with a \"national interest\" test under the law  the Australian government said on Tuesday.",
        "date": "04112017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia says changes to BHP Billiton corporate structure must fit national interest "
    },
    {
        "content": "* Wants to list U.S. oil arm on NYSE  revise capital return policy",
        "date": "04102017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-BHP Billiton hit by hedge fund pressure to restructure "
    },
    {
        "content": "    April 11 Britain's FTSE 100 index is seen opening 9.5 points lower on Tuesday  according to financial bookmakers.          * BHP: Elliott Management Corp's activist campaign to shake up Anglo-Australian mining group BHP Billiton  relies on tested U.S. shareholder activism strategies to deliver one of the hedge fund's biggest ever bets on a company.     * BRITAIN RETAIL: Shoppers in Britain clamped down on their spending in early 2017 as retail sales rose at the slowest pace since",
        "date": "04112017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Stocks-Factors to watch on April 11 "
    },
    {
        "content": "LONDON  April 10 London-listed shares edged higher on Monday as a rise in BHP Billiton led gains among miners  although gold-linked resource stocks fell.",
        "date": "04102017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Britain's FTSE bobs along steadily  BHP Billiton bounces "
    },
    {
        "content": "April 11 The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "04112017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "PRESS DIGEST- British Business - April 11 "
    },
    {
        "content": "SYDNEY  April 10 Hedge fund manager Elliott Advisors said on Monday it had sent a letter to BHP Billiton directors outlining a plan to unlock value by scrapping the mining giant's dual- corporate structure  demerging its oil business and rejigging its capital return policy.",
        "date": "04102017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "CORRECTED-Hedge fund wants to unify BHP's corporate structure  split off U.S. oil "
    },
    {
        "content": "Elliott Management Corp's activist campaign to shake up Anglo-Australian mining group BHP Billiton   relies on tested U.S. shareholder activism strategies to deliver one of the hedge fund's biggest ever bets on a company.",
        "date": "04112017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Elliott applies U.S. activist investor tactics to BHP offensive "
    },
    {
        "content": "SYDNEY/LONDON BHP Billiton on Monday rejected a plan by activist shareholder Elliott Advisors to scrap the miner's dual company structure  split off its oil business and return more cash to investors  saying the costs would outweigh any benefits.",
        "date": "04112017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP rebuffs Elliott's reform plan  says costs outweigh gains "
    },
    {
        "content": "SYDNEY BHP Billiton  the world's biggest shipper of coking coal  said on Wednesday it won't meet its export commitments from cyclone-struck northeast Australia  while hard running floodwaters threaten to delay repairs to rail lines.",
        "date": "04052017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP declares force majeure on cyclone-hit Australian coal exports "
    },
    {
        "content": "SYDNEY  April 5 BHP Billiton   the world's biggest shipper of coking coal  said on Wednesday it won't meet its export commitments from cyclone-struck northeast Australia  while hard running floodwaters threaten to delay repairs to rail lines.",
        "date": "04052017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "WRAPUP 2-BHP declares force majeure on cyclone-hit Australian coal exports "
    },
    {
        "content": " (Updates prices)     By Melanie Burton     MELBOURNE  April 5 London copper rallied on Wednesday as China returned from a two-day break to buy up metals following brighter global manufacturing reports  while zinc and nickel tracked a rally in steel.       \"Markets will be watching for signs of a pick up in physical activity in China now Q1 and all its credit restraints of the last couple of weeks recede \" said Kingdom Futures in a report.     \"People will look for evidence of genuin",
        "date": "04052017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "METALS-London copper rises  zinc  nickel rally as China returns "
    },
    {
        "content": "* Recommends industry collaborate on driverless mining vehicles",
        "date": "04042017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP official urges Chile copper industry to adopt sweeping changes "
    },
    {
        "content": "SANTIAGO Chile's Escondida named a new president to run the BHP Billiton-operated mine on Thursday  days after the company failed to clinch a wage deal with workers after an historically long strike.",
        "date": "03302017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Escondida names new mine head following failure of wage talks "
    },
    {
        "content": "* Fourth miner to make declaration after cyclone hits (Adds impact on coal prices  number of BHP mines)",
        "date": "04052017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP declares force majeure on Bowen Basin coal deliveries "
    },
    {
        "content": "SANTIAGO  March 30 The failure of BHP Billiton and workers at its Escondida mine  to agree on a wage deal after a long and bitter strike has stoked some concerns over the possible fate of other key contract talks at copper mines in Chile over the next year.",
        "date": "03302017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Escondida shadow looms over other Chile mine talks "
    },
    {
        "content": "SINGAPORE The rally in commodity prices last year is starting to filter through to higher spending by miners  but the nature of how they are loosening the purse strings betrays the view that companies are still cautious about the outlook.",
        "date": "03312017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Miners are spending again  but only to stand still: Russell "
    },
    {
        "content": "SINGAPORE  March 31 The rally in commodity prices last year is starting to filter through to higher spending by miners  but the nature of how they are loosening the purse strings betrays the view that companies are still cautious about the outlook.",
        "date": "03312017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-Miners are spending again  but only to stand still: Russell "
    },
    {
        "content": "March 27 Australian shares skidded on Monday after two sessions of gains as the region followed Wall Street's fall on news of the collapse of President Donald Trump's healthcare reform package.",
        "date": "03272017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia shares slumps on failure of U.S. healthcare bill; NZ up "
    },
    {
        "content": "SANTIAGO  March 23 The negotiation process between BHP Billiton and striking workers at its Escondida mine in Chile has ended unsuccessfully  Escondida mine president Marcelo Castillo said on Thursday  and the company will try to restart operations.",
        "date": "03232017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP's Escondida mine says negotiations dissolved; will return to production "
    },
    {
        "content": "ANTOFAGASTA  Chile Leaders of the striking union at BHP Billiton's Escondida mine in Chile will meet with the rank-and-file before making any additional decisions about negotiations  a union spokesman said after exiting a meeting with BHP on Wednesday.",
        "date": "03232017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Union leaders at BHP's Escondida mine to meet with workers "
    },
    {
        "content": "March 23 Britain's FTSE 100 futures were flat ahead of the cash market open on Thursday.",
        "date": "03232017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-UK Stocks-Factors to watch on March 23 "
    },
    {
        "content": "ANTOFAGASTA  Chile  March 22 Leaders of the striking union at BHP Billiton's Escondida mine in Chile will meet with the rank-and-file before making any additional decisions about negotiations  a union spokesman said after exiting a meeting with BHP on Wednesday.",
        "date": "03222017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-Union leaders at BHP's Escondida mine to meet with workers "
    },
    {
        "content": "    March 23 Britain's FTSE 100 index is seen opening up 12 points at 7 337 on Thursday  according to financial bookmakers.          * GLAXOSMITHKLINE: Britain's GlaxoSmithKline and U.S.-based Regeneron Pharmaceuticals are embarking on a joint project with UK Biobank  the world's most detailed biomedical database  to hunt for new clues linking genes and disease.         * SHELL: Royal Dutch Shell agreed to lease capacity at a large oil terminal in Panama that has been used by U.S. re",
        "date": "03232017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Stocks-Factors to watch on March 23 "
    },
    {
        "content": "SANTIAGO  March 24 The end of a historic strike at Chile's Escondida copper mine  the world's biggest  has left its owner  BHP Billiton  nursing an estimated $1 billion loss and probably in a weaker position for negotiations in a year or so  company and industry insiders said.",
        "date": "03242017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Escondida outcome seen as disaster for BHP as workers return "
    },
    {
        "content": "ANTOFAGASTA  Chile  March 21 The striking union at BHP Billiton's Escondida copper mine in Chile  the world's largest  will meet with the company on Wednesday to resume conversations  both parties said on Tuesday night.",
        "date": "03222017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton  striking Escondida union to meet Wednesday "
    },
    {
        "content": "March 23 Australian shares rose on Thursday  snapping three straight days of losses  buoyed by the materials sector and gains from miner BHP Billiton.",
        "date": "03232017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia shares up on materials stocks  snapping 3 days of losses; NZ steady "
    },
    {
        "content": "ANTOFAGASTA  Chile The strike at Chile's Escondida  the world's largest copper mine  is ending after workers decided to invoke a rarely used legal provision that allows them to extend their old contract  the union said on Thursday.",
        "date": "03242017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Escondida workers to end strike as they opt for old contract "
    },
    {
        "content": "ANTOFAGASTA  Chile/SANTIAGO The union for striking workers at BHP Billiton's Escondida in Chile  the world's largest copper mine  said after meeting with the company on Monday that it was open to further conversations that could lead to reopening negotiations.",
        "date": "03212017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Striking union at BHP's Escondida says it is open to further conversations "
    },
    {
        "content": "SANTIAGO Striking workers at BHP Billiton's Escondida copper mine in Chile  the world's largest  are blocking attempts by the company to renew operations at a key port nearby  BHP and an umbrella union said on Thursday  as the stoppage enters its sixth week.",
        "date": "03162017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Strikers at BHP's Escondida mine in Chile block restart attempt at port "
    },
    {
        "content": " (Updates prices)     By Melanie Burton     MELBOURNE  March 21 London copper prices dropped on Tuesday to their lowest in a week after unions and miner BHP Billiton said they would hold further talks that could lead to the restart of production at the world's biggest copper mine.          FUNDAMENTALS     * LME: Three-month copper on the London Metal Exchange         was down 1.1 percent at $5 817.50 a tonne  by 0116 GMT  erasing a 0.9-percent gain from the previous session. Earlier",
        "date": "03212017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "METALS-London copper hits 1-week low as talks resume over Chile strike "
    },
    {
        "content": "MELBOURNE  March 21 London copper prices fell on Tuesday on technical selling sparked by hopes unions and miner BHP Billiton would hold further talks that could lead to the restart of output at the world's biggest copper mine.",
        "date": "03212017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "METALS-London copper slips on hopes for end to Chile strike "
    },
    {
        "content": "SANTIAGO  March 20 Striking workers at BHP Billiton's Escondida mine in Chile have decided to accept an invitation by the company to restart negotiations  but the meeting will only concern the union's three key points  according to a document seen by Reuters on Monday.",
        "date": "03202017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Union at BHP Billiton's Escondida will meet with company - document "
    },
    {
        "content": "SANTIAGO  March 17 Chile's Escondida has agreed to meet with its union and made changes to its contract offer  it said on Friday  a move that could herald the first real sign of a breakthrough in a strike at the world's biggest copper mine.",
        "date": "03172017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 2-New offer suggests breakthrough in Chile's Escondida strike "
    },
    {
        "content": "ANTOFAGASTA  Chile/SANTIAGO  March 20 The union for striking workers at BHP Billiton's Escondida in Chile  the world's largest copper mine  said after meeting with the company on Monday that it was open to further conversations that could lead to reopening negotiations.",
        "date": "03212017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-Striking union at BHP's Escondida says it is open to further conversations "
    },
    {
        "content": "SANTIAGO The Escondida copper mine in Chile plans to restart operations after striking workers again rejected an invitation by controlling owner BHP Billiton to return to negotiations  an executive told reporters late Tuesday.",
        "date": "03152017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Escondida copper mine in Chile says to restart operations "
    },
    {
        "content": "SANTIAGO  March 14 The union on strike at BHP Billiton's Escondida copper mine in Chile again rejected an invitation by the company to return to negotiations as worker demands were not adequately addressed  leaving the parties without an obvious path forward.",
        "date": "03142017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Union on strike at Escondida mine in Chile rejects BHP overture "
    },
    {
        "content": "* Coming Up: Fed chair holds press briefing at 1830 GMT   (Adds detail  updates prices)",
        "date": "03152017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "METALS-London copper marks time ahead of Fed meet outcome "
    },
    {
        "content": "SANTIAGO BHP Billiton on Monday invited striking workers at its Escondida copper mine in Chile  the world's largest  to return to the negotiating table  after they rejected a similar approach on Saturday.",
        "date": "03142017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP tries again to get Chile's Escondida union back to table "
    },
    {
        "content": "    March 15 Britain's FTSE 100 index is seen opening up 13 points on Wednesday  according to financial bookmakers.             * ASTRAZENECA: AstraZeneca's ovarian cancer drug Lynparza slashed the risk of disease progression in a closely watched clinical trial  boosting its profile against rivals within the novel PARP inhibitor drug class.      * BHP BILLITON: The Escondida copper mine in Chile plans to restart operations after striking workers again rejected an invitation by contro",
        "date": "03152017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Stocks-Factors to watch on March 15 "
    },
    {
        "content": "MELBOURNE  March 15 London copper marked time on Wednesday ahead of the outcome of a U.S. Federal Reserve meeting that is expected to dictate direction in the dollar  with dissipating concerns over mine supply dragging on prices for the metal.",
        "date": "03152017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "METALS-London copper marks time ahead of Fed outcome "
    },
    {
        "content": "SANTIAGO  March 11 The striking union at BHP Billiton's Escondida copper mine in Chile  the world's largest  said on Saturday it will not accept the company's offer to return to the negotiating table  and called on BHP to clarify its negotiating positions.",
        "date": "03112017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-Union at BHP Billiton's Escondida mine rejects offer to resume talks "
    },
    {
        "content": "SANTIAGO BHP Billiton may try to restart production at the world's No.1 copper mine Escondida in Chile using temporary workers once the strike surpasses 30 days  the company told a local radio station on Wednesday.",
        "date": "03092017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP eyes temporary workers to break strike at Chile's Escondida mine "
    },
    {
        "content": "SANTIAGO  March 11 The striking union at BHP Billiton's Escondida copper mine in Chile  the world's largest  told Reuters on Saturday that it will not accept an offer from the company to return to the negotiating table  and it called on the company to clarify some of its negotiating positions.",
        "date": "03112017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Union at BHP Billiton's Escondida mine rejects offer to resume talks "
    },
    {
        "content": "SANTIAGO  March 9 BHP Billiton  may try to restart production at the world's No.1 copper mine Escondida in Chile using temporary workers once the strike surpasses 30 days  the company told a local radio station on Wednesday.",
        "date": "03092017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-BHP eyes temporary workers to break strike at Chile's Escondida mine "
    },
    {
        "content": "SANTIAGO Chile's Escondida copper mine  the largest in the world  has invited its union to resume talks as a first step towards ending a month-long strike  it said Friday.",
        "date": "03102017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP's Escondida approaches striking union  eyes new offer "
    },
    {
        "content": "SANTIAGO  March 14 The Escondida copper mine in Chile plans to restart operations after striking workers again rejected an invitation by controlling owner BHP Billiton  to return to negotiations  an executive told reporters late Tuesday.",
        "date": "03152017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-Escondida copper mine in Chile says to restart operations "
    },
    {
        "content": "SANTIAGO  March 8 BHP Billiton  may try to restart production at the world's No.1 copper mine Escondida in Chile using temporary workers once the strike surpasses 30 days  the company told a local radio station on Wednesday.",
        "date": "03082017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP eyes temporary workers to break strike at Chile's Escondida mine "
    },
    {
        "content": "SANTIAGO  March 10 Chile's Escondida copper mine  the largest in the world  has invited its union to resume talks as a first step towards ending a month-long strike  it said Friday.",
        "date": "03102017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-BHP's Escondida approaches striking union  eyes new offer "
    },
    {
        "content": "March 8 Britain's FTSE 100 futures were down 0.1 percent ahead of the cash market open on Wednesday.",
        "date": "03082017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-UK Stocks-Factors to watch on March 8 "
    },
    {
        "content": "* Directors of BHP Billiton declared interim dividend of 40 cents per ordinary share payable on 28 March 2017",
        "date": "03062017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BRIEF-BHP Billiton declares interim dividend of 40 cents per share "
    },
    {
        "content": "    March 8 Britain's FTSE 100 index is seen opening down 8.5 points on Wednesday  according to financial bookmakers.               * The blue-chip FTSE 100 closed 0.2 percent lower on Tuesday  with negative share moves seen by a string of firms following their poor earnings updates offsetting gains in some firms that advanced on the back of a weaker pound.      * BHP BILLITON: BHP Billiton  fresh from signing a joint venture to develop an oilfield off Mexico  remains on the lookout ",
        "date": "03082017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Stocks-Factors to watch on March 8 "
    },
    {
        "content": "* Iron ore price nearly doubles in a year  closing in on $100/T",
        "date": "03022017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Back from the dead? Chinese iron ore miners plot return as prices surge "
    },
    {
        "content": "SANTIAGO The three-week-long strike at Chile's Escondida  the world's biggest copper mine  turned ugly on Wednesday when a group of protesters blocked a highway  provoking confrontations with the police.",
        "date": "03012017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Escondida strike turns violent as protesters block roads  battle police "
    },
    {
        "content": "* Europe stocks flat  world shares set for 4th month of gains",
        "date": "02282017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "GLOBAL MARKETS-Trump's \"big\" spending hopes prop up stocks "
    },
    {
        "content": "LONDON  Feb 28 World stocks hovered just off all-time highs and were on course for a fourth straight month of gains on Tuesday  as investors awaited a speech by U.S. President Donald Trump for signals on infrastructure spending and tax cuts.",
        "date": "02282017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "GLOBAL MARKETS-Trump's \"big\" spending hopes nudge stocks higher "
    },
    {
        "content": "* Investors look to Trump speech for clarity on economic policy",
        "date": "02282017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "METALS-Copper slips  attention shifts to Trump speech "
    },
    {
        "content": "LAUNCESTON  Australia Anytime you hear the mantra \"this time it will be different \" it's probably best to assume the same old cycle will repeat itself.",
        "date": "02232017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Can commodity producers resist the temptations of the up cycle?: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  Feb 23 Anytime you hear the mantra \"this time it will be different \" it's probably best to assume the same old cycle will repeat itself.",
        "date": "02232017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-Can commodity producers resist the temptations of the up cycle?: Russell "
    },
    {
        "content": "SYDNEY The first attempt at an acquisition by Australia's South32 following its spinoff from BHP Billiton has raised competition concerns over control of the local coking coal market.",
        "date": "02232017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "First stab at acquisition by Australia's South32 hits competition hurdle "
    },
    {
        "content": "SANTIAGO  Feb 27 A strike at the Escondida copper mine in Chile  the world's largest  appeared far from ending on Monday as the conflict neared its third week  with the union denying a news report that it had returned to talks with mine owner BHP Billiton.",
        "date": "02272017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Escondida copper mine strike nears 3rd week; union denies new talks "
    },
    {
        "content": "SANTIAGO  Feb 22 BHP Billiton's decision this week to give up its legal right to replace striking workers at the Escondida copper mine in Chile is a move aimed at sacrificing some output to undermine the union's position  analysts said Wednesday.",
        "date": "02222017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP in for the long haul on Escondida strike as it eyes 30-day wait "
    },
    {
        "content": "SANTIAGO A government-mediated meeting between BHP Billiton and striking workers at its Escondida copper mine in Chile has failed  and workers will head back to their encampment without any future dialogue planned  a union spokesman said on Monday.",
        "date": "02202017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Government-mediated talks between Escondida union  BHP fail "
    },
    {
        "content": "SYDNEY Mining giant BHP Billiton   rewarded shareholders with a bigger than expected payout on Tuesday  reflecting a growing confidence across the sector as rising commodity prices delivered a cash windfall. | Video ",
        "date": "02212017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton boosts payout on commodities surge "
    },
    {
        "content": "SANTIAGO  Feb 20 A government-mediated meeting between BHP Billiton and striking workers at its Escondida copper mine in Chile has failed  and workers will head back to their encampment without any future dialogue planned  a union spokesman said on Monday.",
        "date": "02202017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-Government-mediated talks between Escondida union  BHP fail "
    },
    {
        "content": "SANTIAGO  Feb 21 Chile's Escondida copper mine owned by BHP Billiton said on Tuesday it would not replace striking workers for at least 30 days into a strike to show its openness to dialogue.",
        "date": "02212017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Escondida says will wait 30 days to replace striking workers "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Mining's traumatic downturn is still fresh in the memories of BHP Billiton and Anglo American  despite their improved performance in 2016. Rising commodities prices and aggressive cost-cutting helped both companies to boost earnings and cut debt. But another investment splurge or borrowing binge is unlikely. Financial prudence remains the priority.",
        "date": "02212017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Mining giants require more financial medicine "
    },
    {
        "content": "Feb 22 The Australian stock market was steady on Wednesday  with gains dented by slips in Commonwealth Bank of Australia and BHP Billiton.",
        "date": "02222017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Aussie shares flat  Commonwealth Bank down 2.7 pct; NZ slips 0.7 pct "
    },
    {
        "content": "SANTIAGO  Feb 20 The union representing striking workers at Chilean copper mine Escondida and mine owner BHP Billiton Plc  sat down to talk on Monday afternoon after the government called a meeting in hopes of ending the 12-day-old strike.",
        "date": "02202017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-Escondida copper miners and BHP meet as strike drags on "
    },
    {
        "content": "* Warns iron ore price could face pressure   (Adds ceo  analysts' comments  details)",
        "date": "02212017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-BHP Billiton boosts payout on commodities surge "
    },
    {
        "content": "    Feb 21 Britain's FTSE 100 index is seen opening down 2 points at 7298 on Tuesday  according to financial bookmakers.           * The blue-chip FTSE 100 index closed flat in percentage terms at 7 299.86 points after climbing to an intra-day high of 7 329.56  the highest level since the middle of January.     * BHP: Mining giant BHP Billiton rewarded shareholders with a bigger-than-expected dividend on Tuesday  signalling its growing confidence amid a resurgence in commodity prices",
        "date": "02212017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Stocks-Factors to watch on Feb. 21 "
    },
    {
        "content": "SYDNEY  Feb 21 Mining giant BHP Billiton   rewarded shareholders with a bigger than expected dividend on Tuesday  signalling its growing confidence amid a resurgence in commodity prices.",
        "date": "02212017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton boosts interim dividend as iron ore prices soar "
    },
    {
        "content": "* BHP customer \"not too worried\" over strike given ample stocks",
        "date": "02152017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "RPT-REFILE-Crisis  what crisis? Asia copper buyers shrug off major mine strikes "
    },
    {
        "content": "* BHP customer \"not too worried\" over strike given ample stocks",
        "date": "02152017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "REFILE-Crisis  what crisis? Asia copper buyers shrug off major mine strikes "
    },
    {
        "content": "SANTIAGO Global miner BHP Billiton has declared force majeure on copper shipments from its Escondida mine in Chile  the world's largest copper mine  as a workers' strike entered its second day  a spokesman told Reuters on Friday. | Video ",
        "date": "02112017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP says it declares force majeure at Chile's Escondida copper mine "
    },
    {
        "content": "ANTOFAGASTA  Chile  Feb 10 BHP Billiton's   Escondida in Chile  the world's largest copper mine  will not be able to meet its contractual obligations on metals shipments after a 2-day-old workers' strike brought production to a standstill  a company spokesman said on Friday.",
        "date": "02102017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP's Escondida copper mine declares force majeure on Chile strike "
    },
    {
        "content": "MILAN  Feb 13 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "02132017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "European shares seen extending winning streak with eyes on Stada  BHP. For more see the LiveMarkets blog "
    },
    {
        "content": "ANTOFAGASTA  Chile  Feb 10 Striking workers at BHP Billiton's  Escondida copper mine in Chile girded for a prolonged stand-off with the company on Friday  as the work stoppage at the world's largest copper mine entered its second day and copper prices jumped on talk of BHP declaring force majeure.",
        "date": "02102017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Strike at BHP's Escondida copper mine in Chile enters second day "
    },
    {
        "content": "ANTOFAGASTA  Chile  Feb 10 A fire in the workers' barracks of BHP Billiton's  Escondida copper mine in Chile  the world's largest  left three workers injured early Friday  the company said.",
        "date": "02102017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Fire at BHP's Escondida mine in Chile injures three "
    },
    {
        "content": "Feb 13 Britain's FTSE 100 index is seen opening 17 points higher at 7 275 on Monday  according to financial bookmakers  with futures up 0.15 percent ahead of the cash market open.",
        "date": "02132017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-UK Stocks-Factors to watch on Feb 13 "
    },
    {
        "content": "ANTOFAGASTA  Chile Workers at BHP Billiton's Escondida copper mine in Chile  the world's largest  walked off the job on Thursday in a strike that threatens to disrupt the international supply of the widely used metal.",
        "date": "02092017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Workers strike at BHP's Escondida copper mine in Chile "
    },
    {
        "content": "LONDON  Feb 9 The copper market is facing the imminent prospect of the simultaneous closure of the world's two largest copper mines.",
        "date": "02102017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-COLUMN-How vulnerable is copper to supply disruption? Andy Home "
    },
    {
        "content": "Feb 13 Britain's FTSE 100 index is seen opening up 17 points at 7 275 on Monday  according to financial bookmakers.           * The commodity-heavy UK blue-chip FTSE 100 index ended 0.4 percent higher at 7 258.75 points on Friday  after hitting an intra-day peak of 7 274.80  the highest since Jan. 17 as a rally in metals prices on soothing Chinese data and supply concerns boosted shares in basic resources companies.      * RBS: A group of senior businessmen are among investors seekin",
        "date": "02132017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Stocks-Factors to watch on Feb 13 "
    },
    {
        "content": "ANTOFAGASTA  Chile  Feb 9 Workers at BHP Billiton's  Escondida copper mine in Chile  the world's largest  walked off the job on Thursday in a strike that threatens to disrupt the international supply of the widely used metal.",
        "date": "02092017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 4-Workers strike at BHP's Escondida copper mine in Chile "
    },
    {
        "content": "SANTIAGO  Feb 12 More than 300 people wearing hoods vandalized property at the world's biggest copper mine  BHP Billiton's  Escondida in Chile  and forced contract workers to stop work during an ongoing strike  management said on Sunday.",
        "date": "02132017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Hooded vandals attack Chile's Escondida mine during strike "
    },
    {
        "content": "ANTOFAGASTA  Chile  Feb 8 BHP Billiton Plc   has begun halting operations at its Escondida copper mine in northern Chile  the world's largest  ahead of a planned strike on Thursday  a union leader told Reuters on Wednesday.",
        "date": "02082017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP begins halting operations at Chilean copper mine -union "
    },
    {
        "content": "SANTIAGO  Feb 7 Global miner BHP Billiton  said on Tuesday that it plans to halt production at its Chile-based Escondida copper mine  the world's biggest  after unionized workers initiate a strike scheduled to begin on Thursday.",
        "date": "02072017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP says will not produce copper at Escondida during planned strike "
    },
    {
        "content": "ANTOFAGASTA  Chile  Feb 9 Workers gearing up for what could be a prolonged strike at the world's leading copper mine  BHP Billiton's Escondida  are stockpiling rations and supplies to survive the searing sun and bone-chilling nights of Chile's northern high-desert.",
        "date": "02092017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Chile Escondida BHP copper mine workers gird for long battle "
    },
    {
        "content": "* Revenue of $391.9 mln vs est $358.3 mln   (Updates shares; adds outlook)",
        "date": "02062017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 3-Diamond Offshore sees recovery when oil \"well over $60\" "
    },
    {
        "content": "SINGAPORE  Feb 8 Loading of cargoes from Australia's North West Shelf (NWS) liquefied natural gas (LNG) and condensate project has been halted due to adverse weather  traders with direct knowledge of the matter said on Wednesday.",
        "date": "02082017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "REFILE-UPDATE 1-Cargo loadings at Australia's North West Shelf project halted - sources "
    },
    {
        "content": "SANTIAGO  Feb 7 The main union at BHP Billiton Plc's  Escondida copper mine in Chile  the world's largest  said a contract agreement was unlikely unless the company changes its negotiating stance on benefits.",
        "date": "02072017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Workers at Chilean Escondida mine doubtful about labor talks "
    },
    {
        "content": "LONDON  Feb 9 The copper market is facing the imminent prospect of the simultaneous closure of the world's two largest copper mines.",
        "date": "02092017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-How vulnerable is copper to supply disruption? Andy Home "
    },
    {
        "content": "Feb 6 Australian shares slipped on Monday  with financial stock gains on U.S. President Donald Trump's order to review banking regulations offset by losses in the basic materials sector.",
        "date": "02062017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia shares slip as materials sector falters  NZ on holiday "
    },
    {
        "content": "Feb 8 Financial firms pushed Australian shares higher on Wednesday  in the wake of gains on Wall Street  as the market remained positive following the central bank's upbeat tone on growth.",
        "date": "02082017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia shares advance  led by gains from financials; NZ soft "
    },
    {
        "content": "* Philippine move may see loss of 50 000 T nickel-Macquarie   (Recasts  adds mediation at Escondida  closing prices)",
        "date": "02032017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "METALS-Copper near two-week low on mine wage talks  China rate hike "
    },
    {
        "content": "* BHP says wants to keep door open to talk   (Adds comment from BHP Billiton)",
        "date": "02022017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 3-Chilean workers vote to strike at world no.1 copper mine "
    },
    {
        "content": "MELBOURNE BHP Billiton on Thursday approved its $2.2 billion share of investment for the second phase of the Mad Dog oilfield in the Gulf of Mexico  as expected.",
        "date": "02092017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton approves $2.2 billion for U.S. Mad Dog oil project "
    },
    {
        "content": "SANTIAGO  Feb 7 Global miner BHP Billiton  said on Tuesday that it plans to halt production at its Chile-based Escondida copper mine  the world's biggest  after unionized workers initiate a strike scheduled to begin on Thursday.",
        "date": "02082017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-BHP says will not produce copper at Escondida during planned strike "
    },
    {
        "content": "SANTIAGO  Feb 3 Workers at BHP Billiton's   Escondida copper mine in Chile  the world's biggest  prepared to re-enter dialogue with the company on Friday  after BHP solicited government mediation in a bid to avoid a strike.",
        "date": "02032017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton requests govt mediation with workers at Escondida mine "
    },
    {
        "content": "MELBOURNE  Feb 9 BHP Billiton  on Thursday approved its $2.2 billion share of investment for the second phase of the Mad Dog oilfield in the Gulf of Mexico  as expected.",
        "date": "02092017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton approves $2.2 bln for U.S. Mad Dog oil project "
    },
    {
        "content": "* BHP allocates iron ore cargo to shipper under new online system",
        "date": "01262017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP launches online freight platform to sink shipping costs "
    },
    {
        "content": "SYDNEY BHP Billiton was on track to meet its iron ore production guidance for fiscal 2017 after reporting a strong second quarter for its most profitable business on Wednesday.",
        "date": "01242017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP second-quarter iron ore output up nine percent  year guidance intact "
    },
    {
        "content": "* Aim is to consolidate and settle separate claims -companies",
        "date": "01192017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 2-BHP  Vale  Samarco set June 30 deadline to resolve multi-billion dollar claims "
    },
    {
        "content": "SYDNEY Woodside Petroleum Chief Executive Peter Coleman said there's little need for more mergers and acquisitions by Australia's biggest independent oil and gas producer as it works on developing a handful of new projects at home and abroad.",
        "date": "01192017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Woodside CEO sees no need for M&A  plenty of growth in pipeline "
    },
    {
        "content": "SYDNEY  Jan 19 Woodside Petroleum Chief Executive Peter Coleman said there's little need for more mergers and acquisitions by Australia's biggest independent oil and gas producer as it works on developing a handful of new projects at home and abroad.",
        "date": "01192017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-Woodside CEO sees no need for M&A  plenty of growth in pipeline "
    },
    {
        "content": "BRASILIA  Jan 11 A Brazilian judge has extended the deadline for Samarco and its shareholders Vale SA  and BHP Billiton to make a 1.2 billion reais ($375.41 million) payment related to a dam spill to Jan 19  a statement from the court in the state of the Minas Gerais said on Wednesday.",
        "date": "01112017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Brazil court extends deadline for Samarco to pay dam spill guarantee "
    },
    {
        "content": "* Talks include BHP's U.S. investments   (Adds BHP comment  investment details)",
        "date": "01102017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP Billiton says chairman  CEO hold productive talks with Trump "
    },
    {
        "content": "Jan 10 Britain's FTSE 100 index is expected to open down 4 points at 7 233 on Tuesday  according to financial bookmakers  with futures  down 0.1 percent ahead of the cash market open.",
        "date": "01102017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-UK Stocks-Factors to watch on Jan 10 "
    },
    {
        "content": "Jan 10 Britain's FTSE 100 index is expected to open down 4 points at 7 233 on Tuesday  according to financial bookmakers.          * The UK blue chip index touched a new record high of 7 243.76 points  then settled at 7 237.77 points  up 0.4 percent  for the close on Monday. It chalked up its tenth straight daily session of gains pushed up by rallying resource stocks and a weak sterling.      * TESCO: Tesco  Britain's biggest retailer  has proposed a shake-up of its distribution netw",
        "date": "01102017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Stocks-Factors to watch on Jan 10 "
    },
    {
        "content": "BRASILIA  Jan 9 Brazilian miner Samarco and its shareholders Vale SA and BHP Billiton   have requested to extend until Jan. 19 a deadline to pay 1.2 billion reais ($375.39 million) in guarantees related to the collapse of a tailings dam in 2015  Vale said in a statement on Monday.",
        "date": "01092017",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Brazil's Samarco requests extension for dam disaster guarantee "
    },
    {
        "content": "SANTIAGO Workers at BHP Billiton-owned Escondida  the world's biggest copper mine  could go on strike in February if collective contract talks with the company are unsuccessful  union spokesman Carlos Allende told Reuters on Wednesday.",
        "date": "01042017",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Tough labor talks could lead to strike at Escondida copper mine: union "
    },
    {
        "content": "MEXICO CITY Fresh off a historic tie-up with Australia's BHP Billiton Plc  Pemex [PEMX.UL] is aiming for more than five additional joint ventures with other major producers over the next two years  the chief executive officer of the Mexican state oil firm said on Monday.",
        "date": "12062016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Mexico's Pemex sees more tie-ups after first joint venture "
    },
    {
        "content": "MEXICO CITY  Nov 28 Mexico's oil regulator announced on Monday a final list of 17 oil companies representing a dozen countries that have pre-qualified to bid on the country's first-ever deep water oil auctions  set for Dec. 5.",
        "date": "11282016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "CORRECTED-Mexico certifies bidders for December deep water oil auctions "
    },
    {
        "content": "LAUNCESTON  Australia Almost unnoticed  Rio Tinto Chief Executive Jean Sebastien Jacques has ushered the China iron ore elephant out of the room.",
        "date": "11282016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Rio Tinto disposes of iron ore elephant  signals flexibility: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  Nov 28 Almost unnoticed  Rio Tinto Chief Executive Jean Sebastien Jacques has ushered the China iron ore elephant out of the room.",
        "date": "11282016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-COLUMN-Rio Tinto disposes of iron ore elephant  signals flexibility: Russell "
    },
    {
        "content": "* Skirts questions on Guinea Simandou investigation   (Adds executive comment on Trump  response on Simandou)",
        "date": "11252016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-Rio Tinto sees potential demand boost  less red tape in Trump presidency "
    },
    {
        "content": "MELBOURNE The North West Shelf joint venture  Australia's biggest oil and gas operation  cut royalties it owed by claiming more than A$5 billion ($3.7 billion) in deductions  some of which weren't valid  over the 18 months to December 2015  a government watchdog said on Monday.",
        "date": "11282016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia watchdog says North West Shelf gas venture underpaying royalties "
    },
    {
        "content": "* NW Shelf says royalty compliance is \"robust\"   (Adds maximum underpayment  NW Shelf comments)",
        "date": "11282016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-Australia watchdog says North West Shelf gas venture underpaying royalties "
    },
    {
        "content": "MELBOURNE  Nov 28 The North West Shelf joint venture  Australia's biggest oil and gas operation  cut royalties it owed by claiming more than A$5 billion ($3.7 billion) in deductions  some of which weren't valid  over the 18 months to December 2015  a government watchdog said on Monday.",
        "date": "11282016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "CORRECTED-Australian watchdog says North West Shelf gas jv underpaying royalties "
    },
    {
        "content": "SYDNEY BHP Billiton and Vale Sa have each approved $181 million to fund remediation and compensation programs at the Samarco iron ore joint venture in Brazil following a deadly mine disaster in November 2015.",
        "date": "11242016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Vale to fund  extend credit over Samarco disaster "
    },
    {
        "content": "LAUNCESTON  Australia  Nov 28 Almost unnoticed  Rio Tinto Chief Executive Jean Sebastien Jacques has ushered the China iron ore elephant out of the room.",
        "date": "11282016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-Rio Tinto disposes of iron ore elephant  signals flexibility: Russell "
    },
    {
        "content": "SYDNEY  Nov 25 BHP Billiton and Vale Sa  have each approved $181 million to fund remediation and compensation programs at the Samarco iron ore joint venture in Brazil following a deadly mine disaster in November 2015.",
        "date": "11242016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP Vale to fund  extend credit over Samarco disaster "
    },
    {
        "content": "SYDNEY  Nov 25 BHP Billiton   said on Friday it had approved $181 million to fund remediation and compensation programs at its Samarco iron ore joint venture in Brazil following a deadly dam burst in November 2015.",
        "date": "11242016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP approves $181 mln in compensation over Samarco disaster "
    },
    {
        "content": "LONDON  Nov 24 Australia's South32  the mining company spun off from BHP Billiton   in 2015  will avoid buying thermal coal because of uncertainties over demand linked to climate concerns  the company said on Thursday.",
        "date": "11242016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Miner South 32 to avoid thermal coal  open to other deals "
    },
    {
        "content": "Australian shares are set to open firmer on Tuesday  tracking Wall Street  on rallies in metals and oil prices  with top miner BHP Billiton poised to jump more than 1.5 percent.     Oil prices soared 4 percent to a three-week high on Monday  buoyed by growing conviction that major oil producing countries would agree to limit output next week.      Gains were also seen in metals  led by copper  on expectations of improving appetite from top consumer China and higher demand from the U.S. market as",
        "date": "11212016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Australian shares poised to rise as oil  metals rally; NZ up "
    },
    {
        "content": "Nov 18 Three  the smallest of Britain's four mobile phone networks  said late on Thursday hackers had accessed its customer upgrade database after using employee logins.",
        "date": "11182016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 4-Cyber hack of UK's Three puts customer information at risk "
    },
    {
        "content": "BRASILIA  Nov 18 A federal judge in Brazil has accepted the criminal charges brought by prosecutors against four companies and 22 employees for a burst tailings dam at the Samarco mine last November  the G1 news site reported on Friday.",
        "date": "11182016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Brazilian judge accepts criminal charges for Samarco dam disaster -G1 "
    },
    {
        "content": "SYDNEY BHP Billiton will run its iron ore mines full speed through the year-end amid a surge in global prices for the commodity rather than suspending some Australia operations like rival Rio Tinto  the company said on Wednesday.",
        "date": "11162016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP to keep iron ore mines running despite Rio's Christmas suspension "
    },
    {
        "content": "RIO DE JANEIRO BHP Billiton's president of mining in the Americas on Thursday said \"complex\" negotiations continue with partner Vale SA and other stakeholders to restart operations next year at Samarco  the iron ore mine in Brazil where a 2015 dam burst killed 19 people and caused massive environmental damage.",
        "date": "11102016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP 'confident' of 2017 Samarco restart despite tough talks "
    },
    {
        "content": "SAO PAULO  Nov 6 Brazilian President Michel Temer will not push to replace the head of the nation's largest mining company  Vale SA  until the current executive's mandate expires in May  a local newspaper reported.",
        "date": "11062016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Brazil's president delays pushing for new Vale CEO until next year -report "
    },
    {
        "content": "BRASILIA  Oct 27 Samarco  the troubled joint venture between Vale SA and BHP Billiton  will need to use infrastructure from Vale's neighboring mines if it wants to secure a long-term future  Vale's chief executive said on Thursday.",
        "date": "10272016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-Brazil's Vale says Samarco future reliant on its infrastructure "
    },
    {
        "content": "* Minerals America head to oversee non-operated joint ventures",
        "date": "10272016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP Billiton's Samarco disaster head to leave company in March "
    },
    {
        "content": "* Chief commercial officer dean dalla valle will leave the company at the end of march 2017",
        "date": "10272016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BRIEF-BHP Billiton's Samarco disaster coordinator to leave company in March "
    },
    {
        "content": "* CEO says aspirational goal for \"gender balance\" at all levels",
        "date": "10202016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "RPT-UPDATE 2-BHP chairman steps down after Samarco delayed retirement "
    },
    {
        "content": "RIO DE JANEIRO  Oct 20 Brazilian prosecutors said on Thursday they charged 22 people  21 of them for qualified homicide  for their roles in the collapse of a tailings dam at the Samarco iron ore mine last November that killed 19 people.",
        "date": "10202016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "CORRECTED-Brazil prosecutors charge Samarco employees with homicide for dam spill "
    },
    {
        "content": "* Says notes statement by federal prosecutors office that it has filed charges before federal courts of Ponte Nova  Minas Gerais against co's Brazil unit",
        "date": "10202016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BRIEF-BHP rejects Brazilian prosecutors' charges against company "
    },
    {
        "content": "RIO DE JANEIRO  Oct 20 Brazilian prosecutors said on Thursday they charged 26 people  21 of them for qualified homicide  for their roles in the collapse of a tailings dam at the Samarco iron ore mine last November that killed 19 people.",
        "date": "10202016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Brazil prosecutors charge Samarco employees with homicide for dam spill "
    },
    {
        "content": "LONDON  Oct 20 BHP Billiton   Chairman Jac Nasser will not seek re-election at next year's annual general meeting (AGM)  he announced on Thursday.",
        "date": "10202016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "REFILE-BHP Billiton chairman says will not stand for re-election "
    },
    {
        "content": "LONDON  Oct 17 The head of major miner BHP Billiton  says what Britain needs is a \"hard-headed Brexit\"  which would maintain trade relations with the European Union and place the focus on minimising bureaucracy as much as on keeping tariffs low.",
        "date": "10172016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP boss calls for 'hard-headed Brexit' with little bureaucracy "
    },
    {
        "content": "SYDNEY Not many small exploration companies would knock back a multi-million-dollar financing offer by BHP Billiton  the world's biggest mining company  but Nick Mather of Ecuador-focused SolGold Plc said he has better offers.    Interest in Solgold's Cascabel copper and gold project has already led to a $33 million deal with investment bank Maxit and Australian gold miner Newcrest.",
        "date": "10112016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Minnow Solgold rejects BHP offer; sets sights on big copper find "
    },
    {
        "content": "Oct 10 Gold miner SolGold Plc said on Monday that global miner BHP Billiton Plc's   offer to buy a stake in the company to gain exposure to its Cascabel project in Equador was not in its best interest.",
        "date": "10102016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Gold miner SolGold says BHP Billiton offer not in its best interest "
    },
    {
        "content": "MELBOURNE With the Paris climate accord set to come into force within weeks  top global miner BHP Billiton said it still expects its copper  oil and gas  iron ore and coal businesses to thrive in a world with lower carbon emissions.",
        "date": "10102016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton expects to thrive in a lower carbon emissions world "
    },
    {
        "content": "* An offer by BHP to acquire a 10 pct interest in SolGold for $30 mln which implies a share issue price for SolGold of approximately $0.22",
        "date": "10102016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BRIEF-SolGold says received $30 mln offer from BHP for 10 pct stake in co "
    },
    {
        "content": "SYDNEY  Oct 4 Mining giants Rio Tinto   and BHP Billiton  on Tuesday rebuffed proposals to replace one of the taxes they must pay on their iron ore businesses in the state of Western Australia with annual upfront payments.",
        "date": "10042016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "REFILE-BHP  Rio rebuff proposed iron ore tax change in Australian state "
    },
    {
        "content": "Oct 4 Britain's FTSE 100 index is seen opening down 4 to 8 points  or 0.1 percent on Tuesday  according to financial bookmakers  with futures down 0.09 percent ahead of the cash market open.",
        "date": "10042016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-UK Stocks-Factors to watch on Oct 4 "
    },
    {
        "content": "SYDNEY A power outage in South Australia has halted more than 300 000 tonnes of annual copper production capacity and knocked out the Australian state's only lead smelter  producers said on Thursday.",
        "date": "09292016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP  Oz Minerals cut copper output after Australia power outage "
    },
    {
        "content": "* Coming up: U.S. pending home sales at 1400 GMT   (Adds BHP Olympic Dam copper mine shut  updates prices)",
        "date": "09292016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "METALS-Lead rises to 16-month high on tighter supply  nickel slips "
    },
    {
        "content": "SYDNEY  Sept 21 BHP Billiton   Chief Executive Andrew Mackenzie's annual salary was cut in half following the Samarco dam disaster in Brazil that claimed 19 lives and caused widespread environmental damage  the global miner said.",
        "date": "09212016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Salary of BHP CEO cut in half after Brazil mine disaster "
    },
    {
        "content": "SAO PAOLO/RIO DE JANEIRO  Sept 8 Almost a year after a deadly dam spill at the Samarco mine  owned by BHP Billiton and Vale  there is still no date for restarting operations  complicating attempts to restructure Samarco's debt and increasing the possibility the miner may be allowed to run out of money.",
        "date": "09082016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Uncertainty over Brazil Samarco mine hinders restructuring  firm at risk "
    },
    {
        "content": "LONDON  Sept 7 The backgrounds of the leaders of the world's top mining companies illustrate the choice facing investors  with BHP Billiton's chief executive having worked in the oil industry and Rio Tinto's new boss more focused on copper.",
        "date": "09072016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Rio versus BHP boils down to investors' choice of commodity "
    },
    {
        "content": "MELBOURNE  Sept 5 Woodside Petroleum  has agreed to buy half of BHP Billiton's  stake in the Scarborough area gas fields off Western Australia for $400 million  in a move that could help speed a decision to develop the long delayed project.",
        "date": "09052016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Woodside buys half of BHP's stake in Australian gas fields for $400 mln "
    },
    {
        "content": "BELO HORIZONTE  Brazil Federal prosecutors investigating the deadly dam spill in November at the Samarco iron ore mine  owned by Vale SA and BHP Billiton  will decide in coming weeks whether to charge the company and executives  a prosecutor in the case said on Tuesday.",
        "date": "08302016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Prosecutors to decide in September on Samarco dam spill charges "
    },
    {
        "content": "Aug 30 Britain's FTSE 100 index is expected to open 13-18 points  or 0.2-0.3 percent  lower on Tuesday  according to financial bookmakers  with futures trading down 0.3 percent ahead of the cash market open.",
        "date": "08302016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-UK Stocks-Factors to watch on Aug 30 "
    },
    {
        "content": "Aug 31 Britain's FTSE 100 index is seen opening down 13 points  or 0.19 percent  on Wednesday  according to financial bookmakers.        * The UK blue chip index closed 0.25 percent lower on Tuesday at 6 820.79 points  as a drop in major mining and housebuilding stocks weighed on the market.      * ARM: Shareholders in British technology company ARM approved its sale to Japan's SoftBank on Tuesday  marking the end of independence for the chip designer that powered the smartphone revo",
        "date": "08312016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Stocks-Factors to watch on Aug 31 "
    },
    {
        "content": "Aug 30 Britain's FTSE 100 index is expected to open lower  according to financial bookmakers.           * The UK blue chip index closed up 21.15 points  or 0.3 percent on Friday at 6 838.05  after Federal Reserve Chair Janet Yellen indicated that a U.S. interest rate rise could come later this year  a relief for investors after last week's hawkish comments from some Fed policymakers.      * BHP BILLITON: The deadly collapse of a tailings dam last November at the Samarco mine  owned b",
        "date": "08302016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Stocks-Factors to watch on Aug 30 "
    },
    {
        "content": "MELBOURNE The U.S. Securities and Exchange Commission paid a BHP Billiton   insider $3.75 million for detailed information in an investigation into alleged bribery of Asian and African officials  the Australian Financial Review reported on Monday.",
        "date": "08282016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "U.S. SEC paid $3.75 million to BHP Billiton whistleblower: report "
    },
    {
        "content": "SINGAPORE  Aug 26 Asian spot liquefied natural gas (LNG) prices held steady in the absence of any decisive indicators  with a lone deal being done at a higher-than-expected level in an amply supplied market.",
        "date": "08262016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "GLOBAL LNG-Asian prices steady as spot cargo fetches high rate amid glut "
    },
    {
        "content": "LONDON  Aug 18 Copper is underperforming every other major base metal so far this year.",
        "date": "08182016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-Copper - a tale of two South American producers: Andy Home "
    },
    {
        "content": "LAUNCESTON  Australia (The opinions expressed here are those of the author  a columnist for Reuters.)",
        "date": "08172016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Column: Is being a boring cash cow going to be enough for BHP? - Russell "
    },
    {
        "content": "MELBOURNE/LONDON The world's biggest miner BHP Billiton on Tuesday said deep cost cuts and a steady elimination of oversupply will bolster its business following a record loss caused by a bad bet on shale and a dam disaster in Brazil. | Video ",
        "date": "08162016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton books record loss  says commodity price 'free fall' over "
    },
    {
        "content": "* BHP sees rising cash flows  confident in long-term outlook   (Adds CEO comment  analysis  detail)",
        "date": "08162016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 3-BHP Billiton books record loss  says commodity price 'free fall' over "
    },
    {
        "content": "LONDON  Aug 16 European shares pulled back from 7-week highs on Tuesday  weighed down by industrial stocks  after Swiss firm Schindler lowered its outlook for 2016.",
        "date": "08162016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "European shares pulled back from 7-week highs by industrials "
    },
    {
        "content": "LAUNCESTON  Australia Here we go again! Another political attempt rooted more in populism than economics to grab more tax revenue from Australia's top iron ore miners  Rio Tinto and BHP Billiton.",
        "date": "08112016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "New iron ore tax on Rio  BHP unlikely  but issue is back: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  Aug 11 Here we go again! Another political attempt rooted more in populism than economics to grab more tax revenue from Australia's top iron ore miners  Rio Tinto and BHP Billiton.",
        "date": "08112016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-COLUMN-New iron ore tax on Rio  BHP unlikely  but issue is back: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  Aug 11 Here we go again! Another political attempt rooted more in populism than economics to grab more tax revenue from Australia's top iron ore miners  Rio Tinto and BHP Billiton.",
        "date": "08112016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-New iron ore tax on Rio  BHP unlikely  but issue is back: Russell "
    },
    {
        "content": "SYDNEY  July 27 A leading mining group in Australia on Wednesday denied allegations by Chinese iron ore miners that Australian counterparts were dumping ore at cheap prices to push them out.",
        "date": "07272016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australian mining group denies iron ore being dumped in China "
    },
    {
        "content": "SYDNEY/LONDON BHP Billiton and Anglo American have  reported setbacks in their iron ore production  but analysts said the contraction was nowhere near enough to dent the massive global supply glut that has driven prices to record lows.",
        "date": "07202016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP  Anglo see only slight setbacks for iron ore production "
    },
    {
        "content": "RIO DE JANEIRO  July 20 A Brazilian state law to ban upstream tailings dams  the design used for the dam that collapsed at the Samarco mine last November  could be passed this year  an environmental official for the state of Minas Gerais told Reuters on Wednesday.",
        "date": "07202016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Brazil state law to ban dam used at Samarco mine could pass this year "
    },
    {
        "content": "* Less petroleum output this year   (Updates with Anglo outlook)",
        "date": "07202016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-BHP  Anglo see only slight setbacks for iron ore production "
    },
    {
        "content": "SYDNEY  July 20 BHP Billiton   said on Wednesday it fell three million tonnes short of its iron ore production guidance for fiscal 2016 due to its Samarco disaster in Brazil.",
        "date": "07192016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP misses full-yr iron ore guidance by 3 mln/t "
    },
    {
        "content": "SYDNEY  June 27 Australian mining giant BHP Billiton said on Monday it will spend $900 million  or 18 percent of its capital budget  in exploration next financial year.",
        "date": "06262016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton to spend $900m on copper and petroleum exploration "
    },
    {
        "content": "SYDNEY BHP Billiton plans to lift exploration spending by 29 percent next year  allocating nearly all its $900 million budget to finding oil and copper  as big miners bet on a narrow pick of commodities to drive future growth.",
        "date": "06272016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP boosts exploration spend as focus narrows to oil  copper "
    },
    {
        "content": "* Says investing more in exploration while others cut   (Recasts  adds analyst comments  detail)",
        "date": "06272016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-BHP boosts exploration spend as focus narrows to oil  copper "
    },
    {
        "content": "SYDNEY  June 23 Australian mining giant BHP Billiton's  part-owned Newcastle Coal Infrastructure Group pulled a $500 million debt refinancing plan at one of Australia's biggest coal export terminals after banks were reluctant to lend to the sector  said three sources with knowledge of the process.",
        "date": "06242016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "CORRECTED-BHP's part-owned infrastructure group pulls coal terminal financing plan "
    },
    {
        "content": "SYDNEY Australian mining giant BHP Billiton pulled a $500 million debt refinancing plan at one of Australia's biggest coal export terminals after banks were reluctant to lend to the sector  said three sources with knowledge of the process.",
        "date": "06232016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Lenders turn away BHP port debt plan  wary of coal "
    },
    {
        "content": "MELBOURNE Top global miner BHP Billiton outlined plans to boost coal output by 8 percent over the next three years while slashing costs  and said it would only consider premium  lowest-cost assets for any acquisitions.",
        "date": "06212016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton steps up coal output  slices costs  eyes acquisitions "
    },
    {
        "content": "MELBOURNE  June 21 Top global miner BHP Billiton   expects to boost its coal output by 8 percent over the three years to June 2018  and plans to cut costs by 16 percent over the next year to boost profits in a tough market.",
        "date": "06202016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton steps up coking coal output  slices costs "
    },
    {
        "content": "SAO PAULO Brazilian mining company Samarco Mineração SA and owners Vale SA  and BHP Billiton Plc  have hired banks to sound out creditors on a potential renegotiation of $3.8 billion in debt  after a deadly dam spill led to the shutdown of a key mine  a source with direct knowledge of the plan said on Monday.",
        "date": "06202016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Brazil's Samarco  owners hire banks for debt talks: source "
    },
    {
        "content": "SAO PAULO  June 20 Brazilian mining company Samarco Mineração SA and owners Vale SA and BHP Billiton Plc have hired banks to sound out creditors on a potential renegotiation of $3.8 billion in debt  after a deadly dam spill led to the shutdown of a key mine  a source with direct knowledge of the plan said on Monday.",
        "date": "06202016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-Brazil's Samarco  owners hire banks for debt talks -source "
    },
    {
        "content": "SAO PAULO  June 20 Brazilian mining company Samarco Mineração SA and owners Vale SA and BHP Billiton Plc have hired banks to sound out creditors on a potential renegotiation of $3.8 billion in debt  after a deadly dam spill led to the shutdown of a key mine  a source with direct knowledge of the plan said on Monday.",
        "date": "06202016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Brazil's Samarco  owners hire banks for debt talks -source "
    },
    {
        "content": "RIO DE JANEIRO  June 15 Brazilian miner Samarco  a joint venture between Vale SA and BHP Billiton   no longer expects to resume mining operations this year  Benedito Waldson  the company's head of human resources told Reuters on Wednesday.",
        "date": "06152016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Vale-BHP's Samarco no longer sees operations resuming this year "
    },
    {
        "content": "SYDNEY BHP Billiton is studying an option to develop a massive new iron ore deposit in Australia to replace lost tonnes as operations age and reserves decline  according to the company and documents filed with environmental regulators.",
        "date": "06092016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP sets sights on a new iron mine to replace aging one "
    },
    {
        "content": "SYDNEY  June 9 BHP Billiton  is studying an option to develop a massive new iron ore deposit in Australia to replace lost tonnes as operations age and reserves decline  according to the company and documents filed with environmental regulators.",
        "date": "06092016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP sets sights on a new iron mine to replace ageing one "
    },
    {
        "content": "MELBOURNE  June 7 BHP Billiton said on Tuesday it has agreed to sell its coal assets in Indonesia to its partner  Adaro Energy   following a slump in prices for metallurgical coal.",
        "date": "06072016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "RPT-BHP Billiton sells Indonesian coal assets to Adaro "
    },
    {
        "content": "MELBOURNE  June 7 BHP Billiton said on Tuesday it has agreed to sell its coal assets in Indonesia to its partner  Adaro Energy   following a slump in prices for metallurgical coal.",
        "date": "06072016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton sells Indonesian coal assets to Adaro "
    },
    {
        "content": "* Analysts had said deal not likely to top $200 mln   (Adds comment from Adaro)",
        "date": "06072016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP Billiton sells Indonesian coal assets to Adaro "
    },
    {
        "content": "RIO DE JANEIRO  June 3 Brazilian miner Samarco  co-owned by BHP Billiton and Vale SA  said on Friday it will launch a voluntary layoff program with the aim of cutting 40 percent of its 3 000 employees.",
        "date": "06032016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Vale-BHP's Samarco says looking to cut 40 percent of workforce "
    },
    {
        "content": "SANTIAGO  May 23 Workers at BHP Billiton's   Spence mine in northern Chile went on a 24-strike on Monday due to a contractual dispute  a union official told Reuters.",
        "date": "05232016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Workers at BHP Billiton's Spence mine in Chile go on 24-hr strike "
    },
    {
        "content": "LAUNCESTON  Australia  May 23 China's imports of iron ore are likely to have maintained their recent strength in May  as top suppliers Australia and Brazil continue to squeeze market share from smaller rivals.",
        "date": "05232016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-COLUMN-China's May iron ore imports stay robust  majors squeeze rivals: Russell "
    },
    {
        "content": "LAUNCESTON  Australia China's imports of iron ore are likely to have maintained their recent strength in May  as top suppliers Australia and Brazil continue to squeeze market share from smaller rivals.",
        "date": "05232016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Column: China's May iron ore imports stay robust  majors squeeze rivals "
    },
    {
        "content": "LAUNCESTON  Australia  May 23 China's imports of iron ore are likely to have maintained their recent strength in May  as top suppliers Australia and Brazil continue to squeeze market share from smaller rivals.",
        "date": "05232016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-China's May iron ore imports stay robust  majors squeeze rivals: Russell "
    },
    {
        "content": "May 18 Halcón Resources Corp  which produces oil in Texas and North Dakota  said on Wednesday it plans to file for a prepackaged bankruptcy that would wipe out $1.8 billion in debt and help it survive the drop in crude prices.",
        "date": "05182016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-Halcón reaches pact with creditors on prepackaged bankruptcy plan "
    },
    {
        "content": "SANTIAGO  May 13 Workers at BHP Billiton's   Spence mine in northern Chile have entered a 24-hour strike  a union representative said on Friday  citing slow progress in labor talks.",
        "date": "05132016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Workers at BHP Billiton's Spence mine in Chile go on 24-hour strike "
    },
    {
        "content": "BRUSSELS/MELBOURNE BHP Billiton has talked up its future growth options  joining fellow mining giant Rio Tinto in marking a shift in focus after four years of aggressive cost cutting.",
        "date": "05112016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton joins Rio in shifting focus to growth "
    },
    {
        "content": "* Capital expenditure on horizon after next year - BHP   (Adds BHP  investor comments)",
        "date": "05112016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-BHP Billiton joins Rio in shifting focus to growth "
    },
    {
        "content": "SYDNEY  May 11 Australian shares rose to their highest in nine months on Wednesday  helped by solid gains in mining giant BHP Billiton  while New Zealand stocks returned to record territory after recovering from a late April fall.",
        "date": "05112016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia shares hit nine-month highs  NZ climbs back to a record "
    },
    {
        "content": "* \"We are not waiting for (commodity) prices to recover\" - CEO",
        "date": "05102016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BRIEF-BHP Billiton CEO says increasing exploration activity "
    },
    {
        "content": "LAUNCESTON  Australia If you are looking for signs that the China-led surge in iron ore and steel prices is likely to fizzle  the fact that the share prices of producers are lagging miles behind is a strong indicator that the commodity rally may be shaky.",
        "date": "05052016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Rio  BHP investors may be too cautious on iron ore rally "
    },
    {
        "content": "LONDON  May 4 European stocks hovered near a three-week low on Wednesday  with shares in Dialog Semiconductor  and BHP Billiton among the worst performers.",
        "date": "05042016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "European stocks hover near 3-week low  Dialog and BHP slump "
    },
    {
        "content": "LONDON  May 4 European equity futures were flat on Wednesday  with concerns over weak global economic growth weighing on markets.",
        "date": "05042016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "European Factors to Watch-Sluggish start seen for European shares "
    },
    {
        "content": "To access the newsletter  click on the link:    http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_05042016.pdf                  FACTORS TO WATCH    11:00 am: Parliament session continues in New Delhi.    12:30 pm: Power Minister Piyush Goyal to launch portal for Coal India in New Delhi.    6:00 pm: Trade Minister Nirmala Sitharaman and Trade Secretary Rita Teaotia at industry event in New Delhi.    6:15 pm: Federal cabinet likely to meet. Agenda not given in New Delhi.      ",
        "date": "05042016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Morning News Call - India  May 4 "
    },
    {
        "content": "LAUNCESTON  Australia If you are looking for signs that the China-led surge in iron ore and steel prices is likely to fizzle  the fact that the share prices of producers are lagging miles behind is a strong indicator that the commodity rally may be shaky.",
        "date": "05062016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Rio  BHP investors may be too cautious on iron ore rally "
    },
    {
        "content": "RIO DE JANEIRO A Brazilian judge on Thursday ratified the settlement Samarco and its owners  BHP Billiton  and Vale SA   signed with Brazil's government in March to cover damages for a deadly dam spill last year  Vale said in a statement.",
        "date": "05062016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Brazil judge approves Samarco dam burst settlement with government "
    },
    {
        "content": "RIO DE JANEIRO  May 5 A Brazilian judge on Thursday ratified the settlement Samarco and its owners  BHP Billiton and Vale SA  signed with Brazil's government in March to cover damages for a deadly dam spill last year  Vale said in a statement.",
        "date": "05062016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-UPDATE 3-Brazil judge approves Samarco dam burst settlement with government "
    },
    {
        "content": "MELBOURNE  April 22 Australia's competition watchdog wants to break up a marketing joint venture between ExxonMobil Corp and BHP Billiton  to help boost competition in the eastern Australian gas market  it said on Friday.",
        "date": "04222016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Australia watchdog looks to end ExxonMobil  BHP joint gas sales "
    },
    {
        "content": "LAUNCESTON  Australia - Is iron ore's rapid move from one of the commodities with the gloomiest outlook to a star performer justifiable and sustainable?",
        "date": "04222016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Iron ore in bear market rally  likely to fade on fundamentals "
    },
    {
        "content": "LAUNCESTON  Australia  April 21 - Is iron ore's rapid move from one of the commodities with the gloomiest outlook to a star performer justifiable and sustainable?",
        "date": "04212016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-Iron ore in bear market rally  likely to fade on fundamentals: Russell "
    },
    {
        "content": "* Indonesian Haju mine has 1 mtpa capacity   (Adds Adaro comment)",
        "date": "04202016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 2-BHP Billiton weighs getting out of Indonesian coal "
    },
    {
        "content": "MELBOURNE  April 20 BHP Billiton is considering giving up its coal stakes in Indonesia  where it recently started producing coal  amid uncertainty over Indonesian regulations and a weak outlook for coal.",
        "date": "04192016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton weighs getting out of Indonesian coal "
    },
    {
        "content": "LONDON  April 18 BHP Billiton   Chief Executive Andrew Mackenzie said on Monday that businesses could face a decade of damaging uncertainty if Britain voted to leave the European Union in a June 23 referendum.",
        "date": "04182016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP CEO Mackenzie says Brexit would lead to lost decade of damaging uncertainty "
    },
    {
        "content": "* Move could support tighter iron ore market - analyst   (Recasts lead paragraph)",
        "date": "04202016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 3-BHP joins Rio in iron ore output cut  eases oversupplied market "
    },
    {
        "content": "SYDNEY  April 13 Australia's Fortescue Metals Group shipped a flat 42 million tonnes of iron ore in the March quarter  putting it on track to exceed its annual production target  while lowering cash costs by 6 percent from the previous quarter.",
        "date": "04132016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-Australia's Fortescue says could exceed iron ore output target "
    },
    {
        "content": "SINGAPORE  April 12 - It would be easy to dismiss the assertion by BHP Billiton Chief Executive Andrew Mackenzie that commodity prices have bottomed as the wishful thinking of a mining executive keen to see some improvement in profit margins.",
        "date": "04122016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "RPT-COLUMN-You can now be positive on commodities  and that's a big change: Russell "
    },
    {
        "content": "SINGAPORE - It would be easy to dismiss the assertion by BHP Billiton Chief Executive Andrew Mackenzie that commodity prices have bottomed as the wishful thinking of a mining executive keen to see some improvement in profit margins.",
        "date": "04122016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "You can now be positive on commodities  and that's a big change: Russell "
    },
    {
        "content": "SINGAPORE  April 12 - It would be easy to dismiss the assertion by BHP Billiton Chief Executive Andrew Mackenzie that commodity prices have bottomed as the wishful thinking of a mining executive keen to see some improvement in profit margins.",
        "date": "04122016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-You can now be positive on commodities  and that's a big change: Russell "
    },
    {
        "content": "WINNIPEG/SANTIAGO  April 6 Dealers of used mining equipment  from the United States to Chile and Australia  are making a risky bet that an end to the industry's four-year slump may be in sight  stocking up on a glut of crushers and conveyors.",
        "date": "04062016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "In mining slump  used equipment dealers stockpile in rebound bet "
    },
    {
        "content": "WINNIPEG/SANTIAGO  April 6 Dealers of used mining equipment  from the United States to Chile and Australia  are making a risky bet that an end to the industry's four-year slump may be in sight  stocking up on a glut of crushers and conveyors.",
        "date": "04062016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-In mining slump  used equipment dealers stockpile in rebound bet "
    },
    {
        "content": "SYDNEY  April 5 Iron ore shipments to China from Australia's Port Hedland  used by miners such as BHP Billiton    rose nearly 12 percent in March  data showed on Tuesday.",
        "date": "04052016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Iron ore shipments to China rise 12 pct in March -Pilbara Ports "
    },
    {
        "content": "March 31 Guinea and Burkina Faso plan to take back hundreds of unused mining permits for re-auction  ministers said this week  as governments try to reignite interest in the sector.",
        "date": "03312016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-Guinea and Burkina Faso to take back unused mining permits "
    },
    {
        "content": "SYDNEY The world's largest miner BHP Billiton expects to continue mining iron ore in western Australia's Pilbara for more than 100 years and will release a plan for its long-term future in the region on Monday  according to a company statement.",
        "date": "03192016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP plans to mine Australia's iron ore Pilbara region for 100 years "
    },
    {
        "content": "MELBOURNE BHP Billiton Chief Executive Andrew Mackenzie on Wednesday said the world's biggest miner sees iron ore prices falling  with oversupply set to keep them \"lower for longer\".",
        "date": "03152016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP CEO says bearish on iron ore price  though still profitable "
    },
    {
        "content": "MELBOURNE  March 16 BHP Billiton   Chief Executive Andrew Mackenzie said on Wednesday he was relatively bearish on the iron ore price.",
        "date": "03152016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP CEO says relatively bearish on iron ore price "
    },
    {
        "content": "* Shares tumble 10 pct  underperforms mining index   (Adds conference call  analyst comment  shares)",
        "date": "03152016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-Chile's Antofagasta warns tough year ahead as profit falls short "
    },
    {
        "content": "March 3 Moody's Investors Service on Thursday cut BHP Billiton Plc's debt rating to \"A3\" from \"A1\"  citing a deterioration in the company's earnings and cash flow.",
        "date": "03032016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "RPT-UPDATE 2-Moody's downgrades BHP Billiton's debt "
    },
    {
        "content": "* BHP shares up 3.7 pct as copper hits 3-month highs   (Adds BHP response  analyst quote  price of credit default swaps; updates shares)",
        "date": "03032016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-Moody's downgrades BHP Billiton's debt "
    },
    {
        "content": "BRASILIA Samarco Mineracao SA [SAMNE.UL] will pay at least 20 billion reais ($5 billion) over 15 years as part of a deal reached with the Brazilian government to settle a lawsuit for damages caused by a deadly dam spill at a mine in November  a government source told Reuters on Tuesday.",
        "date": "03022016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Samarco to pay at least $5 billion in Brazil dam spill deal: source "
    },
    {
        "content": "March 3 Credit ratings agency Moody's Investors Service cut its ratings on BHP Billiton Plc to \"A3\" from \"A1\"  citing a deterioration in the company's earnings and cash flow.",
        "date": "03032016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Moody's downgrades BHP Billiton's debt "
    },
    {
        "content": "BRASILIA  March 1 Samarco Mineracao SA  will pay at least 20 billion reais ($5 billion) over 15 years as part of a deal reached with the Brazilian government to settle a lawsuit for damages caused by a deadly dam spill at a mine in November  a government source told Reuters on Tuesday.",
        "date": "03012016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 2-Samarco to pay at least $5 bln in Brazil dam spill deal - source "
    },
    {
        "content": "BRASILIA  March 3 Brazilian prosecutors on Thursday criticized a deal that mining company Samarco reached earlier this week with the federal government to pay an estimated 20 billion reais ($5.27 billion)in damages for a deadly dam spill in November.",
        "date": "03042016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Brazilian prosecutors question Samarco dam burst settlement "
    },
    {
        "content": "March 3 () - March 3   * Moody's downgrades BHP Billiton to a3; outlook negative  * Moody's on BHP billiton's negative outlook : reflects pricing pressure and weaker fundamentals for the commodities which BHP Billiton produces  * Moody's on BHP Billiton downgrade-reflects the deterioration in earnings and cash flow  which has led to significantly weaker credit metrics.  * Moody's on BHP Billiton - expects BHP billiton's credit metrics to remain substantially weaker  over the next 12-",
        "date": "03032016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "REFILE-BRIEF-Moody's downgrades BHP Billiton to A3; outlook negative "
    },
    {
        "content": "BRASILIA/RIO DE JANEIRO March 2 Mining company Samarco and its owners  BHP Billiton and Vale SA   reached a deal with the Brazilian government on Wednesday to pay an estimated 20 billion reais ($5.1 billion) in damages over 15 years for a deadly dam spill in November.",
        "date": "03032016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 4-Vale/BHP's Samarco to pay $5 bln in damages for dam disaster "
    },
    {
        "content": "Feb 29 Standard & Poor's affirmed its \"A\" rating on global miner BHP Billiton's  debt  citing a change in the company's dividend policy.",
        "date": "02292016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-Standard & Poor's affirms BHP Billiton's credit rating "
    },
    {
        "content": "* Shares down on profit taking after no asset sales announced   (Adds details  quotes  shares)",
        "date": "03012016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-Glencore to cut more debt as 2015 profit falls 32 pct "
    },
    {
        "content": "Feb 29 Standard & Poor's affirmed its \"A\" rating on global miner BHP Billiton's  debt  citing a change in the company's dividend policy.",
        "date": "02292016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Standard & Poor's affirms BHP Billiton's credit rating "
    },
    {
        "content": "SYDNEY  Feb 29 Australian shares were little changed on Monday  ending less than one point firmer  with major miners BHP Billiton and Rio Tinto showing only slight movement.",
        "date": "02292016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia stocks end flat as miners stagnate "
    },
    {
        "content": "SYDNEY/WELLINGTON  Feb 29 Australian shares rose 0.6 percent on Monday as firmer oil prices underpinned risk sentiment  but the index was on track for its second month of losses  in contrast to its New Zealand cousin which looked set to post a hefty monthly gain.",
        "date": "02292016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia  NZ shares gain on improving risk mood "
    },
    {
        "content": "MELBOURNE  Feb 26 BHP Billiton   said on Friday that no agreement has been reached yet with Brazilian authorities to fund clean up and damages for a dam burst that killed at least 17 people in that country's worst environmental disaster.",
        "date": "02262016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton says no settlement yet on Brazil dam disaster "
    },
    {
        "content": "SYDNEY  Feb 23 Top global miner BHP Billiton   slashed its interim dividend by 75 percent on Tuesday  cutting it for the first time since 1988 following a collapse in prices for oil  iron ore  coal and other raw materials.",
        "date": "02222016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton slashes dividend  drops payout pledge "
    },
    {
        "content": "SYDNEY/LONDON The world's largest miner BHP Billiton is sitting on an $11 billion cash pile and what CEO Andrew Mackenzie does with the money will be a critical test of his ability to invest during the industry's worst downturn in decades.",
        "date": "02242016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP's boss faces $11 billion dilemma as prices languish "
    },
    {
        "content": "SYDNEY Top global miner BHP Billiton   slashed its interim dividend by 75 percent on Tuesday  abandoning a long-held policy of steady or higher payouts as it braces for a longer-than-expected commodities downturn. | Video ",
        "date": "02232016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton slashes dividend  posts $5.67 billion net loss "
    },
    {
        "content": "LONDON - Shares fall in Europe and Asia as oil prices dipa fter Saudi Arabia effectively rules out output cuts by major producers  lifting investor appetite for low-risk assets such as the Japanese yen and gold. (GLOBAL-MARKETS/ (WRAPUP 4)  moved  by Nigel Stephenson  560 words)",
        "date": "02242016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Reuters Business News Schedule at 0930 GMT/0430 AM ET "
    },
    {
        "content": "* StanChart  BHP down after disappointing updates   (Adds details  updates share prices)",
        "date": "02232016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "European shares weighed down by StanChart  BHP; exchange operators rise "
    },
    {
        "content": "* BHP Billiton drops after slashing dividend   (Adds company news  updates prices)",
        "date": "02232016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Britain's FTSE hit by drops at StanChart and BHP Billiton "
    },
    {
        "content": "LONDON  Feb 23 European shares retreated on Tuesday  with falling commodities prices and disappointing updates from Standard Chartered and BHP Billiton  putting pressure on the market.",
        "date": "02232016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "European shares fall as BHP  StanChart updates weigh "
    },
    {
        "content": "LONDON  Feb 23 Britain's top share index fell on Tuesday as a slump in major bank Standard Chartered and miner BHP Billiton pushed back the market after gains in the previous session.",
        "date": "02232016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Britain's FTSE felled by drops at StanChart and BHP Billiton "
    },
    {
        "content": "* Sees prolonged period of weak commodity prices   (Adds quote  details  share price)",
        "date": "02232016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 3-BHP Billiton slashes dividend  posts $5.67 bln net loss "
    },
    {
        "content": "Jan 31 British telecoms regulator Ofcom has urged Brussels to block the merger of O2 UK and Three  which it fears could inflate mobile phone bills in the UK  the Financial Times reported.",
        "date": "01312016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Ofcom urges Brussels to block O2 and Three merger -FT "
    },
    {
        "content": "SANTIAGO  Jan 27 Chile's Escondida  the world's biggest copper mine  will implement a new round of personnel cuts  equal to 2.4 percent of its current workforce as prices for the red metal continue to linger near multi-year lows.",
        "date": "01272016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton cutting 2.4 pct of workforce at Chile-based Escondida "
    },
    {
        "content": "LAUNCESTON  Australia  Jan 27 - Iron ore heavyweights Australia and Brazil are gaining market share in top buyer China  but aren't quite destroying their smaller rivals as quickly as they need to.",
        "date": "01272016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-COLUMN-Australia  Brazil boost China iron ore import share  but not enough: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  Jan 27 - Iron ore heavyweights Australia and Brazil are gaining market share in top buyer China  but aren't quite destroying their smaller rivals as quickly as they need to.",
        "date": "01272016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-Australia  Brazil boost China iron ore import share  but not enough: Russell "
    },
    {
        "content": "MELBOURNE BHP Billiton flagged on Wednesday that it sees no recovery in iron ore or coal prices in the next few years  while holding out hope for a rebound in copper and oil as it fights slumping earnings set to hit its long-protected  dividend.",
        "date": "01202016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Mining giant BHP pessimistic on iron ore  coal prices in next few years "
    },
    {
        "content": "* Trims iron ore output forecast in wake of Brazil dam burst   (Adds analyst comment  details on 2016 guidance  share price)",
        "date": "01202016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-Mining giant BHP pessimistic on iron ore  coal prices in next few yrs "
    },
    {
        "content": "MELBOURNE  Jan 20 BHP Billiton   flagged on Wednesday that it sees no recovery in iron ore or coal prices in the next few years while holding out hope for a rebound in copper and oil as the company fights a slump in earnings set to hit its long-protected  dividend.",
        "date": "01202016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "CORRECTED-UPDATE 1-BHP Billiton sees no lift in medium term for iron ore  coal prices "
    },
    {
        "content": "MELBOURNE  Jan 18 In the decimated mining sector  Anglo-Australian Rio Tinto is set to be the last man standing for investors as sliding commodities prices force its peers to slash dividends  in a reversal of fortunes against arch rival BHP Billiton.",
        "date": "01182016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Oil rout favours Rio Tinto over BHP  at least for now "
    },
    {
        "content": "SYDNEY/WELLINGTON  Jan 18 Australian and New Zealand shares started the week on a sour note  tracking Wall Street's tumble as deepening oil woes reinforced global growth concerns.",
        "date": "01182016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia stocks hit 2-1/2-yr lows  NZ shares fall hard on global headwinds "
    },
    {
        "content": "MELBOURNE Top global miner BHP Billiton said on Friday it would book a $7.2 billion writedown on the value of its U.S. shale assets  reflecting a slump in oil and gas prices and a bleak near-term outlook.",
        "date": "01142016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton slashes U.S. shale assets value by $7.2 billion "
    },
    {
        "content": "MILAN/LONDON  Jan 15 European shares ended on Friday at their lowest since mid-December 2014  hit by losses in commodity-related stocks as BHP Billiton announced a major writedown and oil fell below $30 a barrel.",
        "date": "01152016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "European shares plunge  roiled by BHP and oil; hopes turn to ECB "
    },
    {
        "content": "MELBOURNE  Jan 15 Top global miner BHP Billiton   said on Friday it would book a $4.9 billion post-tax writedown on the value of its U.S. shale assets reflecting the sharp slump in oil and gas prices  volatility and a bleak near-term outlook.",
        "date": "01142016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton to take $4.9 bln writedown on U.S. shale assets "
    },
    {
        "content": "MELBOURNE Global miner BHP Billiton said on Friday it will write down the value its U.S. shale assets by $7.2 billion on a bleak outlook for oil and gas prices  cementing expectations it will be forced to cut its dividend for the first time in over 25 years. | Video ",
        "date": "01152016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton dividend cut looms as it takes $7.2 billion shale charge "
    },
    {
        "content": "MELBOURNE/WELLINGTON  Jan 14 Australian shares slid 1.8 percent by midday on Thursday  back in the red after a brief respite on better-than-expected Chinese data in the previous session  as investors latched on to a slide in oil prices as a sign of weaker economic growth.",
        "date": "01142016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia shares resume slide  bottom fishing trims losses "
    },
    {
        "content": "LONDON  Jan 15 Britain's FTSE 100 share index was led lower on Friday by the mining sector on persistent fears over falling Chinese demand and on fears that BHP Billiton  might cut its dividend after writing down its U.S. shale assets by $7.2 billion.",
        "date": "01152016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Britain's FTSE stumbles  BHP Billiton writedown sparks sector fears "
    },
    {
        "content": "* BHP cuts its oil and gas price assumptions   (Adds Moody's comment  shale background)",
        "date": "01152016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 3-BHP Billiton dividend cut looms as it takes $7.2 bln shale charge "
    },
    {
        "content": "SANTIAGO  Jan 8 The union at global miner BHP Billiton's  Cerro Colorado copper mine in Chile said on Friday that it will go on strike on Monday over failed contract negotiations.",
        "date": "01082016",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-Union at BHP Billiton's Cerro Colorado copper mine in Chile to strike "
    },
    {
        "content": "Jan 8 Britain's FTSE 100 index is seen opening up 1 point  or 0.01 percent on Friday  according to financial bookmakers  with futures up 0.56 percent ahead of the cash market open. For more on the factors affecting European stocks  please click on",
        "date": "01082016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-UK Stocks-Factors to watch on Jan 8 "
    },
    {
        "content": "Jan 8 Britain's FTSE 100 index is seen opening up 1 point  or 0.01 percent on Friday  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The commodity-heavy FTSE 100 hit a three-week low and closed down 119.30 points  or 2 percent at 5 954.08 on Thursday  to wipe 33 billion pounds off the index's market capitalisation  after China allowed its currency to weaken faster than before  rocking global markets and sending commod",
        "date": "01082016",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Stocks-Factors to watch on Jan 8 "
    },
    {
        "content": "RIO DE JANEIRO/SAO PAULO Dec 19 A judge in Brazil's state of Minas Gerais has frozen the Brazilian assets of mining giants BHP Billiton and Vale SA after determining their joint venture Samarco was unable to pay for damage caused by the bursting of a dam at its mine last month.",
        "date": "12202015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "RPT-UPDATE 1-Judge blocks Brazilian assets of Vale  BHP after dam burst "
    },
    {
        "content": "RIO DE JANEIRO/SAO PAULO Dec 19 A judge in Brazil's state of Minas Gerais has frozen the Brazilian assets of mining giants BHP Billiton and Vale SA after determining their joint venture Samarco was unable to pay for damages caused by a burst dam at its mine last month.",
        "date": "12192015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Judge blocks Brazilian assets of Vale  BHP after dam burst "
    },
    {
        "content": "RIO DE JANEIRO Brazil's Vale SA said on Sunday it will appeal a court decision to freeze some of it and BHP Billiton's Brazilian assets  saying the ruling  which declared the two mining companies responsible for a dam burst last month  was \"inappropriate.\"",
        "date": "12212015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Brazil Vale says will appeal ruling to block assets for dam burst "
    },
    {
        "content": "RIO DE JANEIRO/SAO PAULO Dec 19 A judge in Brazil's state of Minas Gerais has frozen the Brazilian assets of mining giants BHP Billiton and Vale SA after determining their joint venture Samarco was unable to pay for damage caused by the bursting of a dam at its mine last month.",
        "date": "12192015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-Judge blocks Brazilian assets of Vale  BHP after dam burst "
    },
    {
        "content": "LAUNCESTON  Australia - If 2015 was the year in which the growing oversupply of key commodities led to a rout in prices  will 2016 bring the point of capitulation  leading to consolidation and the start of recovery?",
        "date": "12212015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Hoping your rivals will die - The 2016 commodity story: Russell "
    },
    {
        "content": "SYDNEY  Dec 15 Rio Tinto  locked in $4.4 billion in financing on Tuesday to fund a massive expansion of a copper mine in Mongolia and a final decision whether to proceed with construction will be made in the first half of 2016.",
        "date": "12152015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Rio Tinto seals $4.4 bln financing for Mongolia copper expansion "
    },
    {
        "content": "SINGAPORE  Dec 10 The market for capesize bulk carriers is likely to be a tale of two oceans next week  with rates in the Pacific coming under further pressure due to a lack of cargo  while Atlantic rates could continue to rise on a tonnage shortage  brokers said on Thursday.",
        "date": "12102015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Asia Dry Bulk-Capesize rates face mixed fortunes in dull cargo market "
    },
    {
        "content": "LONDON  Dec 8 European shares fell on Tuesday  with Anglo American slumping to a new record low after suspending its dividend and BHP Billiton slipping after a civil lawsuit seeking billion of dollars in damages.",
        "date": "12082015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Miners weigh on European shares  Anglo American hits record low "
    },
    {
        "content": "BHP Billiton plans to lower production costs and increase output at its copper business  remaining optimistic about rising demand in the long term  the company's president of copper said on Tuesday. | Video ",
        "date": "12012015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP to lower copper production costs  increase output "
    },
    {
        "content": "Dec 1 Vale SA executives spoke on Tuesday at the New York Stock Exchanges for the Rio de Janeiro-based mining company's annual Vale Day investor conference",
        "date": "12012015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BRIEF-Vale says it has no clear estimate of Samarco disaster cost "
    },
    {
        "content": "MELBOURNE  Nov 30 Australian shares are set to open roughly unchanged on Monday ahead of a raft of data  although resources stocks will come under pressure from weaker metals prices and with top miner BHP Billiton facing ever rising bills from a dam disaster in Brazil.     Local share price index futures pointed to a flat opening  having ended down 1 point at 5 206.0  a 0.1 percent premium to the underyling S&P/ASX 200 index close. The benchmark fell 0.2 percent on Friday.     Data d",
        "date": "11292015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Australia shares face flat open  may drift down with miners "
    },
    {
        "content": "Dec 1 BHP Billiton  plans to lower production costs and increase output at its copper business  remaining optimistic about rising demand in the long term  the company's president of copper said on Tuesday.",
        "date": "12012015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP to lower copper production costs  increase output "
    },
    {
        "content": "SYDNEY/LONDON BHP Billiton shares dropped more than 5 percent to a seven-year low on Monday after Brazil announced plans to sue the mining company and its partners for 20 billion reais ($5.2 billion) over the bursting of a dam.",
        "date": "11302015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP shares sink on Brazil's plan to sue over mine disaster "
    },
    {
        "content": "* Aberdeen AM down on emerging market outflows   (Recasts  adds quote  detail)",
        "date": "11302015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Britain's FTSE lags euro zone  pulled down by BHP and Aberdeen "
    },
    {
        "content": "SYDNEY/LONDON  Nov 30 BHP Billiton  shares dropped more than 5 percent to a seven-year low on Monday after Brazil announced plans to sue the mining company and its partners for 20 billion reais ($5.2 billion) over the bursting of a dam.",
        "date": "11302015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP shares sink on Brazil's plan to sue over mine disaster "
    },
    {
        "content": "LONDON  Nov 30 Britain's top share index edged lower on Monday  with mining company BHP Billiton falling on the prospect of a hefty fine in Brazil and Aberdeen Asset Management slipping after it reported outflows from its emerging market funds.",
        "date": "11302015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Britain's FTSE edges lower  pulled down by BHP and Aberdeen "
    },
    {
        "content": "MILAN  Nov 30 European shares opened lower on Monday  led by BHP Billiton after news Brazil could seek damages for the burst of a dam  while Delta Lloyd slumped on capital raising plans.",
        "date": "11302015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "European shares fall; BHP Billiton  Delta Lloyd weigh "
    },
    {
        "content": "SYDNEY  Nov 30 BHP Billiton   said on Monday its chairman and three other board members would oversee its response to the Samarco mine disaster in Brazil as clean-up efforts continue amid confirmation arsenic had been found in river water.",
        "date": "11302015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP names chairman  board members to oversee Samarco disaster "
    },
    {
        "content": "PERTH  Nov 19 Mining giant BHP Billiton   will update the market on its future dividend policy in February  chairman Jac Nasser said on Thursday  at it battles falling prices for everything from iron ore to copper.",
        "date": "11192015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 2-BHP Billiton says next word on dividend in February "
    },
    {
        "content": "RIO DE JANEIRO  Nov 16 The cost of a deadly dam burst at an iron ore mine in Brazil run by Samarco has already exceeded the insurance cap for civil damages  co-owner Vale SA  said on Monday.",
        "date": "11162015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-Brazil's Vale says Samarco costs already exceed insurance "
    },
    {
        "content": "MELBOURNE The death toll from the iron ore mine dam disaster in Brazil has risen to nine  while 19 people remain missing  BHP Billiton  a co-owner of the mine said on Friday.",
        "date": "11132015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton says Brazil dam death toll has risen to 9 "
    },
    {
        "content": "Nov 12 - The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "11122015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "PRESS DIGEST- British Business - Nov 12 "
    },
    {
        "content": "LONDON  Nov 13 Britain's FTSE 100 index is seen opening down 29-31 points  or around 0.5 percent on Friday  according to financial bookmakers  with futures down 0.5 percent ahead of the cash market open. For more on the factors affecting European stocks  please click on",
        "date": "11132015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-UK Factors-FTSE seen opening lower on Friday Nov 13 "
    },
    {
        "content": "LONDON  Nov 13 Britain's FTSE 100 index is seen opening down 29-31 points  or around 0.5 percent on Friday  according to financial bookmakers  with futures down 0.6 percent ahead of the cash market open. For more on the factors affecting European stocks  please click on",
        "date": "11132015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Factors-FTSE seen opening lower on Friday Nov 13 "
    },
    {
        "content": "SYDNEY/MELBOURNE  Nov 13 BHP Billiton   shares struck a seven-year low on Friday  their weakest since the global financial crisis  on mounting concerns it may ditch a policy of paying ever higher dividends.",
        "date": "11132015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton shares fall as doubts grow over dividend policy "
    },
    {
        "content": "MARIANA  Brazil  Nov 9 Mudslides from burst dams at the Germano mine complex in Brazil have taken out a conveyor belt at a nearby mine and will affect the output of iron ore giant Vale SA   the company told Reuters on Monday.",
        "date": "11092015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Vale says burst dams in Brazil to hit Mariana output "
    },
    {
        "content": "NEW YORK  Nov 9 (IFR) - LatAm debt markets started the week on a softer note Monday as investors digested the increasing possibility of a US rate hike in December following last week's strong payroll numbers.",
        "date": "11092015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "LATAM WRAP-LatAm bond markets weaken on rate concerns "
    },
    {
        "content": "RIO DE JANEIRO  Nov 10 Brazilian mining company Vale SA said on Monday that a deadly collapse of a tailings dam at Brazil's Samarco  an iron ore company it owns 50-50 with Australia's BHP Billiton Plc  will cut output from two nearby mines.",
        "date": "11102015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-Brazil's Vale says Samarco disaster to cut output at nearby mines "
    },
    {
        "content": "SYDNEY/WELLINGTON  Nov 11 Australian shares edged higher on Wednesday as heavy selling in miner BHP Billiton  following a deadly industrial accident at a Brazilian mine undercut a bounce in bank stocks.",
        "date": "11112015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Australia shares higher as banks counter BHP selloff "
    },
    {
        "content": "Nov 9 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "11092015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "PRESS DIGEST - Wall Street Journal - Nov 9 "
    },
    {
        "content": "SAO PAULO  Nov 10 Brazil's stocks were among the worst performers in Latin America on Tuesday as speculation about the future of Finance Minister Joaquim Levy raised more questions about the government's commitment to fiscal austerity.     Although Levy has repeatedly denied rumors of his resignation  Brazilian media was abuzz with reports that President Dilma Rousseff was considering replacing him in coming months  perhaps in the beginning of 2016.     Levy has spearheaded efforts t",
        "date": "11102015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "EMERGING MARKETS-Brazil stocks lead Latam losses on political uncertainty "
    },
    {
        "content": "* Burberry hit by Richemont read-across   (Adds quote and detail  updates prices)",
        "date": "11062015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP leads Britain's FTSE lower after burst dam "
    },
    {
        "content": "RIO DE JANEIRO  Nov 10 Brazilian mining company Vale SA said on Monday that a deadly collapse of a tailings dam at Brazil's Samarco  an iron ore company it owns 50-50 with Australia's BHP Billiton Plc  will cut output from two nearby mines.",
        "date": "11102015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Brazil's Vale says Samarco disaster to cut output at nearby mines "
    },
    {
        "content": "* Burberry hit by Richemont read-across   (Recasts  adds detail and quotes  updates prices)",
        "date": "11062015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Britain's FTSE retreats  miners fall on dollar surge "
    },
    {
        "content": "WASHINGTON - U.S. job growth surged in October after two straight months of tepid gains  with the unemployment rate hitting a 7-1/2-year low in a show of domestic strength that makes it almost likely the Federal Reserve will hike interest rates in December. (USA-ECONOMY/ (WRAPUP 3)  moving shortly  by Lucia Mutikani  535 words)",
        "date": "11062015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Reuters Business News Schedule at 1330 GMT/0830 AM ET "
    },
    {
        "content": "LONDON  Nov 6 Britain's top share index was steady on Friday  with gains by IAG and Inmarsat on well-received results offset by a fall in BHP Billiton after a dam burst at one of its Brazilian mines.",
        "date": "11062015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP leads Britain's FTSE lower after dam burst "
    },
    {
        "content": "LONDON  Nov 6 Britain's FTSE 100 index is seen opening up 3 to 12 points  or flat to 0.2 percent higher according to financial bookmakers. For more on the factors affecting European stocks  please click on            * The FTSE 100 closed down 0.8 percent at 6 364.90 points on Thursday  weighed down by resources stocks.           * BHP BILLITON - A dam holding back waste water from an iron ore mine in Brazil that is owned by Vale and BHP Billiton burst on Thursday  devastating a near",
        "date": "11062015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Stocks-Factors to watch on Friday Nov 6 "
    },
    {
        "content": "JAKARTA  Oct 30 The world's top exporter of coking coal  BHP Billiton   said plans to develop a massive mine in Borneo will hinge on a revision of Indonesia's mining rules  including on compulsory divestment and contract extensions.",
        "date": "10302015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP pins future of Indonesian coal mine on new rules "
    },
    {
        "content": "LONDON  Nov 6 European equity futures were flat on Friday  with many investors focusing on U.S. jobs data later in the day  for a sense of whether or not the U.S. Federal Reserve may raise interest rates next month.",
        "date": "11062015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "European Factors to Watch-Equity futures flat "
    },
    {
        "content": "LONDON  Nov 6 European stocks were seen opening flat on Friday  with many investors focusing on U.S. jobs data later in the day  for a sense of whether or not the U.S. Federal Reserve may raise interest rates next month.",
        "date": "11062015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "European Factors to Watch-Shares seen opening flat "
    },
    {
        "content": "* Shaves $200 million off petroleum spending   (Adds cost cuts  petroleum output)",
        "date": "10212015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 2-BHP lifts iron ore output  cuts $200 mln from petroleum unit "
    },
    {
        "content": "* Copper output slips on lower Escondida ore grades   (Adds iron ore  copper production data  market details)",
        "date": "10202015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP Sept qtr iron ore output rises 7 pct  guidance intact "
    },
    {
        "content": "* M&A opportunities on the horizon   (Adds final yields and investor comments)",
        "date": "10142015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP Billiton raises US$6.5bn with jumbo hybrid bond "
    },
    {
        "content": "LONDON  Oct 14 BHP Billiton  the world's largest miner  was downbeat on Wednesday about iron ore prices as low-cost producers continue to swamp the market and as the intensity of China's demand for the steel making raw material ebbs.",
        "date": "10142015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "LMEWEEK-BHP gloomy on iron ore price  but cautiously optimistic on China "
    },
    {
        "content": "LONDON  Oct 14 (IFR) - BHP Billiton has already lured US$12bn-equivalent of demand for a multi-tranche  multi-currency hybrid bond  demonstrating that investors are still willing to add risk in the battered metals and mining sector at the right price.",
        "date": "10142015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton goes all guns blazing with jumbo hybrid "
    },
    {
        "content": "* Shares up on Anglo  BHP Billiton rally   (Adds closing levels)",
        "date": "10072015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-S.Africa's rand hits two-week high  stocks gain on resources "
    },
    {
        "content": "Oct 7 Franco-Nevada Corp said it agreed to pay Teck Resources Ltd $610 million to help fund operations at the Antamina mine in Peru in exchange for a share of silver production.",
        "date": "10072015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-Franco-Nevada  Teck Resources reach streaming deal for Antamina mine "
    },
    {
        "content": "LAUNCESTON  Australia - It must be tempting for Rio Tinto Chief Executive Sam Walsh to contemplate whether he should buy Glencore  almost a year after fending off an unwelcome approach from his now beleaguered rival.",
        "date": "09302015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Glencore's Glasenberg  once the hunter  now the hunted: Russell "
    },
    {
        "content": "SYDNEY  Sept 29 In what could be a cautionary tale for Alcoa Inc  global miner BHP Billiton's   decision to spin off non-core businesses into a separate company is yet to pay off for shareholders.",
        "date": "09292015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "RPT-BHP Billiton's split may have lessons for Alcoa "
    },
    {
        "content": "LAUNCESTON  Australia - It must be tempting for Rio Tinto Chief Executive Sam Walsh to contemplate whether he should buy Glencore  almost a year after fending off an unwelcome approach from his now beleaguered rival.",
        "date": "09292015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Glencore's Glasenberg  once the hunter  now the hunted: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  Sept 29 - It must be tempting for Rio Tinto Chief Executive Sam Walsh to contemplate whether he should buy Glencore  almost a year after fending off an unwelcome approach from his now beleaguered rival.",
        "date": "09292015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-COLUMN-Glencore's Glasenberg  once the hunter  now the hunted: Russell "
    },
    {
        "content": "SYDNEY  Sept 29 In what could be a cautionary tale for Alcoa Inc  global miner BHP Billiton's   decision to spin off non-core businesses into a separate company is yet to pay off for shareholders.",
        "date": "09292015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton's split may have lessons for Alcoa "
    },
    {
        "content": "LAUNCESTON  Australia  Sept 29 - It must be tempting for Rio Tinto Chief Executive Sam Walsh to contemplate whether he should buy Glencore  almost a year after fending off an unwelcome approach from his now beleaguered rival.",
        "date": "09292015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-Glencore's Glasenberg  once the hunter  now the hunted: Russell "
    },
    {
        "content": "MELBOURNE  Sept 23 BHP Billiton   confirmed on Wednesday it paid no tax on its global marketing base in Singapore  but said it was not the only reason for using the island state as a commodities trading hub and that it paid a fair share of tax worldwide.",
        "date": "09232015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP defends paying no tax on Singapore marketing operations "
    },
    {
        "content": "SYDNEY  Sept 17 There's been considerable debate over who is right on the outlook for China's vast steel sector - the bullish iron ore miners or the bearish analysts and steel producers.",
        "date": "09172015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-For Rio Tinto  it doesn't matter being right on iron ore: Russell "
    },
    {
        "content": "TORONTO  Sept 16 Glencore is in talks with Franco-Nevada Corp  Silver Wheaton Corp  Royal Gold Inc and two other companies to sell portions of the future production of three South American copper mines  two sources with knowledge of the talks said.",
        "date": "09162015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Glencore in talks on streaming deals on Chile  Peru mines -sources "
    },
    {
        "content": "LONDON BHP Billiton last month revised downwards its forecast of \"peak steel\" production in China  the world's largest producer of the stuff.",
        "date": "09112015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "What's 40 million tonnes of Chinese steel between friends? "
    },
    {
        "content": "LONDON BHP Billiton last month revised downwards its forecast of \"peak steel\" production in China  the world's largest producer of the stuff.",
        "date": "09142015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "What's 40 million tonnes of Chinese steel between friends?: Andy Home "
    },
    {
        "content": "** The world's biggest miner is determined to pay a final dividend of 62 cents/shr on Sept. 29",
        "date": "09102015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton: shares go ex-div  underperform peers "
    },
    {
        "content": "LONDON  Sept 11 BHP Billiton last month revised downwards its forecast of \"peak steel\" production in China  the world's largest producer of the stuff.",
        "date": "09112015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-What's 40 million tonnes of Chinese steel between friends?: Andy Home "
    },
    {
        "content": "MELBOURNE  Aug 25 BHP Billiton   promised to keep its dividends even as it reported its worst underlying profit in a decade on Tuesday  hurt by plunging iron ore  copper  coal and oil prices.",
        "date": "08252015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "RPT-UPDATE 3-BHP Billiton profit dives to 10-year low on commodities rout "
    },
    {
        "content": "MELBOURNE BHP Billiton reported its worst underlying profit in a decade on Tuesday  gutted by plunging iron ore  copper  coal and oil prices  and said it would cut spending more deeply to shore up dividends. | Video ",
        "date": "08252015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton profit dives to 10-year low on commodities rout "
    },
    {
        "content": "** Mining stocks  battered by a rout in commodity prices  get hefty boost from activist investor Carl Icahn disclosing a stake in diversified miner & energy producer Freeport-McMoRan",
        "date": "08282015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BUZZ-Mining stocks: Icahn stake in Freeport-McMoRan lifts sector "
    },
    {
        "content": "* BHP's S&P rating at 'A+'  Moody's at 'A-1'   (Adds Moody's comment)",
        "date": "08262015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP Billiton's credit ratings fragile in FY16  agencies warn "
    },
    {
        "content": "* UK shares jump 6 pct  outperform rivals   (Adds quotes from CEO)",
        "date": "08252015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 3-BHP Billiton profit dives to 10-year low on commodities rout "
    },
    {
        "content": "LONDON  Aug 26 European shares were seen stalling at the open on Wednesday  with a wobble in Asian markets and a fall overnight on U.S. stock markets potentially muting the impact of a sharp rally in the previous session fuelled by a Chinese rate cut.",
        "date": "08262015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "European Factors to Watch-Shares seen stalling at open "
    },
    {
        "content": "Aug 26 The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "08262015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "PRESS DIGEST- British Business - Aug 26 "
    },
    {
        "content": "* Shares slide to record low in broader rout   (Adds CEO comments)",
        "date": "08242015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1- South32 maiden profit jumps  to focus on cost cuts "
    },
    {
        "content": "SYDNEY  Aug 9 BHP Billiton  said on Sunday it would cut 380 jobs at its Olympic Dam copper and uranium mine in Australia  citing global market conditions in the resources sector and a desire to ensure the project was sustainable.",
        "date": "08092015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "RPT-BHP Billiton to cut 380 jobs at Australia's Olympic Dam "
    },
    {
        "content": "SYDNEY BHP Billiton   said on Sunday it would cut 380 jobs at its Olympic Dam copper and uranium mine in Australia  citing global market conditions in the resources sector and a desire to ensure the project was sustainable.",
        "date": "08092015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton to cut 380 jobs at Australia's Olympic Dam "
    },
    {
        "content": "LONDON  Aug 10 European shares edged lower on Monday as disappointing economic data out of China and falls in mining companies BHP Billiton and Anglo American  weighed on the market.",
        "date": "08102015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "European shares edge lower  weighed down by China concerns "
    },
    {
        "content": "SINGAPORE  Aug 6 Freight rates for capesize bulk carriers could hold around current levels after reaching their highest in more than eight months this week following a surge of fixtures by Australian miners  ship brokers said.",
        "date": "08062015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Asia Dry Bulk-Capesize rates to steady after climbing to 8-mth high "
    },
    {
        "content": "SYDNEY  Aug 6 Total iron ore exports in July from Australia's Port Hedland fell 2 percent to 35 million tonnes versus the same period a year earlier  port figures released on Thursday showed",
        "date": "08062015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia's Port Hedland July total iron ore shipment down 2 pct "
    },
    {
        "content": "* Cuts to be made gradually over \"coming years\"   (Adds details of job losses  BHP  analyst comment)",
        "date": "07282015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP plans to shed around 100 HQ jobs as commodities tumble "
    },
    {
        "content": "SYDNEY BHP Billiton's strategy of diversifying across commodities was designed to shield the miner in a volatile sector  but its entire suite of products suffered double-digit price falls in the latest half-year.",
        "date": "07232015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP's 'four pillars' no buffer against weak commodity prices "
    },
    {
        "content": "* Says will take up to $650 million writedown in copper   (Adds iron ore production figures  prices copper impairment)",
        "date": "07212015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP beats fiscal 2015 iron ore guidance  takes copper hit "
    },
    {
        "content": "SYDNEY  July 22 BHP Billiton's   strategy of diversifying across commodities was designed to shield the miner in a volatile sector  but its entire suite of products suffered double-digit price falls in the latest half-year.",
        "date": "07222015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "RPT-UPDATE 1-BHP's 'four pillars' no buffer against weak commodity prices "
    },
    {
        "content": "LONDON  July 22 Britain's top share index dropped to its lowest level in more than a week on Wednesday after a poorly received earnings report from Apple hit tech stocks and weaker metals prices and an update from BHP Billiton dragged down miners.",
        "date": "07222015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Britain's FTSE sets 1-week low as mining and tech shares sink "
    },
    {
        "content": "* ARM results roughly in-line  stock falls after Apple weakness",
        "date": "07222015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "FTSE hits 1-week low as miners and tech stocks slump "
    },
    {
        "content": "SYDNEY  July 22 BHP Billiton's   strategy of diversifying across commodities was designed to shield the miner in a volatile sector  but its entire suite of products suffered double-digit price falls in the latest half-year.",
        "date": "07222015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP's 'four pillars' no buffer against weak commodity prices "
    },
    {
        "content": "SYDNEY As Rio Tinto and BHP Billiton ship more iron ore than ever to China  the Australia mining giants face a fightback from Brazil's Vale for market share that threatens to drive already weak prices even lower.",
        "date": "07162015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Vale's designs on China add to Rio  BHP drive for more iron ore "
    },
    {
        "content": "* \"Four Pillars\" strategy offers little protection   (Adds link to graphic)",
        "date": "07222015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP's 'four pillars' no buffer against weak commodity prices "
    },
    {
        "content": "* ARM results roughly in-line  stock falls after Apple weakness",
        "date": "07222015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Britain's FTSE falls after BHP  ARM results fail to impress "
    },
    {
        "content": "LONDON  July 10 Hit hard by the accelerated downturn in metal prices in recent months  global mining companies preparing to report results are likely to announce another round of austerity measures to cut costs and convince investors to remain committed to the sector.",
        "date": "07132015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "RPT-Miners' focus shifts from investor returns to survival "
    },
    {
        "content": "SYDNEY  July 22 Australia's South32  said on Wednesday it missed June quarter nickel production guidance due to labour unrest at its Cerro Matoso mine in Colombia and a drop in ore grades.",
        "date": "07222015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia's South32 nickel output falls below guidance "
    },
    {
        "content": "SYDNEY  July 16 As Rio Tinto and BHP Billiton ship more iron ore than ever to China  the Australia mining giants face a fightback from Brazil's Vale  for market share that threatens to drive already weak prices even lower.",
        "date": "07152015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Vale's designs on China add to Rio  BHP drive for more iron ore "
    },
    {
        "content": "SYDNEY BHP Billiton on Wednesday said it will take a $2 billion impairment on its U.S. shale operations - the third writedown in three years.",
        "date": "07152015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP says will take $2bln charge on U.S. onshore energy business "
    },
    {
        "content": "LONDON Its nuclear deal with world powers bodes well for Iran's crude oil sales but offers less for Tehran's second biggest export  iron ore  as low prices squeeze private miners out of business.",
        "date": "07152015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Little joy for Iran's private iron ore exporters from nuclear deal "
    },
    {
        "content": "LONDON  July 10 Hit hard by the accelerated downturn in metal prices in recent months  global mining companies preparing to report results are likely to announce another round of austerity measures to cut costs and convince investors to remain committed to the sector.",
        "date": "07102015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Miners' focus shifts from investor returns to survival "
    },
    {
        "content": "LAUNCESTON  Australia  Australia's major iron ore miners have had a torrid year so far  battling low prices  engaging in an ugly slanging match with each other and dealing with persistent questions about the wisdom of their expansion strategies.",
        "date": "07082015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Miners paint rosy iron ore picture by skirting tough issues "
    },
    {
        "content": "--Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "07082015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-Miners paint rosy iron ore picture by skirting tough issues: Russell "
    },
    {
        "content": "LONDON  July 3 Investors in industrial metals will keep a close watch on miners' results in coming weeks for possible announcements of production cutbacks that could bolster weak prices.",
        "date": "07032015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Metals investors look for miners to cut supplies to lift prices "
    },
    {
        "content": "TOKYO  July 3 Japan's aluminium premiums for July-September shipments were mostly set at a six-year low of $100 per tonne  plunging 74 percent from the previous quarter due to a supply glut  five sources directly involved in the talks said.",
        "date": "07032015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Japan Q3 aluminium premiums mostly set at six-year low of $100/T -sources "
    },
    {
        "content": "LONDON  June 30 X2 Resources  the private equity fund set up by former Xstrata boss Mick Davis  is now in initial bi-lateral talks to buy some of Rio Tinto's Australian coal assets  a source close to the situation said on Tuesday.",
        "date": "06302015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Outbid in copper  Mick Davis turns to coal to try for X2's first deal "
    },
    {
        "content": "MILAN  June 17 A division of mining group BHP Billiton is holding a closed tender to sell a liquefied natural gas (LNG) cargo from Australia's North West Shelf export plant  trading sources said.",
        "date": "06172015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton offers one LNG cargo from Australian export plant "
    },
    {
        "content": "CANBERRA  June 3 BHP Billiton   the world's biggest mining company  warned on Wednesday that a global oversupply of commodities that is putting pressure on prices is likely to be be prolonged.",
        "date": "06032015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton warns global commodity supply glut to persist "
    },
    {
        "content": "BHP Billiton Plc will pay $25 million to settle charges that it violated a U.S. anti-bribery law by failing to properly monitor a program under which it paid for dozens of foreign government officials to attend the 2008 Summer Olympics in Beijing.",
        "date": "05202015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "U.S. SEC fines BHP Billiton $25 mln in 2008 Olympics bribery probe "
    },
    {
        "content": "* Iron ore  oil lower   (Adds analysis  quotes  stocks on the move)",
        "date": "05192015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Australia shares down  but losses narrow as South32  banks rally "
    },
    {
        "content": "May 20 BHP Billiton Plc will pay $25 million to settle charges that it violated a U.S. anti-bribery law by failing to properly monitor a program under which it paid for dozens of foreign government officials to attend the 2008 Summer Olympics in Beijing.",
        "date": "05202015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-UPDATE 2-U.S. SEC fines BHP Billiton $25 mln in 2008 Olympics bribery probe "
    },
    {
        "content": "BHP Billiton Plc will pay $25 million to settle charges that it violated a U.S. anti-bribery law by failing to properly monitor a program under which it paid for dozens of foreign government officials to attend the 2008 Summer Olympics in Beijing.",
        "date": "05202015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "SEC fines BHP Billiton $25 million in 2008 Olympics bribery probe "
    },
    {
        "content": "SYDNEY  May 19 A proposed Australian Senate inquiry into the economic impact of a slump in the price of iron ore could damage the country's economy and drive Asian customers to shift investment to Brazil  BHP Billiton CEO Andrew Mackenzie said on Tuesday.",
        "date": "05192015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP chief comes out swinging against Australian iron ore inquiry "
    },
    {
        "content": "May 20 BHP Billiton Plc will pay $25 million to settle charges that it violated a U.S. anti-bribery law by failing to properly monitor a program under which it paid for dozens of foreign government officials to attend the 2008 Summer Olympics in Beijing.",
        "date": "05202015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 2-U.S. SEC fines BHP Billiton $25 mln in 2008 Olympics bribery probe "
    },
    {
        "content": "SYDNEY  May 18 Australian shares are set to open steady on Monday  with all eyes on BHP Billiton's  spin-off of South32  the country's biggest new listing in 15 years.     U.S. stocks were little changed on Friday  although confidence may be boosted by opinion polls suggesting support for last week's Federal Budet proposals  as well as firmer copper and gold prices.     The local share price index futures rose 2 points to 5749.0  a 13.5-point premium to the underlying S&P/ASX 200 ind",
        "date": "05172015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Australia shares seen steady  eyes on South32 listing "
    },
    {
        "content": "SYDNEY  May 19 A proposed Australian Senate inquiry into the economic impact of a slump in the price of iron ore could damage the country's economy and drive Asian customers to shift investment to Brazil  BHP Billiton CEO Andrew Mackenzie said on Tuesday.",
        "date": "05192015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP chief comes out swinging against Australian iron ore inquiry "
    },
    {
        "content": "May 20 BHP Billiton  has agreed to pay $25 million to settle U.S. regulatory charges that it improperly sponsored the attendance of foreign government officials at the 2008 Summer Olympics in Beijing.",
        "date": "05202015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "U.S. SEC fines BHP Billiton $25 mln over 2008 Olympics dealings "
    },
    {
        "content": "MELBOURNE  May 18 BHP Billiton's   spin-off of South32 debuts on Monday in what is set to be the biggest mining listing globally in four years and a test of whether investors are starting to see value in battered mining shares.",
        "date": "05172015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-BHP spin-off South32 to test appetite for miners "
    },
    {
        "content": "* 94 shares up  90 shares down  17 unchanged   (Adds analysis  quotes  stocks on the move)",
        "date": "05202015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia shares hit 3-1/2 months lows as banks  miners slide "
    },
    {
        "content": "* Citigroup upgrade lifts Weir   (Updates with closing prices)",
        "date": "05182015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "British FTSE's advance hindered by drops in Hikma  Lloyds "
    },
    {
        "content": "SINGAPORE BHP Billiton expects growth in iron ore supply to outpace demand and keep prices under pressure  a senior official said on Thursday  but added that boosting earnings will not hinge on restraining production.",
        "date": "05142015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Growing supply to keep pressure on iron ore prices: BHP Billiton "
    },
    {
        "content": "* Adjustment to the terms and conditions of Nedbank's  BHP Billiton Plc share instalment - BILNIL",
        "date": "05152015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BRIEF-Nedbank Ltd adjusts terms of share instalment with BHP Billiton "
    },
    {
        "content": "MELBOURNE  May 17 BHP Billiton's   spin-off of South32 debuts on Monday in what is set to be the biggest mining listing globally in four years and a test of whether investors are starting to see value in battered mining shares.",
        "date": "05172015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP spin-off South32 to test appetite for miners "
    },
    {
        "content": "SYDNEY BHP Billiton's   spin-off South32   began trading with a market value of about $9 billion on Monday  a third below the highest forecasts and underlining investor nerves about the outlook for the battered mining sector.",
        "date": "05182015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP spin-off South32 has cautious debut  valued at $9 billion "
    },
    {
        "content": "SINGAPORE  May 14 BHP Billiton expects growth in iron ore supply to outpace demand and keep prices under pressure  a senior official said on Thursday  but added that boosting earnings will not hinge on restraining production.",
        "date": "05142015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Growing supply to keep pressure on iron ore prices - BHP Billiton "
    },
    {
        "content": "SYDNEY/MELBOURNE  May 15 Australian Prime Minister Tony Abbott on Friday threw his support behind a proposed Senate inquiry into the economic impact of a slump in the price of iron ore  ratcheting up pressure on top producers Rio Tinto and BHP Billiton.",
        "date": "05152015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "REFILE-UPDATE 2-Australian PM backs Senate probe into iron ore slump "
    },
    {
        "content": "SYDNEY  May 13 BHP Billiton and Rio Tinto face mounting political pressure in Australia over taxes and flooding the global iron ore market while the price of the steel-making commodity plummeted.",
        "date": "05132015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "RPT-BHP  Rio Tinto face political heat in Australia over strategies "
    },
    {
        "content": "LONDON  May 12 BHP Billiton   said on Tuesday it would slash its iron ore production cost further and cut spending to better withstand a downturn in commodity prices that is testing even mining industry heavyweights.",
        "date": "05122015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "RPT-UPDATE 3-BHP plans deeper cost cuts to battle commodity rout "
    },
    {
        "content": "SYDNEY  May 11 Fortescue Metals Group  Chairman Andrew \"Twiggy\" Forrest on Monday called on Australians to urge the government to stop expansion plans by iron ore miners Rio Tinto and BHP Billiton  saying they were jeopardizing the economy.",
        "date": "05112015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Fortescue founder asks Australians to fight Rio  BHP iron ore plans "
    },
    {
        "content": "* Company worth 30 pct less than highest hopes   (Updates with London shares  comment)",
        "date": "05182015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 3-BHP spin-off South32 has cautious debut  valued at $9 bln "
    },
    {
        "content": "SYDNEY  May 13 BHP Billiton and Rio Tinto face mounting political pressure in Australia over taxes and flooding the global iron ore market while the price of the steel-making commodity plummeted.",
        "date": "05132015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP  Rio Tinto face political heat in Australia over strategies "
    },
    {
        "content": "LONDON BHP Billiton said on Tuesday it would slash its iron ore production cost further and cut spending to better withstand a downturn in commodity prices that is testing even mining industry heavyweights.",
        "date": "05122015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP plans deeper cost cuts to battle commodity rout "
    },
    {
        "content": "LONDON  May 18 Britain's top share index pulled back on Monday as a drop in Hikma shares helped drag the index away from near record highs  despite support from major mining companies.",
        "date": "05182015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Britain's FTSE edges lower as Hikma  Lloyds fall "
    },
    {
        "content": "* Cuts 2016 spending by deferring shale oil  iron projects   (Adds Rio Tinto CEO comments  details on BHP capex cuts)",
        "date": "05122015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 3-BHP plans deeper cost cuts to battle commodity rout "
    },
    {
        "content": "* Citigroup upgrade lifts Weir   (Adds quote  detail  recasts)",
        "date": "05182015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Britain's FTSE near record high; Hikma's loss holds index back "
    },
    {
        "content": "LONDON  May 12 BHP Billiton   the world's largest mining company  said on Tuesday it would cut its capital and exploration expenditure to $9 billion in the 2016 financial year from $12.6 billion in 2015.",
        "date": "05122015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton cuts 2016 spending  iron ore cost forecast "
    },
    {
        "content": "May 18 The following bids  mergers  acquisitions and disposals were reported by 1020 GMT on Monday:",
        "date": "05182015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "MELBOURNE Standard & Poor's warned on Monday it may cut BHP Billiton's credit rating in the next 12 months  reflecting the global miner's commitment never to cut its dividend  even in the face of weak prices for its two biggest earners.",
        "date": "05042015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "S&P warns BHP rating vulnerable to weak iron ore  oil prices "
    },
    {
        "content": "MELBOURNE/LONDON BHP Billiton's shareholders are expected to approve the biggest ever spin-off in the mining industry on Wednesday  seeking to wring more value out of a string of long-neglected aluminum  manganese  silver and nickel assets.",
        "date": "05032015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP's South32 risks tough market debut  M&A talk swirls "
    },
    {
        "content": "PERTH/LONDON Rio Tinto is to stick with plans to produce iron ore at full tilt despite a plunge in prices  turning up the heat on rivals large and small  which are struggling to cope with the consequences of a supply glut.",
        "date": "05072015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Rio Tinto unshakeable on iron ore expansion plans "
    },
    {
        "content": "* S&P maintained BHP credit rating but downgraded outlook   (Updates after final vote results)",
        "date": "05062015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 2-Shareholders seal BHP's transformational South32 demerger "
    },
    {
        "content": "LONDON  May 18 European shares edged down in early trading on Monday  with BHP Billiton leading the market lower after a cautious debut for its spin-off South32  and Austrian energy group OMV falling after a drop in profits.",
        "date": "05182015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "European shares edge lower  BHP Billiton slips after spin-off "
    },
    {
        "content": "SYDNEY  May 18 Australian shares fell on Monday as BHP Billiton tumbled to reflect its new valuation after spinning off its non-core businesses and as investors sold bank stocks on concerns dividend growth may slow.",
        "date": "05182015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia shares slump as investors re-value BHP after spinoff and banks decline "
    },
    {
        "content": "* CSL  Woolworths  IAG  QBE among bottom movers by index weight",
        "date": "05012015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Australia shares snap 3 days of fall; rise 0.5 pct "
    },
    {
        "content": "May 4 The following bids  mergers  acquisitions and disposals were reported by 0930 GMT on Monday:",
        "date": "05042015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "PERTH  May 7 Rio Tinto  said on Thursday it would continue producing iron ore at full tilt  despite a 55 percent plunge in prices since the start of last year  even as rivals BHP Billiton and Brazil's Vale  lightly tap the brakes.",
        "date": "05072015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Rio Tinto unshakeable in drive for more iron ore "
    },
    {
        "content": "LONDON/PERTH BHP shareholders overwhelmingly approved the spin-off of new mining and metals group South32  clearing the way for a listing this month that will test investor sentiment towards the battered mining sector.",
        "date": "05072015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Shareholders seal BHP's transformational South32 demerger "
    },
    {
        "content": "LONDON  May 6 BHP Billiton   shareholders approved the spin-off of the global miner's smaller assets into South32 on Wednesday  paving the way towards a listing on May 18.",
        "date": "05062015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-BHP Billiton shareholders approve demerger of mining firm South32 "
    },
    {
        "content": "* BHP spin-off weighs on resources   (Adds analysis  quotes  stocks on the move)",
        "date": "05182015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia shares fall as banks  BHP Billiton head south "
    },
    {
        "content": "(Adds company news)     LONDON  May 4 Germany's DAX and France's CAC share indexes headed for a slightly higher open on Monday  catching up with gains in the U.S. market on Friday  when major European markets were closed for the May Day holiday.     The UK market  which was open on Friday  is shut for business on Monday.      At 0649 GMT  futures for Germany's DAX and France's CAC were up 0.4 percent and 0.2 percent respectively  while the Euro STOXX 50  futures were flat.     U.S",
        "date": "05042015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "European Factors to Watch-Shares seen opening slightly higher "
    },
    {
        "content": "LONDON  May 6 BHP Billiton   shareholders approved the spin-off of the global miner's smaller assets into South32 on Wednesday  paving the way towards a listing on May 18.",
        "date": "05062015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton shareholders approve demerger of mining firm South32 "
    },
    {
        "content": "PERTH  May 6 Newly formed mining and metals group South32 is open to acquisitions once it breaks from BHP Billiton    its CEO-elect Graham Kerr said on Wednesday.",
        "date": "05062015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP spin-off South32 sees M&A opportunities "
    },
    {
        "content": "SINGAPORE/MELBOURNE  May 6 Rio Tinto  the most profitable iron ore producer  is in a strong position to keep its mines running at full tilt  even as rivals BHP Billiton and Brazil's Vale  apply the brakes in a market suffering a supply glut.",
        "date": "05062015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Rio Tinto tipped to stick to no-output cut mantra on iron ore "
    },
    {
        "content": "MELBOURNE  April 29 BHP Billiton's   proposed spin-off company  South32  is likely to debut on the Australian bourse with a market capitalisation of A$8.5 billion ($6.8 billion)  Morgan Stanley analysts estimate.",
        "date": "04292015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "South32 seen listing at A$8.5 bln market value - Morgan Stanley "
    },
    {
        "content": "LAUNCESTON  Australia  (Clyde Russell is a Reuters columnist. The views expressed are his own.)",
        "date": "04232015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Iron ore rallies on small BHP output deferral? Ridiculous: Russell "
    },
    {
        "content": "--Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "04232015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-Iron ore rallies on small BHP output deferral? Ridiculous: Russell "
    },
    {
        "content": "SYDNEY BHP Billiton is slowing down its expansion plans in iron ore  the first big miner to pull back as a global supply glut sends ore prices tumbling.",
        "date": "04222015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP blinks as iron ore prices fall  delays output boost "
    },
    {
        "content": "* Ups FY2015 total iron ore production guidance   (Adds analyst comments  context on small miner shutdowns)",
        "date": "04222015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 4-BHP blinks as iron ore prices fall  delays output boost "
    },
    {
        "content": "* Iluka Resources  Qantas  BoQ  ASX bottom movers   (Adds analysis  quotes  stocks on the move)",
        "date": "04162015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Australia shares snap 3-day losing streak on commodity gains "
    },
    {
        "content": "* Graphic: http://graphics.thomsonreuters.com/15/04/COPPER.jpg",
        "date": "04122015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "New reckoning for copper miners now running in the red "
    },
    {
        "content": "SYDNEY  April 14 Australian shares fell 0.2 percent on Tuesday as investors backed away from testing 6 000 points on the benchmark index  selling mining stocks like BHP Billiton and Rio Tinto amid a slump in iron ore prices.",
        "date": "04142015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "REFILE-Australia shares retreat from 6 000 barrier as iron ore slumps "
    },
    {
        "content": "* Consumer sentiment sluggish   (Adds quotes  stocks on the move)",
        "date": "04142015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Australia shares slip as investors baulk at 6 000  iron ore weakness "
    },
    {
        "content": "MELBOURNE  April 10 BHP Billiton   came under fire from Australian Senators on Friday for not revealing how much profit it made or tax it paid at its Singapore marketing hub  amid a wider inquiry into profit-shifting by multinationals to avoid tax.",
        "date": "04102015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP  Rio Tinto grilled over Singapore marketing hubs "
    },
    {
        "content": "MELBOURNE Australia is pursuing global miners BHP Billiton and Rio Tinto for shifting billions of dollars in iron ore profits through marketing hubs in Singapore that pay almost no tax  the Australian Financial Review reported on Tuesday.",
        "date": "04072015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Australia chases BHP  Rio Tinto on Singapore tax shelter: AFR "
    },
    {
        "content": "SYDNEY  April 10 Australian shares are likely to have a cautious start on Friday  after Wall Street ended higher and global miner BHP Billiton set to open sharply lower following another slide in its U.S. ADRs.     The local share price futures index edged up 0.3 percent to 5 951.0  a 16-point premium to the close of the underlying S&P/ASX 200 index. The benchmark fell 0.5 percent on Thursday  but remained within sight of a seven-year peak of 5 996.9 set last month.     New Zealand's",
        "date": "04092015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Australia shares set to open cautiously  NZ shares steady "
    },
    {
        "content": "* Australia pursuing multibillion-dollar claims on BHP  Rio -AFR",
        "date": "04072015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-Australia chases BHP  Rio Tinto on Singapore tax shelter - AFR "
    },
    {
        "content": "--Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "03272015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-COLUMN-Forrest's iron ore cap \"harebrained\" or clever tactics?: Russell "
    },
    {
        "content": "SANTIAGO  March 25 Torrential downpours in the north of Chile  the world's biggest copper producer  have forced companies to suspend operations at several of the area's major mines  putting an estimated 1.5 million tonnes of capacity of the red metal on hold.",
        "date": "03252015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 3-Miners suspend operations in Chile as heavy rains flood roads "
    },
    {
        "content": "SYDNEY  March 16 Australian shares are set to open lower on Monday  with top stock BHP Billiton and the energy sector under pressure from weaker oil prices  and National Australia Bank weighed down by uncertainty over the outlook for its UK assets.     Local share price index futures fell 0.2 percent to 5 801.0 to sit at a 13.5-point discount to the underlying S&P/ASX 200 index close. The benchmark fell 0.7 percent last Friday.     New Zealand's benchmark NZX 50 index gained 5.1 poin",
        "date": "03152015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Australian shares set to dip on weaker oil  NAB woes "
    },
    {
        "content": "MELBOURNE BHP Billiton  has positioned its South32 spin-off for future growth  tipping in much less debt than expected to the new company made up of BHP's unloved assets when it lists in May.",
        "date": "03162015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton to spin off South32 with little debt "
    },
    {
        "content": "* BHP expects to reap more savings after split   (Recasts  adds analyst comments)",
        "date": "03162015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP Billiton to spin off South32 with little debt "
    },
    {
        "content": "MELBOURNE  March 17 BHP Billiton   has put a $12.95 billion valuation on the assets it is set to spin off in June and loaded it with much less debt than analysts had forecast  positioning the new company  South32  to grow.",
        "date": "03162015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton values South32 spin-off at $13 bln "
    },
    {
        "content": "MELBOURNE  March 12 BHP Billiton   said it has suspended its Blackwater coal operations in Australia after a worker at the mine  a father of two and grandfather of two  was killed in a truck accident on Thursday.",
        "date": "03122015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP halts work at Blackwater coal mine after worker killed "
    },
    {
        "content": "-- Clyde Russell is a Reuters columnist. The views expressed are his own. --",
        "date": "03112015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-Who benefits from the iron ore supply glut? Nobody?: Russell "
    },
    {
        "content": "MELBOURNE/LONDON BHP Billiton said a proposed $13 billion spinoff of South32 would give the world's biggest miner a strong chance to ride out tough conditions in commodity markets and was a more attractive option than an asset sale.",
        "date": "03172015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP hopes South32 spinoff will help it to shine in low-price markets "
    },
    {
        "content": "MELBOURNE BHP Billiton plans to spin off its aluminum  manganese  nickel  silver and some coal assets into a company called South32 in May. On Tuesday  it gave investors their first detailed look at the new company.",
        "date": "03172015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Factbox: BHP spin-off South32 by the numbers "
    },
    {
        "content": "* BHP expects to reap more savings after split   (Updates with CEO comments after press briefing)",
        "date": "03172015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 3-BHP hopes South32 spinoff will help it to shine in low-price markets "
    },
    {
        "content": "LONDON  March 17 Britain's top share index edged higher on Tuesday to extend a recent rebound from last week's lows  led by a recovery in Tullow Oil as investors bought into beaten-down oil stocks.",
        "date": "03172015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Britain's FTSE edges higher as battered oil stocks rebound "
    },
    {
        "content": "* BHP rises after South32 spin-off details   (Recasts  adds quotes  details)",
        "date": "03172015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Britain's FTSE steadies as Sainsbury's update leaves supermarkets mixed "
    },
    {
        "content": "LONDON  March 17 Britain's top share index rose on Tuesday to extend a rebound after losing ground last week  lifted by supermarket group J Sainsbury and miner BHP Billiton.",
        "date": "03172015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Britain's FTSE continues to rebound as Sainsbury  BHP outperform "
    },
    {
        "content": "LAUNCESTON  Australia --Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "03172015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "South32 looks better bet than parent BHP Billiton: Russell "
    },
    {
        "content": "--Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "03172015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-South32 looks better bet than parent BHP Billiton: Russell "
    },
    {
        "content": "MELBOURNE  March 6 An Australian senator called for an inquiry into suspected foreign bribery at top companies including miner BHP Billiton  and contractor Leighton Holdings  saying the country needs tighter enforcement against corruption.",
        "date": "03062015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Australian senator seeks inquiry into BHP  Leighton bribery suspicions "
    },
    {
        "content": "LONDON  March 6 Britain's FTSE 100 index is seen opening down 3 to 6 points  or 0.1 percent lower on Friday  according to financial bookmakers. For more on the factors affecting European stocks  please click on            * The blue-chip FTSE 100 index closed up 0.6 percent at 6 961.14 points  near the 6 974.26 record it set this month  boosted by strong earnings from insurer Aviva.          * BHP BILLITON  - An Australian senator called for an inquiry into suspected foreign bribery ",
        "date": "03062015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK Stocks-Factors to watch on Friday  March 6 "
    },
    {
        "content": "(Repeats with no changes to text) --Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "02252015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "RPT-COLUMN-BHP in race between cost-cutting and commodity prices: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  Feb 25 The jump in BHP Billiton's shares after profits plunged shows a mindset akin to buying tickets for the Titanic's second voyage because the gash in the hull from striking the iceberg isn't as bad as feared.",
        "date": "02252015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP in race between cost-cutting and commodity prices: Russell "
    },
    {
        "content": "--Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "02252015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-BHP in race between cost-cutting and commodity prices: Russell "
    },
    {
        "content": "MELBOURNE Global miner BHP Billiton  posted a 31 percent drop in half-year profit as prices for all its main products collapsed  but beat market forecasts and flagged further belt tightening to withstand the tough conditions.",
        "date": "02232015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP Billiton half-year profit slides  ahead of forecasts "
    },
    {
        "content": "(Corrects to remove reference to BHP Billiton  which reported its half-yearly results at 4:30 p.m. ET on Monday  Feb. 23 (8:30 a.m. Australian Eastern Daylight Time on Tuesday  Feb. 24))       Federal Reserve Chair Janet Yellen gives semiannual testimony on the economy and monetary policy before the Senate Banking Committee. The markets will be focused on Yellen's two-day testimony  as investors further coalesce around the idea of an interest-rate hike by June or September. (1000/1500)      C",
        "date": "02232015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "CORRECTED-What to Watch in the Day Ahead - Tuesday  Feb. 24 "
    },
    {
        "content": "MELBOURNE  Feb 24 Global miner BHP Billiton   posted a 31 percent drop in half-year profit as prices for all its main products collapsed  but beat market forecasts and flagged further belt tightening to withstand the tough conditions.",
        "date": "02232015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP Billiton half-year profit slides  ahead of forecasts "
    },
    {
        "content": "MELBOURNE  Feb 24 Global miner BHP Billiton   reported a 31 percent slide in half-year profit  its weakest since 2013 as prices for its four main products collapsed  and flagged it would cut costs further to weather the weak market.",
        "date": "02232015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton half-year profit falls  beats forecasts "
    },
    {
        "content": "MELBOURNE  Feb 23 When global miner BHP Billiton   reports its half-year results on Tuesday  the only parts of the company that are likely to report profit growth are some of the unloved assets it aims to spin off by June.",
        "date": "02232015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-BHP Billiton spin-off a bright spot in commodities gloom "
    },
    {
        "content": "MELBOURNE  Feb 23 When global miner BHP Billiton   reports its half-year results on Tuesday  the only parts of the company that are likely to report profit growth are some of the unloved assets it aims to spin off by June.",
        "date": "02232015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton spin-off a bright spot in commodities gloom "
    },
    {
        "content": "LONDON  Feb 24 The head of the world's largest mining company BHP Billiton  said on Tuesday that the price of its main commodity  iron ore  is likely to fall in the near term under pressure from increasing global supply.",
        "date": "02242015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "RPT-UPDATE 1-BHP chief warns of continuing downward pressure on iron ore prices "
    },
    {
        "content": "SYDNEY  Feb 17 A cyclone gaining strength in waters off northern Australia is threatening coastal mining sites operated by BHP Billiton  Glencore and Rio Tinto.",
        "date": "02172015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Australian cyclone's forecast path crosses BHP  Rio  Glencore mines "
    },
    {
        "content": "LONDON  Feb 24 Britain's top equity index climbed to a record high on Tuesday as a rally in mining companies helped the three-decade-old blue-chip index to surpass its previous high  set in late 1999.",
        "date": "02242015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Britain's FTSE sets record high surpassing 1999 peak "
    },
    {
        "content": "MELBOURNE Global miner BHP Billiton  posted a 31 percent drop in half-year profit as prices for all its main products collapsed  but beat market forecasts and flagged further belt tightening to withstand the tough conditions.",
        "date": "02242015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton profit slides on commodities slump  pledges more spending cuts "
    },
    {
        "content": "SYDNEY Fortescue Metals Group  Australia's third biggest iron ore miner  posted a 81 percent dive in first-half profits after a halving in the price of the steel making ingredient hammered margins and outweighed record production.",
        "date": "02162015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Australia's Fortescue first-half profit plunges on weaker iron ore price "
    },
    {
        "content": "LONDON The head of the world's largest mining company BHP Billiton   said on Tuesday that the price of its main commodity  iron ore  is likely to fall in the near term under pressure from increasing global supply.",
        "date": "02242015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP chief warns of continuing downward pressure on iron ore prices "
    },
    {
        "content": "MELBOURNE  Feb 16 BHP Billiton   has agreed to sell its Pakistan gas business to a local firm  a unit of the Hashoo Group  for an undisclosed sum  the global miner said on Monday.",
        "date": "02162015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP agrees to sell Pakistan gas business "
    },
    {
        "content": "LONDON  Feb 24 The head of the world's largest mining company BHP Billiton  said on Tuesday that the price of its main commodity  iron ore  is likely to fall in the near term under pressure from increasing global supply.",
        "date": "02242015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP chief warns of continuing downward pressure on iron ore prices "
    },
    {
        "content": "LONDON  Feb 24 Britain's top equity index steadied in sight of record highs on Tuesday  with a rally in global miner BHP Billiton after results offsetting a sharp decline in aircraft parts supplier Meggitt.",
        "date": "02242015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Britain's FTSE steadies below record high  BHP gains "
    },
    {
        "content": "LONDON  Feb 24 Britain's top equity index was steady in sight of record highs on Tuesday  as a rise in the shares of miner BHP Billiton offset a fall in mobile operator Vodafone.",
        "date": "02242015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "UK's FTSE steady as Billiton offsets fall in Vodafone "
    },
    {
        "content": "LONDON  Feb 24 European shares hit fresh seven-year highs on Tuesday on the back of better-than-expected results at BHP Billiton and expectations of cost savings at network operator Telefonica Deutschland from its E-Plus buy.",
        "date": "02242015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP profit beat helps European shares to fresh 7-yr high "
    },
    {
        "content": "SYDNEY  Feb 24 Global miner BHP Billiton  on Tuesday batted away suggestions of a turnaround in iron ore prices anytime soon - a bad omen for smaller producers struggling close to the break even point.",
        "date": "02242015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP's iron ore outlook holds little cheer for small miners "
    },
    {
        "content": "* Pan Pacific fails to reach deal with BHP on copper charges   (Recasts  adds closing prices)",
        "date": "02042015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "METALS-Copper trims gains as traders digest China central bank move "
    },
    {
        "content": "* Pan Pacific fails to reach deal with BHP on copper charges   (Recasts  adds analyst's comment  updates prices)",
        "date": "02042015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "METALS-Copper trims gains as dollar rise offsets China central bank move "
    },
    {
        "content": "* Coming up: U.S. ADP employment report for Jan at 1315 GMT   (Updates with official prices)",
        "date": "02042015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "METALS-Copper edges up after China cuts bank reserves requirement "
    },
    {
        "content": "TOKYO  Feb 4 Pan Pacific Copper  Japan's biggest smelter  said on Wednesday it had failed to agree on terms of copper processing fees with global miner BHP Billiton   for 2015.",
        "date": "02042015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Japan's Pan Pacific fails to reach deal with BHP on 2015 copper charges "
    },
    {
        "content": "LAUNCESTON  Australia  The latest production reports from mining giants BHP Billiton and Rio Tinto hammer home an uncomfortable truth: No matter how much output increases and costs are cut  falling commodity prices triumph.",
        "date": "01212015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "BHP  Rio production show scale of commodity price challenge: Russell "
    },
    {
        "content": "--Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "01212015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-COLUMN-BHP  Rio production show scale of commodity price challenge: Russell "
    },
    {
        "content": "--Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "01212015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "COLUMN-BHP  Rio production show scale of commodity price challenge: Russell "
    },
    {
        "content": "* Global miner sticks to plan to spin off South32   (Adds analyst comment  production details)",
        "date": "01202015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-BHP Billiton slashes shale drilling amid oil crash "
    },
    {
        "content": "MELBOURNE  Jan 21 BHP Billiton   said on Wednesday it would cut its shale drilling spend over the next six months as it looks to meet its promise not to cut dividends in the face of a collapse in iron ore  copper and oil prices.",
        "date": "01202015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Billiton slashes shale drilling amid oil crash "
    },
    {
        "content": "SYDNEY  Jan 21 BHP Billiton   said on Wednesday iron ore output climbed 16 percent to 56.35 million tonnes in the December quarter  fuelling concerns big mining houses would continue to saturate an already over-supplied global market",
        "date": "01202015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "BHP Dec qtr iron ore output up 16 pct as world glut mounts "
    },
    {
        "content": "* Analysts' consensus last Oct was for 350 000 T surplus this year",
        "date": "01142015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "UPDATE 1-Big global copper surplus? Mine cutbacks force rethink "
    },
    {
        "content": "LONDON  Jan 15 Britain's top share index rallied in early deals on Thursday  led up by a rebound in oil and commodity stocks.",
        "date": "01152015",
        "name": "BHP Billiton plc",
        "news_type": "topStory",
        "symbol": "BBL",
        "title": "Oil and commodity rebound sees Britain's FTSE rally "
    },
    {
        "content": "* Analysts' consensus last Oct was for 350 000 T surplus this year",
        "date": "01142015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "Big global copper surplus? Mine cutbacks force rethink "
    },
    {
        "content": "* Analysts' consensus last Oct was for 350 000 T surplus this year",
        "date": "01152015",
        "name": "BHP Billiton plc",
        "news_type": "normal",
        "symbol": "BBL",
        "title": "RPT-UPDATE 1-Big global copper surplus? Mine cutbacks force rethink "
    }
]