[
    {
        "content": "MADRID Broadly positive results from BBVA and Sabadell were overshadowed on Friday by growing fears over the impact of Catalonia's bid for independence.",
        "date": "10272017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "Catalonia casts shadow on positive BBVA  Sabadell results "
    },
    {
        "content": "* Sabadell shares fall 4.5 pct  BBVA down 1.8 pct (Adds quote from BBVA CEO on Catalonia  share move  details)",
        "date": "10272017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "UPDATE 2-Catalonia casts shadow on positive BBVA  Sabadell results "
    },
    {
        "content": "* 9-MONTH NET INTEREST INCOME 13.20 BILLION EUROS VERSUS 12.67 BILLION EUROS YEAR AGO",
        "date": "10272017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA Q3 net profit up at 1.14 bln euros "
    },
    {
        "content": "MADRID  Oct 27 Spain's BBVA posted on Friday a 18.5 percent increase in net profit in the third quarter against the same period last year due to a solid performance in its main market  Mexico.",
        "date": "10272017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "BBVA posts 18.5 pct rise in Q3 buoyed by Mexico "
    },
    {
        "content": "* SAID ON WEDNESDAY THE BOARD HAD AGREED TO PAY A CASH INTERIM DIVIDEND OF 0.09 EURO GROSS (0.07 EURO NET) PER SHARE ON ACCOUNT OF THE 2017 DIVIDEND  TO BE PAID ON OCT. 10",
        "date": "09282017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA to pay cash interim dividend of 0.09 euros/shr "
    },
    {
        "content": "MADRID  Sept 5 Spanish bank BBVA has been selected as the only interested party to buy Deutsche Bank's unit in Spain in the second round of its sale process  news outlet El Confidencial reported on Tuesday.",
        "date": "09052017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BBVA selected to buy Deutsche Bank Spain - El Confidencial "
    },
    {
        "content": "MADRID/TORONTO BBVA  said on Thursday it was looking at the possible sale of its retail bank in Chile after Canada's Bank of Nova Scotia  expressed an interest in buying up to 100 percent.",
        "date": "08312017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BBVA in talks to sell Chilean bank to Scotiabank "
    },
    {
        "content": "* Scotiabank focused on Asia Pacific region (Adds statement by Scotiabank)",
        "date": "08312017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "UPDATE 2-BBVA in talks to sell Chilean bank to Scotiabank "
    },
    {
        "content": "* SELLS LOAN PORTFOLIO WITH NOMINAL VALUE OF 600 MILLION EUROS TO COMPANY AFFILIATED WITH CERBERUS CAPITAL MANAGEMENT ‍​",
        "date": "07312017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA sells loan portfolio with nominal value of 600 mln euros ‍​ "
    },
    {
        "content": "MADRID Spanish bank BBVA  reported a 1.4 percent fall in quarterly net profit on Thursday as lower lending income in its home market was partially offset by a strong performance in Mexico.",
        "date": "07272017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BBVA's weak margins in Spain offset by strong Mexican performance "
    },
    {
        "content": "MADRID  July 27 Spanish bank BBVA reported a 1.4 percent fall in quarterly net profit on Thursday as lower lending income in its home market was partially offset by a strong performance in Mexico.",
        "date": "07272017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "UPDATE 1-BBVA's weak margins in Spain offset by strong Mexican performance "
    },
    {
        "content": "MADRID  July 27 Spain's BBVA posted on Thursday a 1.4 percent fall in net profit in the second quarter against the same period last year due to lower extraordinary gains and pressure on lending income in Spain.",
        "date": "07272017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "CORRECTED-Spain's BBVA Q2 net profit down 1.4 pct from same period last year "
    },
    {
        "content": "(The following statement was released by the rating agency) BARCELONA  July 27 (Fitch) Fitch Ratings has affirmed Spain-based Banco Bilbao Vizcaya Argentaria S.A.'s (BBVA) Long-Term Issuer Default Rating (IDR) at 'A-' with a Stable Outlook. A full list of rating actions is at the end of this rating action commentary. This rating action follows the revision of the Outlook on Spain's sovereign rating (see 'Fitch Revises Outlook on Spain to Positive; Affirms at 'BBB+'  dated 21 July 2017 at www.fit",
        "date": "07272017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "Fitch Affirms BBVA at 'A-'; Outlook Stable "
    },
    {
        "content": "* SAYS TRANSFERS PLOTS OF LAND WORTH 431 MILLION EUROS TO METROVACESA SA  TAKES PART IN NON-CASH CAPITAL INCREASE",
        "date": "07122017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA increases stake in Metrovacesa to 29.5 pct "
    },
    {
        "content": "(The following statement was released by the rating agency) TAIPEI  May 17 (Fitch) Fitch Ratings has affirmed Banco Bilbao Vizcaya Argentaria S.A.  Taipei Branch's (BBVA Taipei) National Long-Term Rating at 'AA(twn)' and National Short-Term Rating at 'F1+(twn)'. The Outlook is Stable. The rating action follows the affirmation of the ratings on its head office Banco Bilbao Vizcaya Argentaria  S.A. (BBVA  A-/Stable) (see <a href=\"https://www.fitchratings.com/site/pr/1022914\">Fitch Affirms BB",
        "date": "05182017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "Fitch Affirms and Withdraws BBVA Taipei Branch at 'AA(twn)' "
    },
    {
        "content": "* Says agrees to carry out an issue of contingent preferred securities convertible into newly issued ordinary shares of BBVA  with exclusion of pre-emptive subscription rights for shareholders  for a nominal amount of 500 million euros  ($554 million)",
        "date": "05162017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-Spain's BBVA agrees to issue additional Tier-1 debt for 500 mln euros "
    },
    {
        "content": "* Shares down 1.9 pct on lending revenue drop in Spain (Adds detail from conference call  share price  fund manager quote)",
        "date": "04272017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "UPDATE 2-Mexican peso swing drives BBVA profit jump but Spain drags "
    },
    {
        "content": "(The following statement was released by the rating agency) BARCELONA/LONDON  April 28 (Fitch) Fitch Ratings has affirmed Spain-based Banco Bilbao Vizcaya Argentaria  S.A.'s (BBVA) Long-Term Issuer Default Rating (IDR) at 'A-' and its Viability Rating (VR) at 'a-'. The Outlook on the Long-Term IDR is Stable. A full list of rating actions is at the end of this rating action commentary. In addition  Fitch has assigned an 'A-(dcr)' Derivative Counterparty Ratings (DCR) to BBVA as part of its roll-o",
        "date": "04282017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "Fitch Affirms BBVA at 'A-'; Outlook Stable "
    },
    {
        "content": "MADRID  April 27 Spain's BBVA posted on Thursday a near 70 percent rise in first quarter net profit from a year earlier  helped by extraordinary capital gains and lower provisions  and with a lift to revenues in its key market of Mexico.",
        "date": "04272017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "REFILE-Spain's BBVA posts 70 pct rise in Q1 profit from one-offs "
    },
    {
        "content": "(The following statement was released by the rating agency) TAIPEI  April 21 (Fitch) Fitch Ratings plans to withdraw the ratings on Banco Bilbao Vizcaya Argentaria S.A.  Taipei Branch on or about 17 May 2017 for commercial reasons. Fitch currently rates Banco Bilbao Vizcaya Argentaria S.A.  Taipei Branch as follows: --National Long-Term Rating at 'AA(twn)'; Outlook Stable --National Short-Term Rating 'F1+(twn)' Fitch reserves the right in its sole discretion to withdraw or maintain any rating at",
        "date": "04212017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "Fitch Plans to Withdraw Ratings on Banco Bilbao Vizcaya Argentaria S.A.  Taipei Branch "
    },
    {
        "content": "MADRID  March 16 Spain's second-biggest lender BBVA shut its office in Sydney at the end of last year and is downsizing branches in Japan and South Korea  sources close to the matter told Thomson Reuters' Basis Point on Thursday.",
        "date": "03162017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "Spanish bank BBVA shuts Sydney office  downsizes Japan and Korea branches "
    },
    {
        "content": "* To participate in share capital increase of UK's Atom with about 34.1 million euros ($36.0 million)",
        "date": "03032017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA to participate with 34.1 mln euros in capital increase of UK's Atom "
    },
    {
        "content": "MEXICO CITY  March 2 Spanish lender BBVA will invest $1.5 billion in Mexico over the next four to five years  its chairman  Francisco Gonzalez  said on Thursday at an event in Mexico City.    (Reporting by Anthony Esposito; Editing by Paul Simao)",
        "date": "03022017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BBVA to invest $1.5 bln in Mexico over next four to five years "
    },
    {
        "content": "MADRID  Feb 21 Spain's second-biggest lender BBVA said on Tuesday it had agreed to buy an extra 9.95 percent of Turkey's Garanti Bank from Dogus Holding for 859 million euros  ($905 million)  bringing its stake to just under 50 percent.",
        "date": "02212017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "Spain's BBVA ups stake in Turkey's Garanti to just under 50 pct "
    },
    {
        "content": "* Completes sale of almost all of its stake in Chinese bank CNCB for 554 million euros ($588.9 million)",
        "date": "02162017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA completes sale of 1.7 pct stake in CNCB for 554 mln euros "
    },
    {
        "content": "* AMERIGO EXECUTES MANDATE AGREEMENT WITH BBVA TO ARRANGE FINANCING FOR PHASE TWO OF THE CAUQUENES EXPANSION",
        "date": "02212017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "BRIEF-AMERIGO EXECUTES MANDATE AGREEMENT FOR FINANCING OF PHASE 2 OF CAUQUENES EXPANSION "
    },
    {
        "content": "MADRID BBVA  warned of a tougher business environment in Mexico this year while the Spanish bank's largest market adapts to the policies of U.S. President Donald Trump.",
        "date": "02012017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BBVA warns of tougher times ahead in Mexico after peso hit "
    },
    {
        "content": "MADRID  Feb 1 Spanish bank BBVA posted on Wednesday a 28 percent fall in fourth-quarter net profit due to a sharp drop in the peso in its largest market of Mexico and by one-off charges related to mis-sold mortgages.",
        "date": "02012017",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "Spain's BBVA posts 28 pct drop in Q4 profit  above estimates "
    },
    {
        "content": "Nov 2 Hong Kong stock exchange interest disclosure:",
        "date": "11022016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA cuts its long and short positions in China CITIC Bank "
    },
    {
        "content": "* Says to amortize 2.5 billion euros ($2.74 billion) of Dec. 2013 public covered bonds",
        "date": "10312016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA to amortize 2.5 billion euros of Dec. 2013 public covered bonds "
    },
    {
        "content": "* Ends September with capital of 11 pct   (Adds focus on cost cuts in Spain)",
        "date": "10272016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "UPDATE 2-BBVA Q3 profit improves  eyes cost-cutting in Spain "
    },
    {
        "content": "* Says expects staff to be reduced by 2 000 employees this year in Spain",
        "date": "10272016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA expects to reduce staff by 2 000 employees in 2016 in Spain "
    },
    {
        "content": "MADRID  Oct 27 BBVA  Spain's second-biggest bank  posted on Thursday a net profit of 965 million euros ($1.05 billion) in the third-quarter  above analysts' forecasts and helped by strong business in its key Mexican market.",
        "date": "10272016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "Spain's BBVA posts 23 percent Q3 profit rise on adjusted basis "
    },
    {
        "content": "* Signs merger agreement  formalizing absorption of Catalunya Banc",
        "date": "09012016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA formalizes merger with Catalunya Banc "
    },
    {
        "content": "* Net interest income at both banks unchanged   (Adds details from analyst calls  news conferences)",
        "date": "07292016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "UPDATE 2-Spain's BBVA  Caixabank report profit bounce  calm worries about new markets "
    },
    {
        "content": "* Files for mixed shelf offering with the U.S. SEC - SEC filing  Source: (http://bit.ly/2aygb4O) Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "07282016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA files for mixed shelf offering with the U.S. SEC - SEC filing "
    },
    {
        "content": "MADRID  July 29 BBVA  Spain's second-biggest bank  posted on Friday a 58 percent rise in second-quarter net profit from the previous three months  beating analysts' forecast  thanks to a series of one-offs and lower provisions against bad loans.",
        "date": "07292016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "BBVA posts 58 percent rise in Q2 profit  beats forecast "
    },
    {
        "content": "MADRID  July 22 Spain's second-biggest bank BBVA  is considering a fresh round of job cuts that could affect at least 2 000 people globally  Bloomberg reported on Friday  citing people with knowledge of the matter.",
        "date": "07222016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "Spain's BBVA considers fresh job cuts - report "
    },
    {
        "content": "* Said on Wednesday it would pay an interim dividend for fiscal year 2016 of 0.0648 euro ($0.0735) net per share on July 11",
        "date": "06232016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA to pay interim dividend of 0.0648 euro net/shr on July 11 "
    },
    {
        "content": "* Signs strategic collaboration with Red Hat to accelerate the group's  global transformation and technology-driven innovation processes",
        "date": "05252016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA signs strategic collaboration with Red Hat "
    },
    {
        "content": "(The following statement was released by the rating agency) TAIPEI  May 19 (Fitch) Fitch Ratings has affirmed Banco Bilbao Vizcaya  Argentaria S.A.  Taipei Branch's (BBVA Taipei) National Long-Term Rating at  'AA(twn)' and National Short-Term Rating at 'F1+(twn)'. The Outlook is Stable.  The rating action follows that on its head office Banco Bilbao Vizcaya  Argentaria  S.A. (BBVA  'A-'/Stable) (see 'Fitch Affirms Santander and BBVA at  'A-'; Outlook Stable'  dated 13 May 2016 and available at w",
        "date": "05192016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "Fitch Affirms BBVA Taipei Branch at 'AA(twn)'; Outlook Stable "
    },
    {
        "content": "* Shares in both banks fall following results   (Adds details and quotes from BBVA's CFO and CEO  Caixabank's chairman)",
        "date": "04282016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "UPDATE 3-Spanish banks' income drop overshadows capital improvement "
    },
    {
        "content": "* Says will take advantage of new TLTRO funding lines from the ECB  Further company coverage:    (Madrid Newsroom)",
        "date": "04282016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "BRIEF-Spain's BBVA says will take advantage of new ECB funding lines "
    },
    {
        "content": "MADRID  April 28 Spain's second-biggest lender BBVA expects a pick-up in net interest income in its domestic market throughout 2016 despite the pressure put on margins by low interest rates  its chief executive officer said.",
        "date": "04282016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "Spain's BBVA sees net interest income picking up in Spain in 2016 "
    },
    {
        "content": "* Says is not focused on \"addtional\" acquisitions in the United States  Source text for Eikon:  Further company coverage:    (Reporting by Madrid Newsroom)",
        "date": "04282016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA says is not focused on acquisitions in the US "
    },
    {
        "content": "* Says it is confident it will meet a fully-loaded core capital ratio target of 11 percent by 2017",
        "date": "04282016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA expects to meet capital ratio target of 11 pct by 2017 "
    },
    {
        "content": "MADRID  April 28 Spain's BBVA  the country's second-biggest lender  posted on Thursday a 54 percent fall in first quarter net profit from a year earlier  due to the lack of significant capital gains compared to the same period last year  and to the depreciation of currencies in emerging markets.",
        "date": "04282016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "BBVA posts 54 pct fall in Q1  misses forecasts "
    },
    {
        "content": "ISTANBUL  April 11 Spain's second-biggest bank BBVA  which has a majority stake in Turkey's Garanti  is looking to buy another bank in the country  Hurriyet newspaper reported on Monday  citing BBVA's chief executive Carlos Torres Vila.",
        "date": "04112016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "Spain's BBVA looking for another Turkish bank buy -paper "
    },
    {
        "content": "* Says to maintain dividend option at about 0.13 euro gross per share",
        "date": "03112016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA to maintain dividend option at 0.13 euro/share "
    },
    {
        "content": "* Says Holvi offers online banking for businesses  Source text: http://bbva.info/1TZ5xV4",
        "date": "03072016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA buys Finnish startup Holvi\u007f\u007f "
    },
    {
        "content": "* Says wants to reach a core tier 1 capital level under \"fully loaded\" criteria of 11 percent in 2017  Further company coverage:    (Madrid Newsroom)",
        "date": "02032016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA targets \"fully loaded\" core tier 1 capital of 11 pct in 2017 "
    },
    {
        "content": "MADRID  Feb 3 Spain's second-biggest bank BBVA  on Wednesday posted a 36.4 percent rise in net profit in the fourth quarter  helped by lower provisions against bad loans and a slowly recovering business which also lifted the lender's capital levels.",
        "date": "02032016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "UPDATE 1-Spain's BBVA Q4 net profit up 36 pct  capital improves "
    },
    {
        "content": "MADRID  Feb 3 Spain's second-biggest bank BBVA  on Wednesday posted a 36.4 percent rise in net profit in the fourth quarter from a year earlier to 940 million euros ($1 billion)  helped by lower provisions against bad loans and beating analysts' forecast.",
        "date": "02032016",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "Spain's BBVA Q4 net profit up 36 pct  beats forecast "
    },
    {
        "content": "MADRID  Nov 27 BBVA's global head of corporate finance  Francisco Rey  has left the Spanish bank after five years  a spokeswoman for BBVA confirmed on Friday.",
        "date": "11272015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BBVA corporate finance head Rey leaves bank "
    },
    {
        "content": "MADRID  Nov 24 Spain's BBVA has bought a 29.5 pct stake in aspiring online lender Atom for 45 million pounds ($68.2 million)  marking its first foray into British digital banking in a bid to boost its mobile presence.",
        "date": "11242015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "UPDATE 1-Spain's BBVA buys 29.5 pct stake in Atom for 45 mln pounds "
    },
    {
        "content": "MADRID  Nov 24 Spain's second largest bank BBVA  said on Tuesday it will acquire a 29.5 pct stake in British online lender Atom for 45 million pounds ($68.18 million).",
        "date": "11242015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "Spain's BBVA to buy 29.5 percent stake in Atom for 45 mln pounds "
    },
    {
        "content": "* Charge of 1.8 bln euros triggered by purchase of Garanti stake",
        "date": "10302015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "UPDATE 2-Spain's BBVA shares drop after 1.1 bln euros loss and capital decline "
    },
    {
        "content": "MADRID  Oct 30 Spain's second-biggest bank BBVA  on Friday posted a 1.1 billion euros ($1.21 billion) loss in the third quarter  worse than analysts' expectations for an 875 million euro loss  after taking by a writedown of 1.8 billion euros in Turkey.",
        "date": "10302015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "CORRECTED-UPDATE 1-Spain's BBVA posts 1.1 bln euros loss in Q3  hit by Turkey "
    },
    {
        "content": "MADRID  Oct 30 Spain's second-biggest bank BBVA  on Friday posted a 1.1 billion euros ($1.21 billion) loss in the third quarter  worse than analysts' expectations for a 875 million euro loss  as it was hit by a one-off writedown of 1.8 billion euros in Turkey.",
        "date": "10302015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "Spain's BBVA posts 1.1 bln euros loss in Q3  hit by Turkey "
    },
    {
        "content": "* It had completed the sale of its 29.68 percent stake in CITIC International Financial Holdings Ltd to China CITIC Bank Corp Ltd for 947 million euros  ($1.07 billion) in cash.",
        "date": "08272015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-Spain's BBVA says sale of CITIC bank unit stake will lift Tier 1 ratio "
    },
    {
        "content": "MADRID July 27 Spanish bank BBVA said on Monday a transaction giving it control of Turkey's Garanti bank would hit third quarter results by 1.8 billion euros ($2 billion)  a bigger sum that initially expected due to a depreciating lira currency.",
        "date": "07272015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "Spain's BBVA sees bigger hit from Garanti buy due to weak lira "
    },
    {
        "content": "* Says BBVA is comfortable with its current stake in Turkey's Garanti",
        "date": "07312015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-Spain's BBVA comfortable with current stake in Garanti-COO "
    },
    {
        "content": "* Fierce competition pressures Popular margins   (Adds details on Spanish business  outlook from Caixabank  BBVA)",
        "date": "07312015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "UPDATE 2-BBVA's Spanish turnaround leaves local rivals lagging "
    },
    {
        "content": "MADRID  July 31 BBVA  Spain's second-biggest bank by market value  on Friday said first half net profit more than doubled from a year earlier  beating expectations as revenue grew and the lender integrated its purchase of local peer Catalunya Banc.",
        "date": "07312015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "Spain's BBVA first-half profit doubles  beats forecast "
    },
    {
        "content": "June 10 The following bids  mergers  acquisitions and disposals were reported by 2020 GMT on Wednesday:",
        "date": "06102015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "MADRID Spanish bank BBVA  is considering making an offer for British bank HSBC's businesses in Brazil and Turkey  senior bank executive Vicente Rodero said at an annual meeting in Mexico City  website CNNExpansion reported on Wednesday.",
        "date": "06102015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "BBVA considers bid for HSBC's Brazil  Turkey units: report "
    },
    {
        "content": "MADRID  June 10 Spanish bank BBVA is considering making an offer for British bank HSBC's businesses in Brazil and Turkey  senior bank executive Vicente Rodero said at an annual meeting in Mexico City  website CNNExpansion reported on Wednesday.",
        "date": "06102015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "BBVA considers bid for HSBC's Brazil  Turkey units - report "
    },
    {
        "content": "(The following statement was released by the rating agency) TAIPEI/SYDNEY  May 28 (Fitch) Fitch Ratings has affirmed Banco Bilbao Vizcaya  Argentaria S.A.  Taipei Branch's (BBVA Taipei) National Long-Term Rating at  'AA(twn)' and National Short-Term Rating at 'F1+(twn)'. The Outlook is Stable.  The rating action follows the affirmation of the ratings on its head office   Banco Bilbao Vizcaya Argentaria  S.A. (BBVA  A-/Stable) (see \"Fitch Affirms  Santander and BBVA at 'A-'; Outlook Stable\" dated",
        "date": "05282015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "Fitch Affirms BBVA Taipei Branch at 'AA(twn)'; Outlook Stable "
    },
    {
        "content": "MADRID  May 4 Spanish bank BBVA said on Monday its board had named Carlos Torres Vila as its Chief Operating Officer  replacing Angel Cano  in a surprise management shake-up.",
        "date": "05042015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "Spain's BBVA names new number 2 in management shake-up "
    },
    {
        "content": "* Shares fall 1 percent   (Recasts with Venezuela troubles  adds analyst quote)",
        "date": "04292015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "UPDATE 2-BBVA doubles first-quarter profit on Mexico  one-off gains "
    },
    {
        "content": "* Says has completed acquisition of 98.4 percent Catalunya Banc for about 1.165 billion euros ($1.27 billion)",
        "date": "04242015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-Spain's BBVA finalizes acquisition of Catalunya Banc "
    },
    {
        "content": "* BBVA says has not provided credit line  as Sahara said in court",
        "date": "03252015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "UPDATE 3-Rescue plan for India's Sahara in doubt as BBVA denies loan "
    },
    {
        "content": "MADRID  March 25 Spanish bank BBVA has no credit exposure or relationship with Indian conglomerate Sahara  a bank spokesman said on Wednesday.",
        "date": "03252015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "Spain's BBVA denies credit exposure  relationship  with India's Sahara "
    },
    {
        "content": "MADRID  Feb 10 Spanish bank BBVA is to strengthen its capital base through issuing contingent convertible bonds worth 1.5 billion euros ($1.70 billion).",
        "date": "02102015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "UPDATE 1-Spain's BBVA to issue 1.5 bln euros in contingent convertible bonds "
    },
    {
        "content": "LONDON  Feb 5 (IFR) - Banco Bilbao Vizcaya Argentaria S.A. (BBVA SA) has mandated a group of bookrunners to lead manage a euro-denominated Additional Tier 1 (AT1) bond.",
        "date": "02052015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BBVA to hit the road for euro denominated AT1 "
    },
    {
        "content": "* Shares rise 2.6 percent  lead sector gains   (Recasts to include sale of CITIC stake)",
        "date": "02042015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "UPDATE 3-BBVA plots China sale as it bets on Spanish rebound "
    },
    {
        "content": "* CFO says BBVA's expected core capital ratio to be around 10 percent at end-2105 under Basel III fully-loaded criteria",
        "date": "02042015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA sees \"fully-loaded\" capital stable at 10 pct by year-end "
    },
    {
        "content": "LONDON  Feb 4 Spanish stocks outperformed flat-to-lower European indexes on Wednesday as results from bank BBVA and service sector data underpinned recovery expectations for the indebted country.",
        "date": "02042015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "Spain outpaces European shares as BBVA  data fuel recovery bet "
    },
    {
        "content": "LONDON  Feb 4 European shares were steady on Wednesday  boosted by strong figures by luxury goods group LVMH  and Spanish bank BBVA  among others.",
        "date": "02042015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "LVMH  BBVA help European shares steady after strong figures "
    },
    {
        "content": "* Shares rise 1.9 percent after Q4 earnings at market open  Source text for Eikon:  Further company coverage:    (Reporting By Paul Day; Editing by Sonya Dowsett)",
        "date": "02042015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "BRIEF-Shares in Spain's BBVA open up 1.9 percent after Q4 earnings "
    },
    {
        "content": "MADRID  Feb 4 Spain's second-biggest bank BBVA  on Wednesday reported a 689-million-euro ($790.5 million) fourth-quarter profit  beating forecasts  after making a loss in the same period a year ago.",
        "date": "02042015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "Spain's BBVA beats forecasts as 2014 profit rises 26 pct "
    },
    {
        "content": "* Says BBVA has sold 138.07 million H-shares  approximately 0.3 percent of Citic's total issued shares  via futures and options settlements in December",
        "date": "01262015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "BRIEF-BBVA sells China Citic Bank's shares "
    },
    {
        "content": "MADRID  Jan 23 Spanish bank BBVA has agreed to sell a 4.9 percent stake in China's CITIC Bank  to property developer Xinhu Zhongbao for HK$13.136 billion ($1.69 billion) as it looks to bolster its capital base.",
        "date": "01232015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "topStory",
        "symbol": "BBVA",
        "title": "UPDATE 1-Spain's BBVA sells 4.9 pct stake in China's CITIC to boost capital "
    },
    {
        "content": "MADRID  Jan 23 Spanish bank BBVA said on Friday it has agreed to sell a 4.9 percent stake in China's Citic Bank to UBS for HK$13.136 billion ($1.69 billion)  booking net capital gains of around 400 million euros ($450.40 million).",
        "date": "01232015",
        "name": "Banco Bilbao Viscaya Argentaria SA",
        "news_type": "normal",
        "symbol": "BBVA",
        "title": "Spain's BBVA to sell 4.9 pct of Citic for $1.7 billion "
    }
]