[
    {
        "content": "* AlarmForce and BCE update terms of arrangement to facilitate transfer of shares through a Holdco alternative",
        "date": "11152017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-AlarmForce and BCE update terms of arrangement to facilitate transfer of shares "
    },
    {
        "content": "* Alarmforce Industries - ‍board has unanimously approved deal for co to be acquired by BCE Inc & recommends that co's shareholders vote in favour of deal",
        "date": "11062017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Alarmforce to be acquired by BCE "
    },
    {
        "content": "* BCE Inc - ‍bell will acquire all issued and outstanding common shares of alarmforce for $16.00 per share in an all-cash offer​ Source text for Eikon: Further company coverage:",
        "date": "11062017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "BRIEF-BCE announces agreement to acquire Alarmforce Industries "
    },
    {
        "content": "Canadian telecommunications company BCE Inc  added more wireless subscribers than analysts had expected  helping it beat profit estimates for the third quarter and putting it on track to meet its financial targets for the year.",
        "date": "11022017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "Canada's BCE beats profit estimates on higher wireless subscriptions "
    },
    {
        "content": "Nov 2 Canadian telecommunications company BCE Inc added more wireless subscribers than analysts had expected  helping it beat profit estimates for the third quarter and putting it on track to meet its financial targets for the year.",
        "date": "11022017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "UPDATE 2-Canada's BCE beats profit estimates on higher wireless subscriptions "
    },
    {
        "content": "* Q3 earnings per share view C$0.85 -- Thomson Reuters I/B/E/S",
        "date": "11022017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "BRIEF-BCE reports Q3 earnings per share C$0.86 "
    },
    {
        "content": "Nov 2 Canadian telecommunications company BCE Inc reported a 2.4 percent rise in quarterly net income on Thursday  as more subscribers signed up for its wireless services.",
        "date": "11022017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Canadian BCE's profit rises as it adds more wireless subscribers "
    },
    {
        "content": "PITTSBURGH -- The Pittsburgh Steelers are learning that in spite of the explosive potential of their passing game  Le'Veon Bell sets the tone.",
        "date": "10232017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "Bell  Steelers run over Bengals "
    },
    {
        "content": "* Bell Canada says to redeem effective on Oct 9  prior to maturity  outstanding $300 million of 4.88% debentures  Series M-36  due April 26  2018 Source text for Eikon: Further company coverage:",
        "date": "10042017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Bell Canada to redeem outstanding $300 million of 4.88% debentures  series M-36  due April 26  2018 "
    },
    {
        "content": "* Bce- to redeem effective on oct 9  2017 prior to maturity  outstanding $300 million principal amount of 4.88% debentures  series m-36  due april 26  2018 Source text for Eikon: Further company coverage:",
        "date": "10042017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "BRIEF-Bell Canada announces redemption price for Series M-36 debentures due April 2018 "
    },
    {
        "content": "* Announced public offering of CDN $1.5 billion of MTN debentures in two series pursuant to its medium term notes (MTN) program Source text for Eikon: Further company coverage:",
        "date": "09262017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Bell Canada announces offering of MTN debentures "
    },
    {
        "content": "TORONTO  Aug 3 BCE Inc  Canada's largest telecom company  reported strong wireless growth on Thursday but signaled major cable rivals and smaller resellers were hurting its fixed-line business.",
        "date": "08032017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "UPDATE 2-Canada's BCE hurt by cable competition; wireless 'saves the day' "
    },
    {
        "content": "TORONTO  Aug 3 Canada's largest telecom company  BCE Inc  posted a 2.1 percent drop in second-quarter earnings on Thursday as expenses climbed  but stuck to its full-year forecast as the acquisition of regional operator Manitoba Telecom Services boosted revenue.",
        "date": "08032017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Canada's BCE profit drops as expenses rise; maintains outlook "
    },
    {
        "content": "* Says Bell 525 Relentless program resumed flight test activity after receiving experimental certificate renewal from FAA Source text for Eikon: Further company coverage:",
        "date": "07072017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Bell 525 Relentless resumes flight test program "
    },
    {
        "content": "* Bell Helicopter says its Bell 505 Jet Ranger X has been certified by the Federal Aviation Administration Source text for Eikon: Further company coverage:",
        "date": "06082017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Bell Helicopter says its Bell 505 Jet Ranger X receives FAA Certification "
    },
    {
        "content": "TORONTO A hacker who stole almost two million customer email addresses from Canada's largest telecommunications company sought payment from BCE Inc's  Bell Canada before posting some of the data online  a company spokesman said.",
        "date": "05172017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "Canada's Bell says it ignored hackers payment demands  some info leaked "
    },
    {
        "content": "May 15 BCE Inc  Canada's largest telecommunications company  said a hacker had accessed customer information containing about 1.9 million active email addresses and about 1 700 names and active phone numbers.",
        "date": "05152017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Canadian telecom company BCE says customer database hacked "
    },
    {
        "content": "TORONTO  May 16 A hacker who stole almost two million customer email addresses from Canada's largest telecommunications company sought payment from BCE Inc's Bell Canada before posting some of the data online  a company spokesman said.",
        "date": "05162017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "UPDATE 1-Canada's Bell says it ignored hackers payment demands  some info leaked "
    },
    {
        "content": "TORONTO  May 16 Canada's benchmark stock index edged higher on Tuesday as bank and resource shares eked out gains to help keep the market afloat.",
        "date": "05162017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "CORRECTED-CANADA STOCKS-TSX inches upward as banks  resource stocks gain "
    },
    {
        "content": "* Bell Canada announces illegal access of Bell customer information by an anonymous hacker",
        "date": "05152017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "BRIEF-Bell Canada announces illegal access of Bell customer information by an anonymous hacker "
    },
    {
        "content": "May 16 Canadian Privacy Commissioner Daniel Therrien said his agency is still gathering data about a hack at Bell Canada parent BCE Inc  which the country's largest telecommunications carrier said exposed about 1.9 million customer email addresses.",
        "date": "05162017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Canadian privacy chief says he is reviewing Bell hack "
    },
    {
        "content": "* Bell Canada - will redeem on May 12  prior to maturity  all outstanding $350 million principal amount of 4.37% debentures  series m-35  due Sept. 13  2017 Source text for Eikon: Further company coverage:",
        "date": "05012017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Bell Canada to redeem Series M-35 debentures due Sept. 2017 "
    },
    {
        "content": "* BCE reports first quarter 2017 results  announces updated 2017 financial targets",
        "date": "04262017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-BCE Q1 earnings per share C$0.78 "
    },
    {
        "content": "April 26 BCE Inc  Canada's largest telecommunications company  reported a better-than-expected quarterly profit on Wednesday  driven by an increase in net postpaid subscribers.",
        "date": "04262017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "UPDATE 1-Canadian telecom company BCE beats profit estimates "
    },
    {
        "content": "April 26 BCE Inc  Canada's largest telecommunications company  posted a 4 percent fall in quarterly profit  hurt by costs related to its acquisition of Manitoba Telecom Services.",
        "date": "04262017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Canadian telecom company BCE's profit falls 4 pct "
    },
    {
        "content": "* Textron reports first quarter 2017 results; updates 2017 financial outlook for Arctic Cat acquisition",
        "date": "04192017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Textron reports Q1 2017 revenue of $3.1 billion "
    },
    {
        "content": "* Telus finalizes deal to expand its wireless business in Manitoba",
        "date": "04032017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Telus finalizes deal to expand its wireless business in Manitoba "
    },
    {
        "content": "* Bell investing $854 million in Montréal to bring the fastest broadband fibre technology directly to homes and businesses across the city",
        "date": "03272017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Bell says investing $854 mln in Montréal "
    },
    {
        "content": "* Bell Canada - Co  Microsoft Canada announced availability of expanded suite of Microsoft Azure Cloud Services including compute  backup  disaster recovery  Source text for Eikon:  Further company coverage:",
        "date": "03272017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "BRIEF-Bell Canada  Microsoft Canada announce availability of expanded suite of Microsoft Azure Cloud Services "
    },
    {
        "content": "* Manitoba Telecom Services Inc - CEO Jay Forbes will be leaving company following expected successful closing of its pending transaction with BCE Inc  Source text for Eikon:  Further company coverage:",
        "date": "03032017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Manitoba Telecom Services says CEO will leave co after BCE merger "
    },
    {
        "content": "* Randy lennox appointed president of bell media following departure of mary ann turcke for a new opportunity with nfl  Source text for Eikon:  Further company coverage:",
        "date": "02272017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Bell says Randy Lennox appointed president of Bell Media "
    },
    {
        "content": "TORONTO  Feb 27 The head of BCE Inc's Bell Media unit has left the Canadian company to take a job at the National Football League  BCE said on Monday.",
        "date": "02272017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "BCE says head of its Bell Media unit leaves for NFL job "
    },
    {
        "content": "* Net proceeds of offering are intended to be used principally to partially fund acquisition by BCE of Manitoba Telecom Services",
        "date": "02222017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Bell announces offering of MTN debentures "
    },
    {
        "content": "Feb 15 Canada's business competition watchdog asked BCE Inc to sell six retail stores  some subscribers and telecom spectrum to gain approval of its deal to buy Manitoba Telecom Services.",
        "date": "02152017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "Regulator asks BCE to divest some assets to get MTS deal approval "
    },
    {
        "content": "* Bell acquisition of MTS receives final regulatory approvals from ISED and competition bureau  transaction set to close on march 17",
        "date": "02152017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "BRIEF-Bell acquisition of MTS receives final regulatory approvals from ISED  competition bureau "
    },
    {
        "content": "TORONTO  Feb 2 BCE Inc  Canada's largest telecommunications company  reported a slightly smaller-than-expected quarterly profit as it paid more to win wireless customers and forecast a 2017 profit below analysts' estimates  sending its shares lower.",
        "date": "02022017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "UPDATE 2-BCE's profit misses as it pays more to win wireless customers "
    },
    {
        "content": "* BCE reports 2016 Q4 and full-year results  announces 2017 financial targets - common share dividend increased 5.1 pct to $2.87 per year",
        "date": "02022017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "BRIEF-BCE reports Q4 EPS of C$0.75 "
    },
    {
        "content": "Feb 2 BCE Inc  Canada's largest telecommunications company  reported a 32.5 percent rise in quarterly profit as it added customers and earned more per subscriber in its postpaid wireless business.",
        "date": "02022017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Canada's BCE posts 32.5 pct jump in quarterly profit "
    },
    {
        "content": "* Bell has agreed to continue to serve in his role as CEO of company until June 30  2017",
        "date": "01302017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Dominion Diamond Corporation announces CEO transition "
    },
    {
        "content": "TORONTO  Jan 31 Bell Media  a unit of Canadian telecom company BCE Inc  said on Tuesday it is reducing its radio and television industry workforce in more than two dozen locations across the country by an unspecified number.",
        "date": "01312017",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Media unit of Canada's BCE cuts workforce in restructuring "
    },
    {
        "content": "* IBM -  Bell Canada will combine its mobility services with IBM's suite of apps",
        "date": "01172017",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-IBM and Bell transform enterprise mobility in Canada "
    },
    {
        "content": "BCE Inc  said on Tuesday it had received its first regulatory approval  from the Canadian Radio-television and Telecommunications  for its proposed C$3.1 billion ($2.3 billion) acquisition of Manitoba Telecom Services Inc .",
        "date": "12202016",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BCE gets first regulatory nod to buy Manitoba Telecom "
    },
    {
        "content": "* The advertising market remains soft across the industry -exec on conf call  Source text for Eikon:  Further company coverage:",
        "date": "11032016",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-BCE \"The advertising market remains soft across the industry\" "
    },
    {
        "content": "Nov 3 BCE Inc  Canada's largest telecommunications company  reported marginally better-than-expected revenue on Thursday  helped by an increase in net postpaid subscribers.",
        "date": "11032016",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "UPDATE 1-Canada's BCE revenue beats on higher postpaid subscriptions "
    },
    {
        "content": "* Board of directors has declared a quarterly dividend of $0.6825 per common share  payable on January 15  2017",
        "date": "11032016",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "BRIEF-BCE Q3 earnings per share C$0.87 "
    },
    {
        "content": "Nov 3 BCE Inc  Canada's largest telecommunications company  reported a 1.8 percent jump in quarterly profit on Thursday  helped by an increase in net postpaid subscribers.",
        "date": "11032016",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Canada's BCE reports 1.8 pct jump in quarterly profit "
    },
    {
        "content": "* MTN program will enable bell to offer up to C$4 billion of MTN debentures from time to time until October 20  2018",
        "date": "09302016",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Bell Canada renews medium term notes program "
    },
    {
        "content": "* Files for debt shelf of up to $4.0 billion - sec filing  Source text : http://bit.ly/2ccbAp3 Further company coverage:",
        "date": "09132016",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-BCE files for debt shelf of up to $4 bln "
    },
    {
        "content": "* Redeem on Sept. 16  2016  prior to maturity  all of outstanding $700 million principal amount of 5.00% debentures  series M-18  due Feb 15  2017",
        "date": "08172016",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Bell Canada to redeem series M-18 debentures due Feb. 2017 "
    },
    {
        "content": "* Canadian Olympic committee - COC and Bell announced their renewed partnership through to 2024  Source text for Eikon:  Further company coverage:",
        "date": "08162016",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Canadian Olympic Committee and Bell renew their partnership through to 2024 "
    },
    {
        "content": "* Public offering of C$1.5 billion of MTN debentures in two series pursuant to medium term notes program",
        "date": "08102016",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Bell Canada announces public offering of C$1.5 bln of MTN debentures "
    },
    {
        "content": "Bell Canada  Canada's largest telecommunications company  announced on Tuesday a public offering of C$1.5 billion of medium term notes (MTN) debentures in two series.",
        "date": "08102016",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Canada's Bell announces public offering of C$1.5 billion of medium term notes "
    },
    {
        "content": "TORONTO  Aug 4 BCE Inc  Canada's largest telecommunications company  reported a higher-than-expected quarterly profit on Thursday as it added more wireless subscribers who also paid more for service  while its internet and television growth slowed.",
        "date": "08042016",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "UPDATE 2-Canada's BCE profit beats on wireless  shares gain "
    },
    {
        "content": "Aug 9 Bell Canada  Canada's largest telecommunications company  announced on Tuesday a public offering of C$1.5 billion of medium term notes (MTN) debentures in two series.",
        "date": "08102016",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Canada's Bell announces public offering of C$1.5 bln of medium term notes "
    },
    {
        "content": "* Q2 revenue C$5.34 billion versus I/B/E/S view C$5.38 billion",
        "date": "08042016",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "BRIEF-BCE Q2 adjusted earnings per share C$0.94 "
    },
    {
        "content": "Aug 4 BCE Inc  Canada's largest telecommunications company  reported a 2.5 percent rise in quarterly profit as it added customers and earned more per subscriber in its wireless business.",
        "date": "08042016",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Canada's BCE reports 2.5 pct rise in quarterly profit "
    },
    {
        "content": "* Bell MTS will expand wireless and wireline broadband service in several communities in Northern Manitoba",
        "date": "07072016",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Bell and MTS to expand broadband service in Northern Manitoba "
    },
    {
        "content": "* Said on Wednesday it has signed a deal with Bell Polska Sp. z o.o. for the license and implementation of MS Dynamics NAC system with Acrebit's copyright solutions - Tool  WMS  E-logistic",
        "date": "06302016",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Acrebit signs deals with Bell Polska "
    },
    {
        "content": "* Mts receives court approval for BCE transaction  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "06292016",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Manitoba Telecom Services receives court approval for BCE transaction "
    },
    {
        "content": "* Arrangement resolution was approved by 99.66% of 43 098 172 votes cast by co's  shareholders  Source text for Eikon:  Further company coverage:     (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06232016",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-MTS shareholders approve acquisition by BCE "
    },
    {
        "content": "May 17 Quantenna Communications Inc  a U.S. company that designs Wi-Fi chips used in set-top boxes and wireless routers  has hired investment banks for an initial public offering (IPO) that could come later this year  people familiar with the matter said.",
        "date": "05172016",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Quantenna hires banks to prepare for IPO -sources "
    },
    {
        "content": "* Statement by government of Canada on Bell Canada petition of CRTC wholesale decision",
        "date": "05112016",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BRIEF-Statement by government of Canada on Bell Canada petition of CRTC Wholesale decision "
    },
    {
        "content": "BCE Inc's  C$3.1 billion ($2.5 billion) friendly bid for Manitoba Telecom Services (MTS)   the latest in a string of major Canadian telecom deals  is expected to test regulatory bounds and may need further concessions to win approval.",
        "date": "05022016",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BCE-Manitoba Telecom deal seen facing tough regulatory scrutiny "
    },
    {
        "content": "TORONTO  May 2 Canada's main stock index fell on Monday as lower oil prices weighed on energy stocks  offsetting gains for telecom stocks after BCE Inc said it would buy Manitoba Telecom Services Inc.",
        "date": "05022016",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "CANADA STOCKS-TSX falls as lower oil prices weigh on energy stocks "
    },
    {
        "content": "* Bce to sell a portion of MTS Wireless subscribers and assign certain dealer locations to Telus",
        "date": "05022016",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "BRIEF-Bce inc to sell a portion of MTS Wireless subscribers "
    },
    {
        "content": "* Bce to sell a portion of MTS wireless subscribers and assign certain dealer locations to TELUS",
        "date": "05022016",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "BRIEF-Bce to sell a portion of MTS Wireless subscribers "
    },
    {
        "content": "Canadian telecom and media company BCE Inc reported a slightly better-than-expected quarterly profit as it added more wireless customers and earned more for each one.",
        "date": "04282016",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "Canada's BCE posts better-than-expected profit "
    },
    {
        "content": "April 28 Canadian telecom and media company BCE Inc reported a slightly better-than-expected quarterly profit as it added more wireless customers and earned more for each one.",
        "date": "04282016",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "UPDATE 1-Canada's BCE posts better-than-expected profit "
    },
    {
        "content": "April 28 Canadian telecom and media company BCE Inc posted a 32.9 percent rise in quarterly profit as it added more customers and earned more per customer in its wireless business.",
        "date": "04282016",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Canada's BCE posts 33 pct rise in Q1 profit "
    },
    {
        "content": "TORONTO  Feb 4 BCE Inc  the Canadian telecommunications and media company  reported a drop in fourth-quarter profit as it paid more to win wireless business and for workers' severance  but raised its dividend and pointed to moderate growth in 2016.",
        "date": "02042016",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "UPDATE 2-Canada's BCE posts lower profit  raises dividend "
    },
    {
        "content": "TORONTO  Feb 4 Canadian telecom and media company BCE Inc posted a 8.5 percent fall in fourth-quarter profit on Thursday  raised its dividend by 5 percent  and pointed to moderate revenue and earnings growth in 2016.",
        "date": "02042016",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Canada's BCE posts lower profit  ups dividend "
    },
    {
        "content": "TORONTO  Nov 19 Canada's BCE Inc is expanding its control of HBO content in Canada  scooping up distribution rights in the west of the country from Corus Entertainment Inc and inking an extensive deal with the premium U.S. cable network that includes online delivery.",
        "date": "11192015",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "BCE Inc gets more HBO distribution rights in Canada "
    },
    {
        "content": "TORONTO BCE Inc posted a solid rise in third-quarter profit on Thursday  helped by its wireless customers spending more for service  the Canadian telecommunications company said.",
        "date": "11052015",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "Canada's BCE posts profit rise on wireless spending "
    },
    {
        "content": "TORONTO  Nov 5 BCE Inc posted a solid rise in third-quarter profit on Thursday  helped by its wireless customers spending more for service  the Canadian telecommunications company said.",
        "date": "11052015",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "UPDATE 1-Canada's BCE posts profit rise on wireless spending "
    },
    {
        "content": "TORONTO  Nov 5 BCE Inc posted a solid rise in third-quarter profit on Thursday  helped by its wireless customers spending more for service and strong growth in Internet and television subscriptions  the Canadian telecommunications company said.",
        "date": "11052015",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Canada's BCE posts profit on wireless spend  TV growth "
    },
    {
        "content": "TORONTO Canadian telecom and media company BCE Inc said on Friday it has sold its 15 percent stake in the Globe and Mail to the Woodbridge Company  giving the investment vehicle of Canada's Thomson family full control of the country's biggest national newspaper.",
        "date": "08142015",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "Thomson family's Woodbridge buys full control of Globe and Mail "
    },
    {
        "content": "TORONTO  Aug 14 Canadian telecom and media company BCE Inc said on Friday it has sold its 15 percent stake in the Globe and Mail to the Woodbridge Company  giving the investment vehicle of Canada's Thomson family full control of the country's biggest national newspaper.",
        "date": "08142015",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "UPDATE 1-Thomson family's Woodbridge buys full control of Globe and Mail "
    },
    {
        "content": "Aug 14 Woodbridge Company Ltd  the investment vehicle of Canada's Thomson family  gained full control of Canadian media company Globe and Mail Inc by acquiring the 15 percent stake owned by telecommunications company BCE Inc .",
        "date": "08142015",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Thomson family's Woodbridge takes full control of Globe and Mail "
    },
    {
        "content": "TORONTO  Aug 6 BCE Inc posted a 25 percent jump in second-quarter profit as its mobile business grew  offsetting lower advertising revenue at its media arm  Canada's largest telecommunications company said on Thursday.",
        "date": "08062015",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "UPDATE 1-Profit at Canada's BCE powered by wireless growth "
    },
    {
        "content": "TORONTO  Aug 6 BCE Inc posted a 25 percent jump in second-quarter profit as its mobile business grew  offsetting lower ad revenue in its media arm  Canada's largest telecom company said on Thursday.",
        "date": "08062015",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Canada's BCE posts 25 pct jump in second-quarter profit "
    },
    {
        "content": "TORONTO  April 30 A strong performance from BCE Inc's wireless unit helped Canada's largest telecom company post a modest gain in adjusted profit on Thursday  while its media division paid out for a new streaming service and higher sports content costs.",
        "date": "04302015",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "UPDATE 2-BCE's first-quarter profit helped by wireless  media drags "
    },
    {
        "content": "TORONTO  April 30 BCE Inc reported a 3.6 percent increase in its adjusted first-quarter earnings on Thursday  driven by strong results in its wireless business  Canada's largest telecom company said on Thursday.",
        "date": "04302015",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "BCE quarterly results lifted by strong wireless business "
    },
    {
        "content": "TORONTO The president of the media unit of BCE Inc  Canada's biggest communications company  parted ways with the company on Thursday with immediate effect  two weeks after he apologized for interfering in news coverage.",
        "date": "04092015",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BCE exec exits after apology for editorial interference "
    },
    {
        "content": "TORONTO  April 9 The president of the media unit of BCE Inc  Canada's biggest communications company  parted ways with the company on Thursday with immediate effect  two weeks after he apologized for interfering in news coverage.",
        "date": "04092015",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "UPDATE 1-BCE exec exits after apology for editorial interference "
    },
    {
        "content": "April 9 The president of BCE Inc's Bell Media would leave effective immediately  Canada biggest communications company said on Thursday  two weeks after the executive apologized for interfering in editorial coverage.",
        "date": "04092015",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "BCE media executive leaves weeks after apologizing for editorial intrusion "
    },
    {
        "content": "TORONTO  April 7 Canada's largest telecom company will scale back its profiling of customers  which BCE Inc uses to sell targeted advertising services  after a rebuke from the country's privacy commission.",
        "date": "04072015",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "Canada privacy watchdog raps BCE knuckles over targeted ads "
    },
    {
        "content": "TORONTO A senior executive at BCE Inc's Bell Media unit apologized on Wednesday for interfering in editorial coverage after Canada biggest communications company was harshly rebuked by the country's broadcast regulator.",
        "date": "03252015",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "BCE media executive apologizes for editorial intrusion "
    },
    {
        "content": "TORONTO  March 25 A senior executive at BCE Inc's Bell Media unit apologized on Wednesday for interfering in editorial coverage after Canada biggest communications company was harshly rebuked by the country's broadcast regulator.",
        "date": "03252015",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "UPDATE 1-BCE media executive apologizes for editorial intrusion "
    },
    {
        "content": "TORONTO  March 25 Canada's broadcast regulator scolded the country's biggest communications company BCE Inc  on Wednesday after a report alleged the head of its Bell Media unit interfered with coverage of a ruling that could prove painful for Bell.",
        "date": "03252015",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Canadian TV regulator scolds BCE over interference allegations "
    },
    {
        "content": "* Said on Tuesday SCOR Global Life has entered into a longevity insurance transaction with Sun Life Assurance Company of Canada (Sun Life)",
        "date": "03042015",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "CORRECTED-BRIEF-SCOR Global Life enters into longevity insurance transaction with Sun Life "
    },
    {
        "content": "TORONTO  March 3 Telecommunications provider BCE Inc has reached a deal to transfer the longevity risk for C$5 billion ($4.01 billion) of pension plan liabilities to insurer Sun Life Financial Inc  the companies said on Tuesday.",
        "date": "03032015",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "UPDATE 1-Telecoms firm BCE to shift pension fund longevity risk to Sun Life "
    },
    {
        "content": "TORONTO  March 3 Telecommunications provider BCE Inc has reached a deal to transfer the longevity risk for C$5 billion ($4.01 billion) of pension plan liabilities to insurer Sun Life Financial Inc  the companies said on Tuesday.",
        "date": "03032015",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Telecoms firm BCE to shift pension fund longevity risk to Sun Life "
    },
    {
        "content": "TORONTO  Feb 23 BCE Inc  Canada's largest telecommunications company  will appeal a ruling that blocks it from sending its own content to customers' mobile devices for lower rates than it charges for transmitting third-party data.",
        "date": "02232015",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Canada's BCE appeals mobile TV rate ruling "
    },
    {
        "content": "TORONTO  Feb 5 Canada's big telecom companies want as many high-paying customers as they can get  but some are clearly doing a better job at it than others.",
        "date": "02052015",
        "name": "BCE Inc",
        "news_type": "topStory",
        "symbol": "BCE",
        "title": "UPDATE 3-BCE outshines Rogers with wireless  Internet-TV strength "
    },
    {
        "content": "Feb 5 BCE Inc   Canada's largest telecom company  posted a nearly 10 percent increase in fourth-quarter profit  driven by strong results in its wireless business.",
        "date": "02052015",
        "name": "BCE Inc",
        "news_type": "normal",
        "symbol": "BCE",
        "title": "Canadian telecom company BCE's profit rises nearly 10 pct "
    }
]