[
    {
        "content": "* Q3 earnings per share view $2.95 -- Thomson Reuters I/B/E/S",
        "date": "10252017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-C R Bard reports Q3 earnings per share $1.25 "
    },
    {
        "content": "* BD announces extension of exchange offers and consent solicitations for C. R. Bard  Inc. Notes Source text for Eikon: Further company coverage:",
        "date": "10262017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-BD announces extension of exchange offers and consent solicitations for C. R. Bard  Inc. "
    },
    {
        "content": "BRUSSELS U.S. medical equipment supplier Becton Dickinson  secured EU antitrust approval for its $24-billion acquisition of U.S. peer C R Bard  after it agreed to sell two businesses to allay competition concerns.",
        "date": "10182017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "Becton Dickinson wins conditional EU approval for $24 billion Bard buy "
    },
    {
        "content": "BRUSSELS  Oct 18 U.S. medical equipment supplier Becton Dickinson secured EU antitrust approval for its $24-billion acquisition of U.S. peer C R Bard after it agreed to sell two businesses to allay competition concerns.",
        "date": "10182017",
        "name": "CR Bard Inc",
        "news_type": "normal",
        "symbol": "BCR",
        "title": "Becton Dickinson wins conditional EU approval for $24 bln Bard buy "
    },
    {
        "content": "* BD announces extension of exchange offers and consent solicitations for C R Bard Inc notes",
        "date": "09272017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-BD extends exchange offers and consent solicitations for C R Bard Inc notes "
    },
    {
        "content": "* C. R. Bard receives fda premarket approval of the lutonix® 035 drug coated balloon as the first and only DCB for the treatment of patients with dysfunctional av fistulae",
        "date": "08282017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-C. R. Bard receives FDA premarket approval of the Lutonix "
    },
    {
        "content": "* BD announces extension of exchange offers and consent solicitations for C. R. Bard Inc notes",
        "date": "08292017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-BD announces extension of exchange offers and consent solicitations for C. R. Bard Inc notes "
    },
    {
        "content": "* Bard shareholders approve proposed merger with becton  dickinson",
        "date": "08082017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-C.R. Bard shareholders approve proposed merger with Becton Dickinson "
    },
    {
        "content": "* Says in July  separate civil investigative demand was served to company by DOJ",
        "date": "07282017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-C R Bard receives civil investigative demand by DOJ in July "
    },
    {
        "content": "* BD announces extension of exchange offers and consent solicitations for C. R. Bard  Inc. Notes",
        "date": "08012017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-Becton Dickinson extends exchange for C. R. Bard  Inc. notes "
    },
    {
        "content": "* Q2 earnings per share view $2.84 -- Thomson Reuters I/B/E/S",
        "date": "07272017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-Bard announces Q2 earnings per share $1.86 "
    },
    {
        "content": "* Videocon Telecom existing business lines are projected to contribute a topline revenue of 13.58 billion rupees during FY 17-18",
        "date": "07042017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-Videocon Telecom launches CCTV brand Wallcam "
    },
    {
        "content": "June 29 Acquisitions of European companies surged in recent months  amid optimism about the region's economic prospects  but global deal-making subsided and the total value of U.S. deals fell sharply due to uncertainty about President Donald Trump's tax reform and deregulation agenda.",
        "date": "06292017",
        "name": "CR Bard Inc",
        "news_type": "normal",
        "symbol": "BCR",
        "title": "Europe M&A surges but U.S. slows sharply amid uncertainty "
    },
    {
        "content": "* BD announces extension of exchange offers and consent solicitations for C. R. Bard Inc notes",
        "date": "07032017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-BD reports extension of exchange offers and consent solicitations for C. R. Bard notes "
    },
    {
        "content": "* BD announces extension of exchange offers and consent solicitations for C. R. Bard  Inc notes",
        "date": "06052017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-BD announces extension of exchange offers  consent solicitations for C. R. Bard notes "
    },
    {
        "content": "* AngioDynamics - \"C.R. Bard has illegally tied sale of tip location systems to line of peripherally inserted central catheters \" as per lawsuit filed by co",
        "date": "05312017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-AngioDynamics lawsuit claims C.R. Bard is violating antitrust laws  harming competition  limiting access "
    },
    {
        "content": "* On May 12  2017  Becton Dickinson and Company entered into a three-year term loan agreement - SEC filing",
        "date": "05162017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-Becton Dickinson and Co entered into a three-year term loan agreement "
    },
    {
        "content": "May 12 China Resources Pharmaceutical Group Ltd -",
        "date": "05122017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-China Resources Pharmaceutical Group entered into sales framework agreement 2017 with Cr Healthcare "
    },
    {
        "content": "* BD announces exercise of option to purchase additional shares by underwriters of public equity offerings increasing total gross proceeds to $4.95 billion",
        "date": "05122017",
        "name": "CR Bard Inc",
        "news_type": "normal",
        "symbol": "BCR",
        "title": "BRIEF-BD announces exercise of option to purchase additional shares by underwriters of public equity offerings "
    },
    {
        "content": "* BD announces commencement of exchange offers and consent solicitations for C. R. Bard Inc notes",
        "date": "05052017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-Becton Dickinson announces commencement of exchange offers and consent solicitations "
    },
    {
        "content": "NEW YORK U.S. medical equipment supplier Becton Dickinson and Co will acquire C R Bard Inc  in a $24 billion cash-and-stock deal  adding Bard's devices to its portfolio in the high-growth sectors of oncology and surgery  both companies said on Sunday. | Video ",
        "date": "04242017",
        "name": "CR Bard Inc",
        "news_type": "normal",
        "symbol": "BCR",
        "title": "Becton Dickinson to acquire Bard for $24 billion "
    },
    {
        "content": "* Deal immediately accretive and expected to generate high single-digit accretion to adjusted EPS in fiscal year 2019 to Becton Dickinson",
        "date": "04232017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-Becton Dickinson to buy Bard for $24 billion "
    },
    {
        "content": "* Ceo timothy ring's fy 2016 total compensation $12.63 million versus $11.74 million in fy 2015 - sec filing",
        "date": "03152017",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-C R Bard CEO Timothy Ring's FY 2016 compensation $12.63 mln vs $11.74 mln in FY 2015 "
    },
    {
        "content": "* Q3 earnings per share view $2.55 -- Thomson Reuters I/B/E/S",
        "date": "10252016",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-C R Bard Q3 earnings per share $1.27 "
    },
    {
        "content": "* Priced public offering of 10-year senior notes in aggregate principal amount of $500 million and with interest rate of 3% per year  Source (http://bit.ly/1OeKDKZ) Further company coverage:",
        "date": "05042016",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-C R Bard prices note offering "
    },
    {
        "content": "* Says coo john weiland's fy 2015 total compensation $6.9 million versus $7.0 million in fy 2014",
        "date": "03162016",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "BRIEF-C R Bard CEO Timothy Ring's fy 2015 total compensation was $11.7 mln - sec filing "
    },
    {
        "content": "A federal appeals court has rejected a request from four plaintiffs suing C.R. Bard over transvaginal mesh to let their cases leave the West Virginia court where they have been consolidated with thousands of similar claims in multidistrict litigation.",
        "date": "02222016",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "4th Circuit won't let four mesh cases out of C.R. Bard MDL "
    },
    {
        "content": "A Missouri jury has cleared medical device manufacturers Boston Scientific and C.R. Bard of liability in the first trial involving a woman who said she was injured by transvaginal mesh devices made by more than one company.",
        "date": "02042016",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "Boston Scientific  C.R. Bard win defense verdicts in mesh trial "
    },
    {
        "content": "C.R. Bard has settled a lawsuit selected to serve as a bellwether trial in multidistrict litigation over transvaginal mesh devices  which had been scheduled to start this week.",
        "date": "02172015",
        "name": "CR Bard Inc",
        "news_type": "topStory",
        "symbol": "BCR",
        "title": "C.R. Bard settles bellwether case over transvaginal mesh "
    }
]