[
    {
        "content": "* Merit Medical signs purchase agreement with BD for divestment assets",
        "date": "11162017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Merit Medical signs purchase agreement with BD for divestment assets "
    },
    {
        "content": "* BD announces results for 2017 fourth fiscal quarter and full year; provides fiscal 2018 guidance",
        "date": "11022017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson says Q4 earnings per share $1.24 "
    },
    {
        "content": "* Retractable Technologies Inc says on Oct 27  court denied motion to alter or amend earlier judgment in co's case against Becton  Dickinson and Co​ Source text for Eikon: Further company coverage:",
        "date": "10312017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-U.S. court denies motion to reconsider Becton  Dickinson and Co. judgment "
    },
    {
        "content": "* BD announces extension of exchange offers and consent solicitations for C. R. Bard  Inc. Notes Source text for Eikon: Further company coverage:",
        "date": "10262017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-BD announces extension of exchange offers and consent solicitations for C. R. Bard  Inc. "
    },
    {
        "content": "* BD statement on European Commission conditional clearance of bard acquisition",
        "date": "10182017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-BD statement on European Commission conditional clearance of Bard acquisition "
    },
    {
        "content": "BRUSSELS  Oct 18 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10182017",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "EU mergers and takeovers (Oct 18) "
    },
    {
        "content": "BRUSSELS U.S. medical equipment supplier Becton Dickinson  secured EU antitrust approval for its $24-billion acquisition of U.S. peer C R Bard  after it agreed to sell two businesses to allay competition concerns.",
        "date": "10182017",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "Becton Dickinson wins conditional EU approval for $24 billion Bard buy "
    },
    {
        "content": "BRUSSELS  Oct 17 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10172017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "EU mergers and takeovers (Oct 17) "
    },
    {
        "content": "BRUSSELS  Oct 18 U.S. medical equipment supplier Becton Dickinson secured EU antitrust approval for its $24-billion acquisition of U.S. peer C R Bard after it agreed to sell two businesses to allay competition concerns.",
        "date": "10182017",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "Becton Dickinson wins conditional EU approval for $24 bln Bard buy "
    },
    {
        "content": "BRUSSELS  Oct 11 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10112017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "EU mergers and takeovers (Oct 11) "
    },
    {
        "content": "BRUSSELS  Oct 3 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10032017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "EU mergers and takeovers (Oct 3) "
    },
    {
        "content": "* BD announces extension of exchange offers and consent solicitations for C R Bard Inc notes",
        "date": "09272017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-BD extends exchange offers and consent solicitations for C R Bard Inc notes "
    },
    {
        "content": "BRUSSELS  Sept 28 U.S. medical equipment supplier Becton Dickinson and Co has offered concessions to address EU antitrust concerns over its $24 billion bid for U.S. peer Bard  the European Commission said on Thursday.",
        "date": "09282017",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "Becton Dickinson offers EU concessions over $24 bln Bard deal "
    },
    {
        "content": "Sept 28 The following bids  mergers  acquisitions and disposals were reported by 1930 GMT on Thursday:",
        "date": "09282017",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "BRUSSELS  Sept 28 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "09282017",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "EU mergers and takeovers (Sept 28) "
    },
    {
        "content": "BRUSSELS U.S. medical equipment supplier Becton Dickinson and Co  has offered concessions to address EU antitrust concerns over its $24 billion bid for U.S. peer Bard   the European Commission said on Thursday.",
        "date": "09282017",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "Becton Dickinson offers EU concessions over $24 billion Bard deal "
    },
    {
        "content": "* Becton Dickinson and Co - announces launch of BD rhapsody  a platform for RNA expression analysis",
        "date": "09122017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson and Co announces launch of platform for RNA expression analysis "
    },
    {
        "content": "* BD announces extension of exchange offers and consent solicitations for C. R. Bard Inc notes",
        "date": "08292017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-BD announces extension of exchange offers and consent solicitations for C. R. Bard Inc notes "
    },
    {
        "content": "* U.S. FDA provides update on its investigation into inaccurate results from certain lead tests‍​",
        "date": "08172017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-FDA provides update on its investigation into inaccurate results from certain lead tests‍​ "
    },
    {
        "content": "* On August 17  judge issued court's final judgment regarding RTI's suit against Becton  Dickinson and Co​",
        "date": "08182017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Retractable Technologies says court dismissed co's case against Becton  Dickinson and Co​ "
    },
    {
        "content": " (The August 17 story has been updated with a correct headline and first paragraph to show the FDA is still investigating blood tubes from Becton Dickinson and the tubes have not been ruled out yet)",
        "date": "08182017",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "FDA probes possible Becton Dickinson link to faulty lead tests (Aug. 17) "
    },
    {
        "content": "Aug 17 Blood collection tubes made by Becton Dickinson & Co that were used in conjunction with Magellan Diagnostics' lead-testing devices are still being investigated as a potential cause of inaccurate lead test results.",
        "date": "08182017",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "CORRECTED-FDA probes possible Becton Dickinson link to faulty lead tests (Aug. 17) "
    },
    {
        "content": "* Bard shareholders approve proposed merger with becton  dickinson",
        "date": "08082017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-C.R. Bard shareholders approve proposed merger with Becton Dickinson "
    },
    {
        "content": "* Q3 revenue $3.035 billion versus I/B/E/s view $3.06 billion",
        "date": "08032017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson and Co reports Q3 loss per share $0.75 "
    },
    {
        "content": "* BD announces extension of exchange offers and consent solicitations for C. R. Bard  Inc. Notes",
        "date": "08012017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson extends exchange for C. R. Bard  Inc. notes "
    },
    {
        "content": "* BD receives FDA 510(k) clearance for new immunological diagnostic system Source text for Eikon: Further company coverage:",
        "date": "07192017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-BD receives FDA clearance for new immunological diagnostic system "
    },
    {
        "content": "June 29 Acquisitions of European companies surged in recent months  amid optimism about the region's economic prospects  but global deal-making subsided and the total value of U.S. deals fell sharply due to uncertainty about President Donald Trump's tax reform and deregulation agenda.",
        "date": "06292017",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "Europe M&A surges but U.S. slows sharply amid uncertainty "
    },
    {
        "content": "* BD announces extension of exchange offers and consent solicitations for C. R. Bard Inc notes",
        "date": "07032017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-BD reports extension of exchange offers and consent solicitations for C. R. Bard notes "
    },
    {
        "content": "* Flowjo- Co   Becton Dickinson have established a strategic relationship to catalyze coordination of resources  people and data for research market",
        "date": "06132017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-FlowJo says established a strategic relationship with Becton Dickinson to catalyze coordination of resources for research market "
    },
    {
        "content": "* Becton Dickinson and Co says co  Bard get second requests from ftc under Hart-Scott-Rodino act; cos continue to expect transaction to close in the fall of 2017‍​‍​ Source text for Eikon: Further company coverage:",
        "date": "06092017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson & Co and Bard get second requests from ftc under Hart-Scott-Rodino Act "
    },
    {
        "content": "* BD receives FDA 510(K) clearance for molecular test for harmful intestinal bacteria causing infectious diarrhea Source text for Eikon: Further company coverage:",
        "date": "06052017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-BD receives FDA 510(k) clearance for molecular test for harmful intestinal bacteria causing infectious diarrhea "
    },
    {
        "content": "* BD announces extension of exchange offers and consent solicitations for C. R. Bard  Inc notes",
        "date": "06052017",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "BRIEF-BD announces extension of exchange offers  consent solicitations for C. R. Bard notes "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  May 23 (Fitch) Fitch Ratings has assigned a 'BBB-' rating to Becton  Dickinson and Company's (BDX) senior unsecured Euro notes offering. The company intends to use the net proceeds from the offering to fund the purchase of existing notes pursuant to the tender  to fund the purchase and retirement of debt in open market transactions  or otherwise  for general corporate purposes. A full list of ratings appears at the end of the ",
        "date": "05232017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "Fitch Rates Becton  Dickinson and Company's Senior Euro Notes 'BBB-'; Outlook Stable "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 22 (Fitch) Fitch Ratings has assigned a 'BBB-' rating to Becton  Dickinson and Company's (BDX) senior unsecured notes offering. The company intends to use net proceeds from the offering to partly finance the acquisition of C.R. Bard (Bard) and redeem outstanding BDX notes. A full list of ratings appears at the end of the release. The ratings apply to approximately $10.3 billion of debt outstanding at March 31  2017. The Rat",
        "date": "05222017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "Fitch Rates Becton  Dickinson and Company's Senior Notes 'BBB-'; Outlook Stable "
    },
    {
        "content": "* Files pricing term sheet related to its 7-part notes offering Source text: (http://bit.ly/2q6pamG) Further company coverage:",
        "date": "05232017",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson and files pricing term sheet related to its 7-part notes offering "
    },
    {
        "content": "* Becton Dickinson - Issued notices of redemption for all $1.7 billion of its 1.800% notes due Dec 15  2017  5.000% notes due May 15  2019 and 6.375% notes due Aug 1  2019",
        "date": "05182017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson updates on redemption notices for its certain notes "
    },
    {
        "content": "* BD announces results of early tenders and amendments to exchange offers",
        "date": "05192017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson announces results of early tenders and amendments to exchange offers "
    },
    {
        "content": "* On May 12  2017  Becton Dickinson and Company entered into a three-year term loan agreement - SEC filing",
        "date": "05162017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson and Co entered into a three-year term loan agreement "
    },
    {
        "content": "* BD announces exercise of option to purchase additional shares by underwriters of public equity offerings increasing total gross proceeds to $4.95 billion",
        "date": "05122017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-BD announces exercise of option to purchase additional shares by underwriters of public equity offerings "
    },
    {
        "content": "* Prices offerings of $2.25 billion of common stock and $2.25 billion of depositary shares representing interests in mandatory convertible preferred stock",
        "date": "05112017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-BD prices offerings of common stock depositary shares "
    },
    {
        "content": "* BD announces commencement of exchange offers and consent solicitations for C. R. Bard Inc notes",
        "date": "05052017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson announces commencement of exchange offers and consent solicitations "
    },
    {
        "content": "* Becton Dickinson And Co - has non-exclusively licensed its patented stochastic labelling technology to Roche for multiple commercial applications",
        "date": "04262017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-BD licenses molecular indexing technology to Roche "
    },
    {
        "content": "NEW YORK U.S. medical equipment supplier Becton Dickinson and Co will acquire C R Bard Inc  in a $24 billion cash-and-stock deal  adding Bard's devices to its portfolio in the high-growth sectors of oncology and surgery  both companies said on Sunday. | Video ",
        "date": "04242017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "Becton Dickinson to acquire Bard for $24 billion "
    },
    {
        "content": "* Deal immediately accretive and expected to generate high single-digit accretion to adjusted EPS in fiscal year 2019 to Becton Dickinson",
        "date": "04232017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson to buy Bard for $24 billion "
    },
    {
        "content": "* Becton Dickinson -in connection with termination of merger agreement under specified circumstances  Bard is required to pay co termination fee of $750 million Source text (http://bit.ly/2q6oN6S) Further company coverage:",
        "date": "04242017",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson  in connection with termination of merger  Bard must pay termination fee of $750 mln "
    },
    {
        "content": "NEW YORK  April 23 U.S. medical equipment supplier Becton Dickinson and Co will acquire C R Bard Inc  in a $24 billion cash-and-stock deal  adding Bard's devices to its portfolio in the high-growth sectors of oncology and surgery  both companies said on Sunday.",
        "date": "04242017",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "UPDATE 3-Becton Dickinson to acquire Bard for $24 billion "
    },
    {
        "content": "NEW YORK  April 23 Becton Dickinson and Co will acquire C R Bard Inc in a $24 billion deal that will give shareholders of the target about 15 percent of the combined entity  the two medical technology companies said on Sunday.",
        "date": "04232017",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "BD to acquire Bard in $24 bln medical tech deal "
    },
    {
        "content": "* BD receives FDA 510(k) clearance for new flow cytometer system with leucocount reagent assay Source text for Eikon: Further company coverage:",
        "date": "04062017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-BD receives FDA 510(k) clearance for new flow cytometer system "
    },
    {
        "content": "* BD announces early access program for bd resolve\u007f single-cell analysis platform",
        "date": "02132017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson announces early access program for BD Resolve single-cell analysis platform "
    },
    {
        "content": "* Retractable Technologies - On Jan 31  Co filed a petition for a writ of certiorari with Supreme Court of the United States",
        "date": "02082017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Retractable Technologies seeks review of decision in case against Becton Dickinson "
    },
    {
        "content": "* Becton dickinson and co says  raising expected full fiscal year 2017 adjusted diluted earnings per share to $9.70 to $9.80",
        "date": "02022017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson Q1 earnings per share $2.58 "
    },
    {
        "content": "* PleurX\u007f catheter system receives FDA 510(k) clearance for specific non-malignant recurrent pleural effusions  Source text for Eikon:  Further company coverage:",
        "date": "01232017",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson says PleurX catheter system receives FDA 510(k) clearance "
    },
    {
        "content": "A federal appeals court on Friday threw out an antitrust verdict that ordered medical device maker Becton Dickinson and Co  to pay rival Retractable Technologies Inc  $340 million in damages over its marketing of safety syringes.",
        "date": "12022016",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "Becton Dickinson wins reversal of $340 million syringe award "
    },
    {
        "content": "* Declared a quarterly dividend of $0.73 per common share  an increase of 10.6 percent from previous quarter  Source text for Eikon:  Further company coverage:",
        "date": "11212016",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson board increases dividend "
    },
    {
        "content": "* Becton  Dickinson and Company announces tender offers for outstanding debt securities",
        "date": "11162016",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton  Dickinson and Co announces tender offers for outstanding debt securities "
    },
    {
        "content": "* BD launches first syringe designed for use with Humulin\u007f R U-500 insulin  Source text for Eikon:  Further company coverage:    (Bangalore.newsroom@thomsonreuters.com)",
        "date": "11082016",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson launches syringe for use with Humulin R U-500 insulin "
    },
    {
        "content": "* Bd max\u007f vaginal panel receives fda market authorization to detect most common causes of vaginal infections  Source text for Eikon:  Further company coverage:",
        "date": "10312016",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-BD says Max Vaginal Panel receives FDA market authorization for test "
    },
    {
        "content": "* Becton Dickinson and Co - expects full fiscal year 2017 revenues to decrease 3.0 to 3.5 percent",
        "date": "11032016",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-BD reports results for Q4 provides full-year fiscal 2017 guidance "
    },
    {
        "content": "* Becton Dickinson and Co expects to record a material tax loss on Apax JV deal at time of closing  Source text for Eikon:  Further company coverage:    ;))",
        "date": "10042016",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson expects a material tax loss on Apax JV deal "
    },
    {
        "content": "* BD invests $100 million in Nebraska plant to expand insulin syringe manufacturing",
        "date": "09222016",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson invests $100 mln in Nebraska plant to expand insulin syringe manufacturing "
    },
    {
        "content": "* Says intends to ultimately seek approval using HPV genotyping beyond 16  18 and 45  Source text for Eikon:  Further company coverage:",
        "date": "09062016",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-BD submits pre-market approval application to FDA for BD Onclarity\u007f HPV test "
    },
    {
        "content": "* Names Andrew Eckert to board of directors  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07282016",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson names Andrew Eckert to board of directors "
    },
    {
        "content": "* Declared a quarterly dividend of 66 cents per common share  payable on september 30  2016  Source text for Eikon:  Further company coverage:",
        "date": "07262016",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson declares quarterly dividend 66 cents/shr "
    },
    {
        "content": "* BD and check-points announce development and global distribution agreement for BD MAX(TM) assays that detect carbapenem-resistant organisms  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06162016",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-BD and check-points announce development and global distribution agreement for BD MAX "
    },
    {
        "content": "* B. Braun Medical Inc and affiliates sue Becton  Dickinson & Co. For IV catheter safety mechanism patent infringements",
        "date": "06062016",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-B.Braun Medical and affiliates sue Becton  Dickinson & Co for patent infringements "
    },
    {
        "content": "* Obtained CE mark for BD MAX Vaginal Panel  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05132016",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-Becton Dickinson received CE mark for BD MAX Vaginal Panel "
    },
    {
        "content": "* BD divests vertebral augmentation solutions business to Stryker",
        "date": "04212016",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "BRIEF-BD divests vertebral augmentation solutions business to Stryker "
    },
    {
        "content": "May 28 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "05282015",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "NEW YORK  May 28 Medical equipment supplier Becton  Dickinson & Co is exploring a sale of its V. Mueller surgical instruments business following its $12 billion acquisition of peer CareFusion Corp  according to people familiar with the matter.",
        "date": "05282015",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "Becton Dickinson exploring sale of surgical instruments unit-sources "
    },
    {
        "content": "BRUSSELS U.S. medical equipment supplier Becton Dickinson & Co  gained European Union approval on Friday for its $12.2 billon bid for peer CareFusion Corp  after regulators said the market would continue to be highly competitive following the deal.",
        "date": "03132015",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "Becton Dickinson wins EU approval for $12 billion CareFusion buy "
    },
    {
        "content": "BRUSSELS  March 13 U.S. medical equipment supplier Becton Dickinson & Co gained European Union approval on Friday for its $12.2 billon bid for peer CareFusion Corp after regulators said the market would continue to be highly competitive following the deal.",
        "date": "03132015",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "Becton Dickinson wins EU approval for $12 bln CareFusion buy "
    },
    {
        "content": "BRUSSELS  March 13 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03132015",
        "name": "Becton Dickinson and Company",
        "news_type": "normal",
        "symbol": "BDX",
        "title": "EU mergers and takeovers (March 13) "
    },
    {
        "content": "BRUSSELS  March 5 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03052015",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "EU mergers and takeovers (March 5) "
    },
    {
        "content": "BRUSSELS  March 3 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03032015",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "EU mergers and takeovers (March 3) "
    },
    {
        "content": "BRUSSELS  Feb 9 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02092015",
        "name": "Becton Dickinson and Company",
        "news_type": "topStory",
        "symbol": "BDX",
        "title": "EU mergers and takeovers (Feb 9) "
    }
]