[
    {
        "content": "LONDON Uncertainty over the future of the Libor global interest rate benchmark is seeing some debt sellers make \"alarming\" changes to their financial contracts  Franklin Templeton  one of the world's largest asset managers has said.",
        "date": "11092017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "Fund giant Templeton warns Libor doubts creating 'alarming' practices "
    },
    {
        "content": "* Franklin Resources Inc announces month-end assets under management",
        "date": "11082017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources Inc announces month-end assets under management "
    },
    {
        "content": "* Libor uncertainty see some credit sellers change terms-Templeton",
        "date": "11082017",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "Fund giant Templeton warns Libor doubts creating \"alarming\" practices "
    },
    {
        "content": "Oct 30 GOZDE GIRISIM SERMAYESI YATIRIM ORTAKLIGI AS:",
        "date": "10302017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Gozde Girisim signs consultancy contract with Franklin Templeton Danismanlik on strategic issues "
    },
    {
        "content": "* Franklin Resources Inc announces preliminary fourth quarter and fiscal year results",
        "date": "10262017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources Q4 preliminary earnings per share $0.76 "
    },
    {
        "content": "* Franklin Resources  Inc. announces month-end assets under management",
        "date": "10092017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources- Preliminary month-end AUM of $753.2 bln at Sept 30 2017 "
    },
    {
        "content": "Oct 2 Franklin Templeton  part of investment management firm Franklin Resources Inc  named Lutz Morjan as senior solutions portfolio manager of EMEA  effective Sept. 1.",
        "date": "10022017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "MOVES-Franklin Templeton names senior solutions portfolio manager  EMEA "
    },
    {
        "content": "Sept 26 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "09262017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "MOVES-BAML  Man Group  HSBC  Manulife Real Estate  Franklin Templeton "
    },
    {
        "content": "Sept 26 Franklin Templeton Investments  part of investment management firm Franklin Resources Inc  appointed David Whitehair as head of its defined contribution business in the UK.",
        "date": "09262017",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "CORRECTED-OFFICIAL-MOVES-Franklin Templeton names David Whitehair head of defined contribution  UK "
    },
    {
        "content": "* Franklin Resources Inc reports 19.9 percent stake in Halcon Resources Corp as of September 15  2017 - SEC filing‍​",
        "date": "09202017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources reports 19.9 pct stake in Halcon Resources - SEC filing‍​ "
    },
    {
        "content": "* Franklin Templeton Investments says to absorb research costs under Mifid II rules. Source text for Eikon: Further company coverage: (Reporting By Simon Jessop)",
        "date": "09132017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Templeton Investments to absorb research costs under Mifid II "
    },
    {
        "content": "* Franklin Resources Inc announces month-end assets under management",
        "date": "09112017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources announces month-end assets under management "
    },
    {
        "content": "BUCHAREST  Sept 8 Romanian investment fund Fondul Proprietatea is considering selling its 20 percent stake in state-owned hydro power producer Hidroelectrica  a move it said was triggered by lack of government progress in listing it.",
        "date": "09082017",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "UPDATE 1-Fondul fund may sell Hidroelectrica stake as IPO drags "
    },
    {
        "content": "AMSTERDAM  July 27 Activist hedge fund Elliott Advisors returned to court on Thursday to try to oust the chairman of Dutch paints group Akzo Nobel over his rejection of a 26.3 billion euro ($30 billion) takeover proposal from PPG Industries.",
        "date": "07272017",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "UPDATE 2-Round Two: Elliott Advisors  Akzo Nobel face off in Dutch court "
    },
    {
        "content": "* Q3 earnings per share view $0.72 -- Thomson Reuters I/B/E/S",
        "date": "07282017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources announces Q3 earnings per share $0.73 "
    },
    {
        "content": "* Franklin Resources  Inc. Announces month-end assets under management",
        "date": "07112017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources says preliminary month-end AUM by company's subsidiaries $742.9 bln "
    },
    {
        "content": "* Franklin Resources Inc reports 10.3 percent passive stake in Tahoe Resources Inc as of June 30 - sec filing Source text (http://bit.ly/2tBlLMs) Further company coverage:",
        "date": "07102017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources reports 10.3 pct passive stake in Tahoe Resources  as of June 30 "
    },
    {
        "content": "SEOUL Franklin Templeton has sold some of its Korea treasury bond holdings in recent weeks as part of its portfolio adjustment  a person with direct knowledge of the matter told Reuters on Thursday.",
        "date": "06292017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "Franklin Templeton trims Korea treasury bonds as part of portfolio adjustment: source "
    },
    {
        "content": "* Franklin Resources Inc reports 10.6 percent passive stake in Alamos Gold Inc as of May 31 - sec filing Source text : http://bit.ly/2t2fJ4o Further company coverage:",
        "date": "06092017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources reports 10.6 pct passive stake in Alamos Gold "
    },
    {
        "content": "* Franklin Resources Inc announces month-end assets under management",
        "date": "06082017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources reports month-end assets under management "
    },
    {
        "content": "May 19 Franklin Templeton Investments  a part of investment management firm Franklin Resources Inc  said it appointed Martyn Gilbey as its UK country head  effective Aug. 1.",
        "date": "05192017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "MOVES-Franklin Templeton names Martyn Gilbey UK country head "
    },
    {
        "content": "LONDON When rich countries wrote off billions of dollars of African debt in 2005  they hoped governments would think twice about borrowing again in costly foreign currencies.",
        "date": "05192017",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "A decade after debt forgiveness  Africa still hooked on dollars "
    },
    {
        "content": "LONDON  May 19 When rich countries wrote off billions of dollars of African debt in 2005  they hoped governments would think twice about borrowing again in costly foreign currencies.",
        "date": "05192017",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "INVESTMENT FOCUS-A decade after debt forgiveness  Africa still hooked on dollars "
    },
    {
        "content": "DUBLIN  May 12 Franklin Templeton's head of European fixed income said on Friday his fund was building up a \"store of cash\" by buying liquid government bonds that he can redeploy if financial markets become volatile over the next year.",
        "date": "05122017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "Franklin Templeton's Zahn says buying govt bonds as \"store of cash\" "
    },
    {
        "content": "* Franklin Resources Inc reports 13.2 percent passive stake in Delmar Pharmaceuticals Inc as of April 30 - sec filing Source text : http://bit.ly/2pA7TOh Further company coverage:",
        "date": "05102017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources reports 13.2 pct passive stake in Delmar Pharmaceuticals "
    },
    {
        "content": "* Franklin Resources Inc announces month-end assets under management",
        "date": "05082017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources announces month-end assets under management "
    },
    {
        "content": "* Q2 earnings per share view $0.67  revenue view $1.57 billion -- Thomson Reuters I/B/E/S",
        "date": "04282017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources posts Q2 earnings per share $0.74 "
    },
    {
        "content": "* Franklin Resources Inc announces month-end assets under management",
        "date": "04102017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources Inc announces month-end assets under management "
    },
    {
        "content": "MOSCOW  April 4 Franklin Templeton's high-profile bond fund manager Michael Hasenstab has taken a \"substantial\" position in Ghana's cedi-denominated government bonds via this week's jumbo debt auction  a source with knowledge of the matter told Reuters on Tuesday.",
        "date": "04052017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "RPT-Templeton's Hasenstab buys Ghana's cedi bonds - source "
    },
    {
        "content": "NEW YORK  April 5 A California pension fund has fired Franklin Templeton Investments  JPMorgan Chase & Co and Pacific Investment Management Co from some portfolio-management responsibilities in a shakeup that puts more of its assets in lower-fee  index-tracking investments  the fund said.",
        "date": "04052017",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "California pension fund is latest to scrap some active managers "
    },
    {
        "content": "* Franklin Resources Inc. along with subsidiaries reduces stake in the company to 0 percent from 10.29 percent",
        "date": "04032017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources with subsidiaries sell stake in iAlbatros "
    },
    {
        "content": "MOSCOW  April 4 Franklin Templeton's high-profile bond fund manager Michael Hasenstab has taken a \"substantial\" position in Ghana's cedi-denominated government bonds via this week's jumbo debt auction  a source with knowledge of the matter told Reuters on Tuesday.",
        "date": "04042017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "Templeton's Hasenstab buys Ghana's cedi bonds - source "
    },
    {
        "content": "* Says Franklin Resources Inc. is ceasing to be a substantial shareholder/unitholder",
        "date": "04042017",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "BRIEF-Noble Group says Franklin Resources ceases to be a substantial shareholder "
    },
    {
        "content": "AMSTERDAM  March 17 Michael Hasenstab  chief investment officer at Franklin Templeton Investments  said on Friday he had exited \"almost all\" European bond positions in funds he manages  citing ongoing political risk in Europe.",
        "date": "03172017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "CORRECTED-UPDATE 1-Templeton's Hasenstab says his funds exited 'almost all' European bond positions "
    },
    {
        "content": "* Preliminary month-end assets under management by company's subsidiaries $738.2 billion at Feb. 28  2017  compared to $728.8 billion at Jan. 31  2017  Source text for Eikon:  Further company coverage:",
        "date": "03082017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources announces month-end AUM "
    },
    {
        "content": "* Franklin Resources reports 6 percent passive stake in first Solar Inc as of December 31  2016 -SEC filing  Source text : [ID:http://bit.ly/2kTxa6G] Further company coverage:",
        "date": "02082017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources reports 6 percent passive stake in First Solar as of Dec 31  2016 "
    },
    {
        "content": "* Franklin Resources  Inc reports 5.7 percent passive stake in TherapeuticsMD Inc as of Dec. 31  2016 - SEC filing  Source text - (http://bit.ly/2jZSLLl) Further company coverage:",
        "date": "02072017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources reports 5.7 pct passive stake in TherapeuticsMD as of Dec. 31  2016 - SEC filing "
    },
    {
        "content": "* Franklin Resources Inc reports 5.4 percent passive stake in Mosaic Co as of Dec. 31  2016 - SEC filing  Source text (http://bit.ly/2lmVN9z) Further company coverage:",
        "date": "02072017",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources reports 5.4 pct passive stake in Mosaic as of Dec. 31  2016 "
    },
    {
        "content": "* Franklin Resources reports a 6 percent passive stake in Spectranetics Corp as of December 31  2016 -SEC filing  Source text : [ID:http://bit.ly/2jZpMaJ] Further company coverage:",
        "date": "02072017",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources reports a 6 percent passive stake in Spectranetics as of Dec 31  2016 "
    },
    {
        "content": "* Sees opportunity in French debt if bonds weakens before election",
        "date": "01162017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "UPDATE 1-Franklin Templeton's Zahn: Europe's bond bull market not over  favours Italy "
    },
    {
        "content": "LONDON  Jan 16 Franklin Templeton's David Zahn has said he favours Italian bonds and the fund has now moved to an overweight position on Italian government debt.",
        "date": "01162017",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "Franklin Templeton's Zahn says overweight on Italian govt bonds "
    },
    {
        "content": "* Franklin resources  inc. Announces month-end assets under management",
        "date": "01102017",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources preliminary month-end assets under management by Co's subsidiaries of $720 bln at Dec. 31  2016 vs. $714.4 bln at Nov 30. 2016 "
    },
    {
        "content": "LONDON  Nov 28 Bad loans in China's banking system and a risk of overleverage and regulation in Chinese real estate are reasons to remain cautious on these segments in 2017  asset manager Franklin Templeton said on Monday.",
        "date": "11282016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "Franklin Templeton cautious on Chinese banks and real estate "
    },
    {
        "content": "LONDON Euro zone government bonds are starting to look attractive again after a concerted sell-off that has seen the region's benchmark German bond yield spike 50 basis points over six weeks  Franklin Templeton portfolio manager David Zahn said on Wednesday.",
        "date": "11172016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "Franklin Templeton's Zahn eyes return to euro zone government bonds "
    },
    {
        "content": "Nov 16 Increasing volatility in European fixed income markets spurred by political risk factors will continue to overshadow economic fundamentals in the coming year  Franklin Templeton's head of European fixed income said on Wednesday.",
        "date": "11162016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "Q&A-Focus on politics  but don't forget ECB -Franklin Templeton "
    },
    {
        "content": "* Preliminary month-end AUM by company's subsidiaries of $723.0 billion at October 31  2016  compared to $733.3 billion at September 30  2016",
        "date": "11082016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources announces month-end assets under management "
    },
    {
        "content": "NEW YORKTensions between Ultratech  Inc  and one of its largest shareholders got so high that by the spring  the chief executive was calling the investor a \"cockroach\" and refusing to meet with him.",
        "date": "11042016",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "Access denied and insults; U.S. mutual funds get taste of activist life "
    },
    {
        "content": "LONDON U.S. Republican Donald Trump's unexpected win in the U.S. presidential election suggests a stronger-than-expected chance of a 'no' vote in Italy's upcoming referendum  the head of European fixed income at Franklin Templeton said on Wednesday.",
        "date": "11092016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "Trump win raises risk of Italy 'No' vote: Franklin Templeton's Zahn "
    },
    {
        "content": "NEW YORK  Nov 4Tensions between Ultratech  Inc  and one of its largest shareholders got so high that by the spring  the chief executive was calling the investor a \"cockroach\" and refusing to meet with him.",
        "date": "11042016",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "Access denied and insults; US mutual funds get taste of activist life "
    },
    {
        "content": "LONDON  Nov 9 U.S. Republican Donald Trump's unexpected win in the U.S. presidential election suggests a stronger-than-expected chance of a 'no' vote in Italy's upcoming referendum  the head of European fixed income at Franklin Templeton said on Wednesday.",
        "date": "11092016",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "UPDATE 1-Franklin Templeton's Zahn: Trump win raises risk of Italy 'No' vote "
    },
    {
        "content": "* Franklin Resources Inc announces preliminary fourth quarter and fiscal year results",
        "date": "10262016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources Q4 preliminary EPS $0.82 "
    },
    {
        "content": "* Franklin Resources Inc reports 72.9 percent stake in Goodrich Petroleum Corp as of Oct 12 - sec filing  Source text: http://bit.ly/2dDypiV",
        "date": "10242016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources reports 72.9 pct stake in Goodrich Petroleum "
    },
    {
        "content": "* Franklin Resources Inc announces month-end assets under management",
        "date": "10102016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources announces month-end Assets Under Management "
    },
    {
        "content": "LONDON  Oct 10 U.S. fund manager Franklin Templeton said on Monday it was launching a new global currency fund headed by its star bond investor Michael Hasenstab and one of his chief lieutenants.",
        "date": "10102016",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "Hasenstab heads up new Franklin Templeton global FX fund "
    },
    {
        "content": "* Bain bought business for $3.5 bln in 2007   (Adds Edcon asset sale)",
        "date": "09202016",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "UPDATE 3-Bain in $1.5 bln South African Edcon debt for equity deal "
    },
    {
        "content": "* Preliminary month-end assets under management by company's subsidiaries of $740.1 billion at August 31  2016  Source text for Eikon:  Further company coverage:",
        "date": "09122016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources announces month-end assets under management "
    },
    {
        "content": "LONDON  Sept 6 A group of asset managers and banks are trying to cut the cost of \"dark pool\"  or anonymous  trading in big blocks of shares via a deal with a London Stock Exchange Group unit.",
        "date": "09062016",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "Asset managers  banks and Turquoise team up in \"dark pool\" trading "
    },
    {
        "content": "* Hasenstab says strong yen reigniting deflationary pressures",
        "date": "08312016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "UPDATE 1-Franklin Templeton's Hasenstab says sell yen and euro "
    },
    {
        "content": "* Reported preliminary month-end AUM by company's subsidiaries of $739.9 billion at July 31  2016  compared to $732.1 billion at June 30  2016  Source text for Eikon:  Further company coverage:",
        "date": "08082016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources reports preliminary month-end AUM "
    },
    {
        "content": "Aug 4 Franklin Templeton Investments  a part of investment management firm Franklin Resources Inc  appointed three new hires in the role of vice president  ETF specialist.",
        "date": "08042016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "MOVES-Franklin Templeton appoints three new hires "
    },
    {
        "content": "BOSTON  Aug 3 Mutual fund group Franklin Resources Inc said on Wednesday it will begin offering retail clients access to hedge funds that invest in currencies  interest rates  commodities and other securities in a new so-called liquid alternatives fund.",
        "date": "08032016",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "Franklin Templeton launches global macro fund for retail investors "
    },
    {
        "content": "* Q3 earnings per share view $0.67 -- Thomson Reuters I/B/E/S",
        "date": "07282016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources posts Q3 earnings of $0.77/share "
    },
    {
        "content": "* Reported preliminary month-end aum by co's units of $732.1 billion at june 30  2016  versus $737.3 billion at may 31  2016  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07112016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources reported preliminary month-end AUM of $732.1 bln vs $737.3 bln "
    },
    {
        "content": "* Reported preliminary month-end AUM by company's subsidiaries of $732.1 billion at June 30  2016  compared $866.5 billion at june 30  2015  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07112016",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources preliminary month-end AUM by company's units of $732.1 bln "
    },
    {
        "content": "* Franklin Resources Inc reports 17.1 pct passive stake in Bill Barrett Corp as of June 30 - SEC filing   Source text (http://bit.ly/29E1GuV) Further company coverage:",
        "date": "07082016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources reports 17.1 pct passive stake in Bill Barrett - SEC filing "
    },
    {
        "content": "LONDON  June 16 Franklin Templeton  one of the world's largest active fund managers  is sticking to its overweight stance on UK stocks in two funds managed by its Templeton Global Equity group.",
        "date": "06162016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "REFILE-Franklin Templeton remains overweight UK in Templeton global equity funds "
    },
    {
        "content": "* Quarterly cash dividend in amount of $0.18 per share payable on July 15  2016",
        "date": "06142016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources to purchase up to additional 50 mln shares "
    },
    {
        "content": "* Franklin Resources Inc reports 10.5 pct passive stake in Landec as of May 31  2016 - SEC filing  Source - (http://bit.ly/1tkBuNr) Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06092016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources Inc reports 10.5 pct passive stake in Landec as of May 31  2016 "
    },
    {
        "content": "June 9  Franklin Resources Inc reports 19.1 pct passive stake in precision Drilling Corp as of March 31   Source text - http://1.usa.gov/1WGE5Nt Further company coverage:",
        "date": "06092016",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources reports 19.1 pct passive stake in Precision Drilling - SEC filing "
    },
    {
        "content": "* Preliminary month-end assets under management by company's subsidiaries of $737.3 billion at may 31  2016",
        "date": "06082016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources preliminary month-end AUM of $737.3 bln at May 31 "
    },
    {
        "content": "HONG KONG  May 31 Goldman Sachs has increased the probability that MSCI will include mainland Chinese shares in its indexes to 70 percent   citing recent steps taken by Beijing to remove obstacles for global money managers to invest in the country's equity markets.",
        "date": "05312016",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "Goldman Sachs raises odds of China share inclusion in MSCI indexes to 70 pct "
    },
    {
        "content": "* Preliminary month-end aum by company's subsidiaries of $747.1 billion at april 30  2016  compared to $742.6 billion at march 31  2016",
        "date": "05092016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources Preliminary month-end AUM $747.1 bln "
    },
    {
        "content": "April 25 Investment management firm Franklin Resources Inc  which operates as Franklin Templeton Investments  said it appointed Dan O'Lear as president of Franklin Templeton Distributors.",
        "date": "04252016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "MOVES-Franklin Templeton appoints U.S. retail distribution president "
    },
    {
        "content": "* Q2 earnings per share view $0.63 -- Thomson Reuters I/B/E/S",
        "date": "04272016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources posts Q2 earnings per share of $0.61 "
    },
    {
        "content": "* Q2 earnings per share view $0.63 -- Thomson Reuters I/B/E/S",
        "date": "04272016",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources  inc. announces second quarter results "
    },
    {
        "content": "April 20 Franklin Templeton Investment Management",
        "date": "04202016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Templeton Investment sells 22.5 million existing shares of Romgaz S.A. "
    },
    {
        "content": "* Reports 7.6 Pct Passive Stake In Heat Biologics Inc As Of March 31  2016 - Sec filing",
        "date": "04072016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources reports 7.6 pct passive stake in Heat Biologics "
    },
    {
        "content": "* Franklin Resources  Inc. announces filing of early warning report related to acquisition of debentures of Rainmaker Entertainment Inc. on behalf of underlying funds and accounts",
        "date": "04062016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "BRIEF-Franklin Resources Inc says held about 9.60% of outstanding shares of Rainmaker "
    },
    {
        "content": "Stockton  California's long-running bankruptcy is at an end after the final hold-out creditor dropped its appeal  but not before warning of the consequences of the Chapter 9 case.",
        "date": "01152016",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "Franklin ends fight over Stockton bankruptcy with a warning "
    },
    {
        "content": "LONDON An expected rise in U.S. interest rates will magnify differences between emerging economies in 2016  with South Korea  Mexico and Malaysia likely to prove resilient  said Franklin Templeton's star bond investor Michael Hasenstab.",
        "date": "12082015",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "Franklin Templeton's Hasenstab: Fed hike to widen EM divergence "
    },
    {
        "content": "LONDON  Dec 8 An expected rise in U.S. interest rates will magnify differences between emerging economies in 2016  with South Korea  Mexico and Malaysia likely to prove resilient  said Franklin Templeton's star bond investor Michael Hasenstab.",
        "date": "12082015",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "UPDATE 1-Franklin Templeton's Hasenstab: Fed hike to widen EM divergence "
    },
    {
        "content": "BOSTON In a setback for Franklin Resources Inc  that could have implications for other asset managers  a U.S. regulator declined to let the California company skip a shareholder vote over its record on climate change  according to materials provided by activists on Wednesday.",
        "date": "11272015",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "Franklin Resources loses bid to skip vote on climate change "
    },
    {
        "content": "BOSTON  Nov 25 In a setback for Franklin Resources Inc that could have implications for other asset managers  a U.S. regulator declined to let the California company skip a shareholder vote over its record on climate change  according to materials provided by activists on Wednesday.",
        "date": "11262015",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "RPT-Franklin Resources loses bid to skip vote on climate change "
    },
    {
        "content": "BOSTON  Nov 25 In a setback for Franklin Resources Inc that could have implications for other asset managers  a U.S. regulator declined to let the California company skip a shareholder vote over its record on climate change  according to materials provided by activists on Wednesday.",
        "date": "11252015",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "Franklin Resources loses bid to skip vote on climate change "
    },
    {
        "content": "BOSTON In a setback for Franklin Resources Inc that could have implications for other asset managers  a U.S. regulator declined to let the California company skip a shareholder vote over its record on climate change  according to materials provided by activists on Wednesday.",
        "date": "11262015",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "Franklin Resources loses bid to skip vote on climate change "
    },
    {
        "content": "Stockton  California and Franklin Templeton Investments will square off before a bankruptcy appellate panel on Thursday for another round in their long fight over whether the city's restructuring plan treats the asset manager unfairly.",
        "date": "11182015",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "Franklin Templeton and Stockton  California  to square off in Chap. 9 appeal "
    },
    {
        "content": "NEW YORK  Oct 13 The era of making a broad bet on mutual fund companies as a way to play America's self-funded retirement boom appears to have ended.",
        "date": "10132015",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "End of an era: Mutual fund companies no longer a market bright spot "
    },
    {
        "content": "LONDON  Oct 6 Franklin Templeton's star bond investor Michael Hasenstab said on Tuesday he was buying select emerging markets such as Mexico  with the current selloff offering a \"multi-decade\" opportunity to buy undervalued assets.",
        "date": "10062015",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "UPDATE 1-Templeton's Hasenstab sees \"multi-decade opportunity\" in EM; short Treasuries "
    },
    {
        "content": "LONDON  Oct 6 The current setback in emerging markets offers a \"multi-decade\" opportunity to buy undervalued assets  Franklin Templeton's  star bond investor Michael Hasenstab said on Tuesday.",
        "date": "10062015",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "Templeton's Hasenstab sees \"multi-decade opportunity\" in EM; short Treasuries "
    },
    {
        "content": "LONDON/BOSTON Sept 10 A setback in Ukraine for Franklin Templeton's star fund manager Michael Hasenstab hasn't dimmed his appetite for bold bets in markets shunned by others as he boosts exposure to some of this year's worst-performing emerging markets.",
        "date": "09102015",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "After Ukraine setback  Templeton bond star Hasenstab buys more emerging markets "
    },
    {
        "content": "MONACO The recent sell-off in European debt due to the Greek crisis offers buying opportunities in Italian and Spanish bonds and European corporate debt  Franklin Templeton's head of European fixed income said on Tuesday.",
        "date": "06302015",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "Franklin Templeton sees European peripheral  corporate debt opportunities "
    },
    {
        "content": "LONDON A Franklin Templeton hedge fund aimed at retail investors has taken in $1.3 billion since its 2013 launch to become its fastest growing fund launch of any stripe over the last five years  company officials said.",
        "date": "06172015",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "Franklin Templeton raises $1.3 billion in retail-friendly hedge fund "
    },
    {
        "content": "LONDON  June 17 A Franklin Templeton hedge fund strategy aimed at retail investors has taken in $1.3 billion since its 2013 launch to become its fastest growing fund launch of any stripe over the last five years  company officials said.",
        "date": "06172015",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "REFILE-Franklin Templeton raises $1.3 bln in retail-friendly hedge fund "
    },
    {
        "content": "LONDON A new  detailed proposal put to Kiev by a committee of Ukraine's biggest creditors and aimed at restructuring the country's debt  does not include a principal writedown  a source familiar with the talks said on Tuesday.",
        "date": "05122015",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "Ukraine creditors' new debt plan does not include haircut: source "
    },
    {
        "content": "The holdout creditor in Stockton  California's bankruptcy case filed its opening brief in an appeal of the city's reorganization plan on Monday  claiming \"no bondholder has ever received so little in the history of municipal bankruptcy.\"",
        "date": "03232015",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "Franklin Templeton files opening brief in appeal of Stockton  CA  bankruptcy exit plan "
    },
    {
        "content": "March 23 The holdout creditor in Stockton  California's bankruptcy case filed its opening brief in an appeal of the city's reorganization plan on Monday  claiming \"no bondholder has ever received so little in the history of municipal bankruptcy.\"",
        "date": "03232015",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "UPDATE 1-Franklin Templeton files opening brief in appeal of Stockton  CA  bankruptcy exit plan "
    },
    {
        "content": "March 23 The holdout creditor in Stockton  California's bankruptcy case filed an opening brief in its appeal of the city's reorganization plan on Monday  claiming \"no bondholder has ever received so little in the history of municipal bankruptcy.\"",
        "date": "03232015",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "Franklin Templeton files opening brief in appeal of Stockton bankruptcy exit plan "
    },
    {
        "content": "NEW YORK/LONDON  March 5 Boutique investment firm Rothschild has invited investors to organize into a Ukraine creditor group ahead of a sovereign debt restructuring  sources directly familiar with the situation told Reuters.",
        "date": "03052015",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "Rothschild looks to organize Ukraine bondholders ahead of talks "
    },
    {
        "content": "Thomson Reuters March 05  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  now click on Related Co Data  now click on Co Events.                ",
        "date": "03052015",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "Feb 17 Investment management firm Franklin Resources Inc  which operates as Franklin Templeton Investments  named Stephanie Ouwendijk as a vice president and portfolio manager.",
        "date": "02172015",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "MOVES-Franklin Templeton adds Stephanie Ouwendijk to emerging markets debt team "
    },
    {
        "content": "Jan 27 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "01272015",
        "name": "Franklin Resources Inc",
        "news_type": "topStory",
        "symbol": "BEN",
        "title": "MOVES- Royal Bank of Canada  Barclays  Franklin Resources "
    },
    {
        "content": "Jan 27 Investment management firm Franklin Resources Inc announced three appointments to its institutional sales  relationship management and consultant relations team.",
        "date": "01272015",
        "name": "Franklin Resources Inc",
        "news_type": "normal",
        "symbol": "BEN",
        "title": "MOVES-Franklin Templeton expands U.S. team with three appointments "
    }
]