[
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 17 (Fitch) Fitch Ratings has upgraded BBVA Banco Frances  S.A.'s (BBVA Frances) Local Currency Long-term Issuer Default Rating (IDR) to 'B+' from 'B' and its Support Rating to '4' from '5'. The Rating Outlook is Stable. Fitch has also affirmed the bank's standalone Viability Rating (VR) at 'b'. The upgrades are based on Fitch's opinion that BBVA Frances' shareholder support has improved. KEY RATING DRIVERS IDRS AND SUP",
        "date": "10172017",
        "name": "BBVA Banco Frances SA",
        "news_type": "topStory",
        "symbol": "BFR",
        "title": "Fitch Upgrades BBVA Banco Frances's Local Currency IDR to 'B+'; Outlook Stable "
    },
    {
        "content": "* Files to say it is offering up to 82.6 million ordinary shares  which may be represented by American depositary shares",
        "date": "06302017",
        "name": "BBVA Banco Frances SA",
        "news_type": "topStory",
        "symbol": "BFR",
        "title": "BRIEF-BBVA Banco Frances offers up to 82.6 mln ordinary shares "
    },
    {
        "content": "* BBVA Banco Frances Sa files for potential stock offering; size not disclosed‍​ - SEC filing Source text: (http://bit.ly/2sqaoIo) Further company coverage:",
        "date": "06302017",
        "name": "BBVA Banco Frances SA",
        "news_type": "normal",
        "symbol": "BFR",
        "title": "BRIEF-BBVA Banco Frances files for potential stock offering "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 01 (Fitch) Fitch Ratings has today affirmed BBVA Banco Frances  S.A.'s (BBVA Frances) Viability Rating (VR) at 'b' and its long-term local  currency Issuer Default Rating (IDR) at 'B'. The Rating Outlook is Stable. A  full list of rating actions follows at the end of this release. KEY RATING DRIVERS  VR AND IDR Despite recent improvements in Argentina's economic policy framework and  normalizing relations with foreign cr",
        "date": "03012017",
        "name": "BBVA Banco Frances SA",
        "news_type": "topStory",
        "symbol": "BFR",
        "title": "Fitch Affirms BBVA Banco Frances's IDR at 'B'; Outlook Stable "
    }
]