[
    {
        "content": "Nov 15 U.S. agricultural giant Bunge Ltd said on Wednesday it would reshuffle its business structure from five operating units to three regions - North America  South America  and Europe and Asia.",
        "date": "11152017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge restructures operations into regions from business units "
    },
    {
        "content": "* Bunge Ltd says is ‍simplifying its structure from five operating companies to three regions - North America  South America and Europe/Asia​ Source text for Eikon: Further company coverage:",
        "date": "11152017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Bunge announces organizational and leadership team changes "
    },
    {
        "content": "U.S. agricultural commodities trader Bunge Ltd  said Friday it has terminated a deal for a controlling stake in Mexican corn miller Grupo Minsa SAB de CV   an acquisition that would have made Bunge the top grain miller in Mexico.",
        "date": "11172017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge scraps deal for controlling stake in Grupo Minsa "
    },
    {
        "content": "Nov 17 U.S. agricultural commodities trader Bunge Ltd said Friday it has terminated a deal for a controlling stake in Mexican corn miller Grupo Minsa SAB de CV   an acquisition that would have made Bunge the top grain miller in Mexico.",
        "date": "11172017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 1-Bunge scraps deal for controlling stake in Grupo Minsa "
    },
    {
        "content": "Nov 17 U.S. agricultural trader Bunge Ltd said on Friday its North American operating unit has agreed to terminate a share subscription agreement with Mexico's Grupo Minsa SAB de CV.",
        "date": "11172017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge  Grupo Minsa terminate share subscription agreement "
    },
    {
        "content": "* ‍bunge North America - Bunge  Minsa  decided to terminate share subscription deal which would have given bunge controlling financial interest in minsa​ Source text for Eikon: Further company coverage:",
        "date": "11172017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Bunge and Grupo Minsa agree to terminate agreement "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 03 (Fitch) Fitch Ratings has affirmed Bunge Ltd.'s Long-Term Issuer Default Rating (IDR) at 'BBB'. The company had approximately $6.5 billion of total debt (granting 50% equity credit for Bunge's convertible preference shares) as of Sept. 30  2017. The Rating Outlook is revised to Negative from Stable. A full list of rating actions follows at the end of this release. The Negative Outlook reflects the multiple earnings ",
        "date": "11032017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Fitch Affirms Bunge's IDR at 'BBB'; Outlook Revised to Negative "
    },
    {
        "content": "CHICAGO U.S. agricultural giant Bunge Ltd  on Wednesday forecast lower full-year earnings in its core agribusiness unit after posting a third-quarter profit that fell 28 percent on flat revenue.",
        "date": "11012017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge sees lower full-year profit  better times in 2018 "
    },
    {
        "content": "CHICAGO Bunge Ltd  may be able to get the best value for its Brazilian sugarcane milling business by launching an initial public offering of the unit  Chief Executive Soren Schroder said on Wednesday  four years after he began exploring a sale.",
        "date": "11012017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge eyes IPO for Brazilian sugar milling business: CEO "
    },
    {
        "content": "CHICAGO  Nov 1 Bunge Ltd may be able to get the best value for its Brazilian sugarcane milling business by launching an initial public offering of the unit  Chief Executive Soren Schroder said on Wednesday  four years after he began exploring a sale.",
        "date": "11012017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 2-Bunge eyes IPO for Brazilian sugar milling business -CEO "
    },
    {
        "content": "CHICAGO  Nov 1 U.S. agricultural giant Bunge Ltd on Wednesday forecast lower full-year earnings in its core agribusiness unit after posting a third-quarter profit that fell 28 percent on flat revenue.",
        "date": "11012017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 4-Bunge sees lower full-year profit  better times in 2018 "
    },
    {
        "content": "NEW YORK Bunge Ltd  has hedged about half of its sugar sales next year and about 75-80 percent this year  the agribusiness company's chief financial officer told investors on Wednesday.",
        "date": "11012017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge hedges half next year's sugar sales: exec "
    },
    {
        "content": "CHICAGO  Nov 1 An initial public offering appears to be a way Bunge Ltd can \"best get a fair value\" for its Brazilian sugar business  which the agricultural trader put up for sale four years ago  Chief Executive Soren Schroder said on Wednesday.",
        "date": "11012017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge considers IPO for Brazilian sugar business -CEO "
    },
    {
        "content": "NEW YORK  Nov 1 Bunge Ltd has hedged about half of its sugar sales next year and about 75-80 percent this year  the agribusiness company's chief financial officer told investors on Wednesday.",
        "date": "11012017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge hedges half next year's sugar sales -exec "
    },
    {
        "content": "* Q3 earnings per share view $0.73 -- Thomson Reuters I/B/E/S",
        "date": "11012017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Bunge reports Q3 GAAP earnings per share $0.59 "
    },
    {
        "content": "Oct 13 Shares of U.S. commodities trader Bunge Ltd surged on Friday after the Wall Street Journal reported that Glencore PLC had a standstill agreement that temporarily prevents the Swiss company from making a hostile bid for Bunge.",
        "date": "10132017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge shares jump after WSJ reports Glencore standstill agreement "
    },
    {
        "content": "* Glencore strikes a standstill agreement with Bunge - WSJ  citing sources‍​ Source text: http://on.wsj.com/2iaXN7v Further company coverage:",
        "date": "10132017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Glencore strikes standstill agreement with Bunge - WSJ "
    },
    {
        "content": "Aug 2 Bunge Ltd kept the door open on Wednesday to a sale of the company as it reported a 34 percent drop in quarterly earnings and cut its full-year outlook  but its chief executive officer predicted a grains market rebound that would reverse the slide.",
        "date": "09272017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "UPDATE 4-Bunge leaves door open to selling itself  cuts 2017 forecast "
    },
    {
        "content": "SAO PAULO The Brazilian unit of U.S.-based commodities trader Bunge Ltd said on Friday it reached an agreement to acquire a minority stake in Agrícola Alvorada  a mid-sized grains trader located in Brazil's top soy producing state of Mato Grosso.",
        "date": "09222017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge acquires stake in mid-sized Brazil grains trader "
    },
    {
        "content": "CHICAGO U.S. grains trader Bunge Ltd  issued $1 billion of debt to replace a credit line financing a $946 million investment in a Malaysian palm oil company on Monday.",
        "date": "09192017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge issues $1 billion of debt to fund Loders deal "
    },
    {
        "content": "CHICAGO  Sept 18 U.S. grains trader Bunge Ltd issued $1 billion of debt to replace a credit line financing a $946 million investment in a Malaysian palm oil company on Monday.",
        "date": "09182017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge issues $1 billion of debt to fund Loders deal "
    },
    {
        "content": "SAO PAULO  Sept 22 The Brazilian unit of U.S.-based commodities trader Bunge Ltd said on Friday it reached an agreement to acquire a minority stake in Agrícola Alvorada  a mid-sized grains trader located in Brazil's top soy producing state of Mato Grosso.",
        "date": "09222017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 1-Bunge acquires stake in mid-sized Brazil grains trader "
    },
    {
        "content": "* Bunge Ltd - ‍Its unit priced a public offering of $400 million aggregate principal amount of 3.00% senior notes due 2022​",
        "date": "09182017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Bunge limited announces pricing of senior notes offering "
    },
    {
        "content": "Sept 13 Moody's Investors Service cut its outlook for Bunge Ltd on Wednesday and cautioned that without much improved earnings it could cut the U.S. agribusiness' credit rating to just a step above junk status.",
        "date": "09132017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "UPDATE 1-Moody's cuts Bunge outlook to negative after IOI Loders deal "
    },
    {
        "content": "CHICAGO/BENGALURU Grains trader Bunge Ltd said on Tuesday it would buy a 70 percent stake in a Malaysian palm oil producer for $946 million  to expand its  higher-margin food ingredients business - a move that industry experts said would also make it a tougher takeover target.",
        "date": "09122017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge to buy 70 percent stake in IOI Corp unit for $946 million "
    },
    {
        "content": "Sept 13 Moody's Investors Service on Wednesday revised its outlook for Bunge Ltd from stable to negative due to a \"meaningful increase in debt\" after the U.S. agribusiness opened a $900 million credit facility to help fund a deal to buy Malaysian palm oil producer IOI Loders Croklaan.",
        "date": "09132017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Moody's cuts Bunge outlook to negative after IOI Loders deal "
    },
    {
        "content": "* Bunge's shares slump as deal seen reducing takeover risk (Rewrites throughout  adds CEO and analyst quotes  updates share price)",
        "date": "09122017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 4-Bunge to buy 70 pct stake in IOI Corp unit for $946 mln "
    },
    {
        "content": "SAO PAULO  Sept 12 Bunge Inc and partners on Tuesday launched an online database aimed at helping companies make investment and purchasing decisions that discourage farmers from cutting down trees for arable land.",
        "date": "09122017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge  partners launch Brazil database to combat deforestation "
    },
    {
        "content": "* Bunge will be \"somewhat constrained\" in M&A after IOI Loders deal; partnerships and joint ventures still possible - Bunge CEO",
        "date": "09122017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Bunge \"somewhat constrained\" in M&A after IOI Loders deal-CEO "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  September 12 (Fitch) Fitch Ratings has affirmed Bunge Ltd.'s Long-Term Issuer Default Rating (IDR) at 'BBB'. Bunge had approximately $6.4 billion of total debt (granting 50% equity credit for its convertible preference shares) at the end of June 30  2017. The Rating Outlook is Stable. A full list of rating actions follows at the end of this release. The rating affirmation considers Bunge's acquisition announcement  the recent E",
        "date": "09122017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Fitch Affirms Bunge's IDR at 'BBB'; Outlook Stable "
    },
    {
        "content": "Sept 12 Agricultural commodities trader Bunge Ltd said on Tuesday it would buy a 70 percent stake in IOI Loders Croklaan from Malaysian palm oil producer IOI Corp Berhad for $946 million.",
        "date": "09122017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge to buy 70 pct stake in IOI Group unit for $946 million "
    },
    {
        "content": "* Bunge to acquire 70pct ownership interest in IOI loders Croklaan to create a leading solutions provider in B2B Oils",
        "date": "09122017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Bunge to acquire 70pct ownership interest in IOI Loders Croklaan to create a leading solutions provider in B2B oils "
    },
    {
        "content": "* Bunge Ltd - on Sept 6  subsidiary of co  entered unsecured U.S.$865 million five year credit agreement - SEC filing‍​",
        "date": "09072017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "BRIEF-Bunge Ltd says unit entered unsecured $865 mln five year credit agreement - SEC filing‍​ "
    },
    {
        "content": "* Bunge Ltd says its board of directors has declared a regular quarterly cash dividend of $0.46 per common share Source text for Eikon: Further company coverage:",
        "date": "08082017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "BRIEF-Bunge declares regular qtrly cash dividend of $0.46/shr "
    },
    {
        "content": "CHICAGO  Aug 3 With Brazilian farmers storing soybeans due to low prices  Bunge Ltd is aiming to change the way it buys crops in an effort to prompt more selling and rebuild profit margins.",
        "date": "08032017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge aims to 'reinvent' dealings with Brazilian soy farmers "
    },
    {
        "content": "Bunge Ltd  kept the door open on Wednesday to a sale of the company as it reported a 34 percent drop in quarterly earnings and cut its full-year outlook  but its chief executive officer predicted a grains market rebound that would reverse the slide.",
        "date": "08022017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge leaves door open to selling itself  cuts 2017 forecast "
    },
    {
        "content": "* Bunge CEO Soren Schroder says U.S. grain handling  South American and Asian oilseed crushing ripe for consolidation",
        "date": "08022017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Bunge CEO says U.S. grain handling  S.American and Asian oilseed crushing ripe for consolidation "
    },
    {
        "content": "* FDA approves Bunge's petition to claim soybean oil as heart healthy",
        "date": "07312017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "BRIEF-FDA approves Bunge's petition to claim soybean oil as heart healthy "
    },
    {
        "content": "* Q2 earnings per share view $0.17 -- Thomson Reuters I/B/E/S",
        "date": "08022017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Bunge reports Q2 GAAP earnings per share $0.48 "
    },
    {
        "content": "Aug 2 U.S. agricultural commodities trader Bunge Ltd reported a nearly 34 percent fall in quarterly profit  as slow farmer selling in South America hurt margins in its agribusiness.",
        "date": "08022017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge 2nd-quarter profit dips 34 pct "
    },
    {
        "content": "LONDON/VANCOUVER  July 21 Mining giant Glencore Plc is working with a Canadian pension fund to create a standalone 50:50 joint venture for its portfolio of royalty assets  two sources with knowledge with the matter said on Friday.",
        "date": "07212017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Glencore in talks with Canadian pension fund on royalties JV-sources "
    },
    {
        "content": "CHICAGO Agricultural commodities trader Bunge Ltd  said on Wednesday it was cutting costs and restructuring its global operations in response to tough market conditions and its shares fell in after-hours trading.",
        "date": "07192017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge cutting costs  restructuring as grains glut stings "
    },
    {
        "content": "CHICAGO  July 20 Global grain trader Bunge Ltd.'s cost cutting and restructuring plans could buy it time in the face of a takeover bid from a larger rival as it struggles to stay independent during a slump in the commodities market  analysts said.",
        "date": "07202017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge lays out case for independence in restructuring "
    },
    {
        "content": "CHICAGO  July 19 Agricultural commodities trader Bunge Ltd said on Wednesday it was cutting costs and restructuring its global operations in response to tough market conditions and its shares fell in after-hours trading.",
        "date": "07192017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 2-Bunge cutting costs  restructuring as grains glut stings "
    },
    {
        "content": "CHICAGO  July 20 Global grain trader Bunge Ltd's cost cutting and restructuring plans could buy it time in the face of a takeover bid from a larger rival as it struggles to stay independent during a slump in the commodities market  analysts said.",
        "date": "07202017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 1-Bunge lays out case for independence in restructuring "
    },
    {
        "content": "July 19 Agricultural commodities trader Bunge Ltd said on Wednesday it was cutting costs and restructuring its global operations in response to tough market conditions.",
        "date": "07192017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge cutting costs  restructuring on weak agricultural markets "
    },
    {
        "content": "CHICAGO  July 19 Global grain trader Bunge Ltd's sweeping plans to overhaul its business and cut costs may not be enough to compensate for weak earnings and could still leave it vulnerable to a new bid from diversified rival Glencore PLC.",
        "date": "07202017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "RPT-Bunge overhaul is latest shake-up for struggling grain sector "
    },
    {
        "content": "CHICAGO  July 19 Global grain trader Bunge Ltd's sweeping plans to overhaul its business and cut costs may not be enough to compensate for weak earnings and could still leave it vulnerable to a new bid from diversified rival Glencore PLC.",
        "date": "07202017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge overhaul is latest shake-up for struggling grain sector "
    },
    {
        "content": "* Bunge details $250 million competitiveness program and provides update on second quarter performance",
        "date": "07192017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Bunge details $250 mln competitiveness program "
    },
    {
        "content": "CHICAGO/MOSCOW  July 12 U.S. trader Bunge said it would focus its Russian grain trading on its Azov Sea export terminal near the southern city of Rostov-on-Don in an effort to boost efficiency.",
        "date": "07122017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "U.S. trader Bunge to focus Russian grain operations on Azov Sea "
    },
    {
        "content": "* Glencore would be likely to keep Baa2 rating (Adds Moody's comments  details of a possible deal)",
        "date": "05262017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "UPDATE 1-Moody's sees Glencore paying up to $6 billion in possible Bunge deal "
    },
    {
        "content": "CHICAGO Shares of Bunge Ltd scaled to a 22-month peak on Wednesday after merger overtures by Glencore Plc's agriculture unit whetted investors' appetite for consolidation in the commodities sector.",
        "date": "05252017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge shares touch 22-month high as consolidation talk swirls "
    },
    {
        "content": "CHICAGO  May 24 Shares of Bunge Ltd scaled to a 22-month peak on Wednesday after merger overtures by Glencore Plc's agriculture unit whetted investors' appetite for consolidation in the commodities sector.",
        "date": "05242017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "UPDATE 2-Bunge shares touch 22-month high as consolidation talk swirls "
    },
    {
        "content": "CHICAGO Commodity trader Glencore Plc's confirmation on Tuesday that it sought a tie up with grains trader Bunge Ltd  likely signals the start of a wave of consolidation and partnering in the industry  as middlemen struggle to make profits amid a massive global food glut.",
        "date": "05242017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Top grains traders face tough choice: Partner  merge or wait for bad weather "
    },
    {
        "content": "CHICAGO  May 24 Commodity trader Glencore Plc's confirmation on Tuesday that it sought a tie up with grains trader Bunge Ltd likely signals the start of a wave of consolidation and partnering in the industry  as middlemen struggle to make profits amid a massive global food glut.",
        "date": "05242017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "REFILE-RPT-Top grains traders face tough choice: Partner  merge or wait for bad weather "
    },
    {
        "content": "CHICAGO  May 24 Commodity trader Glencore Plc's confirmation on Tuesday that it sought a tie up with grains trader Bunge Ltd likely signals the start of a wave of consolidation and partnering in the industry  as middlemen struggle to make profits amid a massive global food glut.",
        "date": "05242017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "REFILE-Top grains traders face tough choice: Partner  merge or wait for bad weather "
    },
    {
        "content": "May 23 Bunge Ltd's talks with Glencore Plc have focused on a partnership between the two companies in North America  rather than a sale of Bunge to Glencore  according to people familiar with the matter who requested anonymity to discuss it.",
        "date": "05232017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge's talks with Glencore focused on partnership -sources "
    },
    {
        "content": "ABU DHABI/DUBAI U.S. agricultural trader Bunge is looking to bid for the Saudi state grain company's milling operations  sources said  the second global commodities company to show interest in the privatization of the kingdom's sole wheat and barley buyer.",
        "date": "05222017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Exclusive: Bunge  ARASCO to jointly bid for Saudi state grains agency - sources "
    },
    {
        "content": "CHICAGO  May 24 Shares of Bunge Ltd touched a 22-month high on Wednesday  signaling investors' hopes for consolidation in the commodities sector even after the U.S. agribusiness said it was not in M&A talks with the agricultural unit of Glencore Plc.",
        "date": "05242017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge touches 22-month high as consolidation talk swirls "
    },
    {
        "content": "* Glencore agriculture has made informal approach to bunge limited regarding possible consensual business combination",
        "date": "05232017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Glencore says Glencore Agriculture made informal approach to Bunge for possible business combination "
    },
    {
        "content": "CHICAGO U.S. grains trader Bunge Ltd  said on Tuesday it was not in talks with Swiss mining and commodities group Glencore Plc   after the latter said it had made an informal approach to discuss \"a possible consensual business combination.\"",
        "date": "05242017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge says not in talks with Glencore following approach "
    },
    {
        "content": "May 23 Shares of Bunge Ltd surged about 16 percent on Tuesday after a media report suggested the U.S. agribusiness a takeover target of commodities trader Glencore PLC.",
        "date": "05232017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge shares surge after report of possible Glencore takeover "
    },
    {
        "content": "May 24 The following are the top stories on the New York Times business pages. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "05242017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "PRESS DIGEST- New York Times business news - May 24 "
    },
    {
        "content": "CHICAGO  May 23 U.S. grains trader Bunge Ltd said on Tuesday it was not in talks with Swiss mining and commodities group Glencore Plc  after the latter said it had made an informal approach to discuss \"a possible consensual business combination.\"",
        "date": "05242017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 5-Bunge says not in talks with Glencore following approach "
    },
    {
        "content": "* Not engaged in business combination discussions with Glencore Agriculture limited or Glencore Plc",
        "date": "05242017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Bunge says not engaged in business combination discussions with Glencore Agriculture or Glencore "
    },
    {
        "content": "* ADM  Bunge shares bounce on Thursday after two-day plunge (Adds Bunge CEO comment on industry consolidation paragraph 13  updates stock prices  paragraph 5)",
        "date": "05042017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "UPDATE 1-Huge crops  record storage signal more woes for grain merchants "
    },
    {
        "content": "CHICAGO U.S. agricultural trader Bunge Ltd  reported a sharply lower first-quarter profit on Wednesday and cut its full-year earnings forecast as slow crop sales by farmers in South America squeezed margins in its core agribusiness unit  sending shares tumbling.",
        "date": "05032017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge profit dives as grain glut hits margins; shares drop "
    },
    {
        "content": "CHICAGO  May 3 U.S. agricultural trader Bunge Ltd reported a sharply lower first-quarter profit on Wednesday and cut its full-year earnings forecast as slow crop sales by farmers in South America squeezed margins in its core agribusiness unit  sending shares tumbling.",
        "date": "05032017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 4-Bunge profit dives as grain glut hits margins; shares drop "
    },
    {
        "content": "* Q1 earnings per share view $0.70 -- Thomson Reuters I/B/E/S",
        "date": "05032017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Bunge Q1 adjusted EPS from cont ops $0.35 "
    },
    {
        "content": "May 3 U.S. agricultural trader Bunge Ltd reported a fall in its first-quarter profit as weak demand from South America weighed on margins in its agribusiness.",
        "date": "05032017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge profit slumps on weak agribusiness margins "
    },
    {
        "content": "* Bunge Ltd - board of directors has declared a regular quarterly cash dividend of $0.42 per common share  Source text for Eikon:  Further company coverage:",
        "date": "03082017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "BRIEF-Bunge declares quarterly cash dividend of $0.42 per share "
    },
    {
        "content": "Feb 28 The world's top agricultural traders and biotechnology firms are finding novel ways to make fish oil substitutes from grains and algae as they seek to cash in on consumer health fads that have led to a scarcity of the fatty acids commonly found in fish.",
        "date": "02282017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "RPT-Grain traders prepping fish oil substitutes for aquaculture  health fads "
    },
    {
        "content": "Feb 28 The world's top agricultural traders and biotechnology firms are finding novel ways to make fish oil substitutes from grains and algae as they seek to cash in on consumer health fads that have led to a scarcity of the fatty acids commonly found in fish.",
        "date": "02282017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Grain traders prepping fish oil substitutes for aquaculture  health fads "
    },
    {
        "content": "* company plans to ship over 5 million metric tons in year one  ramping up volume over time to double-digit figures",
        "date": "02222017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "BRIEF-Bahri  Bunge to form ocean freight joint venture "
    },
    {
        "content": "U.S. agricultural trader Bunge Ltd  on Wednesday reported a better-than-expected quarterly profit and forecast strong earnings growth in 2017 on expected massive corn and soybean harvests in South America  sending shares nearly 8 percent higher.",
        "date": "02152017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge shares surge 8 percent as fourth-quarter profit tops estimates "
    },
    {
        "content": "Feb 15 U.S. agricultural trader Bunge Ltd on Wednesday reported a better-than-expected quarterly profit and forecast strong earnings growth in 2017 on expected massive corn and soybean harvests in South America  sending shares nearly 8 percent higher.",
        "date": "02152017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 3-Bunge shares surge 8 pct as 4th-qtr profit tops estimates "
    },
    {
        "content": "* Q4 earnings per share view $1.57 -- Thomson Reuters I/B/E/S",
        "date": "02152017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Bunge reports Q4 earnings per share $1.83 "
    },
    {
        "content": "Feb 15 U.S. agricultural trader Bunge Ltd  reported a 39.4 percent jump in quarterly profit  helped by higher sugar and ethanol prices and a stabilizing Brazil economy.",
        "date": "02152017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge fourth-quarter profit rises 39 pct "
    },
    {
        "content": "BRUSSELS  Feb 7 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02072017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "EU mergers and takeovers (Feb 7) "
    },
    {
        "content": "Jan 9 Global agricultural trader Bunge Ltd  said on Monday it will build its first new U.S. soybean processing plant in 15 years in Indiana or Ohio to serve growing domestic and export demand for soy products.",
        "date": "01092017",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "UPDATE 1-Bunge to build new soybean plant in Indiana or Ohio "
    },
    {
        "content": "BRUSSELS  Jan 9 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "01092017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "EU mergers and takeovers (Jan 9) "
    },
    {
        "content": "BRUSSELS  Jan 6 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "01062017",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "EU mergers and takeovers (Jan 6) "
    },
    {
        "content": "PARIS U.S. agricultural products trader Bunge  moved to increase its presence in Turkey with the acquisition of olive oil and seed oil producer Ana Gida Ihtiyac Maddeleri ve Sanayi Ticaret.",
        "date": "12152016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge bulks up in Turkey  buying olive oil and seed firm Ana Gida "
    },
    {
        "content": "* Priced a public offering of eur 200 million aggregate principal amount of 1.850% senior notes due 2023  Source text for Eikon:  Further company coverage:",
        "date": "11102016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "BRIEF-Bunge Limited announces pricing of senior notes offering "
    },
    {
        "content": "Nov 7 Giovane Consul  vice-president for Sugar and Bioenergy at U.S.-based food processor and commodities trader Bunge Ltd said on Monday:",
        "date": "11072016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "BRIEF-Bunge has no plans to increase sugar production capacity in Brazil "
    },
    {
        "content": "CHICAGO U.S. agricultural products trader Bunge Ltd said Wednesday it expects the record-large U.S. corn and soybean harvest to help its earnings rebound from a weaker-than-expected third quarter.",
        "date": "11022016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge expects bounce from record US harvest; shares surge "
    },
    {
        "content": "* Bunge raises outlook for food  sugar units   (Recasts  adds CEO quote  adds earnings outlook  adds share price)",
        "date": "11022016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 3-Bunge expects bounce from record US harvest; shares surge "
    },
    {
        "content": "* Bunge Ltd qtrly adjusted earnings per share from continuing operations $0.73",
        "date": "11022016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Bunge Q3 adj earnings from continuing operations $0.73/shr "
    },
    {
        "content": "Nov 2 U.S. agricultural products trader Bunge Ltd reported a nearly 50 percent fall in third-quarter profit on Wednesday  hit by smaller-than-expected soybean and corn crops in South America.",
        "date": "11022016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge's third-quarter profit plunges nearly 50 pct "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 05 (Fitch) Fitch Ratings has affirmed Bunge Ltd.'s (Bunge)  Long-Term Issuer Default Rating (IDR) at 'BBB'. Bunge had approximately $6.9  billion of total debt (granting 50% equity credit for Bunge's convertible  preference shares) at the end of June 30  2016. The Rating Outlook is Stable. A full list of rating actions follows at the end of this release. KEY RATING DRIVERS Agribusiness Segment Concentration Bunge has a ",
        "date": "10052016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Fitch Affirms Bunge's IDR at 'BBB'; Outlook Stable "
    },
    {
        "content": "* OFI will become Bunge's exclusive commercial partner to import  market  sell and distribute packaged softseed oils into Philippines",
        "date": "09302016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "BRIEF-Bunge  OFI become distribution partners in Asia-Pacific "
    },
    {
        "content": "* Fibig  54  is chairman and CEO of International Flavors & Fragrances Inc  Source text for Eikon:  Further company coverage:",
        "date": "08292016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "BRIEF-Andreas Fibig to join Bunge Limited board of directors "
    },
    {
        "content": "* Bunge to acquire controlling interest in Grupo Minsa's corn milling business",
        "date": "08302016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "BRIEF-Bunge to acquire controlling interest in Grupo Minsa's corn milling business "
    },
    {
        "content": "* Board of directors has declared a regular quarterly cash dividend of $0.42 per common share  Source text for Eikon:  Further company coverage:",
        "date": "08102016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "BRIEF-Bunge Board of directors declares regular quarterly dividend of $0.42/shr "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 10 (Fitch) Fitch Ratings has assigned a 'BBB' rating to Bunge  Limited Finance Corp. $700 million senior unsecured notes due 2026. The new  notes are fully and unconditionally guaranteed by Bunge Ltd. (Bunge). Bunge  intends to use net proceeds from the issuance for general corporate purposes   including repayment of outstanding indebtedness such as borrowings under Bunge's  revolving credit facilities. The Rating Outloo",
        "date": "08102016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Fitch Rates Bunge's $700MM Sr. Unsecured Notes 'BBB' "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  August 11 (Fitch) (This amends the release published on Aug. 10  2016  to add an issuance to the list of ratings at the end of the release for Bunge  Finance Europe B.V.) Fitch Ratings has assigned a 'BBB' rating to Bunge Limited Finance Corp. $700  million senior unsecured notes due 2026. The new notes are fully and  unconditionally guaranteed by Bunge Ltd. (Bunge). Bunge intends to use net  proceeds from the issuance for gen",
        "date": "08112016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Correction: Fitch Rates Bunge's $700MM Sr. Unsecured Notes 'BBB' "
    },
    {
        "content": "* Bunge Limited Finance Corp priced a public offering of $700 million aggregate principal amount of 3.250% senior notes due 2026    Source text for Eikon:    Further company coverage:",
        "date": "08112016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Bunge Limited announces pricing of senior notes offering "
    },
    {
        "content": "* Crushing plant at Nipawin  Saskatchewan operating after fire  but not at full capacity - spokeswoman  Further company coverage:    (Reporting By Rod Nickel)",
        "date": "08042016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "BRIEF-Bunge Canada canola plant operating after fire "
    },
    {
        "content": "PARIS Cargill Inc [CARG.UL] is to sell two oilseed crushing plants in western Europe to Bunge  with a combined annual crushing capacity of about 2 million tons  the agricultural commodity traders said on Friday.",
        "date": "08052016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Cargill to sell two oilseed factories in Europe to Bunge "
    },
    {
        "content": "* Cargill to sell two European oilseed processing facilities to Bunge",
        "date": "08052016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Cargill to sell 2 European oilseed processing facilities to Bunge "
    },
    {
        "content": "Bunge Ltd  shares surged on Thursday after the U.S. grain trader said quarterly profit jumped despite volatile grain markets and maintained its higher full-year earnings forecast.",
        "date": "07282016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge second-quarter profit up on agribusiness results  shares rally "
    },
    {
        "content": "July 28 Bunge Ltd shares surged on Thursday after the U.S. grain trader said quarterly profit jumped despite volatile grain markets and maintained its higher full-year earnings forecast.",
        "date": "07282016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 3-Bunge 2nd-qtr profit up on agribusiness results  shares rally "
    },
    {
        "content": "* Qtrly net sales $10 541 million versus $10 782 million last year",
        "date": "07282016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Bunge Q2 GAAP EPS $0.81 "
    },
    {
        "content": "July 28 U.S. grains trader Bunge Ltd  reported a 2.2 percent fall in quarterly revenue on Thursday due to lower sales in its agribusiness and sugar business.",
        "date": "07282016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "U.S. grains trader Bunge quarterly sales fall "
    },
    {
        "content": "CHICAGO  July 5 Commodity trader Bunge Ltd  will sell half its stake in oilseed crushing operations in Vietnam to Singapore's Wilmar International Ltd  the world's largest palm oil processor and one of the biggest soybean buyers  the companies said on Tuesday.",
        "date": "07052016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge sells stake in Vietnam operations to Wilmar "
    },
    {
        "content": " ",
        "date": "07052016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 1-Bunge sells stake in Vietnam operations to Wilmar "
    },
    {
        "content": "* Bunge will sell 45% of its equity in its vietnam crush operations to wilmar",
        "date": "07052016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Bunge  Wilmar to form joint venture in Vietnam "
    },
    {
        "content": "WINNIPEG  Manitoba  June 17 Saudi Arabia's agriculture company has taken control of the majority investor in grain handler G3 Canada Limited  according to a filing  reducing Bunge Ltd's stake and strengthening the kingdom's efforts to secure food supplies.",
        "date": "06172016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Saudi Arabia's SALIC boosts investment in G3 Canada grain company "
    },
    {
        "content": "WINNIPEG  Manitoba  June 17 Saudi Arabia's agriculture company has taken control of the majority investor in grain handler G3 Canada Limited  according to a filing  reducing Bunge Ltd's stake and strengthening the kingdom's efforts to secure food supplies.",
        "date": "06172016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 1-Saudi Arabia's SALIC boosts investment in G3 Canada grain company "
    },
    {
        "content": "* Says shareholders approved an amendment to bye-laws to declassify Board of Directors",
        "date": "05252016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "BRIEF-Bunge announces annual meeting results "
    },
    {
        "content": "* Approved an increase in company's regular quarterly common share cash dividend  from $0.38 to $0.42 per share",
        "date": "05242016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "BRIEF-Bunge raises qtrly dividend to $0.42 per share "
    },
    {
        "content": "BRASILIA/RIO DE JANEIRO  May 19 Brazil's interim President Michel Temer named Pedro Parente chief executive officer of state-led oil company Petroleo Brasileiro SA on Thursday as his government tries to kick-start a shrinking economy and shore up the debt-laden oil producer.",
        "date": "05192016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "CORRECTED-UPDATE 1-Brazil taps ex-Bunge boss Parente as Petrobras CEO  replaces Bendine "
    },
    {
        "content": "RIO DE JANEIRO/BRASILIA  May 19 Brazil named Pedro Parente chief executive officer of state-led oil company Petroleo Brasileiro SA  part of moves by interim Brazilian President Michel Temer to revamp economic policy and shore up the debt-laden oil producer.",
        "date": "05192016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Brazil taps ex-Bunge boss Parente as Petrobras CEO  replaces Bendine "
    },
    {
        "content": "CHICAGO U.S. agricultural trader Bunge Ltd  said Thursday it expects a rough second quarter due to shrinking crop prospects in South America  home to many of its elevators and processing plants.",
        "date": "04282016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge quarterly profit beats forecast; warns of second-quarter headwinds "
    },
    {
        "content": "CHICAGO  April 28 U.S. agricultural trader Bunge Ltd said Thursday it expects a rough second quarter due to shrinking crop prospects in South America  home to many of its elevators and processing plants.",
        "date": "04282016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 2-Bunge quarterly profit beats forecast; warns of Q2 headwinds "
    },
    {
        "content": "CHICAGO  April 28 U.S. agricultural trader Bunge Ltd reported a stronger-than-expected first-quarter profit on Thursday  bolstered by strong South American crop exports.",
        "date": "04282016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge Q1 profit beats forecast on strong South American exports "
    },
    {
        "content": "* CEO Soren Schroder's FY 2015 total compensation was $10.8 million versus $10.1 million in FY 2014 - sec filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04052016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "BRIEF-Bunge CEO's 2015 total compensation was $10.8 mln "
    },
    {
        "content": "CHICAGO/PARIS  March 2 Bunge Ltd will deliver a cargo of French wheat that Egypt rejected in December to Spain  in a further sign the agricultural trading house has been unable to resolve a dispute with Egypt over the quality of the grain  U.S. and European traders said.",
        "date": "03022016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge reroutes rejected French wheat to Spain from Egypt -traders "
    },
    {
        "content": "Feb 16 Bunge Ltd is seeking to resell a cargo of French milling wheat that was rejected by Egypt in December over trace levels of ergot fungus  traders said on Tuesday.",
        "date": "02162016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "UPDATE 1-Bunge seeks to resell French wheat cargo rejected by Egypt - trade "
    },
    {
        "content": "CHICAGO Bunge Ltd  expects a challenging year in 2016 due to slumping U.S. farm exports and processing margins  Chief Executive Officer Soren Schroder said on Thursday  as the global grain trader reported a lower-than-expected quarterly profit.",
        "date": "02112016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge shares sink 14 percent as CEO predicts difficult year "
    },
    {
        "content": "CHICAGO  Feb 11 Bunge Ltd expects a challenging year in 2016 due to slumping U.S. farm exports and processing margins  Chief Executive Officer Soren Schroder said on Thursday  as the global grain trader reported a lower-than-expected quarterly profit.",
        "date": "02112016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 2-Bunge shares sink 14 pct as CEO predicts difficult year "
    },
    {
        "content": "CHICAGO  Feb 11 Grain trader Bunge Ltd  reported a lower-than-expected quarterly profit on Thursday  citing struggles in its main agribusiness unit and Brazilian food business.",
        "date": "02112016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge earnings fall short of expectations "
    },
    {
        "content": "CHICAGO Bunge Ltd has launched legal proceedings against Egypt's state grain buyer over a rejected cargo of French wheat  highlighting uncertainty among suppliers who are already charging a risk premium to the world's largest wheat importer.",
        "date": "02102016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge challenges Egypt over rejected French wheat cargo "
    },
    {
        "content": "CHICAGO  Feb 9 Bunge Ltd has launched legal proceedings against Egypt's state grain buyer over a rejected cargo of French wheat  highlighting uncertainty among suppliers who are already charging a risk premium to the world's largest wheat importer.",
        "date": "02092016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "UPDATE 2-Bunge challenges Egypt over rejected French wheat cargo "
    },
    {
        "content": "CHICAGO  Feb 9 Bunge Ltd has launched legal proceedings challenging a decision by Egypt's state grain buyer to reject a cargo of French wheat it contracted to buy from the agribusiness company  the company said on Tuesday.",
        "date": "02092016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge challenges Egypt's grain buyer over rejected French wheat "
    },
    {
        "content": "DUBAI  Jan 31 Brazil's sugar industry will expand to help fill a global supply deficit  but that process could take longer than hoped  the chief executive of Bunge Ltd.  said on Sunday.",
        "date": "01312016",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "UPDATE 1-Bunge says Brazil sugar expansion may come later than market needs "
    },
    {
        "content": "DUBAI  Jan 31 The chief of Bunge Ltd.  said on Sunday the Brazilian sugar and ethanol industry was at a turing point but although better times were ahead and expansion set to take place  they may come later than the market needs.",
        "date": "01312016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge says Brazil sugar expansion may come later than market needs "
    },
    {
        "content": "WINNIPEG  Manitoba The U.S. Food and Drug Administration (FDA) halted a shipment of canola meal on Dec. 1 from a Bunge Ltd plant in Hamilton  Ontario  because it appeared to contain salmonella bacteria  FDA records show.",
        "date": "01082016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "U.S. halts Bunge Canada canola meal shipment with salmonella "
    },
    {
        "content": "WINNIPEG  Manitoba  Jan 8 The U.S. Food and Drug Administration (FDA) halted a shipment of canola meal on Dec. 1 from a Bunge Ltd plant in Hamilton  Ontario  because it appeared to contain salmonella bacteria  FDA records show.",
        "date": "01082016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 2-U.S. halts Bunge Canada canola meal shipment with salmonella "
    },
    {
        "content": "* Spokeswoman says US FDA notified company of Dec. 1 contaminated canola meal shipment; it did not enter US",
        "date": "01082016",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "BRIEF-Bunge Canada says now shipping canola meal as usual to US "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 19 (Fitch) Fitch Ratings has assigned a 'BBB' rating to Bunge  Limited Finance Corp.'s $500 million senior unsecured notes due November 2020.  The new notes are fully and unconditionally guaranteed by Bunge Ltd. (Bunge).  Bunge intends to use net proceeds from the issuance for general corporate  purposes  including repayment of outstanding indebtedness. The Rating Outlook is  Stable.  A full list of ratings follows at ",
        "date": "11192015",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Fitch Rates Bunge's $500MM Sr. Unsecured Notes 'BBB' "
    },
    {
        "content": "CHICAGO Grain trader Bunge Ltd  reported a lower quarterly profit on Thursday as weaker results in its sugar  fertilizer  and food and ingredients units overshadowed gains in the core agribusiness division.",
        "date": "10292015",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge quarterly income and revenue fall "
    },
    {
        "content": "CHICAGO  Oct 29 Grain trader Bunge Ltd  reported a lower quarterly profit on Thursday as weaker results in its sugar  fertilizer  and food and ingredients units overshadowed gains in the core agribusiness division.",
        "date": "10292015",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 1-Bunge quarterly income and revenue fall "
    },
    {
        "content": "SAO PAULO  Aug 27 Bunge Brasil  a wholly owned subsidiary of Bunge Ltd  said on Thursday it has agreed to acquire Brazilian wheat processor Moinho Pacifico.",
        "date": "08272015",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "UPDATE 1-Bunge to acquire Brazilian wheat processor Moinho Pacifico "
    },
    {
        "content": "SAO PAULO  Aug 27 Bunge Brasil  a wholly owned subsidiary of Bunge Limited  announced on Thursday it has agreed to acquire Brazilian wheat processor Moinho Pacifico.",
        "date": "08272015",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge says to acquire Brazilian wheat processor Moinho Pacifico "
    },
    {
        "content": "July 30 U.S. exporters need not worry that forward sales of soybeans to be harvested this autumn are off to the slowest start in six years as top importer China will considerably accelerate its purchases in the fourth quarter  the chief executive of Bunge Ltd said on Thursday.",
        "date": "07302015",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "U.S. soybean export sales poised for Q4 rebound - Bunge CEO "
    },
    {
        "content": "Agricultural commodities trader Bunge Ltd  reported a sharply lower quarterly profit due to weak oilseed processing margins in Canada and Europe and an unexpectedly steep drop in demand for its food products in recession-hit Brazil.",
        "date": "07302015",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge second-quarter profit misses forecast  shares drop "
    },
    {
        "content": "July 30 Agricultural commodities trader Bunge Ltd reported a sharply lower quarterly profit due to weak oilseed processing margins in Canada and Europe and an unexpectedly steep drop in demand for its food products in recession-hit Brazil.",
        "date": "07302015",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 2-Bunge Q2 profit misses forecast  shares drop "
    },
    {
        "content": "July 30 Bunge Ltd  one of the world's largest agricultural commodities traders  reported a lower quarterly profit on weak year-on-year returns in its agribusiness segment and poor food and ingredients margins.",
        "date": "07302015",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge quarterly profit misses forecasts on lower agribusiness results "
    },
    {
        "content": "SINGAPORE  May 13 China's biggest grain trader has taken its next step to developing a major competitor to the traditional 'Big 4' global agribusiness giants  ADM  Bunge  Cargill and Louis Dreyfus.",
        "date": "05132015",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "New global grain giant takes shape with COFCO  CIC venture "
    },
    {
        "content": "WINNIPEG  Manitoba  May 1 Oilseed processor Bunge Ltd restarted canola processing at its Hamilton  Ontario  plant late on Thursday after a fire  spokeswoman Deb Seidel said on Friday.",
        "date": "05012015",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "UPDATE 1-Bunge resumes canola processing after fire; soy line down "
    },
    {
        "content": "CHICAGO  April 30 The highly pathogenic H5 avian flu turned up in initial tests at five more farms in Iowa  including a commercial egg operation housing up to 5.5 million birds  Iowa's agriculture department said on Thursday.",
        "date": "04302015",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "UPDATE 3-More 'probable' bird flu cases in Iowa  outbreak could be U.S. biggest "
    },
    {
        "content": "WINNIPEG  Manitoba  May 1 Oilseed processor Bunge Ltd restarted canola processing at its Hamilton  Ontario plant late on Thursday after a fire  spokeswoman Deb Seidel said on Friday.",
        "date": "05012015",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge resumes canola processing after fire; soy line down "
    },
    {
        "content": "April 30 Bunge Ltd  one of the world's largest agricultural trading houses  reported a better-than-expected quarterly profit  helped by strong margins from soybean crushing and oilseed exports.",
        "date": "04302015",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 1-Bunge profit beats estimates on strong oilseed margins "
    },
    {
        "content": "April 30 Bunge Ltd  one of the world's largest agricultural trading houses  reported a better-than-expected quarterly profit  helped by strong margins from soybean crushing and oilseeds exports.",
        "date": "04302015",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge quarterly profit beats estimates "
    },
    {
        "content": "TORONTO/RIYADH Saudi Arabia's state-owned agricultural investment firm and U.S. grain trader Bunge Ltd will buy a controlling stake in Canadian grain handler CWB in a bold move by the Gulf state to secure food supplies.",
        "date": "04162015",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Saudi firm  Bunge to buy majority stake in Canadian grain handler "
    },
    {
        "content": "CHICAGO A joint venture of a state-owned Saudi Arabian investment firm and U.S. grain trader Bunge Ltd is interested in making further investments in Canada's farm sector after striking a deal to take control of Canadian grain handler CWB  Chief Executive Officer Karl Gerrand said on Wednesday.",
        "date": "04162015",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Saudi-Bunge JV sees opportunities to expand in Canada farm sector "
    },
    {
        "content": "TORONTO/RIYADH  April 15 Saudi Arabia's state-owned agricultural investment firm and U.S. grain trader Bunge Ltd will buy a controlling stake in Canadian grain handler CWB in a bold move by the Gulf state to secure food supplies.",
        "date": "04162015",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "CORRECTED-UPDATE 3-Saudi firm  Bunge to buy majority stake in Canadian grain handler "
    },
    {
        "content": "TORONTO/RIYADH Saudi Arabia's state-owned agricultural investment firm and U.S. grain trader Bunge Ltd will buy a controlling stake in Canadian grain handler CWB in a bold move by the Gulf state to secure food supplies.",
        "date": "04152015",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Saudi firm  Bunge to buy majority stake in Canadian grain handler "
    },
    {
        "content": "CHICAGO A new joint venture of a state-owned Saudi Arabian investment firm and U.S. grain trader Bunge Ltd is interested in making further investments in Canada after striking a deal to take control of Canadian grain handler CWB  Chief Executive Officer Karl Gerrand said on Wednesday.",
        "date": "04152015",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Saudi-Bunge joint venture sees opportunities to expand in Canada -CEO "
    },
    {
        "content": "TORONTO/RIYADH  April 15 Saudi Arabia's state-owned agricultural investment firm and U.S. grain trader Bunge Ltd will buy a controlling stake in Canadian grain handler CWB in a bold move by the Gulf state to secure food supplies.",
        "date": "04152015",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 3-Saudi firm  Bunge to buy majority stake in Canadian grain handler "
    },
    {
        "content": "TORONTO/RIYADH  April 15 Saudi Arabia's state-owned agricultural investment firm and U.S. grain trader Bunge Ltd will buy a controlling stake in Canadian grain handler CWB  in a bold move by the Gulf state to secure food supplies.",
        "date": "04152015",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 2-Saudi firm  Bunge to buy majority stake in Canadian grain handler "
    },
    {
        "content": "March 3 Lazard Ltd appointed Alberto Weisser  former head of agricultural trading house Bunge Ltd   as a senior adviser for the agriculture  commodities and related sectors.",
        "date": "03032015",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "MOVES-Lazard appoints former Bunge CEO Alberto Weisser as senior advisor "
    },
    {
        "content": "CHICAGO Bunge Ltd   one of the world's largest agricultural trading houses  reported fourth-quarter profit on Thursday that was well below analysts' expectations due to deteriorating oilseed-crushing margins in China and further hedging losses.",
        "date": "02122015",
        "name": "Bunge Limited",
        "news_type": "topStory",
        "symbol": "BG",
        "title": "Bunge quarterly profit disappoints again on hedging losses "
    },
    {
        "content": "CHICAGO  Feb 12 Bunge Ltd  one of the world's largest agricultural trading houses  reported fourth-quarter profit on Thursday that was well below analysts' expectations due to deteriorating oilseed-crushing margins in China and further hedging losses.",
        "date": "02122015",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "UPDATE 1-Bunge quarterly profit disappoints again on hedging losses "
    },
    {
        "content": "CHICAGO  Feb 12 Bunge Ltd  one of the world's largest agricultural trading houses  reported fourth-quarter profit Thursday that was well below analysts' expectations due to $80 million of hedging losses.",
        "date": "02122015",
        "name": "Bunge Limited",
        "news_type": "normal",
        "symbol": "BG",
        "title": "Bunge quarterly profit  revenue disappoint on hedging losses "
    }
]