[
    {
        "content": "    Nov 14 Britain's FTSE 100 index is seen opening 7 points lower at 7 407.7 on Tuesday  according to financial bookmakers.           * RIO TINTO: Mick Davis  the former head of global miner Xstrata  has emerged as a frontrunner to become the next chairman of Anglo Australian miner Rio Tinto   the Financial Times newspaper reported.       * RIO TINTO: The Indonesian unit of Freeport-McMoRan Inc closed the main access road to its giant Grasberg copper mine in the eastern province of ",
        "date": "11142017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UK Stocks-Factors to watch on Nov 14 "
    },
    {
        "content": "LONDON  Nov 2 The world's biggest miner BHP's response to the electric vehicle debate is to hunt for new reserves of copper and oil  while seeking a buyer for its assets to produce battery-grade nickel and steering clear of lithium and cobalt.",
        "date": "11022017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "LME WEEK-BHP aims for more copper  oil; steers away from EV minerals "
    },
    {
        "content": "LONDON The new chairman of BHP  the world's biggest miner  threw his weight behind his CEO on Thursday after attacks from activist investor Elliott Advisors prompted speculation that the end of Andrew Mackenzie's tenure was imminent.",
        "date": "10192017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "BHP presents united front against activist Elliott "
    },
    {
        "content": "* Analyst says gap narrowing between BHP  Rio (Adds detail on Resolution copper mine)",
        "date": "10192017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UPDATE 3-BHP presents united front against activist Elliott "
    },
    {
        "content": "SINGAPORE  Sept 26 This year looks set to be the \"tipping point\" for electric cars  Arnoud Balhuizen  chief commercial officer at BHP  said on Tuesday  adding that the impact for raw materials producers would be felt first in the metals markets and only later in oil.",
        "date": "09262017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BHP  world's largest miner  says 2017 is 'tipping point' for electric cars "
    },
    {
        "content": "Sept 7 Australia shares advanced on Thursday  cheered by strength on Wall Street with the energy sector taking the lead from a rally in their U.S. peers  while global miner Rio Tinto jumped after it increased its coal reserve estimate.",
        "date": "09072017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "Australia shares up on Wall St lift  energy sector; NZ steady "
    },
    {
        "content": "WASHINGTON  Aug 25 BHP Billiton Ltd said on Friday it had shut in all of its Eagle Ford oil wells and midstream operations ahead of Hurricane Harvey.",
        "date": "08252017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BHP Billiton shuts in Eagle Ford wells ahead of Harvey "
    },
    {
        "content": "TORONTO/NEW YORK Anglo-Australian mining giant BHP Billiton Ltd is considering selling a 25 percent interest in its Canadian potash mine project  a stake that could be worth close to $2 billion  people familiar with the matter told Reuters.",
        "date": "08252017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BHP explores $2 billion stake sale in Canada potash mine: sources "
    },
    {
        "content": "TORONTO/NEW YORK  Aug 25 Anglo-Australian mining giant BHP Billiton Ltd is considering selling a 25 percent interest in its Canadian potash mine project  a stake that could be worth close to $2 billion  people familiar with the matter told Reuters.",
        "date": "08252017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UPDATE 1-BHP explores $2 bln stake sale in Canada potash mine -sources "
    },
    {
        "content": "HOUSTON  Aug 25 BHP Billiton Ltd said on Friday it had shut down drilling and completion activities at its Eagle Ford shale operations due to Hurricane Harvey.",
        "date": "08252017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BHP Billiton stops Eagle Ford drilling  fracking due to Harvey "
    },
    {
        "content": "* Increases $500 mln buyback by $250 mln (Recasts  adds CEO quotes  details  dateline)",
        "date": "08242017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UPDATE 2-South32 profit leaps  eyes electric vehicle battery market "
    },
    {
        "content": "* Says \"actively pursuing\" exit from U.S. shale business (Adds CFO comment on potash  shale sale deadline  updates share price)",
        "date": "08222017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "UPDATE 5-BHP to quit U.S. shale business as annual profit surges "
    },
    {
        "content": "TORONTO/NEW YORK  Aug 25 Anglo-Australian mining giant BHP Billiton Ltd is considering selling a 25 percent interest in its Canadian potash mine project  a stake that could be worth close to $2 billion  people familiar with the matter told Reuters.",
        "date": "08252017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BHP explores $2 bln stake sale in Canada potash mine-sources "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - BHP is using a commodity rally to fortify its financial position and placate critics. The Anglo-Australian miner swung to an annual net profit of $5.9 billion - missing forecasts but still improving on last year's $6.4 billion loss. Plans to exit a troubled shale business and hold off on investing in fertiliser mining chime with some demands from Elliott  the activist hedge fund. That compromise  plus a continued focus on financial strength  looks sensible.",
        "date": "08222017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BHP uses commodity rally to fortify position "
    },
    {
        "content": "MELBOURNE/LONDON Hedge fund Elliott Management has upped the stakes at BHP    gaining powers to push for change by raising its holding in the miner's London-listed arm to 5 percent.",
        "date": "08162017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "Hedge fund Elliott ups stakes at BHP by crossing threshold "
    },
    {
        "content": "* Rival Rio Tinto also expanding copper production (Adds context  quotes  detail)",
        "date": "08172017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "UPDATE 1-BHP to spend $2.5 bln on extending life of Chilean copper mine "
    },
    {
        "content": "LONDON Mining major BHP said on Thursday it was spending $2.46 billion to extend the life of the Spence copper mine in northern Chile by more than 50 years  creating up to 5 000 jobs and bringing new output online from 2021.",
        "date": "08172017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BHP to spend $2.5 billion on extending life of Chilean copper mine "
    },
    {
        "content": "VANCOUVER First Quantum Minerals Ltd said on Wednesday it plans to suspend operations at its Ravensthorpe nickel mine in Western Australia next month due to persistently weak nickel prices  affecting around 450 employees and contractors.",
        "date": "08102017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "First Quantum to shutter Australia nickel mine in September "
    },
    {
        "content": "* Other producers eye electric battery market (Adds analyst  Glencore comment  details)",
        "date": "08102017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UPDATE 2-First Quantum to shutter Australia nickel mine in September "
    },
    {
        "content": "SYDNEY  Aug 9 The rise of electric vehicles is driving the world's biggest mining house  BHP   to switch gears and invest heavily in its long-suffering nickel business.",
        "date": "08092017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "RPT-BHP turns to electric car batteries to recharge its nickel business "
    },
    {
        "content": "Aug 10 Britain's FTSE 100 index is seen opening down 45 points on Thursday  according to financial spreadbetters  with futures down 0.01 percent ahead of the cash market open.",
        "date": "08102017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UPDATE 1-UK Stocks-Factors to watch on Aug 10 "
    },
    {
        "content": "VANCOUVER  Aug 9 First Quantum Minerals Ltd said on Wednesday it plans to suspend operations at its Ravensthorpe nickel mine in Western Australia at the beginning of next month due to persistently weak nickel prices  sending its shares lower.",
        "date": "08092017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "First Quantum to shutter Australia nickel mine in Sept "
    },
    {
        "content": "    Aug 10 Britain's FTSE 100 index is seen opening down 45 points on Thursday  according to financial spreadbetters.          * BP: Australia's antitrust regulator said on Thursday it was concerned BP Plc's plan to buy the petrol stations of grocery giant Woolworths Ltd  would hurt competition  a sign it may block the A$1.8 billion ($1.4 billion) deal.     * SKY: Hedge fund manager Crispin Odey has said he is considering withdrawing his support for Twenty-First Century Fox's attempt",
        "date": "08102017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UK Stocks-Factors to watch on Aug 10 "
    },
    {
        "content": "SYDNEY  Aug 9 The rise of electric vehicles is driving the world's biggest mining house  BHP   to switch gears and invest heavily in its long-suffering nickel business.",
        "date": "08092017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BHP turns to electric car batteries to recharge its nickel business "
    },
    {
        "content": "    MELBOURNE  Aug 10 China aluminium extended gains on Thursday to strike its highest since 2012  with investors flooding into the market on prospects that capacity closures in the world's top producer would tighten supply.          FUNDAMENTALS     * SHFE ALUMINIUM: Shanghai Futures Exchange aluminium  had climbed 1.4 percent to 16 275 yuan ($2 443) a tonne by 0240 GMT  having earlier hit its highest since May 2012 at 16 460 yuan.      Open interest flew to a record-high around 900",
        "date": "08102017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "METALS-China aluminium hits 5-year high on capacity closures "
    },
    {
        "content": "* Fluor selected for BHP's south flank mining project in Australia",
        "date": "08022017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "BRIEF-Fluor selected for BHP's south flank mining project in Australia "
    },
    {
        "content": "* Denison reports extension of Cornerstone contract for environmental services business",
        "date": "07262017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "BRIEF-Denison reports extension of Cornerstone contract for environmental services business "
    },
    {
        "content": "SYDNEY  July 20 Activist shareholder Elliott Management said it has deep concerns over a proposal by BHP to enter the currently over-supplied fertiliser market  reiterating its call for change at the mining giant.",
        "date": "07202017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "Activist fund Elliott adds potash to list of BHP grievances "
    },
    {
        "content": "July 21 Bank stocks lost steam and pulled Australian shares lower on Friday as investors booked profits after two sessions of strong gains.",
        "date": "07212017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "Australia shares fall as bank stocks lose steam  NZ steady "
    },
    {
        "content": "SYDNEY BHP said it will spend A$350 million ($277 million) to boost capacity by about 6 percent at its underperforming Olympic Dam copper smelter  cutting production during the upgrade.",
        "date": "07192017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "BHP to spend $277 million to modernize Australian copper smelter "
    },
    {
        "content": "SYDNEY  July 19 BHP said it will spend A$350 million ($277 million) to boost capacity by about 6 percent at its underperforming Olympic Dam copper smelter  cutting production during the upgrade.",
        "date": "07192017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BHP to spend $277 mln to modernise Australian copper smelter "
    },
    {
        "content": "SYDNEY/MELBOURNE Mining giant BHP on Friday named successful packaging executive Ken MacKenzie as its next chairman  handing him the job of tackling calls to dump its oil business and overhaul the board.",
        "date": "06162017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "BHP names packaging guru MacKenzie as new chairman "
    },
    {
        "content": "* BHP under pressure to review structure  dump petroleum (Adds shareholder comment  paragraphs 4-5)",
        "date": "06162017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UPDATE 6-BHP names packaging guru MacKenzie as new chairman "
    },
    {
        "content": "SYDNEY Activist shareholder Elliott Management called on BHP  on Wednesday to \"upgrade\" its board of directors as the mining giant prepares to select a new chairman this week.",
        "date": "06142017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "Elliott calls for BHP board overhaul as new chairman looms "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - BHP has checked the right boxes in naming former packaging executive Ken MacKenzie as chairman. The 53-year old Canadian lopped heads and boosted returns at his last job  and was unsentimental about weak business lines. Activist investor Elliott is pleased. Other shareholders should be too.",
        "date": "06162017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "Packaging veteran ticks right boxes for BHP "
    },
    {
        "content": "* Latest Elliott missive comes as new BHP chairman looms (Adds comment from AMP  details of BHP board meeting)",
        "date": "06142017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UPDATE 1-Elliott calls for BHP board overhaul as new chairman looms "
    },
    {
        "content": "    June 16 Britain's FTSE 100 index is seen opening up 15 points at 7 434 on Friday  according to financial bookmakers.           * BHP: Mining giant BHP  on Friday named successful packaging executive Ken MacKenzie as its next chairman  handing him the job of tackling calls to dump its oil business and overhaul the board. Separately  activist shareholder Elliott Management said it supports the appointment of former packaging executive Ken MacKenzie as the next chairman of BHP.     ",
        "date": "06162017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UK Stocks-Factors to watch on June 16 "
    },
    {
        "content": "SYDNEY BHP's new chairman Ken MacKenzie  an avid sailor  is not afraid to rock the boat.",
        "date": "06162017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BHP's new chairman built reputation on Amcor turnaround "
    },
    {
        "content": "SYDNEY Activist shareholder Elliott Management said on Friday it supports the appointment of former packaging executive Ken MacKenzie as the next chairman of BHP",
        "date": "06162017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "Elliott says supports BHP's selection of MacKenzie as next chair "
    },
    {
        "content": "* Elliott says supports new BHP chair and new direction for BHP",
        "date": "06162017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BRIEF-Elliott says supports new BHP chair and new direction for BHP "
    },
    {
        "content": "SYDNEY A well-supplied global iron ore market will easily absorb lost production due to a fire at BHP's big Mt Whaleback iron ore mine in Australia  traders in the commodity said on Thursday.",
        "date": "06012017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "Iron ore market can absorb supply loss from BHP fire: traders "
    },
    {
        "content": "SYDNEY/MELBOURNE BHP's board is expected to select a new chairman at its June meeting to replace long-serving former Ford Motor Co boss Jac Nasser  according to two sources familiar with the matter.",
        "date": "06012017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BHP board set to select new chairman in June: sources "
    },
    {
        "content": "SYDNEY/MELBOURNE June 1 BHP's board is expected to select a new chairman at its June meeting to replace long-serving former Ford Motor Co boss Jac Nasser  according to two sources familiar with the matter.",
        "date": "06012017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BHP board set to select new chairman in June - sources "
    },
    {
        "content": "LONDON BHP   has hired Barclays  to divest its U.S. Fayetteville shale gas assets as the miner seeks to fend off an attack by activist funds  two sources close to the matter said on Tuesday.",
        "date": "05232017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "BHP hires Barclays to divest U.S. shale gas assets: sources "
    },
    {
        "content": "LONDON  May 23 BHP  has hired Barclays to divest its U.S. Fayetteville shale gas assets as the miner seeks to fend off an attack by activist funds  two sources close to the matter said on Tuesday.",
        "date": "05232017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BHP hires Barclays to divest U.S. shale gas assets - sources "
    },
    {
        "content": "LAUNCESTON  Australia Hedge fund Elliott Management is probably about half way to achieving its goal of extracting better returns out of BHP  the world's largest mining company.",
        "date": "05192017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "Elliott is half way to success by forcing BHP on the defensive: Russell "
    },
    {
        "content": "NEW YORK BHP Billiton Ltd's   Canadian potash mine will use advanced  cost-saving technology  giving it a competitive edge in a currently over-supplied fertilizer market  the executive in charge of the business said on Thursday.",
        "date": "05182017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "BHP stays course on Canada potash mine few expected built "
    },
    {
        "content": "* BHP and peers vs. commodity prices: http://tmsnrt.rs/2pF5uB8",
        "date": "05182017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "RPT-COLUMN-Elliott is half way to success by forcing BHP on the defensive: Russell "
    },
    {
        "content": "* BHP and peers vs. commodity prices: http://tmsnrt.rs/2pF5uB8",
        "date": "05182017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "COLUMN-Elliott is half way to success by forcing BHP on the defensive: Russell "
    },
    {
        "content": "SYDNEY/LONDON Activist investor Elliott Management raised the pressure for strategic changes at BHP   on Tuesday  calling for an independent review of the mining giant's petroleum business.",
        "date": "05162017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "Elliott increases pressure on BHP to ditch petroleum "
    },
    {
        "content": "* BHP expected to meet Elliott at Barcelona conference-source",
        "date": "05162017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UPDATE 5-Elliott increases pressure on BHP to ditch petroleum "
    },
    {
        "content": "MELBOURNE BHP  on Tuesday said it was disappointed with the latest salvo from Elliott Management which said the company was not open to suggestions and had been misleading in its response to the activist investor's calls for a change in strategy.",
        "date": "05162017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BHP rejects investor Elliott's claims it has been intransigent "
    },
    {
        "content": "SYDNEY  May 15 One of the last reminders of a merger 16 years ago that created the world's biggest mining house will be erased on Monday when BHP Billiton changes its name back to just BHP.",
        "date": "05142017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "Australia's BHP heads back to roots  drops Billiton from its name "
    },
    {
        "content": "SYDNEY  May 5 A second BHP Billiton Ltd shareholder has made a public push for strategic changes at the world's largest miner  with the Sydney-based Tribeca Global Natural Resources Fund calling for the company to divest U.S. shale assets and to review its board and senior management.",
        "date": "05042017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "BHP shareholder Tribeca calls for sale of U.S. shale assets  review of board "
    },
    {
        "content": "MELBOURNE/SYDNEY A second BHP Billiton Ltd   shareholder has made a public push for changes at the world's largest miner  with Sydney-based Tribeca Investment Partners pressing the company to sell its U.S. shale assets and overhaul its board.",
        "date": "05052017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "BHP investor Tribeca calls for sale of U.S. shale assets  board shake-up "
    },
    {
        "content": "* Fund calls for BHP to expand in battery materials (Adds details on Tribeca  BHP)",
        "date": "05052017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UPDATE 4-BHP investor Tribeca calls for sale of U.S. shale assets  board shake-up "
    },
    {
        "content": "* Elliott Advisors - sends letter and presentation to directors of BHP Billiton outlining \"shareholder value unlock plan\"",
        "date": "04102017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "BRIEF-Elliott Advisors sends letter to directors of BHP Billiton outlining \"shareholder value unlock plan\" "
    },
    {
        "content": "RIO DE JANEIRO  March 16 Brazilian iron ore miner Vale SA said on Thursday that a federal court in Minas Gerais has suspended a case brought by prosecutors seeking 155 billion reais ($49.7 billion) in damages for the 2015 Samarco mine disaster.",
        "date": "03162017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "Vale says Brazil court suspends Samarco damages lawsuit to help deal "
    },
    {
        "content": "MEXICO CITY  March 3 The first-ever joint venture in Mexico's deep waters could begin drilling its first oil well by the end of this year  a top official with national oil company Pemex said on Friday.",
        "date": "03032017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "Pemex  BHP Billiton deep water tie-up eyes first well by end of 2017 "
    },
    {
        "content": "* HY net profit $3.20 billion versus loss of $5.67 billion year ago",
        "date": "02212017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "BRIEF-BHP Billiton posts half-year net profit of $3.20 bln from year-ago loss of $5.67 bln "
    },
    {
        "content": "SYDNEY  Jan 19 BHP Ltd   its partner Vale SA and Samarco have reached an agreement with Brazil authorities to settle a $47.5 billion civil claim over the Samarco iron ore mine disaster  the companies said on Thursday.",
        "date": "01192017",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "BHP says reached settlement agreement with Brazil over Samarco "
    },
    {
        "content": "Jan 19 Britain's FTSE 100 index is expected to open 11 points higher on Thursday  according to financial bookmakers.          * The UK's FTSE added 0.4 percent  bouncing after posting its biggest one-day drop since June 2016 in the previous session on Brexit jitters. It ended 3.8 percent up at 7247.61 points on Wednesday.      * BHP: BHP Ltd   its partner Vale SA and Samarco have reached an agreement with Brazil authorities to settle a $47.5 billion civil claim over the Samarco iron ",
        "date": "01192017",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UK Stocks-Factors to watch on Jan 19 "
    },
    {
        "content": "* To extend $115 million in credit to joint venture Samarco in first-half 2017",
        "date": "11242016",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "RPT-BRIEF-Brazil's Vale to extend Samarco $151 mln in credit in H1 2017 "
    },
    {
        "content": "* To extend $115 million in credit to joint venture Samarco in first-half 2017",
        "date": "11242016",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BRIEF-Brazil's Vale to extend Samarco $151 mln in credit in H1 2017 "
    },
    {
        "content": "SAO PAULO Brazilian iron ore mining joint venture Samarco Mineração SA and its controllers Vale SA  and BHP Billiton Ltd  have 30 days to make a deposit of 1.2 billion reais ($354 million) to fund preparatory measures after last year's dam disaster  Vale said on Friday.",
        "date": "11112016",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "Brazil court rules Vale  BHP  Samarco to deposit $354 million after dam burst "
    },
    {
        "content": "SAO PAULO  Nov 11 Brazilian iron ore mining joint venture Samarco Mineração SA and its controllers Vale SA  and BHP Billiton Ltd have 30 days to make a deposit of 1.2 billion reais ($354 million) to fund preparatory measures after last year's dam disaster  Vale said on Friday.",
        "date": "11112016",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "Brazil court rules Vale  BHP  Samarco to deposit $354 mln after dam burst "
    },
    {
        "content": "WINNIPEG  Manitoba/WASHINGTON  Aug 30 Canada's Agrium Inc and Potash Corp of Saskatchewan Inc  said on Tuesday they are in talks to merge  a deal that would create a fertilizer and farm retailing giant worth more than $25 billion but also trigger U.S. regulatory scrutiny.",
        "date": "08302016",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UPDATE 6-Potash Corp  Agrium talk merger; competition scrutiny expected "
    },
    {
        "content": "SYDNEY  June 15 Exxon Mobil Corp and BHP Billiton Ltd said on Wednesday that they are considering selling depleting energy assets in Australia  including Kingfish  the country's largest ever discovered oil field.",
        "date": "06152016",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "Exxon  BHP considering sale of Australia oil and gas assets "
    },
    {
        "content": "SYDNEY  May 4 Australian shares sank more than 1.5 percent on Wednesday with resources among the hardest hit  as fears of further declines in metals prices and a court case dragged on mining giant BHP Billiton Ltd  and in turn on the index.",
        "date": "05042016",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "Miners lead Australia shares lower in profit-taking spree "
    },
    {
        "content": "NEW YORK  Feb 24 BHP Billiton Ltd   was sued in the United States by investors who accused the Anglo-Australian mining company of fraudulently overstating its ability to manage safety risks prior to November's fatal dam burst at a Brazilian mine it co-owned and operated.",
        "date": "02252016",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BHP Billiton investors sue in U.S. over Brazil dam disaster "
    },
    {
        "content": "Feb 25 Britain's FTSE 100 index is seen opening up 74-77 points  or 1.3 percent  on Thursday  according to financial bookmakers. Futures  were up  1.2 percent ahead of the cash market open. For more on the factors affecting European stocks  please click on",
        "date": "02252016",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UPDATE 1-UK Stocks-Factors to watch on Feb 25 "
    },
    {
        "content": "NEW YORK  Feb 25 BHP Billiton Ltd   was sued in the United States by investors who accused the Anglo-Australian mining company of fraudulently overstating its ability to manage safety risks prior to November's fatal dam burst at a Brazilian mine it co-owned and operated.",
        "date": "02252016",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UPDATE 2-BHP Billiton investors sue in U.S. over Brazil dam disaster "
    },
    {
        "content": "LONDON  Feb 25 European equity futures rose on Thursday  marking a recovery for the region's stock markets after two consecutive sessions of losses that pushed a benchmark equity index down to a one-week low.",
        "date": "02252016",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "European Factors to Watch-Equity futures rise "
    },
    {
        "content": "Feb 25 Britain's FTSE 100 index is seen opening up by 74-77 points  or 1.3 percent  on Thursday  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The UK blue chip index FTSE 100 ended down 1.6 percent at 5 867.18 on Wednesday  as mining stocks and FTSE heavyweight Standard Chartered  came under pressure for a second straight session.      * SHELL:  Royal Dutch Shell's U.S. head Marvin Odum will step down after the compa",
        "date": "02252016",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UK Stocks-Factors to watch on Feb 25 "
    },
    {
        "content": "LONDON  Feb 25 European stocks were seen opening higher on Thursday to recover some poise after two consecutive sessions of losses that pushed a benchmark equity index down to a one-week low.",
        "date": "02252016",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "European Factors to Watch-Shares seen higher at open "
    },
    {
        "content": "WASHINGTON  Feb 16 The U.S. Commerce Department said on Tuesday an Australian company once owned by the world's biggest miner BHP Billiton Ltd sold silicomanganese in the United States at a dumping margin of 12.03 percent  and a final decision on imposing duties on the imports would be made on March 28.",
        "date": "02162016",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "U.S. says ferroalloy imports from Australia sold at 12.03 pct dumping margin "
    },
    {
        "content": "RIO DE JANEIRO  Feb 11 A judge in Brazil's state of Minas Gerais has frozen 470 million reais ($118 million) of assets owned by Vale SA and 1.8 million reais linked to BHP Billiton Ltd to ensure payment of damages related to a deadly dam rupture  Rio de Janeiro's O Globo newspaper said on Thursday.",
        "date": "02122016",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "Brazil court freezes Vale  BHP  Samarco assets -report "
    },
    {
        "content": "LONDON  Feb 12 European stocks were seen rising on Friday  rebounding from the previous session's steep losses  with encouraging results from Commerzbank and a rally in oil prices expected to support banks and commodity-related stocks  and ease concerns over a slowdown in global growth.",
        "date": "02122016",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "European Factors to Watch-Shares set for rebound  helped by banks and oil "
    },
    {
        "content": "Feb 12 Britain's FTSE 100 index is seen opening up 111 points  or 2 percent  on Friday  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The UK blue-chip index closed 2.4 percent weaker at 5 536.97 points on Thursday  with a sharp sell-off in major banking and mining stocks pushing the market down to its lowest level in more than three years.      * BARCLAYS: Singapore's DBS Group Holdings and Oversea-Chinese Banking Co",
        "date": "02122016",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UK Stocks-Factors to watch on Feb 12 "
    },
    {
        "content": "* EBA's Enria says must not \"lose control\" of the single market",
        "date": "02052016",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "UPDATE 2-Proposals to keep Britain in EU must not distort banking rules - watchdog "
    },
    {
        "content": "SYDNEY/MELBOURNE Standard & Poor's cut BHP Billiton Ltd's credit rating and warned it might be lowered further if measures to shore up cash levels were not taken  cementing expectations the world's largest miner will slash its dividend for the first time in 15 years.",
        "date": "02022016",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "S&P cuts BHP credit rating  dividend cut seen as inevitable "
    },
    {
        "content": "LONDON  Dec 8 European shares headed for a steady open on Tuesday  with a slight recovery in crude oil prices and some positive company updates seen underpinning the market.",
        "date": "12082015",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "European Factors to Watch-Shares head for steady open "
    },
    {
        "content": "Dec 8 Britain's FTSE 100 index is seen opening up 12 by points  or 0.2 percent higher  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The UK blue chip index closed 0.2 percent lower at 6 223.52 points on Monday  as commodity shares came under severe pressure after prices of crude oil and metals slipped.     * OIL MAJORS: EU antitrust regulators have dropped Shell  BP   and Statoil from an investigation into suspected ",
        "date": "12082015",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UK Stocks-Factors to watch on Tuesday Dec 8 "
    },
    {
        "content": "BRASILIA  Nov 27 Brazil's federal and state governments plan to sue the owners of the Samarco iron ore miner for 20 billion reais ($5.24 billion)in damages caused by the burst of a tailings dam  Environment Minister Izabella Teixeira told reporters on Friday.",
        "date": "11292015",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "RPT-UPDATE 2-Brazil to sue BHP  Vale for $5 bln in damages for dam burst "
    },
    {
        "content": "BRASILIA Brazil's federal and state governments plan to sue the owners of the Samarco iron ore miner for 20 billion reais ($5.24 billion)in damages caused by the burst of a tailings dam  Environment Minister Izabella Teixeira told reporters on Friday.",
        "date": "11272015",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "Brazil to sue BHP  Vale for $5 billion in damages for dam burst "
    },
    {
        "content": "BRASILIA  Nov 27 Brazil's federal and state governments plan to sue the owners of the Samarco iron ore miner for 20 billion reais ($5.24 billion)in damages caused by the burst of a tailings dam  Environment Minister Izabella Teixeira told reporters on Friday.",
        "date": "11272015",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UPDATE 2-Brazil to sue BHP  Vale for $5 bln in damages for dam burst "
    },
    {
        "content": "BRASILIA  Nov 27 Brazil's federal and state governments plan to sue the owners of the Samarco iron ore miner for 20 billion reais ($5.24 billion)in damages caused by the burst of a tailings pond dam  Environment Minister Izabella Teixeira told reporters on Friday.",
        "date": "11272015",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "Brazil to sue BHP  Vale for $5 bln in damages for dam burst "
    },
    {
        "content": "* Last year Samarco contribution 14.5 mln/t   (Adds more BHP comment  details  company  analyst quotes)",
        "date": "11092015",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "UPDATE 1-BHP iron ore target under review after Brazil disaster "
    },
    {
        "content": "WASHINGTON  Sept 18 The U.S. Department of Commerce plans to impose duties on imports of ferroalloy from an Australian plant once owned by the world's biggest miner  BHP Billiton Ltd   according to a preliminary decision released on Friday.",
        "date": "09182015",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "U.S. sets duties on ferroalloy imports from Australian plant "
    },
    {
        "content": "MELBOURNE  Sept 10 BHP Billiton Ltd   plans to spend millions of dollars in a venture with a Canadian power company to promote carbon capture technology to help shore up coal demand.",
        "date": "09102015",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BHP to promote carbon capture technology with Canadian power company "
    },
    {
        "content": "WASHINGTON  July 21 Scores of Native American demonstrators protested at the U.S. Capitol on Tuesday against a proposed $6 billion copper mine in Arizona at a site that members of the Apache tribe say is sacred.",
        "date": "07212015",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "At U.S. Capitol  Arizona Apaches protest planned copper mine "
    },
    {
        "content": "MELBOURNE  May 18 BHP Billiton Ltd   is looking to take advantage of a slump in oil prices to pick up assets where it can use its deepwater drilling expertise to boost growth as it slows expansion in onshore shale  its petroleum head said.",
        "date": "05182015",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "BHP Billiton hunts for deepwater oil assets "
    },
    {
        "content": "MELBOURNE/LONDON  May 4 BHP Billiton's shareholders are expected to approve the biggest ever spin-off in the mining industry on Wednesday  seeking to wring more value out of a string of long-neglected aluminium  manganese  silver and nickel assets.",
        "date": "05032015",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "BHP's South32 risks tough market debut  M&A talk swirls "
    },
    {
        "content": "MELBOURNE BHP Billiton is contesting A$522 million ($409 million) in Australian tax bills on its Singapore marketing operations up to 2010  after having paid almost no tax in Singapore since 2006  the global miner told an Australian Senate panel.",
        "date": "04272015",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "BHP faces A$522 million tax bill on Singapore marketing hub "
    },
    {
        "content": "April 29 Cliffs Natural Resources Inc  which is struggling to cope with an over-supplied iron ore market  blamed industry leaders BHP Billiton Ltd  Rio Tinto PLC and Vale SA for weak prices for the commodity.",
        "date": "04292015",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "Cliffs Natural blames Rio  BHP  Vale for weak iron-ore prices "
    },
    {
        "content": "* Paid $121 00 in tax in Singapore in 2006-2014 for marketing hub",
        "date": "04272015",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UPDATE 1-BHP faces A$522 mln tax bill on Singapore marketing hub "
    },
    {
        "content": "April 29 Cliffs Natural Resources Inc  which is struggling to cope with oversupply in the iron ore market  blamed industry leaders BHP Billiton Ltd  Rio Tinto Plc and Vale SA for weak prices of the commodity.",
        "date": "04292015",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UPDATE 1-Cliffs Natural blames Rio  BHP  Vale for weak iron-ore prices "
    },
    {
        "content": "Lead Manager(s)         Deutsche Bank  RBS  Santander GBM  Credit Agricole ",
        "date": "04222015",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "New Issue- BHP prices multi tranche deal "
    },
    {
        "content": "WASHINGTON  March 12 U.S. trade officials will look into cheap imports of ferroalloy from an Australian plant owned by the world's biggest miner  BHP Billiton Ltd   which could end with the imposition of duties  the Department of Commerce said on Thursday.",
        "date": "03122015",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "RPT-U.S. to probe ferroalloy imports from Australian BHP plant "
    },
    {
        "content": "WASHINGTON  March 12 U.S. trade officials will look into cheap imports of ferroalloy from an Australian plant owned by the world's biggest miner  BHP Billiton Ltd   which could end with the imposition of duties  the Department of Commerce said on Thursday.",
        "date": "03122015",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "U.S. to probe ferroalloy imports from Australian BHP plant "
    },
    {
        "content": "LONDON  Feb 24 Greek shares outperformed flat European indexes on Tuesday after a list of proposed reforms submitted to international partners was received favourably by the European Commission.",
        "date": "02242015",
        "name": "BHP Billiton Limited",
        "news_type": "topStory",
        "symbol": "BHP",
        "title": "Greek shares outpace European indexes on rescue extension hopes "
    },
    {
        "content": "NEW YORK A former Banco Santander SA executive has been indicted for insider trading ahead of a proposed 2010 takeover of Potash Corp of Saskatchewan Inc by the mining group BHP Billiton Ltd  U.S. prosecutors said on Tuesday.",
        "date": "02032015",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "U.S. charges ex-Banco Santander executive with insider trading "
    },
    {
        "content": "NEW YORK  Feb 3 A former Banco Santander SA  executive has been indicted for insider trading ahead of a proposed 2010 takeover of Potash Corp of Saskatchewan Inc  by the mining group BHP Billiton Ltd  U.S. prosecutors said on Tuesday.",
        "date": "02032015",
        "name": "BHP Billiton Limited",
        "news_type": "normal",
        "symbol": "BHP",
        "title": "UPDATE 2-U.S. charges ex-Banco Santander executive with insider trading "
    }
]