[
    {
        "content": "BEIJING  Nov 18 China Citic Bank Corp and search engine giant Baidu Inc launched on Saturday a direct banking joint venture  dubbed AiBank  to capitalise on China's rapidly growing fintech sector.",
        "date": "11182017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China Citic  Baidu launch direct bank in fintech push "
    },
    {
        "content": "* Says it enters into strategic cooperation framework agreement with BIDU and Chongqing car rental firm",
        "date": "11142017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Lifan Industry (Group) unit plans cooperation with BIDU and Chongqing car rental firm "
    },
    {
        "content": "* PHILIPS LIGHTING PARTNERS WITH BAIDU TO BRING CONNECTED LIGHTING TO SMART HOMES IN CHINA‍​ Source text: http://bit.ly/2z8cP5E Further company coverage: (Gdynia Newsroom)",
        "date": "11162017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Philips Lighting partners with Baidu in China‍​ "
    },
    {
        "content": "* BAIDU UNVEILS RAVEN SERIES AI-POWERED HARDWARE AT 2017 BAIDU WORLD",
        "date": "11162017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu unveils Raven series AI-powered hardware "
    },
    {
        "content": "* Tony Yip  director nominated by Baidu Inc has tendered his resignation as director of the company  effective October 25  2017‍​",
        "date": "11022017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Tony Yip steps down as director of Ctrip.com International "
    },
    {
        "content": "BEIJING Chinese search engine giant Baidu and Shouqi Limousine & Chauffeur  a car-hailing operator  are joining up to develop driverless vehicles  the official Xinhua media service reported on Saturday.",
        "date": "10282017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China's Baidu teams up with Shouqi on driverless cars: Xinhua "
    },
    {
        "content": "BEIJING  Oct 28 Chinese search engine giant Baidu and Shouqi Limousine & Chauffeur  a car-hailing operator  are joining up to develop driverless vehicles  the official Xinhua media service reported on Saturday.",
        "date": "10282017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China's Baidu teams up with Shouqi on driverless cars - Xinhua "
    },
    {
        "content": "BEIJING Chinese search engine giant Baidu Inc offered a disappointing revenue outlook for the rest of the year  blaming lost advertising sales during this month's Communist Party Congress and sending its shares sliding.",
        "date": "10272017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Baidu revenue outlook hit by Congress meeting  shares plummet "
    },
    {
        "content": "* Baidu Inc - total revenues of rmb 23.5 billion ($3.53 billion) for q3 of 2017  representing a 29% increase from corresponding period in 2016​",
        "date": "10262017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu 3rd-qtr profit more than doubles "
    },
    {
        "content": "* LCG likely to be valued 10-12 times 2018 core earnings -source",
        "date": "10252017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Chinese firms eye U.S.-based Learning Care valued at up to $1.6 bln -sources "
    },
    {
        "content": "* Q4 revenue seen up 22-29 pct vs consensus estimate of 36 pct",
        "date": "10272017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 3-Baidu revenue outlook hit by Congress meeting  shares plummet "
    },
    {
        "content": "Oct 26 China's Baidu Inc reported a quarterly profit on Thursday that more than doubled  compared to a year earlier  helped by the search engine giant's spending control on traffic acquisition costs.",
        "date": "10262017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu 3rd-qtr profit more than doubles "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - China's Baidu has stumbled in getting back to basics. Investors wiped more than 10 percent  or slightly more than $9 billion  from the web giant's market value in late U.S. trading on Thursday after it forecast disappointing sales for the rest of 2017. Baidu has cut costs and narrowed its focus to revitalise its search business. Unfortunately  that has yet to translate into less volatile results.",
        "date": "10272017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Breakingviews - China's Baidu stumbles in getting back to basics "
    },
    {
        "content": "* Baidu signs strategic partnership agreements with Baic Group and King Long to accelerate autonomous driving",
        "date": "10202017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu signs strategic partnership agreements with Baic Group and King Long "
    },
    {
        "content": "HONG KONG Baidu Inc's  iQiyi  a Netflix  style video streaming service in China  has picked three banks to help arrange a U.S. initial public offering (IPO) worth about $1 billion  IFR reported on Monday  citing people familiar with the plans.",
        "date": "10162017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Baidu's iQiyi picks BofA  Credit Suisse  Goldman for U.S. IPO: IFR "
    },
    {
        "content": "HONG KONG  Oct 16 Baidu Inc's iQiyi  a Netflix style video streaming service in China  has picked three banks to help arrange a U.S. initial public offering (IPO) worth about $1 billion  IFR reported on Monday  citing people familiar with the plans.",
        "date": "10162017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu's iQiyi picks BofA  C. Suisse  Goldman for US IPO -IFR "
    },
    {
        "content": "HONG KONG/BEIJING Baidu Inc's  video streaming service iQiyi  a Chinese-style Netflix   is eyeing a potential initial public offering in the United States as early as next year  a person with direct knowledge of the plans said on Tuesday.     The listing could value the company at between $8 billion and $10 billion  Bloomberg reported earlier  citing two people familiar with the matter.",
        "date": "09262017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China's iQiyi considers U.S. listing as early as 2018: source "
    },
    {
        "content": "BEIJING China's cyber watchdog has handed down maximum penalties to several of the country's top tech firms  including Tencent Holdings Ltd   Baidu Inc  and Weibo Corp   for failing to properly censor online content.",
        "date": "09252017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China's cyber watchdog imposes top fines on tech firms over censorship "
    },
    {
        "content": "* Video service raised $1.53 bln earlier this year (Adds source information)",
        "date": "09262017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 3-China's iQiyi considers U.S. listing as early as 2018 – source "
    },
    {
        "content": "Sept 25 Baidu Inc's video streaming service  iQiyi  is looking for an initial public offering in the United States as early as next year  which could value it at more than $8 billion  Bloomberg reported.",
        "date": "09262017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu's iQiyi eyes US listing  over $8 bln in valuation - Bloomberg "
    },
    {
        "content": "* Nvidia says Alibaba Cloud  Baidu and Tencent are adopting new Nvidia Volta GPU computing platform to accelerate AI Source text for Eikon: Further company coverage:",
        "date": "09262017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BRIEF-Nvidia says Alibaba Cloud  Baidu  Tencent adopting new Nvidia Volta GPU computing platform "
    },
    {
        "content": "* Baidu Inc's iQiyi is targeting IPO as soon as 2018 that could value the streaming video service at more than $8 billion - Bloomberg  citing sources",
        "date": "09262017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu Inc's iQiyi to seek at least $8 bln value in IPO - Bloomberg "
    },
    {
        "content": "* TigerGraph emerges with $31 mln in Series A funding  introduces real-time graph platform",
        "date": "09192017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-TigerGraph emerges with $31 mln in Series A funding "
    },
    {
        "content": "BEIJING Chinese search engine Baidu Inc  announced a 10 billion yuan ($1.52 billion) autonomous driving fund on Thursday as part of a wider plan to speed up its technical development and compete with U.S. rivals.",
        "date": "09222017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China's Baidu launches $1.5 billion autonomous driving fund "
    },
    {
        "content": "BEIJING  Sept 21 Chinese search engine Baidu Inc announced a 10 billion yuan ($1.52 billion) autonomous driving fund on Thursday as part of a wider plan to speed up its technical development and compete with U.S. rivals.",
        "date": "09212017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China's Baidu launches $1.5 bln autonomous driving fund "
    },
    {
        "content": "* Seagate and Baidu sign strategic cooperation agreement for big data analysis and advanced storage implementation",
        "date": "09182017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Seagate  Baidu sign strategic cooperation agreement "
    },
    {
        "content": "* Baidu announces Apollo 1.5 and a 10 billion yuan autonomous driving fund",
        "date": "09212017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu announces Apollo 1.5 and a 10 billion yuan autonomous driving fund "
    },
    {
        "content": "SHANGHAI Chinese search engine giant Baidu Inc said on Monday it had hired the finance chief of Weibo Corp as its chief financial officer  marking a leadership change for the firm as its hones its focus onto artificial intelligence.",
        "date": "09182017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu hires Weibo CFO Herman Yu as finance chief amid AI push "
    },
    {
        "content": "* Baidu looking to shift focus towards mobile  AI (Adds details  Baidu chairman comments; alters dateline)",
        "date": "09182017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 1-Baidu hires Weibo CFO Herman Yu as finance chief amid AI push "
    },
    {
        "content": "Sept 17 Baidu Inc said Jennifer Li stepped down as its chief financial officer and the biggest search engine operator in China named Herman Yu as its new CFO  effective immediately.",
        "date": "09182017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu hires Weibo CFO as its finance chief "
    },
    {
        "content": "* Baidu Inc - Herman Yu joins Baidu from Weibo Corp  where he has served as chief financial officer since 2015",
        "date": "09182017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu appoints Herman Yu as Chief Financial Officer "
    },
    {
        "content": "* Says it signs cooperation framework agreement with Baidu's network technology firm",
        "date": "09062017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Vtron Group signs cooperation framework agreement with Baidu's network technology firm "
    },
    {
        "content": "* Advanced Micro Devices Inc - ‍AMD and Baidu announced a collaboration focused on optimizing software for amd radeon instinct gpus in baidu datacenters​ Source text for Eikon: Further company coverage:",
        "date": "08282017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Advanced Micro Devices  Baidu enters into collaboration "
    },
    {
        "content": "BEIJING  Aug 24 China Life Insurance Group Co and Baidu Inc will form a 7 billion yuan ($1 billion) private equity fund  targeting internet and other technology investments  China Life's listed arm said on Thursday.",
        "date": "08242017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China Life and Baidu to launch $1 billion internet fund "
    },
    {
        "content": "HONG KONG  Aug 22 KuangChi Science Ltd said its parent has invested 4 billion yuan ($600.3 million) in a 1.88 percent stake in China United Network Communications Ltd   becoming one of its strategic investors under a mixed ownership reform plan.",
        "date": "08222017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "KuangChi says parent invests $600 mln for 1.88 pct of Unicom "
    },
    {
        "content": "* Baidu is selling takeout delivery business to Alibaba-backed Ele.me - WSJ  citing sources Source text - http://on.wsj.com/2ijYmeV Further company coverage:",
        "date": "08212017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu is selling takeout delivery business to Ele.me - WSJ "
    },
    {
        "content": "* Baidu Inc - Xiaodu Life Technology Ltd has completed its merger with Rajax Merger Sub Limited",
        "date": "08242017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu announces disposal of its food delivery subsidiary "
    },
    {
        "content": "* Shanghai unit to raise the funds from Alibaba  Tencent  Baidu",
        "date": "08162017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 4-State-owned China Unicom to raise $12 bln from Alibaba  Tencent  others "
    },
    {
        "content": "BEIJING  Aug 11 China's top cyber authority said on Friday it is investigating several of China's most popular internet platforms over breaches of cyber laws.",
        "date": "08112017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China cyber authority says Baidu  Tencent  Weibo platforms under investigation "
    },
    {
        "content": "* Names popular social media platforms WeChat  Weibo (Adds Baidu comment  no comment from Tencent  Weibo  context)",
        "date": "08112017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 2-China investigates top local social media sites in push to control content "
    },
    {
        "content": "Aug 11 Hong Kong shares fell 2 percent on Friday  dragged down by a sell-off in internet-related shares and fears over the impact of rising tensions between the United States and North Korea.",
        "date": "08112017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Hong Kong shares suffer worst week in 2017 on North Korea jitters "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - Baidu rival Sogou is planning an initial public offering in the United States. But convincing investors to back a distant number two in China’s mobile-search market could be tricky. Sogou’s relationship with backer Tencent will be key.",
        "date": "08022017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Search engine IPO depends on Tencent for results "
    },
    {
        "content": "* Baidu Inc - ‍online marketing revenues for Q2 of 2017 were RMB17.883 billion ($2.638 billion)  representing a 5.6%​",
        "date": "07272017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu ‍non-GAAP diluted earnings per ADS for Q2 $2.36 "
    },
    {
        "content": "July 26 Digital payments company PayPal Holdings Inc raised its earnings outlook on Wednesday after reporting better-than-expected quarterly results  driven by growth in users and transaction volumes.",
        "date": "07262017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 2-PayPal raises 2017 forecasts on growth in users  payment volumes "
    },
    {
        "content": "July 27 China's Baidu Inc reported an 83.5 pct rise in quarterly profit on Thursday  as it shows signs of recovery after the crackdown on its core ad business by Chinese regulators last year.",
        "date": "07272017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu reports 83.5 pct rise in quarterly profit "
    },
    {
        "content": "BEIJING  July 27 Baidu Inc said on Friday that it has entered a strategic agreement with PayPal Holdings Inc to tap overseas merchants as Chinese tech companies ramp up the fight for overseas payment partnerships.",
        "date": "07272017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China's Baidu enters strategic partnership with Paypal to tap Chinese tourists "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - A recovery at Baidu buys time for reinvention. On Thursday  the Chinese web giant reported a forecast-beating jump in quarterly earnings  suggesting its core search business is rebounding. This gives Baidu more room to focus on mobile services and artificial intelligence.",
        "date": "07282017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Baidu rebound buys time for reinvention "
    },
    {
        "content": "Chinese internet search engine provider Baidu Inc has reported a jump in quarterly earnings  recovering from a string of regulatory investigations last year  as sharpened focus on mobile and artificial intelligence (AI) services drives growth.",
        "date": "07282017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China's Baidu profit jumps as focus on mobile  AI narrows "
    },
    {
        "content": "* Q3 revenue to grow as much as 30 pct (Adds executive comments  earnings breakdown  PayPal pact  context)",
        "date": "07282017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 2-China's Baidu profit jumps as focus on mobile  AI narrows "
    },
    {
        "content": "* Microsoft  Baidu Inc announce plans to partner to take technical development and adoption of autonomous driving worldwide",
        "date": "07182017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Microsoft  Baidu partner to take development  adoption of autonomous driving worldwide "
    },
    {
        "content": "HONG KONG Baidu Inc and JD.com will join other big Chinese technology firms  including Tencent Holdings  to jointly invest about $12 billion into state-owned mobile carrier China Unicom  two people with direct knowledge of the matter said.",
        "date": "07212017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Exclusive: Baidu  JD.com to join others investing $12 billion in China Unicom - sources "
    },
    {
        "content": "JERUSALEM  July 20 Dynamic Yield  a company that designed a digital platform to help online marketers  has raised $31 million in a investment round that included Deutsche Telekom Capital Partners  Deutsche Telekom's investment management group.",
        "date": "07202017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "REFILE-Dynamic Yield raises $31 mln from Deutsche Telekom Capital Partners  others "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG/SEOUL  July 21 (Fitch) Fitch Ratings has assigned China-based Baidu Inc.'s (A/Rating Watch Negative (RWN)) USD900 million 2.875% senior unsecured notes due 2022 and USD600 million 3.625% senior unsecured notes due 2027 a final rating of 'A' on RWN. The assignment of the final ratings follows the receipt of documents conforming to information already received. The final ratings are in line with the expected rating assigned on 2",
        "date": "07212017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Fitch Rates Baidu's Notes Final 'A'  On Watch Negative "
    },
    {
        "content": "BEIJING/SHANGHAI  July 6 Baidu Inc  China's biggest search engine provider  is under investigation to determine whether it had broken any laws after its chief executive tested a driverless car on public roads  Beijing's traffic police said on Thursday.",
        "date": "07062017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China's Baidu being probed after CEO tests driverless car on public roads "
    },
    {
        "content": "DETROIT  July 5 Baidu Inc  the top Chinese internet search firm  has formed a broad alliance to promote self-driving cars  pitting its Apollo platform against Alphabet Inc's system  it said on Wednesday  in hopes of getting the vehicles on the road in China by 2019.",
        "date": "07052017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China's Baidu taps 50 partners to help advance self-driving "
    },
    {
        "content": "* Futures up: Dow 8 pts  S&P 3.25 pts  Nasdaq 15.25 pts (Adds details  comment  updates prices)",
        "date": "07052017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "US STOCKS-Wall St set to open higher ahead of Fed minutes "
    },
    {
        "content": "* Nvidia - co   baidu announced partnership to bring artificial intelligence technology to cloud computing  self-driving vehicles and ai home assistants",
        "date": "07052017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BRIEF-NVIDIA  Baidu announce partnership to accelerate AI "
    },
    {
        "content": "AMSTERDAM  July 5 TomTom NV  the Dutch maker of navigation software for cars  on Wednesday said it had struck a deal with Chinese internet company Baidu to collaborate on digital maps used for computer-assisted driving.",
        "date": "07052017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "TomTom  Baidu to collaborate on maps for computer-assisted driving "
    },
    {
        "content": "SUNNYVALE  Calif.  June 30 Baidu  China's leading internet search company  is set to announce the first vehicle manufacturing partners for its self-driving software next week  including Chery Automobile  one of the country's biggest carmakers  according to a person familiar with the matter.",
        "date": "06302017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu leads China’s self-driving charge in Silicon Valley "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG/SEOUL  June 26 (Fitch) Fitch Ratings has assigned China-based Baidu Inc.'s (A/Rating Watch Negative (RWN)) proposed US dollar senior unsecured notes an expected rating of 'A(EXP)' on RWN. The final rating on the notes is contingent upon the receipt of final documents conforming to information already received. The notes are rated in line with Baidu's senior unsecured rating of 'A' on RWN as they will rank pari passu with the i",
        "date": "06272017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Fitch Rates Baidu's Proposed Notes 'A(EXP)'  On Watch Negative "
    },
    {
        "content": "* TOMTOM AND BAIDU JOIN FORCES TO DEVELOP UNIFIED HIGH DEFINITION MAPS FOR AUTONOMOUS DRIVING",
        "date": "07052017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BRIEF-Tomtom and Baidu to develop unified HD maps for autonomous driving "
    },
    {
        "content": "* Baidu forms alliance to accelerate adoption of autonomous driving",
        "date": "07052017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu forms alliance to accelerate adoption of autonomous driving "
    },
    {
        "content": "* Baidu Inc files preliminary prospectus supplement related to a potential two-part notes offering - sec filing Source text: (http://bit.ly/2uadT27) Further company coverage:",
        "date": "06262017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu files preliminary prospectus supplement related to potential two-part notes offering "
    },
    {
        "content": "* Files for potential debt shelf offering; size not disclosed - sec filing Source text: (http://bit.ly/2rV8OtR) Further company coverage:",
        "date": "06262017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu files for potential debt shelf offering; size not disclosed "
    },
    {
        "content": "FRANKFURT  May 31 Auto supplier Continental AG on Wednesday signed a strategic cooperation agreement with Chinese Internet company Baidu to develop autonomous and connected cars.",
        "date": "05312017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Continental unveils collaboration with Baidu on autonomous cars "
    },
    {
        "content": "* Baidu and bosch sign strategic cooperation agreement to deepen cooperation in automated driving Source text for Eikon: Further company coverage:",
        "date": "06012017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu  Bosch to deepen cooperation in automated driving "
    },
    {
        "content": "* Says Baidu And Continental sign agreement to collaborate on automated driving Source text for Eikon: Further company coverage:",
        "date": "06012017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu  Continental sign agreement to collaborate on automated driving "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG/SEOUL  May 31 (Fitch) Fitch Ratings has placed China-based Baidu  Inc.'s (Baidu) 'A' Long-Term Foreign- and Local-Currency Issuer Default Ratings (IDRs) and 'A' foreign-currency senior unsecured rating on Rating Watch Negative (RWN). A full list of rating actions is at the end of this release. The RWN reflects Fitch's belief that the rapid growth in Baidu's financial services activities under its wholly owned Financial Service",
        "date": "05312017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Fitch Places Baidu on Negative Watch on Higher Financial Services Risk "
    },
    {
        "content": "SAN FRANCISCO  June 1 Chinese Internet company Baidu announced two separate partnership deals on Thursday with top German auto suppliers Robert Bosch and Continental AG to co-develop autonomous driving technology and smart mobility services.",
        "date": "06012017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu in self-driving car tech tie-ups with Bosch  Continental "
    },
    {
        "content": "BEIJING Baidu Inc on Friday forecast second-quarter revenue largely below estimates as the Chinese internet company continues to grapple with Beijing's restrictions on its lucrative medical advertisements segment  sending its shares down six percent in extended trading.",
        "date": "04282017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Baidu sees weak second quarter as ad business curbs hurt; shares fall "
    },
    {
        "content": "* Baidu Inc - total revenues in q1 of 2017 were rmb16.891 billion ($2.454 billion)  a 6.8 pct increase from corresponding period in 2016",
        "date": "04272017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu Q1 revenue of RMB16.891 bln($2.454 bln) "
    },
    {
        "content": "Baidu Inc  said on Tuesday it would launch its self-driving car technology for restricted environment in July before gradually introducing fully autonomous driving capabilities on highways and open city roads by 2020.",
        "date": "04192017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Baidu to launch self-driving car technology in July "
    },
    {
        "content": "SHANGHAI Germany's Robert Bosch  will collaborate with Chinese internet giant Baidu Inc  and domestic mapping firms AutoNavi and NavInfo Co Ltd  on automated driving projects  the engineer said in a statement on Wednesday.",
        "date": "04192017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Bosch in self-driving tie-up with China's Baidu  AutoNavi "
    },
    {
        "content": "SHANGHAI Bitauto Holdings Ltd  has raised around $1 billion from Tencent Holdings Ltd   Baidu Inc  and JD.com Inc  to date as it seeks to develop China's largest online car financing platform  its chief told Reuters on Thursday.",
        "date": "04202017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China's Bitauto unit raises $1 billion from internet giants Tencent  Baidu "
    },
    {
        "content": "SHANGHAI Chinese electric vehicle start-up Nio will start selling its first mass-production vehicle next year  the firm said in a statement on Wednesday  as it unveiled its ES8 SUV car at the Shanghai auto show.",
        "date": "04192017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China EV start-up Nio to sell mass-production car next year "
    },
    {
        "content": "April 18 Baidu Inc said on Tuesday it would launch its self-driving car technology for restricted environment in July before gradually introducing fully autonomous driving capabilities on highways and open city roads by 2020.",
        "date": "04192017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 1-Baidu to launch self-driving car technology in July "
    },
    {
        "content": "SHANGHAI  April 20 Bitauto Holdings Ltd has raised around $1 billion from Tencent Holdings Ltd   Baidu Inc and JD.com Inc to date as it seeks to develop China's largest online car financing platform  its chief told Reuters on Thursday.",
        "date": "04202017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "AUTOSHOW-China's Bitauto unit raises $1 bln from internet giants Tencent  Baidu "
    },
    {
        "content": "SHANGHAI  April 19 Chinese electric vehicle start-up Nio will start selling its first mass-production vehicle next year  the firm said in a statement on Wednesday  as it unveiled its ES8 SUV car at the Shanghai auto show.",
        "date": "04192017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "AUTOSHOW-China EV start-up Nio to sell mass-production car next year "
    },
    {
        "content": "* Baidu further strengthens visual perception capabilities with acquisition of xPerception",
        "date": "04132017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu to acquire xPerception "
    },
    {
        "content": "April 12 Visual China Group Co Ltd * Says unit signs strategic agreement with Baidu Inc Source text in Chinese:http://bit.ly/2o6ow3g Further company coverage: (Reporting by Hong Kong newsroom) ",
        "date": "04122017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Visual China's unit signs strategic agreement with Baidu "
    },
    {
        "content": "SHANGHAI  April 20 Auto portal Bitauto Holdings Ltd has recently raised $1 billion from Tencent Holdings Ltd  Baidu Inc and JD.com Inc as it seeks to be China's largest online car financing platform  its chief told Reuters on Thursday.",
        "date": "04202017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "AUTOSHOW-China's Bitauto raises $1 bln from internet giants Tencent  Baidu "
    },
    {
        "content": "April 18 Baidu Inc said on Tuesday it would open its self-driving car technology for restricted environment in July this year.",
        "date": "04192017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu to launch autonomous car technology in July "
    },
    {
        "content": "BEIJING  April 13 Chinese internet firm Baidu Inc has agreed to acquire U.S. computer vision firm xPerception for an undisclosed amount to support their renewed efforts in artificial intelligence as Chinese tech firms face regulatory headwinds in U.S.",
        "date": "04132017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China's Baidu buys U.S. computer vision startup amid AI push "
    },
    {
        "content": "* Baidu  Tencent  Huasheng Cap among other backers - local media (Adds details of deal and background)",
        "date": "04202017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 1-Vanke to invest $435 mln in China property agency Lianjia "
    },
    {
        "content": "* Baidu announces project Apollo  opening up its autonomous driving platform",
        "date": "04192017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu to open autonomous driving technology for restricted environment in July "
    },
    {
        "content": "SHANGHAI  March 22 Baidu Inc chief scientist Andrew Ng said on Wednesday he will resign from the Chinese search engine company after three years of leading its drive into artificial intelligence (AI) and augmented reality (AR) projects.",
        "date": "03222017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu's chief scientist  who led firm's AI push  to resign "
    },
    {
        "content": "* Baidu's chief scientist Andrew Ng says he is resigning from Baidu- blog post  Source http://bit.ly/2nQGebh",
        "date": "03222017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu's chief scientist Andrew Ng says he is resigning from Baidu- blog post "
    },
    {
        "content": "BEIJING  March 16 Baidu Inc said on Thursday it fired the head of its Nuomi group-buying service over ethics violations  at a time when the internet giant is looking to retool its sluggish search business and streamline loss-making units including Nuomi.",
        "date": "03162017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu fires head of group-buying unit over kickbacks "
    },
    {
        "content": "BERLIN Carmakers and suppliers gave widely differing timelines for the introduction of self-driving vehicles on Thursday  showing the uncertainties surrounding the technology as well as a split between cautious established players and bullish new entrants.",
        "date": "03162017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Car industry players diverge on timescale for self-driving cars "
    },
    {
        "content": "SHANGHAI  March 17 Baidu Inc said on Friday it had led an investment round into green car start-up NextEV  as the Chinese search engine giant looks for new growth drivers and as competition heats up in the fast-growing electric vehicles market.",
        "date": "03172017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu leads investment into green car start-up NextEV "
    },
    {
        "content": "BEIJING Baidu Inc's  revenue fell for a second straight quarter  hurt by a government crackdown on healthcare advertising  but the internet search giant expects a rebound this year as it retools to find growth outside its core ad business.",
        "date": "02242017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Baidu posts bleak fourth quarter  but sees business reshuffle driving 2017 growth "
    },
    {
        "content": "* Posts 2nd straight drop in quarterly revenue on China ad curbs",
        "date": "02242017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 2-Baidu posts bleak Q4  but sees business reshuffle driving 2017 growth "
    },
    {
        "content": "BEIJING  Feb 21 iQiyi.com  the video subsidiary of Chinese internet company Baidu Inc  has raised $1.53 billion in new funds to compete with rivals in the country's hotly contested online entertainment sector.",
        "date": "02212017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu-backed video service iQiyi raises 1.53 billion "
    },
    {
        "content": "BEIJING Baidu Inc  the Internet firm behind China's largest search engine  on Thursday denied media reports that said CEO Robin Li was subject to a travel ban.",
        "date": "02232017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu denies CEO faces travel ban "
    },
    {
        "content": "SINGAPORE  Feb 9 Chinese search engine giant Baidu Inc will close some of its medical businesses and fold other health segments into its artificial intelligence and search teams  the firm said in a statement sent to Reuters on Thursday.",
        "date": "02092017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Baidu to fold embattled medical business into AI  search units "
    },
    {
        "content": "BEIJING  Jan 16 Chinese search engine Baidu Inc  on Monday launched an augmented reality (AR) lab in Beijing as part of a $200 million effort to revitalise the company's shrinking profits with cutting edge technology.",
        "date": "01162017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China's Baidu opens augmented reality lab to boost waning profits "
    },
    {
        "content": "BEIJING  Jan 17 China's Baidu Inc said it has appointed a former Microsoft Corp executive as chief operating officer  part of a push into artificial intelligence as earnings from its core search engine business wane.",
        "date": "01172017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu names former Microsoft exec as COO in artificial intelligence push "
    },
    {
        "content": "* Baidu appoints dr. Qi Lu as group president and chief operating officer",
        "date": "01172017",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu appoints Qi Lu as group president and COO "
    },
    {
        "content": "* Entering into the Strategic Cooperation Framework Agreement with Baidu",
        "date": "01092017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-BAIC Motor enters strategic cooperation framework agreement with Baidu "
    },
    {
        "content": "* Says under new strategic partnership  Baidu and BAIC will cooperate on two key projects",
        "date": "01062017",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu enters strategic partnership with BAIC "
    },
    {
        "content": "BEIJING Chinese internet giant Baidu Inc said on Friday that reports it is currently pushing for an initial public offering for its video-streaming site iQiyi.com are inaccurate.",
        "date": "12232016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Baidu says reports of IPO for video-streaming site iQiyi.com are inaccurate "
    },
    {
        "content": "Baidu Inc  China's largest internet search company  plans an initial public offering of shares in its video-streaming site  iQiyi.com  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "12222016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Baidu plans $1 billion IPO for video-streaming site iQiyi.com: WSJ "
    },
    {
        "content": "GUANGZHOU/WUZHEN  China  Nov 18 German automaker BMW and Chinese internet giant Baidu will end their joint research on self-driving cars  executives for the two firms said on Friday  with Baidu now searching for new global research partners.",
        "date": "11182016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BMW  Baidu joint project on self-driving cars breaks down "
    },
    {
        "content": "BEIJING A top Baidu Inc executive  widely seen as a potential successor to chief executive Robin Li  has resigned after an internal company probe found conflicts of interest involving another firm acquired by the Chinese search engine giant.",
        "date": "11072016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "'Prince' of Baidu  tipped for top role  resigns after probe: sources "
    },
    {
        "content": "BEIJING  Nov 7 A top Baidu Inc  executive  widely seen as a potential successor to chief executive Robin Li  has resigned after an internal company probe found conflicts of interest involving another firm acquired by the Chinese search engine giant.",
        "date": "11072016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "\"Prince\" of Baidu  tipped for top role  resigns after probe - sources "
    },
    {
        "content": "BEIJING Chinese internet search giant Baidu Inc  warned investors fourth-quarter revenue will slide  hitting shares  as a government crackdown on healthcare advertising that tipped the firm into its first-ever quarterly sales drop bites even harder.",
        "date": "10282016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "After third-quarter revenue drop  Baidu warns China ad curbs to hit fourth-quarter harder "
    },
    {
        "content": "* Baidu Inc - Online marketing revenues for Q3 of 2016 were RMB16.490 billion representing a 6.7% decrease from corresponding period in 2015",
        "date": "10272016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu announces third quarter 2016 results "
    },
    {
        "content": "* slightly ahead of estimates   (Adds details  executive comments)",
        "date": "10282016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 2-After Q3 revenue drop  Baidu warns China ad curbs to hit Q4 harder "
    },
    {
        "content": "Oct 27 China's Baidu Inc reported its first-ever quarterly revenue decline as a government crackdown on healthcare advertising earlier this year continues to take its toll on the country's top search engine.",
        "date": "10272016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China search engine Baidu posts first-ever quarterly revenue decline "
    },
    {
        "content": "BEIJING China's Baidu Inc said on Wednesday it has established a 20 billion yuan ($3 billion) investment fund  Baidu Capital  as the country's dominant search engine seeks a way to remain relevant in the smartphone era and beyond.",
        "date": "10122016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China's Baidu sets up $3 billion internet investment fund "
    },
    {
        "content": "BEIJING  Oct 12 China's Baidu Inc said on Wednesday it has established a 20 billion yuan ($3 billion) investment fund  Baidu Capital  as the country's dominant search engine seeks a way to remain relevant in the smartphone era and beyond.",
        "date": "10122016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 1-China's Baidu sets up $3 bln internet investment fund "
    },
    {
        "content": "BEIJING  Oct 12 China's Baidu Inc said on Wednesday it has established a 20 billion yuan ($3 billion) investment fund  Baidu Capital  focusing on mid- and late-stage deals in the internet sector.",
        "date": "10122016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China's Baidu sets up $3 bln internet investment fund "
    },
    {
        "content": "* Says it signs framework agreement with Baidu  share trade to resume on Oct 11",
        "date": "10102016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Beiqi Foton Motor signs framework agreement with Baidu "
    },
    {
        "content": "* Baidu leads $60 million investment to establish brazil-based investment fund 'easterly ventures'",
        "date": "09282016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu leads $60 mln investment to establish brazil-based investment fund "
    },
    {
        "content": "SAN FRANCISCO  Sept 15 China-based internet company Baidu has received a permit to test its self-driving cars in California from the state's Department of Motor Vehicles  as the race to introduce driverless automobiles accelerates.",
        "date": "09152016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu receives approval from California DMV to test self-driving cars "
    },
    {
        "content": "Sept 12 U.S. chipmaker Nvidia Corp  showed off on Monday a smaller and more efficient artificial intelligence computer for self-driving cars  saying it would power Baidu's mapping and autonomous vehicle technology.",
        "date": "09132016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Nvidia shows off smaller artificial intelligence computer for Baidu car "
    },
    {
        "content": "DETROIT  Aug 16 Ford Motor Co and Baidu Inc  the Chinese search engine giant  have jointly invested $150 million in Velodyne  which makes a key component in self-driving cars as Ford ramps up development in the autonomous field.",
        "date": "08162016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Ford  Baidu co-invest in autonomous tech firm Velodyne "
    },
    {
        "content": "* Velodyne LiDAR says completion of combined $150 Mln investment from co-investors Ford Motor and Baidu Inc",
        "date": "08162016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BRIEF-Velodyne LiDAR announces completion of combined $150 mln investment from co-investors Ford Motor  Baidu "
    },
    {
        "content": "* Announced DuSee  a new augmented reality platform developed for smartphones; DuSee will be integrated into Baidu's platform apps  Source text for Eikon:  Further company coverage:",
        "date": "08032016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu announces DuSee  new augmented reality platform for smartphones "
    },
    {
        "content": " ",
        "date": "08012016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Uber to combine China business with Didi Chuxing in $35 bln merger - Bloomberg "
    },
    {
        "content": "* Mobile revenue represented 62% of total revenues for Q2 of 2016",
        "date": "07282016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu announces Q2 2016 results "
    },
    {
        "content": "July 25 Chinese internet search company Baidu Inc said on Monday an offer it received in February to buy its stake in online video unit iQiyi has been withdrawn.",
        "date": "07252016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu says offer to buy its stake in online video unit withdrawn "
    },
    {
        "content": "BEIJING  July 19 China's internet regulator said it will investigate Baidu Inc after domestic media reported illegal gambling websites used the country's biggest search engine to promote themselves.",
        "date": "07192016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China internet watchdog to probe Baidu over reports it was used to promote gambling "
    },
    {
        "content": "BEIJING Baidu Inc's  planned sale of online video unit iQiyi to its own chief executive is priced too low and will damage its reputation  an investor in the Chinese internet company said.",
        "date": "07192016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu investor criticizes proposed sale of video unit to CEO "
    },
    {
        "content": "* Announced today that it has received a strategic investment from Baidu",
        "date": "07182016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Zestfinance receives strategic investment from Baidu "
    },
    {
        "content": "* Baidu says it upholds highest standards of governance   (Adds investor's comments  Baidu response)",
        "date": "07192016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 1-Baidu investor criticises proposed sale of video unit to CEO "
    },
    {
        "content": "BEIJING  July 19 Baidu Inc's proposed sale of online video unit iQiyi to its own chief executive is not in the interests of long-term shareholders and may permanently damage the reputation of the company  an investor in the Chinese internet firm said.",
        "date": "07192016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu investor criticises sale of video unit to CEO "
    },
    {
        "content": "* Says its unit TRANS. entered into basic agreement with ImageWorks Corporation  the Japan-based agency of Baidu Map",
        "date": "07122016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Transaction Co Ltd unit enters into basic agreement with ImageWorks Corporation for Baidu Map promotion in JP "
    },
    {
        "content": "* Says it signs framework agreement with Baidu's affiliate on cloud business development",
        "date": "06152016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Xiamen 35.com teams up with Baidu's affiliate on cloud business "
    },
    {
        "content": "* Baidu announces revised revenue guidance for second quarter 2016 and announces conference call scheduled for June 13  2016 for discussion",
        "date": "06132016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu announces revised revenue guidance for Q2 2016 "
    },
    {
        "content": "* Baidu Inc Says  On June 8  2016 Co Signed A Five-Year US$2 billion term and revolving facilities agreement with a group of 21 arrangers",
        "date": "06102016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu signs five-year $2 mln term  revolving facilities agreement on June 8 "
    },
    {
        "content": "Chinese auto information website operator Bitauto Holdings Ltd  said it is raising $300 million from internet companies Tencent Holdings Ltd   Baidu Inc  and JD.com Inc  and an additional investor.",
        "date": "06062016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Chinese auto website Bitauto to get $300 million in funding "
    },
    {
        "content": "June 6 Chinese auto information website operator Bitauto Holdings Ltd said it is raising $300 million from internet companies Tencent Holdings Ltd  Baidu Inc and JD.com Inc and an additional investor.",
        "date": "06062016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Chinese auto website Bitauto to get $300 mln in funding "
    },
    {
        "content": "* Baidu  Tencent and JD.com announce strategic investment in Bitauto",
        "date": "06062016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu  Tencent and JD.com announce strategic investment in Bitauto "
    },
    {
        "content": "* Moody's changes Baidu's ratings outlook to stable and affirms A3 ratings",
        "date": "05132016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Moody's changes Baidu's ratings outlook to stable and affirms A3 ratings "
    },
    {
        "content": "* Has taken and will continue to take measures to comply with requests from PRC regulators",
        "date": "05102016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu takes measures to improve online marketing services "
    },
    {
        "content": "BEIJING  May 10 Baidu Inc's CEO has called on employees to put values before profit in response to a scandal around the death of a student who underwent an experimental cancer treatment he found on the company's search website.",
        "date": "05102016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu CEO tells staff to put values before profit after cancer death scandal "
    },
    {
        "content": "BEIJING Chinese regulators have imposed limits on the number of lucrative healthcare adverts carried by Baidu Inc  following the death of a student who underwent an experimental cancer treatment which he found using China's biggest Internet search engine.",
        "date": "05092016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China curbs Baidu healthcare ads business after student's death "
    },
    {
        "content": "BEIJING The death of a student following experimental cancer treatment he found through China's biggest search engine  Baidu Inc   has exposed the faultlines in the company's business model  which relies heavily on income from the country's lightly regulated health sector.",
        "date": "05072016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Reliance on China health sector raises searching questions for Baidu "
    },
    {
        "content": "* Ads can be maximum 30 pct of a search results page -regulators",
        "date": "05092016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "REFILE-UPDATE 2-China curbs Baidu healthcare ads business after student's death "
    },
    {
        "content": "BEIJING  May 9 Baidu Inc must rein in paid-for advertisements within search results after a student died following experimental cancer treatment he found via China's biggest search engine  Chinese regulators said on Monday.",
        "date": "05092016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China rules Baidu must rein in healthcare adverts after cancer controversy "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG/SYDNEY  May 09 (Fitch) Fitch Ratings says the Chinese authorities'  investigation into Baidu  Inc. (A/Stable) after the death of a student  who  accused the company of promoting false medical information on its search engine   highlights the heightened regulatory risk facing Baidu's core search business. Baidu's reputation has been affected by this incident. The outcome of the  investigation and any actions arising may harm Ba",
        "date": "05092016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Fitch: Regulatory Risk in Baidu's Search Business Adds to Challenges "
    },
    {
        "content": "* Baidu gets 20-30% of search revenue from healthcare -analysts",
        "date": "05082016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "RPT-Reliance on China health sector raises searching questions for Baidu "
    },
    {
        "content": "BEIJING China's Internet regulator said on Monday it will send a team to investigate Baidu Inc  over the death of a university student who used the Chinese search engine to look for treatment for his cancer. | Video ",
        "date": "05032016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China to investigate Baidu over student's death  shares dive "
    },
    {
        "content": "BEIJING Chinese search leader Baidu Inc's first-quarter net income fell to its lowest level since 2012 and revenue grew at its slowest pace in more than seven years  as its long decline from previously heady growth continued.",
        "date": "04292016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Chinese search leader Baidu's profits sink to four-year low "
    },
    {
        "content": "SHANGHAI China's health ministry will investigate a hospital that a university student turned to for cancer treatment after seeking information on the Baidu Inc search engine  a state health commission said on Tuesday.",
        "date": "05032016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China to investigate hospital dying student found on search engine "
    },
    {
        "content": "BEIJING  April 29 Chinese search leader Baidu Inc's food delivery affiliate Baidu Takeout Delivery has closed a funding round valuing the unit at $2.5 billion  Robin Li  Baidu chief executive  said on Friday.",
        "date": "04292016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu food delivery unit valued at $2.5 bln "
    },
    {
        "content": "HONG KONG  May 3 (IFR) - Asian credit was slightly wider today  but Chinese search engine Baidu came under heavy pressure in the face of accusations that it promotes the delivery of false medical information.",
        "date": "05032016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "ASIA CREDIT CLOSE: Credit slightly wider; Baidu under pressure "
    },
    {
        "content": "* Total revenues in q1 of 2016 were rmb15.821 billion ( $2.454 billion )  a 31.2% year-over-year increase",
        "date": "04282016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Baidu sees Q2 2016 revenue up 21.3 to 24.2 percent "
    },
    {
        "content": "BEIJING Baidu Inc has completed raising around 1 billion yuan  ($154.69 million) for a new video business affiliate  it said in a posting on its microblog on Wednesday.",
        "date": "04202016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Baidu says completed around $155 million fundraising for new video business affiliate "
    },
    {
        "content": "BEIJING  April 20 Baidu Inc has completed raising around 1 billion yuan  ($154.69 million) for a new video business affiliate  it said in a posting on its microblog on Wednesday.",
        "date": "04202016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "CORRECTED-Baidu says completed around $155 mln fundraising for new video business affiliate "
    },
    {
        "content": "* Says it plans to invest up to 250 million yuan  ($38.66 million) in Baidu's video arm",
        "date": "04202016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "BRIEF-Dalian Zeus Entertainment to invest up to 250 mln yuan in Baidu's video arm "
    },
    {
        "content": "* Says is seeking a $1 billion 5-year loan -spokesman  Further company coverage:    (Reporting By Paul Carsten)",
        "date": "04122016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-China's Baidu seeks $1 billion 5-year loan "
    },
    {
        "content": "China's Baidu Inc   the country's long-dominant Internet search firm  turned in a slightly better-than-expected fourth quarter  but is now grappling with a protracted slowdown in revenue growth - one that the company expects to continue.",
        "date": "02262016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Still strong  China's Baidu sees revenue growth fading "
    },
    {
        "content": "* Heavy spending on new business taking toll on margins   (Recasts  adds context on strategy  slowdown)",
        "date": "02262016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 2-Still strong  China's Baidu sees revenue growth fading "
    },
    {
        "content": "Feb 25 Baidu Inc  sometimes referred to as China's Google  reported a 33 percent increase in quarterly revenue as more advertising money flowed into its core search engine business.",
        "date": "02252016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China's Baidu reports 33 pct jump in quarterly revenue "
    },
    {
        "content": "SINGAPORE/BEIJING Thousands of apps running code built by Chinese Internet giant Baidu have collected and transmitted users' personal information to the company  much of it easily intercepted  researchers say.",
        "date": "02242016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Thousands of apps running Baidu code collect  leak personal data - research "
    },
    {
        "content": "SINGAPORE/BEIJING Thousands of apps running code built by Chinese Internet giant Baidu have collected and transmitted users' personal information to the company  much of it easily intercepted  researchers say.",
        "date": "02232016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Thousands of apps running Baidu code collect  leak personal data: research "
    },
    {
        "content": "SINGAPORE/BEIJING  Feb 24 Thousands of apps running code built by Chinese Internet giant Baidu have collected and transmitted users' personal information to the company  much of it easily intercepted  researchers say.",
        "date": "02232016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Thousands of apps running Baidu code collect  leak personal data - research "
    },
    {
        "content": "Feb 12 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Friday:",
        "date": "02122016",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Chinese Internet search company Baidu Inc said it received an offer for its 80.5 percent stake in online video company Qiyi.com Inc from the chief executives of the two firms.",
        "date": "02122016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China's Baidu gets offer for its 80.5 percent stake in Qiyi "
    },
    {
        "content": "Feb 12 Chinese Internet search company Baidu Inc  said it received an offer for its 80.5 percent stake in online video company Qiyi.com Inc from the chief executives of the two firms.",
        "date": "02122016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 1-China's Baidu gets offer for its 80.5 pct stake in Qiyi "
    },
    {
        "content": "Feb 12 Chinese Internet search company Baidu Inc  said its chief executive and online video company Qiyi.com Inc's CEO had offered to buy Baidu's 80.5 percent stake in Qiyi.",
        "date": "02122016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China's Baidu gets offer for its 80.5 pct stake in Qiyi "
    },
    {
        "content": "MUMBAI  Feb 8 Indian restaurant search and food delivery service Zomato  one of only a handful of Indian start-ups to succeed abroad  said on Monday it had broken even in key markets including India and is on track to make a profit as early as June next year.",
        "date": "02082016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "India's Zomato breaks even at home  in key markets abroad "
    },
    {
        "content": "* Well-funded rivals pose competitive threat   (Adds investors  context)",
        "date": "01202016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 2-China's Meituan-Dianping raises over $3.3 bln  values firm at $18 bln "
    },
    {
        "content": "BEIJING Baidu Inc is in talks to invest in Indian ecommerce start-ups including Zomato  BookMyShow and BigBasket  a spokesman for China's top online search provider said on Wednesday.",
        "date": "01132016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China's Baidu eyes Indian ecommerce start-ups "
    },
    {
        "content": "BEIJING  Jan 13 Baidu Inc is in talks to invest in Indian ecommerce start-ups including Zomato  BookMyShow and BigBasket  a spokesman for China's top online search provider said on Wednesday.",
        "date": "01132016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 1-China's Baidu eyes Indian ecommerce start-ups "
    },
    {
        "content": "BEIJING  Jan 13 Baidu Inc is in talks to invest in Indian e-commerce start-ups including Zomato  BookMyShow and BigBasket  a spokesman for China's top online search provider said on Wednesday.",
        "date": "01132016",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China's Baidu says in talks to invest in Indian e-commerce start-ups "
    },
    {
        "content": "SHANGHAI  Dec 25 Alibaba Group Holding Ltd  has agreed to invest $1.25 billion in Chinese online food delivery service Ele.me  leading business weekly Caixin reported on Friday.",
        "date": "12252015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 2-Alibaba agrees to invest $1.25 bln in Chinese online food delivery service - report "
    },
    {
        "content": "BEIJING China's top online search firm Baidu Inc said it aims to put self-driving buses on the road in three years and mass produce them within five years  after it set up a business unit to oversee all its efforts related to automobiles.",
        "date": "12142015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China's Baidu says to develop self-driving buses within three years "
    },
    {
        "content": "BEIJING  Dec 14 China's top online search firm Baidu Inc said it aims to put self-driving buses on the road in three years and mass produce them within five years  after it set up a business unit to oversee all its efforts related to automobiles.",
        "date": "12142015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China's Baidu says to develop self-driving buses within 3 years "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG/SEOUL/SYDNEY  December 01 (Fitch) Fitch Ratings has affirmed  China-based Baidu  Inc.'s (Baidu) Long-Term Foreign- and Local-Currency Issuer  Default Ratings (IDRs) of 'A' and foreign-currency senior unsecured rating of  'A'. The Outlook is Stable. KEY RATING DRIVERS Leading Market Position: The ratings reflect Baidu's dominant internet search  engine market position in China. Baidu remains the default choice for  advertisers ",
        "date": "12012015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Fitch Affirms Baidu at 'A' with Stable Outlook "
    },
    {
        "content": "* CEO says Baidu deal will restart Allianz's ambitions in Asia",
        "date": "11242015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Deal with China's Baidu sign of Allianz's Asia ambition -Allianz CEO "
    },
    {
        "content": "BEIJING  Nov 18 China CITIC Bank Corp Ltd   and Baidu Inc on Wednesday said they plan to set up a direct bank to capitalize on China's booming online finance market  in the country's first tie-up between an Internet firm and a lender.",
        "date": "11182015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China CITIC  Baidu to launch direct bank in online finance push "
    },
    {
        "content": "* Says plans to set up internet banking joint venture with Baidu Inc",
        "date": "11172015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-China Citic Bank  Baidu to set up internet banking jv "
    },
    {
        "content": "BEIJING  Nov 17 Chinese Internet search giant Baidu Inc and China CITIC Bank Corp   will set up an Internet banking joint venture  the 21st Century Business Herald reported on Tuesday  following in the footsteps of other domestic tech firms.",
        "date": "11172015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China's Baidu  CITIC to set up Internet bank -21st Century Business Herald "
    },
    {
        "content": "NEW YORK  Nov 12 Index provider MSCI will add 14 U.S.-listed Chinese shares to its emerging markets index for the first time on Dec. 1  including Chinese Internet companies Alibaba and Baidu Inc  two of the largest U.S.-traded Chinese equities.",
        "date": "11122015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "MSCI to include Alibaba  Baidu  12 other China ADRs in EM index "
    },
    {
        "content": "Baidu Inc  China's biggest Internet search company  reported a 36 percent rise in quarterly revenue as more advertising money flowed into the company's core search engine business.",
        "date": "10292015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China search engine Baidu's revenue jumps 36 percent on advertising "
    },
    {
        "content": "Oct 29 Baidu Inc  China's biggest Internet search company  reported a 36 percent rise in quarterly revenue as more advertising money flowed into the company's core search engine business.",
        "date": "10292015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 1-China search engine Baidu's revenue jumps 36 pct on advertising "
    },
    {
        "content": "Oct 29 Baidu Inc  China's biggest Internet search company  reported a 36 percent rise in quarterly revenue as more advertising money flowed into the company's core search engine business.",
        "date": "10292015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu's revenue rises 36 pct "
    },
    {
        "content": "* E-commerce platform Womai.com raises $220 million from Taikang Life  Baidu and other investors - financial advisor China Renaissance    (Reporting By Adam Jourdan)",
        "date": "10212015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-COFCO e-commerce platform raises $220 million from Taikang Life  Baidu "
    },
    {
        "content": "Oct 9 Film and TV studio owner Lions Gate Entertainment Corp said on Friday that Chinese video streaming company iQIYI  a unit of internet search company Baidu Inc  would stream some of its films.",
        "date": "10092015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu's iQIYI video unit to stream Lions Gate films "
    },
    {
        "content": "SHANGHAI  Oct 9 As China's economy stutters  growing numbers of diners on a budget are tapping into smartphone applications to snap up meal delivery deals  spelling big trouble for fast food chains like Yum Brands Inc's  KFC and Pizza Hut.",
        "date": "10092015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Hungry? China's food delivery apps bite into Yum revival "
    },
    {
        "content": "BEIJING U.S. ride-hailing service Uber Technologies Inc [UBER.UL] will enter 100 more Chinese cities over the next year  doubling a previous goal set just three months ago  Chief Executive Travis Kalanick said on Tuesday.",
        "date": "09082015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Uber to enter 100 more Chinese cities in next 12 months: CEO "
    },
    {
        "content": "* Says signs strategic agreement with Baidu on Internet finance",
        "date": "08312015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Sinolink Securities  Baidu in strategic agreement on Internet finance "
    },
    {
        "content": "BEIJING  July 31 China proposed new regulations on Friday that could force Internet companies such as Alibaba Group Holding Ltd  Tencent Holdings Ltd and Baidu Inc to offer their rivals' online payment services as well as their own.",
        "date": "07312015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China mulls forcing Tencent  Alibaba to offer rivals' online payment services "
    },
    {
        "content": "HONG KONG  July 29 (IFR) - Chinese tech giants continued to underperform after a sell-off in onshore equities and Baidu's disappointing results dampened sentiment.",
        "date": "07292015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "ASIA CREDIT CLOSE: Chinese tech credits take hit from equity sell-off "
    },
    {
        "content": "BEIJING Baidu Inc  China's biggest internet search engine company  said on Thursday it will buy back shares worth $1 billion after the company's stock price slid following a weak earnings report earlier this week.",
        "date": "07302015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China's Baidu to buy back $1 billion shares after investor selldown "
    },
    {
        "content": "* Indexes up: Dow 0.77 pct  S&P 0.91 pct  Nasdaq 0.66 pct   (Updates to early afternoon)",
        "date": "07282015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "US STOCKS-Wall Street rises after China market steadies "
    },
    {
        "content": "BEIJING  July 30 Baidu Inc  China's biggest internet search engine company  said on Thursday it will buy back shares worth $1 billion after the company's stock price slid following a weak earnings report earlier this week.",
        "date": "07302015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 1-China's Baidu to buy back $1 bln shares after investor selldown "
    },
    {
        "content": "* Indexes up: Dow 0.49 pct  S&P 0.58 pct  Nasdaq 0.22 pct   (Adds details  changes comment  updates prices)",
        "date": "07282015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "US STOCKS-Wall Street bounces back after five-day selloff "
    },
    {
        "content": "BEIJING  July 30 Baidu Inc  China's biggest search engine company  said on Thursday it will repurchase $1 billion of its shares  after the company's stock price was hammered by investors following weak earnings results on Monday.",
        "date": "07302015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China's Baidu to repurchase $1 bln shares after investor selldown "
    },
    {
        "content": "Baidu Inc's  quarterly profit missed analysts' estimates as China's biggest Internet search company spent heavily to diversify away from its core search advertising business  which is becoming less profitable and more competitive.",
        "date": "07272015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Baidu profit weighed down by offline mobile services push "
    },
    {
        "content": "* Dow up 0.21 pct  S&P up 0.25 pct  Nasdaq down 0.13 pct   (Updates to open)",
        "date": "07282015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "US STOCKS-Dow  S&P rise after five-day selloff; Fed meeting eyed "
    },
    {
        "content": "July 27Baidu Inc's quarterly profit missed analysts' estimates as China's biggest Internet search company spent heavily to diversify away from its core search advertising business  which is becoming less profitable and more competitive.",
        "date": "07272015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 1-Baidu profit weighed down by offline mobile services push "
    },
    {
        "content": "July 27Baidu Inc  China's biggest Internet search company  forecast current quarter revenue that missed analysts' average estimate  sending its shares down more than 5 percent in extended trading.",
        "date": "07272015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu's revenue forecast misses estimates  shares fall "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG/SYDNEY/SINGAPORE  July 02 (Fitch) Fitch Ratings has assigned Baidu  Inc.'s (Baidu; A/Stable) USD750m 3.000% senior unsecured notes due 2020 and  USD500m 4.125% senior unsecured notes due 2025 final ratings of 'A'. The assignment of the final ratings follows the receipt of documents conforming  to information already received. The final ratings are in line with the expected  rating assigned on 23 June 2015. The notes are rated ",
        "date": "07032015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Fitch Rates Baidu's Notes Final 'A' "
    },
    {
        "content": "BEIJING China's dominant Internet search engine Baidu Inc said on Tuesday it would invest 20 billion yuan ($3.22 billion) over the next three years on online-to-offline services  including group-buying service Nuomi.",
        "date": "06302015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Baidu to invest $3.2 billion in online-to-offline services "
    },
    {
        "content": "* Baidu seen lagging larger rivals Alibaba  Tencent   (Adds company comment  details  context)",
        "date": "06302015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 1-Baidu to invest $3.2 bln in online-to-offline services within 3 yrs "
    },
    {
        "content": "BEIJING  June 30 China's search leader Baidu Inc  said on Tuesday it would invest 20 billion yuan ($3.22 billion) over the next three years on online-to-offline services  including group-buying service Nuomi.  ($1 = 6.2023 Chinese yuan renminbi)   (Reporting by Paul Carsten; Editing by Miral Fahmy)",
        "date": "06302015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu to invest $3.2 bln in online-to-offline services within 3 yrs "
    },
    {
        "content": "HONG KONG  June 23 (IFR) - Chinese tech giant Baidu  is marketing SEC-registered US dollar bonds of five and 10 years at respective yields of around 160bp and 200bp over US Treasuries.",
        "date": "06232015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "UPDATE 1-China's Baidu opens books for dual-tranche dollar bonds "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG/SEOUL/SYDNEY  June 22 (Fitch) Fitch Ratings has assigned Baidu  Inc.'s  (Baidu; A/Stable) proposed US dollar senior unsecured notes an expected rating  of 'A(EXP)'. The final rating on the notes is contingent upon the receipt of  final documents conforming to information already received. The notes are rated in line with Baidu's senior unsecured rating of 'A' as they  will rank pari passu with the issuer's existing and future ",
        "date": "06232015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Fitch Rates Baidu's Proposed Notes 'A(EXP)' "
    },
    {
        "content": "HONG KONG  June 23 (IFR) - Chinese tech giant Baidu  has mandated Goldman Sachs and JP Morgan for an offering of SEC-registered US dollar bonds.",
        "date": "06232015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu names Goldman  JP Morgan for proposed dollar bond issue "
    },
    {
        "content": "FRANKFURT  June 17 Germany's premium auto makers BMW Daimler and Audi are preparing an offer for Nokia's maps business  as binding bids are due by end of Thursday  two sources familiar with the process told Reuters.",
        "date": "06172015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "UPDATE 1-German auto makers ready offer for HERE as deadline looms-sources "
    },
    {
        "content": "June 1 Private equity firm Silver Lake Partners LP said on Monday it would lead a $500 million investment in Qunar Cayman Islands Ltd  the Chinese travel website controlled by the country's internet search engine company Baidu Inc.",
        "date": "06012015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Silver Lake leads $500 mln investment in travel site Qunar "
    },
    {
        "content": "* Says signs strategic agreement with Baidu Inc on online medical services",
        "date": "05272015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Longmaster Infotech in strategic agreement with Baidu on online medical services "
    },
    {
        "content": "FRANKFURT German carmaker Daimler is to make software from web services company Baidu available in its Chinese Mercedes-Benz cars as part of a trend of deepening ties between carmakers and consumer technology companies.",
        "date": "05252015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Daimler teams up with China's Baidu in connected cars drive "
    },
    {
        "content": "NECKARSULM  Germany The contest for Nokia's  maps business has become a three-way race between German carmakers  a consortium including Uber and Baidu  and a third group including China's Tencent and Navinfo  people familiar with the process said.",
        "date": "05222015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Contest for Nokia's HERE seen as a three-way race "
    },
    {
        "content": "* U.S. and Chinese companies also in race - sources   (Recasts  includes more details about potential bidders)",
        "date": "05222015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 1-Contest for Nokia's HERE seen as a three-way race "
    },
    {
        "content": "NECKARSULM  Germany Germany's Audi  will enhance connected-car services in China to meet growing demand for driver-assistance systems and driverless technology in the world's largest auto market.",
        "date": "05222015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Audi will enhance Chinese connected-car services with Baidu "
    },
    {
        "content": "* Plans to launch new Q8 SUV in 2019   (Adds CEO comment  detail on China  sales and models)",
        "date": "05222015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 1-Audi will enhance Chinese connected-car services with Baidu "
    },
    {
        "content": "NECKARSULM  Germany  May 22 Audi  said on Friday its planned cooperation with China's web services provider Baidu aims to enhance connected-car offerings in the world's largest auto market.",
        "date": "05222015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Audi says to enhance Chinese connected-car offerings with Baidu "
    },
    {
        "content": "BEIJING  May 12 China's dominant Internet search engine Baidu Inc has fired eight executives accused of criminal behaviour  according to an internal memo seen by Reuters on Tuesday  as the company strives to keep its reputation clean.",
        "date": "05122015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China's Baidu sacks eight in criminal investigation "
    },
    {
        "content": "BEIJING China's dominant Internet search engine Baidu Inc on Thursday posted its slowest revenue growth rate in almost seven years in the first quarter of 2015  as customers spent less money on its core online marketing business.",
        "date": "04302015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China search giant Baidu posts slowest revenue growth since 2008 "
    },
    {
        "content": "BEIJING  April 30 China's dominant Internet search engine Baidu Inc on Thursday posted its slowest revenue growth rate in almost seven years in the first quarter of 2015  as customers spent less money on its core online marketing business.",
        "date": "04302015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "CORRECTED-China search giant Baidu posts slowest revenue growth since 2008 "
    },
    {
        "content": "TEL AVIV  April 14 Music education technology company Tonara said on Tuesday it raised $5 million in a funding round led by China's dominant search engine Baidu and Israel's Carmel Ventures.",
        "date": "04142015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu invests in Israeli music technology start-up Tonara "
    },
    {
        "content": "NEW YORK  March 30 U.S. coding site GitHub said it was deflecting most of the traffic from a days-long cyberattack that had caused intermittent outages for the social coding site  with the Wall Street Journal citing China as the source of the attack.",
        "date": "03302015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "UPDATE 3-U.S. coding site GitHub disrupted by cyberattack "
    },
    {
        "content": "* Hon Hai shifting from low-margin manufacturing   (Adds context)",
        "date": "03232015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "UPDATE 1-Hon Hai  Tencent partner in electric car business "
    },
    {
        "content": "March 18 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Wednesday:",
        "date": "03182015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "HONG KONG Private equity firm KKR & Co LP  search engine Baidu Inc and hedge fund Coatue said on Wednesday they will jointly invest $170 million in Chinese online used-car auction firm Uxin  aiming for a piece of the booming used-car market.",
        "date": "03182015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "KKR  Baidu  Coatue to invest $170 million in China online used-car platform "
    },
    {
        "content": "HONG KONG  March 18 Private equity firm KKR & Co LP  search engine Baidu Inc and hedge fund Coatue said on Wednesday they will jointly invest $170 million in Chinese online used-car auction firm Uxin  aiming for a piece of the booming used-car market.",
        "date": "03182015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "KKR  Baidu  Coatue to invest $170 mln in China online used-car platform "
    },
    {
        "content": "BEIJING/BENGALURU Baidu Inc's shift to smartphones has come at a cost: the Chinese internet firm forecast lower-than-expected revenue growth for the first quarter as its share from less profitable mobile browsing grows at the expense of PC searches.",
        "date": "02122015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "China's Baidu pays price of mobile shift  fourth-quarter revenue disappoints "
    },
    {
        "content": "* Q4 mobile revenue was 42 pct of total revenue  from 36 pct in Q3",
        "date": "02122015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 2-China's Baidu pays price of mobile shift  Q4 revenue disappoints "
    },
    {
        "content": "BEIJING  Feb 12 Baidu Inc  owner of China's dominant search engine  said revenue growth for its online video service iQiyi more than doubled in the fourth quarter and for the whole of 2014.",
        "date": "02122015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "Baidu online video service more than doubled revenue growth in Q4  FY 2014 "
    },
    {
        "content": "Baidu Inc   owner of China's dominant search engine   reported a lower-than-expected 47.5 percent rise in quarterly revenue as more users switched from PCs to mobile devices  which have less space for more lucrative forms of advertising.",
        "date": "02112015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Baidu revenue falls short of estimates as customers go mobile "
    },
    {
        "content": "BEIJING  Feb 10 Chinese search engine company Baidu Inc is tapping renewed interest in equities trading by launching a stocks app using artificial intelligence to predict how stocks  sectors and markets may perform.",
        "date": "02102015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "With China markets high  Baidu launches stock analysis finance app "
    },
    {
        "content": "Feb 11 Baidu Inc  owner of China's dominant search engine   reported a lower-than-expected 47.5 percent rise in quarterly revenue as more users switched from PCs to mobile devices  which have less space for more lucrative forms of advertising.",
        "date": "02112015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "UPDATE 1-Baidu revenue falls short of estimates as customers go mobile "
    },
    {
        "content": "Feb 11 Baidu Inc  owner of China's dominant search engine  reported a 47.5 percent rise quarterly revenue  helped by growth in mobile traffic.",
        "date": "02112015",
        "name": "Baidu Inc",
        "news_type": "normal",
        "symbol": "BIDU",
        "title": "China's Baidu posts jump in revenue as mobile traffic grows "
    },
    {
        "content": "* Says signs cooperation agreement with Baidu on business development",
        "date": "01292015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "BRIEF-Yongyou Network Technology  Baidu sign agreement on business development "
    },
    {
        "content": "MUNICH/FRANKFURT The chief executive of controversial online ride-sharing company Uber stuck a newly conciliatory tone on Sunday  promising to create 50 000 new jobs this year across Europe in cities that are willing to reach deals to help his firm operate.",
        "date": "01182015",
        "name": "Baidu Inc",
        "news_type": "topStory",
        "symbol": "BIDU",
        "title": "Chastened Uber CEO seeks fresh start for ride services in Europe "
    }
]