[
    {
        "content": "* Acorda announces royalty monetization transactions for $53 million",
        "date": "11172017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Acorda announces royalty monetization transactions for $53 mln "
    },
    {
        "content": "* Biogen presents new data from long-term extension of phase 1b study of investigational alzheimer’s disease treatment aducanumab",
        "date": "11022017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen presents new data from long-term extension of phase 1B study "
    },
    {
        "content": "Biogen Inc's  shares dived 8 percent on Tuesday after U.S. sales of Spinraza  a potential blockbuster drug it is banking on to offset slowing sales of multiple sclerosis drugs  fell short of Wall Street estimates in the latest quarter.",
        "date": "10242017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen dives as Spinraza U.S. sales miss estimates "
    },
    {
        "content": "* Indexes up: Dow 0.7 pct  S&P 0.2 pct  Nasdaq 0.2 pct (Updates to close)",
        "date": "10242017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "US STOCKS-Dow jumps with upbeat 3M  Caterpillar earnings "
    },
    {
        "content": "* Indexes up: Dow 0.9 pct  S&P 0.3 pct  Nasdaq 0.4 pct (Updates to late afternoon)",
        "date": "10242017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "US STOCKS-Wall St gains on 3M  Caterpillar earnings; Dow jumps "
    },
    {
        "content": "* Shares fall as much as 8.14 pct in early trading (Adds details of payment to Neurimmune related to Aducanumab  updates shares)",
        "date": "10242017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 4-Biogen dives as Spinraza U.S. sales miss estimates "
    },
    {
        "content": "* Biogen Inc - ‍company restructures collaboration arrangements with eisai and neurimmune to improve long-term value of aducanumab​",
        "date": "10242017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen Q3 earnings per share $5.79 "
    },
    {
        "content": "Oct 24 U.S. drugmaker Biogen Inc on Tuesday reported an 18.7 percent rise in quarterly profit  driven by strong demand for its recently approved spinal muscular atrophy drug  Spinraza.",
        "date": "10242017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen posts 18.7 pct jump in quarterly profit "
    },
    {
        "content": "* Biogen increases profit potential on investigational Alzheimer’S disease treatment Aducanumab through amended agreement with Neurimmune Holding AG",
        "date": "10242017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen increases profit potential on investigational Alzheimer’S disease treatment "
    },
    {
        "content": "Biogen Inc on Monday urged a federal judge to dismiss a securities fraud lawsuit claiming executives misled shareholders about the safety profile and financial performance of its multiple sclerosis drug Tecfidera.",
        "date": "10232017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen seeks dismissal of shareholder lawsuit over MS drug sales "
    },
    {
        "content": "* Biogen and Eisai expand existing collaboration agreement to develop and commercialize investigational Alzheimer's disease treatments including phase 3 aducanumab",
        "date": "10232017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen and Eisai expand existing collaboration agreement to develop and commercialize investigational Alzheimer's disease treatments including phase 3 aducanumab "
    },
    {
        "content": "* Presented new data showing earlier initiation of treatment with Spinraza may improve motor function outcomes in infants with spinal muscular atrophy",
        "date": "10052017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen updates on new data on treatment with Spinraza "
    },
    {
        "content": "* Biogen appoints Sanjay Jariwala as SVP  worldwide medical Source text for Eikon: Further company coverage:",
        "date": "09122017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen appoints Sanjay Jariwala as SVP "
    },
    {
        "content": "* Ionis earns $40 million Spinraza regulatory milestone payment from Biogen",
        "date": "08302017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Ionis earns $40 million Spinraza regulatory milestone payment from Biogen "
    },
    {
        "content": "A biosimilar version of AbbVie Inc's blockbuster arthritis drug Humira  produced by a joint venture of Biogen Inc and Samsung Biologics  was approved by European Union regulators  the partners said on Thursday.",
        "date": "08252017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Samsung  Biogen version of AbbVie's Humira approved in Europe "
    },
    {
        "content": "Aug 24 A biosimilar version of AbbVie Inc's blockbuster arthritis drug Humira  produced by a joint venture of Biogen Inc and Samsung Biologics   was approved by European Union regulators  the partners said on Thursday.",
        "date": "08252017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 1-Samsung  Biogen version of AbbVie's Humira approved in Europe "
    },
    {
        "content": "* Imraldi(®)  Biogen's Adalimumab Biosimilar referencing Humira(®)  is approved in European Union",
        "date": "08242017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Imraldi  Biogen's Adalimumab Biosimilar referencing Humira  is approved in EU "
    },
    {
        "content": "* Ups share stake in T-Mobile US Inc by 46.1 percent to 6.1 million shares - SEC filing",
        "date": "08142017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Paulson & Co takes share stake in Apple  dissolves share stake in Sarepta  Biogen "
    },
    {
        "content": "* Temasek Holdings (Private) Ltd takes share stake in JPMorgan Chase & Co of 264 337 shares",
        "date": "08142017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Temasek Holdings takes stake in JPMorgan  Biogen  Celgene "
    },
    {
        "content": "* Biogen appoints Anabella Villalobos senior vice president  Biotherapeutic & Medicinal Sciences Source text for Eikon: Further company coverage:",
        "date": "07312017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen appoints Anabella Villalobos senior vice president  Biotherapeutic & Medicinal Sciences "
    },
    {
        "content": "* Signed value-based reimbursement contract with Biogen for select products in Biogen's leading multiple sclerosis portfolio​ Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "07272017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Abarca Health signs reimbursement contract with Biogen for select products "
    },
    {
        "content": "* Biogen says in July 2017 learned that prosecution office of Milan is investigating interactions with some healthcare providers in Italy - SEC Filing",
        "date": "07252017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen says in July 2017 learned that prosecution office of Milan is investigating interactions with some healthcare providers in Italy - SEC Filing "
    },
    {
        "content": "Biogen Inc laid out long-term plans to strengthen its mainstay multiple sclerosis (MS) business  develop more neuroscience drugs and shop for late-stage assets  after reporting robust second-quarter results on Tuesday.",
        "date": "07252017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "After strong quarter  Biogen rolls out growth strategy "
    },
    {
        "content": "* Spinraza sales of $203 mln smash analyst estimates of $70 mln",
        "date": "07252017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 3-After strong quarter  Biogen rolls out growth strategy "
    },
    {
        "content": "* Biogen CEO: \"overall  we maintain our global market share in multiple sclerosis (treatments)\"",
        "date": "07252017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen CEO: \"we will explore deals of all sizes\" "
    },
    {
        "content": "* Futures up: Dow 96 pts  S&P 6.5 pts  Nasdaq 5 pts (Adds details  comment  updates prices)",
        "date": "07252017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "US STOCKS-Caterpillar  McDonald's to lift S&P  Dow at open "
    },
    {
        "content": "* Biogen reports record quarterly revenues of $3.1 billion  raises full year revenue guidance",
        "date": "07252017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen reports Q2 EPS $4.07 "
    },
    {
        "content": "* Forward Pharma announces planned distribution of EUR 19.45 per share to shareholders",
        "date": "07182017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Forward Pharma announces planned distribution of EUR 19.45 per share to shareholders "
    },
    {
        "content": "July 25 U.S. drugmaker Biogen Inc reported a 6.4 percent rise in quarterly revenue  driven by strong demand for its recently approved spinal muscular atrophy drug  Spinraza.",
        "date": "07252017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen revenue rises 6.4 pct on Spinraza demand "
    },
    {
        "content": "* Biogen to present data at Alzheimer's Association International Conference 2017 (AAIC) Source text for Eikon: Further company coverage:",
        "date": "07142017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen to present data at Alzheimer's Association International Conference "
    },
    {
        "content": "* Biogen appoints Amy Chevalier Efantis vice president of government affairs",
        "date": "07102017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen appoints Amy Chevalier Efantis vice president of government affairs "
    },
    {
        "content": "Biogen Inc on Wednesday sued 13 drugmakers for patent infringement in a bid to block generic versions of its blockbuster multiple sclerosis drug Tecfidera.",
        "date": "06302017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen sues to block generic versions of blockbuster MS drug "
    },
    {
        "content": "* Biogen’s Imraldi  an adalimumab biosimilar candidate referencing Humira  granted positive opinion by committee for medicinal products for human use",
        "date": "06232017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen’s Imraldi granted positive opinion by committee for medicinal products for human use "
    },
    {
        "content": "* Biogen appoints Ginger Gregory executive vice president  chief human resources officer",
        "date": "06202017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen appoints Ginger Gregory as chief human resources officer "
    },
    {
        "content": "Alexion Pharmaceuticals Inc named long-time Biogen Inc Chief Financial Officer Paul Clancy to a similar position  effective July 31  as recently appointed CEO Ludwig Hantson steps up efforts to regain investor confidence.",
        "date": "06132017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Alexion taps Biogen veteran Paul Clancy as CFO "
    },
    {
        "content": "June 13 Alexion Pharmaceuticals Inc named long-time Biogen Inc Chief Financial Officer Paul Clancy to a similar position  effective July 31  as recently appointed CEO Ludwig Hantson steps up efforts to regain investor confidence.",
        "date": "06132017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 1-Alexion taps Biogen veteran Paul Clancy as CFO "
    },
    {
        "content": "June 13 Alexion Pharmaceuticals Inc on Tuesday named Biogen Inc's Chief Financial Officer Paul Clancy as its finance head  effective July 31.",
        "date": "06132017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "REFILE-Alexion names Biogen's Paul Clancy as CFO "
    },
    {
        "content": "* Alexion Pharmaceuticals Inc - Clancy will succeed Dave Anderson  who will continue to serve as CFO until july 31  2017",
        "date": "06132017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Alexion Pharmaceuticals names Paul Clancy as CFO "
    },
    {
        "content": "June 1 Biogen Inc on Thursday said its drug  Spinraza  had secured European Union approval to treat spinal muscular atrophy (SMA)  a leading genetic cause of death in infants.",
        "date": "06012017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "EU approves Biogen's Spinraza for lead genetic cause of infant death "
    },
    {
        "content": "* Spinraza (nusinersen) approved in the European Union as first treatment for spinal muscular atrophy",
        "date": "06012017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen says Spinraza approved in EU as first treatment for SMA "
    },
    {
        "content": "May 22 Celgene Corp said its oral drug to treat relapsing multiple sclerosis met the main goal of reducing annualized relapse rate  when compared to Biogen Inc's Avonex  in a second late-stage study.",
        "date": "05222017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Celgene's multiple sclerosis drug succeeds in late-stage trial "
    },
    {
        "content": "* Biogen acquires Remedy Pharmaceuticals' late-stage drug cirara",
        "date": "05182017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen acquires Remedy Pharmaceuticals' late-stage drug cirara "
    },
    {
        "content": "* Paulson & Co Inc takes share stake of 3.5 million shares in Dish Network Corp",
        "date": "05152017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Paulson & Co Inc takes share stake in Dish Network  Monsanto "
    },
    {
        "content": "Biogen Inc has won the dismissal of a proposed shareholder class action claiming executives misled investors about the effect on sales of the death of a patient who had taken the company's new multiple sclerosis drug Tecfidera.",
        "date": "05152017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen beats securities fraud lawsuit over multiple sclerosis drug sales "
    },
    {
        "content": "* Biogen Inc former CEO George Scangos's 2016 total compensation $17.7 million versus $16.9 million in 2015 - sec filing Source text - http://bit.ly/2oKp4LQ Further company coverage:",
        "date": "04262017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen former CEO Scangos's 2016 compensation was $17.7 mln "
    },
    {
        "content": "Biogen Inc's quarterly profit blew past analysts' estimates  helped by higher-than-expected sales of its recently launched spinal muscular atrophy drug  Spinraza.",
        "date": "04252017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen profit beats on surprisingly strong Spinraza sales "
    },
    {
        "content": "* Shares rise 5.4 pct (Adds conference call details  analyst comments; updates shares)",
        "date": "04252017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 3-Biogen profit beats on surprisingly strong Spinraza sales "
    },
    {
        "content": "* EU Medicines Agency recommends approval granting of a marketing authorisation for Sandoz's Rixathon Non-Hodgkin's Lymphoma (NHL)  chronic lymphocytic leukaemia",
        "date": "04212017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-EU Medicines Agency recommendations for April 2017 "
    },
    {
        "content": "* Biogen says \"we are working to add more assetts to our pipeline\": Conf Call",
        "date": "04252017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen CFO says expects Spinraza adoption to ramp up going forward: Conf Call "
    },
    {
        "content": "April 25 Biogen Inc reported a 3 percent rise in quarterly revenue  helped by higher-than-expected sales of its newly launched spinal muscular atrophy drug  Spinraza.",
        "date": "04252017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Drugmaker Biogen's revenue rises 3 percent "
    },
    {
        "content": "Bristol-Myers Squibb Co said on Thursday it would license two of its drugs to Biogen Inc and Roche Holding AG for an upfront fee of $470 million.",
        "date": "04132017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Bristol-Myers to license two drugs to Biogen  Roche "
    },
    {
        "content": "* Deals come amid activist investor pressure (Adds background on activist investor pressure)",
        "date": "04132017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 2-Bristol-Myers to license two drugs to Biogen  Roche "
    },
    {
        "content": "* Biogen Inc -  under agreement  biogen will receive worldwide rights to BMS-986168",
        "date": "04132017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen licenses Phase 2 Anti-Tau antibody from Bristol-Myers Squibb "
    },
    {
        "content": "April 13 Bristol-Myers Squibb Co said on Thursday it entered into a deal with Biogen Inc and Roche Holding AG to license two of its drugs for an upfront fee of $470 million.",
        "date": "04132017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Bristol-Myers to license two of its drugs to Biogen  Roche "
    },
    {
        "content": "* Bristol-Myers Squibb enters into separate agreements with Biogen and Roche to license anti-etau and anti-myostatin compounds  respectively",
        "date": "04132017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Bristol-Myers Squibb enters into separate agreements with Biogen and Roche "
    },
    {
        "content": "* Forward Pharma intends to appeal decision in patent interference proceeding with Biogen Inc. Source text for Eikon: Further company coverage:",
        "date": "04012017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Forward Pharma intends to appeal decision in patent interference proceeding with Biogen "
    },
    {
        "content": "March 31 A U.S. patent board on Friday ruled against Danish drugmaker Forward Pharma A/S  finding Biogen's patents on its blockbuster multiple sclerosis drug Tecfidera to be valid.",
        "date": "03312017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen wins Tecfidera U.S. patent dispute with Forward Pharma "
    },
    {
        "content": "NEW YORK Biogen Inc on Tuesday won an intellectual property rights ruling against hedge fund manager Kyle Bass over its top multiple sclerosis pill  Tecfidera  pushing shares up more than 1 percent on a day when most U.S. stocks were down.",
        "date": "03222017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen wins ruling in Tecfidera IP case; shares rise "
    },
    {
        "content": "NEW YORK  March 21 Biogen Inc on Tuesday won an intellectual property rights ruling against hedge fund manager Kyle Bass over its top multiple sclerosis pill  Tecfidera  pushing shares up more than 1 percent on a day when most U.S. stocks were down.",
        "date": "03212017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen wins ruling in Tecfidera IP case; shares rise "
    },
    {
        "content": "TEL AVIV  March 6 Israel's BrainStorm Cell Therapeutics  which is developing an adult stem cell treatment for patients with amyotrophic lateral sclerosis (ALS)  on Monday named Ralph Kern as chief operating officer.",
        "date": "03062017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Israel's BrainStorm names Biogen senior executive Kern as COO "
    },
    {
        "content": "* Forward Pharma received US$ 1.25 bln pursuant to settlement and license agreement with Biogen",
        "date": "02092017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Forward Pharma receives $1.25 bln pursuant to settlement and license agreement with Biogen "
    },
    {
        "content": "* Approved entry into settlement  license agreement with 2 wholly owned subsidiaries of Biogen Inc and certain other parties",
        "date": "02012017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Forward Pharma enters license agreement with 2 units of Biogen and other parties "
    },
    {
        "content": "* Biogen completes separation of global hemophilia business  bioverativ  Source text for Eikon:  Further company coverage:",
        "date": "02012017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen completes separation of global hemophilia business  Bioverativ "
    },
    {
        "content": "Biogen Inc  said on Thursday that the first U.S. patients have received its new drug for the leading genetic cause of death in infants and that it anticipates mid-year approval of Spinraza in the European Union.",
        "date": "01262017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen sees gradual Spinraza launch  eyes mid-year EU approval "
    },
    {
        "content": "Jan 26 Biogen Inc said on Thursday that the first U.S. patients have received its new drug for the leading genetic cause of death in infants and that it anticipates mid-year approval of Spinraza in the European Union.",
        "date": "01262017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 3-Biogen sees gradual Spinraza launch  eyes mid-year EU approval "
    },
    {
        "content": "Jan 25 The prescribing label for Biogen Inc's  big-selling oral multiple sclerosis drug Tecfidera has been updated to include a  warning of potential liver injury that could require hospitalization  the company said on Wednesday.",
        "date": "01252017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Possible liver injury added to label of Biogen MS drug "
    },
    {
        "content": "* Biogen CEO says enrolling of patients for phase III aducanumab Alzheimer's trial ahead of company expectations",
        "date": "01262017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen Phase III Alzheimer's trial enrollment ahead of expectations "
    },
    {
        "content": "Jan 26 Biogen Inc reported a near 22 percent fall in fourth-quarter income  hurt by higher costs related to its top-selling multiple sclerosis drug  Tecfidera.",
        "date": "01262017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen profit drops 22 pct due to Tecfidera-related costs "
    },
    {
        "content": "* Ewopharma partners with biogen to commercialise benepali\u007f and flixabi\u007f in central eastern europe",
        "date": "01232017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Ewopharma partners with Biogen to commercialise Benepali and Flixabi "
    },
    {
        "content": "Biogen Inc said on Tuesday it would pay Forward Pharma A/S  $1.25 billion to license the Danish company's patents covering multiple sclerosis drugs  providing Biogen an insurance policy on future sales of Tecfidera  its blockbuster oral treatment for the disease.",
        "date": "01172017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen to pay Forward Pharma $1.25 bln to protect MS drug "
    },
    {
        "content": "Biogen Inc said on Tuesday it would pay Forward Pharma A/S  $1.25 billion to license the Danish company's patents covering multiple sclerosis drugs  providing Biogen an insurance policy on future sales of Tecfidera  its blockbuster oral treatment for the disease.",
        "date": "01172017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen to pay Forward Pharma $1.25 billion to protect MS drug "
    },
    {
        "content": "Jan 17 Biogen Inc said on Tuesday it would pay Forward Pharma A/S  $1.25 billion to license the Danish company's patents covering multiple sclerosis drugs  providing Biogen an insurance policy on future sales of Tecfidera  its blockbuster oral treatment for the disease.",
        "date": "01172017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 2-Biogen to pay Forward Pharma $1.25 bln to protect MS drug "
    },
    {
        "content": "* FORWARD PHARMA AGREES TO ENTER INTO SETTLEMENT AND LICENSE AGREEMENT WITH BIOGEN",
        "date": "01172017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-FORWARD PHARMA AGREES TO ENTER INTO SETTLEMENT AND LICENSE AGREEMENT WITH BIOGEN "
    },
    {
        "content": "Jan 17 Biogen Inc said on Tuesday it would pay Forward Pharma A/S $1.25 billion in cash to gain access to the Danish company's intellectual property as it seeks to protect the patent life of its flagship multiple sclerosis drug  Tecfidera.",
        "date": "01172017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen in $1.25 bln deal with Forward Pharma to protect MS drug "
    },
    {
        "content": "* Biogen and Forward Pharma agree to enter into settlement and license agreement",
        "date": "01172017",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen  Forward Pharma to enter into settlement and license agreement "
    },
    {
        "content": "* Biogen spin-off Bioverativ commences when-issued trading of common stock",
        "date": "01122017",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen spin-off Bioverativ commences when-issued trading of common stock "
    },
    {
        "content": "The U.S. Food and Drug Administration on Friday said it has  approved Biogen Inc's drug to treat spinal muscular atrophy  the leading genetic cause of death in infants.",
        "date": "12232016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "FDA approves Biogen drug for lead genetic cause of infant death "
    },
    {
        "content": "NEW YORK The surprise selection of Michel Vounatsos to run Biogen Inc signals a shift toward a more commercial management focus after years of targeting ambitious scientific gains  and likely keeps the U.S. biotech in play as a takeover target.",
        "date": "12212016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Investors see Biogen CEO choice as friendly to potential takeover "
    },
    {
        "content": "Biogen Inc  the U.S. drug maker focused on neurological  autoimmune and rare diseases  said on Monday it had appointed its chief commercial officer  Michel Vounatsos  as chief executive officer  ending a five-month search.",
        "date": "12192016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen names top executive Vounatsos as CEO "
    },
    {
        "content": "Gradually increasing the dose of Biogen Inc's experimental Alzheimer's disease drug appeared to reduce the risk of brain swelling compared to higher fixed doses  interim 12-month results from a small study released on Thursday showed.",
        "date": "12092016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Further promising data seen with Biogen Alzheimer's drug: study "
    },
    {
        "content": "NEW YORK  Nov 23 Eli Lilly & Co's  massive setback for its experimental Alzheimer's disease treatment on Wednesday sent investors scrambling to re-evaluate shares of the U.S. drugmaker and those of companies making competing therapies  including biotech stalwart Biogen Inc .",
        "date": "11232016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Alzheimer's setback prompts rethink of Lilly  Biogen stock outlooks "
    },
    {
        "content": "Nov 23 Eli Lilly and Co said its experimental Alzheimer's treatment failed to slow the loss of mental functioning in patients with mild symptoms  a major setback for the company and millions of people at risk of developing the memory-robbing disease.",
        "date": "11232016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "CORRECTED-UPDATE 4-Lilly's drug for Alzheimer's fails big trial; shares drop "
    },
    {
        "content": "* Biogen Inc - Appoints Rogerio Vivaldi  M.D. EVP and chief global therapeutic operations officer  and John T. Greene  EVP and chief financial officer",
        "date": "11152016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen announces additional members of management team of hemophilia spin-off company Bioverativ "
    },
    {
        "content": "* Drug may get $1 bln-$2 bln in peak annual sales - Piper Jaffray",
        "date": "11072016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "UPDATE 3-Ionis  Biogen drug for fatal infant disorder succeeds in key study "
    },
    {
        "content": "* Biogen and Ionis Pharmaceuticals announce SPINRAZA (nusinersen) meets primary endpoint at interim analysis of phase 3 cherish study in later-onset spinal muscular atrophy",
        "date": "11072016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen and Ionis Pharmaceuticals announce SPINRAZA meets primary endpoint at interim analysis of phase 3 cherish study "
    },
    {
        "content": "Nov 7 Biogen Inc and Ionis Pharmaceuticals said their investigational treatment for a type of rare genetic muscular disorder met its main goal in an interim analysis of a late-stage study.",
        "date": "11072016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Ionis and Biogen's muscular disorder treatment meets main goal "
    },
    {
        "content": "* Biogen's regulatory applications for nusinersen as a treatment for spinal muscular atrophy accepted by FDA and EMA",
        "date": "10282016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen's regulatory applications for nusinersen as a treatment for spinal muscular atrophy accepted by FDA  EMA "
    },
    {
        "content": "Biogen Inc  on Wednesday reported better-than-expected third quarter profit  driven by higher sales of its lead multiple sclerosis drug and lower costs  and its shares rose more than 4 percent.",
        "date": "10262016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen profit tops expectations; focus on CEO search  new drugs "
    },
    {
        "content": "* Says expects reimbursement for new MS drug Zinbryta throughout Europe within 12-18 months",
        "date": "10262016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen CEO says search to find successor progressing "
    },
    {
        "content": "Oct 26 Biogen Inc reported a 7 percent rise in quarterly profit  helped by higher sales of its multiple sclerosis drugs.",
        "date": "10262016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Drugmaker Biogen quarterly profit rises 7 pct "
    },
    {
        "content": "* Signed material transfer agreement with Biogen  under which Biogen will test Anavex's lead drug candidate  Anavex 2-73  Source text for Eikon:  Further company coverage:",
        "date": "09282016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Anavex signs material transfer agreement with Biogen "
    },
    {
        "content": "* Biogen completes rolling submission of new drug application to FDA for nusinersen as a treatment for spinal muscular atrophy",
        "date": "09262016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen completes submission of new drug application "
    },
    {
        "content": "Allergan Plc  CEO Brent Saunders calls them \"stepping stones\" - small  bolt-on acquisitions  as opposed to the mega-deals common in the drug industry. And they're expected to boost dealmaking in sectors ranging from neurology to skin care.",
        "date": "09202016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Allergan pays top dollar for 'stepping stones' from neurology to dermatology "
    },
    {
        "content": "* New Data Affirm Strong Efficacy And well characterized safety profile of TECFIDERA in both clinical studies and real-world setting",
        "date": "09142016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen Inc affirms strong efficacy of TECFIDERA in both clinical studies and real-world setting "
    },
    {
        "content": "* BioMotiv and Biogen expand strategic partnership into ophthalmology  Source text for Eikon:  Further company coverage:",
        "date": "09062016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-BioMotiv and Biogen expand strategic partnership "
    },
    {
        "content": "* Biogen announces Bioverativ as name of new hemophilia-focused company",
        "date": "08092016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen announces Bioverativ as name of new hemophilia-focused company "
    },
    {
        "content": "U.S. biotechnology company Biogen Inc  has not received any formal expressions of interest from potential acquirers and is not actively soliciting takeover offers  according to a person familiar with the matter. | Video ",
        "date": "08042016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen not pursuing a sale: source "
    },
    {
        "content": "Aug 3 U.S. biotechnology company Biogen Inc  has not received any formal expressions of interest from potential acquirers and is not actively soliciting takeover offers  according to a person familiar with the matter.",
        "date": "08032016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen not pursuing a sale - source "
    },
    {
        "content": "* Allergan has no interest in a Biogen deal - CNBC  citing sources",
        "date": "08032016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Allergan has no interest in a Biogen deal - CNBC  citing sources "
    },
    {
        "content": "* Collaboration will explore use of Amyris's microbe engineering technology",
        "date": "08032016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Amyris enters partnership with Biogen "
    },
    {
        "content": "Biotechnology company Biogen Inc  has drawn takeover interest from drug companies including Merck & Co Inc  and Allergan Plc   The Wall Street Journal reported on Tuesday  citing people familiar with the matter.",
        "date": "08022016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen draws takeover interest from Merck  Allergan: WSJ "
    },
    {
        "content": "Biogen Inc said it would exercise an option to develop and commercialize an experimental genetic muscle-disorder drug after an interim analysis of late-stage data showed patients experienced statistically significant improvement.",
        "date": "08012016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen exercises option to develop muscle drug after trial success "
    },
    {
        "content": "Aug 2 Biotechnology company Biogen Inc  has drawn takeover interest from drug companies including Merck & Co Inc and Allergan Plc  The Wall Street Journal reported on Tuesday  citing people familiar with the matter.",
        "date": "08022016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 4-Biogen draws takeover interest from Merck  Allergan-WSJ "
    },
    {
        "content": "* Allergan unlikely to pursue Biogen deal- CNBC citing source    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08022016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Allergan unlikely to pursue Biogen deal- CNBC citing source "
    },
    {
        "content": "* Drug could make $1 bln-$2 bln in peak sales - analysts   (Adds details  analyst comments; Updates shares)",
        "date": "08012016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 2-Biogen exercises option to develop muscle drug after trial success "
    },
    {
        "content": "Aug 2 Biotechnology company Biogen Inc  has drawn takeover interest from drug companies including Merck & Co Inc and Allergan Plc  The Wall Street Journal reported on Tuesday  citing people familiar with the matter.",
        "date": "08022016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 3-Biogen draws takeover interest from Merck  Allergan -WSJ "
    },
    {
        "content": "* Biogen Inc And Ionis Pharmaceuticals Report Nusinersen Meets Primary Endpoint At Interim Analysis Of Phase 3 Endear Study In Infantile Onset spinal muscular atrophy",
        "date": "08012016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen and Ionis say Nusinersen meets primary endpoint at interim analysis of phase 3 Endear study "
    },
    {
        "content": "NEW YORK Wall Street stocks fell on Tuesday  with each of the major indexes notching their worst day in about a month as economic data and weaker-than-expected auto sales spurred concerns about growth.",
        "date": "08022016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Wall St. falls as weak auto sales spur growth jitters "
    },
    {
        "content": "* Collaboration focused on qualification and validation of Tau imaging agent developed by Merck  MK-6240",
        "date": "07252016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Enigma biomedical announces research collaboration agreement with Biogen Inc and Merck "
    },
    {
        "content": "Biogen Inc on Thursday reported second quarter profit that blew past Wall Street estimates and significantly raised its full-year earnings forecast  while announcing that Chief Executive George Scangos would step down in the coming months once a successor is found.",
        "date": "07212016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen's profit easily beats Street view; CEO to leave "
    },
    {
        "content": "* Indexes down: Dow 0.49 pct  S&P 0.64 pct  Nasdaq 0.9 pct   (Updates to market close)",
        "date": "08022016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "US STOCKS-Wall St falls as weak auto sales spur growth jitters "
    },
    {
        "content": "July 21 Biogen Inc on Thursday reported second quarter profit that blew past Wall Street estimates and significantly raised its full-year earnings forecast  while announcing that Chief Executive George Scangos would step down in the coming months once a successor is found.",
        "date": "07212016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 2-Biogen's profit easily beats Street view; CEO to leave "
    },
    {
        "content": "Aug 2 Biotechnology giant Biogen Inc  has drawn takeover interest from drug companies including Merck & Co Inc and Allergan Plc  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "08022016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "REFILE-Biogen draws takeover interest from Merck  Allergan - WSJ "
    },
    {
        "content": "July 21 Biogen Inc said on Thursday Chief Executive George Scangos will leave the U.S. drugmaker in the coming months and that its board approved a $5 billion share repurchase program.",
        "date": "07212016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen CEO to leave; company plans $5 bln share buyback "
    },
    {
        "content": "* Biogen and Sobi to showcase long-term efficacy and safety data from extended half-life hemophilia therapies at world federation of hemophilia 2016 world congress  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "07182016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen  Sobi to present long-term data on hemophilia drugs at conference "
    },
    {
        "content": "* Sb5  an adalimumab biosimilar referencing humira\u007f  accepted for review by european medicines agency   Further company coverage:    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "07182016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen SB5 accepted for review by European Medicines Agency "
    },
    {
        "content": "SEOUL Biosimilars maker Samsung Bioepis  part of South Korea's top family-run conglomerate Samsung Group [SAGR.UL]  said on Monday it is seeking regulatory approval in Europe to sell its copy of AbbVie Inc's rheumatoid arthritis drug Humira.",
        "date": "07182016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Samsung Bioepis seeks Europe approval for its Humira copy "
    },
    {
        "content": "* European Medicines Agency reviewing Samsung Bioepis' application",
        "date": "07182016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 1-Samsung Bioepis seeks Europe approval for its Humira copy "
    },
    {
        "content": "* Biogen and AbbVie's once-monthly zinbryta(tm) (daclizumab) approved in European Union for treatment of multiple sclerosis",
        "date": "07052016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen and AbbVie's drug approved in EU "
    },
    {
        "content": "* Biogen and Abbvie's once-monthly Zinbryta\u007f (Daclizumab) approved in European Union for treatment of multiple sclerosis  Source text for Eikon:  Further company coverage:",
        "date": "07052016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen and Abbvie's multiple sclerosis drug approved in EU "
    },
    {
        "content": "June 7 Biogen Inc said its experimental drug for treating multiple sclerosis  a nervous system disease affecting the brain and the spinal cord  did not meet the main goal of improving some symptoms in a mid-stage study.",
        "date": "06072016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen's MS drug misses main goal in mid-stage study "
    },
    {
        "content": "* Dow up 0.3 pct  S&P up 0.3 pct  Nasdaq down 0.04 pct   (Updates to late afternoon)",
        "date": "06072016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "US STOCKS-S&P edges closer to record high; energy shares lead "
    },
    {
        "content": "* Indexes up: Dow 0.4 pct  S&P 0.19 pct  Nasdaq 0.04 pct   (Updates to open)",
        "date": "06072016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "US STOCKS-Oil  tech boost S&P and Dow  healthcare caps Nasdaq gains "
    },
    {
        "content": "June 7 Biogen Inc's keenly watched experimental drug for treating multiple sclerosis failed to meet the main goal of improving some symptoms in a mid-stage study  sending the company's shares down as much as 9 percent in premarket trading.",
        "date": "06072016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 2-Biogen's MS drug misses main goal in mid-stage study "
    },
    {
        "content": "* Biogen's Investigational Alzheimer's Disease Treatment Aducanumab Accepted Into European Medicines Agency's Prime Program",
        "date": "06012016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen's Alzheimer drug Aducanumab Accepted into EMA's PRIME Program "
    },
    {
        "content": "The U.S. Food and Drug Administration on Friday approved a once-monthly injection for multiple sclerosis from Biogen Inc and AbbVie Inc  with a boxed warning.",
        "date": "05272016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen  AbbVie once-monthly MS injection wins U.S. approval "
    },
    {
        "content": "May 27 The U.S. Food and Drug Administration on Friday approved a once-monthly injection for multiple sclerosis from Biogen Inc and AbbVie Inc  with a boxed warning.",
        "date": "05272016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 1-Biogen  AbbVie once-monthly MS injection wins U.S. approval "
    },
    {
        "content": "* Regenxbio and Biogen enter exclusive license agreement for the development of gene therapy treatments for rare genetic vision disorders",
        "date": "05162016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Regenxbio and Biogen enter agreement for development of gene therapy treatments "
    },
    {
        "content": "Biogen Inc plans to spin off its hemophilia drug business as a publicly traded company  leaving the drugmaker to focus on developing drugs for neurodegenerative diseases  the company said on Tuesday.",
        "date": "05032016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen to spin off hemophilia drugs and focus on core neuro business "
    },
    {
        "content": "* Biogen announces intent to spin off its hemophilia business",
        "date": "05032016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen announces intent to spin off its hemophilia business "
    },
    {
        "content": "* Biogen and abbvie receive positive opinion from the chmp on zinbryta(tm) (daclizumab) for treatment of multiple sclerosis",
        "date": "04292016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen and Abbvie receive positive opinion from the CHMP on zinbryta "
    },
    {
        "content": "* Biogen appoints Michael Ehlers executive vice president  research and development  Source text for Eikon:  Further company coverage:",
        "date": "04272016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen appoints Michael Ehlers  executive VP of R&D "
    },
    {
        "content": "* CEO  asked about interest in Biogen's hemophilia assets  says \"this is not a time to bet the company on something that is at the outer limits of our capacity\"",
        "date": "04272016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Sobi CEO on Biogen assets: \"not a time to bet the company\" "
    },
    {
        "content": "Aggressive cost cutting propelled Biogen Inc to a better-than-expected first quarter profit as the biotechnology company's reorganization moves began to pay off  and its shares rose nearly 5 percent.",
        "date": "04212016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Cost cutting helps Biogen top Wall Street estimates for quarter "
    },
    {
        "content": "* 1st-qtr profit $4.79/shr vs est. $4.47   (Adds company  analyst comment  share move)",
        "date": "04212016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 3-Cost cutting helps Biogen top Wall Street estimates for quarter "
    },
    {
        "content": "* Q1 earnings per share view $4.47 -- Thomson Reuters I/B/E/S",
        "date": "04212016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen Q1 adj shr $4.79 "
    },
    {
        "content": "April 21 Biogen Inc's quarterly sales rose 6.7 percent  helped by growing demand for its key oral multiple sclerosis (MS) drug  Tecfidera.",
        "date": "04212016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen first-quarter sales rise 6.7 percent "
    },
    {
        "content": "* CEO George Scangos' FY 2015 total compensation $16.9 million versus. $18.6 million in fy 2014 - sec filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04152016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Biogen CEO George Scangos FY 2015 compensation was $16.9 mln vs $18.6 mln in 2014 "
    },
    {
        "content": "Biogen Inc  one of the world's largest biotechnology companies  is exploring a sale of its hemophilia treatments  as it increases its focus on core therapeutic areas  according to people familiar with the matter.",
        "date": "04082016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen explores sale of hemophilia assets: sources "
    },
    {
        "content": "April 8 Biogen Inc  one of the world's largest biotechnology companies  is exploring a sale of its hemophilia treatments  as it increases its focus on core therapeutic areas  according to people familiar with the matter.",
        "date": "04082016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen explores sale of hemophilia assets -sources "
    },
    {
        "content": "Biogen Inc eased investor nerves on Wednesday and its shares surged more than 9 percent after the company reported better-than-expected sales of its most important multiple sclerosis drug  Tecfidera  and issued a 2016 outlook in line with Wall Street estimates.",
        "date": "01272016",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen focuses on drugs in pipeline after strong quarter "
    },
    {
        "content": "* Shares rise more than 9 pct   (New throughout  adds comments from analyst  company  updates share price)",
        "date": "01272016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 3-Biogen focuses on drugs in pipeline after strong quarter "
    },
    {
        "content": "Jan 27 Biogen Inc's fourth-quarter revenue rose 7.5 percent  driven by higher demand for its key oral multiple sclerosis drug Tecfidera.",
        "date": "01272016",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen's quarterly sales rise 7.5 percent "
    },
    {
        "content": "* Says Sobi and Biogen's Elocta\u007f (rfviiifc) approved in Europe for the treatment of haemophilia a",
        "date": "11242015",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "BRIEF-Sobi and Biogen's Elocta approved in Europe for the treatment of haemophilia A "
    },
    {
        "content": "* Drug copy developed by Samsung  Biogen joint venture   (Adds detail on discounts  application process)",
        "date": "11182015",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "UPDATE 1-Europe could recommend second biosimilar arthritis drug this week "
    },
    {
        "content": "LONDON  Nov 18 Europe could soon gain a second biosimilar antibody drug for rheumatoid arthritis and other autoimmune diseases  with regulators due to decide by Friday whether to recommend South Korean company Samsung Bioepis's copy of Enbrel.",
        "date": "11182015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "REFILE-Europe could recommend second biosimilar arthritis drug this week "
    },
    {
        "content": "Biogen Inc   whose shares have tumbled since it slashed growth forecasts for its top-selling multiple sclerosis drug in July  said it will cut 11 percent of its workforce and eliminate development of several drugs to focus on high-priority medicines in its pipeline.",
        "date": "10212015",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen to cut 11 percent of staff  cancel some drug programs; stock jumps "
    },
    {
        "content": "Oct 21 Biogen Inc  whose shares have tumbled since it slashed growth forecasts for its top-selling multiple sclerosis drug in July  said it will cut 11 percent of its workforce and eliminate development of several drugs to focus on high-priority medicines in its pipeline.",
        "date": "10212015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 3-Biogen to cut 11 pct of staff  cancel some drug programs; stock jumps "
    },
    {
        "content": "Oct 21 Drugmaker Biogen Inc said it would cut 11 pct of its global workforce by the end of this year.",
        "date": "10212015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen to cut 11 pct of global workforce "
    },
    {
        "content": "NEW YORK In another setback for prominent hedge fund manager Kyle Bass and his campaign to eliminate some drug patents  the U.S. Patent and Trademark Office on Wednesday declined to hold a trial on the validity of a patent on Biogen Inc's multiple sclerosis drug Tecfidera.",
        "date": "09022015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen patent survives challenge by hedge fund manager Bass "
    },
    {
        "content": "NEW YORK  Sept 2 In another setback for prominent hedge fund manager Kyle Bass and his campaign to eliminate some drug patents  the U.S. Patent and Trademark Office on Wednesday declined to hold a trial on the validity of a patent on Biogen Inc's multiple sclerosis drug Tecfidera.",
        "date": "09022015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen patent survives challenge by hedge fund manager Kyle Bass "
    },
    {
        "content": "Aug 5 CVS Health Corp  which operates the nation's second-biggest pharmacy benefit manager  said that next year it will exclude an additional 31 prescription medicines from insurance coverage  including Viagra and widely used treatments for diabetes and multiple sclerosis.",
        "date": "08052015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "CVS strips Viagra  other top drugs  from insurance coverage "
    },
    {
        "content": "* Nidec jumps 10 pct on strong April-June results     * Eisai tanks after Biogen drug data disappoints     * Komatsu  Hitachi Construction Machinery fall before Caterpillar's earnings      By Ayai Tomisawa     TOKYO  July 23 Japan's Nikkei share average rose on Thursday morning on domestic earnings optimism after electric motor maker Nidec Corp reported strong quarterly results.     Shares of Nidec jumped 10 percent after it posted a 24.1 percent rise in operating profit to 31 billio",
        "date": "07232015",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Nikkei rises on earnings optimism; Nidec jumps on quarterly results "
    },
    {
        "content": "* Indexes down: Dow 0.9 pct  S&P 1.1 pct  Nasdaq 1.1 pct   (Updates to close)",
        "date": "07242015",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "US STOCKS-Wall St slides to end rough week on macro  earnings concerns "
    },
    {
        "content": "TOKYO Shares in Japanese drug maker Eisai Co fell nearly 10 percent early on Thursday after news of disappointing data for partner Biogen Inc's experimental Alzheimer's drug.",
        "date": "07232015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Eisai shares tank after partner Biogen's Alzheimer's data disappoints "
    },
    {
        "content": "Biogen Inc  more than halved its sales growth forecast for 2015  saying it expects demand for its flagship multiple sclerosis (MS) drug  Tecfidera  to continue slowing this year in the United States.",
        "date": "07242015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen halves sales growth forecast as Tecfidera demand stalls "
    },
    {
        "content": "* Shares fall as much as 18.8 percent   (Recasts  analyst and executive comment  shares)",
        "date": "07242015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 3-Biogen halves sales growth forecast as Tecfidera demand stalls "
    },
    {
        "content": "* Amazon jumps to record high after posting unexpected profit",
        "date": "07242015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "US STOCKS-Wall Street lower amid mixed earnings  fall in commodities "
    },
    {
        "content": "July 24 Biogen Inc reported a 30 percent rise in quarterly profit  driven by strong sales of its top-selling oral multiple sclerosis drug  Tecfidera.",
        "date": "07242015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen profit rises 30 pct on higher Tecfidera sales "
    },
    {
        "content": "Disappointing data for Biogen Inc's experimental Alzheimer's drug dragged shares of the company lower on Wednesday  while investors took a slightly more positive view of new findings for a treatment from Eli Lilly and Co.",
        "date": "07222015",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen Alzheimer's data disappoints  Lilly gets slight bump "
    },
    {
        "content": "July 22 Disappointing data for Biogen Inc's  experimental Alzheimer's drug dragged shares in the company lower on Wednesday  while investors took a slightly more positive view of new findings for a treatment from Eli Lilly and Co.",
        "date": "07222015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen Alzheimer's drug data falls flat  Lilly gets slight bump "
    },
    {
        "content": "July 2 Biogen said on Thursday it had forged a deal with AGTC to develop gene-based therapies for a range of eye diseases  marking the company's entry into opthalmology.",
        "date": "07022015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen enters eye-treatment arena with AGTC deal "
    },
    {
        "content": "* Amazon shares touch life high after revenue beats estimates",
        "date": "04242015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "US STOCKS-Nasdaq hits 15-year high  propelled by Amazon  Microsoft "
    },
    {
        "content": "Slowing sales of Biogen Inc's key oral multiple sclerosis (MS) drug Tecfidera and a delay in a data readout for its keenly watched Alzheimer's drug sent the company's stock down as much as 8 percent on Friday.",
        "date": "04242015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen says Tecfidera sales slow  delays data readout on Alzheimer's drug "
    },
    {
        "content": "* Co delays key data readout - executives   (Adds company  analyst comments on Alzheimer's drug data; Updates shares)",
        "date": "04242015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 3-Biogen says Tecfidera sales slow  delays data readout on Alzheimer's drug "
    },
    {
        "content": "April 24 Biogen Inc reported a 71 percent rise in quarterly profit  driven by strong demand for its top-selling oral multiple sclerosis (MS) drug  Tecfidera.",
        "date": "04242015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen 1st qtr profit jumps 71 pct as MS drug Tecfidera shines "
    },
    {
        "content": "NEW YORK Biogen Idec Inc has seen its market value quadruple in three years to more than $100 billion on the back of its successful multiple sclerosis drugs. Now it has new ambitions in its sights. | Video ",
        "date": "03232015",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Exclusive: Biogen shortens name  expands ambitions in Alzheimer's  ALS "
    },
    {
        "content": "An experimental drug from Biogen Idec Inc became the  first Alzheimer's treatment to significantly slow cognitive decline and reduce what is believed to be brain-destroying plaque in patients with early and mild forms of the disease  according to a small study likely to reignite hopes of a treatment. | Video ",
        "date": "03202015",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen's Alzheimer's drug slows mental decline in early study "
    },
    {
        "content": "* Backers include British govt  GSK  J&J  Pfizer  Lilly  Biogen",
        "date": "03172015",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "UPDATE 1-Dementia drug research aided by $100 mln venture capital fund "
    },
    {
        "content": "March 20 An experimental drug from Biogen Idec Inc became the  first Alzheimer's treatment to significantly slow cognitive decline and reduce what is believed to be brain-destroying plaque in patients with early and mild forms of the disease  according to a small study likely to reignite hopes of a treatment.",
        "date": "03202015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 1-Biogen's Alzheimer's drug slows mental decline in early study "
    },
    {
        "content": "* Futures up: Dow 148 pts  S&P 15 pts  Nasdaq 36 pts   (Adds quote  updates prices)",
        "date": "03202015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "US STOCKS-Wall St set for higher open as Nike provides lift "
    },
    {
        "content": "Jan 29 Biogen Idec Inc on Thursday reported higher-than-expected fourth-quarter profit on strong demand for its oral multiple sclerosis drug Tecfidera and issued a forecast for 2015 earnings far higher than Wall Street forecasts.",
        "date": "01292015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen forecasts 2015 earnings well ahead of Street view "
    },
    {
        "content": "Biogen Idec Inc said an experimental drug showed evidence of biological repair of the optic nerve in patients with acute inflammation of the optic nerve  but shares fell as analysts wondered how promising the mid-stage study results were.",
        "date": "01082015",
        "name": "Biogen Inc",
        "news_type": "topStory",
        "symbol": "BIIB",
        "title": "Biogen shares fall after optic nerve study results seen as mixed "
    },
    {
        "content": "Jan 8 An experimental drug from Biogen Idec Inc  showed evidence of biological repair of the optic nerve in a mid-stage study in patients with acute optic neuritis  an inflammation of the optic nerve that can lead to vision loss.",
        "date": "01082015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "UPDATE 2-Biogen experimental drug shows evidence of optic nerve repair "
    },
    {
        "content": "Jan 8 Biogen Idec Inc said on Thursday a mid-stage study of a new treatment for acute optic neuritis  an inflammation of the optic nerve that can lead to complete or partial loss of vision  showed evidence of biological repair of the visual system.",
        "date": "01082015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen says mid-stage optic nerve treatment study succeeds "
    },
    {
        "content": "Jan 11 Biogen Idec Inc on Sunday said it would buy small  privately-held Convergence Pharmaceuticals to acquire the U.K.-based company's portfolio of experimental drugs for chronic nerve pain.",
        "date": "01122015",
        "name": "Biogen Inc",
        "news_type": "normal",
        "symbol": "BIIB",
        "title": "Biogen to buy private U.K. company with chronic pain drug "
    }
]