[
    {
        "content": "* Bio Rad Laboratories Inc reports third-quarter 2017 financial results",
        "date": "11022017",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "BRIEF-Bio Rad Laboratories reports Q3 earnings per share $0.91 "
    },
    {
        "content": "* U.S. U.S. International Trade Commission says it will investigate certain microfluidic devices by 10x Genomics Inc after complaint by Bio-rad Laboratories Inc and Lawrence Livermore National Security LLC. Source text for Eikon: Further company coverage: (Reporting By Susan Heavey)",
        "date": "08312017",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "BRIEF-U.S. ITC to probe certain 10X Genomics devices after Bio-Rad complaint "
    },
    {
        "content": "* Q2 earnings per share view $0.56 -- Thomson Reuters I/B/E/S",
        "date": "08032017",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "BRIEF-Bio-Rad reports Q2 earnings per share $0.17 "
    },
    {
        "content": "The life sciences company Bio-Rad Laboratories Inc on Monday accused its upstart rival 10X Genomics of selling DNA analysis machines that infringe its patents.",
        "date": "08022017",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "Bio-Rad brings patent case against upstart rival 10X Genomics "
    },
    {
        "content": "* VIRBAC SA - VIRBAC SIGNS A RESEARCH AGREEMENT WITH BIO-GENE Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "06162017",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "BRIEF-Virbac signs a research agreement with Bio-Gene "
    },
    {
        "content": "* Bio Rad Laboratories Inc - ‍has received U.S. Food and Drug Administration clearance for its Bioplex 2200 syphilis total & RPR assay​ Source text for Eikon: Further company coverage:",
        "date": "06122017",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "BRIEF-Bio Rad Laboratories receives FDA clearance for Bioplex 2200 syphilis total & RPR assay​ "
    },
    {
        "content": "* Says it has acquired 895 000 shares in Bio-Works Technologies AB  and is holding 9.1 percent stake in the co  from 0 percent stake",
        "date": "05182017",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "BRIEF-Amicogen buys 9.1 pct stake in Bio-Works Technologies AB "
    },
    {
        "content": "* Bio-Rad introduces enhanced options with its IH-COM data management software for managing patient results with the IH-1000 system Source text for Eikon: Further company coverage:",
        "date": "05242017",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "BRIEF-Bio-Rad introduces enhanced options with its IH-COM data management software "
    },
    {
        "content": "* Says it plans to invest up to 202.5 million yuan  ($29.32 million) for 75 percent stake in Beijing-based bio-tech firm Bio-top",
        "date": "05092017",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "BRIEF-Autobio Diagnostics to invest in 75 pct stake in bio-tech firm Bio-top "
    },
    {
        "content": "* Q1 revenue $500.1 million versus I/B/E/S view $477.8 million",
        "date": "05042017",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "BRIEF-Bio-Rad Laboratories reports Q1 earnings per share $0.41 "
    },
    {
        "content": "(The following statement was released by the rating agency) AUSTIN  April 05 (Fitch) Fitch Ratings has affirmed the ratings of Bio-Rad Laboratories  Inc. (Bio-Rad)  including the 'BBB-' Issuer Default Rating (IDR). The ratings apply to approximately $437 million of debt at Dec. 31  2016. The Rating Outlook is Stable. A full list of rating actions follows at the end of this release. KEY RATING DRIVERS Evolving Capital Allocation Strategy: Bio-Rad recently announced long-term targets for revenue g",
        "date": "04052017",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "Fitch Affirms Bio-Rad's IDR at 'BBB-'; Outlook Stable "
    },
    {
        "content": "* Management intends to propose Jeffrey Edwards  Gregory Hinckley and Arnold Pinkston for election to its board of directors",
        "date": "03132017",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "BRIEF-Bio Rad Laboratories management intends to three people for election to its board "
    },
    {
        "content": "* Bio-Rad to acquire Raindance Technologies and Droplet Intellectual Property",
        "date": "01162017",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "BRIEF-Bio-Rad to acquire Raindance Technologies  Droplet Intellectual Property "
    },
    {
        "content": "* Bio-Rad reports third-quarter currency-neutral revenue growth of 9.1 percent",
        "date": "11012016",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "BRIEF-Bio-Rad Q3 earnings per share $0.62 "
    },
    {
        "content": "* Has received clearance from U.S. Food and Drug Administration for its IH-1000 blood typing instrument  Source text for Eikon:  Further company coverage:",
        "date": "10242016",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "BRIEF-Bio Rad Laboratories receives clearance from FDA for IH-1000 blood typing instrument "
    },
    {
        "content": "* Second-Quarter reported revenues were $516.8 million  an increase of 2.1 percent",
        "date": "08032016",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "BRIEF-Bio Rad Laboratories reports Q2 profit $0.61 per share "
    },
    {
        "content": "July 14 Beijing Dabeinong Technology Group Co Ltd :",
        "date": "07142016",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "BRIEF-Beijing Dabeinong Technology Group units to raise stake in Xiamen Bio-tech firm "
    },
    {
        "content": "* Rad reports first-quarter 2016 currency-neutral revenue growth of nearly 4 percent",
        "date": "05052016",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "BRIEF-Bio Rad Laboratories reports Q1 earnings per share $0.42 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 24 (Fitch) Fitch Ratings has affirmed the ratings of Bio-Rad  Laboratories  Inc. (Bio-Rad)  including the 'BBB-' Issuer Default Rating (IDR).  The ratings apply to approximately $438 million of debt at Sept. 30  2015.  The Rating Outlook is Stable. A full list of rating actions follows at the end of this release. KEY RATING DRIVERS Bio-Rad's historically conservative financial policy is reflected by gross  leverage th",
        "date": "11242015",
        "name": "Bio-Rad Laboratories Inc",
        "news_type": "topStory",
        "symbol": "BIO",
        "title": "Fitch Affirms Bio-Rad's IDR at 'BBB-'; Outlook Stable "
    }
]