[
    {
        "content": "* Q3 earnings per share view $0.59 -- Thomson Reuters I/B/E/S",
        "date": "10312017",
        "name": "BankUnited Inc",
        "news_type": "topStory",
        "symbol": "BKU",
        "title": "BRIEF-BankUnited Q3 earnings per share $0.62 "
    },
    {
        "content": "* William S. Rubenstein  Esq. Joins the BankUnited board of directors Source text for Eikon: Further company coverage:",
        "date": "08232017",
        "name": "BankUnited Inc",
        "news_type": "topStory",
        "symbol": "BKU",
        "title": "BRIEF-William S. Rubenstein  Esq. Joins the BankUnited board of directors "
    },
    {
        "content": "* Q2 earnings per share view $0.56 -- Thomson Reuters I/B/E/S",
        "date": "07262017",
        "name": "BankUnited Inc",
        "news_type": "topStory",
        "symbol": "BKU",
        "title": "BRIEF-BankUnited reports Q2 earnings per share $0.60 "
    },
    {
        "content": "* Diamond Hill Capital Management Inc discloses 6 percent passive stake in BankUnited Inc as of December 31  2016 - SEC filing  Source text - (http://bit.ly/2jUAkYg) Further company coverage:",
        "date": "02062017",
        "name": "BankUnited Inc",
        "news_type": "topStory",
        "symbol": "BKU",
        "title": "BRIEF-Diamond Hill Capital Management reports 6 pct passive stake in BankUnited - SEC filing "
    },
    {
        "content": "* Q4 earnings per share view $0.54 -- Thomson Reuters I/B/E/S",
        "date": "01252017",
        "name": "BankUnited Inc",
        "news_type": "topStory",
        "symbol": "BKU",
        "title": "BRIEF-BankUnited Q4 earnings $0.59 per share "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 23 (Fitch) Fitch Ratings has affirmed the Long-Term Issuer  Default Rating (IDRs) at 'BBB' and Short-Term IDRs at 'F2' for BankUnited  Inc.  (BankUnited) and BankUnited  N.A. The Rating Outlook is Stable. See the full  list of rating actions at the end of this release. The rating action follows a periodic review of the mid-tier regional banking  group  which includes BankUnited Inc. (BKU)  BOK Financial Corp. (BOKF)  C",
        "date": "01232017",
        "name": "BankUnited Inc",
        "news_type": "topStory",
        "symbol": "BKU",
        "title": "Fitch Affirms BankUnited  Inc.'s IDRs at 'BBB/F2'; Outlook Stable "
    },
    {
        "content": "A federal judge has allowed former executives of a defunct Florida health maintenance organization who claim BankUnited destroyed their business to move forward with racketeering claims against the bank.",
        "date": "01132017",
        "name": "BankUnited Inc",
        "news_type": "topStory",
        "symbol": "BKU",
        "title": "Judge tosses part of HMO officials' lawsuit against BankUnited "
    },
    {
        "content": "* Q3 earnings per share view $0.53 -- Thomson Reuters I/B/E/S",
        "date": "10202016",
        "name": "BankUnited Inc",
        "news_type": "topStory",
        "symbol": "BKU",
        "title": "BRIEF-Bankunited posts Q3 earnings of $0.47/share "
    },
    {
        "content": "* Says  Rajinder P. Singh to become president and CEO effective January 1  2017",
        "date": "08312016",
        "name": "BankUnited Inc",
        "news_type": "topStory",
        "symbol": "BKU",
        "title": "BRIEF-BankUnited to appoint Rajinder Singh as CEO "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 01 (Fitch) BankUnited  Inc.'s (BKU) recent announcement  regarding senior management succession planning does not have any immediate  impact on the company's current ratings and outlook  according to Fitch Ratings. On Aug. 31  2016  BKU announced that Raj Singh  the company's Chief Operating  Officer  will succeed John Kanas  the company's Chairman  President and Chief  Executive Officer  as President and CEO effecti",
        "date": "09012016",
        "name": "BankUnited Inc",
        "news_type": "topStory",
        "symbol": "BKU",
        "title": "Fitch: No Immediate Impact on BankUnited's Ratings Following Management Succession Announcement "
    },
    {
        "content": "* Says net interest income increased by $33.3 million to $214.3 million for quarter ended June 30  2016",
        "date": "07202016",
        "name": "BankUnited Inc",
        "news_type": "topStory",
        "symbol": "BKU",
        "title": "BRIEF-BankUnited Q2 earnings per share $0.52 "
    },
    {
        "content": "* Q1 earnings per share view $0.52 -- Thomson Reuters I/B/E/S",
        "date": "04202016",
        "name": "BankUnited Inc",
        "news_type": "topStory",
        "symbol": "BKU",
        "title": "BRIEF-Bankunited Q1 earnings per share $0.51 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 28 (Fitch) Fitch Ratings has affirmed the Long-term Issuer  Default Ratings (IDRs) at 'BBB' and Short-term IDRs at 'F2' for BankUnited  Inc.  (BankUnited) and BankUnited  N.A. The Rating Outlook is Stable. A full list of  rating actions follows at the end of this release. The rating action follows a periodic review of the midtier regional banking  group  which includes BankUnited Inc. (BKU)  BOK Financial Corp. (BOKF) ",
        "date": "01282016",
        "name": "BankUnited Inc",
        "news_type": "topStory",
        "symbol": "BKU",
        "title": "Fitch Affirms BankUnited  Inc.'s 'BBB/F2' IDRs; Outlook Stable "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 13 (Fitch) Fitch Ratings has assigned BankUnited  Inc's  (BankUnited; 'BBB'/Outlook Stable) senior 4.875% fixed-rate notes due 2025 a  senior unsecured rating of 'BBB'. The notes were issued under BankUnited's shelf  registration filed on Oct. 26  2015.  The proceeds will be used for general corporate purposes  including investments  in and advances to BankUnited's subsidiaries  including BankUnited  N.A. KEY RATING D",
        "date": "11132015",
        "name": "BankUnited Inc",
        "news_type": "topStory",
        "symbol": "BKU",
        "title": "Fitch Rates BankUnited  Inc's Senior Debt Issuance 'BBB' "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 27 (Fitch) Fitch Ratings has today assigned the long-term  Issuer Default Ratings (IDRs) of 'BBB' and short-term IDRs of 'F2' for  BankUnited  Inc. (BankUnited) and BankUnited  N.A. See the full list of rating  actions at the end of this rating action commentary. KEY RATING DRIVERS  IDRS AND VRS The ratings reflect BankUnited's developing franchise with a growing position in  the New York multifamily market and solid f",
        "date": "10272015",
        "name": "BankUnited Inc",
        "news_type": "topStory",
        "symbol": "BKU",
        "title": "Fitch Assigns 'BBB/F2' IDRs to BankUnited  Inc; Outlook Stable "
    },
    {
        "content": "Aug 13 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "08132015",
        "name": "BankUnited Inc",
        "news_type": "topStory",
        "symbol": "BKU",
        "title": "MOVES- Lloyds Bank  Julius Baer  Berenberg Bank "
    },
    {
        "content": "Aug 13 BankUnited  a wholly owned subsidiary of BankUnited Inc  said it appointed Ian Norkin executive vice president  retail executive  for its West Coast market.",
        "date": "08132015",
        "name": "BankUnited Inc",
        "news_type": "normal",
        "symbol": "BKU",
        "title": "MOVES-BankUnited names Ian Norkin executive vice president "
    }
]