[
    {
        "content": "SYDNEY The chief investment officer of BlackRock Inc's Australian arm said on Friday that investors should not expect double-digit gains from the country's stock market in the near-term.",
        "date": "11172017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock: Don't look for double-digit returns in Australia "
    },
    {
        "content": "* Blackrock declares quarterly dividend of $2.50 on common stock Source text for Eikon: Further company coverage:",
        "date": "11162017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock declares quarterly dividend of $2.50 on common stock "
    },
    {
        "content": "SYDNEY Commonwealth Bank of Australia  easily overcame protest votes against executive remuneration and board appointments at an annual general meeting on Thursday  as it tries to rebuild its reputation after a series of scandals.",
        "date": "11162017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Australia's Commonwealth Bank overcomes protest votes at testy AGM "
    },
    {
        "content": "* Shareholders approve remuneration report  board appointments",
        "date": "11162017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Australia's Commonwealth Bank overcomes protest votes at testy AGM "
    },
    {
        "content": "LOS ANGELES/NEW YORK A shareholder proposal calling for Twenty-First Century Fox Inc to scrap its dual-class share structure was rejected on Wednesday  although the measure received significant support among voters outside the controlling Murdoch family.",
        "date": "11162017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Narrow win for Fox shows restlessness with dual-class shares "
    },
    {
        "content": "NEW YORK  Nov 9 BlackRock Inc Chief Executive Larry Fink said the global economic outlook looks positive despite dysfunction in U.S. politics.",
        "date": "11092017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO Fink says global economy strong despite politics "
    },
    {
        "content": "NEW YORK  Nov 9 BlackRock Inc Chief Executive Larry Fink on Thursday said the global economic outlook looks positive despite U.S. political dysfunction.",
        "date": "11092017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock CEO Fink says global economy strong despite politics "
    },
    {
        "content": "NEW YORK Bitcoin  whose value has fluctuated significantly this month  remains a \"speculative\" investment that thrives because of the cryptocurrency's anonymous nature  BlackRock Inc  Chief Executive Larry Fink said on Monday.",
        "date": "11132017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's Fink says bitcoin thrives on its anonymity "
    },
    {
        "content": "* NGL Energy Partners LP announces agreement to sell its 50% interest in Glass Mountain Pipeline  LLC to an affiliate of Blackrock Inc.’s global energy and power infrastructure fund for $300 million",
        "date": "11092017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-NGL Energy agrees to sell its 50 pct interest in Glass Mountain Pipeline to Blackrock affiliate "
    },
    {
        "content": "NEW YORK Larry Fink  whose $6 trillion BlackRock Inc seldom picks a public fight with large companies  said on Monday that activist investors often help lay the groundwork for positive change in the corporate world.",
        "date": "11132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Fink learns to live with activist investors "
    },
    {
        "content": "* Blackrock announces share split for iShares Nasdaq Biotechnology ETF",
        "date": "11072017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock announces share split for iShares Nasdaq Biotechnology ETF "
    },
    {
        "content": "NEW YORK Pending leadership changes at the U.S. Federal Reserve are not worrying to Larry Fink  who runs BlackRock Inc   the world's largest asset management company  although he does fret about what the Fed is doing to the U.S. Treasury yield curve.",
        "date": "11132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "New faces at Fed seen sticking to current playbook  says BlackRock's Fink "
    },
    {
        "content": "NEW YORK BlackRock Inc  Chief Executive Officer Larry Fink said on Monday that global economic growth is synchronized for the first time since the 2007-09 financial crisis  and that signs of stress in riskier markets should not cause hysteria.",
        "date": "11132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Fink says no need for hysteria in markets "
    },
    {
        "content": "NEW YORK  Nov 13 BlackRock Inc Chief Executive Officer Larry Fink said on Monday that global economic growth is synchronized for the first time since the 2007-09 financial crisis  and that signs of stress in riskier markets should not cause hysteria.",
        "date": "11132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "REUTERS SUMMIT-BlackRock's Fink says no need for hysteria in markets "
    },
    {
        "content": "NEW YORK  Nov 13 Pending leadership changes at the U.S. Federal Reserve are not worrying to Larry Fink  who runs BlackRock Inc  the world's largest asset management company  although he does fret about what the Fed is doing to the U.S. Treasury yield curve.",
        "date": "11132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "REUTERS SUMMIT-New faces at Fed seen sticking to current playbook  says BlackRock's Fink "
    },
    {
        "content": "NEW YORK  Nov 13 Larry Fink  whose $6 trillion BlackRock Inc seldom picks a public fight with large companies  said on Monday that activist investors often help lay the groundwork for positive change in the corporate world.",
        "date": "11132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "REUTERS SUMMIT-BlackRock's Fink learns to live with activist investors "
    },
    {
        "content": "NEW YORK  Nov 13 Bitcoin  whose value has fluctuated significantly this month  remains a \"speculative\" investment that thrives because of the cryptocurrency's anonymous nature  BlackRock Inc Chief Executive Larry Fink said on Monday.",
        "date": "11132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "REUTERS SUMMIT-BlackRock's Fink says bitcoin thrives on its anonymity "
    },
    {
        "content": "NEW YORK  Nov 13 Bitcoin  whose value has fluctuated significantly this month  remains a \"speculative\" investment that thrives because of its anonymous nature  BlackRock Inc Chief Executive Larry  Fink said on Monday.",
        "date": "11132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "RPT-REUTERS SUMMIT-BlackRock's Fink says bitcoin thrives on its anonymity "
    },
    {
        "content": "NEW YORK  Nov 13 BlackRock Inc Chief Executive Officer Larry Fink said on Monday that global economic growth is synchronized for the first time since the 2007-2009 financial crisis  and that signs of stress in riskier markets should not cause hysteria.",
        "date": "11132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "RPT-REUTERS SUMMIT-BlackRock's Fink says no need for hysteria in markets "
    },
    {
        "content": "* BlackRock’s richard turnill - BlackRock growth GPS for UK has ticked down  suggesting 12-month consensus estimates for UK GDP to move slightly lower‍​",
        "date": "10302017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock’s Turnill says BlackRock growth GPS for UK has ticked down "
    },
    {
        "content": "RIYADH Fund manager BlackRock Inc  and private equity firm Blackstone Group  are planning to open offices in Saudi Arabia  encouraged by the investment opportunities offered by the kingdom  Crown Prince Mohammed bin Salman told Reuters.",
        "date": "10272017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock  Blackstone to open offices in Saudi Arabia: Crown Prince "
    },
    {
        "content": "* BlackRock CEO larry fink says investors to only expect a 4 percent investment return with a balanced portfolio - CNBC",
        "date": "10242017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock CEO says investors to only expect 4 pct investment return with a balanced portfolio - CNBC "
    },
    {
        "content": "RIYADH  Oct 27 Fund manager BlackRock Inc and private equity firm Blackstone Group are planning to open offices in Saudi Arabia  encouraged by the investment opportunities offered by the kingdom  Crown Prince Mohammed bin Salman told Reuters.",
        "date": "10272017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock  Blackstone to open offices in Saudi Arabia-Crown Prince "
    },
    {
        "content": "BOSTON  Oct 25 An influential corporate governance figure at BlackRock Inc  Zach Oleksiuk  is leaving the New York asset management firm  a company spokesman said on Wednesday.",
        "date": "10252017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "MOVES-BlackRock governance leader Zach Oleksiuk moving on "
    },
    {
        "content": "NEW YORK  Oct 23 BlackRock Inc  the world's largest asset manager  is lambasting the architects of market indexes like the S&P 500 for ostracizing companies that deny equal voting rights to shareholders  saying that doing so could limit the opportunities of investors in index funds.",
        "date": "10232017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock opposes banning companies from indexes over voting rights "
    },
    {
        "content": "* Sees Japanese PM Shinzo Abe's LDP's victory as mild positive for Japanese equities",
        "date": "10222017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock sees Japanese election result as mild positive for Japanese equities "
    },
    {
        "content": "* ‍IS EXPLORING A POTENTIAL SECONDARY LISTING OF ITS GREATER EUROPE  EQUITIES-FOCUSED  INVESTMENT TRUST ON JOHANNESBURG STOCK EXCHANGE​",
        "date": "10232017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock seeks Johannesburg listing for BlackRock Greater Europe Investment Trust "
    },
    {
        "content": "* asset manager Blackrock held shares in the Italian group with voting rights equal to 5.122 percent as of Oct. 11  according to a filing published by Italian market watchdog Consob Further company coverage: (Reporting by Milan newsroom)",
        "date": "10172017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock holds shares in Italy's Atlantia equal to 5.12 pct voting rights "
    },
    {
        "content": "WASHINGTON BlackRock Inc  Chief Executive Officer Larry Fink warned on Friday that financial markets are ignoring underlying risks  which means there could be a \"big correction\" if a major surprise world event occurred.",
        "date": "10132017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's Fink warns global surprise could drive stock market correction "
    },
    {
        "content": "* Dimon - Governments will eventually \"crush\" bitcoin (Adds comments from Fink  Dimon  Gorman)",
        "date": "10132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock's Fink warns global surprise could drive stock market correction "
    },
    {
        "content": "WASHINGTON  Oct 13 Blackrock Inc Chief Executive Officer Larry Fink warned on Friday that the market could face a \"big correction\" if a major world event occurred.",
        "date": "10132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Blackrock's Fink warns global surprise could drive major market correction "
    },
    {
        "content": "NEW YORK The world's largest asset manager  BlackRock Inc   on Tuesday hired the Obama administration's one-time adviser on climate change to lead an effort to appeal to people who want to invest in a way that helps society.",
        "date": "10102017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock hires former Obama climate adviser: memo "
    },
    {
        "content": "Oct 10 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "10102017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "MOVES- Goldman Sachs  BlackRock  KKR  Natixis "
    },
    {
        "content": "BlackRock Inc  is closing in on an industry-record $6 trillion in assets under management as investors storm into the company's index funds and the bull market in U.S. stocks rages on. | Video ",
        "date": "10112017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock closes in on $6 trillion in assets as index funds boom "
    },
    {
        "content": "* Retail investors played big part in apparent defeat (Adds CEO  analyst comments  share reaction)",
        "date": "10102017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 3-Procter & Gamble foresees proxy war victory  Peltz refuses to concede "
    },
    {
        "content": "NEW YORK  Oct 11 BlackRock Inc Chief Executive Larry Fink on Wednesday warned that strong demand for investments such as long-dated government bonds could push their relative yields to a risky point for markets.",
        "date": "10112017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Fink warns of risk of inverted bond yield curve "
    },
    {
        "content": "LONDON  Oct 10 BlackRock  the world's largest asset manager  has \"taken advantage\" of the recent widening in Spanish yield spreads  the fund's deputy chief investment officer for fixed income said on Tuesday.",
        "date": "10102017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Blackrock's Thiel says took \"advantage\" of Spanish bond volatility "
    },
    {
        "content": "NEW YORK/LONDON BlackRock Inc  will consider paying out-of-pocket for the investment research the world's largest asset manager consumes from banks globally  Chief Executive Larry Fink said on Wednesday.",
        "date": "10112017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock weighing out-of-pocket payments globally for research: CEO "
    },
    {
        "content": "Oct 11 BlackRock Inc is closing in on an industry-record $6 trillion in assets under management as investors storm into the company's index funds and the bull market in U.S. stocks rages on.",
        "date": "10112017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 3-BlackRock closes in on $6 trillion in assets as index funds boom "
    },
    {
        "content": "Oct 10 Procter & Gamble Co on Tuesday will become the biggest ever company to face a shareholder vote over a proxy contest  seeking to prevent activist hedge fund Trian Fund Management LP CEO Nelson Peltz from securing a seat on its board of directors.",
        "date": "10102017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Trian's Peltz to face close Procter & Gamble shareholder vote "
    },
    {
        "content": "NEW YORK  Oct 11 BlackRock Inc Chief Executive Larry Fink on Wednesday warned that strong demand for investments such as long-dated government bonds could push their prices to a risky point.",
        "date": "10112017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock's Fink warns of risk of inverted bond yield curve "
    },
    {
        "content": "* BlackRock Inc Investment Institute says it sees 'modestly' higher yields ahead  fueled further if U.S. tax cuts pass",
        "date": "10022017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock Investment Institute sees U.S. dollar gaining on euro "
    },
    {
        "content": "* BlackRock Inc CEO Larry Fink says U.S. stocks deserve their higher premium - CNBC ‍​",
        "date": "10112017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock CEO Fink says we now manage close to $6 trillion - CNBC ‍​ "
    },
    {
        "content": "LONDON/HONG KONG Reforms aimed at preventing a repeat of the financial crisis a decade ago face a critical test this week when global regulators try to put the finishing touches to one of their main pillars.",
        "date": "10022017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Bank watchdogs in final reform effort as fatigue sets in "
    },
    {
        "content": "LONDON/HONG KONG  Oct 1 Reforms aimed at preventing a repeat of the financial crisis a decade ago face a critical test this week when global regulators try to put the finishing touches to one of their main pillars.",
        "date": "10022017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "REUTERS SUMMIT-Bank watchdogs in final reform effort as fatigue sets in "
    },
    {
        "content": "NEW YORK  Oct 3 Less than 18 percent of the global stock market is owned by index-tracking investors  according to a new estimate from BlackRock Inc  as it suggested that passive investing plays only a limited role in setting equity prices.",
        "date": "10032017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Less than 18 pct of global stocks owned by index investors -BlackRock "
    },
    {
        "content": "* BlackRock reports third quarter 2017 diluted EPS of $5.78  or $5.92 as adjusted",
        "date": "10112017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock reports Q3 adjusted earnings per share of $5.92 "
    },
    {
        "content": "NEW YORK  Oct 3 BlackRock Inc Chief Executive Larry Fink on Tuesday said a U.S. tax plan backed by the Trump administration is going to have to be \"amended \" saying the proposal is going to add to the deficit.",
        "date": "10032017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO says U.S. tax reform plan will have to be amended "
    },
    {
        "content": "Oct 11 BlackRock Inc  the world's biggest asset manager  on Wednesday reported a 8.2 percent rise in quarterly profit  helped by investment advisory  administration fees and securities lending revenue.",
        "date": "10112017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Asset manager BlackRock's third-quarter profit rises "
    },
    {
        "content": "NEW YORK  Oct 3 BlackRock Inc Chief Executive Larry Fink on Tuesday said a U.S. tax plan backed by the Trump administration cannot be passed as it is  noting the proposal would add to the deficit.",
        "date": "10032017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock CEO says U.S. tax reform plan will have to be amended "
    },
    {
        "content": "Sept 26 The dollar could be headed for a rebound this year after a decline that has left it near its lowest level in more than two years  BlackRock's chief fixed-income strategist said on Tuesday.",
        "date": "09262017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock bond strategist sees potential for dollar rebound in 2017 "
    },
    {
        "content": "NEW YORK  Sept 25 A senior BlackRock Inc executive made a donation to an unsuccessful U.S. presidential candidate last year  an action that may prohibit the world's largest asset manager from collecting some fees from a state government  a company regulatory filing showed.",
        "date": "09252017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock fees in limbo over donation to U.S. presidential candidate "
    },
    {
        "content": "HONG KONG Hong Kong and Singapore bourses need to introduce shareholder protection measures if they allow companies with dual-classes of shares to list  BlackRock Inc's  head of investment stewardship for Asia Pacific said on Tuesday.",
        "date": "09262017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock pitches for shareholder protection as Asia bourses weigh dual-class listings "
    },
    {
        "content": "HONG KONG  Sept 26 Hong Kong and Singapore bourses need to introduce shareholder protection measures if they allow companies with dual-classes of shares to list  BlackRock Inc's head of investment stewardship for Asia Pacific said on Tuesday.",
        "date": "09262017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "REUTERS SUMMIT-BlackRock pitches for shareholder protection as Asia bourses weigh dual-class listings "
    },
    {
        "content": "* Deal comes amid improving outlook for Singapore office rents",
        "date": "09212017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "UPDATE 2-CapitaLand Commercial to buy Singapore office tower from BlackRock for $1.55 bln "
    },
    {
        "content": "NEW YORK BlackRock Inc  Chief Executive Larry Fink on Wednesday said the largest asset manager must mirror its customers in terms of gender  comments that come as the company has become more vocal about shareholder and activist efforts to boost workplace diversity.",
        "date": "09202017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock CEO Fink says he is committed to gender diversity "
    },
    {
        "content": "SINGAPORE  Sept 21 CapitaLand Commercial Trust said on Thursday it was buying an office tower in Singapore's financial district for for S$2.1 billion ($1.55 billion) from BlackRock Inc  the world's largest asset manager.",
        "date": "09212017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "CapitaLand Commercial to buy Singapore office tower from BlackRock for $1.55 bln "
    },
    {
        "content": "NEW YORK BlackRock Inc portfolio manager Rick Rieder said on Wednesday that investors should look for the European Central Bank to withdraw some of its stimulus beginning early next year.",
        "date": "09202017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "ECB to wind down stimulus starting early 2018: BlackRock's Rieder "
    },
    {
        "content": "NEW YORK  Sept 20 BlackRock Inc portfolio manager Rick Rieder said on Wednesday that investors should look for the European Central Bank to withdraw some of its stimulus beginning early next year.",
        "date": "09202017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-ECB to wind down stimulus starting early 2018 -BlackRock's Rieder "
    },
    {
        "content": "NEW YORK  Sept 20 BlackRock Inc portfolio manager Rick Rieder said on Wednesday on Twitter that investors should \"look for tapering\" from the European Central Bank following an announcement by the U.S. Federal Reserve that it would reduce its own balance sheet.",
        "date": "09202017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Rieder: Investors should expect ECB taper 'early next year' "
    },
    {
        "content": "NEW YORK  Sept 20 BlackRock Inc Chief Executive Larry Fink on Wednesday said the largest asset manager must mirror its customers in terms of gender  comments that come as the company has become more vocal about shareholder and activist efforts to boost workplace diversity.",
        "date": "09202017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-BlackRock CEO Fink says he is committed to gender diversity "
    },
    {
        "content": "LONDON  Sept 14 BlackRock  the world's biggest asset manager  said on Thursday that it planned to absorb the costs of external research under new European Union rules due to go live in January 2018.",
        "date": "09142017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock says to absorb research costs under new EU rules "
    },
    {
        "content": "TEPIC  Mexico  Sept 20 (Thomson Reuters Foundation) - Latin American cloud forests  energy-saving street lights in Rio de Janeiro and sustainable cattle ranching in the Amazon will get a boost from new financial instruments to channel capital for tackling climate change  their backers said.",
        "date": "09202017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Climate investment incubator branches out into cloud forests  cattle ranches "
    },
    {
        "content": "NEW YORK  Sept 12 BlackRock Inc  the world's largest asset manager  is reshuffling some of its top regional executives and placing new leadership at the head of its lucrative alternatives business  according to a memo on Tuesday.",
        "date": "09122017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock reshuffles top regional  business unit executives "
    },
    {
        "content": "NEW YORK  Sept 20 BlackRock Inc Chief Executive Larry Fink on Wednesday said he is committed to gender parity and that his company must mirror customers  especially with a large proportion of household wealth managed by women.",
        "date": "09202017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Fink says he is committed to gender parity "
    },
    {
        "content": "NEW YORK  Sept 13 The largest U.S. college endowment funds are pulling back their holdings of exchange-traded funds even as they invest more money in passive strategies overall  a move that may help bolster traditional mutual fund managers at a time when ETF providers like BlackRock Inc are seeing the majority of investor inflows.",
        "date": "09132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Largest U.S. university endowment funds pull back on ETF exposure "
    },
    {
        "content": "The California Public Employees' Retirement System (CalPERS) is in talks to outsource its private equity business to BlackRock Inc   according to a person familiar with the matter.",
        "date": "09082017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "CalPERS in talks with BlackRock to outsource private equity business: source "
    },
    {
        "content": "Sept 7 The California Public Employees' Retirement System (CalPERS) is in talks to outsource its private equity business to BlackRock Inc  according to a person familiar with the matter.",
        "date": "09082017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-CalPERS in talks with BlackRock to outsource private equity business -source "
    },
    {
        "content": "Sept 7 The California Public Employees' Retirement System (CalPERS) is in talks to outsource its private equity business to BlackRock Inc  according to a person familiar with the matter.",
        "date": "09072017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "CalPERS in talks with BlackRock to outsource buyout business -source "
    },
    {
        "content": "* Blackrock said to be in preliminary talks for Calpers’s buyout business- source Further company coverage:",
        "date": "09072017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock said to be in preliminary talks for Calpers’s buyout business- source "
    },
    {
        "content": "Sept 5 U.S. exchange operator Nasdaq Inc said on Tuesday it would buy investment analytics provider eVestment Alliance LLC for $705 million to bolster its market technology business and woo more institutional investors.",
        "date": "09052017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 4-Nasdaq to buy analytics firm eVestment for $705 mln "
    },
    {
        "content": "* Blackrock is in talks for calpers's buyout business- Bloomberg  citing sources",
        "date": "09072017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock in talks for Calpers's buyout business- Bloomberg "
    },
    {
        "content": "** BlackRock Inc portfolio managers appear to have turned more optimistic on Alphabet Inc",
        "date": "08252017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BUZZ-BlackRock's largest mutual fund appears to warm to Google again "
    },
    {
        "content": "SEOUL South Korean shipper Hyundai Merchant Marine Co Ltd (HMM)  is in talks with BlackRock Inc  about a potential investment but details have yet to be discussed  a HMM spokesman said on Monday.",
        "date": "08212017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Hyundai Merchant Marine says in talks with BlackRock about potential investment "
    },
    {
        "content": "* Govt injected 1.5 trln won in HMM since Hanjin failure (Adds background on shipping industry  Hanjin Shipping)",
        "date": "08212017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Hyundai Merchant Marine says in talks with BlackRock about potential investment "
    },
    {
        "content": "SEOUL  Aug 21 South Korean shipper Hyundai Merchant Marine Co Ltd (HMM) is in talks with BlackRock Inc about a potential investment but details have yet to be discussed  a HMM spokesman said on Monday.",
        "date": "08212017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Hyundai Merchant Marine in talks with BlackRock about potential investment "
    },
    {
        "content": "NEW YORK BlackRock Inc's  largest mutual fund hiked its exposure to \"select names\" in energy as the sector has lagged this year  one of its portfolio managers said on Thursday.",
        "date": "08172017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's largest mutual fund boosts energy holdings: manager "
    },
    {
        "content": "* IPC MEDIA PENSION SCHEME APPOINTS BLACKROCK AS FIDUCIARY MANAGER FOR SCHEME ASSETS OF APPROXIMATELY £600M AS OF APRIL 2017",
        "date": "08152017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-IPC Media Pension Scheme appoints BlackRock as fiduciary manager "
    },
    {
        "content": "NEW YORK  Aug 17 BlackRock Inc's largest mutual fund hiked its exposure to \"select names\" in energy as the sector has lagged this year  one of its portfolio managers said on Thursday.",
        "date": "08172017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock's largest mutual fund boosts energy holdings -manager "
    },
    {
        "content": "NEW YORK  Aug 17 BlackRock Inc's largest mutual fund hiked its exposure to \"select names\" in energy as the sector has lagged this year  one of its portfolio managers said on Thursday.",
        "date": "08172017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's largest mutual fund boosts energy holdings -manager "
    },
    {
        "content": "NEW YORK Dan Loeb's Third Point took a 1.6 million-share stake in BlackRock Inc  and reinitiated a stake in Alibaba Group Holding  of 4.5 million shares during the second quarter ended June 30  according to regulatory filings late on Friday.",
        "date": "08112017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Third Point takes 1.6 million share stake in BlackRock  4.5 million in Alibaba "
    },
    {
        "content": "NEW YORK  Aug 11 Dan Loeb's Third Point took a 1.6 million-share stake in BlackRock Inc and reinitiated a stake in Alibaba Group Holding of 4.5 million shares during the second quarter ended June 30  according to regulatory filings late on Friday.",
        "date": "08112017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Third Point takes 1.6 mln share stake in BlackRock  4.5 mln in Alibaba "
    },
    {
        "content": "* Third Point LLC takes share stake of 1.6 million shares in Blackrock Inc - SEC filing‍​",
        "date": "08112017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Third Point LLC takes share stake in Blackrock Inc  Alexion Pharmaceuticals "
    },
    {
        "content": "July 24 Vanguard Group  the world's largest mutual fund manager  on Monday appointed BlackRock Inc's Juan Manuel Hernandez to spearhead its business in Mexico.",
        "date": "07242017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "MOVES--Vanguard names BlackRock's Juan Manuel Hernandez as Mexico head "
    },
    {
        "content": "LONDON Asset manager Blackrock and solar energy firm Lightsource have agreed to jointly create a 1 billion pound ($1.3 billion) portfolio of solar power assets in Britain over the next three years  the two companies said on Tuesday.",
        "date": "07252017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Blackrock  Lightsource target 1 billion pound UK solar power portfolio "
    },
    {
        "content": "* Blackrock Inc's Rick Rieder says we believe the Fed is targeting three rate hikes for 2018",
        "date": "07262017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock's Rieder says believe Fed is targeting 3 rate hikes for 2018 "
    },
    {
        "content": "LONDON  July 25 Asset manager Blackrock and solar energy firm Lightsource have agreed to jointly create a 1 billion pound ($1.3 billion) portfolio of solar power assets in Britain over the next three years  the two companies said on Tuesday.",
        "date": "07252017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Blackrock  Lightsource target 1 bln stg UK solar power portfolio "
    },
    {
        "content": "FRANKFURT/LONDON  July 26 Deutsche Bank's planned listing of its asset management arm is unlikely before the first half of next year and could be later  as it wants more time to refine and sell the business's strategy to potential investors  people close to the matter said.",
        "date": "07262017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Deutsche Bank asset management listing seen in H1 2018 at earliest - sources "
    },
    {
        "content": "* Sets quarterly dividend of $2.50 per share Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "07202017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock declares quarterly dividend $2.50 on common stock "
    },
    {
        "content": "* LIGHTSOURCE AND BLACKROCK REAL ASSETS TARGET A GBP 1 BILLION UK SOLAR PARTNERSHIP",
        "date": "07252017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Lightsource and BlackRock to buy UK solar power assets worth 1 bln stg "
    },
    {
        "content": "FRANKFURT/LONDON Deutsche Bank's planned listing of its asset management arm is unlikely before the first half of next year and could be later  as it wants more time to refine and sell the business's strategy to potential investors  people close to the matter said.",
        "date": "07262017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Deutsche Bank asset management listing seen in first half 2018 at earliest: sources "
    },
    {
        "content": "FRANKFURT/LONDON  July 26 Deutsche Bank's planned listing of its asset management arm is unlikely before the first half of next year and could be later  as it wants more time to refine and sell the business's strategy to potential investors  people close to the matter said.",
        "date": "07262017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Deutsche Bank asset management listing seen in H1 2018 at earliest - sources "
    },
    {
        "content": "* Trustees of Serco pension scheme have appointed Blackrock to manage its liability driven investing (LDI) portfolio",
        "date": "07202017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Serco appoints Blackrock for a 1.5 bln stg liability driven investing portfolio "
    },
    {
        "content": "LISBON  July 25 Portugal's state-rescued Novo Banco has launched a debt swap to boost its capital ratio  the last step to concluding its sale to U.S. private equity firm Lone Star.",
        "date": "07252017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Novo Banco launches debt swap to conclude sale "
    },
    {
        "content": "NEW YORK  July 17 BlackRock Inc Chief Executive Larry Fink on Monday said it will be hard for the United States to reach the 3 percent annual growth target set by President Donald Trump.",
        "date": "07172017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO Fink sees U.S. falling short of 3 percent growth "
    },
    {
        "content": "PARIS  July 26 Amundi confirmed on Wednesday plans to switch the IT systems of its recently-acquired Pioneer Investments from rival BlackRock's Aladdin platform in a bid to cut costs.",
        "date": "07262017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Amundi's Pioneer to ditch Blackrock's Aladdin to cut costs "
    },
    {
        "content": "NEW YORK  July 13 BlackRock Inc voted for eight proposals pushing U.S. and Canadian companies to adopt policies boosting their boards' diversity during the most recent quarter  the world's largest asset manager said on Thursday.",
        "date": "07142017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock supports effort to boost number of women board members "
    },
    {
        "content": "NEW YORK  July 13 The world's largest asset manager BlackRock Inc on Thursday launched four bond exchange-traded funds and cut fees on another in an effort to lure more investors to its products from traditional debt markets.",
        "date": "07132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock cuts fees  builds bond indexes in bid 'to be ubiquitous' "
    },
    {
        "content": "July 17 Blackrock's Global Chief Investment Strategist Richard Turnill:",
        "date": "07172017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock's Turnill says see inflation in Eurozone eventually picking up "
    },
    {
        "content": "July 17 BlackRock Inc  the world's biggest asset manager  reported an 8.6 percent rise in quarterly profit  helped by  higher fees.",
        "date": "07172017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock 2nd-qtr profit rises 8.6 pct "
    },
    {
        "content": "NEW YORK BlackRock Inc's  global chief investment strategist on Tuesday suggested that loose monetary policy may have aided speculation in digital currencies like bitcoin  but he said the risk to the broader financial system appears limited.",
        "date": "07112017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "No systemic risk from cryptocurrency speculation: BlackRock strategist "
    },
    {
        "content": "LONDON BlackRock  the world's biggest asset manager  is taking some exposure to the pound through options markets for fear of what months of messy Brexit talks may bring  although it maintains the currency is fairly valued.",
        "date": "07122017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock takes options to calm Brexit nerves despite pound positivity "
    },
    {
        "content": "* Blackrock strategist Richard Turnill says \"continue to favour international stocks over U.S. stocks\"- CNBC Further company coverage:",
        "date": "07102017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock's Turnill says \"continue to favour international stocks over U.S. stocks\"- CNBC "
    },
    {
        "content": "HONG KONG  July 7 An unnamed institutional investor launched a selldown worth about $260 million in China Vanke Co Ltd   China's second-largest property developer  IFR reported on Friday  citing a term sheet.",
        "date": "07072017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "UPDATE 1-Unnamed investor launches $260 mln selldown in China Vanke -IFR "
    },
    {
        "content": "LONDON  July 11 BlackRock  the world's biggest asset manager  is taking some exposure to the pound through options markets for fear of what months of messy Brexit talks may bring  although it maintains the currency is fairly valued.",
        "date": "07112017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock takes options to calm Brexit nerves despite pound positivity "
    },
    {
        "content": "* Blackrock has completed first close of its UK Strategic Alternative Income Fund",
        "date": "07102017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock's UK strategic alternative income fund raises over 500 mln stg "
    },
    {
        "content": "HONG KONG  July 7 An unnamed institutional investor launched a selldown worth about $260 million in China Vanke Co Ltd   China's second-largest property developer  IFR reported on Friday  citing a term sheet of the transaction.",
        "date": "07072017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Unnamed investor launches $260-mln selldown in China Vanke - IFR "
    },
    {
        "content": "NEW YORK Two high-level quantitative researchers have left BlackRock Inc  as the world's largest asset manager embarks on an ambitious effort to engineer a high-tech revolution within its stockpicking business.",
        "date": "07032017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Two top 'quant' researchers exit BlackRock as it revamps stock unit "
    },
    {
        "content": "NEW YORK  June 30 BlackRock Inc on Friday said it would move fifty of its exchange-traded funds from NYSE Arca to homes on rival trading exchanges in a move that points to more competition in the fast-growing industry.",
        "date": "06302017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock moves 50 ETFs to NYSE's rival exchanges "
    },
    {
        "content": "* ARISE ANNOUNCES THE ACQUISITION AND SUBSEQUENT SALE OF THE 115 MW SVARTNÄS WIND FARM TO A FUND MANAGED BY BLACKROCK",
        "date": "06302017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Arise: acquisition and subsequent sale of the 115 MW Svartnäs wind farm "
    },
    {
        "content": "June 27 BlackRock  the world's biggest asset manager  on Tuesday said it would buy a software company that helps businesses invest their cash  marking its second investment in a technology firm this month.",
        "date": "06272017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock makes technology deal in cash management business "
    },
    {
        "content": "NEW YORK Americans' love of their smartphones and apps may be contributing to the sluggish pace of inflation that is worrying  Wall Street and the Federal Reserve  a top bond manager at BlackRock  the world's biggest asset manager  said on Wednesday.",
        "date": "06212017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Low U.S. inflation? It's your phone: BlackRock bond manager "
    },
    {
        "content": "June 20 Ryan Stork  BlackRock Chairman  Asia Pacific:",
        "date": "06202017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock's Ryan Stork says clients to benefit from MSCI decision on Chinese equities "
    },
    {
        "content": "* Deal not expected to be material to co's consolidated financial condition or results of operations ​ Source text for Eikon: Further company coverage:",
        "date": "06272017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock to acquire Cachematrix "
    },
    {
        "content": "NEW YORK  June 21 Americans' love of their smartphones and apps may be contributing to the sluggish pace of inflation that is worrying  Wall Street and the Federal Reserve  a top bond manager at BlackRock  the world's biggest asset manager  said on Wednesday.",
        "date": "06212017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Low U.S. inflation? It's your phone -BlackRock bond manager "
    },
    {
        "content": "* Says decision by MSCI to not upgrade Argentina to Emerging Markets status may be a disappointment to some market participants",
        "date": "06202017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock's Emily Fletchter comments on MSCI decision on Argentina  Saudi Arabia "
    },
    {
        "content": "* John Varley steps down from BlackRock board of directors Source text for Eikon: Further company coverage:",
        "date": "06202017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-John Varley steps down from BlackRock board "
    },
    {
        "content": "LONDON/NEW YORK BlackRock   the world's biggest asset manager  made its first push into Europe's \"robo-advice\" market on Tuesday after taking a stake in Anglo-German digital investment manager Scalable Capital.",
        "date": "06202017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock takes Scalable Capital stake in Europe 'robo-advisor' push "
    },
    {
        "content": "June 20 The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "06202017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "PRESS DIGEST- Financial Times - June 20 "
    },
    {
        "content": "* First \"robo-advice\" deal by world's biggest asset manager in Europe",
        "date": "06192017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock takes Scalable Capital stake in Europe \"robo-advisor\" push "
    },
    {
        "content": "NEW YORK  June 13 One of BlackRock Inc's longest-serving mutual fund managers  who is responsible for tens of billions of dollars in investors' money  is stepping down.",
        "date": "06132017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "One of BlackRock's longest-serving mutual fund managers to retire -memo "
    },
    {
        "content": "June 14 Rick Rieder  BlackRock’s CIO  Global Fixed Income:",
        "date": "06142017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock’s Rick Rieder says Fed meeting continues to signal 3 rate hikes in 2017 "
    },
    {
        "content": "The world's largest asset manager BlackRock Inc  on Friday urged Exxon Mobil Corp  to \"enhance its disclosures\" regarding risks related to climate change.",
        "date": "06122017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock urges Exxon to disclose more about climate change-related risks "
    },
    {
        "content": "* Received formal notification from Blackrock  that it has acquired a beneficial interest in securities of company​",
        "date": "06082017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Anglogold Ashanti says ‍Blackrock now holds 10 pct stake in the company "
    },
    {
        "content": "June 9 The world's largest asset manager BlackRock Inc on Friday urged Exxon Mobil Corp to \"enhance its disclosures\" regarding risks related to climate change.",
        "date": "06102017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock urges Exxon to disclose more about climate change-related risks "
    },
    {
        "content": "* Blackrock's Richard Turnill says \"We prefer taking risk in equities over credit  where positioning is more crowded and valuations less attractive\"‍​",
        "date": "06052017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock's Turnill says prefer taking risk in equities over credit‍​‍​ "
    },
    {
        "content": "NEW YORK The U.S. May payrolls report which showed hiring slowed more than forecast would underpin demand for U.S. bonds in the near term  a top bond executive at BlackRock   the world's largest asset manager said on Friday.",
        "date": "06022017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "U.S. May jobs data seen supporting bond market: BlackRock "
    },
    {
        "content": "BOSTON  June 1 Major investors put U.S. industry on notice on Wednesday that climate change matters  even as reports emerged that President Donald Trump plans to withdraw the United States from an international pact to fight global warming.",
        "date": "06012017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "RPT-Exxon vote shows Wall St diverging from Trump on climate change "
    },
    {
        "content": "DALLAS  May 31 Exxon Mobil Corp's chief executive said on Wednesday the company would reconsider how it communicates the risks its faces from climate change after shareholders approved a measure calling for increased transparency.",
        "date": "05312017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 3-Exxon shareholders approve climate impact report in win for activists "
    },
    {
        "content": "NEW YORK  June 2 The U.S. May payrolls report which showed hiring slowed more than forecast would underpin demand for U.S. bonds in the near term  a top bond executive at BlackRock  the world's largest asset manager said on Friday.",
        "date": "06022017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "U.S. May jobs data seen supporting bond market - BlackRock "
    },
    {
        "content": "BOSTON  May 31 Major investors put U.S. industry on notice on Wednesday that climate change matters  even as reports emerged that President Donald Trump plans to withdraw the United States from an international pact to fight global warming.",
        "date": "05312017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Exxon vote shows Wall St diverging from Trump on climate change "
    },
    {
        "content": "NEW YORK  May 30 BlackRock Inc expects $300 billion in new money from insurers to flood into the already booming bond exchange-traded fund sector over the next five years  a spokeswoman said on Tuesday  following a move by regulators to adjust some requirements on how the investments are valued.",
        "date": "05302017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock expects windfall from insurers after new ETF regulations "
    },
    {
        "content": "NEW YORK BlackRock Chief Executive Larry Fink said on Tuesday that U.S. financial markets are \"probably fully priced at this moment \" and that second-quarter earnings and growth could disappoint investors.",
        "date": "05302017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO Fink says second-quarter earnings could disappoint "
    },
    {
        "content": "NEW YORK  May 30 BlackRock Chief Executive Larry Fink said on Tuesday that U.S. financial markets are \"probably fully priced at this moment \" and that second-quarter earnings and growth could disappoint investors.",
        "date": "05302017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock CEO Fink says 2nd-qtr earnings could disappoint "
    },
    {
        "content": "NEW YORK  May 30 BlackRock Chief Executive Larry Fink on Tuesday said that markets are \"probably fully priced at this moment \" and that second-quarter earnings and growth could disappoint investors.",
        "date": "05302017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO Fink says 2nd-qtr earnings could disappoint "
    },
    {
        "content": "* Sets quarterly dividend of $2.50 per share Source text for Eikon: Further company coverage:",
        "date": "05252017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock sets quarterly dividend of $2.50 per share "
    },
    {
        "content": "NEW YORK BlackRock Inc  will initially pay about $60 per square foot in rent for its future headquarters in the Hudson Yards district on the far west side of midtown Manhattan  the company said in a filing on Thursday.",
        "date": "05252017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock to pay $1.25 billion over 20 years for New York headquarters "
    },
    {
        "content": "* Petroleo brasileiro sa petrobras says notified by blackrock inc that it has acquired preferred shares issued by the co - sec filing",
        "date": "05232017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Petrobras says notified by BlackRock that it acquired preferred shares issued by Co - SEC Filing "
    },
    {
        "content": "NEW YORK  May 25 BlackRock Inc will initially pay about $60 per square foot in rent for its future headquarters in the Hudson Yards district on the far west side of midtown Manhattan  the company said in a filing on Thursday.",
        "date": "05252017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock to pay $1.25 bln over 20 years for New York headquarters "
    },
    {
        "content": "NEW YORK  May 25 BlackRock Inc will initially pay about $60 per square foot in rent for its future headquarters in the Hudson Yards district on the far west side of midtown Manhattan  the company said in a filing on Thursday.",
        "date": "05252017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock to pay $1.25 bln over 20 years for New York headquarters "
    },
    {
        "content": "* On May 24  co entered into agreement with 50 HYMC owner LLC to lease about 847 000 rentable square feet of office space - SEC filing",
        "date": "05252017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock to locate new corporate headquarters at 50 Hudson Yards  New York "
    },
    {
        "content": "NEW YORK  May 18 Robo-adviser Betterment  in a push to try to get more big companies to sign on to its 401(k) plan  beefed up the board of advisers of its retirement product on Friday by adding two leaders in the movement for cutting investment costs for companies and employees.",
        "date": "05192017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "CORRECTED-Betterment adds Labor department  BlackRock experts to 401(k) plan board "
    },
    {
        "content": "May 25 BlackRock Inc Chief Executive Officer Larry Fink said global growth was accelerating and that corporate earnings were keeping pace with higher stock prices.",
        "date": "05252017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO Larry Fink says global growth accelerating "
    },
    {
        "content": "SAN FRANCISCO/NEW YORK  May 15 Snap Inc jumped more than 8 percent on Monday in its second strongest day since the social media company's initial public offering  boosted by filings showing several institutional investors had owned its shares.",
        "date": "05152017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Snap surges after Wall Street heavyweights reveal stakes "
    },
    {
        "content": "* Blackrock CEO Larry Fink at shareholders' meeting says corporate earnings have kept pace with market rise",
        "date": "05252017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock CEO Larry Fink says corporate earnings have kept pace with market rise at shareholders' meeting "
    },
    {
        "content": "SAN FRANCISCO  May 15 Snap Inc jumped 8 percent on Monday and was on track for its third strongest day since the social media company's initial public offering  boosted by filings showing several institutional investors had owned its shares.",
        "date": "05152017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Snap surges after Wall Street heavyweights reveal stakes "
    },
    {
        "content": "BOSTON BlackRock Inc said on Friday that it voted in favor of a successful shareholder proposal calling for more climate change reporting by Occidental Petroleum Corp   in the first sign the world's largest asset manager was backing up its tough new talk on environmental matters.",
        "date": "05122017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock switch helps pass 'historic' climate measure at Occidental "
    },
    {
        "content": "* Blackrock Inc takes share stake of 9.4 million Class A shares in Snap Inc - SEC filing",
        "date": "05122017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock Inc takes share stake of 9.4 mln Class A shares in Snap Inc "
    },
    {
        "content": "BOSTON  May 12 Asset manager BlackRock Inc on Friday said it voted in favor of a shareholder proposal calling on Occidental Petroleum to report on the impact climate change could have on the energy company's business  helping it to pass.",
        "date": "05122017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Switching sides  BlackRock helps pass climate resolution at Occidental "
    },
    {
        "content": "NEW YORK Proxy adviser Glass Lewis recommended on Tuesday that BlackRock Inc  shareholders \"express their concern\" regarding the world's largest asset manager's pay of its top executives  including CEO Larry Fink.",
        "date": "05102017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Glass Lewis says BlackRock CEO's pay  performance misaligned "
    },
    {
        "content": "NEW YORK  May 9 Proxy adviser Glass Lewis recommended on Tuesday that BlackRock Inc shareholders \"express their concern\" regarding the world's largest asset manager's pay of its top executives  including CEO Larry Fink.",
        "date": "05102017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Glass Lewis says BlackRock CEO's pay  performance misaligned "
    },
    {
        "content": "LUXEMBOURG  May 5 The continued global economic expansion offers an \"extraordinary window of opportunity\" for investors  particularly in European markets that haven't yet fully priced in the positive outlook  Blackrock vice chairman Philipp Hildebrand said on Friday.",
        "date": "05052017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "European markets to benefit most from global upswing -Blackrock's Hildebrand "
    },
    {
        "content": "NEW YORK  May 9 Proxy adviser Glass Lewis on Tuesday recommended that BlackRock Inc shareholders vote down a non-binding measure on executive compensation  saying CEO Larry Fink was paid \"significantly more than the median CEO compensation\" of the world's largest asset manager's peers.",
        "date": "05102017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Glass Lewis says pay  performance misaligned for BlackRock CEO "
    },
    {
        "content": "LONDON Asset manager BlackRock  led peers in Europe with fund sales of 22.1 billion euros ($24.11 billion) during the first-quarter  data from Thomson Reuters Lipper on Tuesday showed.",
        "date": "05022017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock leads first quarter fund sales in Europe: Lipper "
    },
    {
        "content": "BOSTON The French parent of asset manager AllianceBernstein fired its longtime leader Peter Kraus  replacing him with a new chief executive and and new chairman  and overhauled the firm's board  according to a filing Monday that offered little explanation for the unexpected changes. | Video ",
        "date": "05022017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "AllianceBernstein parent abruptly removes CEO Kraus  directors "
    },
    {
        "content": "BOSTON  May 1 Asset manager AllianceBernstein on Monday fired longtime leader Peter Kraus and replaced him with a new chief executive and a new chairman  but offered little explanation for the unexpected change.",
        "date": "05012017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "AllianceBernstein abruptly removes CEO Kraus and directors "
    },
    {
        "content": "WASHINGTON A unit of asset manager BlackRock Inc will pay $1.5 million to settle a complaint that it launched a Russian exchange-traded fund without proper regulatory approval  according to U.S. regulators.",
        "date": "04272017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock to pay $1.5 mln to settle SEC charges over Russian ETF "
    },
    {
        "content": "April 27 Cannabis company MedMen said on Thursday Chris Leavy  former BlackRock Inc executive  joined the Los Angeles-based firm as co-chairman and a partner.",
        "date": "04272017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "MOVES-Former BlackRock executive Chris Leavy joins cannabis firm "
    },
    {
        "content": "CHICAGO BlackRock Inc Chief Executive Officer Larry Fink on Friday sounded another warning on the U.S. economy after the government reported anemic growth in the first quarter.",
        "date": "04282017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "U.S. economic growth slower than France  'terrible': BlackRock's Fink "
    },
    {
        "content": "CHICAGO  April 28 BlackRock Inc Chief Executive Officer Larry Fink on Friday sounded another warning on the U.S. economy after the government reported anemic growth in the first quarter.",
        "date": "04282017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "U.S. economic growth slower than France  'terrible' -BlackRock's Fink "
    },
    {
        "content": "CHICAGO  April 28 BlackRock Inc Chief Executive Officer Larry Fink on Friday said he is a \"big believer\" in Wells Fargo & Co Chief Executive Tim Sloan  saying the scandal-hit bank bank is now on a good path.",
        "date": "04282017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Fink a 'big believer' in Wells Fargo CEO "
    },
    {
        "content": "CHICAGO  April 28 BlackRock Inc Chief Executive Officer Larry Fink said on Friday he is a \"big believer\" in Wells Fargo & Co Chief Executive Tim Sloan and that the scandal-hit bank is now on a good path.",
        "date": "04282017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-BlackRock's Fink a 'big believer' in Wells Fargo CEO "
    },
    {
        "content": "WASHINGTON A unit of asset manager BlackRock Inc  will pay $1.5 million to settle a complaint that it launched a Russian exchange-traded fund without proper regulatory approval  according to U.S. regulators.",
        "date": "04262017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock to pay $1.5 million to settle SEC charges over Russian ETF "
    },
    {
        "content": "WASHINGTON  April 26 A unit of asset manager BlackRock Inc will pay $1.5 million to settle a complaint that it launched a Russian exchange-traded fund without proper regulatory approval  according to U.S. regulators.",
        "date": "04262017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock to pay $1.5 mln to settle SEC charges over Russian ETF "
    },
    {
        "content": "NEW YORK BlackRock Inc   the world's biggest asset manager  on Wednesday reported double-digit profit gains as investors plowed money into lower-cost index funds  but the company's share price slipped as revenue fell short of analysts' expectations.",
        "date": "04202017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Booming ETFs help BlackRock weather investors' cost-cutting "
    },
    {
        "content": "LONDON The chief executive of BlackRock   the world's biggest asset manager  said on Wednesday the firm was in the \"best position it's ever been in\" and second-quarter flows remained \"quite strong\".",
        "date": "04202017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO says flows 'quite strong' into Q2: Bloomberg TV "
    },
    {
        "content": "NEW YORK  April 18 Several big fund firms supported challenges on executive pay or  climate disclosures less frequently where they had business ties to energy companies and utilities  according to a new study released on Tuesday.",
        "date": "04182017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Amid business ties  some fund firms eased proxy pressure -study "
    },
    {
        "content": "NEW YORK BlackRock Inc  Chief Executive Officer Larry Fink  who runs the world's largest asset manager  on Wednesday forecast a wave of mergers and acquisitions in asset management  but said his company may be limited for now to small deals.",
        "date": "04202017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO Fink sees wave of M&A in asset management industry "
    },
    {
        "content": "NEW YORK  April 19 BlackRock Inc  the world's biggest asset manager  on Wednesday reported double-digit profit gains as investors plowed money into lower-cost index funds  but the company's share price slipped as revenue fell short of analysts' expectations.",
        "date": "04192017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "UPDATE 5-Booming ETFs help BlackRock weather investors' cost-cutting "
    },
    {
        "content": "NEW YORK  April 19 BlackRock Inc Chief Executive Officer Larry Fink  who runs the world's largest asset manager  on Wednesday forecast a wave of mergers and acquisitions in asset management  but said his company may be limited for now to small deals.",
        "date": "04192017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO Fink sees wave of M&A in asset management industry "
    },
    {
        "content": "* Norges Bank - reports 5.01 percent passive stake in BlackRock Inc as of April 13 - sec filing Source text (http://bit.ly/2oO6KTO) Further company coverage:",
        "date": "04192017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Norges Bank reports 5.01 pct passive stake in BlackRock as of April 13 "
    },
    {
        "content": "LONDON  April 19 The chief executive of BlackRock  the world's biggest asset manager  said on Wednesday the firm was in the \"best position it's ever been in\" and second-quarter flows remained \"quite strong\".",
        "date": "04192017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO says flows 'quite strong' into Q2 - Bloomberg TV "
    },
    {
        "content": "* BlackRock reports first quarter 2017 diluted EPS of $5.23  or $5.25 as adjusted",
        "date": "04192017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock reports Q1 2017 diluted EPS of $5.23 per share "
    },
    {
        "content": "April 19 BlackRock Inc  the world's biggest asset manager  reported a 31 percent rise in quarterly profit helped by higher investment advisory fees and securities lending revenue.",
        "date": "04192017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Asset manager BlackRock's quarterly profit rises 31 pct "
    },
    {
        "content": "* Blackrock Inc - on April 6  co  subsidiaries entered amendment no. 6 to its 5-year revolving credit agreement  dated as of March 10  2011",
        "date": "04112017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock Inc and subsidiaries enters amendment no. 6 "
    },
    {
        "content": "NEW YORK BlackRock Inc   the world's largest asset manager  cut total compensation for Chairman and Chief Executive Officer Larry Fink by 1 percent in 2016  according to a filing on Thursday.",
        "date": "04132017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock cuts CEO Larry Fink's pay 'modestly' in 2016: filing "
    },
    {
        "content": "NEW YORK  April 13 BlackRock Inc  the world's largest asset manager  cut total compensation for Chairman and Chief Executive Officer Larry Fink by 1 percent in 2016  according to a filing on Thursday.",
        "date": "04132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-BlackRock cuts CEO Larry Fink's pay 'modestly' in 2016 -filing "
    },
    {
        "content": "April 7 (IFR) - Ed Cook and Ben Spielman have been named as co-heads of global capital markets at BlackRock following the transition of Matt Savino into the alternatives division.",
        "date": "04072017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "MOVES-Cook and Spielman to head capital markets at BlackRock "
    },
    {
        "content": "NEW YORK  April 13 BlackRock Inc  the world's largest asset manager  held total compensation for Chairman and Chief Executive Officer Larry Fink nearly flat in 2016  according to a filing on Thursday.",
        "date": "04132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock holds Larry Fink's pay nearly flat in 2016 "
    },
    {
        "content": "LONDON  April 7 European exchange-traded products (ETPs) have seen $30.9 billion inflows so far in 2017  more than double the average recorded in the past six years  as U.S. investors returned to the region   partly on easing worries over political risk easing  Blackrock's iShares data showed on Friday.",
        "date": "04072017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "European ETF inflows jump in March  equities in demand: Blackrock iShares "
    },
    {
        "content": "NEW YORK  April 13 One of the portfolio managers behind BlackRock Inc's largest mutual fund says his team has been buying safe-haven assets such as gold and Treasuries to protect from \"known unknowns\" in global politics.",
        "date": "04132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Top BlackRock portfolio manager turning to safe-haven assets "
    },
    {
        "content": "SINGAPORE BlackRock  said the worst was over for Singapore's office property market with supply tapering off  and that elsewhere in Asia Pacific  the world's largest asset manager was looking to raise its real estate exposure in Japan and Australia.",
        "date": "04062017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock sees Singapore office market improving as supply tapers "
    },
    {
        "content": "NEW YORK BlackRock Inc   the world's largest asset manager  on Wednesday said Cisco Systems Inc  Chief Executive Chuck Robbins has been nominated to serve on its board of directors.",
        "date": "04052017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Cisco CEO nominated to bring tech chops to BlackRock board "
    },
    {
        "content": "NEW YORK  April 4 BlackRock Inc  the world's biggest asset manager  slashed the amount it paid out in commissions to Wall Street firms for research by more than half for its largest mutual fund over the last two years  according to filings.",
        "date": "04042017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's big funds cut commission rates for Wall Street research "
    },
    {
        "content": "NEW YORK  April 5 BlackRock Inc  the world's largest asset manager  on Wednesday said Cisco Systems Inc Chief Executive Chuck Robbins has been nominated to serve on its board of directors.",
        "date": "04052017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-Cisco CEO nominated to bring tech chops to BlackRock board "
    },
    {
        "content": "NEW YORK  April 5 BlackRock Inc  the world's largest asset manager  on Wednesday said it would nominate Cisco Systems Inc chief executive Charles Robbins to serve on its board of directors.",
        "date": "04052017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "RPT-BlackRock nominates Cisco CEO to serve on its board "
    },
    {
        "content": "April 3 Blackrock and other asset management institutions are seeking  an injunction this week to block the sale of Portugal's Novo Banco to U.S. private equity firm Lone Star.",
        "date": "04042017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Blackrock among those seeking to block Novo Banco-Lone Star deal "
    },
    {
        "content": "NEW YORK  April 5 BlackRock Inc  the world's largest asset manager  on Wednesday said it would nominate Cisco Systems Inc chief executive Charles Robbins to serve on its board of directors.",
        "date": "04052017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock nominates Cisco CEO to serve on its board "
    },
    {
        "content": "NEW YORK/BOSTON BlackRock Inc's decision to revamp part of its stock-picking business puts further pressure on active U.S. equity managers to cut fees  change products and merge to stem a relentless  12-year decline in assets.",
        "date": "03312017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Analysis -BlackRock's active gambit ups pressure on rivals "
    },
    {
        "content": "NEW YORK  March 28 BlackRock Inc on Tuesday said it would overhaul its actively managed equities business  cutting jobs  dropping fees and relying more on computers to pick stocks in a move that highlights how difficult it has become for humans to beat the market.",
        "date": "03282017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "UPDATE 2-BlackRock cuts fees and jobs; stockpicking goes high-tech "
    },
    {
        "content": "NEW YORK/BOSTON BlackRock Inc's  decision to revamp part of its stock-picking business puts further pressure on active U.S. equity managers to cut fees  change products and merge to stem a relentless  12-year decline in assets.",
        "date": "03312017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's active gambit ups pressure on rivals "
    },
    {
        "content": "NEW YORK  March 28 BlackRock Inc on Tuesday said it would dramatically recast a portion of its fund management operations  conceding that the business of picking stocks has grown increasingly competitive.",
        "date": "03282017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock plans major changes to its active stockpicking business "
    },
    {
        "content": "* Says likes euro  but has French election protection (Updates with quotes  context)",
        "date": "03292017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock's Thiel says positive on pound but nervous over Brexit talks "
    },
    {
        "content": "LONDON  March 29 BlackRock remains positive on South African bonds despite signs of tensions within the government  the head of emerging debt at the world's largest asset manager said on Wednesday  adding that investors would have to \"live with\" political noise.",
        "date": "03292017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock says positive on S.Africa bonds despite political noise "
    },
    {
        "content": "March 29 The following are the top stories on the New York Times business pages. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "03292017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "PRESS DIGEST- New York Times business news - March 29 "
    },
    {
        "content": "* U.S. investment company BlackRock owned 5.006 percent in Italian gas grid company Snam  with voting rights at 4.922 percent as of March 21  according to a filing published by the Italian market watchdog Consob  Further company coverage:   (Reporting by Milan newsroom)",
        "date": "03242017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock at 5 pct of Snam as of March 21 - filing "
    },
    {
        "content": "NEW YORK BlackRock Inc on Tuesday said it would overhaul its actively managed equities business  cutting jobs  dropping fees and relying more on computers to pick stocks in a move that highlights how difficult it has become for humans to beat the market.",
        "date": "03292017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock cuts fees and jobs; stockpicking goes high-tech "
    },
    {
        "content": "TOKYO Nintendo Co Ltd  shares rose as much as 2 percent on Thursday after a regulatory filing showed BlackRock  the world's largest asset manager  owns over five percent of stock in the Japanese games maker.",
        "date": "03232017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Nintendo shares rise after filing shows BlackRock owns 5 percent stake "
    },
    {
        "content": "* On March 21  entered underwriting agreement with J.P. Morgan Securities  Merrill Lynch  pierce  Fenner & Smith  Morgan Stanley",
        "date": "03222017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock to sell to underwriters $700 mln principal amount of 3.200% notes due 2027 "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - For fans of explicitly ethical stakeholder capitalism  Unilever’s rebuttal of a takeover approach by Kraft Heinz last month was a great moment. On one side  a company that made a big deal about thinking long term and creating good products as well as profit for shareholders. On the other  a business run by some of the harshest corporate cost-cutters around. With little more than a few phone calls  the Anglo-Dutch consumer product giant saw off the much smaller co",
        "date": "03222017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Hadas: The stakeholder revolution has been delayed "
    },
    {
        "content": "LONDON The head of European bonds at the world's biggest asset manager told Reuters on Wednesday he is optimistic about the outlook for France and is holding a large stake in its government debt ahead of presidential elections in April and May.",
        "date": "03222017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock bond fund ups French debt stock ahead of election "
    },
    {
        "content": "NEW YORK  March 16 BlackRock Inc is appointing a new head of global trading  a senior executive said on Thursday  elevating a specialist in electronic trading at the company responsible for more than $5 trillion in assets.",
        "date": "03162017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "MOVES-BlackRock names new global head of trading -executive "
    },
    {
        "content": "NEW YORK Markets are emboldened by the tone of monetary policymakers following an interest rate hike on Wednesday  but now is not the time to take on more risk in U.S. corporate debt  top BlackRock Inc bond investor Rick Rieder said.",
        "date": "03162017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Now not time to take more risk in junk bonds: BlackRock's Rieder "
    },
    {
        "content": "NEW YORK  March 15 Markets are emboldened by the tone of monetary policymakers following an interest rate hike on Wednesday  but now is not the time to take on more risk in U.S. corporate debt  top BlackRock Inc bond investor Rick Rieder said.",
        "date": "03152017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Now is not the time for risky junk bonds -BlackRock's Rieder "
    },
    {
        "content": "BOSTON BlackRock Inc  which wields outsized clout as the world's largest asset manager  planned on Monday to put new pressure on companies to explain themselves on issues including how climate change could affect their business as well as boardroom diversity.",
        "date": "03132017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock vows new pressure on climate  board diversity "
    },
    {
        "content": "NEW YORK  March 15 Markets are emboldened by the tone of monetary policymakers following an interest rate hike on Wednesday  but now is not the time to take on more risk in U.S. corporate debt  top BlackRock Inc bond investor Rick Rieder said.",
        "date": "03162017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Now not time to take more risk in junk bonds -BlackRock's Rieder "
    },
    {
        "content": "BOSTON BlackRock Inc  which wields outsized clout as the world's largest asset manager  planned on Monday to put new pressure on companies to explain themselves on issues including how climate change could affect their business as well as boardroom diversity.",
        "date": "03132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Exclusive: BlackRock vows new pressure on climate  board diversity "
    },
    {
        "content": "NEW YORK  March 8 U.S. regulators are advancing rules this week to tighten standards on the ballooning exchange-traded fund industry over the objections of asset managers including BlackRock Inc and Invesco Ltd .",
        "date": "03082017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "U.S. regulators push new ETF rules despite industry's howl "
    },
    {
        "content": "HONG KONG A subsidiary of BlackRock Inc has become the first United States-based asset manager to be awarded a Renminbi Qualified Foreign Institutional Investor (RQFII) quota to invest in China's capital markets.",
        "date": "03022017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "China awards first RQFII quota for a U.S.-based asset manager to BlackRock "
    },
    {
        "content": "HONG KONG  March 2 A subsidiary of BlackRock Inc has become the first United States-based asset manager to be awarded a Renminbi Qualified Foreign Institutional Investor (RQFII) quota to invest in China's capital markets.",
        "date": "03022017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "China awards first RQFII quota for a US-based asset manager to BlackRock "
    },
    {
        "content": "NEW YORK  Feb 17 Managers of BlackRock Inc's  largest mutual fund  fearing Trump administration policies could hurt technology companies with hefty foreign revenue streams  have reshuffled their top holdings  and it appears one of the first casualties is Google.",
        "date": "02172017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's largest mutual fund sours on Google "
    },
    {
        "content": "FRANKFURT China's HNA Group  has taken a stake of just over 3 percent in Deutsche Bank  and said on Friday it could buy further shares in the German lender.",
        "date": "02172017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "China's HNA takes three percent stake in Deutsche Bank "
    },
    {
        "content": "NEW YORK Bob Shearer  who manages one of BlackRock Inc's largest funds  is planning to leave the world's biggest asset manager later this year  executives said in a memo on Tuesday.",
        "date": "02142017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Manager of $22 billion BlackRock stock fund to exit this year: memo "
    },
    {
        "content": "NEW YORK  Feb 14 Bob Shearer  who manages one of BlackRock Inc's largest funds  is planning to leave the world's biggest asset manager later this year  executives said in a memo on Tuesday.",
        "date": "02142017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Manager of $22 bln BlackRock stock fund to exit this year -memo "
    },
    {
        "content": "NEW YORK BlackRock Chief Executive Larry Fink on Wednesday said the U.S. economy is in the midst of a slowdown and financial markets could see a significant setback  because of uncertainty over global trade and the Trump administration's plan to cut taxes.",
        "date": "02082017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock CEO Fink sees 'dark shadows' in financial markets "
    },
    {
        "content": "NEW YORK  Feb 8 BlackRock Chief Executive Larry Fink on Wednesday said the U.S. economy is in the midst of a slowdown and financial markets could see a significant setback  because of uncertainty over global trade and the Trump administration's plan to cut taxes.",
        "date": "02082017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock CEO Fink sees 'dark shadows' in financial markets "
    },
    {
        "content": "BOSTON/SAN FRANCISCO Shares sold in a $3 billion initial public offering by the parent of Snapchat will lack voting power  testing the commitment of big asset managers in their recent fight for investor rights.",
        "date": "02032017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Lacking voting rights  Snap IPO to test fund governance talk "
    },
    {
        "content": "BOSTON/SAN FRANCISCO  Feb 3 Shares sold in a $3 billion initial public offering by the parent of Snapchat will lack voting power  testing the commitment of big asset managers in their recent fight for investor rights.",
        "date": "02032017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Lacking voting rights  Snap IPO to test fund governance talk "
    },
    {
        "content": "NEW YORK The Federal Reserve could hike interest rates as many as four times this year  a move that markets are not sufficiently anticipating  BlackRock Inc's  chief investment officer of global fixed income said on Wednesday.",
        "date": "02012017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Fed may hike rates four times this year: BlackRock's Rieder "
    },
    {
        "content": "* Blackrock Inc discloses 5.2 percent stake in Amec Foster Wheeler - filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom)",
        "date": "01302017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock discloses 5.2 percent stake in Amec Foster "
    },
    {
        "content": "NEW YORK  Feb 1 The Federal Reserve could hike interest rates as many as four times this year  a move that markets are not sufficiently anticipating  BlackRock Inc's  chief investment officer of global fixed income said on Wednesday.",
        "date": "02012017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Fed may hike rates four times this year -BlackRock's Rieder "
    },
    {
        "content": "NEW YORK  Feb 1 The U.S. Federal Reserve could hike interest rates as many as four times this year  a move that markets have not sufficiently anticipated  BlackRock Inc's  chief investment officer of global fixed income said on Wednesday.",
        "date": "02012017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Fed may hike rates four times this year -BlackRock's Rieder "
    },
    {
        "content": "NEW YORK  Feb 1 BlackRock Inc is pushing further into the private infrastructure market with an agreement to buy First Reserve Corp's Energy Infrastructure Funds unit.",
        "date": "02012017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock makes energy acquisition as U.S. infrastructure policy looms "
    },
    {
        "content": "* Blackrock acquires energy infrastructure franchise from First Reserve",
        "date": "02012017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock buys equity infrastructure franchise of First Reserve "
    },
    {
        "content": "Jan 24 BlackRock Inc will scrutinize how companies plan to use the cash they bring back to the United States as part of a tax holiday backed by U.S. President Donald Trump  CEO Larry Fink said in a letter distributed on Tuesday.",
        "date": "01242017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock to ask if companies spend cash from tax holiday on growth "
    },
    {
        "content": "Jan 24 BlackRock Inc will scrutinize how companies plan to use the cash they bring back to the United States as part of a tax holiday backed by U.S. President Donald Trump  CEO Larry Fink said in a letter distributed on Tuesday.",
        "date": "01242017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock to ask if companies spend cash from tax holiday on growth "
    },
    {
        "content": "BOSTON  Jan 25 State Street Corp on Wednesday reported a 3.4 percent drop in fourth-quarter revenue and said it lost more than $1 trillion in custody assets to JPMorgan Chase & Co Inc  sending State Street stock tumbling as much as 7.5 percent.",
        "date": "01252017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "UPDATE 2-BlackRock jilts State St  moves $1 trillion in custody assets to JPMorgan "
    },
    {
        "content": "NEW YORK/LONDON Former British finance minister George Osborne  who lost his job after Britain's vote to leave the European Union  will join BlackRock Inc as an adviser next month  the world's largest asset manager said on Friday.",
        "date": "01202017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock hires former UK finance minister Osborne as adviser "
    },
    {
        "content": "BOSTON State Street Corp  on Wednesday reported a 3.4 percent drop in fourth-quarter revenue and said it lost more than $1 trillion in custody assets to JPMorgan Chase & Co Inc   sending State Street stock tumbling as much as 7.5 percent.",
        "date": "01252017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock jilts State Street  moves $1 trillion in custody assets to JPMorgan "
    },
    {
        "content": "Jan 20 BlackRock Inc on Friday said it is appointing former British finance minister George Osborne as a senior adviser to its Investment Institute.",
        "date": "01202017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock says hired former UK finance minister Osborne as adviser "
    },
    {
        "content": "DAVOS  Switzerland The U.S. is facing a period of dollar strengthening  fuelling likely tensions between the new administration of Donald Trump and the Federal Reserve  the chief executive of asset manager BlackRock told a panel in Davos on Friday.",
        "date": "01202017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO sees dollar tensions between Trump and Fed "
    },
    {
        "content": "DUBLIN  Jan 24 Clearing of euro-denominated financial contracts will have to leave London and stay inside the European Union when Britain leaves the bloc's single market  BlackRock's Philipp Hildebrand said on Tuesday.",
        "date": "01242017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Hildebrand sees euro clearing leaving London post-Brexit "
    },
    {
        "content": "TOKYO BlackRock Inc has a stake in Toshiba Corp of 5.01 percent  according to a Japanese government filing  likely becoming the struggling firm's top shareholder.",
        "date": "01192017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock owns 5 percent of Toshiba  likely becoming top shareholder "
    },
    {
        "content": "* JPM will spend about two years adding BlackRock custodial assets to its existing $20.5 trillion platform - WSJ  citing a source",
        "date": "01252017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-JPMorgan to become custodian for $1 tln in BlackRock assets - WSJ  citing a source "
    },
    {
        "content": "DAVOS  Switzerland Talks with members of the incoming Donald Trump administration suggest their economic policies will be \"loud  noisy and strong\" the head of BlackRock  the world's largest money manager  said on Friday.",
        "date": "01202017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO says Trump economic policies may be 'loud  noisy and strong' "
    },
    {
        "content": "BERLIN/FRANKFURT  Jan 24 The DAX top-30 index  looked set to open 0.2 percent higher on Tuesday  according to premarket data from brokerage Lang & Schwarz at 0702 GMT.",
        "date": "01242017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "German stocks - Factors to watch on January 24 "
    },
    {
        "content": "TOKYO  Jan 19 BlackRock Inc has a stake in Toshiba Corp of 5.01 percent  according to a Japanese government filing  likely becoming the struggling firm's top shareholder.",
        "date": "01192017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock owns 5 pct of Toshiba  likely becoming top shareholder "
    },
    {
        "content": "* Investment management company to open service and innovation centre in Budapest",
        "date": "01252017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock Inc to open new office in Budapest "
    },
    {
        "content": "FRANKFURT Blackrock   the second-largest shareholder in both Deutsche Boerse  and London Stock Exchange Group   publicly voiced its support for the $28 billion merger of the two European exchanges as key regulatory decisions on the tie-up loom.",
        "date": "01162017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Deutsche Boerse-LSE merger make markets healthier: Blackrock "
    },
    {
        "content": "WASHINGTON Asset manager BlackRock Inc will pay a $340 000 penalty to settle charges that it improperly required parting employees to sign agreements forcing them to waive their rights to recover whistleblower awards  U.S. regulators said on Tuesday.",
        "date": "01172017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock settles SEC charges over whistleblower protection violations "
    },
    {
        "content": "DUBLIN Clearing of euro-denominated financial contracts will have to leave London and stay inside the European Union when Britain leaves the bloc's single market  BlackRock's Philipp Hildebrand said on Tuesday.",
        "date": "01252017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Hildebrand sees euro clearing leaving London post-Brexit "
    },
    {
        "content": "DAVOS  Switzerland  Jan 20 Talks with members of the incoming Donald Trump administration suggest their economic policies will be \"loud  noisy and strong\"the head of BlackRock  the world's largest money manager  said on Friday.",
        "date": "01202017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO says Trump economic policies may be \"loud  noisy and strong\" "
    },
    {
        "content": "FRANKFURT  Jan 16 Blackrock  the second-largest shareholder in both Deutsche Boerse  and London Stock Exchange Group  publicly voiced its support for the $28 billion merger of the two European exchanges as key regulatory decisions on the tie-up loom.",
        "date": "01162017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Deutsche Boerse-LSE merger make markets healthier - Blackrock "
    },
    {
        "content": "LONDON  Jan 25 Some of the biggest holders of UK stocks plan to get tougher on executive pay  as the government turns up the heat over the yawning income gap between bosses and employees following Britons' vote to leave the European Union.",
        "date": "01252017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Fund firms plan to get tough on excessive pay at Britain's top firms "
    },
    {
        "content": "NEW YORK BlackRock Inc  CEO Larry Fink on Friday criticized a policy backed by U.S. President-elect Donald Trump to entice U.S. companies to bring their swelling overseas cash piles home  saying a tax holiday may do little to boost growth.",
        "date": "01132017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock CEO says Trump 'tax holiday' may do little for U.S. growth: CNBC "
    },
    {
        "content": "FRANKFURT  Jan 16 Blackrock  the second-largest shareholder in both Deutsche Boerse  and London Stock Exchange Group  publicly voiced its support for the $28 billion merger of the two European exchanges as key regulatory decisions on the tie-up loom.",
        "date": "01162017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Deutsche Boerse-LSE merger make markets healthier - Blackrock "
    },
    {
        "content": "WASHINGTON  Jan 17 Asset manager BlackRock Inc  will pay a $340 000 penalty to settle charges that it improperly required parting employees to sign agreements forcing them to waive their rights to recover whistleblower awards  U.S. regulators said on Tuesday.",
        "date": "01172017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock settles U.S. SEC charges over whistleblower protection violations "
    },
    {
        "content": "NEW YORK  Jan 13 BlackRock Inc CEO Larry Fink on Friday criticized a policy backed by U.S. President-elect Donald Trump to entice U.S. companies to bring their swelling overseas cash piles home  saying a tax holiday may do little to boost growth.",
        "date": "01132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO says Trump 'tax holiday' may do little for U.S. growth -CNBC "
    },
    {
        "content": "Jan 16 The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "01162017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "PRESS DIGEST- British Business - Jan 16 "
    },
    {
        "content": "WASHINGTON  Jan 17 Asset manager BlackRock Inc  will pay a $340 000 penalty to settle charges that it improperly required parting employees to sign agreements that forced them to waive their rights to recover whistleblower awards  U.S. regulators said Tuesday.",
        "date": "01172017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock settles US SEC charges over whistleblower protection violations "
    },
    {
        "content": "NEW YORK  Jan 13 BlackRock Inc CEO Larry Fink seems optimistic about the potential for a $1 trillion infrastructure plan under the new administration of U.S. President-elect Donald Trump.",
        "date": "01132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO sees upside in Trump's U.S. infrastructure plans "
    },
    {
        "content": "* BlackRock strategist Turnill says \"we see a more measured dollar rally ahead\"",
        "date": "01172017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock strategist says \"we see a more measured dollar rally ahead\" "
    },
    {
        "content": "NEW YORK Investors pulled $19.3 billion from BlackRock Inc's  U.S.-based actively managed mutual funds in 2016  Morningstar Inc estimates showed on Tuesday  a record high as the investment industry struggles to restrain an exodus to lower-cost investments.",
        "date": "01042017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's U.S.-based active funds post record 2016 withdrawals: Morningstar "
    },
    {
        "content": "NEW YORK BlackRock Inc  the world's biggest asset manager  reported better-than-expected quarterly profits on Friday as it clamped down on expenses and investors stormed into lower-cost funds to take advantage of a year-end rally.",
        "date": "01132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock profit beats as investors race to low-cost funds "
    },
    {
        "content": "NEW YORK  Jan 13 BlackRock Inc  the world's biggest asset manager  reported better-than-expected quarterly profits on Friday as it clamped down on expenses and investors stormed into lower-cost funds to take advantage of a year-end rally.",
        "date": "01132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 4-BlackRock profit beats as investors race to low-cost funds "
    },
    {
        "content": "NEW YORK Investors funneled $375 billion into exchange-traded funds in  2016  investment manager BlackRock Inc said on Tuesday  a global record that came as investors looked to cut costs.",
        "date": "01032017",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "ETFs globally gather record cash in 2016 -BlackRock "
    },
    {
        "content": "* Blackrock CEO Larry Fink says if the roll out of growth initiaves by President-elect Trump are slower  then the markets are ahead of themselves - CNBC",
        "date": "01132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock CEO Fink says if the roll out of Trump's growth initiaves are slower  then the markets are ahead of themselves - CNBC "
    },
    {
        "content": "* BlackRock reports full year 2016 diluted EPS of $19.04  or $19.29 as adjusted",
        "date": "01132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock reports Q4 earnings per share $5.13 "
    },
    {
        "content": "Jan 13 BlackRock Inc  the world's biggest asset manager  reported a 1.2 percent fall in quarterly profit on Friday as investors rushed into low-cost funds.",
        "date": "01132017",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Asset manager BlackRock's quarterly profit falls 1.2 pct "
    },
    {
        "content": "NEW YORK BlackRock Inc plans to lead the next funding round for the startup iCapital Network  which gives individual investors access to private equity funds  hedge funds  and other alternative investments  the two companies said on Thursday.",
        "date": "12152016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock to lead funding round for fintech startup "
    },
    {
        "content": "NEW YORK Top BlackRock Inc bond investor Rick Rieder on Wednesday said tax cuts would help the U.S. economy withstand even sharply higher interest rates.",
        "date": "12142016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Tax cuts can offset damage from higher U.S. rates: BlackRock's Rieder "
    },
    {
        "content": "NEW YORK BlackRock Inc cut its view on the outlook for U.S. Treasuries further in a publication distributed on Monday  warning investors to prepare for \"pain.\"",
        "date": "12122016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock warns of bond market 'pain' in the coming months "
    },
    {
        "content": "LONDON A wild ride for bond markets since the U.S. election has re-ignited concern about a liquidity crunch in parts of the exchange-traded funds market  home to a small but fast-growing slice of global assets.",
        "date": "12122016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "After explosive growth  bond ETFs brace for the next big test "
    },
    {
        "content": "NEW YORK BlackRock Inc  the world's largest asset manager  plans to move its headquarters in 2022 from midtown Manhattan to a massive new office tower in the fast-growing Hudson Yards district on the city's far West Side  the developers said on Thursday.",
        "date": "12082016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock to move to New York's trendy Hudson Yards district "
    },
    {
        "content": "NEW YORK BlackRock Inc  is making leadership changes to its biggest mutual fund.",
        "date": "12072016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock adjusts leadership team for its largest mutual fund "
    },
    {
        "content": "NEW YORK A top BlackRock Inc executive said the world's largest asset manager could benefit from rising interest rates as its clients keep their stakes in bonds and as revenues from other businesses grow.",
        "date": "12072016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock 'less committed' to specific targets  but forecasts growth "
    },
    {
        "content": "NEW YORK The U.S. Federal Reserve will likely raise interest rates twice in 2017 following an expected rate hike at its Dec. 13-14 policy meeting  a top bond manager at BlackRock   the world's biggest asset manager  said on Friday.",
        "date": "12022016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's Rieder expects Fed to raise rates twice in 2017 "
    },
    {
        "content": "NEW YORK  Nov 28 A top bond investor for BlackRock Inc  the world's largest asset manager  is bargain-hunting in Europe as investors fret over a coming vote that may shake Italy's government.",
        "date": "11282016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Rieder adds exposure to European banks ahead of Italy vote "
    },
    {
        "content": "NEW YORK  Nov 22 Lower leasing costs  more efficient office space and the hope of projecting an image more appealing to millennials are leading hedge funds and large corporations to leave Manhattan's most-coveted business district for a rejuvenated Downtown and the trendy far West Side.",
        "date": "11222016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Famed Plaza District fades as Manhattan office landscape shifts "
    },
    {
        "content": "* Blackrock Strategist Richard Turnill - see Donald Trump's \"surprise win amplifying reflationary theme\" that has shaped global markets in recent months",
        "date": "11142016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock's Turnill says long-term economic  market risks are increasing "
    },
    {
        "content": "NEW YORK Top BlackRock Inc  bond investor Rick Rieder said on Monday he was not ready to completely back down from his bet on emerging markets despite a recent rout.",
        "date": "11152016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Rieder not backing down from emerging market bet "
    },
    {
        "content": "LONDON  Nov 15 Prudential will start using BlackRock's Aladdin platform within its 562 billion pound ($695.98 billion) asset management businesses  the British insurer said on Tuesday.",
        "date": "11152016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Prudential's fund arms to use BlackRock's Aladdin platform "
    },
    {
        "content": "TORONTO Canada is not worried about competing with the United States to draw private investment in infrastructure  Prime Minister Justin Trudeau said on Monday  adding that the country's long-term stability is attractive to investors.",
        "date": "11152016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Canada unfazed by U.S. competition for infrastructure funds "
    },
    {
        "content": "* Blackrock-Record day for on-exchange volume for ishares nasdaq biotech etf  with total of $3.2 billion trading on secondary market throughout Nov 9",
        "date": "11102016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock says record day for options traded on ishares 20+ year treasury bond etf on Nov 9 "
    },
    {
        "content": "* Norges  QIA  Temasek attended event with Trudeau   (Adds further comments from PM Trudeau)",
        "date": "11152016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-Canada unfazed by U.S. competition for infrastructure funds "
    },
    {
        "content": "* \"Longer-duration assets may be particularly at risk as the federal reserve prepares to hike interest rate\"",
        "date": "11072016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock's Fredericks says longer-duration assets may be particularly at risk as the Fed prepares to hike interest rate "
    },
    {
        "content": "* Think Fed will raise policy rates by quarter point in Dec  will then likely move twice more by end of next year  barring some unexpected shock",
        "date": "11042016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock's Rieder says investors should expect interest rate hiking cycle to be \"remarkably gradual\" "
    },
    {
        "content": "* \"Dividend income is poised to become a larger component of lower overall portfolio returns over the next five years\"",
        "date": "11072016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock's Turnill says \"bond yields have likely bottomed out\" "
    },
    {
        "content": "LONDON  Nov 2 A former fund manager at the London division of asset manager BlackRock Inc on Wednesday pleaded guilty to insider dealing in a London court.",
        "date": "11022016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Former BlackRock fund manager pleads guilty to insider dealing in UK "
    },
    {
        "content": "NEW YORK BlackRock Inc has attracted nearly $5 billion to its lowest-cost segment of exchange-traded funds since it announced a price cut last month aimed at financial advisers  the company said on Tuesday.",
        "date": "11012016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock attracts $5 billion to lowest-cost ETFs after price cut "
    },
    {
        "content": "LONDON  Nov 2 A former fund manager at the London division of asset manager BlackRock Inc on Wednesday pleaded guilty to two counts of insider dealing in a London court.",
        "date": "11022016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Former BlackRock fund manager pleads guilty to insider dealing in UK "
    },
    {
        "content": "NEW YORK  Nov 1 BlackRock Inc has attracted nearly $5 billion to its lowest-cost segment of exchange-traded funds since it announced a price cut last month aimed at financial advisers  the company said on Tuesday.",
        "date": "11012016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock attracts $5 bln to lowest-cost ETFs after price cut "
    },
    {
        "content": "* Blackrock-Director William Demchak reports open market purchase of 1 200 shares of co's common stock at average price of $341.11 per share on Oct 27 - SEC filing  Source text for Eikon:  Further company coverage:    ;))",
        "date": "10312016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock director William Demchak reports open market purchase of 1 200 shares of co's common stock - SEC filing "
    },
    {
        "content": "* Total number of shares owned by Blackrock and its funds increased above five percent of share capital on Oct. 19",
        "date": "10202016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock increases ownership in Finland's Kone "
    },
    {
        "content": "NEW YORK BlackRock Inc   the world's largest asset manager  reported better-than-expected quarterly profits on Tuesday  showing resilience in what has been a punishing market for fund managers.",
        "date": "10182016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO sees 'hostile' climate as index funds reel in cash "
    },
    {
        "content": "NEW YORK  Oct 18 BlackRock Inc  the world's largest asset manager  reported better-than-expected quarterly profits on Tuesday  showing resilience in what has been a punishing market for fund managers.",
        "date": "10182016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 4-BlackRock CEO sees 'hostile' climate as index funds reel in cash "
    },
    {
        "content": "* Blackrock CEO Fink on CNBC says his industry is facing 'turmoil' as clients struggle with low rates",
        "date": "10182016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock CEO says his industry facing 'turmoil' as clients struggle with low rates -CNBC "
    },
    {
        "content": "Oct 18 BlackRock Inc  the world's largest asset manager  reported a 3.8 percent rise in quarterly profit  showing resilience in a weak market for many traditional asset managers.",
        "date": "10182016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "REFILE-BlackRock quarterly profit rises 3.8 pct "
    },
    {
        "content": "* \"see a brighter oil price outlook helping risk assets and hurting many perceived \"safe-haven\" investments\"",
        "date": "10102016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock's Turnill says see a brighter oil price outlook helping risk assets "
    },
    {
        "content": "* Think jobs report's details displayed encouraging signs of labor market tightness",
        "date": "10072016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock's Rieder says jobs report's data showed encouraging signs of labor market tightness "
    },
    {
        "content": "SINGAPORE  Oct 5 Private equity firm TPG and fund company BlackRock Inc are among half a dozen firms which have shown preliminary interest in a 49 percent stake in loss-making SriLankan Airlines Ltd  people familiar with the matter said.",
        "date": "10052016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "TPG  BlackRock show early interest in SriLankan Airlines stake -sources "
    },
    {
        "content": "LONDON BlackRock   the world's biggest asset manager  has told an international financial watchdog it supports plans to stress test individual mutual funds to make sure they function properly during extreme market conditions.",
        "date": "10032016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock backs single-fund stress tests  Vanguard against hard rule "
    },
    {
        "content": "* BlackRock  Vanguard among those to respond   (Adds Vanguard  bullet points  background)",
        "date": "10032016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock backs single-fund stress tests  Vanguard against hard rule "
    },
    {
        "content": "LONDON  Oct 3 BlackRock  the world's biggest asset manager  has told the Financial Stability Board it supports plans to stress test individual mutual funds to make sure they function properly during extreme market environments.",
        "date": "10032016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock tells Financial Stability Board it backs fund stress tests "
    },
    {
        "content": "* Blackrock's Russ Koesterich says low U.S. rates are not enough to constantly propel stocks higher",
        "date": "10062016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock's Russ Koesterich says investors should be concerned about low productivity stocks in the U.S. "
    },
    {
        "content": "NEW YORK  Sept 29 BlackRock Inc  the world's largest asset manager  will offer infrastructure funds for the first time through independent financial advisers  it said on Thursday.",
        "date": "09292016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock to offer infrastructure funds via independent advisers "
    },
    {
        "content": "Oct 6 Investments in Charles Schwab Corp's  \"robo adviser\" service grew to surpass $10 billion in September  more than double the year-ago level  a spokeswoman said Thursday.",
        "date": "10062016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Schwab 'robo adviser' more than doubled assets over the last year "
    },
    {
        "content": "NEW YORK  Sept 29 BlackRock Inc  the world's largest asset manager  will offer infrastructure funds for the first time through independent financial advisers  it said on Thursday.",
        "date": "09292016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock to offer infrastructure funds via independent advisers "
    },
    {
        "content": "Sept 29 Blackrock's asset allocation head for Global Allocation Fund Russ Koesterich:",
        "date": "09292016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock's Russ Koesterich says investors should be sensitive to information on rising odds of U.S. recession "
    },
    {
        "content": "Amgen Inc said on Thursday it would buy a stake in Arrowhead Pharmaceuticals Inc and collaborate with the company to develop gene-silencing therapies for heart disease.",
        "date": "09292016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Amgen  Arrowhead team up on gene-therapies for heart disease "
    },
    {
        "content": "Sept 29 Amgen Inc said on Thursday it would buy a stake in Arrowhead Pharmaceuticals Inc and collaborate with the company to develop gene-silencing therapies for heart disease.",
        "date": "09292016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Amgen  Arrowhead team up on gene-therapies for heart disease "
    },
    {
        "content": "* BlackRock held 5.039 percent stake in the Italian phone group as of Sept. 19 held through 16 asset management companies it controls  a regulatory filing showed  Further company coverage:    (Reporting by Milan newsroom)",
        "date": "09222016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock held 5.04 pct of Telecom Italia as of Sept. 19 - filing "
    },
    {
        "content": "LIMA Peru is in talks with BlackRock Inc   the world's largest asset manager  about obtaining infrastructure financing  President Pedro Pablo Kuczynski said Monday after meeting with the company's chief executive officer Larry Fink.",
        "date": "09192016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Peru  BlackRock in talks on infrastructure financing "
    },
    {
        "content": "LIMA  Sept 19 Peru is in talks with BlackRock Inc  the world's largest asset manager  about obtaining infrastructure financing  President Pedro Pablo Kuczynski said Monday after meeting with the company's chief executive officer Larry Fink.",
        "date": "09192016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "CORRECTED-Peru  BlackRock in talks on infrastructure financing "
    },
    {
        "content": "NEW YORK Stocks globally could continue to rise as interest rates remain low as investors who have stockpiled some $70 trillion in cash seek higher returns from the market  BlackRock Inc  president Rob Kapito said on Tuesday.",
        "date": "09132016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock sees $70 trillion in cash on sidelines that could boost stocks "
    },
    {
        "content": "NEW YORK  Sept 13 Stocks globally could continue to rise as interest rates remain low as investors who have stockpiled some $70 trillion in cash seek higher returns from the market  BlackRock Inc president Rob Kapito said on Tuesday.",
        "date": "09132016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock sees $70 trln in cash on sidelines that could boost stocks "
    },
    {
        "content": "NEW YORK  Sept 13 Stocks could continue to rise as interest rates remain low as investors who have stockpiled some $70 trillion in cash seek higher returns from the market  BlackRock Inc president Rob Kapito said on Tuesday.",
        "date": "09132016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock sees $70 trln in cash on sidelines that could boost stocks "
    },
    {
        "content": "LONDON  Sept 7 Formula One faces its biggest shake-up in decades with the announcement on Wednesday that U.S. cable TV mogul John Malone's Liberty Media has agreed to take control of the cash-generating glamour sport.",
        "date": "09082016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "RPT-UPDATE 1-Motor racing-Formula One faces big shake-up after Liberty deal "
    },
    {
        "content": "NEW YORK  Sept 7 The man who since 2008 has run BlackRock Inc's quasi-consulting arm for governments  regulators and massive financial firms plans to leave the company next year  according to an internal memo.",
        "date": "09072016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "MOVES-Head of BlackRock quasi-consulting arm to leave company -memo "
    },
    {
        "content": "LONDON Formula One faces its biggest shake-up in decades with the announcement on Wednesday that U.S. cable TV mogul John Malone's Liberty Media has agreed to take control of the cash-generating glamor sport.",
        "date": "09072016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Formula One faces big shake-up after Liberty deal "
    },
    {
        "content": "NEW YORK A top BlackRock Inc  portfolio manager said on Wednesday he has been buying options \"protection\" against equities and slicing stock exposure  adding that now is not the time to take risks.",
        "date": "09072016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Top BlackRock portfolio manager cutting stocks exposure "
    },
    {
        "content": "NEW YORK  Sept 7 A top BlackRock Inc  portfolio manager said on Wednesday he has been buying options \"protection\" against equities and slicing stock exposure  adding that now is not the time to take risks.",
        "date": "09072016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Top BlackRock portfolio manager cutting stocks exposure "
    },
    {
        "content": "NEW YORK  Sept 7 A top BlackRock Inc  portfolio manager said Wednesday that he has been buying options \"protection\" and slicing stock exposure  adding that now is not the time to take risk.",
        "date": "09072016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Top BlackRock portfolio manager says he cut stock market risk "
    },
    {
        "content": "NEW YORK/LONDON  Sept 6 BlackRock Inc  the world's largest asset manager  said all investors should factor climate change into their decision-making and doing so would not mean having to accept lower returns.",
        "date": "09062016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "RPT-Funds leader BlackRock calls on investors to assess climate change impact "
    },
    {
        "content": "* Blackrock Strategist Turnill - Extension of March end point for ECB's QE program more likely than increase in size of monthly purchases  lowering of interest rates",
        "date": "09062016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock Strategist Turnill - Extension of March end point for ECB's QE program more likely "
    },
    {
        "content": "NEW YORK/LONDON BlackRock Inc  the world's largest asset manager  said all investors should factor climate change into their decision-making and doing so would not mean having to accept lower returns.        Global moves to coordinate a response to climate change took a big step forward on Saturday when both China and the United States ratified a 2015 plan to curb climate-warming emissions  raising chances it will enter into law this year.",
        "date": "09062016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Funds leader BlackRock calls on investors to assess climate change impact "
    },
    {
        "content": "BOSTON BlackRock Inc withheld support from two high-profile directors at Exxon Mobil Corp  securities filings show  a rare spat apparently driven by a board communications policy at the world's largest energy company.",
        "date": "08292016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock withheld support from two key Exxon directors: filings "
    },
    {
        "content": "* Advocate reducing popular positions where prices have moved beyond fundamentals",
        "date": "08292016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock Strategist Turnill advocates reducing popular positions where prices have moved beyond fundamentals "
    },
    {
        "content": "BOSTON  Aug 29 BlackRock Inc withheld support from two high-profile directors at Exxon Mobil Corp   securities filings show  a rare spat apparently driven by a board communications policy at the world's largest energy company.",
        "date": "08292016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock withheld support from two key Exxon directors -filings "
    },
    {
        "content": "NEW YORK  Aug 22 BlackRock Inc said on Monday it is upgrading its view on emerging market stocks  saying the equities will thrive as central banks keep interest rates low.",
        "date": "08222016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock upgrades outlook for emerging market stocks "
    },
    {
        "content": "* Says on August 22  2016  Blackrock  Inc's aggregate holding in Metso exceeded 5 percent threshold and amounted to 7.6 million shares",
        "date": "08232016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Metso says Blackrock's aggregate holding in the company exceeded 5 pct threshold "
    },
    {
        "content": "* Director James Grosfeld reports open market sale of 25 710 shares of co's common stock at average price of $372.97 per share on August 23 - SEC filing  Source: (http://bit.ly/2bDuZg9) Further company coverage:",
        "date": "08252016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock- Director reports open market sale of co's shares "
    },
    {
        "content": "NEW YORK  Aug 22 BlackRock Inc said on Monday it is upgrading its view on emerging market stocks  adding that the equities will continue thriving as central banks keep interest rates low.",
        "date": "08222016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock upgrades outlook for emerging market stocks "
    },
    {
        "content": "* Says fund will trade under ticker BIIIX  Source text for Eikon:  Further company coverage:",
        "date": "08252016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock launches Blackrock impact bond fund "
    },
    {
        "content": "* Says files for mixed shelf of up to $1 billion - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "08152016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock says files for mixed shelf of up to $1 bln "
    },
    {
        "content": "* Blackrock invests in major electric generation facility planned for construction in New York",
        "date": "08162016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock invests in major electric generation facility planned in New York "
    },
    {
        "content": "* Blackrock strategist Richard Turnill on CNBC says Fed will still likely hold off on more than 1 rate hike this year",
        "date": "08162016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock's Turnill says Fed likely to raise rates once at most this year "
    },
    {
        "content": "NEW YORK Managers of BlackRock Inc's largest mutual fund are warning that U.S. stocks may \"disappoint\" investors  a company note showed on Wednesday  arguing for a shift to Japanese stocks as one of the few markets offering a bargain.",
        "date": "08172016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's largest mutual fund warns on U.S.  ups Japan stake "
    },
    {
        "content": "NEW YORK  Aug 17 Managers of BlackRock Inc's  largest mutual fund are warning that U.S. stocks may \"disappoint\" investors  a company note showed on Wednesday  arguing for a shift to Japanese stocks as one of the few markets offering a bargain.",
        "date": "08172016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-BlackRock's largest mutual fund warns on U.S.  ups Japan stake "
    },
    {
        "content": "NEW YORK  Aug 17 BlackRock Inc's Global Allocation Fund has been adding to its bet on the Japanese stock market  a company note said on Wednesday  calling it one of the few markets to offer a bargain and warning that U.S. stocks may disappoint.",
        "date": "08172016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's largest mutual fund ups bet on Japan "
    },
    {
        "content": "BOSTON When Adam Kanzer wanted to stop the board of 3M Co  from including the lucrative impact of share buybacks in their chief executive's pay  he quoted Laurence Fink.",
        "date": "08042016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's voting record clashes with CEO's tough talk on buybacks "
    },
    {
        "content": "NEW YORK  July 26 BlackRock's global allocation fund booked profits on U.S.-based energy shares in June as oil prices rose more than 25 percent in the second quarter  as a part of a 85 percent rebound since hitting 12-year lows in early 2016 tied to fears about oversupply.",
        "date": "07262016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock fund took profits in U.S. energy stocks "
    },
    {
        "content": "* Blackrock notified it intends to exert influence on appointment/removal of administrative  managing  supervisory bodies members",
        "date": "07202016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Prosiebensat.1 Media says Blackrock Inc notified co that it plans to acquire further voting rights in co within next 12 months "
    },
    {
        "content": "July 18 Asset manager BlackRock Inc said Dominik Rohe took charge as country head of Australia in Sydney on Monday.",
        "date": "07182016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "MOVES-Dominik Rohe takes charge as country head of BlackRock  Australia "
    },
    {
        "content": "* Blackrock declares quarterly dividend of $2.29 on common stock  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07202016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock declares qtrly dividend of $2.29 on common stock "
    },
    {
        "content": "July 18 Embattled online lender LendingClub Corp  said it appointed BlackRock Inc veteran Patrick Dunne its chief capital officer.",
        "date": "07182016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "MOVES-LendingClub hires BlackRock veteran Patrick Dunne "
    },
    {
        "content": "* Lending Club names BlackRock veteran Patrick Dunne as chief capital officer  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07182016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Lending Club names BlackRock veteran Patrick Dunne as chief capital officer "
    },
    {
        "content": "NEW YORK BlackRock Inc's profit fell 3.7 percent in the second quarter as global market turmoil spurred investors to shift from stocks to cash and bonds  hurting fee income at the world's largest asset management company.",
        "date": "07142016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock profit falls as shift from stocks hits fee revenue "
    },
    {
        "content": "NEW YORK  July 14 BlackRock Inc's profit fell 3.7 percent in the second quarter as global market turmoil spurred investors to shift from stocks to cash and bonds  hurting fee income at the world's largest asset management company.",
        "date": "07142016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 3-BlackRock profit falls as shift from stocks hits fee revenue "
    },
    {
        "content": "NEW YORK  July 14 The world's largest asset manager BlackRock Inc has been buying roughly $275 million of its shares every quarter  a practice chief executive Larry Fink said could continue even though he has previously warned about the downside of share repurchases.",
        "date": "07142016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock stock buybacks continue though CEO warned against repurchases "
    },
    {
        "content": "NEW YORK A top bond manager at BlackRock  the world's biggest asset manager  said on Friday the Federal Reserve would likely leave U.S. interest rates alone for the rest of 2016 despite a surprisingly strong rebound in domestic hiring in June.",
        "date": "07082016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's Rieder sees Fed likely on hold after June jobs data "
    },
    {
        "content": "NEW YORK  July 14 BlackRock Inc's profit fell 3.7 percent in the second quarter as global market turmoil spurred investors to shift from stocks to cash and bonds  hurting fee income at the world's largest asset management company.",
        "date": "07142016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "CORRECTED-UPDATE 2-BlackRock profit falls but matches expectations  fee revenue slips "
    },
    {
        "content": "By Trevor Hunnicutt     NEW YORK  July 13 U.S. mutual-fund investors bought international stocks and riskier bonds during the latest week  reversing course after pulling the most cash this year from funds following the Brexit vote  Investment Company Institute data showed on Wednesday.      ICI said investors added $2 billion to U.S.-based funds invested in developed-market stocks outside the country during the week ended July 6  after pulling $2.7 billion from the funds the week bef",
        "date": "07132016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "U.S. fund investors tiptoe back into junk bonds  global stocks "
    },
    {
        "content": "LONDON Britain will fall into recession over the coming year and growth in each of the next five years will be at least 0.5 percentage points lower as a result of Britain leaving the European Union  BlackRock Inc  said on Tuesday.",
        "date": "07122016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Brexit to trigger UK recession over coming year: BlackRock "
    },
    {
        "content": "SEOUL South Korea's National Pension Service (NPS)  the world's third-largest pension fund  said it had chosen a BlackRock Inc unit and Grosvenor Capital Management to manage investments in funds of hedge funds in 2016.",
        "date": "07112016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "South Korea pension picks BlackRock  Grosvenor to manage hedge fund investments "
    },
    {
        "content": " ",
        "date": "07142016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Reuters Business News Schedule at 1230 GMT/0830 AM ET "
    },
    {
        "content": "LONDON  July 12 Britain will fall into recession over the coming year and growth in each of the next five years will be at least 0.5 percentage points lower as a result of Britain leaving the European Union  BlackRock Inc said on Tuesday.",
        "date": "07122016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "REFILE-UPDATE 1-Brexit to trigger UK recession over coming year -BlackRock "
    },
    {
        "content": "SEOUL  July 11 South Korea's National Pension Service (NPS)  the world's third-largest pension fund  said it had chosen a BlackRock Inc unit and Grosvenor Capital Management to manage investments in funds of hedge funds in 2016.",
        "date": "07112016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "S.Korea pension picks BlackRock  Grosvenor to manage hedge fund investments "
    },
    {
        "content": "LONDON Distressed debt funds will become big shareholders in troubled oil firm Gulf Keystone  after bondholders agreed to swap $500 million of debt for equity  wiping out some of the world's top funds as shareholders.",
        "date": "07142016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Distressed funds set for big stakes in Gulf Keystone after debt swap "
    },
    {
        "content": "* Blackrock Investment Institute's Mid  Year 2016 global investment outlook:",
        "date": "07122016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock- Investment Institute's mid-year 2016 global investment outlook "
    },
    {
        "content": "NEW YORK  July 14 BlackRock Inc Chief Executive Larry Fink on Thursday said he would not be surprised to see U.S. interest rates sink far lower under pressure from international demand.",
        "date": "07142016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock sees stock prices unjustified but more demand for U.S. bonds "
    },
    {
        "content": "LONDON  July 12 Britain will fall into recession over the coming year and growth in each of the next five years will be at least 0.5 percentage points lower as a result of Brexit  BlackRock said on Tuesday.",
        "date": "07122016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UK to fall into recession over coming year - BlackRock "
    },
    {
        "content": "* BlackRock reports second quarter 2016 diluted EPS of $4.73  or $4.78 as adjusted",
        "date": "07142016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock reports Q2 adj earnings per share of $4.78 "
    },
    {
        "content": "* Board has approved share splits for 11 iShares ETFs for shareholders of record as of close of business on July 19  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06272016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock authorized share splits for a number of iShares ETFs "
    },
    {
        "content": "* Blackrock held 5.76 percent of the Italian lender as of June 16  a filing by market regulator Consob showed  Further company coverage:    (Reporting by Milan newsroom)",
        "date": "06272016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock held 5.76 pct of Banco Popolare as of June 16 - filing "
    },
    {
        "content": "June 20 BlackRock Inc  the world's largest asset manager  appointed Kate Moore as chief equity strategist for the Americas  according to a memo provided by the firm.",
        "date": "06202016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "MOVES-BlackRock names Kate Moore Americas chief equity strategist "
    },
    {
        "content": "* BlackRock closes on purchase of 50 percent interest in Texas Wind Project",
        "date": "06162016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock closes on purchase of 50 pct interest in Texas Wind Project "
    },
    {
        "content": "* Upgraded short-term view on U.S. Treasuries amid looming risks and dovish expectations for central bank policy",
        "date": "06202016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock Strategist Richard Turnill comments on force driving yields down "
    },
    {
        "content": "NEW YORK The asset management sector \"needs consolidation\" and has the potential for \"quite a bit\" of merger and acquisition activity  BlackRock Inc  Chief Executive Officer Laurence Fink said at an investor day meeting in New York.",
        "date": "06152016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock sees wave of M&A in asset management industry: CEO "
    },
    {
        "content": "NEW YORK  June 15 The asset management sector \"needs consolidation\" and has the potential for \"quite a bit\" of merger and acquisition activity  BlackRock Inc Chief Executive Officer Laurence Fink said at an investor day meeting in New York.",
        "date": "06152016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock sees wave of M&A in asset management industry -CEO "
    },
    {
        "content": "NEW YORK BlackRock Inc  is using its access and leverage as a major shareholder in public companies to strike more client-winning deals with private companies  a top executive for the world's largest asset manager said on Friday.",
        "date": "06172016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "When BlackRock calls  CEOs listen and do deals "
    },
    {
        "content": "CHICAGO Top BlackRock Inc investor Rick Rieder said on Tuesday he has been building up a stake in U.S. government debt even with the potential of an interest rate hike as early as July.",
        "date": "06142016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's Rieder buying U.S. Treasuries despite rate risks "
    },
    {
        "content": "June 15 BlackRock Inc is introducing its first U.S.-listed exchange-traded fund providing access to mainland Chinese markets  the world's largest asset manager said on Wednesday.",
        "date": "06152016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock debuts U.S. ETF for China-listed stock after MSCI snub "
    },
    {
        "content": "NEW YORK If Britain votes to leave the European Union next week the decision could accelerate the rise of populist political parties across the continent  a top executive at BlackRock   the world's largest money manager  said on Friday.",
        "date": "06172016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Brexit could boost Europe's populist politicians: BlackRock executive "
    },
    {
        "content": "NEW YORK  June 17 If Britain votes to leave the European Union next week the decision could accelerate the rise of populist political parties across the continent  a top executive at BlackRock  the world's largest money manager  said on Friday.",
        "date": "06172016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "REUTERS SUMMIT-Brexit could boost Europe's populist politicians -BlackRock executive "
    },
    {
        "content": "June 7 Oilfield services company Seventy Seven Energy Inc filed for a prepackaged Chapter 11 bankruptcy on Tuesday to carry out a plan to convert $1.1 billion of its debt into equity in a reorganized company.",
        "date": "06072016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Oilfield service firm Seventy Seven Energy files for bankruptcy "
    },
    {
        "content": "LONDON Rock-bottom interest rates  with some $10 trillion of sovereign bonds carrying negative yields  are fast becoming the biggest worry for investors  asset manager Blackrock said on Thursday.",
        "date": "06092016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Negative interest rates 'really starting to bite' - Blackrock "
    },
    {
        "content": "* Qatar Investment Authority to acquire landmark asia Square Tower in the heart of Singapore's new CBD from Blackrock",
        "date": "06062016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Qatar Investment Authority to acquire Asia Square Tower 1 in Singapore "
    },
    {
        "content": "June 7 Oilfield services company Seventy Seven Energy Inc filed for a prepackaged Chapter 11 bankruptcy on Tuesday to carry out a plan to convert $1.1 billion of its debt into equity in a reorganized company.",
        "date": "06072016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Oilfield service firm Seventy Seven Energy files for bankruptcy "
    },
    {
        "content": "LONDON  June 9 Rock-bottom interest rates  with some $10 trillion of sovereign bonds carrying negative yields  are fast becoming the biggest worry for investors  asset manager Blackrock said on Thursday.",
        "date": "06092016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Negative interest rates \"really starting to bite\" -Blackrock "
    },
    {
        "content": "SINGAPORE BlackRock Inc  said it would sell a 43-storey Singapore office tower for $2.5 billion - one of at least three office building deals in the last two months for a market gripped by worries about oversupply and rising vacancies.",
        "date": "06062016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's $2.5 billion sale: a sign of life for Singapore's office market "
    },
    {
        "content": "* BlackRock says deal may be turning point for Singapore market",
        "date": "06062016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-BlackRock's $2.5 bln sale - a sign of life for Singapore's office market "
    },
    {
        "content": "SINGAPORE  June 6 BlackRock Inc has agreed to sell a 43-storey office building in Singapore to Qatar Investment Authority  a sovereign wealth fund  for S$3.4 billion ($2.45 billion)  in what the U.S. firm said was the largest-ever single-tower real estate deal in the Asia-Pacific region.",
        "date": "06062016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock agrees to sell Singapore office tower to Qatar fund for $2.5 bln "
    },
    {
        "content": "NEW YORK  May 31 BlackRock Inc Chief Executive Laurence Fink on Tuesday said he is \"nervous\" about Europe ahead of a June referendum on whether Britain should remain in European Union  the region's multinational governance bloc.",
        "date": "05312016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO says he is 'nervous' about Europe ahead of Brexit vote "
    },
    {
        "content": "NEW YORK  May 31 BlackRock Inc Chief Executive Laurence Fink on Tuesday said he was \"nervous\" about Europe ahead of a June referendum on whether Britain should remain in European Union.",
        "date": "05312016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock CEO says he is 'nervous' about Europe ahead of Brexit vote "
    },
    {
        "content": "NEW YORK  May 31 BlackRock Inc on Tuesday said it was downgrading its outlook on U.S. and European stocks as a mid-year interest-rate hike by the U.S. Federal Reserve looks more likely.",
        "date": "05312016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock lowers outlook for U.S.  European stocks "
    },
    {
        "content": "May 27 The following financial services industry appointments were announced on Friday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "05272016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "MOVES- BlackRock  Barclays  Amundi "
    },
    {
        "content": "NEW YORK  May 26 Daniel Gamba  a senior iShares executive who helped broaden the market for exchange-traded funds at parent company BlackRock Inc  is to move to the stock picking side of the business  according to a memo seen by Reuters.",
        "date": "05272016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "MOVES-BlackRock moving longtime ETF sales executive to stock-picking business "
    },
    {
        "content": "* Blackrock declares quarterly dividend of $2.29 on common stock  Source text for Eikon:  Further company coverage:",
        "date": "05252016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock says quarterly dividend of $2.29 on common stock "
    },
    {
        "content": "NEW YORK A strategist for BlackRock Inc's largest mutual fund said on Friday his fund is finding bargains among Japanese stocks despite their weak performance this year and concerns over the direction of the yen.",
        "date": "05202016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's largest mutual fund favors Japan despite yen concerns "
    },
    {
        "content": " ",
        "date": "05202016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock  Deutsche Bank  Credit Suisse "
    },
    {
        "content": "* Some investors say National Stock Exchange dragging feet on IPO",
        "date": "05202016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Some foreign investors target India's top bourse in rare shareholder backlash "
    },
    {
        "content": "OSLO  May 18 A Norwegian group of climate scientists will form an alliance on Thursday with investors including BlackRock Inc and the World Bank to try to assess the financial risks of rising global temperatures.",
        "date": "05182016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Scientists  investors seek to identify financial risks of climate change "
    },
    {
        "content": "* \"We see consumption driving Eurozone economic growth in short term  supporting European stocks and other risk assets\"",
        "date": "05162016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock's Richard Turnill says growth and easy monetary policy bode well for European risk assets in short term "
    },
    {
        "content": "May 16 BlackRock Inc named Takeshi Fukushima managing director and chief investment officer of BlackRock Japan  effective immediately.",
        "date": "05162016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "MOVES-BlackRock names Takeshi Fukushima CIO in Japan "
    },
    {
        "content": "TORONTO/NEW YORK BlackRock Inc  the world's largest asset manager  has recruited the head of Canada's biggest public pension fund to become the top executive overseeing its stock-picking operations.",
        "date": "05192016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock nabs Canada pension chief Wiseman for senior role "
    },
    {
        "content": "May 17 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "05172016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "MOVES- Deutsche Bank  BlackRock  Goldman Sachs "
    },
    {
        "content": "NEW YORK  May 13 A top BlackRock Inc  strategist said on Friday that the world's largest asset manager is lowering its forecast on the performance of U.S. government debt as dovish market expectations may have \"gone too far.\"",
        "date": "05132016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock lowers forecast for Treasury bonds "
    },
    {
        "content": "* Machin says strategy to remain unchanged   (Adds comment from Wiseman  Machin)",
        "date": "05192016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 4-BlackRock nabs Canada pension chief Wiseman for senior role "
    },
    {
        "content": "May 17 Investment management firm BlackRock Inc  appointed Justin Ferrier managing director of its Asian private credit platform  effective June 13.",
        "date": "05172016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "MOVES-BlackRock appoints Justin Ferrier managing director "
    },
    {
        "content": "HONG KONG  May 17 China needs to be more aggressive in its reforms if it wants to smoothly transition from an export-oriented economy to a services-driven one  the head of BlackRock Inc.  the world's biggest asset manager  said on Tuesday.",
        "date": "05172016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Fink says China needs more aggressive reforms "
    },
    {
        "content": "* Blackrock's Ishares business says projects that smart beta ETF assets will reach $1 trillion globally by 2020 and $2.4 trillion by 2025  Source text for Eikon:  Further company coverage:",
        "date": "05122016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock projects Smart Beta ETF assets to reach $1 trillion globally by 2020 "
    },
    {
        "content": "* Wiseman will become head of BlackRock's global active equity business and will become chairman of BlackRock global investment committee",
        "date": "05192016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock hires Mark Wiseman as a senior investment leader "
    },
    {
        "content": "* BlackRock's Fink says China struggling with excessive leverage",
        "date": "05172016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock's Fink says China needs more aggressive reforms "
    },
    {
        "content": "HONG KONG Investors are facing major challenges in assessing cyber security risks because companies are wary of disclosing breaches fearing they could make them more vulnerable  according to BlackRock's  head of investment stewardship for Asia Pacific.",
        "date": "05192016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock sees big challenges for investors  boards on cyber risks "
    },
    {
        "content": "FRANKFURT  May 11 A consultancy owned by the world's biggest investor  BlackRock  will help the European Central Bank in its stress test of top banks  the two organisations said on Wednesday.",
        "date": "05112016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock helps ECB in bank stress test "
    },
    {
        "content": "NEW YORK A top bond manager at BlackRock   the world's biggest asset manager  said on Friday he does not expect the Federal Reserve to raise U.S. interest rates more than once in 2016 following a disappointing April payrolls report.",
        "date": "05062016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock sees no more than one U.S. rate hike in 2016 "
    },
    {
        "content": "LONDON  May 10 (IFR) - Joppe Schepers has joined BlackRock's Financial Markets Advisory (FMA) business in London as a domain expert in its balance sheet and capital management practice  according to a company spokesperson.",
        "date": "05102016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "MOVES-Schepers joins BlackRock Financial Markets Advisory unit "
    },
    {
        "content": "NEW YORK BlackRock Inc is accelerating its push in Latin America  making plans for its first launch of a private equity infrastructure fund targeting that market  a company document showed.",
        "date": "05092016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Exclusive: BlackRock targets 2016 launch for LatAm infrastructure fund - document "
    },
    {
        "content": "HONG KONG  May 19 Investors are facing major challenges in assessing cyber security risks because companies are wary of disclosing breaches fearing they could make them more vulnerable  according to BlackRock's head of investment stewardship for Asia Pacific.",
        "date": "05192016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "REUTERS SUMMIT-BlackRock sees big challenges for investors  boards on cyber risks "
    },
    {
        "content": "LONDON  May 9 A senior figure at the world's biggest asset manager said on Monday that Britain going it alone outside the European Union would be devastating for the City of London as a global financial centre and endanger jobs.",
        "date": "05092016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Hildebrand says UK would suffer under a Brexit "
    },
    {
        "content": "* Blackrock  Inc.'s indirect holding in Nokian Tyres shares has gone above threshold of 5% of share capital as a result of a share transactions concluded on 2 May 2016",
        "date": "05042016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Nokian Tyres says Blackrock's holding rose to 5.2 pct "
    },
    {
        "content": "* Aegon to acquire Blackrock's UK Defined Contribution platform and administration business",
        "date": "05032016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Aegon to acquire Blackrock's UK Defined Contribution platform and administration business "
    },
    {
        "content": "NEW YORK A BlackRock Inc managing director and portfolio manager has relinquished his role leading several debt funds to \"pursue other interests \" according to an internal memo seen by Reuters on Thursday.",
        "date": "04292016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock bank loan fund manager stepping down: memo "
    },
    {
        "content": "LONDON BlackRock   the world's biggest asset manager  on Tuesday said it had agreed to sell its defined contribution pension platform and administration business to Dutch insurer Aegon  for an undisclosed amount.",
        "date": "05032016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Aegon to buy BlackRock's UK pension platform  admin business "
    },
    {
        "content": "SAO PAULO  April 25 Oi SA on Monday formally started talks to restructure $14.3 billion of bonds  pitting some of the world's biggest investors against each other as Brazil's most-indebted phone carrier fights for its survival.",
        "date": "04252016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-Brazil's Oi starts $14.3 billion bond restructuring talks "
    },
    {
        "content": "* Blackrock closes transaction to transfer $80 billion of client assets from BofA\u007f Global Capital Management",
        "date": "04182016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock closes $80 bln client assets transfer from BofA Global Capital Management "
    },
    {
        "content": "* Investment fund BlackRock trims its stake in the Italian group to 4.97 percent from a previous 5 Percent holding according to a filing by Italian market watchdog Consob    Further company coverage:    (Reporting by Milan newsroom)",
        "date": "04192016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock trims stake in Enel to 4.97 pct - filing "
    },
    {
        "content": "* On april 8  2016  entered into amendment no. 5 to its five-year revolving credit agreement  dated as of march 10  2011",
        "date": "04142016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock enters into amendment No. 5 to its five-year revolving credit agreement  dated as of March 10  2011 "
    },
    {
        "content": "BlackRock Inc  said on Thursday it will cut 400 jobs and take a $76 million restructuring charge after posting a 20 percent drop in first-quarter profit amid a dramatic reversal in financial markets.",
        "date": "04142016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock to restructure after 'tough' first quarter "
    },
    {
        "content": "April 14 BlackRock Inc said on Thursday it will cut 400 jobs and take a $76 million restructuring charge after posting a 20 percent drop in first-quarter profit amid a dramatic reversal in financial markets.",
        "date": "04142016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 4-BlackRock to restructure after 'tough' 1st quarter "
    },
    {
        "content": "NEW YORK BlackRock Inc  Chief Executive Officer Larry Fink said  that a restructuring announced on Thursday will allow the company to focus on growing areas  including sustainable investing.",
        "date": "04142016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock restructuring allows company to invest in core areas: CEO "
    },
    {
        "content": "NEW YORK  April 11 A new U.S. rule protecting retirement funds from commission-paid brokers could be good for roboadvisers  a fast-growing sector that manages money with algorithms who may collect new clients fired by other firms because their accounts are too small.",
        "date": "04112016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Roboadvisers set to capitalize under new U.S. retirement plan rule "
    },
    {
        "content": "NEW YORK  April 13 LPL Financial Holdings  said on Wednesday it will use BlackRock Inc  technology to provide a digital platform  called a robo-adviser  which can automatically build investor portfolios online based on a series of questions.",
        "date": "04132016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "LPL Financial to offer 'robo-adviser' using BlackRock technology "
    },
    {
        "content": "NEW YORK  April 14 BlackRock Inc Chief Executive Officer Larry Fink said on Thursday that his company missed earnings expectations as Wall Street analysts were \"anticipating higher performance fees\" on hedge funds.",
        "date": "04142016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Lower hedge fund performance fees hurt BlackRock results-CEO "
    },
    {
        "content": "NEW YORK  April 14 BlackRock Chief Executive Larry Fink said on Thursday that his company missed earnings expectations as Wall Street analysts were \"anticipating higher performance fees\" on hedge funds.",
        "date": "04142016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Lower hedge fund performance fees hurt results -BlackRock CEO "
    },
    {
        "content": "NEW YORK Exchange-traded funds that hold bonds took in record cash globally and in the United States during the first quarter  BlackRock Inc data showed on Wednesday.",
        "date": "04062016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Bond ETFs attract record money in first quarter: BlackRock "
    },
    {
        "content": "LONDON (The opinions expressed here are those of the author  a columnist for Reuters.) Do you remember JPMorgan's Physical Copper Trust?",
        "date": "04132016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Investment in copper  a boom and bust cycle of a different kind: Andy Home "
    },
    {
        "content": "* Term net inflows in q1 versus. $70.4 billion of long-term net inflows in q1 last year",
        "date": "04142016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock Q1 shr $3.92 vs est $4.29 "
    },
    {
        "content": "LONDON  April 12 Do you remember JPMorgan's Physical Copper Trust?",
        "date": "04132016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "RPT-COLUMN-Investment in copper  a boom and bust cycle of a different kind: Andy Home "
    },
    {
        "content": "April 14 BlackRock Inc  the world's largest asset manager  said on Thursday its profit fell about 20 percent during a first quarter that featured a dramatic reversal for markets.",
        "date": "04142016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock quarterly profit falls 20 pct "
    },
    {
        "content": "LONDON/LISBON  April 5 A group of 14 asset managers have started legal action against the Portuguese Central Bank over heavy losses on nearly 2 billion euros ($2.3 billion) of bonds in Novo Banco  the bank created from the remains of Banco Espirito Santo  court documents showed.",
        "date": "04052016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Fund firms sue Portugal's central bank over Novo Banco debt "
    },
    {
        "content": "NEW YORK  April 1 The U.S. Federal Reserve will not raise short-term interest rates more than twice  if at all  in 2016  on expectations of slowing hiring in the second half of the year  a top bond manager at BlackRock  the world's top asset manager said on Friday.",
        "date": "04012016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock sees no more than 2 U.S. rate hikes in 2016 "
    },
    {
        "content": "March 31 Asset manager Schroders Plc  said it appointed Courtney Waterman as head of Europe  Middle East and Africa (EMEA) marketing.",
        "date": "03312016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "MOVES-Schroders appoints BlackRock's Courtney Waterman "
    },
    {
        "content": "Global asset manager BlackRock Inc  is planning to cut about 400 jobs  or 3 percent of its workforce  as it redirects resources to growth areas  a person familiar with the matter said on Wednesday.",
        "date": "03302016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock planning to cut 400 jobs: source "
    },
    {
        "content": "March 30 Global asset manager BlackRock Inc  is planning to cut about 400 jobs  or 3 percent of its workforce  as it redirects resources to growth areas  a person familiar with the matter said on Wednesday.",
        "date": "03302016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-BlackRock planning to cut 400 jobs -source "
    },
    {
        "content": "March 30 BlackRock Inc  the world's largest asset manager  is planning to cut about 400 jobs  or 3 percent of its workforce  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "03302016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock planning to cut 400 jobs - Bloomberg "
    },
    {
        "content": "March 16 BlackRock Inc's $1.9 billion Obsidian hedge fund posted a negative 7.5 percent year-to-date return through March 4  HSBC data showed.",
        "date": "03162016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Obsidian fund extends losses this year "
    },
    {
        "content": "NEW YORK  March 15 A BlackRock Inc bond strategist is backing away from a \"defensive\" stance on U.S. government debt markets by removing a strategic recommendation to buy short-term U.S. Treasuries  according to a commentary posted online on Tuesday.",
        "date": "03152016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock bond strategist now neutral on U.S. Treasury debt "
    },
    {
        "content": "March 15 BlackRock Inc  the world's largest asset manager said it has sold all its investments in the real estate business in Poland and will close its Warsaw office effective May 31.",
        "date": "03152016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock to exit real estate business in Poland "
    },
    {
        "content": "NEW YORK Russ Koesterich  who was BlackRock Inc's  global chief investment strategist  has left that role and is joining the team responsible for the $47 billion BlackRock Global Allocation Fund   according to an internal memo.",
        "date": "03172016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Prominent BlackRock strategist Koesterich moving to new role: memo "
    },
    {
        "content": "NEW YORK  March 17 A BlackRock Inc  portfolio manager said Thursday that he continues to see value in emerging-market bonds from Asia to Latin America a day after the Federal Reserve left rates unchanged and acknowledged global economic risks.",
        "date": "03172016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock investor sees value in emerging markets after Fed decision "
    },
    {
        "content": "NEW YORK BlackRock Inc   the world's largest asset manager  raised total compensation for Chairman and Chief Executive Larry Fink by about 8 percent in 2015  according to a filing on Friday.",
        "date": "03182016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's Larry Fink paid nearly $26 million in 2015 "
    },
    {
        "content": "NEW YORK  March 9 BlackRock Inc's chief investment officer of global fixed income Rick Rieder said Wednesday his team cut a February position they held shorting  or betting against  the U.S. dollar while betting on Japanese yen appreciation.",
        "date": "03092016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's Rieder \"reversed\" trade that shorted dollar while favoring yen "
    },
    {
        "content": "NEW YORK  March 18 BlackRock Inc  the world's largest asset manager  raised total compensation for Chairman and Chief Executive Larry Fink by about 8 percent in 2015  according to a filing on Friday.",
        "date": "03182016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-BlackRock's Larry Fink paid nearly $26 million in 2015 "
    },
    {
        "content": "ACAPULCO  Mexico BlackRock Inc Chief Executive Officer Larry Fink said on Friday that China may be the biggest hurdle to global financial markets and that central bankers are adding to risks with negative-interest rate policies.",
        "date": "03112016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock CEO Fink sees risks in China  negative rates "
    },
    {
        "content": "NEW YORK Stocks \"can go up five  10 percent  maybe\" despite a slowing U.S. economy  BlackRock Inc's chief investment officer of global fixed income Rick Rieder said on Tuesday.",
        "date": "03082016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Stocks  junk bonds could gain despite slowing U.S. growth: BlackRock's Rieder "
    },
    {
        "content": "* CFO Gary S. Shedlin  total compensation of $6.09 million in 2015 versus $5.58 million \u007f\u007fin 2014",
        "date": "03182016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock Inc announces 2015 total compensation of senior management "
    },
    {
        "content": "March 18 BlackRock Inc  the world's largest asset manager  raised the total compensation for Chairman and Chief Executive Larry Fink by about 8 percent in 2015.",
        "date": "03182016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Larry Fink gets 8 pct pay hike "
    },
    {
        "content": "ACAPULCO  Mexico  March 11 BlackRock Inc  Chief Executive Officer Larry Fink said on Friday that China may be the biggest hurdle to global financial markets and that central bankers are adding to risks with negative-interest rate policies.",
        "date": "03112016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock CEO Fink sees risks in China  negative rates "
    },
    {
        "content": "NEW YORK  March 8 Stocks \"can go up five  ten percent  maybe\" despite a slowing U.S. economy  BlackRock Inc's  chief investment officer of global fixed income Rick Rieder said on Tuesday.",
        "date": "03082016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Stocks  junk bonds could gain despite slowing U.S. growth -BlackRock's Rieder "
    },
    {
        "content": "NEW YORK  March 18 A top BlackRock Inc  fund manager said his team cut its exposure to preferred stocks to a \"historical\" low of 5 percent on fears that market volatility could spill into the asset class.",
        "date": "03182016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock income fund manager slices preferred stocks on volatility fear "
    },
    {
        "content": "ACAPULCO  Mexico  March 11 BlackRock Inc  Chief Executive Officer Larry Fink said on  Friday that it is hard for him to see oil prices above $60 or below $30 per barrel for a while.",
        "date": "03112016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock CEO Fink says sees oil prices stuck in range "
    },
    {
        "content": "NEW YORK BlackRock Inc's iShares Gold Trust may face penalties and other costs after the U.S.-listed fund sold $296 million in shares earlier this year without properly registering them  the company said in a filing on Monday with the U.S. Securities and Exchange Commission.",
        "date": "03072016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock gold fund may face penalties over unregistered share issue "
    },
    {
        "content": "NEW YORK BlackRock Inc said on Friday it had suspended the  issuing of shares in its physically backed gold exchange traded product due to a historic surge in buying as global economic uncertainty rekindled bullion's safe-haven appeal among investors.",
        "date": "03042016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock stops issuing shares in physical gold trust  citing demand "
    },
    {
        "content": "HONG KONG  March 8 Following a rare public campaign  BlackRock Inc voted against a deal planned by a Hong Kong firm that the world's biggest asset manager partly owns  revving up investor activism in Asia after it roared ahead in 2015.",
        "date": "03082016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Who's next? Asia investor activism set to grow after BlackRock public campaign "
    },
    {
        "content": "NEW YORK  March 7 BlackRock Inc's  iShares Gold Trust may face penalties and other costs after the U.S.-listed fund sold $296 million in shares earlier this year without properly registering them  the company said in a filing on Monday with the U.S. Securities and Exchange Commission.",
        "date": "03072016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 3-BlackRock gold fund may face penalties over unregistered share issue "
    },
    {
        "content": "NEW YORK  March 4 BlackRock Inc said on Friday it had suspended the  issuing of shares in its physically backed gold exchange traded product due to a historic surge in buying as global economic uncertainty rekindled bullion's safe-haven appeal among investors.",
        "date": "03042016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock stops issuing shares in physical gold trust  citing demand "
    },
    {
        "content": "* BlackRock campaign fails  but overall success rates rising   (Adds result of vote paragraph 3)",
        "date": "03082016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Who's next? Asia investor activism set to grow after BlackRock public campaign "
    },
    {
        "content": "TAIPEI A battle among brothers for control of one of Taiwan's biggest conglomerates boiled over into the public domain last week when EVA Airways ejected its chairman. Now investors in a rising star among Asian airlines fear they  too  may get burned.",
        "date": "03182016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "At 'Hello Kitty' airline EVA  investors fret after chief ousted in family feud "
    },
    {
        "content": "NEW YORK  March 7 BlackRock Inc's  iShares Gold Trust may face penalties and other costs after the U.S.-listed fund sold $296 million in shares earlier this year without properly registering them  the company said in a filing on Monday with the U.S. Securities and Exchange Commission.",
        "date": "03072016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "CORRECTED-UPDATE 1-BlackRock gold fund may face penalties over unregistered share issue "
    },
    {
        "content": "NEW YORK  March 7 BlackRock issued 25 million shares of the iShares Gold Trust before they were officially registered with securities regulators  and the fund \"may become subject to penalties\" by securities regulators  the fund manager said in a regulatory filing Monday.",
        "date": "03072016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock gold ETP may become subject to regulatory penalties -filing "
    },
    {
        "content": "March 7 BlackRock Inc said on Monday it had resumed issuing shares in its physically backed gold exchange traded fund (ETF) after it was suspended on Friday amid high demand.",
        "date": "03072016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock resumes issuing new shares in gold ETF "
    },
    {
        "content": "Feb 18 Wall Street banks are ramping up businesses that trade exchange-traded funds full of bonds  a bright spot of growth at an otherwise bleak time for trading but one that may carry unappreciated risk.",
        "date": "02182016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Banks build ETF businesses as growth stalls in bond trading "
    },
    {
        "content": "LONDON  Feb 19 The world's biggest asset manager  BlackRock  has gone overweight emerging local currency bonds within its emerging market debt strategies for the first time in three years  predicting double-digit returns this year from the sector.",
        "date": "02192016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock upbeat on emerging currency debt for first time in 3 years "
    },
    {
        "content": "NEW YORK  Feb 17 A top portfolio manager at BlackRock Inc said his fund recently added exposure to European junk bonds  adding that \"widespread pessimism\" in markets has created new investment opportunities.",
        "date": "02172016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Top BlackRock fund manager buys more European junk bonds "
    },
    {
        "content": "LONDON  Feb 15 BlackRock  the world's biggest asset manager  says there is no need for a stress test of whether the mutual fund industry could repay a large number of panicking investors in the event of a fresh financial crisis.",
        "date": "02152016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock says no need to stress test mutual fund sector "
    },
    {
        "content": "BlackRock Inc's $1.9 billion Obsidian hedge fund recorded losses in January  suffering its worst start to the year in its nearly 20-year history  but the fund was narrowing those losses so far in February.",
        "date": "02122016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's Obsidian fund narrows losses after horrid January "
    },
    {
        "content": "Feb 12 BlackRock Inc's $1.9 billion Obsidian hedge fund recorded losses in January  suffering its worst start to the year in its nearly 20-year history  but the fund was narrowing those losses so far in February.",
        "date": "02122016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock's Obsidian fund narrows losses after horrid January "
    },
    {
        "content": "Feb 12 BlackRock Inc's $1.9 billion Obsidian hedge fund recorded losses in January  suffering its worst start to the year in its nearly 20-year history  but the fund was narrowing those losses so far in February.",
        "date": "02122016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Obsidian fund has worst Jan in 20 yrs  Feb looks better "
    },
    {
        "content": "NEW YORK BlackRock Inc's chief strategist for fixed income said on Thursday his unit is shifting its approach to bond markets on new expectations that the U.S. Federal Reserve may need to loosen monetary policy.",
        "date": "02112016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Reduced expectations of Fed hike shift bond strategy: BlackRock "
    },
    {
        "content": "NEW YORK  Feb 11 BlackRock Inc's chief strategist for fixed income said on Thursday his unit is shifting its approach to bond markets on new expectations that the U.S. Federal Reserve may need to loosen monetary policy.",
        "date": "02112016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Reduced expectations of Fed hike shift bond strategy -BlackRock "
    },
    {
        "content": "NEW YORK  Feb 11 BlackRock Inc 's chief strategist for fixed income on Thursday said his company favors the short-end of the yield curve given the possibility the Federal Reserve might delay increasing U.S. policy rates or even move to negative rates.",
        "date": "02112016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Reduced expectations of Fed hike shift bond strategy -BlackRock "
    },
    {
        "content": "LONDON  Feb 11 (IFR) - BlackRock had to widen spreads and jettison a tranche to finally clear its debut European CLO on Tuesday  the most obvious sign yet that the underlying economics of the asset class are close to breaking point.",
        "date": "02112016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's rocky debut highlights cracks emerging in euro CLOs "
    },
    {
        "content": "Feb 2 BlackRock Inc's Larry Fink wants chief executives of top U.S. companies to focus on creating long-term value instead of emphasizing quarterly targets.",
        "date": "02022016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Think long term - Larry Fink's message to CEOs "
    },
    {
        "content": "NEW YORK  Jan 29 BlackRock Inc said on Friday it will change the benchmarks on four iShares Treasury exchange-traded funds (ETFs) from Barclays' Treasury bond indexes to ICE's Treasury bond indexes  effective on or after March 31.",
        "date": "01292016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock switches benchmarks on U.S. bond ETFs "
    },
    {
        "content": "NEW YORK  Jan 29 BlackRock Inc said on Friday it will change the benchmarks on four iShares Treasury exchange-traded funds (ETFs) from Barclays' Treasury bond indexes to ICE's Treasury bond indexes  effective on or after March 31.",
        "date": "01292016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-BlackRock switches benchmarks on U.S. bond ETFs "
    },
    {
        "content": "* BlackRock had 5.3 percent stake in Popolare di Milano as of Jan. 14 - regulatory filing   Further company coverage:    (Reporting by Milan Newsroom)",
        "date": "01222016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock had 5.3 pct of Popolare di Milano as of Jan. 14 "
    },
    {
        "content": "LONDON  Jan 22 BlackRock has hired the former co-head of asset management at the UK Treasury  Jonathan Gee  to join its government relations team  a company spokesman said.",
        "date": "01222016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "MOVES-BlackRock hires former co-head of UK Treasury funds team "
    },
    {
        "content": "JERUSALEM  Jan 20 BlackRock  the world's largest money manager  said on Wednesday it had launched an exchange traded fund (ETF) for European investors to invest directly in Israel's blue-chip share index  the Tel Aviv 25 .",
        "date": "01202016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock launches fund for European investment in Tel Aviv blue chips "
    },
    {
        "content": "JERUSALEM  Jan 20 BlackRock  the world's largest money manager  said on Wednesday it had launched an exchange-traded fund (ETF) for European investors to invest directly in Israel's blue-chip share index  the Tel Aviv 25 .",
        "date": "01202016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock launches fund for European investment in Tel Aviv blue chips "
    },
    {
        "content": "Investors drove $54 billion into BlackRock Inc funds during a weak and turbulent fourth quarter for financial markets  driving profits higher  but the company nonetheless missed Wall Street analysts' forecasts.",
        "date": "01152016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock reels in billions but profits miss expectations "
    },
    {
        "content": "Jan 15 Investors drove $54 billion into BlackRock Inc funds during a weak and turbulent fourth quarter for financial markets  driving profits higher  but the company nonetheless missed Wall Street analysts' forecasts.",
        "date": "01152016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 4-BlackRock reels in billions but profits miss expectations "
    },
    {
        "content": "Jan 15 BlackRock Inc  the world's largest asset manager  said on Friday its profit rose about 6 percent in a turbulent fourth quarter for investors.",
        "date": "01152016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock quarterly profit rises 6 pct "
    },
    {
        "content": "NEW YORK BlackRock Inc on Tuesday informed staff that it was reshuffling the managers of some of its most important investment units  including its stock and bond-picking businesses  according to an internal memo seen by Reuters.",
        "date": "01122016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock reshuffles senior leadership of investment teams: memo "
    },
    {
        "content": "NEW YORK  Jan 12 BlackRock Inc on Tuesday informed staff that it was reshuffling the managers of some of its most important investment units  including its stock and bond-picking businesses  according to an internal memo seen by Reuters.",
        "date": "01122016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock reshuffles senior leadership of investment teams -memo "
    },
    {
        "content": "NEW YORK  Jan 12 BlackRock Inc on Tuesday said it reshuffled the managers of some of its most important investment units  including its stock and bond picking businesses  according to a memo seen by Reuters.",
        "date": "01122016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock reshuffles senior leadership of investment teams "
    },
    {
        "content": "Jan 12 BBVA Compass  a unit of Spain's BBVA group  said it signed an agreement with BlackRock Inc's  \"robo-adviser\"  FutureAdvisor  to help expand its automated investment advisory services.",
        "date": "01122016",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BBVA Compass signs pact with BlackRock's robo-adviser "
    },
    {
        "content": "NEW YORK  Jan 3 Investors poured $347 billion into exchange-traded funds globally during 2015  fund manager BlackRock Inc said on  Sunday  setting a new record for the industry.",
        "date": "01042016",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Global ETF industry grabs record cash in 2015 -BlackRock "
    },
    {
        "content": "KUALA LUMPUR  Dec 30 BlackRock  the world's largest asset manager  said on Wednesday it has sold a luxury shopping mall in central Kuala Lumpur to Malaysia's Pavilion Real Estate Investment Trust (Pavilion REIT) for 160 million ringgit ($37.33 million).",
        "date": "12302015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock sells Kuala Lumpur mall to Malaysia's Pavilion "
    },
    {
        "content": "NEW YORK  Dec 22 As the U.S. dollar strengthened throughout 2015  managers of currency-hedging exchange-traded funds had a banner year - they collected one of every four dollars invested in U.S. ETFs and rewarded their investors well.",
        "date": "12222015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "ETF issuers with currency-hedged ETFs ride high on strong dollar "
    },
    {
        "content": "NEW YORK  Dec 17 A top bond manager at BlackRock Inc said he still sees value in the erratic junk-bond market  including in Europe and in the debt of companies focused on consumer goods and services.",
        "date": "12172015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Rieder sees value in high-yield debt despite rate hike "
    },
    {
        "content": "NEW YORK The U.S. Federal Reserve will likely raise interest rates twice in 2016 following the first rate hike in nearly a decade on Wednesday  said a top bond manager at BlackRock  the world's biggest asset manager.",
        "date": "12172015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Rieder sees 2 U.S. rate hikes in 2016 "
    },
    {
        "content": "NEW YORK  Dec 16 The U.S. Federal Reserve will likely raise interest rates twice in 2016 following the first rate hike in nearly a decade on Wednesday  said a top bond manager at BlackRock  the world's biggest asset manager.",
        "date": "12162015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Rieder sees 2 U.S. rate hikes in 2016 "
    },
    {
        "content": "NEW YORK  Dec 16 A group of 24 investment management firms  including BlackRock Inc  Pimco and Eaton Vance  will begin clearing certain credit default swaps in an effort to revive a flagging part of the market used to hedge risk  several trade groups said on Wednesday.",
        "date": "12162015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock  Pimco among group to begin clearing credit swaps "
    },
    {
        "content": "NEW YORK  Dec 14 The tax-free treatment of the spin-offs Dow Chemical Co and DuPont plan to carry out after they merge their businesses is a prime driver of the deal  potentially saving tens of billions of dollars  industry experts said.",
        "date": "12152015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "CORRECTED-Dow  DuPont eye big tax savings in rare merger of equals "
    },
    {
        "content": "Dec 11 Shareholders of financial services provider Towers Watson & Co and insurance broker Willis Group Holdings voted to approve their merger  the companies said in a joint statement.",
        "date": "12112015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-Towers Watson  Willis merger gets shareholder nod "
    },
    {
        "content": "BOSTON The blow-up of Third Avenue Management's junk bond fund this week  the biggest mutual fund failure since the financial crisis  show the dangers of loading up on risky assets that are hard to trade even in good times.",
        "date": "12112015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Third Avenue junk fund blowup exposes risks of unsellable assets "
    },
    {
        "content": "LONDON Rob Leach  former head of EMEA capital markets at BlackRock   is to lead European ECM at Jefferies [JGLL.UL] as the U.S. firm shakes up its investment banking teams  two sources familiar with the matter said on Friday.",
        "date": "12042015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's Rob Leach to join Jefferies as European ECM head: sources "
    },
    {
        "content": "LONDON  Dec 4 Rob Leach  former head of EMEA capital markets at BlackRock  is to lead European ECM at Jefferies as the U.S. firm shakes up its investment banking teams  two sources familiar with the matter said on Friday.",
        "date": "12042015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Rob Leach to join Jefferies as European ECM head - sources "
    },
    {
        "content": "LONDON Mining companies will be forced to post a new wave of writedowns and dividend cuts due to the slide in metals prices  an executive from the world's biggest fund manager said on Tuesday.",
        "date": "12012015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "More big writedowns seen in mining sector: Blackrock "
    },
    {
        "content": "LONDON  Dec 1 Mining companies will be forced to post a new wave of writedowns and dividend cuts due to the slide in metals prices  an executive from the world's biggest fund manager said on Tuesday.",
        "date": "12012015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "More big writedowns seen in mining sector-Blackrock "
    },
    {
        "content": "BlackRock Inc's  top investment strategist said on Monday his team prefers debt protected against rising inflation to traditional U.S. Treasuries  given a market that has grown \"too sanguine\" about the potential for rising prices.",
        "date": "11302015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "U.S. inflation expectations are 'unrealistically low': BlackRock's Koesterich "
    },
    {
        "content": "Nov 30 BlackRock Inc's top investment strategist said on Monday his team prefers debt protected against rising inflation to traditional U.S. Treasuries  given a market that has grown \"too sanguine\" about the potential for rising prices.",
        "date": "11302015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "U.S. inflation expectations are 'unrealistically low' - BlackRock's Koesterich "
    },
    {
        "content": "NEW YORK  Nov 24 BlackRock Inc has decided to sell four private-equity portfolios with a value of approximately $200 million  according to a person with knowledge of the investments said on Tuesday..",
        "date": "11242015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock selling $200 mln in private-equity portfolios "
    },
    {
        "content": "NEW YORK  Nov 18 BlackRock Inc is shutting down its Global Ascent Fund  a hedge fund  following a trying year for other similar investment strategies  the company said on Wednesday.",
        "date": "11182015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock closing global macro hedge fund "
    },
    {
        "content": "* Markets too complacent about long-term U.S. bond yield outlook",
        "date": "11192015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "INTERVIEW-BlackRock fund sells long-dated U.S. bonds as rate hike looms "
    },
    {
        "content": "* Adecco says that as of November 9  2015  Blackrock Inc held a participation in Adecco of below 5 percent.",
        "date": "11162015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock shareholding in Adecco falls below 5 percent "
    },
    {
        "content": "NEW YORK Top BlackRock Inc  portfolio manager Rick Rieder said on Tuesday that he still saw value in emerging markets and high-yield debt despite fears that a tighter U.S. monetary policy could trim prices further.",
        "date": "11172015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's Rieder sees value in emerging markets  high-yield "
    },
    {
        "content": "* For other news from Reuters Global Investment Outlook Summit  click on http://www.reuters.com/summit/Investment16   (Adds comments on interest rates  more details on emerging market debt)",
        "date": "11172015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "REUTERS SUMMIT-BlackRock's Rieder sees value in emerging markets  high-yield "
    },
    {
        "content": "* For other news from Reuters Global Investment Outlook Summit  click on http://www.reuters.com/summit/Investment16",
        "date": "11172015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "REUTERS SUMMIT-BlackRock's Rieder sees value in emerging markets  high yield "
    },
    {
        "content": "Nov 17 Italy's Atlantia:      * U.S. investment group BlackRock had 5.488 percent of the Italian motorway and airport operator as of Nov. 9  according to a regulatory filing published by Italian market watchdog Consob.",
        "date": "11172015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock had 5.5 pct stake in Atlantia as of Nov. 9 "
    },
    {
        "content": "ZURICH  Nov 17 The following are some of the main factors expected to affect Swiss stocks on Tuesday:",
        "date": "11172015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Swiss stocks - Factors to watch on Nov 17 "
    },
    {
        "content": "NEW YORK/BOSTON Nov 6 Three top U.S. asset managers shied away from supporting dissident directors in recent proxy contests  according to voting data  showing how corporate management teams can still depend on key players in the fund industry for backing in the face of an activist fight.",
        "date": "11062015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Top fund firms stay conservative in support for activists-report "
    },
    {
        "content": "NEW YORK BlackRock Inc Chief Executive Laurence Fink on Tuesday challenged a rival fund manager who criticized exchange-traded funds as \"not safe \" saying his counterpart at AllianceBernstein should \"learn more\" about them.",
        "date": "11032015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "AllianceBernstein CEO should 'learn more' about ETFs: BlackRock chief "
    },
    {
        "content": "NEW YORK  Nov 3 BlackRock Inc Chief Executive Laurence Fink on Tuesday challenged a rival fund manager who criticized exchange-traded funds as \"not safe \" saying his counterpart at AllianceBernstein should \"learn more\" about them.",
        "date": "11032015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "AllianceBernstein CEO should \"learn more\" about ETFs - BlackRock chief "
    },
    {
        "content": "NEW YORK Bank of America Corp  the No. 2 U.S. bank  has agreed to sell its $87 billion money-market fund business to BlackRock Inc in one of the cash-management industry's largest deals ever.",
        "date": "11032015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock to buy Bank of America's $87 billion money-market fund business "
    },
    {
        "content": "NEW YORK  Nov 3 Bank of America Corp  the No. 2 U.S. bank  has agreed to sell its $87 billion money-market fund business to BlackRock Inc in one of the cash-management industry's largest deals ever.",
        "date": "11032015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock to buy Bank of America's $87 bln money-market fund business "
    },
    {
        "content": "* Co and Bank Of America's asset management business  BOFA Global Capital Management have entered agreement",
        "date": "11032015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-Bank of America to sell $87 bln of investment management responsibilities to BlackRock "
    },
    {
        "content": "NEW YORK  Nov 3 Bank of America Corp  the No. 2 U.S. bank  has agreed to sell responsibility for about $87 billion in money-market funds and other products it manages to BlackRock Inc in one of the money market industry's largest deals ever.",
        "date": "11032015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Bank of America to sell $87 bln money-market fund business to BlackRock "
    },
    {
        "content": "LONDON  Nov 3 Philipp Hildebrand  vice chairman of the world's largest money manager BlackRock and former chairman of the Swiss central bank  is concerned the regulatory reform agenda for banks has gone too far and that the industry needs time to digest existing rules.",
        "date": "11032015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Hildebrand worries post-crisis regulatory rearmament has gone too far "
    },
    {
        "content": "ROME  Oct 23 U.S. investment firms BlackRock  and Fidelity as well as China's SAFE have bought shares in Poste Italiane  a source close to the matter said on Friday  a sign the stock market listing of Italy's post office drew foreign interest.",
        "date": "10232015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock  Fidelity and China's Safe bought into Poste IPO-source "
    },
    {
        "content": "NEW YORK Top BlackRock Inc bond fund manager Rick Rieder said he sees some European bonds as increasingly attractive after central bankers there disclosed they have weighed another interest rate cut.",
        "date": "10222015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's Rieder sees European bonds as attractive "
    },
    {
        "content": "NEW YORK  Oct 22 Top BlackRock Inc bond fund manager Rick Rieder said he sees some European bonds as increasingly attractive after central bankers there disclosed they have weighed another interest rate cut.",
        "date": "10222015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock's Rieder sees European bonds as attractive "
    },
    {
        "content": "LONDON  Oct 22 The Bank of England and international authorities are examining whether promises by funds to give investors their money back at any time could end up damaging liquidity in markets  a top BoE official said on Thursday.",
        "date": "10222015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-BoE's Cunliffe says fund redemptions could hurt market liquidity "
    },
    {
        "content": "NEW YORK Investors piled into BlackRock Inc bond ETFs and paid more in hedge fund fees in the third quarter  helping the world's largest asset manager beat Wall Street's earnings forecasts and offsetting a higher tax hit that cut profits 8 percent from a year earlier.",
        "date": "10152015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock profit falls in third quarter but tops expectations "
    },
    {
        "content": "NEW YORK  Oct 12 BlackRock Inc will launch a new mutual fund on Tuesday that targets clients who want to boost the social impact of their investments  not just their returns.",
        "date": "10132015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock plans new social-impact mutual fund "
    },
    {
        "content": "NEW YORK  Oct 13 The era of making a broad bet on mutual fund companies as a way to play America's self-funded retirement boom appears to have ended.",
        "date": "10132015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "End of an era: Mutual fund companies no longer a market bright spot "
    },
    {
        "content": "NEW YORK Investors piled into BlackRock Inc  bond ETFs and paid more in hedge fund fees in the third quarter  helping the world's largest asset manager beat Wall Street's earnings forecasts and offsetting a higher tax hit that cut profits 8 percent from a year earlier.",
        "date": "10142015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock profit falls in third quarter but tops expectations "
    },
    {
        "content": "(Adds dateline  recasts  CEO and analyst quote  stock quote)     By Trevor Hunnicutt     NEW YORK  Oct 14 Investors piled into BlackRock Inc bond ETFs and paid more in hedge fund fees in the third quarter  helping the world's largest asset manager beat Wall Street's earnings forecasts and offsetting a higher tax hit that cut profits 8 percent from a year earlier.     Rough-and-tumble markets saw BlackRock trim core investment advice and administration fees by $12 million from 2014",
        "date": "10142015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 3-BlackRock profit falls in 3rd qtr but tops expectations "
    },
    {
        "content": "Oct 14 BlackRock Inc  the world's largest asset manager  said its third-quarter profit fell 8 percent even as the firm rebounded from its first outflow in nearly three years.",
        "date": "10142015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's profit falls 8 pct "
    },
    {
        "content": "SINGAPORE  Oct 14 CapitaLand Ltd  one of Singapore's largest property developers  said it and other parties were in talks to buy a Singapore office tower owned by BlackRock Inc  the world's largest asset manager.",
        "date": "10142015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "CapitaLand says in talks to buy BlackRock's Singapore office tower "
    },
    {
        "content": "Oct 5 Investment management firm BlackRock Inc  appointed Sean Murray to the newly created position of national sales manager of the United States and Canada defined contribution (DC) group.",
        "date": "10052015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "CORRECTED-MOVES-BlackRock names Sean Murray national sales manager for DC group "
    },
    {
        "content": "DUBAI BlackRock Inc  the world's largest asset manager  has been granted regulatory approval from Saudi Arabia to trade local stocks  the company said in a statement on Tuesday.",
        "date": "10062015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock gets Saudi regulatory nod to trade local stocks: statement "
    },
    {
        "content": "LONDON  Oct 6 Formula One could have new owners by the end of the year with three parties currently interested  the sport's commercial supremo Bernie Ecclestone said on Tuesday.",
        "date": "10062015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Motor racing-Formula One could be sold this year - Ecclestone "
    },
    {
        "content": "DUBAI  Oct 6 BlackRock Inc  the world's largest asset manager  has been granted regulatory approval from Saudi Arabia to trade local stocks  the company said in a statement on Tuesday.",
        "date": "10062015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock gets Saudi regulatory nod to trade local stocks- statement "
    },
    {
        "content": "BOSTON  Oct 7 Top asset manager BlackRock Inc  said on Wednesday it plans to give shareholders new rights to nominate directors  bringing its corporate governance in line with policies it has backed elsewhere.",
        "date": "10072015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock to boost shareholders' power after backing reform elsewhere "
    },
    {
        "content": "Oct 1 Apple Inc said on Thursday it appointed James Bell  Boeing Co's former chief financial officer  to its board.",
        "date": "10012015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Apple appoints former Boeing CFO to its board "
    },
    {
        "content": "BOSTON  Sept 30 DuPont Chief Executive Ellen Kullman said it is critical to keep engaging with all stakeholders in the company  signaling an open door policy less than five months after fending off one of the year's toughest shareholder challenges.",
        "date": "09302015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "DuPont CEO Kullman: \"Crucial\" to engage with all stakeholders "
    },
    {
        "content": "NEW YORK  Oct 7 U.S. stock exchange rules designed to protect investors from market routs backfired on Aug. 24  exacerbating a selloff in exchange traded funds  BlackRock Inc said in a report published Wednesday.",
        "date": "10072015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Market rules behind Aug ETF trading issues -BlackRock "
    },
    {
        "content": "LONDON The most challenging global market environment in years will see annual investment returns slashed to just 4-5 percent over the next five years  strategists at investment firm Blackrock said on Wednesday.",
        "date": "10072015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Investors must get realistic on returns in sluggish markets: Blackrock "
    },
    {
        "content": "LONDON Formula One could have new owners by the end of the year with three parties currently interested  the sport's commercial supremo Bernie Ecclestone said on Tuesday.",
        "date": "10072015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Formula One could be sold this year: Ecclestone "
    },
    {
        "content": "Sept 22 The Canada Pension Plan Investment Board said on Tuesday it has voted to strip Bank of America Corp  Chief Executive Officer Brian Moynihan of his chairman's title  the biggest shareholder so far to declare its intentions in a closely watched corporate governance contest.",
        "date": "09222015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Canada pension fund votes to separate Bank of America roles "
    },
    {
        "content": "NEW YORK The Federal Reserve will likely raise U.S. interest rates at its December policy meeting  Rick Rieder  chief investment officer of global fixed income at BlackRock said on Friday  adding that even a year-end hike was not a sure thing.",
        "date": "09182015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Fed likely to raise rates in December: BlackRock's Rieder "
    },
    {
        "content": "NEW YORK  Sept 18 The Federal Reserve will likely raise U.S. interest rates at its December policy meeting after it decided to stick to its near-zero rate policy on Thursday  Rick Rieder  a top bond manager at BlackRock said on Friday.",
        "date": "09182015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "CORRECTED-U.S. Fed likely to raise rates in Dec. - BlackRock's Rieder "
    },
    {
        "content": "Sept 17 BlackRock Inc has introduced an exchange-traded fund investing in Saudi Arabia  marking the first of its kind.",
        "date": "09172015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock introduces first Saudi Arabia exchange-traded fund "
    },
    {
        "content": "BlackRock Inc  co-president and long-time executive Charles Hallac has died after a years-long struggle with colon cancer at the age of 50  the company said on Wednesday.",
        "date": "09092015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock executive Charles Hallac  dies at 50 "
    },
    {
        "content": "Sept 9 BlackRock Inc co-president and long-time executive Charles Hallac has died after a years-long struggle with colon cancer at the age of 50  the company said on Wednesday.",
        "date": "09092015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock executive Charles Hallac  dies at 50 "
    },
    {
        "content": "HONG KONG BlackRock Inc is ready to increase its China real estate portfolio exposure as it sees good entry points following the weakness in the nation's economy and credit environment  a senior executive of the U.S. money manager said on Monday.",
        "date": "09072015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock sees new opportunity in China real estate "
    },
    {
        "content": "HONG KONG BlackRock Inc has secured an additional $400 million quota to invest in Chinese markets  in one of the largest one-time approvals granted by the authorities to invest in the mainland.",
        "date": "09072015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock secures $400 million China investment quota boost "
    },
    {
        "content": "HONG KONG  Sept 7 BlackRock Inc has secured an additional $400 million quota to invest in Chinese markets  in one of the largest one-time approvals granted by the authorities to invest in the mainland.",
        "date": "09072015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock secures $400 mln China investment quota boost "
    },
    {
        "content": "Sept 1 Quintin Price  head of BlackRock's Inc  $944 billion alpha strategies group  which includes its fundamental actively managed fixed income and equity funds  is retiring next year  according to an internal memo viewed by Reuters.",
        "date": "09012015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's head of alpha strategies to retire -memo "
    },
    {
        "content": "CAMPOS DO JORDAO  Brazil  Aug 28 BlackRock president Rob Kapito said on Friday that a recent global markets correction triggered by concerns over the Chinese economy has been \"exaggerated.\"",
        "date": "08282015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock president says China-related selloff has been exaggerated "
    },
    {
        "content": "Aug 26 BlackRock Inc  the world's largest asset manager is acquiring a San Francisco-based robo-adviser  FutureAdvisor  the firm announced Wednesday morning.",
        "date": "08262015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock to acquire robo-adviser "
    },
    {
        "content": "BOSTON  Aug 26 Investors in Discovery Communications Inc  including Manning & Napier Inc  and BlackRock Inc  withheld support for a member of the company's compensation committee  recent securities filings show  after the cable network operator gave its CEO the richest pay package in the S&P 500.",
        "date": "08262015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Funds snub Discovery director after rich CEO pay package "
    },
    {
        "content": "Aug 26 The following bids  mergers  acquisitions and disposals were reported by 1308 GMT on Wednesday:",
        "date": "08262015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "BlackRock Inc's  chief investment officer of fundamental fixed income  Rick Rieder  believes the window for the U.S. Federal Reserve to raise interest rates is closing  he said in an interview on Monday.",
        "date": "08242015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Exclusive: BlackRock's Rieder says 'window closing' on possible Fed September move "
    },
    {
        "content": "WASHINGTON/NEW YORK  Aug 24 Turmoil in world financial markets and growing fears of a China-led global economic slowdown threaten to derail the Federal Reserve's plans to start raising rates from near zero  making the chances of a September lift-off look increasingly remote.",
        "date": "08242015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Market turmoil threatens Fed's rate hike plans "
    },
    {
        "content": "NEW YORK  Aug 18 The two leading exchange-traded funds focusing on emerging markets have very different exposure to now-vulnerable Chinese stocks and will probably diverge further  a new analysis by S&P Capital IQ shows.",
        "date": "08182015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "CORRECTED-Got China? Two big emerging market ETFs diverge on their exposure "
    },
    {
        "content": "Aug 10 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "08102015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "MOVES- Standard Chartered  Citigroup  Berenberg  BlackRock "
    },
    {
        "content": "Aug 10 BlackRock Inc  the world's largest money manager  named Jan Bratteberg as head of its iShares business in the Nordics.",
        "date": "08102015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "MOVES-BlackRock names Jan Bratteberg head of Nordics iShares business "
    },
    {
        "content": "Aug 5 Paul Walker-Duncalf  BlackRock Inc's  global head of trading  has left the firm as of July 28  a source familiar with the situation confirmed to Reuters.",
        "date": "08052015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's global head of trading departs -source "
    },
    {
        "content": "NEW YORK  Aug 4 Situs  a rapidly expanding commercial real estate advisory firm  said on Tuesday it hired Warren Friend  a securitization expert who was BlackRock's point man for its advise to governments on commercial real estate valuations during the financial crisis.",
        "date": "08042015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Situs hires BlackRock exec for commercial property risk analysis "
    },
    {
        "content": "BRUSSELS  Aug 3 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "08032015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "EU mergers and takeovers (Aug 3) "
    },
    {
        "content": "BlackRock Inc  is on the prowl for energy and infrastructure projects in the United States  Mexico and Asia that its institutional clients can invest in  Mark McCombe  head of BlackRock's institutional business  said in an interview last week.",
        "date": "07272015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock dives into private deals as banks shy away "
    },
    {
        "content": "MILAN  July 27 Italian market regulator Consob has dismissed all charges against fund group BlackRock  and one of its managers over the alleged use of insider information to sell shares in Saipem in 2013  BlackRock said on Monday.",
        "date": "07272015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock says Italy's regulator dismisses charges over Saipem share sale "
    },
    {
        "content": "BANGKOK/HONG KONG U.S. fund giant BlackRock Inc  has won a special new licence that will allow it to raise funds in China directly for the first time  a senior executive told Reuters  paving the way for the world's largest money manager to expand in the mainland.",
        "date": "07212015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock steps up China drive with new license to raise onshore funds "
    },
    {
        "content": "NEW YORK  July 20 Fund companies and brokerage firms should be able to weather a proposal by Democratic U.S. presidential candidate Hillary Clinton that would increase capital gains taxes for some investors  but some fund holders could see higher costs  managers and analysts said.",
        "date": "07202015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "U.S. fund industry weighs proposed Clinton tax increase "
    },
    {
        "content": "NEW YORK Billionaire activist investor Carl Icahn on Wednesday lambasted BlackRock Inc   the world's largest asset manager  as an \"extremely dangerous company\" because of the prevalence of its exchange-traded fund products  which Icahn deems illiquid.",
        "date": "07152015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Carl Icahn calls BlackRock a 'dangerous' company  cites ETF concerns "
    },
    {
        "content": "NEW YORK  July 15 Billionaire activist investor Carl Icahn on Wednesday lambasted BlackRock Inc  the world's largest asset manager  as an \"extremely dangerous company\" because of the prevalence of its exchange-traded fund products  which Icahn deems illiquid.",
        "date": "07152015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-Carl Icahn calls BlackRock a 'dangerous' company  cites ETF concerns "
    },
    {
        "content": "BlackRock Inc's  unconstrained bond fund  its $31 billion Strategic Income Opportunities Fund   posted second quarter inflows of $1.7 billion  more than half of the $3.1 billion the firm's U.S. mutual funds brought in for that period  Morningstar data showed on Monday.",
        "date": "07132015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock unconstrained bond fund posts $1.7 billion second-quarter inflow "
    },
    {
        "content": "NEW YORK  July 15 Billionaire activist investor Carl Icahn said on Wednesday that BlackRock Inc.  the world's largest asset manager  was an \"extremely dangerous\" company because of the prevalence of its exchange-traded fund products  which Icahn deems illiquid.",
        "date": "07152015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Carl Icahn says BlackRock a 'dangerous' company  cites ETF concerns "
    },
    {
        "content": "July 13 BlackRock Inc's unconstrained bond fund  its $31 billion Strategic Income Opportunities Fund   posted second quarter inflows of $1.7 billion  more than half of the $3.1 billion the firm's U.S. mutual funds brought in for that period  Morningstar data showed on Monday.",
        "date": "07132015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock unconstrained bond fund posts $1.7 bln Q2 inflow; category lags "
    },
    {
        "content": "BlackRock Inc   the world's largest asset manager  posted a small rise in second-quarter profit as the company saw net outflows for the first time in nearly three years.",
        "date": "07152015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock profit rises as firm sees first outflows since 2012 "
    },
    {
        "content": "July 13 BlackRock's unconstrained bond fund  its $31 billion Strategic Income Opportunities Fund   posted inflows of $1.7 billion in the second quarter  more than half of the $3.1 billion the firm's U.S. mutual funds brought in for that period  Morningstar data showed on Monday.",
        "date": "07132015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock unconstrained bond fund posts $1.7 bln Q2 inflow while category lags "
    },
    {
        "content": "July 10 BlackRock Inc is calling for a series of reforms that both regulators and asset managers should consider to address concerns about liquidity in the fixed income market.",
        "date": "07102015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock proposes reforms to address bond liquidity concerns "
    },
    {
        "content": "July 15 BlackRock Inc  the world's largest asset manager  posted a small rise in second-quarter profit as the company saw net outflows for the first time in nearly three years.",
        "date": "07152015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 3-BlackRock profit rises as firm sees first outflows since 2012 "
    },
    {
        "content": "* U.S.-based BlackRock held a 5.008 percent stake in Italian utility Enel Spa as of July 7   Further company coverage:    (Reporting by Milan Newsroom)",
        "date": "07132015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BRIEF-BlackRock has 5 percent stake in Enel - filing "
    },
    {
        "content": "July 15 BlackRock Inc  the world's largest asset manager  posted a small rise in second-quarter profit  as the firm saw net outflows for the first time in several quarters.",
        "date": "07152015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock quarterly profit rises 1.3 pct "
    },
    {
        "content": "* Blackrock held 5.37 percent stake in Italian bank Banco Popolare as of June 29    Further company coverage:     (Reporting by Milan Newsroom)",
        "date": "07082015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BRIEF-Blackrock has 5.4 pct stake in Italy's Banco Popolare "
    },
    {
        "content": "ZURICH  July 15 The Swiss blue-chip SMI  was seen opening almost unchanged at 9 312 points on Wednesday  according to premarket indications by bank Julius Baer .",
        "date": "07152015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Swiss stocks - Factors to watch on July 15 "
    },
    {
        "content": "BOSTON Greek voters will likely approve a bailout offer from creditors in a referendum set for Sunday  said a top strategist for BlackRock Inc  the world's largest asset manager.",
        "date": "07022015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's Koesterich says expects Greeks to approve referendum "
    },
    {
        "content": "BOSTON  July 1 BlackRock Inc plans to add 11 new funds to its lineup of iShares currency-hedged ETFs  executives said  amid growing demand for the products.",
        "date": "07012015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Amid inflows  BlackRock to expand currency-hedged ETF lineup "
    },
    {
        "content": "NEW YORK  June 25 With the annual rebalance of the Russell stock indexes just a day away  brokerage firms are shaving the discounts they typically offer to big index funds on what is usually one of the biggest trading days of the year.",
        "date": "06252015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "RPT - INSIGHT-Banks slash payments to index funds for Russell rebalance "
    },
    {
        "content": "NEW YORK With the annual rebalance of the Russell stock indexes just a day away  brokerage firms are shaving the discounts they typically offer to big index funds on what is usually one of the biggest trading days of the year.",
        "date": "06252015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Banks slash payments to index funds for Russell rebalance "
    },
    {
        "content": "NEW YORK  June 25 With the annual rebalance of the Russell stock indexes just a day away  brokerage firms are shaving the discounts they typically offer to big index funds on what is usually one of the biggest trading days of the year.",
        "date": "06252015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "INSIGHT-Banks slash payments to index funds for Russell rebalance "
    },
    {
        "content": "MADRID  June 24 Fidere Patrimonio  a real estate investment trust owned by private equity group Blackstone  that groups units of rent-controlled housing in Madrid and Barcelona  will list its shares on Spain's alternative stock market MAB next week  the bourse said on Wednesday.",
        "date": "06242015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "CORRECTED-Blackstone (not Blackrock) to list Spanish rent-controlled housing unit "
    },
    {
        "content": "Thomson Reuters June 24  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                **",
        "date": "06242015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "MEXICO CITY  June 12 BlackRock  the world's largest asset manager  plans to buy a Mexican infrastructure investment fund that financed projects for a contractor at the center of a scandal which embroiled President Enrique Pena Nieto.",
        "date": "06122015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock to buy Mexican fund tied to scandal-hit contractor "
    },
    {
        "content": "MEXICO CITY  June 12 BlackRock Inc  the world's largest asset manager  has agreed to buy a Mexican infrastructure investment fund that financed projects for a contractor at the center of a scandal which embroiled President Enrique Pena Nieto.",
        "date": "06122015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock to buy Mexican fund tied to scandal-hit contractor "
    },
    {
        "content": "LONDON Investors continued to pull money from energy exchange-traded products (ETPs) in May after a rebound in oil prices stumbled as the global supply glut showed no signs of eroding.",
        "date": "06122015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Outflows from energy ETPs continue in May: BlackRock "
    },
    {
        "content": "NEW YORK  June 11 Debt-burdened Puerto Rico has the potential to upset the municipal bond market if there is a broad restructuring of the U.S. commonwealth  causing uncertainty among retail investors  the head of asset manager BlackRock's Municipal Bonds Group said on Thursday.",
        "date": "06112015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock sees potential risk to wider market from Puerto Rico "
    },
    {
        "content": "* Total commodity outflows at $749 mln for May     * Energy outflows slow to $540 mln; up $6.3 bln YTD     * Agriculture attracts bumper $143 mln on weather worries      By Claire Milhench     LONDON  June 12 Investors continued to pull money from energy exchange-traded products (ETPs) in May after a rebound in oil prices stumbled as the global supply glut showed no signs of eroding.     Some $540 million exited energy ETPs globally last month  following net withdrawals of $1.2 billi",
        "date": "06122015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Outflows from energy ETPs continue in May -BlackRock "
    },
    {
        "content": "BlackRock Inc  the world's largest asset manager  has hired Bill MacCartney  a former senior Google research scientist  as a managing director  joining its scientific-active equity team  a company spokesman confirmed to Reuters.",
        "date": "06082015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock taps Google scientist to help big data push "
    },
    {
        "content": "June 8 BlackRock Inc  the world's largest asset manager  has hired Bill MacCartney  a former senior Google research scientist  as a managing director  joining its scientific-active equity team  a company spokesman confirmed to Reuters.",
        "date": "06082015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "ON THE MOVE-BlackRock taps Google scientist to help big data push "
    },
    {
        "content": "BlackRock's  Chief Investment Officer Rick Rieder is bullish on European bonds and is considering buying more German Bunds  he said in an interview on Thursday.",
        "date": "06042015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's Rieder eyes buying more German Bunds "
    },
    {
        "content": "June 4 BlackRock's Chief Investment Officer Rick Rieder is bullish on European bonds and is considering buying more German Bunds  he said in an interview on Thursday.",
        "date": "06042015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-BlackRock's Rieder eyes buying more German Bunds "
    },
    {
        "content": "June 4 BlackRock's Chief Investment Officer Rick Rieder is bullish on European bonds and is considering buying more German bunds  he said in an interview Thursday.",
        "date": "06042015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Rieder eyes buying more German bunds "
    },
    {
        "content": "NEW YORK  June 4 Financial regulators are paying close attention to liquidity concerns surfacing across the U.S. bond market  a top Federal Reserve official said on Thursday.",
        "date": "06042015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Fed's Tarullo  BlackRock's Fink cite bond market liquidity concerns "
    },
    {
        "content": "BlackRock Inc's chairman and chief executive  Laurence Fink  said on Tuesday he believes the U.S. Federal Reserve will raise interest rates in September  but said the Fed should think about why consumers are not spending more before it does hike rates.",
        "date": "06022015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock CEO Fink expects Fed to raise rates in September "
    },
    {
        "content": "June 2 BlackRock Inc's chairman and chief executive  Laurence Fink  said on Tuesday he believes the U.S. Federal Reserve will raise interest rates in September  but said the Fed should think about why consumers are not spending more before it does hike rates.",
        "date": "06022015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock CEO Fink expects Fed to raise rates in Sept. "
    },
    {
        "content": "June 2 BlackRock Inc's Chairman and Chief Executive Officer Laurence Fink believes that the U.S. Federal Reserve will raise interest rates in September  he told attendees of Deutsche Bank's Global Financial Services Conference on Tuesday afternoon.",
        "date": "06022015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Fink predicts Fed to raise rates in September "
    },
    {
        "content": "NEW YORK BlackRock Inc  the world's largest asset manager  has no intention of buying a retail brokerage firm  Larry Fink  the chief executive officer  told shareholders Thursday morning.",
        "date": "05282015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock has no interest in buying a retail brokerage: CEO "
    },
    {
        "content": "NEW YORK  May 28 BlackRock Inc  the world's largest asset manager  has no intention of buying a retail brokerage firm  Larry Fink  the chief executive officer  told shareholders Thursday morning.",
        "date": "05282015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock has no interest in buying a retail brokerage-CEO "
    },
    {
        "content": "May 27 Lowering interest rates around the world to boost the global economy has reached a point where it is now \"quite harmful\" to clients  including pension funds and insurers  BlackRock Inc Chairman and Chief Executive Officer Laurence Fink said on Wednesday.",
        "date": "05272015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "UPDATE 1-Global lower rate environment harmful to investors -BlackRock CEO "
    },
    {
        "content": "Lowering interest rates around the world to boost the global economy has reached a point where it is now \"quite harmful\" to clients  including pension funds and insurers  BlackRock Inc  Chairman and Chief Executive Officer Laurence Fink said on Wednesday.",
        "date": "05272015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Global lower rate environment harmful to investors: BlackRock CEO "
    },
    {
        "content": "LOS ANGELES/BOSTON  May 21 McDonald's Corp  shareholders defied executives at its annual meeting on Thursday  approving a proposal to make it easier to nominate directors to the board of the fast-food chain and taking its new CEO to task over wages  advertising and its food.",
        "date": "05212015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 3-McDonald's CEO gets grilled at first annual meeting "
    },
    {
        "content": "May 27 Lowering interest rates around the world to boost the global economy has reached a point where it is now \"quite harmful\" to clients  including pension funds and insurers  BlackRock Inc Chairman and Chief Executive Officer Laurence Fink said on Wednesday.",
        "date": "05272015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Global lower rate environment harmful to investors- BlackRock CEO "
    },
    {
        "content": "LOS ANGELES/BOSTON  May 21 McDonald's Corp  shareholders will vote Thursday on a proposal that would make it easier to nominate directors to the board of the fast-food chain  which is in turnaround mode after losing customers and sales to competition and after internal missteps.",
        "date": "05212015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "RPT-McDonald's shareholders to weigh director-nomination rules "
    },
    {
        "content": "LOS ANGELES/BOSTON  May 21 McDonald's Corp  shareholders will vote Thursday on a proposal that would make it easier to nominate directors to the board of the fast-food chain  which is in turnaround mode after losing customers and sales to competition and after internal missteps.",
        "date": "05212015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "McDonald's shareholders to weigh director-nomination rules "
    },
    {
        "content": "WASHINGTON  May 13 BlackRock Inc on Wednesday pushed back against arguments by the New York Federal Reserve and other regulators that asset managers' securities lending operations may pose major risks to the market and may need greater oversight.",
        "date": "05142015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "RPT-BlackRock says regulators misunderstand securities lending risks "
    },
    {
        "content": "WASHINGTON  May 13 BlackRock Inc on Wednesday pushed back against arguments by the New York Federal Reserve and other regulators that asset managers' securities lending operations may pose major risks to the market and may need greater oversight.",
        "date": "05132015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock says regulators misunderstand securities lending risks "
    },
    {
        "content": "LONDON Investors pulled $1.2 billion from energy exchange-traded products (ETPs) in April  banking profits after oil prices rallied some 20 percent over the month  the latest global data from asset manager BlackRock showed.",
        "date": "05132015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Investors pull $1.2 billion from energy ETPs in April: BlackRock "
    },
    {
        "content": "* Total commodity outflows at $728 mln for April     * Investors take profits after oil price rally     * Broad basket ETPs benefit from base metals boost      By Claire Milhench     LONDON  May 13 Investors pulled $1.2 billion from energy exchange-traded products (ETPs) in April  banking profits after oil prices rallied some 20 percent over the month  the latest global data from asset manager BlackRock showed.     It was a sharp reversal from the first quarter of 2015  when investor",
        "date": "05132015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Investors pull $1.2 bln from energy ETPs in April - BlackRock "
    },
    {
        "content": "TORONTO  May 1 Barrick Gold Corp on Friday named Catherine Raw  a BlackRock executive and co-manager of one of its flagship mining funds  as head of business performance.",
        "date": "05012015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Barrick names BlackRock exec as head of business performance "
    },
    {
        "content": "As his company gets closer to telling shareholders its plan for allocating cash  Eaton Corp Chief Executive Alexander Cutler said on Wednesday a recent call by a prominent asset manager to think long-term represented a \"healthy voice.\"",
        "date": "04292015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock CEO's long term view is 'healthy': Eaton chief "
    },
    {
        "content": "BlackRock Inc  one of the world's largest asset managers  agreed to pay $12 million to resolve civil charges that one of its unit failed to disclose a conflict of interest created by one of its top portfolio managers.",
        "date": "04202015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock to pay $12 million in SEC conflict of interest case "
    },
    {
        "content": "April 20 BlackRock Inc  one of the world's largest asset managers  agreed to pay $12 million to resolve civil charges that one of its unit failed to disclose a conflict of interest created by one of its top portfolio managers.",
        "date": "04202015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-BlackRock to pay $12 mln in SEC conflict of interest case "
    },
    {
        "content": "April 21 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "04212015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "MOVES- E&Y  Barclays  BlackRock  UBS  KPMG "
    },
    {
        "content": "April 20 BlackRock Inc  one of the world's largest asset managers  agreed to pay $12 million to resolve U.S. Securities and Exchange Commission charges that a unit failed to disclose a conflict of interest created by the outside business activity of a top portfolio manager.",
        "date": "04202015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock to pay $12 mln in SEC conflict of interest case "
    },
    {
        "content": "April 21 BlackRock Inc  the world's largest money manager  appointed Yoshiyuki Izawa as chairman and country head of Japan  effective May 18.",
        "date": "04212015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "MOVES-BlackRock appoints Yoshiyuki Izawa as Japan head "
    },
    {
        "content": "SINGAPORE Aberdeen Asset Management's head of Asian operations warned on Tuesday that Chinese money was moving \"a bit like a casino\" in domestic stock markets  while BlackRock called on China to reform its capital markets further to avert boom and bust scenarios.",
        "date": "04212015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Aberdeen  Blackrock flag risks in frothy Chinese stock markets "
    },
    {
        "content": "* Aberdeen worried about some speculative activity in China stocks",
        "date": "04212015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-Aberdeen  Blackrock flag risks in frothy Chinese stock markets "
    },
    {
        "content": "SINGAPORE The chief executive of BlackRock Inc   the world's largest money manager  said on Tuesday that China will need to continue to reform its capital markets to avert what he called  boom and bust scenarios.",
        "date": "04212015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "China needs more reform to avert 'boom bust' market scenarios: BlackRock "
    },
    {
        "content": "April 21 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "04212015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "PRESS DIGEST - Wall Street Journal - April 21 "
    },
    {
        "content": "SINGAPORE  April 21 The chief executive of BlackRock Inc  the world's largest money manager  said on Tuesday that China will need to continue to reform its capital markets to avert what he called  boom and bust scenarios.",
        "date": "04212015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "China needs more reform to avert \"boom bust\" market scenarios-BlackRock "
    },
    {
        "content": "BlackRock Inc  said on Thursday it plans to beef up its quantitative investing team as the sector continued to outperform peers and reported its actively managed equity funds recorded the first inflows since 2013.",
        "date": "04162015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock first-quarter fund flows jump; to beef up quantitative equity team "
    },
    {
        "content": "April 16 BlackRock Inc said on Thursday it plans to beef up its quantitative investing team as the sector continued to outperform peers and reported its actively managed equity funds recorded the first inflows since 2013.",
        "date": "04162015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 3-BlackRock 1st-qtr fund flows jump; to beef up quantitative equity team "
    },
    {
        "content": "NEW YORK BlackRock Inc chief Larry Fink has asked the top executives of the 500 largest publicly listed U.S. companies urging them to take a long-term approach to create value for shareholders or risk losing his firm's support.",
        "date": "04142015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's Fink tells S&P 500 firms to think long-term "
    },
    {
        "content": "April 16 BlackRock Inc  the world's largest asset manager  intends to announce \"some substantial\" hires in the quantitative investing space as it expects this area to continue to become more popular  chief executive officer Larry Fink told analysts on Thursday.",
        "date": "04162015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock to ramp up quant investing team-Fink "
    },
    {
        "content": "BlackRock Inc's chief executive officer Larry Fink said on Thursday that he is bullish on European equities and believes that Europe's GDP will beat that of the U.S. in the first quarter.",
        "date": "04162015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Fink favors equities in Europe over U.S.: CNBC "
    },
    {
        "content": "NEW YORK  April 14 BlackRock Inc chief Larry Fink has asked the top executives of the 500 largest publicly listed U.S. companies urging them to take a long-term approach to create value for shareholders or risk losing his firm's support.",
        "date": "04142015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock's Fink tells S&P 500 firms to think long-term "
    },
    {
        "content": "April 16 BlackRock Inc  the world's largest money manager  reported an 8.7 percent rise in first-quarter profit  boosted by positive flows into its exchange-traded funds.",
        "date": "04162015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "REFILE-UPDATE 1-BlackRock quarterly profit rises as money pours into ETFs "
    },
    {
        "content": "NEW YORK  April 14 Larry Fink  chief executive officer of BlackRock Inc  has sent a letter to the chief executives of the 500 largest publicly listed U.S. companies urging for a long-term approach to creating value for shareholders or risk losing its support.",
        "date": "04142015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's Fink to S&P 500 companies: think long-term or risk support "
    },
    {
        "content": "April 16 BlackRock Inc  the world's largest money manager  reported an 8.7 percent rise in first-quarter profit  boosted by positive flows into its exchange-traded funds.",
        "date": "04162015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock quarterly profit rises 8.7 pct "
    },
    {
        "content": "LONDON  April 14 (IFR) - BlackRock is planning to sell a debut bond issue in the single currency which will test investor appetite for this type of credit and so-called reverse Yankee issuance.",
        "date": "04142015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock mandates banks for potential euro senior bond "
    },
    {
        "content": "BlackRock sees opportunities to invest in emerging markets debt  despite the rising U.S. dollar and an expected increase in U.S. interest rates this year  executives said Thursday.",
        "date": "04092015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock bullish on emerging markets debt "
    },
    {
        "content": "LONDON  April 14 (IFR) - Fund manager BlackRock has mandated Barclays  Citigroup and J.P. Morgan to arrange a series of European fixed income investor meetings from April 20  2015.",
        "date": "04142015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock mandated banks for potential euro senior bond "
    },
    {
        "content": "April 9 BlackRock sees opportunities to invest in emerging markets debt  despite the rising U.S. dollar and an expected increase in U.S. interest rates this year  executives said Thursday.",
        "date": "04092015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "REFILE-BlackRock bullish on emerging markets debt "
    },
    {
        "content": "BlackRock Inc  the world's largest money manager  will close or consolidate some money-market funds as the company responds to recent regulatory reforms  the Wall Street Journal reported.",
        "date": "04062015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock to close or combine some money-market funds: WSJ "
    },
    {
        "content": "April 6 BlackRock Inc  the world's largest money manager  will close or consolidate some money-market funds as the company responds to recent regulatory reforms  the Wall Street Journal reported.",
        "date": "04062015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock to close or combine some money-market funds - WSJ "
    },
    {
        "content": "BOSTON Ron O'Hanley  the new leader of State Street's  $2.45 trillion asset management division  says he will look closely at expanding the bank's stable of bond-related products as exchange-traded funds run by rivals Vanguard and BlackRock have been more dominant in attracting investor money.",
        "date": "04062015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "State Street may roll out more ETFs linked to star managers "
    },
    {
        "content": "LONDON Singapore's sovereign wealth fund Temasek and money manager BlackRock  are set to buy stakes in Funding Circle in deals that could value the British peer-to-peer lending platform at more than $1 billion  Sky News said on Thursday.",
        "date": "04022015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Funding Circle to get Temasek  Blackrock funding: Sky "
    },
    {
        "content": "LONDON  April 2 Singapore's sovereign wealth fund Temasek and money manager BlackRock are set to buy stakes in Funding Circle in deals that could value the British peer-to-peer lending platform at more than $1 billion  Sky News said on Thursday.",
        "date": "04022015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Funding Circle to get Temasek  Blackrock funding - Sky "
    },
    {
        "content": "MEXICO CITY  March 26 Asset manager BlackRock Inc and U.S. private equity firm First Reserve have taken a joint stake worth around $900 million in the second phase of Mexico pipeline project Los Ramones  state-controlled oil company Pemex said on Twitter on Thursday.",
        "date": "03262015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock and First Reserve take $900 mln stake in Mexico pipeline project "
    },
    {
        "content": "MEXICO CITY  March 26 Asset manager BlackRock and U.S. private equity firm First Reserve have taken a joint stake worth around $900 million in the second phase of Mexico pipeline project Los Ramones  state-controlled oil company Pemex said on Twitter on Thursday.",
        "date": "03262015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock and First Reserve take $900 mln stake in Mexico pipeline project "
    },
    {
        "content": "LONDON  March 26 BlackRock Inc  the world's largest asset manager  has cut its stake in Anglo American  a regulatory notification filed by the mining company showed on Thursday.",
        "date": "03262015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Asset manager Blackrock cuts stake in Anglo American "
    },
    {
        "content": "MILAN  March 27 Italian broadcast tower operator EI Towers  controlled by former Prime Minister Silvio Berlusconi's Mediaset group  won backing from shareholders on Friday for its bid to acquire state-owned rival Rai Way.",
        "date": "03272015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-EI Towers shareholders back bid for Rai Way "
    },
    {
        "content": "FRANKFURT German financial market watchdog Bafin has imposed a 3.25 million euro ($3.47 million) fine - the regulator's largest ever - on investment manager BlackRock for publishing faulty corporate voting rights disclosures.",
        "date": "03202015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "German watchdog slaps 3.25 million euro fine on BlackRock "
    },
    {
        "content": "FRANKFURT  March 20 German financial market watchdog Bafin has imposed a 3.25 million euro ($3.47 million) fine - the regulator's largest ever - on investment manager BlackRock for publishing faulty corporate voting rights disclosures.",
        "date": "03202015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "German watchdog slaps 3.25 mln euro fine on BlackRock "
    },
    {
        "content": "FRANKFURT  March 13 BlackRock's chief executive  Larry Fink  supports plans by Deutsche Bank's  co-chief executives Anshu Jain and Juergen Fitschen to pursue a global strategy with an emphasis on serving the capital  markets  German magazine Spiegel said on Friday.",
        "date": "03132015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock's CEO backs Deutsche Bank's global ambitions - magazine "
    },
    {
        "content": "LONDON  March 12 European-listed junk bond exchange-traded products (ETPs) recorded their biggest monthly inflows in February  data from BlackRock showed  while cash was pulled out of German government and money market ETPs.",
        "date": "03122015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "CORRECTED-Europe's junk bond ETPs sees largest recorded inflows in Feb -BlackRock "
    },
    {
        "content": "LONDON Interest in oil and other energy-related exchange traded products (ETPs) continued for a fifth consecutive month in February with almost $2 billion of inflows  according to the latest global data from BlackRock  pushing assets under management (AUM) to over $13 billion.",
        "date": "03112015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "February another bumper month for oil ETPs: BlackRock "
    },
    {
        "content": "* Adds emerging market  niche fund fees likely to fall next   (Adds quote from Hargreaves Lansdown  context)",
        "date": "03102015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "UPDATE 1-British ETF price war heats up with BlackRock FTSE 100 fee cut "
    },
    {
        "content": "NEW YORK  March 6 The U.S. Federal Reserve will likely begin raising policy rates in June or September following a stronger-than-expected report on U.S. jobs which showed the jobless rate falling to a 6-1/2 year low in February  a top bond manager at BlackRock said on Friday.",
        "date": "03062015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "U.S. Fed seen hiking rates in June or Sept-BlackRock "
    },
    {
        "content": "* Industry warns about impact of EU rules on liquidity   (Adds industry letter to regulators)",
        "date": "03102015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-UK watchdog to keep close eye on corporate bond market's liquidity "
    },
    {
        "content": "LONDON  March 10 BlackRock  the world's largest asset manager  on Tuesday slashed the cost of investing in Britain's oldest FTSE 100 exchange-traded fund  ratcheting up the pressure on rival providers such as Vanguard.",
        "date": "03102015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UK ETF price war heats up with BlackRock FTSE 100 fee cut "
    },
    {
        "content": "March 3 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "03032015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "MOVES- Veris Wealth  Target Advisers  BlackRock "
    },
    {
        "content": "NEW YORK  March 3 Investors pulled $525.8 million from BlackRock Inc's iShares Core U.S. Aggregate Bond ETF on Monday  the company said on Tuesday.",
        "date": "03032015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Investors pull record $525.8 million from BlackRock bond ETF "
    },
    {
        "content": "LONDON  March 3 BlackRock Inc's James Charrington stepped down as  executive chairman in Europe  Middle East and Africa this week after more than two decades at the world's biggest money manager  according to an internal memo seen by Reuters.",
        "date": "03032015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "MOVES-BlackRock's Charrington steps down as EMEA exec chairman - memo "
    },
    {
        "content": "Feb 25 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "02252015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "MOVES- BofA Merrill  Raymond James  E&Y  Blackrock "
    },
    {
        "content": "Feb 25 BlackRock Inc  the world's largest money manager  appointed Thomas Muller as managing director and portfolio manager of its European real estate business.",
        "date": "02252015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "MOVES-BlackRock hires Thomas Muller to manage European real estate portfolio "
    },
    {
        "content": "Feb 24 Timothy Keefe  who managed BlackRock Inc's $581 million Flexible Equity Income Fund  has left the firm after three years.",
        "date": "02242015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock equity manager Keefe departs "
    },
    {
        "content": "NEW YORK  Feb 23 BlackRock Inc is planning to launch its first so-called \"smart beta\" bond fund that will adjust the holdings of a traditional bond index to achieve an equal balance of credit and interest rate risk.",
        "date": "02232015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock set to launch first 'smart beta' bond fund "
    },
    {
        "content": "NEW YORK  Feb 13 (IFR) - Crude price volatility may not have completely closed the funding doors for US high-yield energy companies as private equity firms and new funds prepare to snap up juicy yields on offer after a recent slump in the sector's bonds.",
        "date": "02132015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Juicy yields on energy bonds attracting PE firms "
    },
    {
        "content": "Feb 11 BlackRock President Rob Kapito said on Wednesday that he is still bullish on equities despite the current high valuations in the market.",
        "date": "02112015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock president predicts stocks will still go up "
    },
    {
        "content": "Feb 11 BlackRock President Rob Kapito said on Wednesday that he is still bullish on equities despite the current high valuations in the market.",
        "date": "02112015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock president Kapito predicts stocks will still go up "
    },
    {
        "content": "BlackRock Inc  is planning an array of new investment products that will allow clients to invest in addressing large societal issues  such as global hunger or poverty  an executive at the New York-based firm said.",
        "date": "02092015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "Exclusive: BlackRock to ramp up impact investing "
    },
    {
        "content": "NEW YORK  Feb 5 BlackRock Inc  the world's largest money manager  has named a new head to lead its iShares exchange-traded funds business in the United States as it looks to bulk up its biggest market.",
        "date": "02052015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock appoints new head of U.S. iShares ETF business "
    },
    {
        "content": "Feb 2 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "02032015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "CORRECTED-MOVES- JPMorgan  BlackRock  StanChart  SocGen  AXA (Feb 2) "
    },
    {
        "content": "Feb 2 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "02022015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "MOVES- JPMorgan  BlackRock  StanChart  SocGen  AXA "
    },
    {
        "content": "WASHINGTON  Jan 30 U.S. regulators will review a $3 billion discount claimed by Dish Network Corp and partners including investment management company BlackRock Inc  during a U.S. government wireless spectrum auction that ended this week.",
        "date": "01312015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "Dish's $3 bln wireless auction discount up for U.S. regulator review "
    },
    {
        "content": "Feb 2 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "02022015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "MOVES- JPMorgan  BlackRock  Standard Chartered  Societe Generale  AXA "
    },
    {
        "content": "Feb 2 BlackRock Inc  the world's largest asset manager  appointed Christopher Hall as managing director for its Asia Fundamental Equities team.",
        "date": "02022015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "MOVES-BlackRock names Christopher Hall Asia equities team MD "
    },
    {
        "content": "NEW YORK  Jan 23 U.S. investors stung by the falling euro who want to stay invested in Europe are turning to exchange-traded funds designed to strip out the impact of the region's currency.",
        "date": "01232015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "U.S. investors favor currency hedged Europe ETFs as euro tumbles "
    },
    {
        "content": "When BlackRock Inc  reports its fourth-quarter earnings on Thursday  results are likely to show that a three-year effort to win the hearts and dollars of financial advisers and their retail clients has started to pay off  thanks to record inflows to the firm's bond funds.",
        "date": "01142015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock expected to show its progress winning over retail investors "
    },
    {
        "content": "Jan 14 When BlackRock Inc reports its fourth-quarter earnings on Thursday  results are likely to show that a three-year effort to win the hearts and dollars of financial advisers and their retail clients has started to pay off  thanks to record inflows to the firm's bond funds.",
        "date": "01142015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "REFILE-BlackRock expected to show its progress winning over retail investors "
    },
    {
        "content": "BlackRock Inc  the world's largest money manager  reported a higher-than-expected quarterly profit as assets under management increased.",
        "date": "01152015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock earnings beat estimates as 2014 inflows set record "
    },
    {
        "content": "Jan 15 BlackRock Inc  the world's largest money manager  reported a higher-than-expected quarterly profit as assets under management increased.",
        "date": "01152015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 3-BlackRock earnings beat estimates as 2014 inflows set record "
    },
    {
        "content": "Jan 15 BlackRock Inc  the world's largest money manager  reported a 3.3 percent fall in fourth-quarter profit as the company earned less from investment advisory performance fees.",
        "date": "01152015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's quarterly profit falls 3.3 pct "
    },
    {
        "content": "NEW YORK Investors poured $102.8 billion in new money into BlackRock Inc's exchange-traded funds in 2014  setting a record in global flows for the iShares ETF business  the company said on Monday.",
        "date": "01052015",
        "name": "BlackRock Inc",
        "news_type": "topStory",
        "symbol": "BLK",
        "title": "BlackRock ETF funds draw record $102.8 billion in new money "
    },
    {
        "content": "BlackRock's mutual funds posted record inflows in 2014 of $18.9 billion  according to data provided to Reuters by Morningstar.",
        "date": "01052015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's mutual funds see record inflows in 2014: Morningstar "
    },
    {
        "content": "(Adds comment from BlackRock  performance data  paragraphs 5-9)",
        "date": "01052015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 2-BlackRock's mutual funds see record inflows in 2014 -Morningstar "
    },
    {
        "content": "NEW YORK  Jan 5 Investors poured $102.8 billion in new money into BlackRock Inc's exchange-traded funds in 2014  setting a record in global flows for the iShares ETF business  the company said on Monday.",
        "date": "01052015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "UPDATE 1-BlackRock ETF funds draw record $102.8 billion in new money "
    },
    {
        "content": "Jan 5 BlackRock's mutual funds posted record inflows in 2014 of $18.9 billion  according to data provided to Reuters from Morningstar.",
        "date": "01052015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock's mutual funds see record inflows in 2014-Morningstar "
    },
    {
        "content": "NEW YORK  Jan 5 Investors poured $102.8 billion in new money into BlackRock Inc's exchange-traded funds in 2014  setting a record in global flows for its iShares ETF business  the company said on Monday.",
        "date": "01052015",
        "name": "BlackRock Inc",
        "news_type": "normal",
        "symbol": "BLK",
        "title": "BlackRock grabs $102.8 bln in ETF flows in 2014  setting record "
    }
]