[
    {
        "content": "* Bluebird Bio Inc - to receive $15 million option exercise payment from Celgene​",
        "date": "09282017",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird Bio says to receive $15 mln option exercise payment from Celgene​ "
    },
    {
        "content": "* Bluebird Bio appoints Mary Lynne Hedley  Ph.D. to board of directors Source text for Eikon: Further company coverage:",
        "date": "09202017",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird Bio appoints Mary Lynne Hedley  Ph.D. to board of directors "
    },
    {
        "content": "* Bluebird Bio reports second quarter 2017 financial results and recent operational progress",
        "date": "08022017",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird Bio Q2 net loss per share $1.73 "
    },
    {
        "content": "* bluebird bio Inc says on June 26  co reported updated clinical data from starbeam study clinical study of its lenti-d product candidate - sec filing",
        "date": "06262017",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird bio reports updated clinical data from starbeam study "
    },
    {
        "content": "* Bluebird Bio announces pricing of public offering of common stock",
        "date": "06272017",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird Bio announces pricing of public offering of common stock "
    },
    {
        "content": "* Bluebird Bio and Celgene Corporation announce updated clinical results from ongoing first-in-human multicenter study of bb2121 anti-bcma car t cell therapy in relapsed/refractory multiple myeloma at ASCO annual meeting",
        "date": "06052017",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird Bio  Celgene Corp announce updated clinical results from ongoing first-in-human multicenter study "
    },
    {
        "content": "* Bluebird bio reports first quarter 2017 financial results and recent operational progress",
        "date": "05032017",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird bio Q1 total revenue $6.8 million "
    },
    {
        "content": "* Bluebird bio inc- entered into a worldwide license agreement around its proprietary lentiviral vector platform with novartis pharma ag",
        "date": "05022017",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird Bio entered into a worldwide license agreement around its proprietary lentiviral vector platform with Novartis Pharma "
    },
    {
        "content": "* Bluebird bio enters lentiviral vector patent license agreement with Glaxosmithkline for commercialization of gene therapies",
        "date": "05022017",
        "name": "bluebird bio Inc",
        "news_type": "normal",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird Bio enters into patent license agreement with Glaxosmithkline for commercialization of Gene Therapies "
    },
    {
        "content": "* CEO Nick Leschly's 2016 total compensation was $4.9 million versus $11.2 million in 2015 - sec filing Source text - http://bit.ly/2pmsOYK Further company coverage:",
        "date": "04212017",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird Bio CEO's 2016 compensation was $4.9 mln "
    },
    {
        "content": "* Announces clinical and biological outcomes for first patient with sickle cell disease treated with gene therapy",
        "date": "03012017",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird Bio announces clinical  biological outcomes "
    },
    {
        "content": "* Bluebird Bio reports fourth quarter and full year 2016 financial results and recent operational progress",
        "date": "02222017",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird bio qtrly net loss per share $1.88 "
    },
    {
        "content": "FRANKFURT German biotech firm Medigene said it is drawing more interest from prospective alliance partners for its technology to boost the immune response to cancer after its deal with U.S. peer Bluebird Bio.",
        "date": "12192016",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "Medigene eyeing more immunotherapy deals after Bluebird pact "
    },
    {
        "content": "Patients who previously were not helped by repeated treatments for multiple myeloma showed strong benefits from a new type of therapy in a small study  and with no worrisome side effects  drugmaker Bluebird Bio Inc said on Wednesday.",
        "date": "11302016",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "Bluebird  Celgene myeloma treatment impresses in tiny study "
    },
    {
        "content": "* Says HGB-207 and all studies of lentiglobin to incorporate manufacturing process 2 going forward",
        "date": "11022016",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird Bio qtrly loss per share $2.07 "
    },
    {
        "content": "* Bluebird Bio provides update on Lentiglobin programs and research and development strategy at gene therapy day",
        "date": "10132016",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird Bio provides update on Lentiglobin programs "
    },
    {
        "content": "* LentiGlobin(TM) investigational gene therapy for transfusion-dependent beta-thalassemia accepted into European Medicines Agency's PRIME program  Source text for Eikon:  Further company coverage:",
        "date": "09212016",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird Bio's LentiGlobin investigational gene therapy accepted into Europen Medicines Agency's PRIME program "
    },
    {
        "content": "* Bluebird bio reports second quarter 2016 financial results and recent operational progress",
        "date": "08032016",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird bio reports qtrly loss per share of $1.59 "
    },
    {
        "content": "* Bluebird Bio Inc says Lonza Houston Inc and co have entered into a strategic manufacturing agreement",
        "date": "06092016",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird Bio says co  Lonza Houston enter into manufacturing agreement "
    },
    {
        "content": "* Bluebird Bio reports first quarter 2016 financial results and recent operational progress",
        "date": "05042016",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "BRIEF-Bluebird Bio reports Q1 collaboration revenue $1.5 million "
    },
    {
        "content": "Cancer drug developers Kite Pharma Inc and Bluebird Bio Inc said they would partner to develop and market a new class of T-cell therapies for HPV-associated cancers.",
        "date": "06222015",
        "name": "bluebird bio Inc",
        "news_type": "topStory",
        "symbol": "BLUE",
        "title": "Kite  Bluebird partner for new cancer therapies "
    },
    {
        "content": "June 22 Cancer drug developers Kite Pharma Inc  and Bluebird Bio Inc said they would partner to develop and market a new class of T-cell therapies for HPV-associated cancers.",
        "date": "06222015",
        "name": "bluebird bio Inc",
        "news_type": "normal",
        "symbol": "BLUE",
        "title": "UPDATE 1-Kite  Bluebird partner for new cancer therapies "
    },
    {
        "content": "June 22 Cancer drug developers Kite Pharma Inc  and Bluebird Bio Inc said they would partner to develop and market T-cell therapies for HPV-associated cancers.",
        "date": "06222015",
        "name": "bluebird bio Inc",
        "news_type": "normal",
        "symbol": "BLUE",
        "title": "Kite Pharma  Bluebird collaborate on cancer T-cell therapies "
    },
    {
        "content": "LONDON  June 13 A pioneering gene therapy for sickle cell disease is working well so far for a 13-year-old French boy with the hereditary blood disorder  researchers said on Saturday  in a boost for the technology to fix faulty genes.",
        "date": "06132015",
        "name": "bluebird bio Inc",
        "news_type": "normal",
        "symbol": "BLUE",
        "title": "Bluebird Bio's sickle cell gene therapy working for French boy "
    },
    {
        "content": "May 21 Biotech firm Bluebird Bio Inc  said its experimental gene therapy continued to exhibit a positive effect in an ongoing early-stage study of patients with rare types of blood disorders.",
        "date": "05212015",
        "name": "bluebird bio Inc",
        "news_type": "normal",
        "symbol": "BLUE",
        "title": "Bluebird's gene therapy continues to show promise in early study "
    },
    {
        "content": "Feb 2 The U.S. Food and Drug Administration has designated BlueBird Bio Inc's blood disorder drug a breakthrough therapy  speeding up the treatment's development process.",
        "date": "02022015",
        "name": "bluebird bio Inc",
        "news_type": "normal",
        "symbol": "BLUE",
        "title": "BlueBird's rare blood disorder drug gets breakthrough therapy status "
    },
    {
        "content": "NEW YORK A new wave of experimental cancer drugs that directly recruit the immune system's powerful T cells are proving to be immensely effective weapons against tumors  potentially transforming the $100 billion global market for drugs that fight the disease.",
        "date": "01262015",
        "name": "bluebird bio Inc",
        "news_type": "normal",
        "symbol": "BLUE",
        "title": "Safety concerns cloud early promise of powerful new cancer drugs "
    },
    {
        "content": "NEW YORK  Jan 26 A new wave of experimental cancer drugs that directly recruit the immune system's powerful T cells are proving to be immensely effective weapons against tumors  potentially transforming the $100 billion global market for drugs that fight the disease.",
        "date": "01262015",
        "name": "bluebird bio Inc",
        "news_type": "normal",
        "symbol": "BLUE",
        "title": "INSIGHT-Safety concerns cloud early promise of powerful new cancer drugs "
    }
]