[
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 17 (Fitch) Fitch Ratings has affirmed Banco Macro S.A.'s (Macro) Foreign and Local Currency Long-term Issuer Default Ratings (IDR) at 'B' and its Viability Rating (VR) at 'b'. The Rating Outlook is Stable. A full list of rating actions follows at the end of this release. KEY RATING DRIVERS IDRS  VR AND SENIOR DEBT Despite recent improvements in Argentina's economic policy framework and improved access to international ",
        "date": "10172017",
        "name": "Macro Bank Inc",
        "news_type": "topStory",
        "symbol": "BMA",
        "title": "Fitch Affirms Banco Macro's IDR at 'B'; Outlook Stable "
    },
    {
        "content": "* Banco macro s.a. Announces primary follow-on offering Source text for Eikon: Further company coverage:",
        "date": "05262017",
        "name": "Macro Bank Inc",
        "news_type": "topStory",
        "symbol": "BMA",
        "title": "BRIEF-Banco Macro S.A. announces primary follow-on offering "
    },
    {
        "content": "* Banco Macro S.A. announces pricing of notes offering under medium-term note program",
        "date": "05032017",
        "name": "Macro Bank Inc",
        "news_type": "topStory",
        "symbol": "BMA",
        "title": "BRIEF-Banco Macro S.A. announces pricing of notes offering "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  April 21 (Fitch) Fitch Ratings has assigned an expected rating of 'B(EXP)/RR4' to Banco Macro S.A.'s (Macro) upcoming issuance of ARS denominated senior unsecured medium term notes. The assignment of the final rating is contingent on the receipt of final documents conforming to the information received to date. A list of Macro's current ratings follows at the end of this release. The upcoming issuance will be for an amount up ",
        "date": "04212017",
        "name": "Macro Bank Inc",
        "news_type": "topStory",
        "symbol": "BMA",
        "title": "Fitch Expects to Rate Banco Macro's Senior Notes 'B(EXP)/ RR4' "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  March 01 (Fitch) Fitch Ratings has affirmed Banco Macro S.A.'s (Macro)  Foreign and Local Currency Long-term Issuer Default Ratings (IDR) at 'B' and its  Viability Rating (VR) at 'b'. The Rating Outlook is Stable. A full list of  rating actions follows at the end of this release. KEY RATING DRIVERS  IDRS AND VR  Despite recent improvements in Argentina's economic policy framework and  normalizing relations with foreign credito",
        "date": "03012017",
        "name": "Macro Bank Inc",
        "news_type": "topStory",
        "symbol": "BMA",
        "title": "Fitch Affirms Banco Macro's IDR at 'B'; Outlook Stable "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  February 01 (Fitch) Fitch Ratings expects to assign a rating of  'B(EXP)/RR4' to Banco Macro S.A.'s (Macro) upcoming issuance of ARS denominated  senior unsecured medium term notes. The assignment of the final rating is  contingent on the receipt of final documents conforming to the information  received to date. A list of Macro's current ratings follows at the end of this  release. The upcoming issuance will be for an amount ",
        "date": "02012017",
        "name": "Macro Bank Inc",
        "news_type": "topStory",
        "symbol": "BMA",
        "title": "Fitch Expects to Rate Banco Macro's Senior Notes 'B(EXP)' "
    },
    {
        "content": "* Banco Macro SA- has priced an offering of $400 million of its subordinated resettable notes due 2026  Source text for Eikon:  Further company coverage:",
        "date": "11022016",
        "name": "Macro Bank Inc",
        "news_type": "topStory",
        "symbol": "BMA",
        "title": "BRIEF-Banco Macro reports pricing of notes offering under medium-term note program "
    },
    {
        "content": "* Banco Macro S.A. announces notes offering under medium-term note program",
        "date": "10242016",
        "name": "Macro Bank Inc",
        "news_type": "topStory",
        "symbol": "BMA",
        "title": "BRIEF-Banco Macro announces notes offering under medium-term note program "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 20 (Fitch) Fitch Ratings has today assigned Banco Macro S.A.'s  (Macro) upcoming issuance of subordinated medium term notes an expected rating  of  'B-(EXP)'/'RR6'. The assignment of the final rating is contingent on the receipt of final  documents conforming to the information received to date. Macro is Argentina's third largest private sector bank by loan portfolio with  one of the largest branch networks in the coun",
        "date": "10202016",
        "name": "Macro Bank Inc",
        "news_type": "topStory",
        "symbol": "BMA",
        "title": "Fitch Assigns 'B-(EXP)' Expected Rating to Banco Macro's Subordinated Medium Term Notes "
    },
    {
        "content": "(The following statement was released by the rating agency) MONTERREY  April 19 (Fitch) Fitch Ratings has upgraded Banco Macro  S.A.'s  (Macro) Viability Rating (VR) to 'b' from 'ccc' and its Foreign and Local  Currency (FC & LC) Long-term Issuer Default Ratings (IDR) to 'B' from 'CCC'. The  Rating Outlook is Stable. Fitch has also upgraded Macro's senior unsecured  long-term debt to 'B/RR4' from 'CCC/RR4' and subordinated debt to 'CCC/RR6' from  'CC/RR6'. A full list of rating actions follows a",
        "date": "04192016",
        "name": "Macro Bank Inc",
        "news_type": "topStory",
        "symbol": "BMA",
        "title": "Fitch Upgrades Banco Macro's VR at 'b' & IDRs at 'B'; Outlook Stable "
    }
]