[
    {
        "content": "Nov 15 Laboratory Corporation Of America Holdings",
        "date": "11152017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Labcorp announces new expanded use for PD-L1 test with Bristol-Myers Squibb's Opdivo "
    },
    {
        "content": "* Bristol-Myers Squibb and Syngene International expand ongoing research collaboration",
        "date": "11142017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers and Syngene expand ongoing research collaboration "
    },
    {
        "content": "* Nnext phase of partnership will see addition of facility to support future Bristol-Myers Squibb research and development operations​ Source text: http://bit.ly/2iT2tvz Further company coverage:",
        "date": "11142017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Syngene International ‍expands collaboration with Bristol-Myers Squibb​ "
    },
    {
        "content": "* Encouraging response observed with Opdivo (nivolumab) plus investigational ido1 inhibitor  BMS-986205  in heavily pre-treated patients with advanced cancers in phase 1/2a study ca017-003",
        "date": "11102017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers says encouraging response observed with Opdivo plus BMS-986205  in heavily pre-treated patients with advanced cancers in early-stage study "
    },
    {
        "content": "* Bristol-Myers Squibb and Five Prime present phase 1a/1b data evaluating Cabiralizumab (anti-csf-1 receptor antibody) with Opdivo (nivolumab) in patients with advanced solid tumors",
        "date": "11092017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers and Five Prime present early-stage data evaluating Cabiralizumab with Opdivo in patients with advanced solid tumors "
    },
    {
        "content": "* Opdivo plus Yervoy combination delivered overall survival benefit across PD-l1 expression levels in intermediate- and poor-risk patients with previously untreated advanced or metastatic renal cell carcinoma",
        "date": "11072017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Opdivo plus Yervoy combination delivered overall survival benefit across PD-l1 expression levels "
    },
    {
        "content": "* Initial results from Phase 2 study of CB-839 in combination with opdivo® (nivolumab) to be presented at the Society for Immunotherapy of Cancer Meeting",
        "date": "11072017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Calithera Biosciences expands clinical collaboration with Bristol-Myers Squibb "
    },
    {
        "content": "* Opdivo (nivolumab) demonstrates superior three-year survival benefit for patients with previously treated advanced renal cell carcinoma (RCC)",
        "date": "11062017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Opdivo demonstrates superior 3-yr survival benefit for patients with previously treated advanced RCC "
    },
    {
        "content": "* European Medicines Agency validates Bristol-Myers Squibb's type II variation application for Opdivo (nivolumab) for treatment of patients with resected high-risk advanced melanoma",
        "date": "10302017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-EMA validates Bristol-Myers' type II variation application for Opdivo for treatment of patients with resected high-risk advanced melanoma "
    },
    {
        "content": "A federal appeals court on Friday upheld the dismissal of a whistleblower lawsuit that claimed Bristol-Myers Squibb Co and Otsuka Pharmaceutical engaged in a scheme to improperly promote the antipsychotic drug Abilify.",
        "date": "10272017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers  Otsuka beat whistleblower lawsuit on appeal "
    },
    {
        "content": "Bristol-Myers Squibb Co  reported a 7 percent increase in third-quarter revenue as sales of key drugs met Wall Street expectations  but earnings fell short due to higher costs and an inventory write-off  sending shares down 4 percent.",
        "date": "10262017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers sales in line  but profit margins worsen "
    },
    {
        "content": "Oct 26 Bristol-Myers Squibb Co reported a 7 percent increase in third-quarter revenue as sales of key drugs met Wall Street expectations  but earnings fell short due to higher costs and an inventory write-off  sending shares down 4 percent.",
        "date": "10262017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Bristol-Myers sales in line  but profit margins worsen "
    },
    {
        "content": "* Q3 GAAP earnings per share $0.51; Q3 non-GAAP earnings per share $0.75; Q3 revenues up 7 percent to $5.3 billion",
        "date": "10262017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb reports Q3 earnings per share $0.51 "
    },
    {
        "content": "Oct 26 Bristol-Myers Squibb Co reported a 7 percent increase in third-quarter revenue as sales of key drugs met Wall Street expectations  but adjusted earnings fell slightly short due to an inventory write-off.",
        "date": "10262017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol Myers posts in-line sales  but profit margins worsen "
    },
    {
        "content": "* U.S. Food and Drug Administration (fda) accepts Bristol-Myers Squibb’s application for Opdivo (nivolumab) in patients with resected high-risk advanced melanoma and grants priority review Source text for Eikon: Further company coverage:",
        "date": "10162017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-FDA accepts Bristol-Myers Squibb’s application for Opdivo "
    },
    {
        "content": "* Bristol-Myers Squibb Co ‍announced data evaluating Opdivo (nivolumab) and Opdivo plus Yervoy (ipilimumab) in previously treated small cell lung cancer​",
        "date": "10162017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers ‍announces data for Opdivo and Opdivo plus Yervoy in previously treated small cell lung cancer​ "
    },
    {
        "content": "* Says BMY extended strategic partnership for TARGET-NASH to multi-year agreement​",
        "date": "10122017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb extends strategic partnership with Target Pharmasolutions "
    },
    {
        "content": "* Bristol-Myers Squibb appoints Saurabh Saha  M.D.  Ph.D.  as senior vice president  global head of translational medicine Source text for Eikon: Further company coverage:",
        "date": "10092017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb names Saurabh Saha as senior vice president "
    },
    {
        "content": "* Exelixis to receive milestone payment from Bristol-Myers Squibb for submission of clinical trial authorization for RORγt inverse agonist program",
        "date": "10042017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Exelixis to receive milestone payment from Bristol-Myers Squibb "
    },
    {
        "content": "* Infinity Pharmaceuticals and Bristol-Myers Squibb expand clinical collaboration evaluating ipi-549 in combination with Opdivo (nivolumab)",
        "date": "09252017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Infinity Pharmaceuticals and Bristol-Myers Squibb expand clinical collaboration "
    },
    {
        "content": "* AbbVie and Bristol-Myers Squibb announce clinical research collaboration to evaluate a therapeutic regimen in advanced solid tumors",
        "date": "09222017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-AbbVie and Bristol-Myers Squibb announce clinical research collaboration to evaluate a therapeutic regimen in advanced solid tumors "
    },
    {
        "content": "* Bristol-Myers Squibb - Japanese Ministry of Health  Labor and Welfare has approved Opdivo for treatment of unresectable advanced or recurrent gastric cancer Source text for Eikon: Further company coverage:",
        "date": "09222017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Japanese ministry of Health  Labor and Welfare approves Opdivo for treatment of unresectable advanced or recurrent gastric cancer "
    },
    {
        "content": "LONDON  Sept 20 Bristol-Myers Squibb's immunotherapy drug Opdivo has been recommended for some patients with lung cancer by Britain's healthcare cost watchdog NICE after the drugmaker agreed a discounted price.",
        "date": "09192017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UK backs Opdivo for lung cancer after Bristol-Myers cuts price "
    },
    {
        "content": "Sept 14 U.S. drugmaker Halozyme Therapeutics Inc said on Thursday it would license its drug delivery technology to Bristol-Myers Squibb Co and Swiss drugmaker Roche in separate collaborations.",
        "date": "09142017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Halozyme to license drug delivery tech to Roche  Bristol-Myers "
    },
    {
        "content": "Bristol-Myers Squibb has asked a federal court to compel four plaintiffs  their families and physicians to provide more documents relating to their claims that the anti-psychotic drug Abilify caused them to develop severe gambling addictions and other compulsive behavior.",
        "date": "09132017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers urges Abilify MDL court to compel plaintiff discovery "
    },
    {
        "content": "* Bristol-Myers Squibb and Halozyme enter global collaboration and license agreement for enhanze technology",
        "date": "09142017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb and Halozyme enter global collaboration and license agreement for enhanze technology "
    },
    {
        "content": "* Bristol-Myers Squibb Co - ‍on Sept 13  board elected Karen Vousden to serve as member of board; size of board was increased to eleven - SEC filing​ Source text: [http://bit.ly/2x04hcV] Further company coverage:",
        "date": "09132017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb says Karen Vousden elected as member of board "
    },
    {
        "content": "* Bristol-Myers Squibb Co - ‍declared a quarterly dividend of thirty-nine cents ($0.39) per share on $.10 par value common stock of corporation​ Source text for Eikon: Further company coverage:",
        "date": "09132017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb Co says ‍declared a quarterly dividend "
    },
    {
        "content": "MADRID A combination of two Bristol-Myers Squibb immunotherapy drugs cut the risk of death by 37 percent in a key group of kidney cancer patients  data from a closely watched clinical trial showed on Sunday.",
        "date": "09102017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol's drug cocktail cuts kidney cancer death risk 37 percent "
    },
    {
        "content": "* Bristol-Myers Squibb Co completes previously announced acquisition of IFM Therapeutics",
        "date": "09072017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb completes acquisition of IFM Therapeutics "
    },
    {
        "content": "MADRID  Sept 10 A combination of two Bristol-Myers Squibb immunotherapy drugs cut the risk of death by 37 percent in a key group of kidney cancer patients  data from a closely watched clinical trial showed on Sunday.",
        "date": "09102017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Bristol's drug cocktail cuts kidney cancer death risk 37 pct "
    },
    {
        "content": "MADRID  Sept 10 A combination of two Bristol-Myers Squibb immunotherapy drugs cut the risk of death by 37 percent in a key group of kidney cancer patients  data from a closely watched clinical trial showed on Sunday.",
        "date": "09102017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol kidney cancer drug cut death risk 37 pct in key patients "
    },
    {
        "content": "* Dow down 0.1 pct  S&P down 0.02 pct  Nasdaq up 0.07 pct (Updates to close of U.S. market)",
        "date": "09072017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "US STOCKS-Wall St ends flat as media stocks slump  healthcare gains "
    },
    {
        "content": "Bristol-Myers Squibb Co said on Thursday the success of its combination therapy to improve overall survival in kidney cancer patients helped it end the trial well ahead of schedule  despite earlier reporting mixed results on other main goals.",
        "date": "09072017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers stops kidney cancer drug test after early success "
    },
    {
        "content": "Sept 7 Bristol-Myers Squibb Co said on Thursday the success of its combination therapy to improve overall survival in kidney cancer patients helped it end the trial well ahead of schedule  despite earlier reporting mixed results on other main goals.",
        "date": "09072017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "REFILE-UPDATE 3-Bristol-Myers stops kidney cancer drug test after early success "
    },
    {
        "content": "U.S. health regulators stopped five blood cancer trials testing AstraZeneca Plc's immunotherapy Imfinzi in combination with Celgene Corp medicines from accepting new patients  and halted another study entirely  the companies said on Thursday.",
        "date": "09072017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "FDA widens holds on immunotherapy combination blood cancer trials "
    },
    {
        "content": "Sept 7 U.S. health regulators stopped five blood cancer trials testing AstraZeneca Plc's immunotherapy Imfinzi in combination with Celgene Corp medicines from accepting new patients  and halted another study entirely  the companies said on Thursday.",
        "date": "09072017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 2-FDA widens holds on immunotherapy combination blood cancer trials "
    },
    {
        "content": "* Checkmate-214 study evaluating Opdivo in combination with Yervoy stopped early for demonstrating overall survival benefit in patients with previously untreated advanced or metastatic renal cell carcinoma",
        "date": "09072017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-‍Bristol-Myers Squibb says Opdivo plus Yervoy showed superior overall survival "
    },
    {
        "content": "Sept 7 Bristol-Myers Squibb Co said on Thursday its combination drug to treat a type of kidney cancer met one of the main goals of overall survival in a late-stage study.",
        "date": "09072017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers kidney cancer drug meets main goal of late-stage trial "
    },
    {
        "content": "Bristol-Myers Squibb Co and Daiichi Sankyo said they were evaluating a combination of Bristol-Myers' immuno-oncology drug  Opdivo  with the Japanese company's experimental drug in patients with breast and bladder cancers.",
        "date": "08282017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers  Daiichi Sankyo to test Opdivo combo for cancers "
    },
    {
        "content": "Aug 28 Bristol-Myers Squibb Co and Daiichi Sankyo said they were evaluating a combination of Bristol-Myers' immuno-oncology drug  Opdivo  with the Japanese company's experimental drug in patients with breast and bladder cancers.",
        "date": "08282017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Bristol-Myers  Daiichi Sankyo to test Opdivo combo for cancers "
    },
    {
        "content": "Aug 28 Bristol-Myers Squibb Co and Daiichi Sankyo said they would collaborate on a clinical trial to evaluate a combination of Bristol-Myers' immuno-oncology drug  Opdivo  with the Japanese company's experimental drug in patients with breast and bladder cancers.",
        "date": "08282017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers  Daiichi Sankyo to test combo therapy for breast  bladder cancers "
    },
    {
        "content": "* Bristol-Myers Squibb and Daiichi Sankyo announce research collaboration to evaluate Opdivo (Nivolumab) and DS-8201 in HER2-expressing breast and bladder cancers",
        "date": "08282017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb and Daiichi Sankyo collaborate to evaluate Opdivo (Nivolumab) and DS-8201 "
    },
    {
        "content": "* Futures up: Dow 50 pts  S&P 5.25 pts  Nasdaq 14.75 pts (Adds details  comments  updates price)",
        "date": "08162017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "US STOCKS-U.S. stocks set to open higher ahead of Fed minutes "
    },
    {
        "content": "Aug 16 U.S. stock index futures were higher on Wednesday ahead of the minutes on the Federal Reserve's July policy meeting  which will offer clues on the future path of interest rate hikes.",
        "date": "08162017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "US STOCKS-Futures higher ahead of Fed minutes "
    },
    {
        "content": "Aug 15 Bristol-Myers Squibb Co said on Tuesday its combination drug to treat previously untreated patients with advanced or metastatic renal cell carcinoma  a type of kidney cancer  failed to meet one of the main goals of a late-stage trial.",
        "date": "08152017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers kidney cancer drug fails late-stage trial "
    },
    {
        "content": "Aug 15 Bristol-Myers Squibb Co said on Tuesday its combination drug to treat previously untreated patients with advanced or metastatic renal cell carcinoma  a type of kidney cancer  failed to meet one of the main goals of a late-stage trial.",
        "date": "08152017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Bristol-Myers kidney cancer drug fails late-stage trial "
    },
    {
        "content": "* Bristol-Myers Squibb announces topline results from checkmate -214  a phase 3 study of opdivo in combination with yervoy in intermediate and poor-risk patients with previously untreated advanced or metastatic renal cell carcinoma",
        "date": "08152017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb announces topline results "
    },
    {
        "content": "* Regen Biopharma Inc addresses potential impact of recent Bristol Myers Squibb's $2.3 billion acquisition of IFM Therapeutics Source text for Eikon: Further company coverage:",
        "date": "08102017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Regen Biopharma addresses potential impact of recent Bristol Myers Squibb's $2.3 billion acquisition of IFM Therapeutics "
    },
    {
        "content": "Aug 3 Bristol-Myers Squibb Co said it would buy privately held IFM Therapeutics for an upfront payment of $300 million  as the drugmaker looks to bolster its cancer portfolio after losing ground to Merck & Co's rival treatment Keytruda.",
        "date": "08032017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers to buy IFM Therapeutics to strengthen cancer pipeline "
    },
    {
        "content": "* Seattle Genetics announces purchase of Bothell manufacturing facility from Bristol-Myers Squibb",
        "date": "08012017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Seattle Genetics to buy Bothell plant from Bristol-Myers Squibb "
    },
    {
        "content": "* Bristol-Myers Squibb receives FDA approval for opdivo (nivolumab) in MSI-H or DMMR metastatic colorectal cancer that has progressed following treatment with a fluoropyrimidine  oxaliplatin  and irinotecan",
        "date": "08012017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb receives FDA approval for opdivo "
    },
    {
        "content": "* Bristol-Myers Squibb to acquire IFM Therapeutics to strengthen oncology pipeline focus on innate immunity",
        "date": "08032017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb to acquire IFM Therapeutics to strengthen oncology pipeline focus on innate immunity "
    },
    {
        "content": "* Bristol-Myers Squibb’S Orencia (abatacept) receives second European Commission approval in less than a year – new approval for treatment of active psoriatic arthritis (PSA)1",
        "date": "07262017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb’s Orencia receives second European Commission approval "
    },
    {
        "content": "A federal judge has dismissed 20 lawsuits against Bristol-Myers Squibb and Pfizer Inc claiming that people who took its blood thinner Eliquis suffered severe internal bleeding  leaving just a single case in the consolidated litigation over the drug.",
        "date": "07282017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Federal judge tosses most Eliquis cases vs. Bristol-Myers  Pfizer "
    },
    {
        "content": "Bristol-Myers Squibb Co shares fell 4 percent on Thursday as investors bet that a failed cancer-drug trial at AstraZeneca Plc would have negative implications for Bristol-Myers' similar immunotherapy treatment regimen.",
        "date": "07272017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers shares slump after failed AstraZeneca drug trial "
    },
    {
        "content": "* U.S. Food And Drug Administration accepts Bristol-Myers Squibb’s applications for Opdivo (nivolumab) four-week dosing schedule across all approved indications",
        "date": "07242017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-FDA accepts Bristol-Myers Squibb's applications for Opdivo "
    },
    {
        "content": "July 27 Bristol-Myers Squibb Co shares fell 4 percent on Thursday as investors bet that a failed cancer-drug trial at AstraZeneca Plc would have negative implications for Bristol-Myers' similar immunotherapy treatment regimen.",
        "date": "07272017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 3-Bristol-Myers shares slump after failed AstraZeneca drug trial "
    },
    {
        "content": "LONDON AstraZeneca's combination of two injectable immunotherapy drugs failed to help patients as hoped in a closely watched advanced lung cancer trial  triggering the biggest ever daily fall in its shares on Thursday.",
        "date": "07272017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "AstraZeneca lung cancer failure sparks 16 percent share fall "
    },
    {
        "content": "* Merck gains  Bristol-Myers falls in reaction to news (Adds Merck and Bristol share moves  CEO comment on dividend)",
        "date": "07272017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 7-AstraZeneca lung cancer failure sparks 16 percent share fall "
    },
    {
        "content": "* Bristol-Myers Squibb reports second quarter financial results",
        "date": "07272017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb Q2 non-gaap earnings per share $0.74 "
    },
    {
        "content": "July 27 Bristol-Myers Squibb Co posted a lower second-quarter net profit on Thursday as research and development costs increased  but sales of its key cancer immunotherapies continued to rise  meeting Wall Street estimates.",
        "date": "07272017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers quarterly sales meet Wall Street estimates "
    },
    {
        "content": "* Bristol-Myers Squibb Co - ‍on July 10  2017  Laurie H. Glimcher  notified co that she will retire from board of directors effective July 21  2017​",
        "date": "07142017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb Co says Laurie Glimcher notified co that she will retire from board "
    },
    {
        "content": "* Exelixis and Bristol-Myers Squibb initiate phase 3 trial of opdivo in combination with cabometyx or opdivo and yervoy in combination with cabometyx  versus sunitinib in previously untreated advanced or metastatic renal cell carcinoma",
        "date": "07102017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Exelixis  Bristol-Myers Squibb initiate phase 3 trial "
    },
    {
        "content": "* Bristol-Myers Squibb's Orencia (abatacept) receives FDA approval for treatment of active psoriatic arthritis (PSA) in adults",
        "date": "07062017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb's Orencia receives FDA approval "
    },
    {
        "content": "* U.S. Food and Drug Administration accepts for priority review Bristol-Myers Squibb's application for sprycel (dasatinib) in children with philadelphia chromosome-positive chronic phase chronic myeloid leukemia",
        "date": "07102017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-FDA accepts for priority review Bristol-Myers Squibb's application for sprycel "
    },
    {
        "content": "LONDON  July 5 A novel class of personalised cancer vaccines  tailored to the tumours of individual patients  kept disease in check in two early-stage clinical trials  pointing to a new way to help the immune system fight back.",
        "date": "07052017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Personalised vaccines hold cancer at bay in two early trials "
    },
    {
        "content": "* Investors focus on narrow drug benefits vs standard of care",
        "date": "06262017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 2-Seattle Genetics slumps as cancer drug data fails to impress "
    },
    {
        "content": "June 26 Seattle Genetics Inc and Japan's Takeda Pharmaceutical Co Ltd said on Monday that their drug met the main goal in a late-stage study of helping blood cancer patients live longer without their condition worsening.",
        "date": "06262017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "CORRECTED-UPDATE 1-Seattle Genetics  Takeda lymphoma drug success fails to impress investors "
    },
    {
        "content": "* Bristol-Myers Squibb announces the expiration of its cash tender offer",
        "date": "06212017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb announces expiration of cash tender offer "
    },
    {
        "content": " (The story corrects the last paragraph in the June 19 story to say Adcetris generated $266 million in sales last year  not $71 million)",
        "date": "06262017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Seattle Genetics halts late-stage study of leukemia drug (June 19) "
    },
    {
        "content": "June 19 Seattle Genetics Inc said it would halt a late-stage study of its drug to treat a type of leukemia in older patients following a \"higher rate\" of deaths in patients on the drug compared with those on a placebo.",
        "date": "06262017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "CORRECTED-UPDATE 3-Seattle Genetics halts late-stage study of leukemia drug (June 19) "
    },
    {
        "content": "June 20 Johnson & Johnson is seizing upon a U.S. Supreme Court ruling from Monday limiting where injury lawsuits can be filed to fight off claims it failed to warn women that talcum powder could cause ovarian cancer.",
        "date": "06212017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "RPT-U.S. Supreme Court ruling threatens massive talc litigation against J&J "
    },
    {
        "content": "Johnson & Johnson is seizing upon a U.S. Supreme Court ruling from Monday limiting where injury lawsuits can be filed to fight off claims it failed to warn women that talcum powder could cause ovarian cancer.",
        "date": "06212017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "U.S. Supreme Court ruling threatens massive talc litigation against J&J "
    },
    {
        "content": "June 20 Johnson & Johnson is seizing upon a U.S. Supreme Court ruling from Monday limiting where injury lawsuits can be filed to fight off claims it failed to warn women that talcum powder could cause ovarian cancer.",
        "date": "06212017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "CORRECTED-U.S. Supreme Court ruling threatens massive talc litigation against J&J "
    },
    {
        "content": "June 26 Seattle Genetics Inc and Japan's Takeda Pharmaceutical Co Ltd said on Monday that their drug met the main goal in a late-stage study of helping blood cancer patients live longer without their condition worsening.",
        "date": "06262017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "CORRECTED-Seattle Genetics  Takeda lymphoma drug succeeds late-stage trial "
    },
    {
        "content": "* Announces cash tender offer for any and all of certain of its outstanding debt securities",
        "date": "06142017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb announces cash tender offer "
    },
    {
        "content": "* Seattle Genetics and Bristol-Myers Squibb highlight interim phase 1/2 data evaluating combination of adcetris® (brentuximab vedotin) and opdivo® (nivolumab) in relapsed hodgkin lymphoma at the international conference on malignant lymphoma",
        "date": "06152017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Seattle Genetics  Bristol-Myers Squibb highlight interim phase 1/2 data "
    },
    {
        "content": "* Bristol-Myers Squibb to sell manufacturing facility in swords  Ireland to SK Biotek Co.  Ltd.",
        "date": "06162017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb to sell manufacturing facility to SK Biotek Co "
    },
    {
        "content": "* Bristol-Myers Squibb Co says declared a quarterly dividend of $0.39 per share on $.10 par value common stock of corporation Source text for Eikon: Further company coverage:",
        "date": "06132017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb declares quarterly dividend of $0.39/shr "
    },
    {
        "content": "* Bristol-Myers Squibb announces availability of new Orencia (abatacept) subcutaneous administration option for patients 2 years of age and older with moderately to severely active polyarticular Juvenile Idiopathic Arthritis (JIA) Source text for Eikon: Further company coverage:",
        "date": "06082017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers announces availability of Orencia subcutaneous administration option for patients above 2 yrs of age with moderately to severely active polyarticular JIA "
    },
    {
        "content": "* Bristol-Myers Squibb announces new collaboration to evaluate combination therapy in colorectal cancer",
        "date": "06052017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb announces new collaboration to evaluate combination therapy in colorectal cancer "
    },
    {
        "content": "* Novartis announces clinical collaboration with Bristol-Myers Squibb to evaluate potential treatments in metastatic colorectal cancer Source text for Eikon: Further company coverage:",
        "date": "06052017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Novartis announces clinical collaboration with Bristol-Myers Squibb "
    },
    {
        "content": "* Clinical trial data for combination of epacadostat and opdivo® (nivolumab) demonstrate durable clinical responses in patients with melanoma and head and neck cancer",
        "date": "06052017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Incyte says epacadostat  Bristol-Myers' Opdivo combo data positive in head and neck cancer patients "
    },
    {
        "content": "* Expects Trump proposals on drug prices in 3 months (Recasts to focus on M&A)",
        "date": "05312017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 2-Novartis CEO sees no need for big takeover "
    },
    {
        "content": "* Advaxis and Bristol-Myers Squibb announce clinical collaboration to evaluate ADXS-DUAL and opdivo (nivolumab) in metastatic cervical cancer",
        "date": "05302017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Advaxis and Bristol-Myers Squibb announce clinical collaboration to evaluate ADXS-DUAL and Opdivo in metastatic cervical cancer "
    },
    {
        "content": "* European Commission approves Bristol-Myers Squibb’s opdivo (nivolumab) for previously treated locally advanced unresectable or metastatic urothelial carcinoma in adults after failure of prior platinum-containing therapy",
        "date": "06022017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-European commission approves Bristol-Myers Squibb’s opdivo (nivolumab) "
    },
    {
        "content": "* Array bioPharma and Bristol-Myers Squibb announce strategic collaboration",
        "date": "05302017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Array BioPharma and Bristol-Myers Squibb announce strategic collaboration "
    },
    {
        "content": "* Bristol-Myers Squibb and Seattle Genetics expand clinical collaboration to evaluate combination of opdivo (nivolumab) and adcetris® (brentuximab vedotin) in pivotal phase 3 clinical trial in relapsed hodgkin lymphoma",
        "date": "06022017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb and Seattle Genetics expand collaboration to evaluate combination of opdivo and adcetris "
    },
    {
        "content": "* Health Canada approves opdivo (nivolumab) for the treatment of squamous cell carcinoma of the head and neck",
        "date": "05172017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Health Canada approves Bristol-Myers' opdivo(nivolumab) "
    },
    {
        "content": "* Jana Partners cuts sole share stake in Bristol-Myers Squibb Co by 81.5 percent to 716 389 shares - SEC filing",
        "date": "05152017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Jana Partners cuts sole share stake in Bristol-Myers Squibb "
    },
    {
        "content": "A federal judge has dismissed for a second time a lawsuit against Bristol-Myers Squibb and Pfizer Inc by a man who claimed he suffered severe internal bleeding after taking their blood thinner Eliquis.",
        "date": "05092017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers  Pfizer beat amended Eliquis case over bleeding risks "
    },
    {
        "content": "* Appaloosa LP dissolves share stake in Bristol Myers Squibb Co - sec filing",
        "date": "05122017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Appaloosa LP dissolves share stake in Bristol Myers  Qualcomm "
    },
    {
        "content": "* Bristol-Myers Squibb and Calithera Biosciences expand collaboration evaluating opdivo (nivolumab) in combination with CB-839 into non-small cell lung cancer and melanoma",
        "date": "05102017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb  Calithera Biosciences expand collaboration "
    },
    {
        "content": "* China FDA approves country's first all-oral regimen for chronic Hepatitis C  daklinza (daclatasvir) in combination with sunvepra (asunaprevir)",
        "date": "04282017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-China FDA approves country's first all-oral regimen for chronic Hepatitis C "
    },
    {
        "content": "WASHINGTON  April 25 U.S. Supreme Court justices on Tuesday signaled a willingness to place limits on where corporations can be sued in a dispute involving drug maker Bristol-Myers Squibb Co  a potential setback to plaintiffs' lawyers who try to bring suits in friendly courts.",
        "date": "04252017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "U.S. Supreme Court may limit where companies can be sued "
    },
    {
        "content": "* Co and Bristol-Myers Squibb announce clinical research collaboration to evaluate TG4010 with Opdivo and Standard Chemotherapy in First Line Non-Small Cell Lung Cancer",
        "date": "04252017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Transgene and Bristol-Myers Squibb announce clinical research collaboration "
    },
    {
        "content": "NEW YORK Strong growth from Bristol-Myers Squibb Co's Opdivo and Yervoy cancer immunotherapies drove the company's first-quarter results past analysts' expectations and relieved some anxiety about increasing competition for the drugs.",
        "date": "04272017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers' cancer drug Opdivo fuels Wall Street beat "
    },
    {
        "content": "NEW YORK  April 27 Strong growth from Bristol-Myers Squibb Co's Opdivo and Yervoy cancer immunotherapies drove the company's first-quarter results past analysts' expectations and relieved some anxiety about increasing competition for the drugs.",
        "date": "04272017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 2-Bristol-Myers' cancer drug Opdivo fuels Wall Street beat "
    },
    {
        "content": "* Bristol-Myers Squibb receives positive CHMP opinion recommending approval of Opdivo (Nivolumab) for the treatment of patients with previously treated locally advanced or metastatic urothelial carcinoma  a type of bladder cancer",
        "date": "04212017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers gets positive CHMP opinion recommending approval of Opdivo for treatment of a type of bladder cancer "
    },
    {
        "content": "* Cfo says now believes \"there is potential for Opdivo to grow in the U.S. this year \" even with increased competition",
        "date": "04272017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers CFO: potential for 2017 U.S. growth for Opdivo "
    },
    {
        "content": "* Q1 earnings per share $0.94; Q1 adjusted earnings per share $0.84; Q1 revenues $4.93 billion  up 12 percent",
        "date": "04272017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb posts Q1 earnings per share of $0.94 "
    },
    {
        "content": "April 22 Bristol-Myers Squibb Co said its lead experimental drug for nonalcoholic steatohepatitis  or NASH  significantly reduced liver fat versus placebo  according to data from a mid-stage trial presented at a medical meeting on Saturday.",
        "date": "04222017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers NASH drug reduces liver fat in midstage study "
    },
    {
        "content": "NEW YORK  April 27 Bristol-Myers Squibb Co on Thursday posted better-than-expected first-quarter earnings  helped by growth from cancer drugs Opdivo and Yervoy and blood thinner Eliquis.",
        "date": "04272017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers beats Wall St estimates  helped by Cancer drug Opdivo "
    },
    {
        "content": "LONDON Three years after Pfizer's failed bid for AstraZeneca  the British drugmaker aims to prove in the coming weeks that its cancer immunotherapy can deliver on bold sales forecasts made during that takeover battle.",
        "date": "04192017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "As AstraZeneca chases rivals  immuno-oncology gets complicated "
    },
    {
        "content": "* Bristol-Myers Squibb and Nordic Bioscience announce collaboration for fibrosis biomarker technology",
        "date": "04172017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Nordic Bioscience announce collaboration for fibrosis biomarker technology "
    },
    {
        "content": "Bristol-Myers Squibb Co said on Thursday it would license two of its drugs to Biogen Inc and Roche Holding AG for an upfront fee of $470 million.",
        "date": "04132017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers to license two drugs to Biogen  Roche "
    },
    {
        "content": "* Deals come amid activist investor pressure (Adds background on activist investor pressure)",
        "date": "04132017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 2-Bristol-Myers to license two drugs to Biogen  Roche "
    },
    {
        "content": "* Biogen Inc -  under agreement  biogen will receive worldwide rights to BMS-986168",
        "date": "04132017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Biogen licenses Phase 2 Anti-Tau antibody from Bristol-Myers Squibb "
    },
    {
        "content": "* Bristol-Myers Squibb and Apexigen  Inc. announce clinical collaboration to evaluate Opdivo (nivolumab) in combination with APX005M in advanced solid tumors",
        "date": "04112017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers and Apexigen announce clinical collaboration to evaluate Opdivo in combination with APX005M in advanced solid tumors "
    },
    {
        "content": "LONDON  April 11 Britain's healthcare cost-effectiveness watchdog NICE said on Tuesday that Bristol-Myers Squibb's immunotherapy drug Opdivo was not worth using on the state health service for treating head and neck cancer due to its high price.",
        "date": "04102017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UK cost agency turns down Bristol drug for head and neck cancer "
    },
    {
        "content": "April 13 Bristol-Myers Squibb Co said on Thursday it entered into a deal with Biogen Inc and Roche Holding AG to license two of its drugs for an upfront fee of $470 million.",
        "date": "04132017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers to license two of its drugs to Biogen  Roche "
    },
    {
        "content": "* Bristol-Myers Squibb enters into separate agreements with Biogen and Roche to license anti-etau and anti-myostatin compounds  respectively",
        "date": "04132017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb enters into separate agreements with Biogen and Roche "
    },
    {
        "content": "* U.S. Food and Drug Administration accepts for priority review Bristol-Myers Squibb's application for Opdivo (nivolumab) in previously treated DMMR or MSI-H metastatic colorectal cancer",
        "date": "04042017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-FDA accepts for priority review Bristol-Myers' application for Opdivo in previously treated metastatic colorectal cancer "
    },
    {
        "content": "April 3 Patients with advanced melanoma who received Bristol-Myers Squibb's immunotherapies Opdivo and Yervoy had improved overall survival compared with those on Yervoy alone  with 64 percent on the combination therapy still alive after two years  according to data released on Monday.",
        "date": "04032017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers immunotherapy combination extends survival in melanoma "
    },
    {
        "content": "* Bristol-Myers Squibb enters collaboration to leverage Foundation Medicine's molecular information platform to identify predictive biomarkers across multiple tumor types and immunotherapy agents Source text for Eikon: Further company coverage:",
        "date": "03302017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers enters collaboration to identify predictive biomarkers across multiple tumor types  immunotherapy agents "
    },
    {
        "content": "* Bristol-Myers Squibb receives positive chmp opinion recommending opdivo (nivolumab) for the treatment of squamous cell cancer of the head and neck in adults progressing on or after platinum-based therapy",
        "date": "03242017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb receives positive CHMP opinion recommending opdivo "
    },
    {
        "content": "* Bristol-Myers Squibb Co - CEO Giovanni Caforio  M.D.'s 2016 total compensation was $16.9 million versus $15.6 million in 2015 - SEC filing",
        "date": "03232017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers' CEO Caforio's 2016 total compensation $16.9 mln "
    },
    {
        "content": "* Bristol-Myers Squibb and Cytomx Therapeutics extend worldwide collaboration to discover Probody Therapeutics for the treatment of cancer and other diseases",
        "date": "03202017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb  Cytomx Therapeutics extend worldwide collaboration "
    },
    {
        "content": "* Bristol-Myers Squibb appoints Dr. Thomas J. Lynch  Jr.  Executive Vice President and Chief Scientific Officer",
        "date": "03082017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb appoints Thomas Lynch as Chief Scientific Officer "
    },
    {
        "content": "* Bristol-Myers Squibb - declared a quarterly dividend of $0.39 per share on $.10 par value common stock of corporation  Source text for Eikon:  Further company coverage:",
        "date": "03022017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb declared a qtrly div of $0.39 per share "
    },
    {
        "content": "* Bristol-Myers Squibb expands focus on precision medicine with investment and planned collaboration with GRAIL on blood-based cancer screening",
        "date": "03012017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers announces equity investment in GRAIL Inc "
    },
    {
        "content": "* Bristol-Myers Squibb expands international immuno-oncology network (II-ON) with addition of Columbia University Medical Center and Peter Maccallum Cancer Centre  Source text for Eikon:  Further company coverage:",
        "date": "02272017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb expands international immuno-oncology network "
    },
    {
        "content": "* Bristol-Myers Squibb prices $1.5 billion of senior notes  Source text for Eikon: Further company coverage:",
        "date": "02222017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb prices $1.5 billion of senior notes "
    },
    {
        "content": "* Files pricing term sheet related to its offering of 2019 notes and 2027 notes - SEC filing  Source text: (http://bit.ly/2lHhR1j) Further company coverage:",
        "date": "02222017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers squibb files pricing term sheet "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 22 (Fitch) Fitch Ratings has assigned an 'A-' rating to  Bristol-Myers Squibb Company's (Bristol  BMY) senior unsecured notes offering.  Proceeds will be used to partially fund an accelerated share repurchase program  (ASR). The Rating Outlook is Stable.  KEY RATING DRIVERS --The company maintains decent headroom under the 2.0x gross leverage level  Fitch considers appropriate for the 'A-' rating after incorporating th",
        "date": "02222017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Fitch Rates Bristol-Myers Squibb's Notes Offering 'A-'; Outlook Stable "
    },
    {
        "content": "Feb 22 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "02222017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "PRESS DIGEST - Wall Street Journal - Feb 22 "
    },
    {
        "content": "Billionaire investor Carl Icahn has taken a stake in Bristol-Myers Squibb Co  and sees the drugmaker as a possible takeover target  according to a report published on Tuesday that sent the company's shares from a loss to more than 2 percent higher.",
        "date": "02212017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Icahn buys Bristol-Myers shares  adding to activist pressure "
    },
    {
        "content": "Feb 21 Billionaire investor Carl Icahn has taken a stake in Bristol-Myers Squibb Co and sees the drugmaker as a possible takeover target  according to a report published on Tuesday that sent the company's shares from a loss to more than 2 percent higher.",
        "date": "02212017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 3-Icahn buys Bristol-Myers shares  adding to activist pressure "
    },
    {
        "content": "Activist investor Carl Icahn has taken a stake in Bristol-Myers Squibb Co   the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "02212017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Carl Icahn takes stake in Bristol Myers: WSJ "
    },
    {
        "content": "Feb 21 Activist investor Carl Icahn has taken a stake in Bristol-Myers Squibb Co  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "02212017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Carl Icahn takes stake in Bristol Myers - WSJ "
    },
    {
        "content": "* Bristol-Myers Squibb says expects to incur charges through 2020  ranging between $1.5 billion to $2.0 billion in connection with restructuring  announced in Oct 2016",
        "date": "02212017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers sees restructuring charges between $1.5-$2.0 bln through 2020 "
    },
    {
        "content": "LONDON Top AstraZeneca  shareholder Woodford Investment Management said on Wednesday it had added to its stake in the pharmaceutical firm and was confident in its growth outlook.",
        "date": "02162017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Top AstraZeneca shareholder Woodford adds to stake  bullish on outlook "
    },
    {
        "content": "Feb 21 Bristol-Myers Squibb Co said on Tuesday it appointed three directors to its board in a deal with JANA Partners LLC  an activist investor holding less than 1 percent of the company's stock.",
        "date": "02212017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers adds three directors in deal with JANA Partners "
    },
    {
        "content": "* Jana Partners LLC takes sole share stake of 3.9 million shares in Bristol-Myers - SEC filing",
        "date": "02142017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Jana Partners takes sole share stake in Bristol-Myers  Cognizant "
    },
    {
        "content": "Feb 21 Bristol-Myers Squibb Co said on Tuesday it appointed three directors to its board in a deal with activist investor Jana Partners LLC.",
        "date": "02212017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers adds three directors in deal with Jana Partners "
    },
    {
        "content": "* Bristol-Myers Squibb appoints three new independent directors  Source text for Eikon:  Further company coverage:",
        "date": "02212017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb appoints three new independent directors "
    },
    {
        "content": "* Bristol-Myers Squibb receives FDA approval for Opdivo (Nivolumab) in previously treated locally advanced or metastatic urothelial carcinoma  a type of bladder cancer",
        "date": "02022017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb receives FDA approval for Opdivo (Nivolumab) "
    },
    {
        "content": "* Bristol-Myers Squibb announces European Patent Office decision on Sprycel",
        "date": "02012017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers squibb announces European Patent Office decision on Sprycel "
    },
    {
        "content": "Feb 2 The U.S. Food and Drug Administration on Thursday expanded the use of Bristol-Myers Squibb Co's  Opdivo to include treatment of urothelial carcinoma  the most common type of bladder cancer.",
        "date": "02022017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "U.S. FDA approves Bristol-Myers' Opdivo for bladder cancer "
    },
    {
        "content": "* Granted accelerated approval to Bristol-Myers Squibb Company's  nivolumab for treatment of locally advanced or metastatic urothelial carcinoma  Source text - http://bit.ly/2k5g4BW Further company coverage:",
        "date": "02022017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-FDA grants accelerated approval to Bristol-Myers Squibb's nivolumab "
    },
    {
        "content": "Bristol-Myers Squibb Co  on Thursday posted a fourth-quarter profit that fell short of Wall Street estimates and lowered its 2017 earnings forecast  citing tempered expectations for its key Opdivo immuno-oncology drug.",
        "date": "01262017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers cuts 2017 outlook amid Opdivo competition "
    },
    {
        "content": "ZURICH  Jan 27 Roche's cancer drug Tecentriq hit the market months behind immuno-oncology (I/O) medicines from Merck and Bristol-Myers Squibb Co  but the Swiss drugmaker's treatment is making up lost ground.",
        "date": "01272017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Roche cancer drug taking bite out of Bristol's Opdivo "
    },
    {
        "content": "Jan 26 Bristol-Myers Squibb Co on Thursday posted a fourth-quarter profit that fell short of Wall Street estimates and lowered its 2017 earnings forecast  citing tempered expectations for its key Opdivo immuno-oncology drug.",
        "date": "01262017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 3-Bristol-Myers cuts 2017 outlook amid Opdivo competition "
    },
    {
        "content": "Jan 26 Bristol-Myers Squibb Co on Thursday reported fourth-quarter profit that fell short of Wall Street estimates and lowered its 2017 earnings forecast amid tempered expectations for its key Opdivo immuno-oncology drug.",
        "date": "01262017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers lowers 2017 earnings outlook "
    },
    {
        "content": "Jan 20 Merck & Co said it agreed to enter into a settlement and license agreement with Bristol-Myers Squibb Co and Ono Pharmaceutical Co Ltd to resolve a patent litigation related to its cancer drug  Keytruda.",
        "date": "01202017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Merck  Bristol-Myers agree to settle Keytruda patent suit "
    },
    {
        "content": "Jan 20 Merck & Co said it agreed to enter into a settlement and license agreement with Bristol-Myers Squibb Co and Ono Pharmaceutical Co Ltd to resolve all global patent-infringement litigation related to its cancer drug  Keytruda.",
        "date": "01202017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Merck  Bristol-Myers agree to settle Keytruda patent suit "
    },
    {
        "content": "New YORK Bristol-Myers Squibb Co  shares fell 11 percent on Friday following Thursday's announcement that it would not seek accelerated approval of its immunotherapy drug combination in first-line lung cancer  further solidifying Merck & Co Inc's  leading position in the burgeoning immuno-oncolgy field.",
        "date": "01202017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers lung cancer delay slams shares  keeps Merck in lead "
    },
    {
        "content": "New YORK  Jan 20 Bristol-Myers Squibb Co  shares fell 11 percent on Friday following Thursday's announcement that it would not seek accelerated approval of its immunotherapy drug combination in first-line lung cancer  further solidifying Merck & Co Inc's leading position in the burgeoning immuno-oncolgy field.",
        "date": "01202017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Bristol-Myers lung cancer delay slams shares  keeps Merck in lead "
    },
    {
        "content": "* Bristol-Myers Squibb and Ono Pharmaceutical Company enter settlement and license agreement with merck to resolve PD-1 antibody patent litigation",
        "date": "01202017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers squibb and Ono pharmaceutical enters license agreement with Merck "
    },
    {
        "content": "Jan 19 Bristol-Myers Squibb Co on Thursday said it has decided not to seek accelerated U.S. approval for its combination of two immunotherapy drugs as an initial treatment for lung cancer.",
        "date": "01192017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers won't seek accelerated Opdivo lung cancer approval "
    },
    {
        "content": "Bristol-Myers Squibb Co on Thursday said it has decided not to seek accelerated U.S. approval for a combination of its two immunotherapy drugs as an initial treatment for lung cancer.",
        "date": "01202017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol won't seek faster Opdivo/Yervoy lung cancer approval "
    },
    {
        "content": "* Bristol-Myers Squibb provides regulatory update in first-line lung cancer",
        "date": "01192017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers decides not to pursue accelerated regulatory pathway for combination of Opdivo plus Yervoy "
    },
    {
        "content": "Jan 19 Bristol-Myers Squibb Co on Thursday said it has decided not to seek accelerated U.S. approval for a combination of its two immunotherapy drugs as an initial treatment for lung cancer.",
        "date": "01202017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 2-Bristol won't seek faster Opdivo/Yervoy lung cancer approval "
    },
    {
        "content": "Jan 19 The U.S. Supreme Court on Thursday agreed to hear an appeal by pharmaceutical company Bristol-Myers Squibb Co in a dispute involving its blood-thinning medication Plavix that could limit where corporations can be sued  the second such case it has taken up in the past week.",
        "date": "01192017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "U.S. top court to hear Bristol-Myers out-of-state injury appeal "
    },
    {
        "content": "* Opdivo (nivolumab) demonstrated efficacy and improved survival in patients with previously treated advanced gastric cancer in a randomized Phase 3 study",
        "date": "01192017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Opdivo demonstrated efficacy in patients gastric cancer in a Phase 3 study "
    },
    {
        "content": "* Bristol-Myers Squibb CEO says expects oncology portfolio to be impacted by competition in 2017  particularly in lung cancer",
        "date": "01102017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers sees operating expenses flat through 2020 "
    },
    {
        "content": "* Innate Pharma receives $15 million milestone payment from Bristol-Myers Squibb",
        "date": "01092017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Innate Pharma receives $15 million milestone payment from Bristol-Myers Squibb "
    },
    {
        "content": "* Bristol-Myers Squibb and genecentric diagnostics announce exploratory biomarker research collaboration",
        "date": "01062017",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb and genecentric diagnostics announces exploratory biomarker research collaboration "
    },
    {
        "content": "TOKYO Ono Pharmaceutical Co cut its annual profit outlook by a quarter on Wednesday  hit by the Japanese government's decision to halve the price of cancer drug Opdivo that it co-developed with Bristol Myers Squibb Co.",
        "date": "12212016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Ono warns on profit after government halves price of cancer drug Opdivo "
    },
    {
        "content": "WASHINGTON Drugmaker Bristol-Myers Squibb Co will pay $19.5 million to resolve multi-state allegations that it improperly promoted a schizophrenia treatment for uses not approved by the U.S. government  New York Attorney General Eric Schneiderman said on Thursday.",
        "date": "12082016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers Squibb to pay $19.5 million to settle off-label promotion case "
    },
    {
        "content": "LONDON Bristol-Myers Squibb's immunotherapy drug Opdivo has been approved in Europe for the treatment of classical Hodgkin lymphoma  a rare blood cancer  the U.S. company said on Wednesday.",
        "date": "12072016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "EU clears Bristol-Myers immunotherapy drug for blood cancer "
    },
    {
        "content": "* European Commission approves Bristol-Myers Squibb's Opdivo (nivolumab) for the treatment of adult patients with relapsed or refractory classical hodgkin lymphoma after autologous stem cell transplant and treatment with brentuximab vedotin",
        "date": "11222016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers' Opdivo gets European Commission approval for relapsed or refractory CHL treatment "
    },
    {
        "content": "* Quintilesims forms new collaboration with Bristol-Myers Squibb  Lilly  Merck Kgaa  Darmstadt  Germany  and Pfizer to generate real world insights on usage of anti-cancer therapies across Europe  Source text for Eikon:  Further company coverage:",
        "date": "11222016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-QuintilesIMS forms new Collaboration with Bristol-Myers Squibb  Lilly  Merck KGaA  Darmstadt  Germany  and Pfizer to generate real world insights on usage of anti-cancer therapies across Europe "
    },
    {
        "content": "* Japan set cut due to high price of drug  Ono confirms   (Adds Japan price details)",
        "date": "11172016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "UPDATE 1-Japan sets 50 pct price cut for Bristol Myers' Opdivo cancer drug "
    },
    {
        "content": "LONDON  Nov 17 Roche and Bristol-Myers Squibb on Thursday became the latest drugmakers to cut the price of cancer medicines in order to secure access to Britain's National Health Service.",
        "date": "11172016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Roche  Bristol-Myers cut cancer drug prices to win UK approval "
    },
    {
        "content": "* Bristol-Myers Squibb and Enterome announce immuno-oncology collaboration focused on microbiome-derived biomarkers drug targets  bioactive molecules",
        "date": "11162016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb and Enterome announce immuno-oncology collaboration "
    },
    {
        "content": "* Bristol-Myers Squibb and infinity pharmaceuticals announce clinical collaboration to evaluate Opdivo (nivolumab) in combination with IPI-549 in advanced solid tumors",
        "date": "11092016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers  Infinity Pharma to evaluate Opdivo with IPI-549 in advanced solid tumors "
    },
    {
        "content": "ZURICH  Nov 7 Roche is pressing ahead with two skin cancer trials that combine its immunotherapy Tecentriq with other drugs after early data showed the treatments were well-tolerated and effective in a small number of patients  the company said Monday.",
        "date": "11072016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Roche advances skin cancer trials as part of combination therapy strategy "
    },
    {
        "content": "* Opdivo (nivolumab) demonstrates overall survival benefit in patients with unresectable advanced or recurrent gastric cancer in phase 3 study",
        "date": "11102016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Opdivo (nivolumab) demonstrates overall survival benefit in patients with unresectable advanced or recurrent gastric cancer in phase 3 study "
    },
    {
        "content": "* Bristol-Myers Squibb and Pfizer to deliver 12 new Eliquis (apixaban) presentations at American Heart Association (AHA) scientific sessions 2016  Source text for Eikon:  Further company coverage:",
        "date": "11102016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb and Pfizer to deliver 12 new Eliquis (apixaban) presentations at American Heart Association (AHA) scientific sessions 2016 "
    },
    {
        "content": "Bristol-Myers Squibb Co said on Thursday its blockbuster immunotherapy Opdivo helped patients with advanced stomach cancer live longer in a late-stage study  becoming the first drug of its kind to show a survival benefit in these patients.",
        "date": "11102016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers' Opdivo succeeds in key stomach cancer study "
    },
    {
        "content": "Nov 10 Bristol-Myers Squibb Co said on Thursday its blockbuster immunotherapy Opdivo helped patients with advanced stomach cancer live longer in a late-stage study  becoming the first drug of its kind to show a survival benefit in these patients.",
        "date": "11102016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 2-Bristol-Myers' Opdivo succeeds in key stomach cancer study "
    },
    {
        "content": "Nov 10 Bristol-Myers Squibb Co said on Thursday its blockbuster immunotherapy Opdivo helped patients with advanced stomach cancer live longer in a late-stage study.",
        "date": "11102016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers' Opdivo immunotherapy succeeds in key stomach cancer study "
    },
    {
        "content": "Nov 10 Bristol-Myers Squibb Co said on Thursday it agreed to pay Japan's Nitto Denko Corp $100 million up front for the right to its early-stage drug for liver fibrosis due to  fatty liver disease NASH or hepatitis C.",
        "date": "11102016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers' deepens focus on fibrosis with Nitto deal "
    },
    {
        "content": "* Bristol-Myers gets approval from Health Canada for Opdivo + Yervoy regimen for unresectable or metastatic melanoma  Source text for Eikon:  Further company coverage:",
        "date": "10312016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers gets Health Canada approval for combination regimen for unresectable or metastatic melanoma "
    },
    {
        "content": "* New results presented for opdivo (nivolumab) demonstrate encouraging response rate in an expanded population of heavily pre-treated classical hodgkin lymphoma patients",
        "date": "10252016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers presents new results for opdivo (nivolumab) "
    },
    {
        "content": "Merck & Co has won U.S. approval to market its immunotherapy Keytruda for use in previously untreated lung cancer patients two months ahead of schedule  making it the only such drug cleared for first-line treatment.",
        "date": "10252016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Merck wins early U.S. approval for Keytruda in untreated lung cancer "
    },
    {
        "content": "Oct 27 Bristol-Myers Squibb Co  whose high-profile Opdivo immunotherapy failed an important lung-cancer trial last summer  sharply raised its 2016 profit forecast after strong quarterly sales of other leading medicines.",
        "date": "10272016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "UPDATE 3-Bristol hikes 2016 profit forecast as top drugs deliver  shares jump "
    },
    {
        "content": "* FDA moves cement Merck's leading position in lung cancer   (Adds more detail on approval  competition  analyst comment)",
        "date": "10252016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Merck wins early U.S. approval for Keytruda in untreated lung cancer "
    },
    {
        "content": "Bristol-Myers Squibb Co   whose high-profile Opdivo immunotherapy failed an important lung-cancer trial last summer  sharply raised its 2016 profit forecast after strong quarterly sales of other leading medicines.",
        "date": "10272016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol hikes 2016 profit forecast as top drugs deliver  shares jump "
    },
    {
        "content": "* Bristol-Myers squibb reports third quarter financial results",
        "date": "10272016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb Q3 adjusted earnings $0.77/shr "
    },
    {
        "content": "Oct 27 Bristol-Myers Squibb Co  sharply raised its 2016 profit forecast after surprisingly strong quarterly sales for a handful of its other leading prescription drugs.",
        "date": "10272016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol hikes 2016 forecast after top drugs deliver "
    },
    {
        "content": "* Keeps full-year outlook   (Adds CEO  analyst comment  updates shares)",
        "date": "10202016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 2-Roche bets on new cancer drugs to offset patent expiries "
    },
    {
        "content": "* Receives positive CHMP opinion for Opdivo (nivolumab) for the treatment of adult patients with relapsed or refractory classical hodgkin lymphoma after autologous stem cell transplant and treatment with Brentuximab Vedot",
        "date": "10142016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers receives positive CHMP opinion for Opdivo "
    },
    {
        "content": "Oct 10 New data is likely to prompt doctors to abandon Bristol-Myers Squibb's immunotherapy Opdivo in favor of Merck & Co's rival Keytruda in a large segment of the lucrative lung cancer market  analysts said on Monday.",
        "date": "10102016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "UPDATE 1-Bristol lung-cancer setback puts rival Merck drug in driver seat "
    },
    {
        "content": "COPENHAGEN The failure of Bristol-Myers Squibb's blockbuster Opdivo immunotherapy in previously untreated lung cancer patients has opened up the market for AstraZeneca  its chief executive believes.",
        "date": "10082016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol drug flop opens big cancer opportunity: AstraZeneca CEO "
    },
    {
        "content": "New data is likely to prompt doctors to abandon Bristol-Myers Squibb's immunotherapy Opdivo in favor of Merck & Co's rival Keytruda in a large segment of the lucrative lung cancer market  analysts said on Monday.    The results of a closely watched clinical trial sent Bristol's shares plunging 10 percent.    The data  presented at a medical meeting on Sunday  showed that lung cancer patients fared worse on Opdivo than those on chemotherapy. Merck shares rose nearly 2 percent on stron",
        "date": "10112016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol lung-cancer setback puts rival Merck drug in driver seat "
    },
    {
        "content": "COPENHAGEN  Oct 9 Lung cancer patients on Roche's immune system-boosting drug Tecentriq lived on average 4.2 months longer than those taking chemotherapy in a pivotal study  pressuring Bristol-Myers Squibb's  dominant position in the field.",
        "date": "10092016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Roche lung cancer drug success adds to pressure on Bristol "
    },
    {
        "content": "* Keytruda cuts risk of death 40 pct in big lung cancer study",
        "date": "10092016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Merck drug shines in lung cancer and also works with chemo "
    },
    {
        "content": "Bristol-Myers Squibb Co said on Tuesday it would evaluate the use of its blockbuster cancer immunotherapy Opdivo in combination with an experimental drug from Nektar Therapeutics to treat multiple cancers.",
        "date": "09272016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers to test Opdivo with Nektar drug for several cancers "
    },
    {
        "content": "* Myers Squibb and Nektar Therapeutics announce Oncology clinical collaboration to evaluate combination of Opdivo (nivolumab) and NKTR-214",
        "date": "09272016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb and Nektar Therapeutics announce Oncology clinical collaboration "
    },
    {
        "content": "* European Medicines Agency validates Bristol Myers Squibb's type II variation application for Opdivo (nivolumab) in advanced form of bladder cancer",
        "date": "09202016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers says EMA validates type II variation application for Opdivo "
    },
    {
        "content": "New Mexico Attorney General Hector Balderas has sued Bristol-Myers Squibb Co and Sanofi SA's U.S. arm for overstating the effectiveness of and concealing the risks of their blood thinner Plavix.",
        "date": "09162016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "New Mexico AG sues Bristol-Myers  Sanofi over blood thinner "
    },
    {
        "content": "* Myers Squibb's Orencia\u007f (Abatacept) for the treatment of highly active and progressive disease in adult patients with rheumatoid arthritis not previously treated with Methotrexate",
        "date": "09062016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-European Commission approves Bristol-Myers Squibb's Orencia (Abatacept) "
    },
    {
        "content": "* Initiates Evaluation Of Tivozanib In Combination With Bristol Myers Squibb's Opdivo\u007f (nivolumab) in advanced renal cell carcinoma",
        "date": "08152016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Aveo initiates evaluation of Tivozanib in combination with Bristol-Myers Squibb's opdivo in advanced renal cell carcinoma "
    },
    {
        "content": "Bristol-Myers Squibb Co said its blockbuster Opdivo immunotherapy failed to slow progression of symptoms in previously untreated patients with advanced lung cancer  a major setback expected to benefit Merck & Co's rival medicine.",
        "date": "08052016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers' Opdivo fails lung cancer trial; shares plunge "
    },
    {
        "content": "Aug 5 Bristol-Myers Squibb Co said its blockbuster Opdivo immunotherapy failed to slow progression of symptoms in previously untreated patients with advanced lung cancer  a major setback expected to benefit Merck & Co's  rival medicine.",
        "date": "08052016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 4-Bristol-Myers' Opdivo fails lung cancer trial; shares plunge "
    },
    {
        "content": "* Moody's: Bristol's lung cancer trial result a major setback",
        "date": "08052016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Moody's says Bristol-Myers Squibb's lung cancer trial result a major setback "
    },
    {
        "content": "LONDON AstraZeneca  shares hit a record high on Friday  breaching for the first time the 55 pounds a share level offered by Pfizer  in 2014 during the U.S. group's abortive $100 billion attempt to buy the drugmaker.",
        "date": "08052016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "AstraZeneca hits 2014 Pfizer bid price  helped by Bristol's woes "
    },
    {
        "content": "* Bristol-Myers Squibb announces top-line results from checkmate -026  a phase 3 study of Opdivo (nivolumab) in treatment-naïve patients with advanced non-small cell lung cancer",
        "date": "08052016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers' Opdivo fails late-stage study in patients with lung cancer "
    },
    {
        "content": "Aug 5 Bristol-Myers Squibb Co said its blockbuster immunotherapy  Opdivo  failed to improve survival in previously untreated patients with a form of lung cancer  without their disease progressing  in a late-stage study.",
        "date": "08052016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers' Opdivo fails late-stage study in lung cancer patients "
    },
    {
        "content": "* Bristol-Myers squibb announces new research collaboration with janssen in immuno-oncology focused on lung cancer",
        "date": "07262016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb collaborates with Johnson and Johnson for lung cancer research "
    },
    {
        "content": "* Bristol Myers Squibb - In May 2016  co sold the business comprising an alliance with Reckitt Benckiser Group including several OTC products sold primarily in Mexico and Brazil",
        "date": "07282016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Says in May sold business comprising an alliance with Reckitt Benckiser "
    },
    {
        "content": "Bristol-Myers Squibb Co reported disappointing second-quarter sales of its Yervoy melanoma treatment on Thursday  raising concerns about the long-term prospects for one of its most important cancer medicines and sending its shares lower.",
        "date": "07282016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers shares hit by decline of Yervoy melanoma drug "
    },
    {
        "content": "July 28 Bristol-Myers Squibb Co reported disappointing second-quarter sales of its Yervoy melanoma treatment on Thursday  raising concerns about the long-term prospects for one of its most important cancer medicines and sending its shares lower.",
        "date": "07282016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 3-Bristol-Myers shares hit by decline of Yervoy melanoma drug "
    },
    {
        "content": "* Qtrly Opdivo worldwide revenues $840 million versus $122 million last year",
        "date": "07282016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers squibb reports Q2 non-gaap EPS $0.69 "
    },
    {
        "content": "July 28 Bristol-Myers Squibb Co reported better than expected quarterly results  fueled by sales of its treatments for hepatitis C  cancer and blood clots  and slightly raised its full year profit forecast.",
        "date": "07282016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers beats forecasts  as hepatitis  cancer drugs deliver "
    },
    {
        "content": "* Bristol-Myers Squibb announces availability of FDA-approved ORENCIA\u007f (abatacept) clickject(tm)  a self-administered subcutaneous autoinjector  for adults with moderate to severe rheumatoid arthritis",
        "date": "07202016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers says FDA-approved ORENCIA  clickject available "
    },
    {
        "content": "Some of the world's largest drug companies are taking out their checkbooks for acquisitions of smaller peers whose cancer drugs have the potential to cure not just patients  but corporate growth prospects as well.",
        "date": "07192016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Old pharma sees new profit cure in cancer drugs "
    },
    {
        "content": "* Bristol-Myers Squibb announces regulatory updates for Opdivo (nivolumab) in previously treated recurrent or metastatic squamous cell carcinoma of the head and neck",
        "date": "07182016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb- U.S.  EU regulators accept application to expand approval for cancer drug  Opdivo "
    },
    {
        "content": "July 19 Some of the world's largest drug companies are taking out their checkbooks for acquisitions of smaller peers whose cancer drugs have the potential to cure not just patients  but corporate growth prospects as well.",
        "date": "07192016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "DEALTALK-Old pharma sees new profit cure in cancer drugs "
    },
    {
        "content": "LONDON  July 5 Bristol-Myers Squibb's  immunotherapy drug Opdivo is not worth using on the state health service for treating kidney cancer  Britain's healthcare cost-effectiveness watchdog said on Tuesday.",
        "date": "07052016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "UK cost agency rejects Bristol's Opdivo for kidney cancer "
    },
    {
        "content": "* Myers Squibb Co - transaction includes upfront and near term contingent milestone payments of up to us $95 million",
        "date": "07052016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers acquires Cormorant Pharmaceuticals "
    },
    {
        "content": "* Bristol-Myers squibb and psioxus therapeutics announce immuno-oncology clinical collaboration to evaluate the combination of opdivo and enadenotucirev",
        "date": "06302016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb  Psioxus Therapeutics announce immuno-oncology clinical collaboration "
    },
    {
        "content": "A federal appeals court revived a lawsuit by Bristol-Myers Squibb Co accusing Indian generic drug maker Mylan Laboratories Ltd of breaching an agreement to distribute a generic version of an AIDS drug in developing countries.",
        "date": "07012016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Circuit revives Bristol-Myers lawsuit over AIDS drug distribution deal "
    },
    {
        "content": "* Bristol Myers Squibb Co - intends to file marketing application with health authorities based on results from phase 2 study ca209-275  other data",
        "date": "06272016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb's Opdivo gets breakthrough therapy approval from FDA "
    },
    {
        "content": "* Says it has earned a milestone for the dosing of a first patient in a clinical trial by its alliance partner  Bristol-Myers Squibb Company (BMS)",
        "date": "06152016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-PeptiDream achieves milestone for initiation of clinical development for bristol-myers squibb's first collaboration product candidate "
    },
    {
        "content": "* Says Opdivo demonstrated objective response rate of 66.3% in classical Hodgkin lymphoma patients",
        "date": "06102016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers announces phase 2 data for Opdivo studies "
    },
    {
        "content": "* Announces new rheumatoid arthritis research and real-world data at the annual European Congress Of Rheumatology (EULAR 2016)  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06082016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb announces new rheumatoid arthritis research "
    },
    {
        "content": "* Declared a quarterly dividend of $0.38 per share on $0.10 par value common stock of corporation  Source text for Eikon:  Further company coverage:",
        "date": "06072016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb declares qtrly dividend of $0.38/shr "
    },
    {
        "content": "* Bristol-Myers Squibb and MD Anderson announce new research collaboration in immuno-oncology focused on lung cancer",
        "date": "06072016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb  MD Anderson announce new collaboration focused on lung cancer "
    },
    {
        "content": "* Bristol-Myers Squibb -long-term data from two trials evaluating opdivo and yervoy regimen in advanced melanoma continues to validate co's immuno-oncology combination approach  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06062016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb posts data from trials evaluating Opdivo  Yervoy regimen "
    },
    {
        "content": "The California Supreme Court is set to decide whether non- residents can sue pharmaceutical giant Bristol-Myers Squibb in its state courts  in an appeal that could clarify what presence companies must have in California in order to be sued there by out-of-state plaintiffs.",
        "date": "05312016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Case to Watch: California to weigh jurisdiction for out-of-state plaintiffs "
    },
    {
        "content": "* Myers squibb announces health canada's approval of daklinza in combination with sofosbuvir",
        "date": "05242016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb says Health Canada approved Daklinza in combination with Sofosbuvir "
    },
    {
        "content": "* Inovalon announces agreement with Bristol-Myers Squibb to focus on real world outcomes & value-based contracting initiatives  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05192016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Inovalon Holdings announces agreement with Bristol-Myers Squibb "
    },
    {
        "content": "* Two-Year overall survival data from two pivotal opdivo\u007f (nivolumab) trials demonstrate sustained benefit in patients with advanced non-small cell lung cancer",
        "date": "05182016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb presents two-year overall survival data on Opdivo "
    },
    {
        "content": "LONDON AstraZeneca Chief Executive Pascal Soriot is a big believer in science  and the biggest experiment of his career is the reinvention of the drugmaker.",
        "date": "05182016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Pascal Soriot's big experiment: reinventing AstraZeneca "
    },
    {
        "content": "* $280 million project increases workforce  \"adds new capabilities\"  Source text for Eikon:  Further company coverage:",
        "date": "05172016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb opens expanded biologics facility "
    },
    {
        "content": "LONDON  May 18 AstraZeneca Chief Executive Pascal Soriot is a big believer in science  and the biggest experiment of his career is the reinvention of the drugmaker.",
        "date": "05182016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "INSIGHT-Pascal Soriot's big experiment: reinventing AstraZeneca "
    },
    {
        "content": "* Htg will provide bristol-myers squibb access to its ngs-based htg edgeseq system",
        "date": "05122016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-HTG Molecular diagnostics announces Immuno-oncology research collaboration agreement with Bristol-Myers Squibb "
    },
    {
        "content": "* Bristol-Myers squibb and abbvie announce european commission approval of empliciti(tm) (elotuzumab) for the treatment of multiple myeloma in adult patients who have received at least one prior therapy  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780; )",
        "date": "05112016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers says European Commission approval of Empliciti for treatment of multiple myeloma "
    },
    {
        "content": "* European Commission Approves The First And Only Immuno-Oncology Combination  Bristol-Myers Squibb's Opdivo\u007f (Nivolumab) + Yervoy\u007f (Ipilimumab) Regimen  For Treatment Of Advanced Melanoma",
        "date": "05112016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers says EU advanced melanoma drug "
    },
    {
        "content": "Bristol-Myers Squibb Co  ratcheted up its 2016 profit view after trouncing first-quarter sales and earnings forecasts on strong demand for its new Opdivo immuno-oncology drug and Eliquis blood clot preventer.",
        "date": "04282016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol raises 2016 forecast after earnings beat "
    },
    {
        "content": "April 28 Bristol-Myers Squibb Co  ratcheted up its 2016 profit view after trouncing first-quarter sales and earnings forecasts on strong demand for its new Opdivo immuno-oncology drug and Eliquis blood clot preventer.",
        "date": "04282016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 3-Bristol raises 2016 forecast after earnings beat "
    },
    {
        "content": "* Aims to be the world's largest contract manufacturer   (Adds company details  biotech market background)",
        "date": "04282016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Samsung Biologics plans IPO this year  seen worth as much as $2.6 bln "
    },
    {
        "content": "* Eiger biopharmaceuticals announces license of worldwide rights to pegylated interferon lambda-1a from bristol-myers squibb",
        "date": "04202016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Eiger Biopharmaceuticals says license of worldwide rights to Pegylated Interferon lambda-1a from Bristol-Myers Squibb "
    },
    {
        "content": "* Myers Squibb Co - will acquire all of outstanding capital stock of Padlock  a private  Cambridge  Massachusetts-based biotechnology company",
        "date": "03232016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb to acquire Padlock Therapeutics Inc "
    },
    {
        "content": "LONDON  March 8 U.S. drugmaker Bristol-Myers Squibb said on Tuesday it had stopped \"certain initiatives\" in China  when asked by Reuters to comment on industry chatter it was curbing financial incentives for prescribing doctors.",
        "date": "03082016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers Squibb says stops some initiatives in China "
    },
    {
        "content": "* \u007fCompletion of both transactions follows antitrust approval by relevant regulatory authorities in US  with integration process beginning immediately\u007f",
        "date": "02222016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-GSK's ViiV completes deal to buy Bristol-Myers Squibb's R&D HIV assets\u007f "
    },
    {
        "content": "NEW YORK Shares of Bristol-Myers Squibb could rise 25 percent within a year because of its cancer-fighting drug Opdivo  which some analysts see generating $8 billion to $9 billion in annual sales in five years  Barron's said in its latest edition.",
        "date": "02142016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers shares could rise 25 percent on cancer drug: Barron's "
    },
    {
        "content": "NEW YORK  Feb 14 Shares of Bristol-Myers Squibb  could rise 25 percent within a year because of its cancer-fighting drug Opdivo  which some analysts see generating $8 billion to $9 billion in annual sales in five years  Barron's said in its latest edition.",
        "date": "02142016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers shares could rise 25 pct on cancer drug-Barron's "
    },
    {
        "content": "Bristol-Myers Squibb Co  on Thursday positioned itself as a potential earnings pacesetter in 2016  with a forecast of up to 19 percent growth that eclipses profit gains expected by most other large drugmakers.",
        "date": "01282016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers set to lead earnings parade in 2016  beyond "
    },
    {
        "content": "Jan 28 Bristol-Myers Squibb Co on Thursday positioned itself as a potential earnings pacesetter in 2016  with a forecast of up to 19 percent growth that eclipses profit gains expected by most other large drugmakers.",
        "date": "01282016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "WRAPUP 1-Bristol-Myers set to lead earnings parade in 2016  beyond "
    },
    {
        "content": "Bristol-Myers Squibb Co  forecast 2016 earnings slightly above Wall Street estimates and said it had halted a large trial of its Opdivo immuno-oncology drug after an independent monitoring committee concluded it prolonged survival compared to standard therapy for head and neck cancer.",
        "date": "01282016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers forecasts 2016 profit above Wall Street estimates "
    },
    {
        "content": "Jan 28 Bristol-Myers Squibb Co forecast 2016 earnings slightly above Wall Street estimates and said it had halted a large trial of its Opdivo immuno-oncology drug after an independent monitoring committee concluded it prolonged survival compared to standard therapy for head and neck cancer.",
        "date": "01282016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 2-Bristol-Myers forecasts 2016 profit above Wall Street estimates "
    },
    {
        "content": "Jan 28 Bristol-Myers Squibb Co  forecast 2016 earnings slightly above Wall Street estimates and said it had halted a large trial of its Opdivo immuno-oncology drug after an independent monitoring committee concluded it prolonged survival compared to standard therapy for head and neck cancer.",
        "date": "01282016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "CORRECTED-UPDATE 1-Bristol-Myers forecasts 2016 profit above Wall Street estimates "
    },
    {
        "content": "Jan 28 Bristol-Myers Squibb Co reported better-than-expected quarterly results  helped by strong sales of its cancer treatments and its Eliquis pill to prevent blood clots  and predicted 2016 earnings slightly above Wall Street forecasts.",
        "date": "01282016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "REFILE-Bristol-Myers forecasts 2016 profit above Wall Street estimates "
    },
    {
        "content": "* \u007fOncodesign Biotechnology and Bristol-Myers Squibb  enter into strategic drug discovery collaboration\u007f",
        "date": "01052016",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Oncodesign and Bristol-Myers Squibb enter into strategic drug discovery collaboration\u007f "
    },
    {
        "content": "NEW YORK  Dec 23 A new class of blood thinners that competes with widely used warfarin should get a boost next year when an \"antidote\" that can reverse the medications' effects in an emergency is expected to enter the market  according to top U.S. heart doctors and investors.",
        "date": "12232015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "New blood thinner 'antidote' to help doctors move past warfarin "
    },
    {
        "content": "LONDON  Dec 18 British pharmaceutical company GlaxoSmithKline said it would buy HIV drugs at different stages of development from U.S. rival Bristol-Myers Squibb  in a deal which would boost its ViiV Healthcare unit.",
        "date": "12182015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "GSK to buy HIV drugs from Bristol-Myers Squibb "
    },
    {
        "content": "Nov 30 The U.S. Food and Drug Administration said on Monday it had approved a drug to be sold by Bristol-Myers Squibb Co as a treatment for a form of blood cancer.",
        "date": "11302015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "FDA approves new Bristol-Myers treatment for multiple myeloma "
    },
    {
        "content": "Bristol-Myers Squibb Co said the U.S. Food and Drug Administration declined to approve its immuno-oncology drug  Opdivo  for its expanded use to treat an additional type of advanced skin cancer.",
        "date": "11272015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "FDA declines expanded approval for Bristol-Myers' Opdivo drug "
    },
    {
        "content": "A United Nations-backed organization working to cut the price of HIV drugs said it had signed a deal with Bristol-Myers Squibb Co to allow generic versions of the company's hepatitis C drug to be sold in 112 low- and middle-income countries.",
        "date": "11232015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers signs deal with U.N. group for generic hepatitis C drug "
    },
    {
        "content": "Nov 24 Bristol-Myers Squibb Co said the U.S. Food and Drug Administration had approved the expanded use of its cancer drug  Opdivo  to treat an additional form of advanced skin cancer.",
        "date": "11242015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "FDA approves expanded use of Bristol-Myers' skin cancer drug "
    },
    {
        "content": "MOSCOW  Nov 20 Russian food retailer Dixy  said on Friday it could sell its 33 percent interest in tobacco and spirits chain Bristol after Russia's competition watchdog blocked its attempt to take a bigger stake.",
        "date": "11202015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "UPDATE 1-Russia's Dixy says likely to sell stake in rival Bristol "
    },
    {
        "content": "MOSCOW  Nov 13 Russia's competition watchdog FAS has blocked food retailer Dixy Group's bid to buy a controlling stake in tobacco and spirits chain Bristol.",
        "date": "11132015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "UPDATE 1-Russian watchdog rejects retailer Dixy's plan to buy rival Bristol "
    },
    {
        "content": "Bristol-Myers Squibb Co  said on Monday it bought privately held drug developer Cardioxyl Pharmaceuticals Inc in a deal worth up to $2.07 billion  to gain access to a heart failure treatment.",
        "date": "11022015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers buys private drugmaker to boost heart treatment pipeline "
    },
    {
        "content": "Nov 2 Bristol-Myers Squibb Co said on Monday it bought privately held drug developer Cardioxyl Pharmaceuticals Inc in a deal worth up to $2.07 billion  to gain access to a heart failure treatment.",
        "date": "11022015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Bristol-Myers buys private drugmaker to boost heart treatment pipeline "
    },
    {
        "content": "The U.S. Food and Drug Administration expanded the use of Bristol-Myers Squibb Co's skin cancer drug  Yervoy  as an additional therapy for patients with late-stage melanoma.",
        "date": "10282015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "FDA expands use of Bristol Myers' cancer drug Yervoy "
    },
    {
        "content": "Nov 2 Bristol-Myers Squibb Co said it would buy privately held drug developer Cardioxyl Pharmaceuticals Inc in a deal worth up to $2.07 billion  to gain access to a heart failure treatment.",
        "date": "11022015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers to buy private drugmaker for up to $2 bln "
    },
    {
        "content": "Oct 28 The U.S. Food and Drug Administration expanded the use of Bristol-Myers Squibb Co's skin cancer drug  Yervoy  as an additional therapy for patients with late-stage melanoma.",
        "date": "10282015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-FDA expands use of Bristol Myers' cancer drug Yervoy "
    },
    {
        "content": "Bristol-Myers Squibb Co  on Tuesday reported better than expected quarterly earnings  fueled by surging sales of its recently approved Opdivo immuno-oncology drug  hepatitis C treatments and its Eliquis blood clot preventer.",
        "date": "10272015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol cancer  clot drugs drive profit beat  shares rise "
    },
    {
        "content": "NEW YORK  Oct 27 Growing sales of expensive new cancer drugs and other newer medicines propelled top U.S. drugmakers Pfizer Inc  Merck & Co and Bristol-Myers Squibb Co to stronger-than-expected third-quarter profits.",
        "date": "10282015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "CORRECTED-WRAPUP 1-Top U.S. drugmakers ride new products to strong results "
    },
    {
        "content": "Oct 27 Bristol-Myers Squibb Co on Tuesday reported better than expected quarterly earnings  fueled by surging sales of its recently approved Opdivo immuno-oncology drug  hepatitis C treatments and its Eliquis blood clot preventer.",
        "date": "10272015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Bristol cancer  clot drugs drive profit beat  shares rise "
    },
    {
        "content": "Oct 27 Bristol-Myers Squibb Co reported better than expected quarterly earnings  fueled by surging sales of its recently approved Opdivo immuno-oncology drug  hepatitis C treatments and its Eliquis blood clot preventer.",
        "date": "10272015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol beats forecasts as cancer  blood clot drugs deliver "
    },
    {
        "content": "Bristol-Myers Squibb Co said on Thursday it agreed to exclusively license and collaborate with Five Prime Therapeutics Inc to develop and commercialize Five Prime's antibody program in the treatment of cancer.",
        "date": "10152015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers  Five Prime enter licensing deal of up to $1.74 billion "
    },
    {
        "content": "Oct 15 Bristol-Myers Squibb Co said on Thursday it agreed to exclusively license and collaborate with Five Prime Therapeutics Inc to develop and commercialize Five Prime's antibody program in the treatment of cancer.",
        "date": "10152015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers  Five Prime enter licensing deal of up to $1.74 bln "
    },
    {
        "content": "* Has received a $5 million milestone payment from Bristol-Myers Squibb as part of lirilumab licencing agreement",
        "date": "10142015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Innate Pharma receives development milestone payment from Bristol-Myers Squibb "
    },
    {
        "content": "The U.S. Food and Drug Administration on Friday expanded its approval of Bristol-Myers Squibb Co's immunotherapy drug Opdivo for patients with an additional form of advanced lung cancer.",
        "date": "10092015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "FDA expands lung cancer approval for Bristol-Myers' drug "
    },
    {
        "content": "Oct 9 The U.S. Food and Drug Administration on Friday expanded its approval of Bristol-Myers Squibb Co's  immunotherapy drug Opdivo for patients with an additional form of advanced lung cancer.",
        "date": "10092015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-FDA expands lung cancer approval for Bristol-Myers' drug "
    },
    {
        "content": "Oct 2 The U.S. Food and Drug Administration on Friday approved Merck & Co Inc's immunotherapy  Keytruda  for patients with the most common form of lung cancer whose tumors produce a specific biological marker.",
        "date": "10022015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 3-U.S. FDA expands approval of Merck's Keytruda to lung cancer "
    },
    {
        "content": "The U.S. Food and Drug Administration on Thursday approved the first combination of two drugs that help the immune system fight cancer  a therapy regimen that could cost $256 000 a year.",
        "date": "10012015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "FDA approves costly Bristol-Myers drug combo for melanoma "
    },
    {
        "content": "* First-ever approval of immuno-oncology combination - company",
        "date": "10012015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 3-FDA approves costly Bristol-Myers drug combo for melanoma "
    },
    {
        "content": "Oct 1 Drugmaker Bristol-Myers Squibb Co  said its combination of two treatments to treat a form of skin cancer was approved for marketing by the U.S. Food and Drug Administration.",
        "date": "10012015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "FDA approves Bristol Myers' combination treatment for skin cancer "
    },
    {
        "content": "Sept 26 Bristol-Myers Squibb's  immunotherapy drug Opdivo extended kidney cancer survival rates by more than two years in a late-stage trial  setting it up to be used beyond melanoma and lung cancer.",
        "date": "09252015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol's Opdivo boosts kidney cancer survival beyond two years "
    },
    {
        "content": "An early-stage study shows Bristol-Myers Squibb Co's Opdivo treatment can be safely and effectively paired with relatively low and infrequent dosages of the company's other immunotherapy  Yervoy  for patients with previously untreated lung cancer  researchers said on Monday.",
        "date": "09072015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol pairs Yervoy safely with Opdivo vs lung cancer "
    },
    {
        "content": "Aug 31 The following bids  mergers  acquisitions and disposals were reported by 2030 GMT on Monday:",
        "date": "08312015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Drugmaker Bristol-Myers Squibb said it bought rights to a mid-stage fibrosis drug and its privately held developer for up to $1.25 billion  boosting its pipeline for drugs that treat tissue scarring.",
        "date": "08312015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers buys rights to acquire fibrosis drug developer "
    },
    {
        "content": "Aug 31 Drugmaker Bristol-Myers Squibb  said it bought rights to a mid-stage fibrosis drug and its privately held developer for up to $1.25 billion  boosting its pipeline for drugs that treat tissue scarring.",
        "date": "08312015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Bristol-Myers buys rights to acquire fibrosis drug developer "
    },
    {
        "content": "Aug 31 Drugmaker Bristol-Myers Squibb  said it would buy the worldwide rights to a mid-stage fibrosis drug from privately held Promedior Inc for up to $1.25 billion.",
        "date": "08312015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers buys rights to fibrosis drug for up to $1.25 bln "
    },
    {
        "content": "The U.S. Food and Drug Administration on Friday approved two treatments for less common forms of hepatitis C virus (HCV) infections.",
        "date": "07242015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "AbbVie  Bristol-Myers get FDA nod for hep C treatments "
    },
    {
        "content": "July 24 The U.S. Food and Drug Administration on Friday approved two treatments for less common forms of hepatitis C virus (HCV) infections.",
        "date": "07242015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "CORRECTED-UPDATE 2-AbbVie  Bristol-Myers get FDA nod for hep C treatments "
    },
    {
        "content": "Bristol-Myers Squibb Co on Thursday reported far better than expected quarterly results thanks largely to delayed reimbursement for two hepatitis C treatments in France and demand for other leading company medicines.",
        "date": "07232015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol beats forecasts  raises profit view  shares jump "
    },
    {
        "content": "July 23 Bristol-Myers Squibb Co on Thursday reported far better than expected quarterly results thanks largely to delayed reimbursement for two hepatitis C treatments in France and demand for other leading company medicines.",
        "date": "07232015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 2-Bristol beats forecasts  raises profit view  shares jump "
    },
    {
        "content": "July 23 Bristol-Myers Squibb Co reported far better than expected quarterly results thanks largely to delayed reimbursement for two hepatitis C treatments in France and demand for other leading company medicines.",
        "date": "07232015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers beats forecasts  raises full-year profit view "
    },
    {
        "content": "July 20 Bristol-Myers Squibb Co's  Opdivo  a new oncology drug that makes cancer cells more susceptible to the immune system  on Monday won European approval to treat a form of lung cancer and was also found to be beneficial in patients with advanced kidney cancer.",
        "date": "07202015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers cancer immunotherapy advances on two fronts "
    },
    {
        "content": "A federal judge in Manhattan has rejected a last-ditch attempt by Bristol-Myers Squibb Co to save a lawsuit accusing Mylan Laboratories Ltd of breaching an agreement to distribute an AIDS drug in developing countries  refusing to reconsider his second order dismissing the case.",
        "date": "07212015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers loses bid to revive drug distribution lawsuit "
    },
    {
        "content": "June 25 Bristol-Myers Squibb said on Thursday that it would stop efforts to find new antiviral drugs and cut 100 related jobs.",
        "date": "06252015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers to stop new antiviral drug research "
    },
    {
        "content": "MOSCOW  June 5 Russian food retailer Dixy  plans to buy a controlling stake in spirits and tobacco chain Bristol in the second half of 2015  Dixy Chief Financial Officer Fedor Rybasov said on Friday.",
        "date": "06052015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Russia's Dixy plans to buy control of Bristol chain in H2 "
    },
    {
        "content": "* Will make a one-time $4 mln licensing payment to Bristol-Myers Squibb upon execution of license",
        "date": "06022015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "BRIEF-Genmab gains license to antibody panel targeting CD19 "
    },
    {
        "content": "New data to be released this weekend should help deepen the understanding of how broadly new drugs that unleash the body's immune system to fight cancer can be used.",
        "date": "05282015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "New drugs from Bristol  Merck at forefront of cancer meeting "
    },
    {
        "content": "Chicago Bristol-Myers Squibb Co's drug  Opdivo  improved survival in a trial of patients with the most common form of lung cancer  but it did not work in patients who tested negative for a specific protein in their tumors  leading to a nearly 7 percent sell-off in the company's shares on Friday.",
        "date": "05292015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol's Opdivo cuts risk of lung cancer death for some "
    },
    {
        "content": "May 28 Otsuka Pharmaceutical Co Ltd has lost a lawsuit challenging the U.S. Food and Drug Administration's decision to allow generic versions of the company's antipsychotic drug Abilify.",
        "date": "05282015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Otsuka loses lawsuit challenging FDA approval of generic Abilify "
    },
    {
        "content": "Chicago May 29 Bristol-Myers Squibb Co's  drug  Opdivo  improved survival in a trial of patients with the most common form of lung cancer  but it did not work in patients who tested negative for a specific protein in their tumors  leading to a nearly 7 percent sell-off in the company's shares on Friday.",
        "date": "05292015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Bristol's Opdivo cuts risk of lung cancer death for some "
    },
    {
        "content": "May 28 Otsuka Pharmaceutical Co Ltd has lost a lawsuit challenging the U.S. Food and Drug Administration's decision to allow generic versions of the company's antipsychotic drug Abilify.",
        "date": "05282015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Otsuka loses lawsuit challenging FDA approval of generic Abilify "
    },
    {
        "content": "NEW YORK  May 29 Bristol-Myers Squibb  has sued a top cancer immunotherapy executive for violating confidentiality and non-compete agreements after he left for direct competitor AstraZeneca  court documents show.",
        "date": "05292015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers sues immunotherapy exec who left for AstraZeneca "
    },
    {
        "content": "Intel Corp has resumed talks to buy programmable-chip maker Altera Corp and is close to a $16 billion deal  people familiar with the matter say  paving way for the third mega semiconductor-chip deal this year. (ALTERA-M&A/INTEL (UPDATE 2)  moved  by Greg Roumeliotis and Liana B. Baker  210 words)",
        "date": "05292015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Reuters Business News Schedule at 1830 GMT/2:30 PM ET "
    },
    {
        "content": "Chicago May 29 Bristol-Myers Squibb Co's  drug  Opdivo  improved survival for patients with the most common form of lung cancer  nearly doubling survival for those with high levels of a specific protein in their tumors compared with chemotherapy  according to clinical trial results presented on Friday.",
        "date": "05292015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol's Opdivo reduces risk of death from common lung cancer "
    },
    {
        "content": "May 22 European regulators have recommended approval of Merck & Co Inc's immune system-boosting cancer drug Keytruda  following a similar green light last month for Bristol-Myers Squibb Co's rival product Opdivo.",
        "date": "05222015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Merck follows Bristol with EU green light for immune cancer drug "
    },
    {
        "content": "A federal judge in New York has thrown out  for the second time  a lawsuit accusing Mylan Laboratories Ltd of breaching an agreement with Bristol-Myers Squibb Co to distribute an AIDS drug in developing countries  after being ordered by an appellate court to reconsider.",
        "date": "05142015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol-Myers' suit over drug distribution deal dismissed  again "
    },
    {
        "content": "WASHINGTON  May 4 The U.S. Supreme Court on Monday brought to an end Bristol-Myers Squibb Co's  attempt to revive patent protection for its Baraclude treatment for hepatitis B.",
        "date": "05042015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "U.S. top court rejects hepatitis B drug patent case "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 30 (Fitch) Fitch Ratings has assigned an 'A-' rating to  Bristol-Myers Squibb Co.'s (Bristol- Myers  Bristol  BMY) Euro Bond issuance.  The net proceeds from the issuance are expected to be used to fund  in part  the  redemption of the company's existing 2016 and 2022 senior unsecured Euro notes.  A full list of the company's ratings follows at the end of this press release. KEY RATING DRIVERS --Fitch expects Bristol-Myer",
        "date": "04302015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Fitch Rates Bristol-Myers Squibb's Euro Bond Issuance 'A-' "
    },
    {
        "content": "FRANKFURT  April 30 Bayer brushed off concern that its stroke prevention pill Xarelto may be losing market share to rival Bristol-Myers Squibb's Eliquis in the United States.",
        "date": "04302015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bayer says Xarelto isn't losing U.S. market share to Eliquis "
    },
    {
        "content": "Thomson Reuters April 30  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04302015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "April 28 Investors betting that Bristol-Myers Squibb will emerge as the leading player in a hot new class of cancer drugs hit the pause button on Tuesday as a rival therapy from Merck & Co showed much higher sales.",
        "date": "04292015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "RPT-Strong Merck cancer drug sales upstage rival Bristol-Myers "
    },
    {
        "content": "Investors betting that Bristol-Myers Squibb will emerge as the leading player in a hot new class of cancer drugs hit the pause button on Tuesday as a rival therapy from Merck & Co showed much higher sales.",
        "date": "04282015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Strong Merck cancer drug sales upstage rival Bristol-Myers "
    },
    {
        "content": "April 28 The U.S. Food and Drug Administration said it approved the first copycat versions of Otsuka Pharmaceutical Co Ltd's antipsychotic drug  Abilify.",
        "date": "04282015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-FDA approves generic versions of antipsychotic drug Abilify "
    },
    {
        "content": "LONDON European regulators have recommended approval of Bristol-Myers Squibb's Opdivo  paving the way for it to become the first of a closely watched group of immune system-boosting cancer medicines to go on sale in Europe.",
        "date": "04242015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol wins EU green light for immune system cancer drug "
    },
    {
        "content": "Bristol-Myers Squibb Co  on Tuesday reported first-quarter sales of its new cancer immunotherapy Opdivo that were about half of those for a rival medicine from Merck & Co   and its shares fell 2 percent.",
        "date": "04282015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "High-profile Bristol cancer drug disappoints  shares off "
    },
    {
        "content": "LONDON  April 24 European regulators have recommended approval of Bristol-Myers Squibb's Opdivo  paving the way for it to become the first of a closely watched group of immune system-boosting cancer medicines to go on sale in Europe.",
        "date": "04242015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Bristol wins EU green light for immune system cancer drug "
    },
    {
        "content": "April 28 Bristol-Myers Squibb Co on Tuesday reported first-quarter sales of its new cancer immunotherapy Opdivo that were about half of those for a rival medicine from Merck & Co  and its shares fell 2 percent.",
        "date": "04282015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 2-High-profile Bristol cancer drug disappoints  shares off "
    },
    {
        "content": "* Recommends approval of melanoma drug nivolumab from Bristol-Myers Squibb Co",
        "date": "04242015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-EU medicines agency backs Bristol Myers Squibb's melanoma drug "
    },
    {
        "content": "Thomson Reuters April 28  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04282015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "April 28 Bristol-Myers Squibb Co  reported better than expected quarterly results  helped by cost cuts and a higher estimate of royalties owed the company from sales of its Abilify schizophrenia treatment.",
        "date": "04282015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers tops forecasts  helped by Abilify royalty adjustment "
    },
    {
        "content": "April 17 A large study of Bristol-Myers Squibb Co's Opdivo treatment has been halted after proving the drug is effective against a common form of lung cancer  the company said  positioning the medicine for far wider use than its already approved lung cancer and melanoma indications.",
        "date": "04172015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol's Opdivo proves effective against second type of lung cancer "
    },
    {
        "content": "April 17 A large study of Bristol-Myers Squibb Co's Opdivo treatment has been halted after proving the drug is effective against the most common form of lung cancer  the company said  positioning the medicine for far wider use than its already approved lung cancer and melanoma indications.",
        "date": "04172015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 2-Bristol's Opdivo proves effective against second type of lung cancer "
    },
    {
        "content": "April 6 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "04062015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Bristol-Myers Squibb Co said it would invest in Dutch biotech uniQure NV  joining other big drugmakers who have moved to gain a foothold in the promising gene therapy market.",
        "date": "04062015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers to invest in Dutch gene therapy company uniQure "
    },
    {
        "content": "April 6 Bristol-Myers Squibb Co said it would invest in Dutch biotech uniQure NV  joining other big drugmakers who have moved to gain a foothold in the promising gene therapy market.",
        "date": "04062015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "REFILE-UPDATE 1-Bristol-Myers to invest in Dutch gene therapy company uniQure "
    },
    {
        "content": "April 6 Bristol-Myers Squibb Co said it would invest in Dutch biotech uniQure NV to get access to uniQure's gene therapy technology platform for cardiovascular diseases.",
        "date": "04062015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers buys into Dutch gene therapy company uniQure "
    },
    {
        "content": "March 24 Merck & Co Inc said on Tuesday that it would stop a large study of its Keytruda melanoma treatment early because an independent monitoring committee determined the drug succeeded in its goal of prolonging survival in previously untreated patients at advanced stage of the disease.",
        "date": "03242015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "UPDATE 1-Merck says melanoma drug meets goal; study halted "
    },
    {
        "content": "March 24 Bristol-Myers Squibb said on Tuesday it had agreed to acquire rights to a Novo Nordisk  immune system research programme  which the Danish company is divesting as it focuses further on diabetes care.",
        "date": "03242015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers buys rights to Novo Nordisk immune system project "
    },
    {
        "content": "LONDON  March 23 Bristol-Myers Squibb  Sanofi and Novartis have the three top new drugs set to reach the market in 2015  among 11 products each with $1 billion-plus sales potential  according to a Thomson Reuters analysis.",
        "date": "03232015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol  Sanofi and Novartis drugs to shine among 2015 launches "
    },
    {
        "content": "* Up from three potential $1 billion-plus drugs in 2014   (Updates with link to report  paragraph 5)",
        "date": "03232015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Bristol  Sanofi and Novartis drugs to shine among 2015 launches "
    },
    {
        "content": "Bristol Palin  a reality TV personality and daughter of 2008 Republican vice presidential candidate Sarah Palin  is engaged to marry Medal of Honor winner Dakota Meyer  the couple said on Saturday.",
        "date": "03152015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol Palin to marry U.S. Medal of Honor winner Dakota Meyer "
    },
    {
        "content": "March 12 Bristol-Myers Squibb Co said U.S. regulators have accepted the company's re-submitted marketing application for an experimental treatment for hepatitis C  following the drugmaker's decision last year to pull back its initial marketing request.",
        "date": "03122015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "FDA to review re-submitted Bristol-Myers hepatitis C drug "
    },
    {
        "content": "March 12 U.S. regulators have accepted Bristol-Myers Squibb Co's re-submitted marketing application for an experimental hepatitis C treatment after the drugmaker was forced last year to withdraw its initial request.",
        "date": "03122015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-FDA to review re-submitted Bristol-Myers hepatitis C drug "
    },
    {
        "content": "U.S. health regulators on Wednesday swiftly approved a Bristol-Myers Squibb Co drug that helps the immune system fight the most common form of lung cancer  sending the company's shares up more than 5 percent to a multi-year high.",
        "date": "03042015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "U.S. FDA approves Bristol-Myers immunotherapy for lung cancer "
    },
    {
        "content": "March 4 U.S. health regulators on Wednesday swiftly approved a Bristol-Myers Squibb Co drug that helps the immune system fight the most common form of lung cancer  sending the company's shares up more than 5 percent to a multi-year high.",
        "date": "03042015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-U.S. FDA approves Bristol-Myers immunotherapy for lung cancer "
    },
    {
        "content": "LONDON The idea of using vaccines to fight cancer has received a shot in the arm from a $1 billion deal between Bristol-Myers Squibb and Bavarian Nordic.",
        "date": "03042015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol's $1 billion Bavarian deal may signal cancer vaccine revival "
    },
    {
        "content": "LONDON  March 4 The idea of using vaccines to fight cancer has received a shot in the arm from a $1 billion deal between Bristol-Myers Squibb and Bavarian Nordic .",
        "date": "03042015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol's $1 bln Bavarian deal may signal cancer vaccine revival "
    },
    {
        "content": "COPENHAGEN Bavarian Nordic  has struck a prostate cancer drug deal with Bristol-Myers Squibb  that could be worth $1 billion should its trials  part of a new field in cancer treatment  be successful.",
        "date": "03042015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bavarian Nordic shares leap on $1 billion Bristol-Myers deal "
    },
    {
        "content": "COPENHAGEN  March 4 Bavarian Nordic  has struck a prostate cancer drug deal with Bristol-Myers Squibb  that could be worth $1 billion should its trials  part of a new field in cancer treatment  be successful.",
        "date": "03042015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 2-Bavarian Nordic shares leap on $1 bln Bristol-Myers deal "
    },
    {
        "content": "COPENHAGEN  March 4 Bavarian Nordic  expects the full results of its Phase III trials for prostate cancer drug Prostvac by early 2017  Chief Executive Paul Chaplin said after the Danish firm struck a $1 billion supply deal with Bristol-Myers Squibb.",
        "date": "03042015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bavarian sees results of Phase III Prostvac trial by early 2017 "
    },
    {
        "content": "COPENHAGEN  March 4 Shares in Bavarian Nordic  leapt as much as 39 percent on Wednesday after the Danish biotech company announced a prostate cancer drug deal with Bristol-Myers Squibb that could be worth at least $1 billion.",
        "date": "03042015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bavarian Nordic shares leap on $1 bln Bristol-Myers deal "
    },
    {
        "content": "* Bristol-Myers Squibb signs exclusive agreement with Bavarian Nordic for PROSTVAC  a prostate-specific antigen-targeting cancer immunotherapy",
        "date": "03042015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "BRIEF-Bristol-Myers Squibb signs exclusive agreement with Bavarian Nordic for PROSTVAC "
    },
    {
        "content": "Ninety-seven percent of hepatitis C patients also infected with HIV were cured of the liver-destroying virus after 12 weeks of treatment with Bristol-Myers Squibb's daclatasvir and Gilead Sciences' Sovaldi  according to data from a study presented on Thursday.",
        "date": "02262015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Bristol hep C drug helps cure 97 percent of HIV coinfected patients: study "
    },
    {
        "content": "Feb 26 Ninety-seven percent of hepatitis C patients also infected with HIV were cured of the liver-destroying virus after 12 weeks of treatment with Bristol-Myers Squibb's daclatasvir and Gilead Sciences'  Sovaldi  according to data from a study presented on Thursday.",
        "date": "02262015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol hep C drug helps cure 97 pct of HIV coinfected patients-study "
    },
    {
        "content": "Feb 23 The following bids  mergers  acquisitions and disposals were reported by 2115 GMT on Monday:",
        "date": "02232015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Bristol-Myers Squibb Co  said it would buy privately held drugmaker Flexus Biosciences Inc for up to $1.25 billion to add an emerging class of cancer-fighting drugs to its pipeline.",
        "date": "02232015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers to buy private cancer drugmaker for up to $1.25 billion "
    },
    {
        "content": "Feb 23 Bristol-Myers Squibb Co said it would buy privately held drugmaker Flexus Biosciences Inc for up to $1.25 billion to add an emerging class of cancer-fighting drugs to its pipeline.",
        "date": "02232015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Bristol-Myers to buy private cancer drugmaker for up to $1.25 bln "
    },
    {
        "content": "Feb 23 Bristol-Myers Squibb Co said it would buy privately held drugmaker Flexus Biosciences Inc for up to $1.25 billion to expand its pipeline of cancer drugs.",
        "date": "02232015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers to buy private cancer drugmaker for up to $1.25 bln "
    },
    {
        "content": "The U.S. Food and Drug Administration on Thursday approved two fixed-dose HIV pills that combine protease inhibitors - one made by Bristol-Myers Squibb Co and the other by Johnson & Johnson - both with a boosting agent produced by Gilead Sciences Inc.",
        "date": "01292015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "FDA approves Bristol-Myers  J&J HIV pills "
    },
    {
        "content": "Jan 29 The U.S. Food and Drug Administration has approved the sale of Evotaz  a once-daily combination pill to treat HIV made by Bristol-Myers Squibb Co  the company said on Thursday.",
        "date": "01292015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "U.S. FDA approves Bristol-Myers' HIV drug "
    },
    {
        "content": " ",
        "date": "01272015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "topStory",
        "symbol": "BMY",
        "title": "UPDATE 2-U.S. multinationals hit hard by strong dollar  to bleed further into 2015 "
    },
    {
        "content": "* Strong dollar may cut up to $12 bln from Q4 U.S. revenue -FireApps",
        "date": "01272015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "RPT-UPDATE 2-U.S. multinationals hit hard by strong dollar  to bleed further into 2015 "
    },
    {
        "content": "Jan 27 Bristol-Myers Squibb Co on Tuesday said profits could fall as much as 16 percent in 2015  a worse forecast than Wall Street had expected  as the stronger dollar takes a toll on U.S.  drugmakers.",
        "date": "01272015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Bristol-Myers issues cautious 2015 forecast due to strong dollar "
    },
    {
        "content": "Jan 27 Bristol-Myers Squibb Co reported higher-than-expected quarterly earnings  helped by surprisingly strong sales of its hepatitis C drugs and its Eliquis blood clot preventer.",
        "date": "01272015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers quarterly profit beats forecasts "
    },
    {
        "content": "Jan 20 U.S. drugmaker Bristol-Myers Squibb Co  on Tuesday said Chief Operating Officer Giovanni Caforio will replace Lamberto Andreotti as chief executive on May 5  as the company again tapped a long-time insider to lead it.",
        "date": "01202015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers taps insider Caforio as next CEO "
    },
    {
        "content": "NEW YORK  Jan 20 U.S. drugmaker Bristol-Myers Squibb Co on Tuesday said Chief Operating Officer Giovanni Caforio will replace Lamberto Andreotti as chief executive on May 5  in another selection of a long-time insider to lead the company.",
        "date": "01202015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "UPDATE 1-Bristol-Myers taps insider Caforio as next CEO "
    },
    {
        "content": "Jan 13 Eli Lilly & Co signed two separate deals with Merck & Co Inc and Bristol-Myers Squibb Co to test combinations of its cancer treatments with two recently approved therapies that belong to a promising new class of drugs.",
        "date": "01132015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Lilly to test combinations with Merck  Bristol-Myers' cancer drugs "
    },
    {
        "content": "Jan 12 Bristol-Myers Squibb and Merck & Co broke further away from rival drugmakers in the race to treat lung cancer with a new generation of immune system therapies  adding pressure on the likes of Roche and AstraZeneca to play catch-up.",
        "date": "01122015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Merck  Bristol heat up immunotherapy race in lung cancer "
    },
    {
        "content": "Jan 11 Bristol-Myers Squibb Co said the independent data monitoring committee concluded that a late stage study evaluating Opdivo versus docetaxel in previously treated patients with advanced  squamous cell non-small cell lung cancer met its endpoint.",
        "date": "01122015",
        "name": "Bristol-Myers Squibb Company",
        "news_type": "normal",
        "symbol": "BMY",
        "title": "Bristol-Myers says panel finds Opdivo lung cancer study meets endpoint "
    }
]