[
    {
        "content": "* BOK FINANCIAL CORP SAYS BOARD DECLARED A DIVIDEND ON COMPANY'S COMMON STOCK OF 45 CENTS PER SHARE - SEC FILING ‍​",
        "date": "10312017",
        "name": "BOK Financial Corporation",
        "news_type": "topStory",
        "symbol": "BOKF",
        "title": "BRIEF-BOK FINANCIAL SAYS BOARD DECLARES INCREASED DIVIDEND OF $0.45/SHARE "
    },
    {
        "content": "* Q2 earnings per share view $1.30 -- Thomson Reuters I/B/E/S",
        "date": "07262017",
        "name": "BOK Financial Corporation",
        "news_type": "topStory",
        "symbol": "BOKF",
        "title": "BRIEF-BOK Financial reports Q2 earnings per share $1.35 "
    },
    {
        "content": "* Q1 earnings per share view $1.05 -- Thomson Reuters I/B/E/S",
        "date": "04262017",
        "name": "BOK Financial Corporation",
        "news_type": "topStory",
        "symbol": "BOKF",
        "title": "BRIEF-BOK Financial Q1 earnings per share $1.35 "
    },
    {
        "content": "* BOK Financial reports annual and quarterly earnings for 2016",
        "date": "01252017",
        "name": "BOK Financial Corporation",
        "news_type": "topStory",
        "symbol": "BOKF",
        "title": "BRIEF-BOK Financial reports Q4 earnings per share $0.76 "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 23 (Fitch) Fitch Ratings has affirmed BOKF's ratings at 'A/F1'.  The Rating Outlook has been revised to Stable from Negative. See the full list  of rating actions at the end of this release. The rating action follows a periodic review of the mid-tier regional banking  group  which includes BankUnited Inc. (BKU)  BOK Financial Corp. (BOKF)  Cathay  General Bancorp (CATY)  East West Bancorp (EWBC)  First Republic Bank (FR",
        "date": "01232017",
        "name": "BOK Financial Corporation",
        "news_type": "topStory",
        "symbol": "BOKF",
        "title": "Fitch Affirms BOK Financial at 'A'; Outlook Revised to Stable "
    },
    {
        "content": "WASHINGTON  Nov 15 The Federal Reserve on Tuesday said it approved a deal for BOK Financial Corporation  to acquire MBT Bancshares  a deal announced in December 2015.7   (Reporting by Patrick Rucker; Editing by James Dalgleish)",
        "date": "11152016",
        "name": "BOK Financial Corporation",
        "news_type": "topStory",
        "symbol": "BOKF",
        "title": "Federal Reserve clears Bok Financial buyout of MBT Bancshares "
    },
    {
        "content": "* Q3 earnings per share view $1.10 -- Thomson Reuters I/B/E/S",
        "date": "10262016",
        "name": "BOK Financial Corporation",
        "news_type": "topStory",
        "symbol": "BOKF",
        "title": "BRIEF-BOK Financial Q3 earnings per share $1.13 "
    },
    {
        "content": "A BOK Financial Corporation unit has agreed to pay more than $1.6 million to settle civil charges for failing to alert investors to problems in municipal bond offerings that turned out to be part of fraudulent scheme  the U.S. Securities and Exchange Commission said on Friday.",
        "date": "09092016",
        "name": "BOK Financial Corporation",
        "news_type": "topStory",
        "symbol": "BOKF",
        "title": "BOK Financial to pay $1.6 million for gatekeeping failures "
    },
    {
        "content": "Sept 9 A BOK Financial Corporation unit has agreed to pay more than $1.6 million to settle civil charges for failing to alert investors to problems in municipal bond offerings that turned out to be part of fraudulent scheme  the U.S. Securities and Exchange Commission said on Friday.",
        "date": "09092016",
        "name": "BOK Financial Corporation",
        "news_type": "normal",
        "symbol": "BOKF",
        "title": "UPDATE 1-BOK Financial to pay $1.6 mln for gatekeeping failures "
    },
    {
        "content": "WASHINGTON  Sept 9 A subsidiary of Oklahoma-based BOK Financial Corporation has agreed to pay more than $1.6 million to settle charges that it concealed problems from investors in municipal bond offerings to purchase and renovate senior living facilities  the U.S. Securities and Exchange Commission said on Friday.",
        "date": "09092016",
        "name": "BOK Financial Corporation",
        "news_type": "normal",
        "symbol": "BOKF",
        "title": "BOK Financial to pay $1.6 mln to settle charges related to bond offerings -SEC "
    },
    {
        "content": "* Q2 earnings per share view $0.99 -- Thomson Reuters I/B/E/S",
        "date": "07272016",
        "name": "BOK Financial Corporation",
        "news_type": "topStory",
        "symbol": "BOKF",
        "title": "BRIEF-BOK financial reports qtrly earnings per share of $1.00 "
    },
    {
        "content": "* Says files for debt shelf with U.S. SEC; size not disclosed - SEC filing  Source: (http://1.usa.gov/28J0fgf ) Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06202016",
        "name": "BOK Financial Corporation",
        "news_type": "topStory",
        "symbol": "BOKF",
        "title": "BRIEF-BOK Financial files for debt shelf with U.S. SEC "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  June 21 (Fitch) Fitch Ratings has assigned an 'A-' rating to BOK  Financial Corporation's (BOKF) $150 million 5.375% subordinated debt issuance. The debt level ratings detailed below are consistent with Fitch's notching  criteria from each of the entities Long- and Short-Term Issuer Default Ratings  (IDRs) and Viability Rating (VR). The IDRs are currently 'A/F1'  and the VR is  'a'  all of which were last affirmed on Jan. 28  ",
        "date": "06212016",
        "name": "BOK Financial Corporation",
        "news_type": "topStory",
        "symbol": "BOKF",
        "title": "Fitch Rates BOK Financial Corp. Subordinated Debt Issuance 'A-' "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 28 (Fitch) Fitch Ratings has affirmed BOK Financial (BOKF)  ratings at 'A/F1'. The affirmation reflects BOKF's good performance and sound  overall financial profile relative to Fitch's midtier regional banking peers. At the same time  Fitch has revised the Rating Outlook for BOKF to Negative from  Stable given the more challenging environment in the largely energy-driven  economies of Texas and Oklahoma where BOKF prin",
        "date": "01282016",
        "name": "BOK Financial Corporation",
        "news_type": "topStory",
        "symbol": "BOKF",
        "title": "Fitch Affirms BOK Financial's Ratings at 'A/F1'; Outlook Revised to Negative "
    },
    {
        "content": "Jan 13 U.S. banks exposed to energy-related loans will need to set aside even more money than previously expected to cover  potential losses as oil prices near 12-year lows.",
        "date": "01142016",
        "name": "BOK Financial Corporation",
        "news_type": "normal",
        "symbol": "BOKF",
        "title": "UPDATE 1-More pain seen ahead for U.S. banks exposed to energy loans "
    },
    {
        "content": "BOK Financial Corp  has more exposure to volatile energy prices than virtually any other bank in the United States  but its chief executive is still shopping around for an acquisition.",
        "date": "08272015",
        "name": "BOK Financial Corporation",
        "news_type": "topStory",
        "symbol": "BOKF",
        "title": "Oklahoma bank BOK Financial still eyeing deals "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 30 (Fitch) Fitch Ratings has affirmed BOK Financial (BOKF)  ratings at 'A/F1'. The Rating Outlook remains Stable. The affirmation reflects  BOKF's consistent performance and strong overall financial profile relative to  Fitch's mid-tier regional banking peers. The rating action follows a periodic review of the mid-tier regional banking  group  which includes Cathay General Bancorp (CATY)  East West Bancorp  Inc.  (EWBC",
        "date": "01302015",
        "name": "BOK Financial Corporation",
        "news_type": "topStory",
        "symbol": "BOKF",
        "title": "Fitch Affirms BOK Financial Corp's Ratings at 'A'/'F1' Following Mid-Tier Regional Bank Peer Review "
    }
]