[
    {
        "content": "* Popular Inc - ‍net income of $20.7 million for q3 of 2017  reflecting $79.4 million in hurricane-associated expenses and an income tax benefit of $20.0 million​",
        "date": "10312017",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "BRIEF-Popular Inc announces qtrly earnings per share ‍$0.19​ "
    },
    {
        "content": "FRANKFURT  Oct 13 The European Central Bank is facing two lawsuits over its handling of the failure of Spanish lender Banco Popular  which saw investors lose billions of euros while taxpayers and depositors were protected.",
        "date": "10132017",
        "name": "Popular Inc",
        "news_type": "normal",
        "symbol": "BPOP",
        "title": "ECB faces lawsuits over handling of failed Spanish bank Popular "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 05 (Fitch) Fitch Ratings has placed Popular Inc.'s (BPOP) 'BB-' Long-Term Issuer Default Rating (IDR)  'B' Short-Term IDR  and 'bb-' Viability Rating (VR) on Rating Watch Negative due to the uncertainty of the impact caused by Hurricane Maria on Puerto Rico. A full list of rating actions follows at the end of this release. KEY RATING DRIVERS IDRs  VRs  AND SENIOR DEBT The ratings have been placed on  Negative Watch bec",
        "date": "10052017",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "Fitch Places Popular Inc. on Rating Watch Negative "
    },
    {
        "content": "* Expects to sell 51 pct stake in Popular property assets (Includes details on losses for Popular from news conference)",
        "date": "07282017",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "UPDATE 3-Brazil growth helps Santander  Popular purchase hits capital "
    },
    {
        "content": "* Says has recovered some 3 billion euros ($3.51 billion) in tax credits from Banco Popular acquisition Source text for Eikon: Further company coverage: ($1 = 0.8543 euros) (Reporting by Madrid Newsroom)",
        "date": "07282017",
        "name": "Popular Inc",
        "news_type": "normal",
        "symbol": "BPOP",
        "title": "BRIEF-Banco Santander says recovered 3 bln euros in tax credits from Popular acquisition "
    },
    {
        "content": "* Popular Inc - net interest income for quarter ended June 30  2017 was $374.5 million  compared to $362.1 million for previous quarter Source text for Eikon: Further company coverage:",
        "date": "07262017",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "BRIEF-Popular Inc announces qtrly earnings per share $0.94 "
    },
    {
        "content": "MADRID Spain's Banco Santander  said on Thursday it would offer perpetual bonds as part of a commercial offer to compensate some retail clients who acquired shares and subordinated debt of Banco Popular and were wiped out when the bank was wound down. | Video ",
        "date": "07142017",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "Spain's Santander says to compensate retail clients hit by Popular rescue "
    },
    {
        "content": "* Expects H1 net profit of 3.6 bln euros (Adds details  background)",
        "date": "07032017",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "UPDATE 1-Spain's Santander launches Popular rights issue at 19 pct discount "
    },
    {
        "content": "BARCELONA Spain's Banco Popular will start looking for partners to buy some 30 billion euros ($34.29 billion) in repossessed assets and non-performing real estate loans as it strives to bolster its books following last month's takeover by Santander   it said late on Friday.",
        "date": "07012017",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "Spain's Popular seeks partners for 30 billion euro bad debt portfolio "
    },
    {
        "content": "BARCELONA  July 1 Spain's Banco Popular will start looking for partners to buy some 30 billion euros in repossessed assets and non-performing real estate loans as it strives to bolster its books following last month's takeover by Santander  it said late on Friday.",
        "date": "07012017",
        "name": "Popular Inc",
        "news_type": "normal",
        "symbol": "BPOP",
        "title": "Spain's Popular seeks partners for 30 bln euro bad debt portfolio "
    },
    {
        "content": "* Banco Santander considering capital increase of above 5 billion euros as part of potential offer for its smaller rival Banco Popular Espanol - Bloomberg  citing sources Source text: https://bloom.bg/2rxlj0U",
        "date": "06062017",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "BRIEF-Santander said to eye stock sale as part of possible Popular bid - Bloomberg "
    },
    {
        "content": "BRUSSELS  June 7 The EU's Single Resolution Board (SRB) switched tactics for the wind-down of Spain's Banco Popular  preferring its sale to Banco Santander as Popular's liquidity situation worsened sharply  a senior SRB official said.",
        "date": "06072017",
        "name": "Popular Inc",
        "news_type": "normal",
        "symbol": "BPOP",
        "title": "SRB changed tack on Popular wind down due to liquidity crunch "
    },
    {
        "content": "MADRID The outflow of deposits from troubled Spanish bank Popular was in the region of 18 billion euros ($20 billion) over the past few weeks  two sources familiar with the matter said on Wednesday.",
        "date": "06072017",
        "name": "Popular Inc",
        "news_type": "normal",
        "symbol": "BPOP",
        "title": "Deposit outflow from Popular around 18 billion euros in recent weeks: sources "
    },
    {
        "content": "* European authorities intervene  bondholders suffer (Adds comments from Santander chairman  detail)",
        "date": "06072017",
        "name": "Popular Inc",
        "news_type": "normal",
        "symbol": "BPOP",
        "title": "UPDATE 4-ECB triggers overnight Santander rescue of Spain's Banco Popular "
    },
    {
        "content": "MADRID  June 7 The outflow of deposits from troubled Spanish bank Popular was in the region of 18 billion euros ($20 billion) over the past few weeks  two sources familiar with the matter said on Wednesday.",
        "date": "06072017",
        "name": "Popular Inc",
        "news_type": "normal",
        "symbol": "BPOP",
        "title": "Deposit outflow from Popular around 18 bln euros in recent weeks - sources "
    },
    {
        "content": "MADRID  May 19 Spain's biggest bank Santander or state-owned lender Bankia are most likely to step in to save troubled Banco Popular  sources familiar with the talks told Reuters  although a deal is still far from guaranteed.",
        "date": "05192017",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "Santander or Bankia viewed as likely saviours for Spain's Popular "
    },
    {
        "content": "MADRID Several Spanish banks  including state-owned Bankia   have shown interest in a potential merger with Banco Popular   as its new management considers options for how to cope with billions of euros in toxic assets.",
        "date": "05162017",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "Spanish banks show interest in merger with struggling Popular "
    },
    {
        "content": "* BBVA  Santander  Sabadell  Caixa looking at Popular - sources (Adds comments from Spain's Economy Minister  details)",
        "date": "05162017",
        "name": "Popular Inc",
        "news_type": "normal",
        "symbol": "BPOP",
        "title": "UPDATE 2-Spanish banks show interest in merger with struggling Popular "
    },
    {
        "content": "LONDON  April 28 (IFR) - Banco Popular's Additional Tier 1 bonds plunged ahead of next Friday's first quarter earnings as concerns around the bank's liquidity position compounded worries over the state of its capital position.",
        "date": "04282017",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "Market braces for earnings from capital-stricken Popular "
    },
    {
        "content": "* Popular Inc qtrly net interest income $362.1 million versus $352.4 million",
        "date": "04252017",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "BRIEF-Popular announces qtrly net income per common share from continuing operations $0.89 "
    },
    {
        "content": "* Popular announces appointment of Richard Carrión as executive Chairman and Ignacio Alvarez as Chief Executive Officer",
        "date": "04252017",
        "name": "Popular Inc",
        "news_type": "normal",
        "symbol": "BPOP",
        "title": "BRIEF-Popular announces appointment of Richard Carrión as executive chairman and Ignacio Alvarez as CEO "
    },
    {
        "content": "* Says net interest income for quarter ended december 31  2016 was $355.4 million  compared to $353.7 million for previous quarter",
        "date": "01242017",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "BRIEF-Popular q4 loss per share from continuing operations $0.06 "
    },
    {
        "content": "* Approved increase in company's quarterly common stock dividend from $0.15 per share to $0.25 per share",
        "date": "01242017",
        "name": "Popular Inc",
        "news_type": "normal",
        "symbol": "BPOP",
        "title": "BRIEF-Popular approved increase in company's quarterly common stock dividend "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 22 (Fitch) Fitch Ratings has completed a peer review of its  two rated Puerto Rican banks and has affirmed the Long-Term Issuer Default  Ratings (IDRs) at 'BB-' and Short-Term IDRs at 'B' for Popular Inc. (BPOP) and  its subsidiaries. The Rating Outlook is Stable. A full list of rating actions  follows at the end of this release. KEY RATING DRIVERS IDRs  VRs  AND SENIOR DEBT  BPOP's current rating levels incorporate t",
        "date": "11222016",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "Fitch Affirms Popular's Long- & Short-Term IDRs; Outlook Stable "
    },
    {
        "content": "* Popular inc- net interest margin of 4.12% in q3 2016  compared to 4.33% in q2 2016",
        "date": "10252016",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "BRIEF-Popular Inc Q3 earnings per share $0.44 "
    },
    {
        "content": "* Popular says aims for 40 percent dividend payout by 2018    (Reporting By Jesus Aguado  Editing by Sonya Dowsett)",
        "date": "10052016",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "BRIEF-Spanish bank Popular says returns to cash dividend in 2017 "
    },
    {
        "content": "* Bankers expect further cuts to follow in medium term   (Adds background  details)",
        "date": "09202016",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "UPDATE 1-Spain's Popular to cut a fifth of its employees in cost-saving plan "
    },
    {
        "content": "* Says qtrly Net Charge-Offs (ncos) at 0.76% of average loans held-in-portfolio versus. 1.48% in q4 2015",
        "date": "04252016",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "BRIEF-Popular Inc Q1 EPS from continuing operations $0.81 "
    },
    {
        "content": "MADRID  Jan 20 Spain's Banco Popular is considering selling up to 8 billion euros ($8.7 billion) worth of real estate assets in 2016 to reshape its balance sheet  a source familiar with the matter said on Wednesday.",
        "date": "01202016",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "Spain's Popular to speed up property asset sales in 2016 -source "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 24 (Fitch) Fitch Ratings has affirmed the Long-term Issuer  Default Ratings (IDRs) at 'BB-' and Short-term IDRs at 'B' for Popular Inc.  (BPOP) and its subsidiaries following Fitch's peer review of Puerto Rican banks.  The Rating Outlook is Stable. A full list of rating actions follows at the end  of this rating action commentary. KEY RATING DRIVERS  IDRs  VRs  AND SENIOR DEBT  Fitch-rated Puerto Rican bank VRs and ID",
        "date": "11242015",
        "name": "Popular Inc",
        "news_type": "topStory",
        "symbol": "BPOP",
        "title": "Fitch Affirms Popular's Long- & Short-Term IDRs; Outlook Stable "
    },
    {
        "content": "NEW YORK/WASHINGTON  Feb 27 Puerto Rico's Doral Bank has failed and a local rival will take over its operations  authorities said on Friday after accidentally releasing the information early and sending shares down 46 percent before trading was halted.",
        "date": "02272015",
        "name": "Popular Inc",
        "news_type": "normal",
        "symbol": "BPOP",
        "title": "UPDATE 3-Failure of Puerto Rico's Doral Bank released early in FDIC mishap "
    }
]