[
    {
        "content": "SAO PAULO Brazilian food company BRF SA  swung to a profit in the third quarter after three consecutive quarterly losses as the company bounced back from a national food safety scandal  but it missed the analyst consensus of a larger rebound.",
        "date": "11102017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil food company BRF misses third-quarter profit estimate despite rebound "
    },
    {
        "content": "SAO PAULO  Nov 9 Brazilian food company BRF SA swung to a profit in the third quarter after three consecutive quarterly losses as the company bounced back from a national food safety scandal  but it missed the analyst consensus of a larger rebound.",
        "date": "11102017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil food company BRF misses Q3 profit estimate despite rebound "
    },
    {
        "content": "SAO PAULO  Nov 8 Brazil's BRF SA and a subsidiary of China's COFCO Corp signed a memorandum of understanding (MOU) to boost cooperation on food safety and quality controls  the Brazilian company said in a statement on Wednesday.",
        "date": "11082017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF and China's COFCO sign agreement on food safety "
    },
    {
        "content": "SAO PAULO  Oct 2 Brazilian poultry producer BRF SA estimates a one-time pre-tax gain of 310 million reais ($98 million) this quarter as a result of joining a tax refinancing program and the buildup of tax receivables.",
        "date": "10022017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF sees $98 mln gain from tax refinancing  receivables "
    },
    {
        "content": "SAO PAULO  Sept 29 Brazilian food company BRF SA said on Friday that for the first time in history domestic meat producers will be allowed to sell pork to South Korea  citing a list divulged by the Asian importer a day earlier.",
        "date": "09292017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF says South Korea okays Brazil pork imports -statement "
    },
    {
        "content": "SAO PAULO BRF SA  will reopen a food processing plant in Brazil by January  a company executive told Reuters  the first big move aimed at reviving profitability since the country's No. 1 chicken exporter announced the departure of its chief executive officer.",
        "date": "09212017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Exclusive: Brazil's BRF to reopen plant  catering to Mideast halal market "
    },
    {
        "content": "SAO PAULO  Sept 14 The board of Brazilian meatpacker JBS SA will delay discussing replacement of Chief Executive Wesley Batista while it awaits a ruling on a motion to release him from jail on charges of insider trading  said a person with knowledge of the matter.",
        "date": "09142017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's JBS holds off succession talk while CEO requests release -source "
    },
    {
        "content": "SAO PAULO  Aug 31 BRF SA Chief Executive Pedro de Andrade Faria plans to leave by the end of the year  following a series of heavy quarterly losses by the world's largest chicken exporter.",
        "date": "08312017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "UPDATE 1-Brazil's BRF says Tarpon-backed CEO Faria to leave "
    },
    {
        "content": "SAO PAULO  Aug 31 Brazilian food processor BRF SA on Thursday said its Chief Executive Pedro de Andrade Faria will leave the company by Dec. 31.",
        "date": "08312017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF says CEO Faria to leave by end-December "
    },
    {
        "content": "SAO PAULO  Aug 30 BRF SA  the world's largest chicken exporter  sees internationalization as the best way to grow its business while believing that Brazil's heavy fiscal burden hampers the firm's ability to compete globally  an executive said on Wednesday.",
        "date": "08302017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "BRF says Brazil fiscal burden making it harder to compete "
    },
    {
        "content": "SAO PAULO  Aug 24 BRF SA  the world's largest chicken exporter  has appointed Lorival Nogueira Luz as chief financial officer and investor relations director  effective from September 2017  according to a securities filing.",
        "date": "08242017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF appoints cement maker Votorantim Cimentos' Luz as CFO "
    },
    {
        "content": "SAO PAULO Groupe Lactalis SA has moved forward with arbitration against BRF SA  claiming it refuses to recognize tax and labor liabilities at several plants it sold to the French dairy maker three years ago  a source familiar with the matter said.",
        "date": "08092017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Exclusive: France's Lactalis seeks arbitration over BRF deal - source "
    },
    {
        "content": "SAO PAULO Brazilian food processor BRF SA will introduce a discount brand in its home market  executives said on Friday  as the end of antitrust restrictions in July allows it to target a niche that has grown during the country's recession.",
        "date": "08112017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "BRF readies Brazil discount brand after antitrust ban lifted "
    },
    {
        "content": "SAO PAULO  Aug 11 Brazilian food processor BRF SA will introduce a discount brand in its home market  executives said on Friday  as the end of antitrust restrictions in July allows it to target a niche that has grown during the country's recession.",
        "date": "08112017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "UPDATE 2-BRF readies Brazil discount brand after antitrust ban lifted "
    },
    {
        "content": "SAO PAULO  Aug 11 Brazilian food processor BRF SA will launch a discount brand aimed at the domestic market  executives said on a Friday conference call to discuss second-quarter results.",
        "date": "08112017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF readies discount brand as antitrust restrictions end "
    },
    {
        "content": "SAO PAULO  Aug 10 Brazilian food processor BRF SA said late on Thursday that its board of directors authorized the company to sell up to 13.4 million shares currently held by its treasury department.",
        "date": "08112017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF may sell up to $165 mln in stock to boost cash "
    },
    {
        "content": "SAO PAULO Brazil's food processor BRF SA on Thursday reported a wider-than-expected net loss of 167 million reais ($52.60 million) in the second quarter  as it continued to reel from the effects of a food safety scandal  it said in a securities filing.",
        "date": "08112017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF reports second-quarter net loss of 167 million reais on food scandal fallout "
    },
    {
        "content": "SAO PAULO  Aug 10 Brazil's food processor BRF SA on Thursday reported a wider-than-expected net loss of 167 million reais ($52.60 million) in the second quarter  as it continued to reel from the effects of a food safety scandal  it said in a securities filing.",
        "date": "08112017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "UPDATE 1-Brazil's BRF reports Q2 net loss of 167 mln reais on food scandal fallout "
    },
    {
        "content": "SAO PAULO  Aug 10 Brazil's food processor BRF SA on Thursday reported a wider than expected net loss of 167 million reais ($52.60 million) in the second quarter  as it continued to reel from the effects of a food safety scandal  it said in a securities filing.",
        "date": "08112017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF reports Q2 net loss of 167 mln reais on food scandal fallout "
    },
    {
        "content": "SAO PAULO  July 6 Brazil's BRF SA has opened new senior vice president slots to help Chief Executive Officer Pedro Faria run the world's No. 1 poultry exporter  which has been beset by two consecutive quarters of losses and fallout from a food safety scandal.",
        "date": "07062017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "UPDATE 1-Grappling with losses  Brazil's BRF reorganizes senior management "
    },
    {
        "content": "SAO PAULO  July 6 The board of Brazil's BRF SA   the world's largest chicken exporter  approved an organizational restructuring that creates 14 vice presidencies reporting directly to global Chief Executive Officer Pedro Faria  according to a Thursday securities filing.",
        "date": "07062017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF creates 14 vice presidencies reporting to CEO Faria "
    },
    {
        "content": "SAO PAULO Brazil's BRF SA  the world's largest poultry exporter  said on Wednesday that interruptions in operations at two Brazilian ports due to bad weather in recent days will negatively impact its exports.",
        "date": "05312017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF says problems in ports may cut poultry  pork exports "
    },
    {
        "content": "SAO PAULO  May 31 Brazil's BRF SA  the world's largest poultry exporter  said on Wednesday that interruptions in operations at two Brazilian ports due to bad weather in recent days will negatively impact its exports.",
        "date": "05312017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "UPDATE 1-Brazil's BRF says problems in ports may cut poultry  pork exports "
    },
    {
        "content": "SAO PAULO  May 12 Brazilian food processor BRF SA on Friday said a recent meat safety scandal that resulted in the temporary closure of one plant and the charging of two company executives will continue to have an impact on its operations.",
        "date": "05122017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "UPDATE 1-Brazil's BRF labors under challenges of food scandal "
    },
    {
        "content": "SAO PAULO  May 12 Brazilian food processor BRF SA on Friday said a recent meat safety scandal that resulted in the temporary closure of one plant and the charging of two company executives will continue to affect operations.",
        "date": "05122017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF sees higher marketing expenses in wake of food scandal "
    },
    {
        "content": "SAO PAULO  May 11 Brazilian food processor BRF SA on Thursday reported a net loss of 286 million reais ($91 million) in the first quarter as net operating revenue fell on a combination of lower prices and production volumes  it said in a statement.",
        "date": "05122017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF posts $91 mln Q1 net loss amid meat scandal "
    },
    {
        "content": "SAO PAULO  April 8 Brazilian food processor BRF SA said on Saturday it has been authorized to reopen a plant that was closed during a corruption probe involving Brazilian companies and meat inspectors.",
        "date": "04082017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil´s BRF authorized to reopen plant targeted in corruption probe "
    },
    {
        "content": "DUBAI  March 26 Brazil's BRF SA said it was continuing some exports to Saudi Arabia after the kingdom restricted Brazilian beef and poultry imports following accusations that bribery in Brazil allowed sales of rotten and salmonella-tainted meats.",
        "date": "03262017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF says it continues some meat exports to Saudi Arabia "
    },
    {
        "content": "SAO PAULO Brazilian poultry producer BRF SA  has begun breaking fertilized eggs to reduce chicken production  a source said on Thursday  after a bribery scandal raised sanitary concerns about Brazil's meat industry  hurting demand for exports.",
        "date": "03232017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF cuts chicken output as industry scandal hits exports: source "
    },
    {
        "content": "SAO PAULO  March 23 Brazilian poultry producer BRF SA has begun breaking fertilized eggs to reduce chicken production  a source said on Thursday  after a bribery scandal raised sanitary concerns about Brazil's meat industry  hurting demand for exports.",
        "date": "03232017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF cuts chicken output as industry scandal hits exports -source "
    },
    {
        "content": "SAO PAULO Brazil's two largest food processors are striving to restore confidence in their quality controls as they pursue plans to list overseas units after a scandal over alleged bribery of health officials that triggered bans on Brazilian meat exports.",
        "date": "03232017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil scandal tests JBS  BRF push for overseas units IPOs "
    },
    {
        "content": "SEOUL Seoul will lift a temporary ban on sales of chicken meat from Brazil's BRF SA  after the South American nation said shipments to South Korea did not contain tainted products.",
        "date": "03212017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "South Korea lifts sales ban on chicken from Brazil's BRF "
    },
    {
        "content": "SAO PAULO  March 20 Shares of meatpackers BRF SA and JBS SA slumped on Monday after China and other countries temporarily suspended imports of Brazilian meat following a scandal over alleged bribery of inspectors.",
        "date": "03202017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF  JBS shares slump after China suspends meat imports "
    },
    {
        "content": "SEOUL  March 21 Seoul will lift a temporary ban on sales of chicken meat from Brazil's BRF SA after the South American nation said shipments to South Korea did not contain tainted products.",
        "date": "03212017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "S.Korea lifts sales ban on chicken from Brazil's BRF "
    },
    {
        "content": "SAO PAULO/BEIJING  March 20 Fallout over a Brazilian meat corruption scandal spread on Monday  with China and South Korea suspending some imports  the European Union mulling action and shares of meatpacking companies BRF SA  and JBS SA dropping.",
        "date": "03202017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazilian meatpackers slump as China  South Korea suspend imports "
    },
    {
        "content": "BEIJING China has temporarily suspended imports of Brazilian meat from March 19 following a scandal in the South American country over the alleged bribery of health officials to allow the sale of tainted meat  a source said on Monday.",
        "date": "03202017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "China temporarily suspends imports of Brazilian meat after scandal:  source "
    },
    {
        "content": "SEOUL  March 20 South Korea will tighten inspections of imported Brazilian chicken meat and temporarily bar sales BRF SA's chicken products following a scandal in Brazil over tainted meat  the agriculture ministry said in a statement on Monday.",
        "date": "03202017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "S.Korea bars sales of Brazil's BRF chicken  steps up inspections "
    },
    {
        "content": " (Updates prices)     By Bruno Federowski     SAO PAULO  March 17 Brazilian stocks fell sharply on Friday as shares of meatpackers JBS SA and BRF SA slumped after federal police targeted their offices as part of an investigation into alleged bribery of food inspectors and politicians.     The probe  known as \"Operation Weak Flesh \" uncovered about 40 cases of meatpackers who had paid officials to overlook unsanitary practices such as processing rotten meat and running plants with tra",
        "date": "03172017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "EMERGING MARKETS-Brazil stocks slump; JBS  BRF tumble on police raids "
    },
    {
        "content": "SAO PAULO Brazil's BRF SA is analyzing other options instead of an initial public offering for halal food unit One Foods Holdings Ltd   and has engaged in talks for a private stake sale to sovereign wealth and buyout funds  four people familiar with the plan said on Wednesday.",
        "date": "03152017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Exclusive: Brazil's BRF mulls options to halal unit IPO - sources "
    },
    {
        "content": "SAO PAULO  March 17 Wal-Mart Stores Inc has asked suppliers in Brazil to clarify alleged cases of meatpackers bribing health officials to subvert inspections  the retailer said on Friday.",
        "date": "03172017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Wal-Mart asks Brazil suppliers to clarify alleged bribes to officials "
    },
    {
        "content": "BRASILIA The Brazilian economy has begun to turn around  jobs are being created  and business confidence is slowly recovering  President Michel Temer said on Friday  touting initial successes of his recovery plan.",
        "date": "03172017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's Temer says economy turning around  confidence rising "
    },
    {
        "content": "BRASILIA  March 17 The Brazilian economy has begun to turn around  jobs are being created  and business confidence is slowly recovering  President Michel Temer said on Friday  touting initial successes of his recovery plan.",
        "date": "03172017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "UPDATE 1-Brazil's Temer says economy turning around  confidence rising "
    },
    {
        "content": "    By Bruno Federowski     SAO PAULO  March 17 Brazilian stocks fell on Friday as shares of meatpackers JBS SA and BRF SA slumped after federal police targeted their offices as part of an investigation into alleged bribery of food inspectors and politicians.     The probe  known as \"Operation Weak Flesh \" uncovered about 40 cases of meatpackers who had paid officials to overlook unsanitary practices such as processing rotten meat and running plants with traces of salmonella  police ",
        "date": "03172017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "EMERGING MARKETS-Brazil stocks fall; JBS  BRF slump on police raids "
    },
    {
        "content": "SAO PAULO  March 9 The chief financial officer of Brazilian food processor BRF SA  Alexandre Carneiro Borges  resigned on Thursday  less than two weeks after the company posted a steep quarterly loss and promised to overhaul management protocols.",
        "date": "03102017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "CFO of Brazil's BRF resigns after steep 4th-quarter loss "
    },
    {
        "content": "SAO PAULO  Feb 24 Brazilian food processor BRF SA  the world's largest poultry exporter  said on Friday it was overhauling management protocols to avoid repeating mistakes that triggered a big quarterly loss.",
        "date": "02242017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "UPDATE 1-Brazil's BRF pledges smarter management after steep loss "
    },
    {
        "content": "SAO PAULO  Feb 24 Brazilian food processor BRF SA  the world's largest poultry exporter  is overhauling management protocols to avoid the kind of mistakes that triggered a deep fourth-quarter loss  Chairman Abilio Diniz said on a Friday earnings call.",
        "date": "02242017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF pledges smarter management after deep quarterly loss "
    },
    {
        "content": "SAO PAULO  Jan 10 Brazilian food processor BRF SA sees cost savings and other efficiencies from its investment in a Turkish poultry producer reaching up to $180 million  its chief executive officer said on Tuesday.",
        "date": "01102017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "UPDATE 1-Brazil's BRF sees savings of up to $180 mln from Banvit deal "
    },
    {
        "content": "SAO PAULO  Jan 10 Brazilian food processor BRF SA sees cost savings and other efficiencies from its investment in a Turkish poultry producer reaching up to $180 million  Chief Executive Pedro Faria said on a Tuesday conference call.",
        "date": "01102017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF sees savings of up to $180 mln from Banvit deal "
    },
    {
        "content": "SAO PAULO  Jan 9 Brazilian food processor BRF SA  and Qatar's sovereign wealth fund agreed to buy the operations of Turkish poultry producer Banvit in a joint venture  BRF said in a securities filing on Monday.",
        "date": "01092017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "UPDATE 1-BRF  Qatar to buy Turkish poultry firm Banvit in $470 mln venture "
    },
    {
        "content": "SAO PAULO  Jan 9 Brazilian food processor BRF SA  and Qatar's sovereign wealth fund agreed to buy the operations of Turkish poultry producer Banvit in a joint venture  BRF said in a securities filing on Monday.",
        "date": "01092017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "BRF and Qatar to buy Turkish poultry firm Banvit in $470 mln venture "
    },
    {
        "content": "SAO PAULO  Jan 6 BRF SA  the world's largest poultry exporter  said on Friday an initial public offering of a subsidiary focused on the halal processed food market remains a strategic option.",
        "date": "01062017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF says halal food unit IPO remains an option "
    },
    {
        "content": "SAO PAULO BRF SA  the world's largest poultry exporter  wants to raise about $1.5 billion from the sale of a 20 percent stake in a subsidiary focused on the halal processed food market via an initial public offering  two people with direct knowledge of the plan said on Thursday.",
        "date": "01052017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Exclusive: BRF seeks IPO of halal food unit by early April  sources say "
    },
    {
        "content": "SAO PAULO Brazil's BRF SA has launched a unit focused on the Muslim processed foods market  underscoring efforts by the world's No. 1 poultry exporter to gain market share in the oil-rich Middle East.",
        "date": "01042017",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF launches unit focused on Muslim food markets "
    },
    {
        "content": "SAO PAULO Brazilian food exporter BRF SA is seeking to raise about $1.5 billion from the sale of a 20 percent stake of a unit focused on the halal processed food market via an initial public offering  two people with direct knowledge of the plan said on Thursday.",
        "date": "01052017",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Exclusive: BRF sees $1.5 billion Halal unit IPO by late March - sources "
    },
    {
        "content": "SAO PAULO  Nov 8 BRF SA  the world's largest poultry exporter  has hired banks to help coordinate potential outside investments in its Sadia Halal unit  according to a securities filing on Tuesday.",
        "date": "11082016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF says hired banks to assess outside investments in Sadia Halal "
    },
    {
        "content": "SAO PAULO  Oct 28 Brazil's BRF SA  the world's top poultry exporter  on Friday blamed disappointing third-quarter earnings on stubbornly high corn prices  slack demand and a stronger local currency.",
        "date": "10282016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "UPDATE 1-Brazil's BRF sees slow recovery from high corn prices  slack demand "
    },
    {
        "content": "SAO PAULO  Oct 28 Brazil's BRF SA said on Friday its third quarter earnings were disappointing as stubbornly high corn prices  slack demand and a stronger real delayed a recovery in the world leading poultry exporter's competitiveness.",
        "date": "10282016",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil BRF sees slow recovery from high corn prices  slack demand "
    },
    {
        "content": "SAO PAULO  Oct 27 BRF SA  the world's largest poultry exporter  missed third-quarter profit estimates by a large margin after costs rose at a faster pace than revenue.",
        "date": "10272016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF misses profit estimates as costs  feed prices spike "
    },
    {
        "content": "* Said on Monday that its suppliers Tratho Metal Quimica  Zinc Brasil Fundicao de Metais and Brasoxidos Industria Quimica had filed a bankruptcy petition against the company",
        "date": "10182016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "BRIEF-Nutriplant announces bankruptcy petition filed by suppliers "
    },
    {
        "content": "* Said on Tuesday its board of directors approved interim dividend payment totalling 11.3 million Brazilian reais ($3.5 million)  corresponding to 0.1267 real per share",
        "date": "09282016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "BRIEF-Arezzo Industria e Comercio announces interim dividend payment "
    },
    {
        "content": "* Announced on Friday a cooperation agreement between its unit BRF Foods GmbH and FFM Berhad  a unit of PPB Group Berhad",
        "date": "09122016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "BRIEF-BRF to invest $16 mln in food precessing company in Malaysia "
    },
    {
        "content": "BUENOS AIRES Brazilian processed foods maker BRF SA is making forward purchases of corn  the main ingredient in animal feed  after high costs related to a shortage of the grain squeezed margins  its chief executive said.",
        "date": "09142016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF aims to lock in corn supplies after crisis: CEO "
    },
    {
        "content": "SAO PAULO  July 29 Brazil food processor and chicken exporter BRF SA believes the worst is behind it in terms of a local corn shortage and a high-output poultry cycle but does not rule out more price increases  executives said on a conference call on Friday.",
        "date": "07292016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF says worst behind it  may raise prices again "
    },
    {
        "content": "SAO PAULO  July 28 Brazilian food processor BRF SA reported a net profit of 31 million reais ($9.4 million) in the second quarter  down 92 percent from a year ago after soaring corn prices hit its poultry and pork operations.",
        "date": "07292016",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "UPDATE 1-Brazil food processor BRF posts 92 pct decline in quarterly profit "
    },
    {
        "content": "SAO PAULO  July 25 BRF SA  the world's largest poultry exporter  is considering options to accelerate growth in a unit that caters to Middle East clients  including an initial public offering or the sale of a stake to a group of private investors.",
        "date": "07252016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF mulls IPO  private placement as options for Halal unit "
    },
    {
        "content": "SAO PAULO  July 28 Brazilian food processor BRF SA reported a net profit of 31 million reais ($9.4 million) in the second quarter  down 92 percent from a year ago after soaring corn prices hit its poultry and pork operations.   (Reporting by Reese Ewing; Editing by Sandra Maler)",
        "date": "07292016",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "CORRECTED-Brazil food processor BRF posts 31 mln real net gain in Q2 - filing "
    },
    {
        "content": "SAO PAULO  July 15 Brazilian investment firm Tarpon Investimentos SA has sold apparel company Morena Rosa SA back to its founder four years after acquiring it  two sources with knowledge of the matter said on Friday.",
        "date": "07152016",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's Tarpon sells apparel firm Morena Rosa back to founder -sources "
    },
    {
        "content": "SAO PAULO  June 7 Brazil's BRF  the world's largest poultry exporter  will shutter two processing plants to cut costs amid a shortage of corn on the local market that has driven feed costs to record levels  the company said on Tuesday.",
        "date": "06072016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Top Brazil poultry exporter BRF to close two plants to cut costs "
    },
    {
        "content": "SAO PAULO  June 10 Brazilian food processor BRF SA  the world's largest poultry exporter  is studying a possible investment in Namibia  Chairman Abilio Diniz said at an event on Friday.",
        "date": "06102016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "UPDATE 1-Brazil meat processor BRF eyes Namibia investment "
    },
    {
        "content": "SAO PAULO  June 10 Brazilian food processor BRF SA  the world's largest poultry exporter  is studying a possible investment in Namibia  Chairman Abilio Diniz said at an event on Friday.   (Reporting by Alberto Alerigi Jr.; Editing by Chizu Nomiyama)",
        "date": "06102016",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil food processor BRF eyes Namibia investment -chairman "
    },
    {
        "content": "* Announced on Monday that S&P and Fitch rating agencies reaffirmed the company's rating at \"BBB\" on the global scale",
        "date": "05172016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "BRIEF-S&P and Fitch reaffirm rating of BRF on global scale "
    },
    {
        "content": "* Announced on Thursday the conclusion of the acquisition of the entire stake of Alimentos Calchaqui Productos 7 SA",
        "date": "05132016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "BRIEF-BRF announces conclusion of Alimentos Calchaqui acquisition "
    },
    {
        "content": "SAO PAULO  May 11 Processed food maker BRF  confirmed on Wednesday that executives from Tyson Foods Inc visited plants in Brazil in response to a report in Valor Economico newspaper that said an acquisition of BRF may be in Tyson's plans.",
        "date": "05112016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF confirms visits from Tyson executives "
    },
    {
        "content": "SAO PAULO Executives of Tyson Foods   the largest U.S. meats company that plans to resume investment abroad  have been visiting plants of Brazil's poultry processor BRF SA  over the past month  the Valor Economico newspaper said on Tuesday.",
        "date": "05102016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF may be in Tyson's expansion plans: paper "
    },
    {
        "content": "SAO PAULO  May 10 Executives of Tyson Foods   the largest U.S. meats company that plans to resume investment abroad  have been visiting plants of Brazil's poultry processor BRF SA over the past month  the Valor Economico newspaper said on Tuesday.",
        "date": "05102016",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF may be in Tyson's expansion plans -paper "
    },
    {
        "content": "SAO PAULO  April 29 Brazilian food processor BRF SA plans to increase prices by about 7 percent in May to help it counter rising costs and a generally challenging market that is expected to continue through midyear  Chief Executive Officer Pedro Faria said on Friday.",
        "date": "04292016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "UPDATE 1-Brazil's BRF plans to raise prices to counter high corn costs "
    },
    {
        "content": "SAO PAULO  April 28 Brazil's BRF SA  the world's largest chicken exporter  on Thursday posted a profit of 39 million reais ($11.2 million) in the first quarter of the year  down 91 percent from the same period a year ago.",
        "date": "04282016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF profit falls 91 pct on higher corn prices  currency "
    },
    {
        "content": "SAO PAULO  April 26 Brazil's BRF is importing corn from Mercosur countries but does not expect to take advantage of a new quota to buy tariff-free corn from outside the regional trade bloc  the company said in an e-mail to Reuters.",
        "date": "04262016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF says importing corn from Mercosur countries "
    },
    {
        "content": "SAO PAULO  Feb 26 Brazil's BRF SA  will likely maintain investments of around 2 billion reais ($505 million) in 2016  CEO Pedro Faria said on a conference call on Friday  adding that the Brazilian market could remain a challenge with rising domestic corn prices increasing feed costs and an economic recession curbing demand.",
        "date": "02262016",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "BRF says to maintain investments in 2016  changes CFO "
    },
    {
        "content": "SAO PAULO  Feb 26 Brazilian food processor BRF SA posted a fourth-quarter net profit of 1.4 billion reals ($354 million)  helped by international sales and a tax credit  the company said in a filing to the local regulator.   (Reporting by Reese Ewing; Editing by David Goodman)",
        "date": "02262016",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazilian food processor BRF posts 1.4 bln real net profit "
    },
    {
        "content": "SAO PAULO  Feb 25 Brazil's BRF SA  the world's largest chicken exporter  on Thursday posted a profit of 1.415 billion reais ($357 million)  surpassing forecasts for 866 million reais in a Reuters poll due to better-than-expected sales abroad.",
        "date": "02262016",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF profit beats expectations "
    },
    {
        "content": "RIO DE JANEIRO  Dec 14 Workers at one of BRF SA's largest Brazilian meatpacking plants voted to go on strike within 15 days if the company  the world's biggest poultry exporter  fails to meet wage-increase and other demands.",
        "date": "12142015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "BRF workers in Brazil's Mato Grosso threaten strike over pay "
    },
    {
        "content": "SAO PAULO  Dec 1 Brazil's BRF SA  the world's largest chicken exporter  signed an agreement to acquire Thailand's Golden Foods Siam for $360 million  the company said on Tuesday in a securities filing.",
        "date": "12022015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF to buy Thailand's Golden Foods Siam for $360 mln "
    },
    {
        "content": "SAO PAULO  Nov 17 Latin American stocks rose on Tuesday in line with strong Wall Street performance  while currencies in the region were little changed after a batch of economic data did little to change investor expectations about the future of U.S. interest rates.     Stocks tracked by a benchmark MSCI index for Latin America  rose 1 percent. Benchmark equity indexes for Brazil and Mexico also gained about 1 percent each.     Shares of Brazil's BRF SA  the world's largest poultry e",
        "date": "11172015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "EMERGING MARKETS-Latam stocks gain with Wall St; BRF boosts Brazil Bovespa "
    },
    {
        "content": "SAO PAULO  Oct 30 Brazil's BRF SA  the world's largest poultry exporter  expects to raise prices for many of its products in 2016 due to cost pressures  the chief executive of the processed food company told anlaysts and reporters in a call on Friday.",
        "date": "10302015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil BRF says likely to raise prices in 2016 due to costs -CEO "
    },
    {
        "content": "SAO PAULO  Oct 29 Brazil's BRF SA  the world's largest chicken exporter  on Thursday posted a higher-than-expected profit due to strong performances overseas and gains from a weaker real despite the sluggish Brazilian economy.",
        "date": "10302015",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazilian chicken exporter BRF's profit tops expectations "
    },
    {
        "content": "SAO PAULO  Oct 5 BRF SA  the world's largest poultry producer  has made a binding offer to purchase a stake in Qatar National Import and Export Co's frozen food distribution unit  part of a strategy to expand in markets such as the Middle East and Asia.",
        "date": "10052015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF makes binding offer for stake in Qatar's QNIE unit "
    },
    {
        "content": "SAO PAULO  Oct 2 Brazil's BRF SA  the world's largest chicken exporter  said it was buying Argentine brands producing sausage  hamburgers and margarine from Molinos Rio de la Plata for $43.5 million.",
        "date": "10022015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF expands Argentine portfolio "
    },
    {
        "content": "BRASILIA  Aug 27 The board of BRF Brasil Foods SA  the world's largest poultry exporter  has approved a share buyback program of up to 14.5 million shares or 1.7 percent of its capital  the company said on Thursday in a securities filing.",
        "date": "08272015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil food processor BRF says board approves share buyback program "
    },
    {
        "content": "SAO PAULO  Aug 5 Brazilian antitrust agency Cade dismissed concerns that Abilio Diniz's holdings in the local unit of French retailer Carrefour SA and food processor BRF SA pose a risk to competition.",
        "date": "08052015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil antitrust agency clears Diniz stakes in BRF  Carrefour "
    },
    {
        "content": "SAO PAULO  July 30 BRF SA  the world's largest chicken exporter  on Thursday posted a second-quarter profit of 364 mln reais ($108 million)  well below the 437 million reais expected by analysts  as a worsening economy offset potential gains from a weak currency.",
        "date": "07302015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "UPDATE 1-Brazil's BRF posts smaller-than-expected 2nd-quarter profit "
    },
    {
        "content": "SAO PAULO  July 29 A weaker Brazilian currency has helped Brazil's meat exports recover their competitive position  Pedro Faria  CEO of BRF SA  the world's largest poultry exporter and a processed foods maker  said on Wednesday.",
        "date": "07292015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF says weaker real helping meat exports "
    },
    {
        "content": "SAO PAULO  July 30 BRF SA  the world's largest chicken exporter  on Thursday posted a second-quarter profit of 364 mln reais ($108 million)  well below the 437 million reais expected by analysts.",
        "date": "07302015",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "CORRECTED-Brazil's BRF posts smaller-than-expected 2nd-quarter profit "
    },
    {
        "content": "* Said on Wednesday that it completed the acquisition of the dairy division of BRF SA (BRF)  a Brazilian food company",
        "date": "07022015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "BRIEF-Parmalat completes acquisition of BRF dairy division "
    },
    {
        "content": "SAO PAULO  June 2 The board of directors of BRF Brasil Foods SA  the world's largest poultry exporter  has approved a bond repurchase of up to $500 million  according to a securities filing on Tuesday.",
        "date": "06022015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF poultry exporter OK's $500 million bond repurchase "
    },
    {
        "content": "NEW YORK  May 29 (IFR) - Brazilian food company BRF's debut euro bond topped off a slow week in the Latin American primary markets.",
        "date": "05292015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF makes successful debut despite shaky backdrop "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  May 29 (Fitch) Fitch Ratings has assigned a 'BBB-(exp)' rating to the  proposed benchmark-size senior unsecured notes to be issued by BRF S.A (BRF).  These proposed senior unsecured notes will rank equally with all of BRF's  existing and future senior and unsecured indebtedness. The proceeds of the bond  will support investments in sustainable projects of the company. KEY RATING DRIVERS Strong Business Profile:  BRF is one of ",
        "date": "05292015",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Fitch Rates BRF's Proposed Senior Unsecured Notes 'BBB-' "
    },
    {
        "content": "SAO PAULO  April 28 Brazilian meat processor BRF SA on Tuesday reported an increase in first-quarter profit of 43 percent compared with the previous year  due to improving operational performance and a reduction in net financial expenses.",
        "date": "04282015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "UPDATE 1-Brazil's BRF posts first quarter profit of 462 mln reais "
    },
    {
        "content": "SAO PAULO  April 28 Brazilian meat processor BRF SA reported first-quarter earnings of 462 million reais ($159 million) on Tuesday  down from 991 million reais in the fourth quarter of 2014 and up from 323 million reais in the first quarter of 2014.",
        "date": "04282015",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF posts first quarter profit of 462 mln reais "
    },
    {
        "content": "SAO PAULO  April 22 Brazil's antitrust authority cleared French food company Lactalis to buy dairy units from food processor BRF SA for 1.8 billion reais ($594 million)  an item in the government gazette said on Wednesday.",
        "date": "04222015",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil regulator clears France's Lactalis to buy BRF dairy units "
    },
    {
        "content": "SAO PAULO  April 22 Brazil's BRF SA  the world's largest poultry exporter  has agreed to a joint venture with British-based Invicta Food Group Ltd to distribute processed foods in Britain  Ireland and Scandinavia  according to a securities filing on Wednesday.",
        "date": "04222015",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF and Invicta enter distribution JV for UK  Scandinavia "
    },
    {
        "content": "SAO PAULO  April 16 Brazilian food processing company BRF SA said on Thursday it would invest $19 million for a 49 percent stake in  a joint venture in Singapore that will focus on expanding the supply of processed and value-added foods on the local market.",
        "date": "04162015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil food processor BRF in venture to expand Singaporean supply "
    },
    {
        "content": "SAO PAULO  April 14 Brazil's BRF SA  the world's largest poultry exporter  plans to focus on conquering new markets in the Middle East and Asia in the next few years  CEO Pedro Faria said at an event in Sao Paulo on Tuesday.   (Reporting by Aluisio Alves)",
        "date": "04142015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF says focused on new markets in middle East  Asia "
    },
    {
        "content": "SAO PAULO  Feb 26 Brazilian meats processor BRF SA on Thursday reported quarterly earnings that rose nearly fivefold  beating expectations  helped by rising domestic sales.",
        "date": "02262015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "UPDATE 1-Brazil food processor BRF's profit beats expectations "
    },
    {
        "content": "SAO PAULO  Feb 26 Brazilian meats processor BRF SA posted a fourth-quarter net profit of 991 million reais ($341.7 million) on Thursday  beating estimates for 807.2 million reais in a Reuters poll.",
        "date": "02262015",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Profit at Brazil food processor BRF beats expectations "
    },
    {
        "content": "SAO PAULO  Feb 27 Brazilian meat processor BRF SA said on Friday it expects capital expenditures of 1.85 billion reais in 2015 ($642 million)  up from 1.5 billion reais in 2014  and its global director said it is attentive to acquisition opportunities.",
        "date": "02272015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazil's BRF sees 2015 Capex of $642 mln  open to acquisitions "
    },
    {
        "content": "SAO PAULO  Feb 27 A truck strike in Brazil that is now in its 10th day has made the completion of food export orders difficult for BRF SA  the world's largest chicken exporter  Chairman Abilio Diniz said on Friday.",
        "date": "02272015",
        "name": "BRF SA",
        "news_type": "normal",
        "symbol": "BRFS",
        "title": "Brazil's BRF says truck strike complicating food exports "
    },
    {
        "content": "SAO PAULO  Jan 23 Brazil's BRF SA  the world's biggest chicken exporter  aims to expand further into Asia by building on a recent Indonesian joint venture with more partnerships and acquisitions  a top executive said.",
        "date": "01232015",
        "name": "BRF SA",
        "news_type": "topStory",
        "symbol": "BRFS",
        "title": "Brazilian meats processor BRF looks to expand in Asia "
    }
]