[
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  July 24 (Fitch) Fitch Ratings has assigned an 'A+(EXP)' rating to Banco Santander Chile's (BSC) upcoming USD100 million three-year senior unsecured floating-rate notes. This issuance is made under the umbrella of the medium-term notes program of up to USD5.5 billion. The notes will be denominated in U.S. Dollars and will mature on July 25  2020 and carry a floating-rate coupon of three-month U.S. LIBOR + 80 basis points. KEY R",
        "date": "07242017",
        "name": "Banco Santander Chile",
        "news_type": "topStory",
        "symbol": "BSAC",
        "title": "Fitch Rates Banco Santander Chile's USD100MM Floating-Rate Notes 'A+(EXP)' "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK/SANTIAGO  November 11 (Fitch) Fitch Ratings has assigned an 'A+(EXP)'  rating to Banco Santander Chile's (BSC) upcoming USD185 million senior unsecured  floating-rate notes (FRNs). This issuance is made under the umbrella of the  Medium-Term Notes Program of up to USD5.5 billion. The senior unsecured bonds will be denominated in U.S. dollars and will mature  on Nov. 28  2021 and carry a floating annual interest rate of three-mo",
        "date": "11112016",
        "name": "Banco Santander Chile",
        "news_type": "topStory",
        "symbol": "BSAC",
        "title": "Fitch Rates Banco Santander Chile's Upcoming USD185MM FRN 'A+(exp)' "
    },
    {
        "content": "SANTIAGO  Nov 10 Banco Santander-Chile  issued $185 million in five-year bonds on the Taiwanese debt market  the company said on Thursday  continuing its recent trend of looking to international markets to raise debt.",
        "date": "11102016",
        "name": "Banco Santander Chile",
        "news_type": "topStory",
        "symbol": "BSAC",
        "title": "Santander Chile issues $185 million in bonds on Taiwanese market "
    },
    {
        "content": "SANTIAGO  April 26 Banco Santander-Chile  expects its loan portfolio to expand by $2.8 billion in 2016 and sees loan growth across Chile's banking industry of between 6 percent to 8 percent this year  the bank's Chief Executive Claudio Melandri said on Tuesday.",
        "date": "04262016",
        "name": "Banco Santander Chile",
        "news_type": "topStory",
        "symbol": "BSAC",
        "title": "Santander Chile sees loan growth of $2.8 bln in 2016 "
    },
    {
        "content": "SANTIAGO  April 28 Banco Santander-Chile  plans to invest around $510 million through 2017 to upgrade some of its branches and to implement programs to improve customer service and technology  the bank's Chief Executive Claudio Melandri said on Tuesday.",
        "date": "04282015",
        "name": "Banco Santander Chile",
        "news_type": "topStory",
        "symbol": "BSAC",
        "title": "Banco Santander-Chile to invest $510 million through 2017 "
    }
]