[
    {
        "content": "* ‍ANNOUNCES A 20 MILLION STG INVESTMENT IN AN EXPANSION OF ULTRAFAST BROADBAND TO TOWNS ACROSS NORTHERN IRELAND​ Further company coverage: (bangalore.newsroom@thomsonreuters.com)",
        "date": "11162017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-Bt Group invests 20 mln stg in an expansion of ultrafast broadband to towns across Northern Ireland​ "
    },
    {
        "content": "LONDON Vodafone will partner with fibre network developer CityFibre to bring ultrafast broadband to 5 million UK homes and businesses by 2025  in a direct challenge to dominant rival BT .",
        "date": "11092017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Vodafone challenges BT with UK fibre broadband plan "
    },
    {
        "content": "LONDON  Nov 9 Vodafone will partner with fibre network developer CityFibre to bring ultrafast broadband to 5 million UK homes and businesses by 2025  in a direct challenge to dominant rival BT.",
        "date": "11092017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 1-Vodafone challenges BT with UK fibre broadband plan "
    },
    {
        "content": "LONDON Britain's biggest telecoms company BT  said on Monday that unless businesses were clear by the beginning of 2018 about the terms of a transitional period after Britain leaves the European Union they would need to plan for a damaging \"hard Brexit\".",
        "date": "11062017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UK business needs clarity on Brexit transition by year-end: BT boss "
    },
    {
        "content": "LONDON  Nov 6 Britain's biggest telecoms company BT said on Monday that unless businesses were clear by the beginning of 2018 about the terms of a transitional period after Britain leaves the European Union they would need to plan for a damaging \"hard Brexit\".",
        "date": "11062017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UK business needs clarity on Brexit transition by year-end - BT boss "
    },
    {
        "content": "* ‍industry welcomes openreach ambition to build a large fttp broadband network​",
        "date": "10312017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-BT says telecoms sector welcomes its fibre network ambitions "
    },
    {
        "content": "* Shares fall to multi-year low (Adds further CEO comments from later meeting  updates shares)",
        "date": "11022017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 3-BT weighed down by problems at Global Services business "
    },
    {
        "content": "* Chief executive gavin patterson says remains \"very happy\" with performance of bt sport",
        "date": "11022017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-BT CEO \"very happy\" with performance of BT Sport "
    },
    {
        "content": "LONDON  Nov 2 BT Group BT.L reported a 4 percent drop in second-quarter adjusted earnings as its struggles to turn around its Global Services unit  while higher costs for pensions and sports rights offset growth in its EE mobile business.",
        "date": "11022017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "RPT--BT second-quarter profit dragged down by Global Services unit "
    },
    {
        "content": "LONDON  Nov 2 BT Group reported a 4 percent drop in second-quarter  adjusted earnings as its struggles to turn around its Global Services unit  while higher costs for pensions and sports rights offset growth in its EE mobile business.",
        "date": "11022017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT second-quarter profit dragged down by Global Services unit "
    },
    {
        "content": "Nov 2 The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "11022017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "PRESS DIGEST- British Business - Nov 2 "
    },
    {
        "content": "LONDON  Oct 26 Britain's BT has agreed to cut the amount it charges customers who only take a landline service by 37 percent following pressure from the regulator which is seeking to protect elderly and vulnerable people.",
        "date": "10262017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT to cut charges for landline-only customers "
    },
    {
        "content": "* ‍CHARGES CUT FOR UP TO A MILLION BT LANDLINE-ONLY CUSTOMERS​",
        "date": "10262017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-UK's Ofcom says ‍charges cut for up to a mln BT landline-only customers​ "
    },
    {
        "content": "BERLIN BT  Britain's biggest telecoms group  plans to cut about 130 jobs in Germany  Frankfurt Allgemeine Zeitung reported  citing Germany chief Stefan Hirscher.",
        "date": "10232017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT to cut around 130 jobs in Germany: Frankfurter Allgemeine "
    },
    {
        "content": "BERLIN  Oct 23 BT  Britain's biggest telecoms group  plans to cut about 130 jobs in Germany  Frankfurt Allgemeine Zeitung reported  citing Germany chief Stefan Hirscher.",
        "date": "10232017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT to cut around 130 jobs in Germany -Frankfurter Allgemeine "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  September 25 (Fitch) Fitch Ratings has affirmed BT Group plc's (BT) Long-Term Issuer Default Rating (IDR) at 'BBB+'. The Outlook is Stable. A full list of rating actions is below. BT's ratings take into account its broad scale  business diversification and established market positions across a competitive UK communications market. A series of problems including cash-flow restatements following the discovery of unauthorised accou",
        "date": "09252017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Fitch Affirms BT Group plc at 'BBB+'; Outlook Stable "
    },
    {
        "content": "LONDON British telecoms provider BT has offered to invest up to 600 million pounds ($778 million) to provide faster broadband services to remote parts of the country  Britain's government said on Sunday.",
        "date": "07292017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT floats 600 million-pound plan to push broadband into remote corners of UK "
    },
    {
        "content": "LONDON  July 28 BT suffered a 42 percent drop in quarterly profit after taking a fresh charge to avoid legal claims from two major investors over an Italian accounting scandal.",
        "date": "07282017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 3-BT pays out to avoid court battle over Italian scandal "
    },
    {
        "content": "LONDON  July 28 Britain's major share index slipped  heading for a weaker finish to the week after corporate earnings drove big swings in individual stocks  with BT Friday's biggest faller.",
        "date": "07282017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Britain's FTSE heads for weekly loss as Italy takes toll on BT "
    },
    {
        "content": "LONDON  July 28 Britain's BT posted a 42 percent drop in first-quarter pretax profit due to a settlement with investors Deutsche Telekom and Orange over an Italian accounting scandal.",
        "date": "07282017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Investor settlement over Italian scandal hits BT profits "
    },
    {
        "content": "    July 28 Britain's FTSE 100 index is seen opening down 36 points at 7406.8 on Friday  according to financial bookmakers.               * UK CONSUMER MORALE: British consumer morale has sunk back to depths hit just after last year's Brexit vote and worse may be to come as households' view of the broader economic situation dropped to a four-year low  according to a survey on Friday.     * SHELL: Royal Dutch Shell Plc plans to begin permanently shuttering the gasoline-producing unit ",
        "date": "07282017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UK Stocks-Factors to watch on July 28 "
    },
    {
        "content": "* Announced how openreach will be held to account  as it becomes legally separate from BT  to ensure it delivers for phone and broadband users",
        "date": "07132017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-UK's Ofcom says to closely monitor BT's compliance with new commitments "
    },
    {
        "content": "July 11 UK's Ofcom has capped the maximum spectrum a company could win as it set new rules for the auction of mobile spectrum to safeguard competition  the communications regulator said on Tuesday.",
        "date": "07112017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UK regulator Ofcom places bidding restrictions on BT  Vodafone "
    },
    {
        "content": "LONDON  July 12 The outgoing chairman of BT was forced to defend his handling of a \"perfect storm\" of troubles that hit the British company this year  saying he had battled to stabilise the business and prevent damage from spreading.",
        "date": "07122017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT chairman defends handling of \"perfect storm\" at feisty AGM "
    },
    {
        "content": "MILAN  July 5 The U.S. accounting watchdog is investigating accounting firm  PricewaterhouseCoopers's audits of British telecoms group BT's Italian business  which has been hit by a book-keeping scandal  a source close to the matter said.",
        "date": "07052017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "U.S. accounting watchdog probes PwC's audits of BT Italy - source "
    },
    {
        "content": "LONDON  June 29 Britain's accounting regulator said on Thursday it would investigate audits by PricewaterhouseCoopers LLP (PwC) of BT Group after a scandal was uncovered this year at the Italian operations of the British telecoms group.",
        "date": "06292017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 2-UK regulator to probe PwC's audits of BT after Italian scandal "
    },
    {
        "content": "LONDON  June 29 Britain's Financial Reporting Council (FRC) said on Thursday it would investigate PricewaterhouseCoopers LLP's audits of BT Group for 2015 to 2017 after an accounting scandal in the telecoms company's Italian operations.",
        "date": "06292017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UK regulator to investigate PWC's audits of BT after Italian scandal "
    },
    {
        "content": "* BT and KCOM continue to have \"significant market power in uncompetitive areas of country\"",
        "date": "06222017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-Ofcom says BT has \"significant market power\" in some areas "
    },
    {
        "content": "PARIS  June 19 French telecoms company Orange could get 900 million pounds ($1.15 billion) by reducing its stake in British rival BT Group from 4 percent to as little as 1.33 percent  it said on Monday.",
        "date": "06192017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 2-France's Orange says it could get $1.15 bln by cutting stake in BT "
    },
    {
        "content": "PARIS French telecoms company Orange plans to reduce its stake in British rival BT Group from 4 percent to as little as 1.33 percent  it said on Monday.",
        "date": "06192017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "France's Orange to cut stake in BT Group "
    },
    {
        "content": "PARIS  June 19 French telecoms firm Orange said on Monday it was reducing its stake in Britain's BT Group to about 2.66 percent from 4 percent  and could cut it further to as little as 1.33 percent.",
        "date": "06192017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "France's Orange to cut stake in BT Group to 2.66 pct or less "
    },
    {
        "content": "June 8 Britain's BT said on Thursday it would drop PricewaterhouseCoopers(PwC)  its auditors since 1984  in favour of KPMG after an evaluation done following BT's Italy accounting scandal revealed \"areas for improvement\" for PwC.",
        "date": "06082017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT to drop auditors PwC  hire KPMG "
    },
    {
        "content": "* ‍BT board has approved proposed appointment of KPMG as auditor.​",
        "date": "06082017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-BT names KPMG as its new auditor "
    },
    {
        "content": "* Announced contract with Bridgestone Europe for network infrastructure  managed cloud services in Europe  Middle East And Africa​ Source text for Eikon: Further company coverage:",
        "date": "05302017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-BT Group ‍announces contract with Bridgestone Europe "
    },
    {
        "content": "LONDON  May 26 Britain's biggest telecoms group BT Group Plc has begun informal talks with representatives of its retired staff about a plan to cap their pensions and ease one of the biggest challenges facing the company  the Daily Telegraph newspaper reported on Friday.",
        "date": "05262017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT talking to pensioners about caps on benefits -Telegraph "
    },
    {
        "content": "* Says co's non BT cotton Surbhi in suspension list by maharashtra government for suspending sale of cotton products",
        "date": "05252017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-Nath Bio-Genes says co's non BT cotton 'Surbhi' in suspension list by Maharashtra govt "
    },
    {
        "content": "    May 22 Britain's FTSE 100 index is seen opening up 15 points at 7 486 on Monday  according to financial bookmakers.           * M&S:  Britain's Marks & Spencer is expected to report a renewed decline in clothing and homeware sales in its latest quarter  dampening the euphoria of the previous three months when it reported a first increase in nearly two years.     * BT: Italian investigators have seized documents from the Milan offices of International Business Machines Corp as par",
        "date": "05222017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UK Stocks-Factors to watch on May 22 "
    },
    {
        "content": "MILAN - Italian investigators have seized documents from the Milan offices of International Business Machines Corp as part of an investigation into allegations of fraud at one of its customers  BT Italy  a unit of Britain's BT Group  sources said.",
        "date": "05192017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Exclusive: Italy tax police seize documents from IBM in BT Italy probe "
    },
    {
        "content": "LONDON  May 11 BT proposed on Thursday building a network to connect 10 million homes with ultrafast full-fibre broadband by the mid-2020s  but told rivals which would also use the network to give their backing so the investment made commercial sense.",
        "date": "05112017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Britain's BT sets out ambition for ultrafast broadband "
    },
    {
        "content": "LONDON BT   Britain's biggest telecoms group  said it would shake up its global service division that serves multinationals and scale back its dividend growth ambitions as it recovers from an accounting scandal in Italy and a profit warning. | Video ",
        "date": "05112017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT to restructure Global Services after 'challenging year' "
    },
    {
        "content": "May 8 Fastweb Chief Executive Alberto Calcagno says:",
        "date": "05082017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-Fastweb CEO says not interested in BT's Italian unit "
    },
    {
        "content": "LONDON  May 11 BT  Britain's biggest telecoms group  said it would shake up its global service division that serves multinationals and scale back its dividend growth ambitions as it recovers from an accounting scandal in Italy and a profit warning.",
        "date": "05112017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "CORRECTED-BT to restructure Global Services after 'challenging year' "
    },
    {
        "content": "* Reins in dividend growth policy (Adds shareholder reaction)",
        "date": "05112017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 3-BT to cut 4 000 jobs in restructuring after 'challenging year' "
    },
    {
        "content": "* 700 mln euro charge on BT stake weighs on net profit (Rewrites to lead on M&A in U.S.  updates shares)",
        "date": "05112017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 3-T-Mobile US set to take part in U.S. merger talks - Deutsche Telekom "
    },
    {
        "content": "LONDON  May 11 Britain's top-share index slipped from a one-month high on Thursday as disappointing results and downgrades weighed on stocks  as well as a slump in Hikma's shares after a setback to one of its drugs.",
        "date": "05112017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Results  downgrades keep Britain's FTSE under pressure "
    },
    {
        "content": "* Chief Executive Gavin Patterson and outgoing group Finance Director Tony Chanmugam will not receive a bonus for 2016/17 financial year",
        "date": "05112017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-BT CEO and former CFO to lose payouts over Italy scandal "
    },
    {
        "content": "* Has completed acquisition of IP Trade following approval by UK's Competition & Markets Authority (CMA). Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "05022017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-BT says completed acquisition of IP Trade "
    },
    {
        "content": "* Says Subex awarded a new 5-year framework contract with BT Source text for Eikon: Further company coverage:",
        "date": "05032017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-Subex gets 5-year framework contract with BT "
    },
    {
        "content": "April 25 Britain's Competition Authority says decided not to refer acquisition by BT Group Plc of IP Trade to a phase 2 investigation",
        "date": "04252017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-Competition watchdog says no further investigation into BT's deal with IP Trade "
    },
    {
        "content": "MILAN British Telecom  has filed a criminal complaint with Italian prosecutors over an accounting scandal at its Italian unit and has handed them computer records and also dispatched its head of compliance to Milan to give evidence.",
        "date": "04212017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Exclusive: BT files criminal complaint over Italy accounting scandal "
    },
    {
        "content": "MILAN Three employees of BT Group's Italian unit warned their Madrid-based supervisor in November 2015 about possible accounting problems at BT Italy  one of the three said  a year before the phone company revealed financial irregularities at the division.",
        "date": "03302017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Exclusive: Bullying  bonuses and a red flag that BT missed in Italy - sources "
    },
    {
        "content": "* Ofcom proposes price cap on most popular superfast broadband",
        "date": "03312017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 1-Britain's Ofcom plans to cut some BT wholesale broadband prices "
    },
    {
        "content": "LONDON  March 31 Britain's telecoms regulator said it planned to promote investment in faster broadband by cutting the price that network operator BT can charge other operators for connections with download speeds of up to 40 Mbit per second.",
        "date": "03312017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Britain's Ofcom plans to cut some BT wholesale broadband prices "
    },
    {
        "content": "March 27 Italy public procurement agency Consip says:",
        "date": "03272017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-Fastweb  Wind-Tiscali and BT-Vodafone joint ventures win Italy state contract "
    },
    {
        "content": "LONDON Britain's BT has been fined a record 42 million pounds ($53 million) by the regulator for failing to install high-speed lines for businesses fast enough  in an error that is likely to cost the company around 300 million pounds in compensation.",
        "date": "03272017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT fined record 42 million pounds for business-line installation errors "
    },
    {
        "content": "LONDON  March 27 Britain's BT has been fined a record 42 million pounds ($53 million) by the regulator for failing to install high-speed lines for businesses fast enough  in an error that is likely to cost the company around 300 million pounds in compensation.",
        "date": "03272017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT fined record 42 mln stg for business-line installation errors "
    },
    {
        "content": "* BT to be fined 42 million stg for breaching contracts with telecoms providers",
        "date": "03272017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-BT to be fined 42 mln stg for breaching contracts with telecoms providers "
    },
    {
        "content": "March 22 Britain's telecom watchdog said on Wednesday it fined BT Group Plc's Plusnet division 880 000 pounds ($1.10 million) for continuing to bill more than a thousand ex-customers.",
        "date": "03222017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Britain's telecom watchdog fines BT's Plusnet for billing ex-customers "
    },
    {
        "content": "LONDON  March 10 British shares gained on Friday  led by BT as investors cheered the resolution of a long-running regulatory battle over its broadband unit.",
        "date": "03102017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Britain's FTSE bounces on BT and oil stocks "
    },
    {
        "content": "* Rio to announce successor this year   (Adds detail on Rio succession  analyst comment  shares)",
        "date": "03092017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 2-Britain's BT appoints Jan du Plessis as next chairman "
    },
    {
        "content": "LONDON Britain's biggest telecoms group BT has bowed to industry and regulatory pressure and agreed to legally separate its national network  as the government seeks to deliver faster broadband speeds for millions. | Video ",
        "date": "03102017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Britain's BT resolves two-year broadband battle with Openreach deal "
    },
    {
        "content": "LONDON  March 10 Britain's biggest telecoms group BT has bowed to industry and regulatory pressure and agreed to legally separate its national network  as the government seeks to deliver faster broadband speeds for millions.",
        "date": "03102017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 4-Britain's BT resolves two-year broadband battle with Openreach deal "
    },
    {
        "content": "March 9 Britain's FTSE 100 index is seen opening down 21 points at 7 314 on Thursday  according to financial bookmakers  with futures  down 0.5 percent ahead of the cash market open.",
        "date": "03092017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 2-UK Stocks-Factors to watch on March 9 "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - BT’s split will please all parties some of the time. Rivals say the status quo is bad for them and customers  and might have wanted a full breakup. But the UK telco’s huge pension scheme made that impractical.",
        "date": "03102017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT split will please all people some of the time "
    },
    {
        "content": "* Says chairman Jan du Plessis has informed board that he intends to retire as chairman after completion of an orderly succession process",
        "date": "03092017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-Rio Tinto says Jan du Plessis to retire as chairman "
    },
    {
        "content": "* BT jumps after Openreach deal   (Recasts  adds detail and quotes  updates prices)",
        "date": "03102017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT  banks and oil boost European shares ahead of U.S. jobs data "
    },
    {
        "content": "LONDON  March 10 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "03102017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "European shares climb higher on BT  banks  oil stocks - For more see the European equities LiveMarkets blog "
    },
    {
        "content": "LONDON  March 10 European shares rose on Friday in early deals  with gains underpinned by a rally among energy stocks as well as BT as attention turned to closely-watched U.S. jobs data due later in the day.",
        "date": "03102017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT  oil stocks help European shares pop higher ahead of U.S. jobs data in focus "
    },
    {
        "content": "LONDON  March 9 Britain's BT has appointed Jan du Plessis  chairman of miner Rio Tinto  as its next chairman  taking over from Mike Rake who has led the telecoms group for 10 years.",
        "date": "03092017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Britain's BT appoints Jan du Plessis as next chairman "
    },
    {
        "content": "LONDON  March 10 Britain's biggest telecoms group BT has reached an agreement with the regulator to finally resolve a two-year row over how the national broadband network is run  agreeing to a legal separation of the business.",
        "date": "03102017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT resolves two-year regulatory battle with new Openreach deal "
    },
    {
        "content": "* Says launches its merger inquiry on anticipated acquisition of IP Trade SA by BT Group Plc",
        "date": "03072017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-UK's CMA launches merger inquiry into BT-IP Trade deal "
    },
    {
        "content": "* Says no change to financial outlook   (Adds exec comments  analyst reaction  shares)",
        "date": "03062017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 2-BT outbids Sky to retain Champions League rights in 1.2 bln stg deal "
    },
    {
        "content": "* CFO says likes U.S. business  there is a standalone path  Further company coverage:",
        "date": "03022017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-Deutsche Telekom CEO sees much potential for BT cooperation "
    },
    {
        "content": "LONDON  March 6 Britain's BT has won the rights to broadcast the UEFA Champions League and Europa League for another three years in a 1.18 billion pound ($1.45 billion) deal that locks out arch-rival Sky from the competition.",
        "date": "03062017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT retains UEFA Champions League rights in 1.2 bln stg deal "
    },
    {
        "content": "LONDON  March 2 BT  Britain's biggest telecoms group  vowed to improve customer service for its millions of residential consumers and the other telecoms companies that rely on its network after widespread criticism.",
        "date": "03022017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 2-Stung by widespread criticism  BT vows to up its game "
    },
    {
        "content": "BONN  Germany Deutsche Telekom  forecast its core profit growth would halve this year as earnings engine T-Mobile US  slows  strengthening the case for a U.S. mobile merger that Deutsche Telekom has long desired.",
        "date": "03022017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Deutsche Telekom core profit growth to halve as U.S. motor slows "
    },
    {
        "content": "LONDON  March 2 BT  Britain's biggest telecoms group  vowed to improve its customer service for both the millions of residential consumers and the other telecoms companies that rely on its network after being stung by widespread criticism.",
        "date": "03022017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Stung by widespread criticism  BT vows to up its game "
    },
    {
        "content": "* Says new partnership with BT is second step in cooperation with BT",
        "date": "03012017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-Deutsche Telekom announces new partnership with BT "
    },
    {
        "content": "LONDON  Feb 28 British telecoms regulator Ofcom said it planned to force BT to cut its bills by at least 5 pounds a month for those customers that only take a landline  seeking to protect elderly and vulnerable people who rely on the service.",
        "date": "02282017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "British regulator to force BT to cut landline-only bills "
    },
    {
        "content": "BONN  Germany  March 2 Deutsche Telekom  wants to keep its stake in British telecoms operator BT despite writing down the value of the holding by 2.2 billion euros ($2.3 billion)  Chief Executive Tim Hoettges said in the speech of a text on Thursday.",
        "date": "03022017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Deutsche Telekom CEO says BT stake is still right -speech text "
    },
    {
        "content": "* Ofcom plans to cut bills by at least £5 a month for BT customers that have only a landline",
        "date": "02282017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-UK's Ofcom says plans to cut BT landline bills by at least 5 pounds/month "
    },
    {
        "content": "BONN  Germany  March 2 Deutsche Telekom  wrote down the value of its stake in Britain's BT  by 2.2 billion euros ($2.3 billion)  pushing it to a fourth-quarter net loss of 2.12 billion euros from a profit of 946 million euros a year earlier.",
        "date": "03022017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Deutsche Telekom writes down BT stake by 2.2 bln euros "
    },
    {
        "content": "* Investigating the anticipated acquisition by BT Group Plc  through its subsidiary BT (Netherlands) Holding BV  of IP Trade S.A",
        "date": "02242017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-UK's CMA investigating BT Group  IP Trade deal "
    },
    {
        "content": "LONDON  Feb 17 After ending last year down heavily  the value of London-based Lansdowne Partners' main fund slid again in January after shares in crisis-hit BT Group plunged  a letter to investors seen by Reuters showed.",
        "date": "02172017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT hit weighs on hedge fund Lansdowne's January returns - letter "
    },
    {
        "content": "LONDON  Feb 2 Vodafone  the world's second-biggest mobile operator  said on Thursday that the rate of growth in its international business division had slowed  echoing a similar warning given by British rival BT last week.",
        "date": "02022017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Vodafone joins BT in warning of pressures on international corporate business "
    },
    {
        "content": "LONDON BT  boss Gavin Patterson said an Italian accounting scandal that wiped 8 billion pounds ($10 billion) from the company's value this week was under control as he sought to reassure investors who he said were rightly upset with the firm. | Video ",
        "date": "01272017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Crisis-hit BT says Italian scandal now under control "
    },
    {
        "content": "* Says Italian deception was sophisticated and actively hidden",
        "date": "01272017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 3-Crisis-hit BT says Italian scandal now under control "
    },
    {
        "content": "LONDON  Jan 27 BT  the telecoms group reeling from an accounting scandal and a slowdown in its government work  said it was seeing record growth in its EE mobile unit and good momentum in consumer operations in a bid to reassure investors.",
        "date": "01272017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Crisis-hit BT seeks to reassure investors  points to strong consumer demand "
    },
    {
        "content": "NEW YORK BT Group Plc has been hit by at least two shareholder lawsuits in the United States  after one-fifth of the telecommunications company's market value was wiped out on Tuesday  due in part to an accounting scandal in Italy.",
        "date": "01262017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT Group faces U.S. lawsuits as Italian accounting scandal deepens "
    },
    {
        "content": "NEW YORK  Jan 26 BT Group Plc has been hit by at least two shareholder lawsuits in the United States  after one-fifth of the telecommunications company's market value was wiped out on Tuesday  due in part to an accounting scandal in Italy.",
        "date": "01262017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 1-BT Group faces U.S. lawsuits as Italian accounting scandal deepens "
    },
    {
        "content": "NEW YORK  Jan 25 BT Group Plc was hit on Wednesday with at least two shareholder lawsuits in the United States  after one-fifth of the telecommunications company's market value was wiped out in a single day amid a growing accounting scandal in Italy.",
        "date": "01252017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT Group faces U.S. lawsuits as Italian accounting scandal deepens "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  January 26 (Fitch) Fitch Ratings says that BT Group Plc's (BT)  disclosure this week of reporting inconsistencies at BT Italia and revised  guidance for FY17 and FY18 (financial year end March)  though material in terms  of expected performance  will ultimately have no impact on the group's current  ratings (BBB+/Stable).  BT has headroom within its rating guidelines. The main downgrade guideline is  funds from operations (FFO) ",
        "date": "01262017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Fitch: No Rating Impact from BT Italia Problems "
    },
    {
        "content": "Jan 26 Britain's FTSE 100 index is seen opening up 13 to 18 points  or as much as 0.3 percent higher  according to financial bookmakers  with futures up 0.2 percent ahead of the cash market open.",
        "date": "01262017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 2-UK Stocks-Factors to watch on Jan 26 "
    },
    {
        "content": "Jan 26 Britain's FTSE 100 index is seen opening up 13 to 18 points  or as much as 0.3 percent higher  according to financial bookmakers.          * The UK blue chip index closed up 0.2 percent at 7 164.43 points on Wednesday.      * RYANAIR: Ryanair is planning for major disruption in its business as a result of Brexit including the outside possibility it may have to move its entire UK fleet to continental Europe  Chief Executive Michael O'Leary told Reuters in an interview.     * RB",
        "date": "01262017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UK Stocks-Factors to watch on Jan 26 "
    },
    {
        "content": "MILAN Milan prosecutors have opened an investigation into BT's  Italian unit over alleged false accounting and embezzlement  two sources said  hours after the parent company issued a profit warning citing a hole in the firm's accounts.",
        "date": "01242017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Exclusive: Italian prosecutors launch probe into BT's local unit - sources "
    },
    {
        "content": "LONDON Luis Alvarez  the head of BT's  multi-national corporate division  will take direct responsibility for the firm's European business following an Italian accounting scandal  a person familiar with the situation said.",
        "date": "01252017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT's Global Services head Alvarez to oversee Europe: source "
    },
    {
        "content": "LONDON  Jan 25 Luis Alvarez  the well-regarded head of BT's multi-national corporate division  will take also responsibility for its European business following an accounting scandal in Italy  a person familiar with the situation said.",
        "date": "01252017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT's Global Services head Alvarez to oversee Europe-source "
    },
    {
        "content": "LONDON BT  lost a fifth of its market value on Tuesday when an Italian accounting scandal compounded a sudden slowdown in its British government work  forcing the telecoms group to cut forecasts for the next two years. | Video ",
        "date": "01242017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT's Italy scandal deepens and UK slows  wiping $10 billion off shares "
    },
    {
        "content": "* Sees slowdown in UK public sector work   (Adds Italian prosecutor)",
        "date": "01242017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 5-BT's Italy scandal deepens and UK slows  wiping $10 bln off shares "
    },
    {
        "content": "* Generali jumps on takeover speculation   (Adds details  closing prices)",
        "date": "01242017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT warning  poor earnings weigh on European shares; Generali rallies "
    },
    {
        "content": "* BT slumps after profit warning   (Adds detail  closing prices)",
        "date": "01242017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Miners help Britain's FTSE to shrug off BT slump "
    },
    {
        "content": "MILAN Milan prosecutors have opened an investigation into BT's  Italian unit over alleged false accounting and embezzlement  two sources with knowledge of the matter said  hours after the parent company issued a profit warning linked to the scandal.",
        "date": "01242017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Italian prosecutors launch probe into BT's local unit: sources "
    },
    {
        "content": "MILAN  Jan 24 Milan prosecutors have opened an investigation into BT's Italian unit over alleged false accounting and embezzlement  two sources with knowledge of the matter said  hours after the parent company issued a profit warning linked to the scandal.",
        "date": "01242017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Italian prosecutors launch probe into BT's local unit - sources "
    },
    {
        "content": "LONDON  Jan 24 One of the biggest investors in BT said it was surprised after the firm issued a profit warning on Tuesday  and particularly by the scale of an accounting scandal in Italy.",
        "date": "01242017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Top BT investor Royal London says surprised by scale of Italy scandal "
    },
    {
        "content": "* Generali jumps on deal chatter   (Adds quote and detail  updates prices)",
        "date": "01242017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT slump weighs on European  UK indexes; Generali rallies "
    },
    {
        "content": "* Ceo says SME market and mid market performing well  well placed even if the UK sees tightening of growth",
        "date": "01242017",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-BT CEO says Italy probably unprofitable for a number of years "
    },
    {
        "content": "LONDON  Jan 20 Britain's biggest telecoms group BT will raise its broadband prices by an inflation-busting 5 or 6 percent in April  as well as charge more for calls and some of its TV packages.",
        "date": "01202017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UK's BT to raise broadband prices in April "
    },
    {
        "content": "LONDON  Jan 18 Britain's telecoms regulator Ofcom slapped a 2.7 million pound  ($3.3 million) fine on EE  the mobile operator owned by BT Group  after an investigation found that it had overcharged nearly 40 000 customers.",
        "date": "01182017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UK regulator fines EE 2.7 mln stg for overcharging customers "
    },
    {
        "content": "* Closed investigation concerning BT's compliance with its  cost-orientation obligations under general condition 18.5 on Jan.4",
        "date": "01102017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-UK's Ofcom closes investigation into BT's price compliance "
    },
    {
        "content": "* Set out detailed plans for improving access to openreach's infrastructure  making it cheaper and easier for competing providers to connect",
        "date": "04202017",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-UK's Ofcom sets out plans for improving access to Openreach's infrastructure "
    },
    {
        "content": "Nov 28 BT Group Plc said Mike McTighe  former board member of Ofcom  has been appointed the first chairman of Openreach  BT's fixed network business.",
        "date": "11282016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT Group names McTighe as chairman of Openreach "
    },
    {
        "content": "LONDON Britain's telecoms regulator will go to the European Commission to try to force BT  to legally separate Openreach  the division that supplies broadband to millions of homes and businesses  in a major reform aimed at spurring investment in the country's aging network.",
        "date": "11292016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UK regulator goes to Europe to force reform at BT Openreach "
    },
    {
        "content": "* Ofcom to go to Europe to try to force legal separation of Openreach",
        "date": "11292016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 3-UK regulator goes to Europe to force reform at BT Openreach "
    },
    {
        "content": "* \"We note Ofcom's announcement this morning  updating on next steps of digital communications review\"",
        "date": "11292016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-BT says to continue to work with Ofcom to reach settlement "
    },
    {
        "content": "LONDON  Nov 29 British telecoms regulator Ofcom said on Tuesday it was preparing to go to the European Commission to try to force BT to legally separate its networks division Openreach after the two sides failed to come to a voluntary agreement.",
        "date": "11292016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UK regulator to go to European Commission to force change at BT's Openreach "
    },
    {
        "content": "Nov 29 The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "11292016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "PRESS DIGEST- Financial Times - Nov 29 "
    },
    {
        "content": "* Airwaves for mobile broadband to be sold in 2.3 ghz and 3.4 ghz bands",
        "date": "11212016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-UK's competition watchdog outlines rules for mobile spectrum auction "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  November 17 (Fitch) Fitch Ratings has affirmed BT Group plc's (BT)  Long-Term Issuer Default Rating (IDR) at 'BBB+'. The Outlook is Stable. A full  list of rating actions is below. BT's ratings take into account its solid incumbent telecom position in the  competitive UK telecoms market following its acquisition of EE  and its strong  cash flow generation and conservative leverage relative to European incumbent  peers. KEY RATIN",
        "date": "11172016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Fitch Affirms BT at BBB+; Stable Outlook "
    },
    {
        "content": "* CEO says currently not in any discussions about BT  stake  Further company coverage:    (Frankfurt Newsroom)",
        "date": "11102016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-Deutsche Telekom CEO says currently not in any discussions about BT stake "
    },
    {
        "content": "LONDON Britain's biggest broadband provider BT  should consider selling off its Openreach network division  shareholder Aviva Investors has suggested  according to a Sunday Telegraph report.",
        "date": "11062016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT investor says firm should consider Openreach split: Telegraph "
    },
    {
        "content": "LONDON Deutsche Telekom  is considering selling its 12 percent stake in BT Group   two sources familiar with the matter said  paving the way for it to leave the British telecoms market following Britain's vote to quit the European Union.",
        "date": "11042016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Exclusive: Deutsche Telekom mulls BT stake sale after Brexit vote - sources "
    },
    {
        "content": "* Chief Executive Gavin Patterson says market continues to be 'very dynamic'",
        "date": "10272016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-BT CEO says broadband market remains 'very dynamic' "
    },
    {
        "content": "LONDON  Oct 27 BT  Britain's biggest broadband provider  met market expectations with a 1 percent rise in second-quarter earnings  helped by price rises and strong demand for faster fibre connections  keeping it on track for its full-year targets.",
        "date": "10272016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Strong consumer demand for fibre helps BT meet Q2 expectations "
    },
    {
        "content": "LONDON  Oct 19 BT said there was a \"strong case\" for the group to invest more in fibre-optic broadband networks  but the numbers would not add up if it was forced to spin off its Openreach networks division.",
        "date": "10192016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT sees strong case for network investment if it stays intact "
    },
    {
        "content": "LONDON  Oct 5 Britain's BT said it had won a 100 million euro ($112 million) contract from staffing company Randstad to provide cloud-based services and connectivity to more than 3 500 sites across 37 countries.",
        "date": "10052016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Britain's BT wins 100 mln euro network contract from Randstad "
    },
    {
        "content": "* Sterling slumps as PM May fires Brexit starting gun   (Updates to open of U.S. trading; changes byline  dateline  pvs LONDON)",
        "date": "10032016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "GLOBAL MARKETS-Shares start quarter on downbeat note; oil eases from highs "
    },
    {
        "content": "* Sky sees better-than-expected 5-7 growth in revenue in 2016",
        "date": "07282016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 2-Sky says investment in products and content will keep revenue motoring "
    },
    {
        "content": "* BT shares rise more than 4 percent   (Adds quotes  reaction)",
        "date": "07262016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 3-BT avoids break-up with plan to run network arm separately "
    },
    {
        "content": "(The following statement was released by the rating agency) PARIS  July 26 (Fitch) Fitch Ratings has assigned French Metropolis of Rennes'  (RM) EUR100m billets de tresorerie (BT) programme an expected Short-term rating  of 'F1+(EXP)'. The final rating is contingent upon the receipt of final documentation  conforming to information already received. KEY RATING DRIVERS  The BT programme's expected rating is aligned with RM's Short-Term Issuer  Default Rating (IDR) of 'F1+' as the notes under the ",
        "date": "07262016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Fitch Rates Rennes-Metropole's BT Programme 'F1+(EXP)' "
    },
    {
        "content": "LONDON  July 25 Britain's biggest telecoms provider BT offered on Monday to appoint an independent board and chairman to run its Openreach network division in an attempt to appease rivals and prevent the break-up of the group.",
        "date": "07252016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 1-BT proposes independent board for Openreach to fend off break-up threat "
    },
    {
        "content": "LONDON Britain's telecoms regulator ordered BT  on Tuesday to run its network division as a separate company within the group  to improve national broadband coverage and avoid the need for a full break-up of the firm.",
        "date": "07262016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT avoids break-up with plan to run network arm separately "
    },
    {
        "content": "* Sky ceo says Openreach proposal is a step in the right direction  falls short of the option that would guarantee world-class coverage",
        "date": "07262016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-Telecoms CEOs react to Ofcom's Openreach proposal "
    },
    {
        "content": "LONDON  July 26 British regulator Ofcom on Tuesday said BT's network division should become a legally separate company within the telecoms group  to boost broadband coverage and avoid the need for a full break-up of the company.",
        "date": "07262016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Ofcom orders BT to run Openreach as separate company "
    },
    {
        "content": "LONDON  July 19 Britain's biggest telecoms provider BT should be forced to break up the group unless it improves service levels at the Openreach business that provides the broadband lines used by rivals and its own customers  British lawmakers said on Tuesday.",
        "date": "07192016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Britain's BT given break-up warning over Openreach performance "
    },
    {
        "content": "* U.K.-based telecom BT Group rating raised to 'BBB+'; 'A-2' short-term rating affirmed; outlook stable",
        "date": "07052016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-S&P - U.K.-based telecom BT Group rating raised to 'BBB+'; 'A-2' short-term rating affirmed; outlook stable "
    },
    {
        "content": "* Combines EE's business division  parts of BT Global Services' UK corporate and public sector operations with BT business  to form business and public sector",
        "date": "06292016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-BT Group revises financials after internal reorganisation "
    },
    {
        "content": "** Tineke Frikkee  who runs Smith & Williamson's UK Equity Income Fund  bought more shares in Next and BT on Friday - perceived Brexit losers which both dived >10% that day",
        "date": "06282016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BUZZ-View from the buyside: S&W tops up on Next  BT post Brexit sell-off "
    },
    {
        "content": "FRANKFURT  June 24 Deutsche Telekom  said on Friday it did not expect a drop in the value of its 12-percent stake in peer BT following a British vote to leave the European Union to weigh on its earnings.",
        "date": "06242016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Deutsche Telekom sees no Brexit impact on BT holding "
    },
    {
        "content": "June 20 UK'S Competition and Markets Authority(CMA):",
        "date": "06202016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-UK's CMA publishes determination in broadband appeals involving BT and TalkTalk "
    },
    {
        "content": "* Higher target for superfast broadband  including fibre to home",
        "date": "05052016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 2-BT to invest 6 bln pounds on broadband and mobile upgrades "
    },
    {
        "content": "LONDON  May 5 Britain's top share index rose on Thursday as investors favoured telecom firm BT  insurer RSA and grocer WM Morrison after strong results.",
        "date": "05052016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Flurry of strong earnings boosts Britain's FTSE "
    },
    {
        "content": "* Cfo says need guidelines from the regulator to underpin investment",
        "date": "05052016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-BT says wants Ofcom assurances on fibre investment "
    },
    {
        "content": "LONDON  May 5 European stock markets rose on Thursday  buoyed by some solid corporate earnings at the likes of BT  and a rise in the shares of major oil companies.",
        "date": "05052016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "European stocks buoyed by BT and oil majors "
    },
    {
        "content": "LONDON  May 5 Britain's biggest broadband provider BT said it would spend 6 billion pounds on rolling out superfast fibre and 4G mobile connections in the next three years as it reported a better-than-expected 6 percent rise in full-year earnings.",
        "date": "05052016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT to invest 6 bln stg on fibre  4G upgrades "
    },
    {
        "content": "May 5 Britain's FTSE 100 index is seen opening up by 25 points  or 0.4 percent  on Thursday  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The UK blue chip index closed down 73.57 points  or 1.2 percent  at 6 112.02 points on Wednesday  as basic resources stocks extended the previous day's losses and retailers came under pressure.      * SABMILLER: Australia's antitrust regulator on Thursday cleared beer giant Anheus",
        "date": "05052016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UK Stocks-Factors to watch on May 5 "
    },
    {
        "content": "* BT Group Plc has renewed a significant 12 month contract for supply of an interactive  24/7 real time digital radio channel to employees",
        "date": "03242016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-Immedia says BT Group renews mobile streaming contract "
    },
    {
        "content": "LONDON  March 22 BT  the owner of Britain's biggest fixed-line network  must install business lines more quickly and significantly cut the prices it charges rivals to use them  the country's telecoms regulator said",
        "date": "03222016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 1-UK watchdog tells BT to speed up business line connections "
    },
    {
        "content": "** BT down as much as 2 pct at a 5-month low of 440p  bottom of Stoxx 600 telecoms index index",
        "date": "03222016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BUZZ-BT: hits 5-month low  Ofcom demands better services "
    },
    {
        "content": "* \u007fwill join company on 4 July and will replace BT's current finance director  Tony Chanmugam  following a handover period\u007f  Source text for Eikon:  Further company coverage:    (London newsroom)",
        "date": "03182016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-BT names former BG exec Lowth as finance director\u007f "
    },
    {
        "content": "BRUSSELS  March 7 - CK Hutchison Holdings Ltd said it had \"fruitful\" talks with EU regulators at a hearing on Monday aimed at dispelling antitrust concerns over its plan to become the top UK mobile operator by buying Telefonica's O2 unit.",
        "date": "03072016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Hutchison says EU antitrust talks on UK deal \"fruitful\" "
    },
    {
        "content": "LONDON BT will have to give rivals greater access to its infrastructure to help improve high speed broadband coverage and must meet tougher targets on fixing faults in order to avoid a break-up of the former monopoly group  industry watchdog Ofcom said on Thursday.",
        "date": "02252016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT spared break-up but told to open up network by regulator "
    },
    {
        "content": "BARCELONA  Feb 23 Britain's BT said it would increase investment in superfast broadband  including more fibre to the home  if regulator Ofcom decides against forcing a break-up of the company.",
        "date": "02232016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT ready to up network spend if regulator decides against split "
    },
    {
        "content": "* BT shares up 3 pct   (Adds further Ofcom  BT CEO comments  updates shares)",
        "date": "02252016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 3-BT spared break-up but told to open up network by regulator "
    },
    {
        "content": "LONDON  Feb 25 BT will have to open up more of its network to rivals and meet tougher targets on fixing faults  the regulator said  but it stopped short of recommending that Britain's biggest telecoms group should be split up.",
        "date": "02252016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Ofcom recommends overhauling BT rather than splitting it "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  February 04 (Fitch) Fitch Ratings has upgraded BT Group plc's (BT)  Long-term Issuer Default Rating (IDR) to 'BBB+' from 'BBB' following the closing  of the EE transaction. The Outlook is Stable. A full list of rating actions is  below.  The upgrade is in line with Fitch's previous guidance that the improved  diversification and operating profile achieved through the acquisition  and  enhanced cash flow scale  combined with the ",
        "date": "02042016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Fitch Upgrades BT to 'BBB+'; Outlook Stable "
    },
    {
        "content": "LONDON  Feb 2 Britain's BT Group said large numbers of its customers had lost connection to the Internet on Tuesday  but most were back online in a matter of hours and there were no indications that the failure was due to a malicious attack.",
        "date": "02022016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 1-Britain's BT suffers temporary network problems "
    },
    {
        "content": "LONDON  Feb 1 Britain's BT Group reported on Monday the best revenue growth in over seven years in the last three months of 2015  helped by a strong performance in its consumer broadband business  as it sets about incorporating newly acquired mobile network operator EE.",
        "date": "02012016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 2-BT sees 'best growth for seven years' ahead of EE takeover "
    },
    {
        "content": "* Says nearly every customer affected by network problem is now reconnected   Further company coverage:    (London newsroom)",
        "date": "02022016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-BT says most customers reconnected after network problem "
    },
    {
        "content": "** BT jumps as much as 3 pct after posting best revenue growth for seven years in its latest quarter",
        "date": "02012016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BUZZ-BT: jumps after strong numbers "
    },
    {
        "content": "* BT Group will remain in the FTSE 100 Index  with an increased shares in issue total of 9 962 010 468 and a decreased investability weighting of 84 pct\u007f\u007f  Source text for Eikon:  Further company coverage:",
        "date": "01292016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-FTSE says BT Group to remain in the FTSE 100 Index\u007f\u007f "
    },
    {
        "content": "LONDON  Feb 1 Britain'S BT Group said on Monday it would restructure its businesses to incorporate mobile operator EE  as it reported its best revenue growth for more than seven years in the third quarter.",
        "date": "02012016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT posts best growth for seven years  to restructure after EE deal "
    },
    {
        "content": "LONDON  Jan 29 BT Group completes the acquisition of the country's biggest mobile network operator EE on Friday  opening the way to creating a single integrated network offering a combination of telecoms and TV services that competitors are scrabbling to match.",
        "date": "01292016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "REFILE-BT completes EE takeover  leaving Openreach as the final hurdle "
    },
    {
        "content": "LONDON  Jan 23 Britain's BT should be forced to spin off its national broadband network to improve speeds and quality of service  an independent report backed by more than 100 lawmakers said on Saturday.",
        "date": "01232016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT should spin off network division  says lawmaker-backed report "
    },
    {
        "content": "* \u007fSays completes sale of its shares in mobile operator EE to BT\u007f",
        "date": "01292016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-Orange completes sale of its stake in EE to BT "
    },
    {
        "content": "* \u007fCFO Neal Milsom resigns as a director  ahead of successful purchase of EE by BT\u007f",
        "date": "01292016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-EE CFO Neal Milsom resigns as director as BT deal completes\u007f "
    },
    {
        "content": "LONDON BT Group won approval for its 12.5 billion pound ($18 billion) acquisition of mobile operator EE on Friday from British competition authorities which said it would not greatly   reduce competition in broadband  fixed and mobile markets.",
        "date": "01152016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT takeover of mobile firm EE cleared by UK competition body "
    },
    {
        "content": "* Rival TalkTalk disappointed by decision   (Adds BT detail on market share post-deal  updates shares)",
        "date": "01152016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 2-BT takeover of mobile firm EE cleared by UK competition body "
    },
    {
        "content": "* \u007fWelcomed competition and markets authority's decision to approve its acquisition of EE  unconditionally without remedies\u007f",
        "date": "01152016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-BT says EE deal to close on Jan. 29 "
    },
    {
        "content": "LONDON  Jan 15 British competition authorities cleared BT Group 's 12.5 billion pound acquisition of mobile operator EE on Friday  saying it would not substantially lesson competition in the broadband  fixed and mobile markets.",
        "date": "01152016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT takeover of mobile firm EE cleared by competition authorities  \u007f "
    },
    {
        "content": "* Selley  currently CEO of BT Technology  service and operations will replace Joe Garner",
        "date": "01112016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-BT names Clive Selley as CEO of network arm Openreach "
    },
    {
        "content": "LONDON  Jan 4 Britain's biggest mobile operator EE said its chief executive Olaf Swantee will step down when the company is absorbed by BT after a lengthy takeover process finalises this month.",
        "date": "01042016",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "EE's Olaf Swantee to leave after BT takeover completes "
    },
    {
        "content": "* \u007fOlaf Swantee will step down as CEO and executive director  once transaction has concluded\u007f\u007f",
        "date": "01042016",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-EE says CEO Olaf Swantee will step down after BT takeover "
    },
    {
        "content": "Dec 22 Britain's FTSE 100 index is seen opening up 26 points  or 0.4 percent  on Tuesday  according to financial bookmakers. For more on the factors affecting European stocks  please click on",
        "date": "12222015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UK Stocks-Factors to watch on Dec 22 "
    },
    {
        "content": "Dec 22 - The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "12222015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "PRESS DIGEST- British Business - Dec 22 "
    },
    {
        "content": "LONDON  Dec 8 The pension scheme of telecoms firm BT said it planned to pull an 8.4 billion pound ($12.58 billion) government bond investment mandate from its asset manager Hermes Investment Management  to save costs.",
        "date": "12082015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT pulls $13 bln bond mandate from Hermes "
    },
    {
        "content": "LONDON  Dec 7 Satellite group Avanti Communications won a contract with BT to help supply broadband services to British homes that have slow connections on terrestrial networks.",
        "date": "12072015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 1-Avanti to provide satellite broadband to remote areas of Britain "
    },
    {
        "content": "* Announces an intended ratio change to its NYSE- listed american depositary receipt (\"ADR\") programme",
        "date": "11202015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-BT Group announces intended ratio change to ADR programme "
    },
    {
        "content": "LONDON  Nov 16 British mortgage lender Nationwide named former HSBC banker Joe Garner as chief executive on Monday  as the customer-owned group looks to take advantage of restructuring among the big stock market-listed banks who are its main competition.",
        "date": "11162015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 2-UK's Nationwide hires BT Openreach boss as chief executive "
    },
    {
        "content": "Nov 16 Britain's biggest customer-owned lender Nationwide Building Society said it appointed BT Group  executive Joe Garner as chief executive.",
        "date": "11162015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UK's Nationwide hires BT executive as CEO "
    },
    {
        "content": "* Joe garner is to step down as ceo of openreach  Source text for Eikon:  Further company coverage:    (London newsroom)",
        "date": "11162015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-BT's Garner to step down as Openreach boss "
    },
    {
        "content": "LONDON  Nov 10 Vodafone took aim at Europe's former state telecoms companies like Deutsche Telekom  and BT on Tuesday  saying that unless regulators get tougher on giving their rivals better and cheaper access to their networks  new monopolies would emerge and customers would suffer.",
        "date": "11102015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Vodafone attacks Europe's former monopoly network operators "
    },
    {
        "content": "BRUSSELS  Oct 30 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10302015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "EU mergers and takeovers (Oct 30) "
    },
    {
        "content": "* Shares rise to three-month high   (Adds CEO comments  shares)",
        "date": "10292015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 2-BT edges forecasts after Champions League drives TV take up "
    },
    {
        "content": "LONDON Oct 28 UK shares rose on Wednesday  boosted by BT and British American Tobacco  although investors remained preoccupied by a U.S. decision on interest rates due later in the day.",
        "date": "10282015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Britain's FTSE led higher by BT and tobacco companies "
    },
    {
        "content": "* Ceo says confident plans for bt sport europe working as expected",
        "date": "10292015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-BT hails positive start for Champions League coverage "
    },
    {
        "content": "LONDON  Oct 28 Britain on Wednesday provisionally cleared BT's deal to buy mobile operator EE   in a 12.5 billion pound ($19 billion) tie-up that will create the country's leading player in broadband  fixed line and mobile.",
        "date": "10282015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 2-BT-EE merger wins provisional British regulator clearance "
    },
    {
        "content": "LONDON  Oct 29 Britain's BT  riding high after receiving the go-ahead to buy mobile operator EE on Wednesday  edged market expectations with a 2 percent rise in second-quarter revenue on an underlying basis  helped by new TV customers.",
        "date": "10292015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT revenue up 2 pct in record quarter for TV adds "
    },
    {
        "content": "LONDON  Oct 29 Britain's FTSE 100 index is seen opening down 7 points  or 0.1 percent lower on Thursday  according to financial bookmakers. For more on the factors affecting European stocks  please click on            * The blue-chip FTSE 100 index climbed 1.1 percent to 6 437.80 points  close to its highest level in two months on Wednesday  lifted by gains in gold mining companies' stocks  BT and GlaxoSmithKline  which rose after posting better-than-expected earnings.           * Th",
        "date": "10292015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UK Stocks-Factors to watch on Thursday Oct 29 "
    },
    {
        "content": "** BT jumps c. 4 pct after British competition regulator provisionally clears BT's deal to buy mobile operator EE",
        "date": "10282015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BUZZ-BT: jumps on provisional clearance for BT-EE deal "
    },
    {
        "content": "* Welcomes CMA decision to provisionally approve its 12.5 bln stg acquisition of EE  unconditionally without remedies  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom + 91 80 6749 1136)",
        "date": "10282015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-BT welcomes CMA approval for EE acquisition "
    },
    {
        "content": "LONDON  Oct 28 Britain on Wednesday provisionally cleared BT's deal to buy mobile operator EE   in a 12.5 billion pound ($19 billion)tie up that will create the country's leading player in broadband  fixed line and mobile.",
        "date": "10282015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "British competition regulator provisionally clears BT-EE deal "
    },
    {
        "content": "* Commences together with BT an extensive trial of G.fast ultra-broadband access technology in north-east England  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "10092015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-Alcatel-Lucent and BT commence G.fast ultra-broadband access technology trial "
    },
    {
        "content": "BRUSSELS  Oct 7 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10072015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "EU mergers and takeovers (Oct 7) "
    },
    {
        "content": "LONDON  Sept 22 Facing a sustained attack from rivals  Britain's BT pledged to improve the speed and quality of the country's broadband network on Tuesday in a bid to ward off calls for the dominant telecoms provider to be broken up.",
        "date": "09222015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Under fire from rivals  BT vows to improve broadband network "
    },
    {
        "content": "LONDON  Sept 22 Facing a sustained attack from rivals  Britain's BT pledged to improve the speed and quality of the country's broadband network on Tuesday in a bid to ward off calls for it  to be broken up.",
        "date": "09222015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 1-Under fire from rivals  BT vows to improve broadband network "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  September 09 (Fitch) Fitch Ratings has affirmed BT Group plc's (BT)  Long-term Issuer Default Rating (IDR) at 'BBB' with a Positive Outlook. A full  list of rating actions is below. BT's ratings take into account its solid incumbent telecom position in the  competitive but rational UK telecom market; its strong cash flow and  conservative leverage relative to European incumbent peers and the prospect of  an improved operating pr",
        "date": "09092015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Fitch Affirms BT at 'BBB'; Outlook Positive "
    },
    {
        "content": "A BT Group Plc  executive has called for the United States to require its telecommunications companies to allow access to their networks at regulated prices  similar to rules in place in the United Kingdom  the Financial Times reported on Sunday.",
        "date": "08232015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UK's BT accuses U.S. telecom rivals of hurting competition: FT "
    },
    {
        "content": "Aug 23 A BT Group Plc executive has called for the United States to require its telecommunications companies to allow access to their networks at regulated prices  similar to rules in place in the United Kingdom  the Financial Times reported on Sunday.",
        "date": "08232015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 1-UK's BT accuses U.S. telecom rivals of hurting competition -FT "
    },
    {
        "content": "Aug 23 BT Group Plc's Americas unit president has called on the United States to require that telecoms rivals allow access to their networks at regulated prices  the Financial Times reported Sunday.",
        "date": "08232015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "British telecoms giant BT accuses U.S. rivals of hurting competition - FT "
    },
    {
        "content": "* Mike Inglis is to join BT board as a non-executive director and a member of bt technology committee  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "08172015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-BT says Mike Inglis to join board as non-exec director "
    },
    {
        "content": "* Agreement brings hermes gpe's total private equity aum to 4 bln stg ($6 bln)  Source text for Eikon:",
        "date": "08102015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-Hermes GPE announces 1 bln stg mandate from BT pension scheme "
    },
    {
        "content": "LONDON  July 30 Britain's top share index edged slightly higher on Thursday  led by well-received corporate updates from several companies  including Royal Bank of Scotland and Rolls-Royce.",
        "date": "07302015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Britain's FTSE edges higher as robust earnings season rolls on "
    },
    {
        "content": "* Shares slip on Global Services weakness   (Adds share price slippage on Global Services concerns)",
        "date": "07302015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 2-BT on track for full year due to broadband  pay-TV demand "
    },
    {
        "content": "LONDON  July 30 BT Group posted first-quarter revenue and core earnings in line with forecasts on Thursday and said it was on track to meet full-year expectations due to solid demand for broadband and its new Champions League pay-TV offering.",
        "date": "07302015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT on track for full year due to broadband  pay-TV demand "
    },
    {
        "content": "LONDON  July 24 European shares turned higher on Friday as investors chewed over mixed earnings updates  getting support from well-received updates from Vodafone and Thales",
        "date": "07242015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "European shares turn higher  led by Vodafone  Thales "
    },
    {
        "content": "LONDON  July 15 British payments processing firm Worldpay said Michael Rake  currently chairman of BT Group  and deputy chairman of Barclays  will become its new chairman on September 1.",
        "date": "07152015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Worldpay says Rake will become chairman in September "
    },
    {
        "content": "LONDON  July 15 Barclays' deputy chairman Michael Rake is expected to step down this year and become chairman of payments processing firm Worldpay  two sources familiar with the matter said on Wednesday.",
        "date": "07152015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Barclays deputy chairman set to leave to chair Worldpay -sources "
    },
    {
        "content": "LONDON Britain's telecoms regulator is seriously considering a break up of dominant provider BT  after rivals accused it of abusing its market position and failing to invest in the broadband networks they rely on.",
        "date": "07162015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT could be broken up to improve Britain's broadband networks "
    },
    {
        "content": "* BT shares flat   (Adds Ofcom chief executive comments  further reaction)",
        "date": "07162015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 3-BT could be broken up to improve Britain's broadband networks "
    },
    {
        "content": "LONDON  July 16 The British telecoms regulator said BT could be made to spin off its networks unit  which wholesales capacity to rivals like Sky and TalkTalk  to boost competition in the broadband market for consumers and businesses.",
        "date": "07162015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UK regulator to examine separation of BT network unit "
    },
    {
        "content": "LONDON  June 29 Sky has called for a competition inquiry into Britain's broadband market where it says BT  the market leader whose network it relies on  has an effective monopoly.",
        "date": "06292015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "RPT-Sky calls for competition inquiry into UK broadband market "
    },
    {
        "content": "LONDON  June 29 Sky has called for a competition inquiry into Britain's broadband market where it says BT  the market leader whose network it relies on  has an effective monopoly.",
        "date": "06292015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Sky calls for competition inquiry into UK broadband market "
    },
    {
        "content": "* Ericsson : BT Sport selects Ericsson to launch UK's first UHDTV channel",
        "date": "06232015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-Ericsson wins order from BT Sport "
    },
    {
        "content": "* Is or may be case that anticipated acquisition by BT Group of EE Ltd may be expected to result in lessening of competition within a market or markets in UK  Source text (http://bit.ly/1FNT22H) Further company coverage:    (Bengaluru Newsroom; +44 207 542 1810)",
        "date": "06092015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-CMA says BT Group's acquisition of EE may reduce competition "
    },
    {
        "content": "LONDON  June 12 Britain's telecoms regulator Ofcom has proposed controlling the prices BT can charge for some of its high-speed business lines  following up on a review which recognised the former state monopoly's \"significant\" market power.",
        "date": "06122015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 1-Watchdog proposes price controls for BT's high-speed business lines "
    },
    {
        "content": "LONDON  June 12 Britain's telecoms regulator Ofcom proposed controlling the prices BT can charge for some of its high-speed business lines  following up on a review which recognised the former state monopoly's \"significant\" market power.",
        "date": "06122015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Watchdog proposes price controls for BT's high-speed business lines "
    },
    {
        "content": "* Controls on wholesale prices BT charges for products using leased telecoms lines",
        "date": "06122015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-UK telecom regulator proposes lower prices for high-speed business lines "
    },
    {
        "content": "May 27 BT Group PLC :  * British telecom plc - transaction in own shares  * Commencement of a non-discretionary programme to purchase up to £160 million",
        "date": "05272015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-British Telecom commences 160 mln stg share buyback programme "
    },
    {
        "content": "* Ceo Colao says combined BT and EE company should release spectrum  end sharing deal with 3   Further company coverage:",
        "date": "05192015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-Vodafone's Colao says BT and EE should release spectrum "
    },
    {
        "content": "LONDON  May 18 BT  seeking regulatory approvals for its 12.5 billion-pound ($20 billion) deal to acquire UK mobile network operator EE from Orange and Deutsche Telekom  has asked the British competition authorities to move straight to a full investigation  avoiding a preliminary review.",
        "date": "05182015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT seeks speedier UK competition probe into EE acquisition "
    },
    {
        "content": "* Made its formal submission to UK's competition and markets authority  seeking approval for proposed acquisition of EE",
        "date": "05182015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-BT asks CMA to proceed to phase 2 probe into proposed acquisition of EE "
    },
    {
        "content": "* Emirates chooses BT for global contact centre virtualisation",
        "date": "05182015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-Emirates and BT Group sign 6 year deal for global contact centre managed services "
    },
    {
        "content": "* Rivals say will increase competition  innovation   (Adds BT  TalkTalk comments  shares)",
        "date": "05152015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 1-UK telecom regulator wants to open up BT's business fibre network "
    },
    {
        "content": "* Is proposing a new requirement on BT - largest supplier in market  upon whose network many competitors' services rely - to supply 'dark fibre' in areas outside central london",
        "date": "05152015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-Ofcom proposes to open BT fibre for business lines "
    },
    {
        "content": "LONDON BT Group  said it was confident it could retain its edge  over rivals Sky  and Virgin  in the broadband market when it starts charging customers to watch European Champions League soccer this year.",
        "date": "05072015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT hails customer growth before Champions League debut "
    },
    {
        "content": "* Earnings come in just ahead of forecast   (Adds CEO comments  shares)",
        "date": "05072015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 2-BT hails customer growth before Champions League debut "
    },
    {
        "content": "LONDON  May 7 BT Group posted a better than expected 3 percent rise in full-year earnings and raised its outlook for free cash flow after a strong finish to the year  when it connected a record 455 000 fibre broadband customers.",
        "date": "05072015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT full-year earnings beat forecasts helped by fibre broadband "
    },
    {
        "content": "* Best ever quarter for openreach fibre broadband net connections of 455 000  up 31%",
        "date": "05072015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-BT Group raises free cash flow outlook after strong year-end "
    },
    {
        "content": "* Warren will be stepping down as a BT non-executive director on May 31 2015.  Source text for Eikon:  Further company coverage:",
        "date": "04222015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-BT Group says Warren East to step down from board "
    },
    {
        "content": "* Appointment follows decision of marketing and brand director  Suzi Williams to leave business in September",
        "date": "04142015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-BT Group appoints Zaid al-Qassab as chief brand officer "
    },
    {
        "content": "* Phil Hodkinson will step down from BT board on 31 January 2016 by which point he will have served for ten years as a non-executive director  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +44 207 542 1810)",
        "date": "04012015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-BT Group says non-exec director Hodkinson to step down in 2016 "
    },
    {
        "content": "LONDON  March 25 BT took a first step back into the consumer mobile market on Wednesday while it awaits a decision from regulators on its deal to buy EE  the country's biggest mobile operator.",
        "date": "03252015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 1-BT dips toe back into Britain's consumer mobile market "
    },
    {
        "content": "LONDON  March 25 BT took a first step back into the consumer mobile market on Wednesday while it awaits a decision from regulators on its deal to buy EE  the country's biggest mobile operator.",
        "date": "03252015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "REFILE-BT dips toe back into Britain's consumer mobile market "
    },
    {
        "content": "* Fined BT £800 000 for failing to provide an improved text-to-voice service for its customers with hearing or speech impairments between April and September last year",
        "date": "03172015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-UK telecoms regulator fines BT over text relay "
    },
    {
        "content": "LONDON Broadband providers Sky and TalkTalk have called on Britain's telecoms regulator to break up BT  the market leader whose network they rely on  in the biggest review of the sector for a decade.",
        "date": "03122015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Rivals call for BT break-up in review of UK telecoms sector "
    },
    {
        "content": "LONDON  March 12 Broadband providers Sky  and TalkTalk have called on Britain's telecoms regulator to break up BT  the market leader whose network they rely on  in the biggest review of the sector for a decade.",
        "date": "03122015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 2-Rivals call for BT break-up in review of UK telecoms sector "
    },
    {
        "content": "LONDON  Feb 19 The European Commission has criticised British regulator Ofcom's plan to monitor the price the country's main telecoms operator BT Group Plc charges rivals to access its superfast fibre network.",
        "date": "02192015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 1-Brussels criticises British plan to regulate BT fibre network "
    },
    {
        "content": "LONDON  Feb 19 The European Commission has criticised British regulator Ofcom's plan to monitor the price the country's dominant telecoms operator BT Group Plc  charges rivals to access its superfast fibre network.",
        "date": "02192015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Brussels criticises British plan to regulate BT fibre network "
    },
    {
        "content": "* BT Sport to show 42 live top-flight Saturday and midweek matches for 2016/17 to 2018/19 seasons",
        "date": "02102015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BRIEF-BT Sport secures media rights for 42 Premier League matches through 2019 "
    },
    {
        "content": "LONDON  Feb 11 Britain's top equity index fell for a fourth straight session on Wednesday  with commodity shares losing ground after crude oil prices dropped and copper prices trimmed gains.",
        "date": "02112015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "FTSE ends lower on weaker commodity stocks  led down by Tullow "
    },
    {
        "content": "* Sky to cut costs  increase some customer prices   (Adds background)",
        "date": "02112015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 3-Sky shares fall as market weighs English soccer rights gamble "
    },
    {
        "content": "LONDON  Feb 11 Britain's top equity index fell for a fourth straight session on Wednesday  with commodity shares losing ground after crude oil prices dropped and copper prices trimmed gains.",
        "date": "02112015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "FTSE falls  led down by Tullow  as commodity stocks weaken "
    },
    {
        "content": "LONDON  Feb 11 Sky led Britain's top share index lower on Wednesday after paying a record sum to secure TV rights for top English soccer games and fierce rival BT  which pushed Sky into paying a premium for the content  rose 4 percent.",
        "date": "02112015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Sky leads FTSE down after costly TV soccer rights auction  BT gains "
    },
    {
        "content": "* Will add 4 million premises to British network   (Adds further analyst reaction  updates shares)",
        "date": "02132015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 1-Virgin Media shakes up UK fixed-line market with expansion plan "
    },
    {
        "content": "* Adds Expedia  Valeant  Enel  Sumitomo Mitsui  Centrica  BT  Fininvest",
        "date": "02122015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON British cable operator Virgin Media plans to invest 3 billion pounds ($4.6 billion) to increase the reach of its fiber network to 17 million homes from the current 13 million  posing a fresh challenge to rival providers BT and Sky.",
        "date": "02132015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Virgin Media to spend 3 billion pounds to build out UK network "
    },
    {
        "content": "LONDON  Feb 12 Britain's BT raised around 1 billion pounds through a placing on Thursday of shares at 455 pence to help fund its 12.5 billion pound ($19 billion) acquisition of mobile operator EE.",
        "date": "02122015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 1-BT raises around 1 billion stg to fund EE deal "
    },
    {
        "content": "* A total of 222 000 223 new ordinary shares of five pence each in company have been placed",
        "date": "02122015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-BT raises about 1 bln stg via placing to fund EE deal "
    },
    {
        "content": "LONDON  Feb 13 British cable operator Virgin Media plans to invest 3 billion pounds ($4.6 billion) to increase the reach of its fibre network to 17 million homes from the current 13 million  posing a fresh challenge to rival providers BT and Sky.",
        "date": "02132015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Virgin Media to spend 3 bln stg to build out UK network "
    },
    {
        "content": "LONDON  Feb 12 BT kicked off its 1 billion pound placing on Thursday  saying it would launch an underwritten accelerated bookbuilding process immediately to fund its 12.5 billion pound ($19 billion) acquisition of mobile operator EE.",
        "date": "02122015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT launches 1 billion pound placing to fund EE deal "
    },
    {
        "content": "Feb 4 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Wednesday:",
        "date": "02042015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON BT  has reached agreement with Orange  and Deutsche Telekom ‎ to buy their UK mobile network operator EE and a deal could be announced as early as Thursday morning  a person familiar with the situation said.",
        "date": "02042015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT finalizes deal to buy EE: source "
    },
    {
        "content": "Feb 5 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Thursday:",
        "date": "02052015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON  Feb 4 BT has reached agreement with Orange and Deutsche Telekom \u007f to buy their UK mobile network operator EE and a deal could be announced as early as Thursday morning  a person familiar with the situation said.",
        "date": "02042015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 1-BT finalises deal to buy EE  -source "
    },
    {
        "content": "LONDON BT finalised a deal on Thursday to buy mobile operator EE for 12.5 billion pounds ($19 billion) and now faces a contested approval process to seal its status as Britain's dominant communications company.",
        "date": "02052015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BT seals EE deal to dominate British telecoms market "
    },
    {
        "content": "LONDON  Feb 5 Britain's top share index ended slightly higher on Thursday  recovering from earlier losses  as a late rally in crude oil prices boosted energy stocks and telecom firm BT Group advanced after its strategic acquisition of mobile operator EE.",
        "date": "02052015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Energy shares help FTSE to end slightly higher after losses "
    },
    {
        "content": "* Shares up 4.6 percent to 14-year high   (Adds EE  DT comments  advisers  updates shares)",
        "date": "02052015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 3-BT seals EE deal to dominate British telecoms market "
    },
    {
        "content": "LONDON  Feb 5 Britain's top share index fell on Thursday after a drop in mining stocks on the back of weaker metals prices  although losses were limited by a rally in telecom firm BT Group after its strategic acquisition.",
        "date": "02052015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Miners push FTSE lower  BT gains on strategic acquisition "
    },
    {
        "content": "LONDON  Feb 5 Britain's top share index fell on Thursday following a drop in mining stocks on the back of weaker metals prices  although losses were limited by a rally in telecom firm BT Group after its strategic acquisition.",
        "date": "02052015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Mining stocks drag down FTSE  BT gains on strategic acquisition "
    },
    {
        "content": "LONDON  Jan 30 Britain's top share index posted its strongest monthly performance in almost a year in January  although a fall in BT pushed the market lower on Friday.",
        "date": "01302015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "Britain's FTSE closes lower  still posts best month in nearly a year "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  February 05 (Fitch) Fitch Ratings has affirmed BT Group plc's (BT)  Long-term Issuer Default Rating (IDR) at 'BBB' with a Positive Outlook. A full  list of rating actions is below. The affirmation follows the company's announcement of the agreed terms of its  acquisition of UK mobile network operator (MNO)  EE. The transaction has an  enterprise value of GBP12.5bn made up of 16% of the equity of the enlarged BT  group (valued at",
        "date": "02052015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Fitch Affirms BT Group at 'BBB'/Positive on EE Announcement "
    },
    {
        "content": "* New powers for industry watchdog impacts supermarket shares",
        "date": "01302015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Britain's FTSE slips but set for best month in nearly a year "
    },
    {
        "content": "* FTSE 100 down 0.6 pct     * BT rises after confirming deal for EE     * Energy sector falls after renewed slump in oil     * Mixed results see AstraZeneca miss expectations      By Alistair Smout     LONDON  Feb 5 Britain's top share index fell on Thursday  dragged down by an oil-price-related slump in commodity stocks but outperforming most European markets as a strategic acquisition boosted telecom firm BT Group.     BT rose 4.5 percent to a 14-year high after saying it agreed a ",
        "date": "02052015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Britain's FTSE falls but outpaces most of euro zone  BT boosted by EE deal "
    },
    {
        "content": "LONDON  Jan 30 Britain's top share index looked set to post its strongest monthly performance in almost a year on Friday  consolidating near four-month highs  although a fall in BT put pressure on the market despite a recovery in mining shares.",
        "date": "01302015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Britain's FTSE set for best month in nearly a year "
    },
    {
        "content": "* Third quarter results in line with forecasts   (Adds reaction)",
        "date": "01302015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UPDATE 2-BT to upgrade fibre network in latest stage of transformation "
    },
    {
        "content": "* BT deal recreates dominant player in Britain  requires scrutiny",
        "date": "02052015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "BRIEF-Vodafone CEO urges close scrutiny of BT deal "
    },
    {
        "content": "* FTSE 100 ends up 0.5 pct; biggest weekly rise since late 2011",
        "date": "01232015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "FTSE records best week in three years; ABF leads "
    },
    {
        "content": "* FTSE 100 up 0.4 pct; eyes biggest wkly rise since late 2011",
        "date": "01232015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "FTSE heads for best week in three years; ABF leads "
    },
    {
        "content": "* FTSE 100 up 0.3 pct; eyes biggest weekly rise since late 2011",
        "date": "01232015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "FTSE on track for best week in three years; telecoms gain "
    },
    {
        "content": "FRANKFURT Talks between BT and the owners of EE about the potential acquisition of the UK mobile operator are progressing well as due diligence so far has not revealed any surprises  German Manager Magazine reported on Wednesday.",
        "date": "01212015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "BT found no surprises in EE books: Manager Magazin "
    },
    {
        "content": "* FTSE 100 up 0.6 pct; eyes biggest weekly rise since Nov '11",
        "date": "01232015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "UK FTSE eyes best weekly rise in over 3 yrs as M&A boosts telcos "
    },
    {
        "content": "LONDON  Jan 15 BT's ability to bid aggressively in the upcoming Premier League soccer rights auction could be limited by a plan from regulator Ofcom to monitor the price it charges rivals to access its key superfast fibre network.",
        "date": "01152015",
        "name": "BT Group plc",
        "news_type": "topStory",
        "symbol": "BT",
        "title": "UPDATE 1-British regulator says BT must not squeeze rivals in broadband "
    },
    {
        "content": "PARIS  Jan 13 French telecoms group Orange hopes to close a deal to sell its stake in UK mobile operator EE to British telecoms group BT quite soon and will look at further consolidation of the French telecoms market along with other opportunities once the deal is done  its boss said on Tuesday.",
        "date": "01132015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "Orange looks again to French telco consolidation after EE sale "
    },
    {
        "content": "LONDON  Jan 15 British regulator Ofcom has said it would set up a safeguard to make sure BT maintains a sufficient margin between its wholesale and retail superfast broadband charges to allow rival providers to profitably match its prices.",
        "date": "01152015",
        "name": "BT Group plc",
        "news_type": "normal",
        "symbol": "BT",
        "title": "British regulator says BT must not squeeze rivals in broadband "
    }
]