[
    {
        "content": "-- Note: Reuters has not verified this story and does not vouch for its accuracy.",
        "date": "11062017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "MEDIA-British American Tobacco quits Philippine business - Manila Bulletin "
    },
    {
        "content": "LONDON British American Tobacco  forecast revenue from its \"next generation products\" to double to more than 1 billion pounds next year as it sells vapour devices in more markets. | Video ",
        "date": "10252017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BAT targets doubling in vapour products revenue in 2018 "
    },
    {
        "content": "* BAT shares up 2 pct at 4923 pence at 0940 GMT (Adds details on UK parliamentary inquiry)",
        "date": "10252017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UPDATE 2-BAT targets doubling in vapour products revenue in 2018 "
    },
    {
        "content": "LONDON  Oct 25 British American Tobacco   the world's biggest international tobacco company  expects its \"next generation products\" to generate revenue of over 1 billion pounds ($1.3 billion) next year  doubling from more than 500 million this year.",
        "date": "10252017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "British American Tobacco sees next-generation products doubling in 2018 "
    },
    {
        "content": "* Lionel L. Nowell III  Holly Keller Koeppel  Luc Jobin have been appointed to committees of board with effect from 2 Oct Source text for Eikon: Further company coverage:",
        "date": "10032017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-British American Tobacco announces ‍board committee appointments ​ "
    },
    {
        "content": "LONDON  Sept 26 The UK's top share index fell for a second day on Tuesday  although a rise in oil prices lifted energy stocks and a broker upgrade gave support to British American Tobacco.",
        "date": "09262017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "UPDATE 1-Oil stocks  BAT stem financials-driven losses on FTSE 100 "
    },
    {
        "content": "British American Tobacco  has reorganized its regional management structure to integrate its vaping products with its core business  in a push by the world’s biggest listed tobacco company to help cigarette alternatives go mainstream.",
        "date": "08312017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BAT restructures to help e-cigarettes go mainstream "
    },
    {
        "content": "* Reorganizes to help integrate vaping products with core business",
        "date": "08312017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UPDATE 2-BAT restructures to help e-cigarettes go mainstream "
    },
    {
        "content": "Aug 31 British American Tobacco said on Thursday it has reorganized its regional management structure to integrate the next generation products (NGP) business following the completion of the Reynolds American Inc acquisition.",
        "date": "08312017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BAT changes regional management structure after Reynolds deal "
    },
    {
        "content": "* TO SIMPLIFY REGIONAL STRUCTURE AND TO FULLY INTEGRATE OUR NEXT GENERATION PRODUCTS BUSINESS INTO CORE OPERATIONS OF GROUP",
        "date": "08312017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BRIEF-British American Tobacco re-jigs regional management structure "
    },
    {
        "content": "* NOTIFIED OF UNSOLICITED 'MINI-TENDER' OFFER BY TRC CAPITAL TO BUY UP TO 2 MILLION ADS OF BAT AT A PRICE OF $60.13 PER ADS IN CASH",
        "date": "08172017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-British American Tobacco recommends stockholders reject mini-tender offer by TRC Capital Corp "
    },
    {
        "content": "LONDON  Aug 8 Investors are betting on a little-known biotech company to supply Big Tobacco with low-nicotine cigarettes  but so far its technology is unproven.",
        "date": "08082017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "RPT-Tiny biotech firm offers Big Tobacco model to curb its nicotine habit "
    },
    {
        "content": "* B.A.T CAPITAL CORP SAID IT SUCCESSFULLY PRICED US DOLLAR DENOMINATED ISSUE OF NOTES  RAISING PROCEEDS OF ABOUT $17.25 BILLION Source text for Eikon: Further company coverage:",
        "date": "08102017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-B.A.T CAPITAL says raised proceeds of about $17.25 bln "
    },
    {
        "content": "LONDON  Aug 9 (IFR) - British American Tobacco has set final terms for a multi-tranche euro and sterling bond issue as it continues its funding spree to finance its US$49bn purchase of Reynolds American  according to lead managers.",
        "date": "08092017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BAT sets final terms for multi-tranche euro and sterling bond "
    },
    {
        "content": "LONDON  Aug 9 (IFR) - British American Tobacco has set guidance for a multi-tranche euro and sterling bond issue as it continues its funding spree to finance its US$49bn purchase of Reynolds American  acccording to lead managers.",
        "date": "08092017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BAT sets guidance for multi-tranche euro and sterling bond "
    },
    {
        "content": "LONDON  Aug 9 (IFR) - British American Tobacco opened books on a four-part euro and sterling-denominated bond on Wednesday in a bid to complete its financing for the US$49bn purchase of Reynolds American.",
        "date": "08092017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UPDATE 1-BAT begins marketing M&A bond "
    },
    {
        "content": "LONDON  Aug 9 (IFR) - British American Tobacco has started marketing a multi-tranche euro and sterling bond issue as it continues its funding spree to finance its US$49bn purchase of Reynolds American.",
        "date": "08092017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BAT begins marketing multi-tranche euro and sterling bond "
    },
    {
        "content": "(The following statement was released by the rating agency) MILAN/CHICAGO  August 04 (Fitch) Fitch Ratings has downgraded British American Tobacco plc's (BAT) Long-Term Issuer Default Rating (IDR) to 'BBB' from 'A-' and removed it from Rating Watch Negative. The Outlook is Stable. The agency has also affirmed Reynolds American Inc's (RAI) IDR at 'BBB' and withdrawn the rating. A full list of rating actions is shown at the end of this commentary. The downgrade follows the completion of the merger",
        "date": "08042017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "Fitch Downgrades British American Tobacco to 'BBB'; Withdraws Reynolds American "
    },
    {
        "content": "LONDON  July 31 Strong results from heavyweight bank HSBC helped drive British blue-chips higher on Monday as the index headed for a monthly gain on the last trading day of July  though tobacco stocks tumbled further following a new U.S. regulatory clampdown.",
        "date": "07312017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "HSBC  miners drive FTSE higher  but cigarette makers drag "
    },
    {
        "content": "JOHANNESBURG  Aug 3 South Africa's rand slipped to three-week lows against the dollar on Thursday  erasing most of the previous session's gains in a cautious market as a vote on a motion of no-confidence against President Jacob Zuma drew closer.",
        "date": "08032017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "UPDATE 1-South Africa's rand falls to 3-week low  stocks hit new high "
    },
    {
        "content": "LONDON  Aug 4 (IFR) - Investors will try to exert pricing pressure on British American Tobacco next week when it seeks to raise an expected US$25bn-equivalent of bonds in the US and European markets in the middle of corruption probes and tobacco sector turmoil.",
        "date": "08042017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UPDATE 2-BAT to face further scrutiny for jumbo M&A bond sale "
    },
    {
        "content": "LONDON Britain has opened a formal investigation into suspicions of corruption at British American Tobacco (BAT)  and its subsidiaries  nearly two years after allegations of bribery in Africa first surfaced.",
        "date": "08012017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "Britain investigates British American Tobacco for corruption "
    },
    {
        "content": "LONDON  Aug 4 (IFR) - British American Tobacco will hold investor calls for a potential multi-tranche US dollar  euro-denominated and/or sterling-denominated senior unsecured transaction from Monday August 7.",
        "date": "08042017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BAT hires for multi-currency  multi-tranche bond deal "
    },
    {
        "content": "LONDON  Aug 1 (IFR) - British American Tobacco's plans for a jumbo multi-currency debt sale  expected this week  have likely been scuppered after the company suffered a fresh blow of corruption allegations on Tuesday.",
        "date": "08012017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BAT delivered fresh blow to scupper bond plans "
    },
    {
        "content": "* BBC reported bribery allegations in Africa in November 2015",
        "date": "08012017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UPDATE 2-Britain investigates British American Tobacco for corruption "
    },
    {
        "content": "Aug 1 British American Tobacco said on Tuesday that Britain's Serious Fraud Office has opened a formal investigation into possible historic misconduct by the company in Africa.",
        "date": "08012017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "Britain's SFO opens investigation into BATS in Africa "
    },
    {
        "content": "* BAT COMPLETES ACQUISITION OF REYNOLDS Source text for Eikon: Further company coverage:",
        "date": "07252017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-BAT completes $49 billion Reynolds acquisition "
    },
    {
        "content": "* HAS BEEN INFORMED THAT SFO HAS NOW OPENED A FORMAL INVESTIGATION",
        "date": "08012017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BRIEF-British American Tobacco says informed of investigation into misconduct allegations "
    },
    {
        "content": "LONDON  July 28 British American Tobacco said on Friday it was not surprised by the U.S. Food and Drug Administration's announcement that it plans to reduce nicotine levels in cigarettes.",
        "date": "07282017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "British American Tobacco not surprised by FDA move to cut nicotine "
    },
    {
        "content": "* Interview-British american tobacco ceo says glo tobacco heating device has 3 percent market share in tokyo after 3 wks",
        "date": "07272017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-BAT CEO says to focus on Reynolds integration  not consolidation "
    },
    {
        "content": "July 27 Britain's FTSE 100 futures were up 0.3 percent ahead of the cash market open.",
        "date": "07272017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UPDATE 1-UK Stocks-Factors to watch on July 27 "
    },
    {
        "content": "LONDON  July 27 British American Tobacco reported higher first-half sales and profits on Thursday  helped by the weak British currency  but also saw declining volume as people continue to smoke less.",
        "date": "07272017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "British American Tobacco first-half results helped by weak pound "
    },
    {
        "content": "* Lionel L. Nowell  Holly Keller Koeppel  Luc Jobin will join as independent non-executive director",
        "date": "07212017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-BATS to add three non-exec directors to board after Reynolds deal closure "
    },
    {
        "content": "* Proposed acquisition of Reynolds American Inc Approved by BAT shareholders‍​",
        "date": "07192017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-British American Tobacco shareholders approve acquisition of Reynolds American "
    },
    {
        "content": "LONDON  July 14 Veteran UK investor Neil Woodford's 10 billion pound ($12.97 billion) equity income fund has sold its stake in British American Tobacco after strong performance  although it has kept its stake in Imperial Brands  the fund said.",
        "date": "07142017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "Woodford equity income fund sells BAT stake  keeps Imperial Brands "
    },
    {
        "content": "LONDON  July 7 (IFR) - British American Tobacco is expected to hit the market in the coming weeks to help fund the US$49bn acquisition of Reynolds in what could be one of the biggest-ever corporate deals in Europe.",
        "date": "07072017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "Market receives smoke signals for BAT jumbo bond "
    },
    {
        "content": "* Reynolds American says ‍on June 8  2017  RAI  BAT  Batus and Merger Sub entered into amendment to agreement and plan of merger - SEC filing​",
        "date": "06082017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-Reynolds American  BAT  Batus and Merger Sub enters into an amendment "
    },
    {
        "content": "* Publication of circular and prospectus in connection with proposed acquisition of reynolds american inc.",
        "date": "06142017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-BAT sees Reynolds deal closing next month after general meeting "
    },
    {
        "content": "NEW YORK  June 14 An investment company is planning to offer a novel kind of fund that would offer U.S. investors direct access to foreign stocks  while tamping down the risk of currency declines  regulatory filings showed on Wednesday.",
        "date": "06152017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "New U.S. funds would mimic ADRs but cut currency risk -filing "
    },
    {
        "content": "TOKYO British American Tobacco will expand sales of its \"glo\" tobacco-heating device to Tokyo and Osaka from July and roll it out nationwide by year-end  intensifying a battle with Philip Morris International for a share of Japan's vaping market.",
        "date": "05302017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "British American Tobacco to expand 'glo' smokeless tobacco sales in Japan from July "
    },
    {
        "content": "TOKYO  May 30 British American Tobacco will expand sales of its \"glo\" tobacco-heating device to Tokyo and Osaka from July and roll it out nationwide by year-end  intensifying a battle with Philip Morris International for a share of Japan's vaping market.",
        "date": "05302017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "British American Tobacco to expand \"glo\" smokeless tobacco sales in Japan from July "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON/MILAN  April 26 (Fitch) Fitch Ratings has maintained British American Tobacco plc's (BAT) Long-Term Issuer Default Rating (IDR) and senior unsecured ratings of 'A-' as well as its Short-Term IDR of 'F2' on Rating Watch Negative (RWN). A full list of rating actions is shown at the end of this commentary The ratings remain on RWN pending the completion of the agreed proposal by BAT's board to merge with its 42% owned associate Reyn",
        "date": "04262017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "Fitch Maintains British American Tobacco on Rating Watch Negative "
    },
    {
        "content": "SOFIA  April 12 British American Tobacco (BAT) said on Wednesday it had agreed with Bulgarian cigarette maker Bulgartabac to acquire some of its leading cigarette brands in a deal worth more than 100 million euros ($106 million).",
        "date": "04122017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BAT buys cigarette brands from Bulgaria's Bulgartabac "
    },
    {
        "content": "* 2016 adjusted profit from operations up 10 pct   (Adds details from media briefing)",
        "date": "02232017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "UPDATE 3-BAT looks to double its vaping markets "
    },
    {
        "content": "Feb 23 British American Tobacco  the second-largest international tobacco company  reported a slight increase in full-year cigarette and tobacco sales volumes on Thursday.",
        "date": "02232017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BAT reports slight increase in full-year sales volume "
    },
    {
        "content": "* Preliminary announcement for the year ended 31 December 2016",
        "date": "02232017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BRIEF-BAT full-year revenue rises "
    },
    {
        "content": "SARAJEVO  Jan 26 British American Tobacco (BAT)  has reached a principle agreement to acquire the tobacco assets of Bosnian holding firm Fabrika Duhana Sarajevo (FDS) from an Austrian fund  the two companies said in a joint statement on Thursday.",
        "date": "01262017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BAT agrees purchase of Bosnian FDS tobacco business from Austrian fund "
    },
    {
        "content": "LONDON British American Tobacco  has agreed a $49.4 billion takeover of U.S. rival Reynolds American Inc   creating the world's biggest listed tobacco company after it increased an earlier offer by more than $2 billion. | Video ",
        "date": "01172017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BAT agrees to buy Reynolds for $49 billion "
    },
    {
        "content": "* Deal brings together makers of Pall Mall  Camel  Newport   (Adds analyst and CEO comments)",
        "date": "01172017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UPDATE 5-BAT agrees to buy Reynolds for $49 billion "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  January 17 (Fitch) The increased price and cash component of British  American Tobacco's (BAT) revised deal to acquire full control of Reynolds  American will result in higher leverage than under the original proposal  Fitch  Ratings says. It also means a two-notch downgrade is the most likely outcome for  BAT's 'A-' IDR  which was placed on Rating Watch Negative following the first  approach in October. We said at the time that",
        "date": "01172017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "Fitch: Higher Reynolds Bid Points to Two-Notch Downgrade for BAT "
    },
    {
        "content": "* Agreed terms of a recommended offer for BAT to acquire remaining 57.8 pct of Reynolds it does not already own  Source text for Eikon:  For full story  click on:  Further company coverage:    (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "01172017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BRIEF-BAT agrees terms to buy remaining stake in Reynolds "
    },
    {
        "content": "LONDON  Jan 17 British American Tobacco  said on Tuesday it had agreed terms to buy U.S. rival Reynolds American Inc after it increased its offer for the 57.8 percent of the company it did not already own to $49.4 billion.",
        "date": "01172017",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BAT agrees terms to buy Reynolds for $49.4 billion "
    },
    {
        "content": "LONDON British American Tobacco (BAT)  has quit plans to market a nicotine inhaler called Voke to focus on consumer items like e-cigarettes rather than health products.",
        "date": "01052017",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BAT quits nicotine inhaler to focus on vaping "
    },
    {
        "content": "SARAJEVO An Austrian fund backed by British American Tobacco  agreed to increase its stake in Bosnian holding firm Fabrika Duhana Sarajevo (FDS)  to 78.8 percent  paving the way for BAT to acquire FDS's tobacco assets.",
        "date": "12212016",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BAT nears takeover of Bosnian FDS tobacco business "
    },
    {
        "content": "LONDON  Nov 17 Leading British investor Neil Woodford's fund firm said on Thursday it backed a takeover of Reynolds American by British American Tobacco  calling the tie-up \"inevitable\".",
        "date": "11172016",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "Top British American Tobacco investor Woodford says backs Reynolds deal "
    },
    {
        "content": "Nov 14 U.S. cigarette maker Reynolds American Inc is seeking a higher price from British American Tobacco Plc after rejecting its $47 billion takeover offer  a source familiar with the situation told Reuters.",
        "date": "11142016",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "UPDATE 2-Reynolds American rejects BAT's $47 bln takeover offer - source "
    },
    {
        "content": "BUCHAREST  Nov 15 British American Tobacco Plc (BAT) plans to expand output at its Ploiesti factory in Romania by 20 percent in 2017 after a German facility closure and to invest 1.0 billion euros over the next five years.",
        "date": "11152016",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "British American Tobacco expands Romanian production "
    },
    {
        "content": "Nov 14 U.S. cigarette maker Reynolds American Inc is seeking a higher price from British American Tobacco Plc after rejecting a $47 billion buyout offer as too low  Bloomberg reported on Monday. (http://bloom.bg/2fQxNIu)",
        "date": "11142016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "Reynolds American rejects BAT's $47 bln buyout offer - Bbg "
    },
    {
        "content": "U.S. cigarette maker Reynolds American Inc is seeking a higher price from British American Tobacco Plc after rejecting its $47 billion takeover offer  a source familiar with the situation told Reuters. | Video ",
        "date": "11152016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "Reynolds American rejects BAT's $47 billion takeover offer: source "
    },
    {
        "content": "SARAJEVO  Nov 18 An Austrian fund offered on Friday to buy the rest of Bosnian holding firm Fabrika Duhana Sarajevo (FDS) for 64.3 million Bosnian marka ($35 million) as part of a plan by British American Tobacco  to acquire the firm's tobacco assets.",
        "date": "11182016",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "Austrian fund bids for remainder of Bosnian firm in deal with BAT "
    },
    {
        "content": "Nov 15 Britain's FTSE 100 index is seen opening up 24 to 33 points  or 0.5 percent on Tuesday  according to financial bookmakers  with futures up 0.31 percent ahead of the cash market open.",
        "date": "11152016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UPDATE 1-UK Stocks-Factors to watch on Nov. 15 "
    },
    {
        "content": "LONDON Leading British investor Neil Woodford's fund firm said on Thursday it backed a takeover of Reynolds American  by British American Tobacco   calling the tie-up \"inevitable\".",
        "date": "11182016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "Top British American Tobacco investor Woodford says backs Reynolds deal "
    },
    {
        "content": "Nov 15 Britain's FTSE 100 index is seen opening up 24 to 33 points  or 0.5 percent on Tuesday  according to financial bookmakers.           * The UK blue chip index closed up 0.34 percent at 6 753.18 points on Monday following a rally in banking and mining stocks  although a slump in utilities kept a lid on broader market gains.      * REYNOLDS AMERICA/BATS: U.S. cigarette maker Reynolds American Inc  is seeking a higher price from British American Tobacco Plc after rejecting its $47",
        "date": "11152016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UK Stocks-Factors to watch on Nov. 15 "
    },
    {
        "content": "S.Korea Oct exports match initial estimates  imports contraction smaller",
        "date": "11152016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "Reuters Business News Schedule at 0430 GMT/00.30AM ET "
    },
    {
        "content": "To access the newsletter  click on the link:    http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_11152016.pdf           If you would like to receive this newsletter via email  please register at: https://forms.thomsonreuters.com/india-morning/               FACTORS TO WATCH     9:00 am: RBI Deputy Governor N.S. Vishwanathan and Transport Minister Nitin Gadkari at ASSOCHAM Infrastructure finance summit in Mumbai. 12:00 pm: Government to release October wholesale price inflat",
        "date": "11152016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "Morning News Call - India  November 15 "
    },
    {
        "content": "TOKYO/LONDON British American Tobacco PLC (BAT) plans to test a new tobacco-based cigarette alternative in Japan next month  it said on Tuesday  taking aim at Philip Morris International Inc's popular iQOS and Japan Tobacco Inc's Ploom Tech.",
        "date": "11082016",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "British American Tobacco to test tobacco e-cigarette in Japan "
    },
    {
        "content": "TOKYO/LONDON  Nov 8 British American Tobacco PLC (BAT) plans to test a new tobacco-based cigarette alternative in Japan next month  it said on Tuesday  taking aim at Philip Morris International Inc's popular iQOS and Japan Tobacco Inc's Ploom Tech.",
        "date": "11082016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "CORRECTED-British American Tobacco to test tobacco e-cigarette in Japan "
    },
    {
        "content": "TOKYO/LONDON British American Tobacco PLC (BAT) plans to test a new tobacco-based cigarette alternative in Japan next month  it said on Tuesday  taking aim at Philip Morris International Inc's popular iQOS and Japan Tobacco Inc's Ploom Tech.",
        "date": "11082016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "British American Tobacco to test e-cigarette in Japan "
    },
    {
        "content": "* Reynolds American Inc - board forms transaction committee to evaluate proposal from British American Tobacco",
        "date": "10312016",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-Reynolds American board forms committee to evaluate proposal from British American Tobacco "
    },
    {
        "content": "* Tadeu Marroco  currently director business development  will be appointed as regional director Western Europe  with effect from Dec.1 2016",
        "date": "10262016",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-BAT to appoint new director for Western Europe "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON/MILAN  October 24 (Fitch) Fitch Ratings has placed British American  Tobacco plc's (BAT) Long-Term Issuer Default Rating (IDR) and senior unsecured  ratings of 'A-' on Rating Watch Negative (RWN) following last Friday's  announcement by BAT of its proposed merger with US-based Reynolds American Inc.  (Reynolds or RAI  BBB/Rating Watch Positive). A full list of rating actions is  shown at the end of this commentary. The rating act",
        "date": "10242016",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "Fitch Places British American Tobacco on Rating Watch Negative "
    },
    {
        "content": "LONDON British American Tobacco  has offered to buy out U.S. cigarette maker Reynolds American Inc  in a $47 billion takeover that would create the world's biggest listed tobacco company with brands including Newport  Lucky Strike and Pall Mall. | Video ",
        "date": "10212016",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BAT offers to buy U.S. tobacco firm Reynolds in $47 billion deal "
    },
    {
        "content": "Over the last 20 years  tobacco companies have buying one another out as health warnings  regulatory crackdowns and insurance incentives have decimated the U.S. market for cigarettes.  Four companies — Philip Morris  Reynolds American  ITG Brands  and Liggett – had roughly 91 percent of U.S. cigarette sales in 2015.  So it makes sense that British American Tobacco would bid $47 billion for the 58 percent stake in Reynolds American it doesn't already own.",
        "date": "10212016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "Data Dive: Puff! There goes another one "
    },
    {
        "content": "* Dow down 0.25 pct  S&P down 0.16 pct  Nasdaq up 0.14 pct   (Updates to afternoon)",
        "date": "10212016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "US STOCKS-Health  energy stocks hit Wall St  Microsoft lifts Nasdaq "
    },
    {
        "content": "* Dow down 0.52 pct  S&P down 0.27 pct  Nasdaq up 0.06 pct   (Adds details  comments  updates prices)",
        "date": "10212016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "US STOCKS-S&P  Dow fall with health stocks; Microsoft lifts Nasdaq "
    },
    {
        "content": "* Indexes down: Dow 0.53 pct  S&P 0.45 pct  Nasdaq 0.22 pct   (Updates to open)",
        "date": "10212016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "US STOCKS-Wall St drops on bleak GE outlook; Microsoft blunts losses "
    },
    {
        "content": "* Futures down: Dow 57 pts  S&P 7.25 pts  Nasdaq 6.5 pts   (Adds details  comments  updates prices)",
        "date": "10212016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "US STOCKS-Wall St set to open lower  weighed down by GE "
    },
    {
        "content": "* Reynolds American Acknowledges receipt of non-binding proposal from British American Tobacco to acquire all remaining outstanding shares of RAI stock",
        "date": "10212016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BRIEF-British American Tobacco to acquire remaining outstanding shares of Reynolds American stock "
    },
    {
        "content": "LONDON  Oct 21 British American Tobacco  has offered to buy U.S. tobacco company Reynolds American Inc  in a $47 billion deal bringing together Newport  Kent and Pall Mall cigarettes to create the U.S. market leader.",
        "date": "10212016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BAT offers to buys U.S. tobacco firm Reynolds in $47 billion deal "
    },
    {
        "content": "* Year-to-date revenue grew strongly  up 8.1% at constant rates of exchange",
        "date": "10212016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BRIEF-BAT year-to-date revenue up 8.1 pct "
    },
    {
        "content": "* Made a proposal to merge with Reynolds through acquisition of remaining 57.8 pct in company",
        "date": "10212016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BRIEF-BAT proposes to buy Reynolds American "
    },
    {
        "content": "SARAJEVO British American Tobacco  intends to acquire the tobacco assets of Bosnian holding firm Fabrika Duhana Sarajevo (FDS) from a regional government in the country  the company said on Thursday.",
        "date": "09152016",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BAT plans Bosnia tobacco acquisition "
    },
    {
        "content": "SARAJEVO  Sept 15 British American Tobacco  intends to acquire the tobacco assets of Bosnian holding firm Fabrika Duhana Sarajevo (FDS) from a regional government in the country  the company said on Thursday.",
        "date": "09152016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UPDATE 1-BAT plans Bosnia tobacco acqusition "
    },
    {
        "content": "SARAJEVO  Sept 15 British American Tobacco  has bought a Bosnian regional government's 39.9 percent stake in tobacco factory Fabrika Duhana Sarajevo (FDS)  for 42.7 million Bosnian marka ($24.4 million)  BAT said on Thursday.",
        "date": "09152016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "British American Tobacco acquires stake in Bosnian tobacco plant "
    },
    {
        "content": "* Managers cite duty to make money  not exercise moral judgment",
        "date": "09062016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "European fund firms largely resist tobacco divestment campaign "
    },
    {
        "content": "* Group revenue was up 7.8% at constant rates of exchange  or 6.0% on an organic basis ",
        "date": "07282016",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-British american tobacco says profit growth to be  weighted to second half of year   remains confident can  deliver another year of good earnings growth at constant rates of exchange.\" "
    },
    {
        "content": "NEW DELHI  June 30 (Thomson Reuters Foundation) - British American Tobacco (BAT)  the world's second biggest cigarette company  vowed on Thursday to investigate some of its supply farms in Bangladesh after a Swedish campaign group uncovered the use of child workers to grow and process tobacco.",
        "date": "06302016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "British American Tobacco vows to investigate child workers in Bangladeshi farms "
    },
    {
        "content": "June 8 Britain's FTSE 100 index is seen opening down by 14 points  or 0.2 percent  on Wednesday  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The UK blue chip index closed up 0.2 percent on Tuesday at 6 284.53  chalking up its third straight day of gains  as a rise in oil and energy shares offset weaker mining stocks.      * VODAFONE: Sky Network Ltd on Wednesday said it is in discussions with Vodafone Group Plc abo",
        "date": "06082016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UK Stocks-Factors to watch on June 8 "
    },
    {
        "content": "* Says applying for leave to appeal English High Court decision on plain packaging for cigarettes  Further company coverage:    (Reporting by UK bureau)",
        "date": "05192016",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-BAT applying to appeal UK court decision on plain packaging "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  April 29 (Fitch) Fitch Ratings has affirmed British American Tobacco  plc's (BAT) Long-Term Issuer Default Rating (IDR) at 'A-' with Negative Outlook  and the Short-Term IDR at 'F2'. In addition  the senior unsecured long-term  rating of debt issued by BAT's subsidiaries  B.A.T. International Finance plc  and B.A.T. Netherlands Finance B.V.  has been affirmed at 'A-'. The short-term  debt rating has been affirmed at 'F2'. The ra",
        "date": "04292016",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "Fitch Affirms BAT at 'A-'; Outlook Negative "
    },
    {
        "content": "LONDON  April 26 British American Tobacco   the world's second-biggest cigarette company  on Tuesday said its profit growth would be weighted toward the second half of the year  due partly to the impact of foreign exchange.",
        "date": "04262016",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "British American Tobacco sees profits weighted in H2 "
    },
    {
        "content": "* Q1 cigarette volume from subsidiaries increased by 3.6% to 158 billion  or 2.4% on an organic basis",
        "date": "04262016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BRIEF-BAT says profit growth will be weighted to H2 "
    },
    {
        "content": "NEW DELHI  April 2 India's top cigarette maker ITC Ltd  part-owned by British American Tobacco   said it was not ready to print bigger health warnings on its packs as mandated by the government and will keep its factories shut until clarity emerges on the new rules.",
        "date": "04022016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "India's ITC says to keep cigarette factories shut over health warning rules "
    },
    {
        "content": " ",
        "date": "03142016",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "British American Tobacco to invest $11.9 mln in Mali state firm "
    },
    {
        "content": "British American Tobacco Plc's  chief executive said he does not expect any \"big consolidation\" among the world's top four tobacco companies in the next few years  quashing rumours that the maker of Dunhill cigarettes might bid for a rival.",
        "date": "02252016",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "British American Tobacco CEO says 'big consolidation' not imminent "
    },
    {
        "content": "* Shares rise 1 pct   (Adds CEO comment  details  share price)",
        "date": "02252016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UPDATE 2-British American Tobacco CEO says 'big consolidation' not imminent "
    },
    {
        "content": "Europe shrugs off pre-G20 China stocks slump  sterling steadies",
        "date": "02252016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "Reuters Business News Schedule at 1330 GMT/0830 AM ET "
    },
    {
        "content": "* Sees bolt-on acquisitions in industry in medium term  not big consolidation - CEO\u007f\u007f",
        "date": "02252016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BRIEF-British American Tobacco CEO says does not expect consolidation in industry "
    },
    {
        "content": "Europe shrugs off pre-G20 China stocks slump  sterling steadies",
        "date": "02252016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "Reuters Business News Schedule at 0930 GMT/0430 AM ET "
    },
    {
        "content": "Feb 25 British American Tobacco  the world's second-biggest tobacco company  reported a smaller-than-expected fall in 2015 revenue on Thursday  helped by a smaller decline in organic cigarette volumes.",
        "date": "02252016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "British American Tobacco's FY revenue fall smaller than expected "
    },
    {
        "content": "Feb 25 Britain's FTSE 100 index is seen opening up by 74-77 points  or 1.3 percent  on Thursday  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The UK blue chip index FTSE 100 ended down 1.6 percent at 5 867.18 on Wednesday  as mining stocks and FTSE heavyweight Standard Chartered  came under pressure for a second straight session.      * SHELL:  Royal Dutch Shell's U.S. head Marvin Odum will step down after the compa",
        "date": "02252016",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UK Stocks-Factors to watch on Feb 25 "
    },
    {
        "content": "* Signed vapour products technology-sharing agreement with R.J. Reynolds Tobacco Company  a unit of Reynolds American",
        "date": "12012015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-BAT signs Vapour Collaboration Agreement with Reynolds American "
    },
    {
        "content": "* Signed vapour products technology-sharing agreement with R.J. Reynolds Tobacco Company unit of Reynolds American  Source text for Eikon:  Further company coverage:",
        "date": "12012015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BRIEF-British American Tobacco signs vapour collaboration agreement with Reynolds American "
    },
    {
        "content": "* Long-mooted deal would be last big trade in shrinking market",
        "date": "11262015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "DEALTALK-Any Imperial Tobacco takeover would face major hurdles "
    },
    {
        "content": "LONDON  Nov 18 British American Tobacco   the world's No. 2 cigarette maker  will test a hybrid product that uses tobacco and e-cigarette technology next week in an unspecified European market  a senior executive said on Wednesday.",
        "date": "11182015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "British American to test tobacco/e-cigarette hybrid "
    },
    {
        "content": "LONDON  Nov 18 British American Tobacco  plans to test a hybrid product that combines tobacco and e-cigarette technology next week in a European market  a senior executive said on Wednesday.",
        "date": "11182015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UPDATE 1-British American to test tobacco/e-cigarette hybrid "
    },
    {
        "content": "* Exec says to launch tobacco/e-cigarette hybrid product next week in a test market in Europe  Further company coverage:    (Reporting by UK bureau)",
        "date": "11182015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BRIEF-BAT to launch tobacco/e-cigarette hybrid product next week in European test run "
    },
    {
        "content": "* Year-to-date rev through Sept up 4.2 pct excl currency impact",
        "date": "10282015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "RPT-UPDATE 1-British American Tobacco revenue hurt by weak currencies "
    },
    {
        "content": "LONDON  Oct 28 British American Tobacco   the world's No. 2 cigarette company  reported a 6.5 percent decline in revenue for the first nine months of the year  hurt by currency fluctuations and declines in smoking rates.",
        "date": "10282015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "British American Tobacco revenue hurt by currency fluctuations "
    },
    {
        "content": "* BAT Serviços will acquire 342 956 819 shares at a price of R$27.20 per share  representing 22.4 pct of Souza Cruz",
        "date": "10162015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-British American Tobacco completes auction for Souza Cruz "
    },
    {
        "content": "Sept 22 British American Tobacco Plc  said it would buy Poland's CHIC Group  owner of Europe's largest e-cigarette retailing network  and signed a vapour technology-sharing term sheet with RJ Reynolds Tobacco Co  a unit of Reynolds American Inc.",
        "date": "09222015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "UPDATE 1-BAT to buy Polish e-cigarette firm  signs deal with RJ Reynolds "
    },
    {
        "content": "Sept 22 British American Tobacco Plc  said on Tuesday it would buy CHIC Group of Poland to boost its presence in the growing e-cigarette market.",
        "date": "09222015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BAT to buy Polish e-cigarette firm  inks deal with Reynolds American "
    },
    {
        "content": "* Confirms brazilian unit  following approval by brazilian regulator  launched offer to acquire up to all of 24.7% of souza cruz",
        "date": "09102015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-BAT offers to buy rest of Brazil's Souza Cruz "
    },
    {
        "content": "NAIROBI  Aug 28 Kenyan insurer British American Investments' pretax profit fell 67 percent in the first half to 1 billion shillings  ($9.64 million)  hurt by lower valuations of the companies it has invested in  it said on Friday.",
        "date": "08282015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "Share falls hit Kenya's Britam first-half pretax profit "
    },
    {
        "content": "* Is expected that bat will be in a position to launch offer should it decide to do so in september 2015.",
        "date": "08202015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-BAT receives undertaking from Aberdeen regarding proposed Souza Cruz offer "
    },
    {
        "content": "HARARE  July 27 Cigarette maker British American Tobacco's Zimbabwe unit reported higher first-half profit after raising prices and cutting costs  it said on Monday  despite a drop in sales due to a depressed economy.",
        "date": "07272015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BAT Zimbabwe unit's H1 profit up on higher prices  cost cuts "
    },
    {
        "content": "LONDON British American Tobacco expects its legal challenge to the implementation of \"plain packaging\" of tobacco in Britain to be heard in court in December  with possible final resolution by the end of 2016  a senior executive said.",
        "date": "07292015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BAT sees 'plain packaging' challenge in Britain being heard in December "
    },
    {
        "content": "LONDON  July 29 Britain's top share index advanced on Wednesday  with Hikma Pharmaceuticals leading the market higher on positive broker comments and GlaxoSmithKline gaining after reporting a lower-than-expected fall in quarterly earnings.",
        "date": "07292015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UPDATE 3-FTSE finishes higher  Hikma and GlaxoSmithKline boost "
    },
    {
        "content": "LONDON  July 29 Britain's top share index advanced on Wednesday  with Hikma Pharmaceuticals leading the market higher on positive broker comments and GlaxoSmithKline gaining after reporting a lower-than-expected fall in quarterly earnings.",
        "date": "07292015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "FTSE extends gains  Hikma and GlaxoSmithKline support "
    },
    {
        "content": "LONDON  July 29 British American Tobacco  expects its legal challenge to the implementation of \"plain packaging\" of tobacco in Britain to be heard in court in December  with possible final resolution by the end of 2016  a senior executive said.",
        "date": "07292015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UPDATE 1-BAT sees \"plain packaging\" challenge in Britain being heard in December "
    },
    {
        "content": "LONDON  July 29 Britain's top share index rose for a second straight session on Wednesday after recent sharp falls  with Hikma Pharmaceuticals leading the market higher on positive broker comments and Barclays gaining after saying it will speed up cost cuts.",
        "date": "07292015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "REFILE-Hikma and Barclays help Britain's FTSE to climb higher "
    },
    {
        "content": "LONDON British American Tobacco   the world's No. 2 cigarette company  reported better-than-expected performance for the second quarter  helped by cost savings and market share gains.",
        "date": "07292015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "British American Tobacco beats expectations  shares up "
    },
    {
        "content": "LONDON  July 29 British American Tobacco   the world's No. 2 cigarette company  reported lower revenue for the first half of the year  hurt by currency fluctuations and people cutting back on smoking.",
        "date": "07292015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "British American Tobacco first-half sales hurt by currency moves "
    },
    {
        "content": "* Provisional execution order was imposed by Superior Court of Quebec as part of a C$15.6 billion judgement in two class action cases  issued on June 1st 2015",
        "date": "07242015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-British American Tobacco Quebec provisional execution order cancelled "
    },
    {
        "content": "SANTIAGO  July 9 The Chilean unit of British American Tobacco said on Tuesday it will close various plants in the South American nation after Congress stiffened an anti-tobacco law.",
        "date": "07092015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "British American Tobacco to downsize Chile operation on law changes "
    },
    {
        "content": "* Successfully priced a US dollar denominated issue of notes  raising proceeds of approximately $4.5 billion.",
        "date": "06112015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-BAT raises $4.5 bln via US bond issue "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  June 03 (Fitch) Fitch Ratings has revised the Outlook on British  American Tobacco plc (BAT) to Negative from Stable and affirmed the Long-term  Issuer Default Rating (IDR) at 'A-'. The Short-term IDR has been affirmed at  'F2'. In addition  the senior unsecured long-term rating of debt issued by BAT's  subsidiaries  B.A.T. International Finance plc and B.A.T. Netherlands Finance  B.V.  has been affirmed at 'A-'. The short-term ",
        "date": "06032015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "Fitch Revises Outlook on BAT to Negative; Affirms at 'A-' "
    },
    {
        "content": "LONDON  June 2 Britain's top share index posted its lowest close in more than three weeks on Tuesday  with tobacco stocks slipping after a Canadian court ruling and Merlin Entertainments slumping after an accident at a theme park run by the company.",
        "date": "06022015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "Tobacco stocks drag FTSE to 3-week closing low  Merlin slumps "
    },
    {
        "content": "LONDON  June 1 British American Tobacco  has agreed to buy tobacco company TDR from Croatia's Adris Grupa  for 550 million euros ($600.05 million) to increase its scale in Croatia  Bosnia and Serbia.",
        "date": "06012015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "UPDATE 1-BAT to buy Croatian tobacco business for 550 million euros "
    },
    {
        "content": "LONDON  June 2 Britain's top share index touched its lowest in more than three weeks on Tuesday  kept under pressure by a drop in tobacco stocks following a Canadian court ruling and lingering uncertainty about a Greek debt deal.",
        "date": "06022015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "Tobacco stocks drag Britain's FTSE to three-week lows "
    },
    {
        "content": "LONDON  June 1 British American Tobacco  has agreed to buy tobacco company TDR from Croatia's Adris Grupa  for 550 million euros ($600.05 million) to increase its scale in Croatia  Bosnia and Serbia.",
        "date": "06012015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BAT to buy Croatian tobacco business for 550 million euros "
    },
    {
        "content": "* British American Tobacco to expand its business in central europe",
        "date": "06012015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BRIEF-British American Tobacco to acquire TDR for 550 mln euro "
    },
    {
        "content": "LONDON  June 2 Britain's top share index dropped on Tuesday  weighed down by a drop in tobacco stocks  although strong gains in plumbing supplies group Wolseley helped to limit the losses.",
        "date": "06022015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "Tobacco stocks drag Britain's FTSE lower "
    },
    {
        "content": "LONDON  June 2 Britain's top share index stayed near break even on Tuesday  supported by strong gains in plumbing supplies group Wolseley after its revenues rose  although a drop in tobacco stocks weighed on the market.",
        "date": "06022015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "FTSE holds steady  supported by Wolseley's revenue rise "
    },
    {
        "content": "* British Amercian Tobacco shares fall 0.8 percent at open on Canadian court ruling  Further company coverage:    (Bengaluru Newsroom; +44 207 542 1810)",
        "date": "06022015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BRIEF-BAT shares open down 0.8 pct on Canadian court ruling "
    },
    {
        "content": "* Imperial Tobacco Canada's share of provisional execution order would be CAD$743 million",
        "date": "06022015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BRIEF-BATS says subsidiary to appeal against Quebec tobacco class action judgements "
    },
    {
        "content": "May 22 ITC Ltd  India's largest cigarette maker  reported a lower-than-expected quarterly profit as higher taxes on smokes and a government push to discourage tobacco consumption hurt business.",
        "date": "05222015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "India's top cigarette maker misses profit estimates "
    },
    {
        "content": "LONDON  April 29 Britain's top share index stayed within reach of all-time highs on Wednesday as traders digested mixed earnings news on a busy day of corporate updates.",
        "date": "04292015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "Britain's FTSE steadies near highs after mixed earnings "
    },
    {
        "content": "British American Tobacco Plc   the world's No. 2 cigarette maker  reported a drop in first-quarter revenue  hurt by a stronger pound and as more people cut back on smoking.",
        "date": "04292015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "British American Tobacco hit by strong pound  lower sales "
    },
    {
        "content": "* Stock falls 2 pct   (Adds share movement  analysts' comments)",
        "date": "04292015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UPDATE 2-British American Tobacco hit by strong pound  lower sales "
    },
    {
        "content": "LONDON  April 29 Britain's top share index stayed within reach of all-time highs on Wednesday as traders digested mixed earnings news on a busy day of corporate updates.",
        "date": "04292015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "Mixed earnings see Britain's FTSE steady near all-time highs "
    },
    {
        "content": "* Extends previous day fall as investors digest mixed earnings",
        "date": "04292015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "European shares extend fall amid mixed earnings "
    },
    {
        "content": "April 29 British American Tobacco Plc  the world's No. 2 cigarette maker  reported lower revenue for the first-quarter  as more people cut back on smoking.",
        "date": "04292015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "Cigarette-maker British American Tobacco posts lower revenue "
    },
    {
        "content": "April 8 Britain's high commissioner to Pakistan  Philip Barton  has drawn harsh criticism from medical experts and campaigners for attending a lobbying meeting by British American Tobacco in Pakistan  the Financial Times reported.",
        "date": "04082015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "UPDATE 1-Top British diplomat in cigarette lobbying row -FT "
    },
    {
        "content": "April 7 Britain's high commissioner to Pakistan  Philip Barton  has drawn harsh criticism from medical experts and campaigners for attending a lobbying meeting by British American Tobacco in Pakistan  the Financial Times reported.",
        "date": "04082015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "CORRECTED-Top British diplomat in cigarette lobbying row -FT (April 7) "
    },
    {
        "content": "Britain's high commissioner to Pakistan  Philip Barton  has drawn harsh criticism from medical experts and campaigners for attending a lobbying meeting by British American Tobacco in Pakistan  the Financial Times reported.",
        "date": "04072015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "Top British diplomat in cigarette lobbying row: FT "
    },
    {
        "content": "April 7 Britain's high commissioner to Pakistan  Philip Barton  has drawn harsh criticism from medical experts and campaigners for attending a lobbying meeting by British American Tobacco in Pakistan  the Financial Times reported.",
        "date": "04072015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "Top British diplomat in cigarette lobbying row -FT "
    },
    {
        "content": "* Kingfisher up as investors welcome store closures   (Recasts  adds detail  quote)",
        "date": "03312015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UK's FTSE ends strong first quarter with sharp drop "
    },
    {
        "content": "* Commenced a competitive tender process to appoint new external auditors for 2015 onwards",
        "date": "03022015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "BRIEF-BAT begins tender process to appoint new external auditors "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  March 03 (Fitch) Fitch Ratings has affirmed British American Tobacco  plc.'s (BAT) Long-term Issuer Default Rating (IDR) at 'A-' with a Stable  Outlook. The Short-term IDR has been affirmed at 'F2'. In addition  the senior  unsecured long-term rating of debt issued by BAT's subsidiaries  B.A.T.  International Finance plc and B.A.T. Netherlands Finance B.V.  has been affirmed  at 'A-'. The short-term debt rating has been affirmed",
        "date": "03032015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "Fitch Affirms British American Tobacco plc. at 'A-'; Outlook Stable "
    },
    {
        "content": "LONDON  March 3 British American Tobacco  has submitted a proposal to buy the 24.7 percent stake it does not own in Brazil's largest cigarette company  Souza Cruz  in a deal that would cost about 2.3 billion pounds ($3.5 billion).",
        "date": "03032015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UPDATE 1-BAT offers to buy out Souza Cruz stake in 2.3 bln stg deal "
    },
    {
        "content": "LONDON  March 3 British American Tobacco  said on Tuesday it was seeking to buy the 24.7 percent it did not already own in Brazil's Souza Cruz and to delist the company.",
        "date": "03032015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BAT offers to buy out Souza Cruz stake "
    },
    {
        "content": "NAIROBI  Feb 27 British American Tobacco Kenya's  full year 2014 pretax profit jumped 11 percent to 6.1 billion shillings ($66.8 million)  helped by increased export and domestic sales  the company said on Friday.",
        "date": "02272015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "Kenya's BAT says FY 2104 pretax profit up 11 pct "
    },
    {
        "content": "LONDON British American Tobacco   the world's second-biggest tobacco company  reported slightly better than expected sales for 2014  gaining share in a market shrinking as more smokers stub out the habit.",
        "date": "02262015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "British American Tobacco sales fall less than expected "
    },
    {
        "content": "* Says expects to outperform market in tough conditions in 2015   (Adds more comments  share activity  byline)",
        "date": "02262015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UPDATE 2-British American Tobacco sales fall less than expected "
    },
    {
        "content": "LONDON  Feb 26 Britain's top share index edged higher on Thursday following a spate of mixed earnings reports  supported by the banking sector as the market welcomed the announcement of a new CEO of Standard Chartered.",
        "date": "02262015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "Britain's FTSE edges higher after StanChart announces new CEO "
    },
    {
        "content": "* FY operating margin  at current rates of exchange  grew by more than 50 basis points to 38.7 pct",
        "date": "02262015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BRIEF-British American Tobacco FY adj EPS fell 3.9 pct "
    },
    {
        "content": "* British American Tobacco CEO says expects BAT to do better than the 1-1.5 percent decline expected for the industry in 2015.",
        "date": "02262015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BRIEF-British American Tobacco CEO expects to outperform industry this year "
    },
    {
        "content": "LONDON  Feb 26 British American Tobacco   the world's second-biggest tobacco company  reported a slightly smaller-than-expected full-year sales decline  as smokers continued to cut back on the habit.",
        "date": "02262015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "British American Tobacco sales fall slightly smaller than expected "
    },
    {
        "content": "LONDON/SAO PAULO British American Tobacco Plc  is considering a buyout of the 24.7 percent stake it does not already own in Souza Cruz SA   Brazil's largest cigarette company  in a deal that could cost about 2.3 billion pounds ($3.53 billion).",
        "date": "02232015",
        "name": "British American Tobacco plc",
        "news_type": "topStory",
        "symbol": "BTI",
        "title": "British American Tobacco mulls $3.5 billion buyout of Brazil unit stake "
    },
    {
        "content": "LONDON/SAO PAULO  Feb 23 British American Tobacco Plc is considering a buyout of the 24.7 percent stake it does not already own in Souza Cruz SA  Brazil's largest cigarette company  in a deal that could cost about 2.3 billion pounds ($3.53 billion).",
        "date": "02232015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "UPDATE 2-British American Tobacco mulls $3.5 bln buyout of Brazil unit stake "
    },
    {
        "content": "LONDON  Feb 23 British American Tobacco  is considering a possible public tender offer for as many as all the shares in Brazilian tobacco company Souza Cruz it does not already own.",
        "date": "02232015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "British American says weighing offer for Souza Cruz shares "
    },
    {
        "content": "* Evaluating possible public tender offer to buy up to all of 24.7 pct of Souza Cruz shares not currently owned by BAT and to delist company",
        "date": "02232015",
        "name": "British American Tobacco plc",
        "news_type": "normal",
        "symbol": "BTI",
        "title": "BRIEF-British American Tobacco confirms possible offer for Souza Cruz "
    }
]