[
    {
        "content": "BRUSSELS  Nov 13 Anheuser-Busch InBev  the world's largest beer maker  said on Monday it would replace the head of its North America division at the start of next year.",
        "date": "11132017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev to replace head of North America division "
    },
    {
        "content": "* U.S. beer in decline for a decade (Adds CEO comments  bullet points)",
        "date": "11132017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 3-AB InBev replaces North America chief to stem sales slide "
    },
    {
        "content": "* RECEIVES RUSSIAN FAS APPROVAL FOR MERGER OF RUSSIAN BUSINESS WITH AB INBEV",
        "date": "10262017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-Anadolu Efes receives Russian FAS approval for merger of Russian operations with AB INBEV "
    },
    {
        "content": "BRUSSELS Anheuser-Busch InBev   the world's largest brewer  sold less beer than expected in the third quarter  hit particularly by hurricanes and market share losses in its largest market  the United States.",
        "date": "10262017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev takes hurricane hit in United States "
    },
    {
        "content": "* Increases SABMiller takeover cost savings target (Adds analyst comment  updates shares)",
        "date": "10262017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 4-AB InBev takes hurricane hit in United States "
    },
    {
        "content": "SAO PAULO/BRASILIA  Oct 26 Ambev SA  the Latin American unit of Anheuser Busch Inbev NV  on Thursday reported a third-quarter adjusted net income of 3.24 billion reais  ($1 billion)  up 1.2 percent from a year earlier.",
        "date": "10262017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Brazil's Ambev beats Q3 profit estimates "
    },
    {
        "content": "* Q3 NORTH AMERICA TOTAL VOLUMES 30.1‍​ MILLION HLS VERSUS 31.9 MILLION HLS YEAR AGO",
        "date": "10262017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-Anheuser Busch Inbev Q3 total volumes miss Reuters poll "
    },
    {
        "content": "MAR DEL PLATA  Argentina  Oct 12 Beer sales in Argentina have grown 8 percent so far this year after falling in 2016 amid a recession in Latin America's No. 3 economy  an executive at Argentina's largest brewery Quilmes  owned by Anheuser Busch Inbev NV  said on Thursday.",
        "date": "10132017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "CORRECTED-Argentina beer sales up 8 pct so far in 2017 -Quilmes brewery "
    },
    {
        "content": "TOKYO  Sept 21 Asahi Group Holdings Ltd is ready to spend \"billions of dollars\" more on acquisitions  after having recently spent $11 billion to acquire beer brands across Europe from Anheuser-Busch InBev NV  a top company executive said.",
        "date": "09212017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Japanese brewer Asahi ready to spend \"billions of dollars\" on acquisitions "
    },
    {
        "content": "TOKYO Asahi Group Holdings   Japan's largest brewer  is ready to spend \"billions of dollars\" on acquisitions  having spent $11 billion over the past year to acquire beer brands across Europe from Anheuser-Busch InBev .",
        "date": "09212017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Japanese brewer Asahi ready to spend 'billions' on deals "
    },
    {
        "content": "* OFFERING CONSISTING OF AUD 450 MILLION NOTES WITH FIXED INTEREST RATE OF 4.10 PERCENT PER ANNUM MATURING SEPT 6 2027",
        "date": "08232017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev announces pricing of AUD 1.95 billion notes "
    },
    {
        "content": "* HAS REACHED NON-BINDING AGREEMENT WITH ANADOLU EFES REGARDING 50:50 MERGER OF AB INBEV'S AND ANADOLU EFES' EXISTING RUSSIA AND UKRAINE BUSINESSES",
        "date": "08162017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-Sun Interbrew's parent company says non-binding agreement for merger of Russian and Ukrainian business "
    },
    {
        "content": "LONDON Brewers Anheuser-Busch InBev  and Anadolu Efes  have agreed to merge their operations in Russia and Ukraine in an attempt to strengthen their position in a declining market.",
        "date": "08092017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev  Efes to merge Russian operations as sales slide "
    },
    {
        "content": "* Efes shares up 3 pct; ABI  Carlsberg down (Adds analyst comment  market share  bullet points)",
        "date": "08092017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 2-AB InBev  Efes to merge Russian operations as sales slide "
    },
    {
        "content": "LONDON  Aug 9 Anheuser-Busch InBev has agreed to merge its business in Russia and Ukraine with those of Anadolu Efes for an undisclosed price  forming a new company that will be part of the Turkish brewer  the company said on Wednesday.",
        "date": "08092017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev  Efes to merge operations in Russia  Ukraine "
    },
    {
        "content": "* ANHEUSER-BUSCH INBEV ANNOUNCES COMBINATION OF ITS RUSSIA AND UKRAINE BUSINESSES WITH THOSE OF ANADOLU EFES",
        "date": "08092017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB Inbev combines its Russia and Ukraine businesses with those of Anadolu Efes "
    },
    {
        "content": "* Q2 NORMALIZED EBITDA $‍​5.35 BILLION VERSUS $5.40 BILLION IN REUTERS POLL",
        "date": "07272017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-Anheuser Busch Inbev Q2 normalized ebitda misses Reuters poll "
    },
    {
        "content": "July 20 The world's largest brewer Anheuser Busch InBev said on Thursday it was acquiring Hiball  a San Francisco-based producer of energy drinks and owner of the Alta Palla brand of organic sparkling juices and sparkling waters.",
        "date": "07202017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB Inbev to buy soft drinks firm Hiball "
    },
    {
        "content": "* ANHEUSER-BUSCH PARTNERS WITH HIBALL ENERGY AND ALTA PALLA BRANDS",
        "date": "07202017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-Anheuser-Busch partners with Hiball Energy and Alta Palla brands "
    },
    {
        "content": "HANOI Vietnam said Australia's Carlton & United Breweries (CUB)  part of the world's largest brewer Anheuser-Busch InBev   has expressed its interest in becoming a strategic investor of Vietnam's top brewers Sabeco  and Habeco .",
        "date": "07252017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev's Australian unit keen on Sabeco  Habeco stakes: Vietnam "
    },
    {
        "content": "LONDON/FRANKFURT  June 20 Anheuser Busch InBev has kicked off the process of selling its small German beer brands Hasseroeder and Diebels as it sheds non-core assets following last year's blockbuster takeover of SABMiller  people close to the matter told Reuters.",
        "date": "06202017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "CORRECTED-AB InBev kicks off sale of German beers Hasseroeder and Diebels - sources "
    },
    {
        "content": "LONDON  May 12 With sales in its core business growing after six years of declines and 600 million euros ($655 million) at its disposal  Nomad Foods is finally in a good position to make acquisitions  its chief executive told Reuters on Friday.",
        "date": "05122017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Nomad Foods CEO lines up further deals "
    },
    {
        "content": "* PRICED CAD 1.3 BILLION AGGREGATE PRINCIPAL AMOUNT OF NOTES WITH A FIXED INTEREST RATE OF 2.60 PCT PER ANNUM AND MATURING 15 MAY 2024",
        "date": "05092017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-Anheuser Busch InBev announces pricing of CAD 2.0 billion notes "
    },
    {
        "content": "SAO PAULO  May 4 Ambev SA  the Latin American unit of Anheuser Busch Inbev NV  missed first-quarter profit estimates on Thursday  reflecting rapid growth in costs that offset a decline in financial expenses and higher volumes.",
        "date": "05042017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Brazil's Ambev misses estimates as cost pressure bites "
    },
    {
        "content": "* Shares hit 6-month high (Updates with shares  analyst comment)",
        "date": "05042017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 2-AB InBev sees light in Brazil after two-year slump "
    },
    {
        "content": "* Q1 normalized EBITDA $4.81 billion versus $4.88 billion in Reuters poll",
        "date": "05042017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-Anheuser busch inbev Q1 total volumes beat Reuters poll "
    },
    {
        "content": "BRUSSELS  April 26 Anheuser-Busch InBev   the world's largest brewer  remains convinced about the potential of the Brazilian consumer market despite declining beer sales over the past two years and a particularly tough 2016.",
        "date": "04262017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Don't write off Brazil despite two bad years -AB InBev CEO "
    },
    {
        "content": "* AB InBev completes disposal of its interest in Distell Group Limited to Public Investment Corporation Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "04122017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev completes sale of interest in Distell Group to S.Africa's PIC "
    },
    {
        "content": "LONDON  March 31 Diageo  the world's largest spirits maker  spotted in 2015 that drinkers in the emerging middle class in Ghana and Cameroon were keen to show off their new status by buying their own bottles of Johnnie Walker rather than shots.",
        "date": "03312017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Changes at Diageo put focus back on Scotch "
    },
    {
        "content": "TOKYO Japanese beer maker Asahi Group Holdings Ltd  said on Tuesday it will take on 7.4 billion euros (6.36 billion pounds) in bank loans to finance its acquisition of European assets from Anheuser-Busch InBev SAC NV .",
        "date": "03282017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Japan's Asahi takes on 7.4 billion euro loans to fund AB InBev asset buy "
    },
    {
        "content": "TOKYO  March 28 Japanese beer maker Asahi Group Holdings Ltd said on Tuesday it will take on 7.4 billion euros ($8 billion) in bank loans to finance its acquisition of European assets from Anheuser-Busch InBev SAC NV .",
        "date": "03282017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Japan's Asahi takes on 7.4 bln euro loans to fund AB InBev asset buy "
    },
    {
        "content": "BRUSSELS  March 2 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03022017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "EU mergers and takeovers (March 2) "
    },
    {
        "content": "LEUVEN  Belgium Anheuser-Busch InBev  the world's largest brewer  suffered its first decline in core earnings since its formation over a decade ago as recession-hit Brazil depressed beer sales by even more than expected.",
        "date": "03022017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev suffers first core profit decline on Brazil slump "
    },
    {
        "content": "* Raises merger savings target to $1.75 bln from $1.4 bln   (Adds shares  analyst comment)",
        "date": "03022017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 2-AB InBev suffers first core profit decline on Brazil slump "
    },
    {
        "content": "* Revenue grew by 2.4 pct in FY 2016 and by 0.2 pc in Q4 2016",
        "date": "03022017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev revenue grew by 2.4 pct in FY 2016 "
    },
    {
        "content": "* Q4 revenue $14.20 billion versus $13.84 billion in Reuters poll",
        "date": "03022017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev Q4 revenue beats Reuters poll "
    },
    {
        "content": "BRUSSELS  March 2 Anheuser-Busch InBev  the world's largest brewer  raised its forecast for savings from its near $100 billion takeover of SABMiller after weaker than expected earnings as beer sales suffered in Brazil.",
        "date": "03022017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev raises merger savings after weak year end "
    },
    {
        "content": "LONDON  Feb 17 (IFR) - Blue chip advisers in the City of London could reap a fee bonanza of more than US$200m from Kraft Heinz’s US$143bn approach for Anglo-Dutch household goods group Unilever  which was immediately rejected.",
        "date": "02172017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Lazard big winner if Kraft Heinz eats Unilever "
    },
    {
        "content": "BRUSSELS  Feb 17 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02172017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "EU mergers and takeovers (Feb 17) "
    },
    {
        "content": "HONG KONG  Feb 20 Overseas acquisitions by Chinese buyers are cooling after two record years as Beijing reins in capital outflows  but deals into China are on the rise  and new rules will make it easier for foreign buyers to tap China's giant consumer potential.",
        "date": "02192017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Inbound China M&A takes flight on consumer promise "
    },
    {
        "content": "LONDON U.S. food company Kraft Heinz Co made a surprise $143 billion offer for Unilever Plc in a bid to build a global consumer goods giant  although it was flatly rejected on Friday by the maker of Lipton tea and Dove soap. | Video ",
        "date": "02182017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Kraft Heinz bids $143 billion for Unilever in global brand grab "
    },
    {
        "content": "* Unilever shares touch record high; Kraft Heinz stock up 10 pct   (Adds Moody's note)",
        "date": "02182017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 8-Kraft Heinz bids $143 bln for Unilever in global brand grab "
    },
    {
        "content": "LONDON  Feb 16 Soft drinks bottler Coca-Cola HBC  reported higher full-year profit on Thursday  helped by price increases and cost cuts  though revenue was pulled lower by currency fluctuations and weakness in Russia.",
        "date": "02162017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "REFILE-UPDATE 1-Coca-Cola HBC lifts full-year profit on lower revenue "
    },
    {
        "content": "TOKYO/BRUSSELS Heineken NV   the world's second-largest brewer  agreed on Monday to buy the loss-making Brazilian breweries of Japan's Kirin Holdings Co Ltd   boosting its presence in the world's No. 3 beer market.",
        "date": "02132017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Heineken takes battle to AB InBev in Brazil with $1 billion Kirin deal "
    },
    {
        "content": "TOKYO/BRUSSELS  Feb 13 Heineken NV  the world's second-largest brewer  agreed on Monday to buy the loss-making Brazilian breweries of Japan's Kirin Holdings Co Ltd   boosting its presence in the world's No. 3 beer market.",
        "date": "02132017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 3-Heineken takes battle to AB InBev in Brazil with $1 bln Kirin deal "
    },
    {
        "content": "JOHANNESBURG  Jan 23 Anheuser-Busch InBev   the world's largest brewer  has offered more than 1 000 employees in South Africa voluntary severance following its merger with SABMiller  the Business Day newspaper reported on Monday  citing an internal memo.",
        "date": "01232017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev offers voluntary severance in South Africa -newspaper "
    },
    {
        "content": "DAVOS  Switzerland American actor Matt Damon used Davos to drum up support for his water charity  Water.org on Tuesday  after getting a new multi-million-dollar commitment from Belgian brewer Stella Artois. | Video ",
        "date": "01182017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Matt Damon takes to Davos stage to put water on map "
    },
    {
        "content": "DAVOS  Switzerland  Jan 17 The Belgian beer brand Stella Artois is increasing its financial commitments to the water charity co-founded by actor Matt Damon  at a time that its owner  Anheuser-Busch InBev  moves into Africa  where access to clean water can be limited.",
        "date": "01172017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Stella Artois steps up work with Matt Damon's water charity "
    },
    {
        "content": "LONDON  Jan 6 Anheuser Busch InBev and Keurig Green Mountain have teamed up to develop a home appliance that could dispense alcoholic drinks in the home  similar to Keurig's existing machine for soft drinks.",
        "date": "01062017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev and Keurig to develop alcoholic drinks dispenser for the home "
    },
    {
        "content": "* Announces reference base following combination with Sabmiller",
        "date": "01062017",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-Anheuser Busch Inbev announces reference base following combination with Sabmiller "
    },
    {
        "content": "(The following statement was released by the rating agency) Link to Fitch Ratings' Report: Anheuser-Busch InBev: What Investors Want to Know https://www.fitchratings.com/site/re/890825 LONDON  November 28 (Fitch) Anheuser-Busch InBev's (ABI) commitment to  maintaining its large dividend will significantly limit the company's ability to  deleverage in the wake of its GBP79bn acquisition of SABMiller  Fitch Ratings  says.  ABI was downgraded three notches in 2016 as weaker market conditions and th",
        "date": "11282016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Fitch: AB InBev Dividend Will Limit Post-Merger Deleveraging "
    },
    {
        "content": "* Poland's state-run insurer PZU is not interested in buying a group of beer brands being sold by Anheuser-Busch InBev  which include Pilsner Urquell in the Czech Republic and Tyskie and Lech in Poland  PZU's CEO said on Thursday.",
        "date": "11102016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Poland's PZU says not interested in AB InBev beer brands "
    },
    {
        "content": "SAO PAULO 3G Capital Inc  the buyout firm controlled by Brazilian billionaire financier Jorge Paulo Lemann  is raising between $8 billion and $10 billion to finance an acquisition of a global consumer goods firm  a Brazil-based blog said on Tuesday.",
        "date": "11082016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "3G Capital raising up to $10 billion for takeover  blog says "
    },
    {
        "content": "(The following statement was released by the rating agency) MILAN/LONDON  November 09 (Fitch) Fitch Ratings has downgraded Anheuser-Busch  InBev NV/SA's (ABI) Long-Term Issuer Default Rating (IDR) to 'BBB' from 'BBB+'  and removed it from Rating Watch Negative. The Outlook is Stable. The rating  action follows ABI's merger with SABMiller plc (SABM). The agency has also downgraded SABM's IDR to 'BBB' from 'A-' and assigned a  Stable Outlook and withdrawn the rating.  The downgrade of ABI's rating",
        "date": "11092016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Fitch Downgrades Anheuseur-Busch InBev to 'BBB'; Withdraws SABMiller "
    },
    {
        "content": "SAO PAULO  Nov 8 3G Capital Inc  the buyout firm controlled by Brazilian billionaire financier Jorge Paulo Lemann  is raising between $8 billion and $10 billion to finance an acquisition of a global consumer goods firm  a Brazil-based blog said on Tuesday.",
        "date": "11082016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 1-3G Capital raising up to $10 bln for takeover  blog says "
    },
    {
        "content": "LONDON The value of merger and acquisition deals between UK companies has plunged 62 percent to a 30-year low since the country's vote to leave the European Union  according to Thomson Reuters data.",
        "date": "11072016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UK misses out in end-of-year recovery for M&A deals "
    },
    {
        "content": "* Recent deal surge earned advisers $475.91M fees - TR  Freeman",
        "date": "11072016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 1-UK misses out in end-of-year recovery for M&A deals "
    },
    {
        "content": "LONDON  Nov 3 Coca-Cola HBC reported lower quarterly sales volumes on Thursday  as poor weather in parts of Europe made for a tough comparison with strong performance a year ago.",
        "date": "11032016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Coca-Cola HBC posts lower third-quarter sales on tough comparisons "
    },
    {
        "content": "LONDON  Nov 7 The value of merger and acquisition deals between UK companies has plunged 62 percent to a 30 year-low since the country's vote to leave the European Union  according to Thomson Reuters data  in a sign of the uncertainty gripping businesses.",
        "date": "11072016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UK domestic M&A deals slump to 30 year low after Brexit vote "
    },
    {
        "content": "BRUSSELS Anheuser-Busch InBev   the world's largest brewer  reported one of its weakest quarters in years as margins collapsed in recession-hit Brazil under pressure from lower sales  delayed price increases and currency hedges.",
        "date": "10282016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev cuts revenue forecast after triple blow in Brazil "
    },
    {
        "content": "Oct 31 Constellation Brands Inc  owner of Corona and Modelo beer  said on Monday it would buy Obregon Brewery from Grupo Modelo  a subsidiary of Anheuser Busch InBev SA NV  for $600 million.",
        "date": "10312016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Constellation Brands to buy Obregon Brewery from Grupo Modelo "
    },
    {
        "content": "* Shares down 4.4 pct   (Adds detail  share price reaction  analyst)",
        "date": "10282016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 2-AB InBev cuts revenue forecast after triple blow in Brazil "
    },
    {
        "content": "Oct 31 Constellation Brands Inc  owner of Corona and Modelo beer  said on Monday it would buy a brewery in Mexico from Grupo Modelo  a subsidiary of Anheuser Busch InBev SA NV  for $600 million.",
        "date": "10312016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 1-Constellation Brands to buy Obregon Brewery from Grupo Modelo "
    },
    {
        "content": "BRUSSELS  Oct 28 Anheuser-Busch InBev  the world's largest brewer  reported lower than expected core profit in the third quarter as beer sales declined once again in its second-largest market  Brazil.",
        "date": "10282016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev cuts guidance due to weak Brazil beer market "
    },
    {
        "content": "* Total volumes declined by 0.9 pct in Q3  with our own beer volumes down by 0.2 pct",
        "date": "10282016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB Inbev Q3 total volumes down 0.9 pct  in line with Reuters poll "
    },
    {
        "content": "* Says Altria now has about 10.2 percent ownership of AB InBev",
        "date": "10212016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-Altria announces increased ownership of Anheuser-Busch InBev "
    },
    {
        "content": "LONDON  Oct 20 Asian brewers Asahi Group  and China Resources and a consortium of KKR  and Mid Europa Partners are among several parties preparing bids for a group of beer brands being sold by Anheuser-Busch InBev  sources familiar with the matter said on Thursday.",
        "date": "10202016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Asian brewers  KKR-led investors vying for East Europe beer brands-sources "
    },
    {
        "content": "HANOI  Oct 21 Habeco  one of Vietnam's biggest brewers  will list all of its shares for the first time next week  giving it a market value of $405 million  the Hanoi Stock Exchange (HNX) said on Friday.",
        "date": "10212016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 1-Vietnamese brewer Habeco plans $405 mln listing next week "
    },
    {
        "content": "LONDON  Oct 20 Bankers are preparing up to \u007f3.5bn of debt financing to back a potential sale of SABMiller's sale of its central and eastern European assets  banking sources said on Thursday.",
        "date": "10202016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "LPC-Banks prepare up to \u007f3.5bn of debt for SABMiller's CEE asset sale "
    },
    {
        "content": "* Altria becomes significant shareholder in Anheuser-Busch InBev; revises 2016 full-year earnings guidance",
        "date": "10112016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-Altria becomes significant shareholder in Anheuser-Busch InBev "
    },
    {
        "content": "* Ab inbev - expected shares in former ab inbev will be delisted from euronext brussels  bolsa mexicana de valores at opening of business on oct 11",
        "date": "10112016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev expects shares in former co to be delisted from Euronext Brussels on Oct 11 "
    },
    {
        "content": "Oct 10 Coca-Cola Co said it would exercise its right to buy Anheuser-Busch InBev's stake in bottler Coca-Cola Beverages Africa (CCBA)  following the brewer's merger with SABMiller.",
        "date": "10102016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Coca-Cola to buy AB InBev's stake in African bottler "
    },
    {
        "content": "* Anheuser-Busch Inbev announces completion of Peroni  Grolsch and Meantime disposal",
        "date": "10112016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev completes sale of SABMiller stake in Peroni  Grolsch and Meantime "
    },
    {
        "content": "* The Coca-Cola Company exercises call option to acquire Anheuser-Busch Inbev's stake in Coca-Cola Beverages Africa",
        "date": "10102016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-Coca-Cola exercises call option to acquire Anheuser-Busch Inbev's stake in Coca-Cola Beverages Africa "
    },
    {
        "content": "* Anheuser-Busch Inbev announces listing of new ordinary shares",
        "date": "10112016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB Inbev announces listing of new shares "
    },
    {
        "content": "* Anheuser-Busch InBev announces closing of Belgian offer and results of elections of SABMiller shareholders  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "10102016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev says Belgian offer for SABMiller closed on Oct 7 "
    },
    {
        "content": "HANOI  Oct 7 Vietnam's government will list all its shares of top state-owned brewers  Sabeco and Habeco  on local stock exchanges before considering allowing any international industrial buyer to take a controlling stake  a senior industry and trade ministry official said.",
        "date": "10072016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Vietnam to fully list its top brewers; no imminent strategic sale-govt official "
    },
    {
        "content": "Tokyo-based brewer Asahi Group Holdings  plans to offer more than 500 billion yen ($4.87 billion) for SABMiller Plc's  beer business in five Eastern European countries  the Nikkei business daily said.",
        "date": "10052016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Japan's Asahi to bid for SABMiller's East Europe beer brands: Nikkei "
    },
    {
        "content": "* Anheuser-Busch Inbev welcomes court sanction of UK scheme of arrangement",
        "date": "10042016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-Anheuser-Busch Inbev welcomes court sanction of UK scheme of arrangement "
    },
    {
        "content": "* Firm says not currently taking steps towards acquisition or bid",
        "date": "10052016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 1-Japan's Asahi to bid for SABMiller's East Europe beer brands - Nikkei "
    },
    {
        "content": "* High Court of Justice in England and Wales has today sanctioned scheme of arrangement from AB InBev deal",
        "date": "10042016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-SABMiller says UK Court sanctions scheme of arrangement over AB InBev deal "
    },
    {
        "content": "Anheuser-Busch InBev S.A.  the world's largest brewer  has agreed to pay $6 million to settle charges that it had violated U.S. foreign bribery laws and \"chilled a whistleblower \" the U.S. Securities and Exchange Commission said on Wednesday.",
        "date": "09302016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Anheuser-Busch to pay U.S. SEC $6 mln to settle bribery charges "
    },
    {
        "content": "* AB InBev targeting at least $1.4 bln in cost savings   (Adds comments from executives  shareholder)",
        "date": "09282016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "UPDATE 2-SABMiller investors cheer $100 bln-plus AB InBev takeover "
    },
    {
        "content": "** SABMiller shareholders overwhelmingly back brewer's $100 bln-plus takeover by Anheuser-Busch InBev   clearing the last big hurdle for merger",
        "date": "09282016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BUZZ-Molson Coors Brewing Co: SABMiller shareholders approve takeover "
    },
    {
        "content": "LONDON  Sept 28 Aberdeen Asset Management   an SABMiller shareholder that opposed the brewer's takeover by Anheuser Busch InBev  said it was \"obviously disappointed by not surprised by\" the resounding approval shareholders of SABMiller gave the deal.",
        "date": "09282016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Dissident SABMiller shareholder Aberdeen disappointed with vote "
    },
    {
        "content": "Sept 28 The following bids  mergers  acquisitions and disposals were reported by 1000 GMT on Wednesday:",
        "date": "09282016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON  Sept 28 SABMiller shareholders approved the brewer's takeover by rival Anheuser-Busch InBev  on Wednesday  paving the way for one of the biggest proposed mergers in history.",
        "date": "09282016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "SABMiller shareholders approve AB InBev takeover "
    },
    {
        "content": "* SABMiller shareholders have passed both of resolutions at UK scheme court meeting",
        "date": "09282016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-SABMiller says shareholders approve AB InBev deal "
    },
    {
        "content": "Sept 28 Anheuser-Busch InBev said on Wednesday that its shareholders approved its $100-billion-plus takeover of rival brewer SABMiller.",
        "date": "09282016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "ABInBev shareholders approve deal to buy SABMiller "
    },
    {
        "content": "LONDON  Sept 15 Investor advisory firm Glass Lewis has recommended SABMiller  shareholders vote in favor of its takeover by Anheuser-Busch InBev  adding to the likelihood of the $100 billion-plus beer mega-merger getting done.",
        "date": "09152016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Shareholder adviser Glass Lewis backs AB InBev takeover of SABMiller "
    },
    {
        "content": "MIDVAAL  South Africa  Sept 15 Heineken  plans to bring more of its premium brands into South Africa following its recent introduction of Sol Mexican lager which it hopes will increase its market share.",
        "date": "09152016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Heineken to bring more premium brands into South Africa "
    },
    {
        "content": "WARSAW Polish billionaire Sebastian Kulczyk could team up with private equity funds in a potential joint bid for SABMiller's  central and eastern European beer brands  Puls Biznesu daily said on Thursday quoting unnamed sources.",
        "date": "09152016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Polish billionaire may join race for SABMiller's east Europe brands: report "
    },
    {
        "content": "LONDON  Sept 13 Britain's shock vote to leave the European Union chilled dealmaking activity involving British companies to the lowest level in at least two decades as bosses grapple with what Brexit will cost  Thomson Reuters data shows.",
        "date": "09132016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "RPT-INSIGHT-Brexit chills M&A activity despite some big deals  data shows "
    },
    {
        "content": "WARSAW  Sept 15 Polish billionaire Sebastian Kulczyk could team up with private equity funds in a potential joint bid for SABMiller's central and eastern European beer brands  Puls Biznesu daily said on Thursday quoting unnamed sources.",
        "date": "09152016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Polish billionaire may join race for SABMiller's east Europe brands - report "
    },
    {
        "content": "* Amundi SA announces public opening position/dealing disclosure of 1.2 pct stake in Anheuser Busch Inbev SA   Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom)",
        "date": "09052016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-Amundi discloses 1.2 pct stake in Anheuser Busch InBev "
    },
    {
        "content": "BRUSSELS Anheuser-Busch InBev  expects to cut some 3 percent of its combined workforce after it has acquired rival SABMiller   according to takeover documents published on Friday. | Video ",
        "date": "08262016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev expects to cut three percent of jobs after SABMiller takeover "
    },
    {
        "content": "* Reserving judgement till Tuesday over whether SABMiller shareholders to be treated as one class in vote on AB InBev takeover  Further company coverage:     (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "08222016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-UK Court to decide on SAB's investor classes for AB InBev deal on Tuesday "
    },
    {
        "content": "* Result of SABMiller UK court directions hearing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom)",
        "date": "08232016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev notes result of SABMiller's UK court hearing "
    },
    {
        "content": "BRUSSELS  Aug 26 Anheuser-Busch InBev  expects to cut some 3 percent of its combined workforce after it has acquired rival SABMiller  according to takeover documents published on Friday.",
        "date": "08262016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev expects to cut 3 pct of jobs after SABMiller takeover "
    },
    {
        "content": "* Expects  potential job reduction of about 3 percent of total workforce of the combined group",
        "date": "08262016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-Ab inbev expects  potential job reduction of about 3 percent of total workforce of the combined group "
    },
    {
        "content": "* Result of this is that Altria and BEVCO will consent to UK scheme separately and will not vote with other SABMiller shareholders",
        "date": "08232016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-SAB says investors Altria  BEVCO to vote on AB InBev deal separately "
    },
    {
        "content": "LONDON  Aug 23 A UK court has ruled that SABMiller shareholders can be treated as two classes when they vote on the company's takeover by Anheuser Busch InBev   granting the request from the brewer for a split.",
        "date": "08232016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UK court says SABMiller shareholders can be split into two classes "
    },
    {
        "content": "LONDON Anheuser Busch InBev  managers will take all but one of 19 key positions following the brewer's $100 billion-plus takeover of rival SABMiller   according to details of the transaction announced on Thursday.",
        "date": "08042016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev to dominate top jobs after SABMiller deal "
    },
    {
        "content": "* SAB's London HQ  some regional hubs to be wound down   (Adds more details  byline  bullet points)",
        "date": "08042016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 2-AB InBev to dominate top jobs after SABMiller deal "
    },
    {
        "content": "* Combined group will be headquartered in Leuven  Belgium  and will have its global functional management office in New York.",
        "date": "08042016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev announces post-SABMiller deal leadership "
    },
    {
        "content": "Aug 4 Anheuser Busch InBev SA said the combined group after its deal to buy SABMiller Plc would be based in Leuven  Belgium  with its global functional management office in New York.",
        "date": "08042016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev  SABMiller merged entity to be based in Leuven  Belgium "
    },
    {
        "content": "BRUSSELS Anheuser-Busch InBev  and SABMiller   the world's two largest brewers  set out a timetable on Monday for the final stages of their $100 billion-plus merger  with completion of the deal expected in a little more than two months.",
        "date": "08012016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev and SABMiller expect megabrew merger to complete October 10 "
    },
    {
        "content": "* Deal completion expected Oct. 10  trading on Oct. 11   (Adds detail on timetable)",
        "date": "08012016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 1-AB InBev and SABMiller expect megabrew merger to complete Oct. 10 "
    },
    {
        "content": "* Ab inbev and sabmiller have agreed an expected timetable for implementation of combination.",
        "date": "08012016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev sees SABMiller deal to close on Oct. 10 "
    },
    {
        "content": "Aug 1 Anheuser Busch InBev and SABMiller Plc  the world's largest brewers  said they expected their merger deal to close on Oct. 10.",
        "date": "08012016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev and SABMiller say merger deal to close on Oct 10 "
    },
    {
        "content": "* Anheuser-Busch Inbev announces expected timetable and next steps in recommended combination with SABMiller",
        "date": "08012016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-Anheuser Busch Inbev announces expected timetable in SABMiller combination "
    },
    {
        "content": "Aug 1 Britain's FTSE 100 index is seen opening up 0.05 percent  according to financial bookmakers  with futures up about 0.5 percent ahead of the cash market open.",
        "date": "08012016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 2-UK Stocks-Factors to watch on Aug 1 "
    },
    {
        "content": "Aug 1 Britain's FTSE 100 index is seen opening up 0.05 percent  according to financial bookmakers  with futures up 0.33 percent ahead of the cash market open.          * The UK blue chip index closed 3.37 points higher on Friday at 6724.43   underperforming the broader European market as education publisher Pearson slumped after posting results.      * SABMILLER: Brewer Anheuser-Busch InBev cleared a major hurdle towards its takeover of SABMiller with regulatory approval from China o",
        "date": "08012016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UK Stocks-Factors to watch on Aug 1 "
    },
    {
        "content": "LONDON SABMiller  has told employees to pause the integration of  its operations with those of Anheuser-Busch InBev  as the brewer's board weighs its sweetened takeover offer  two sources familiar with the matter said.",
        "date": "07272016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "SABMiller pauses AB InBev integration amid new offer "
    },
    {
        "content": "RIO DE JANEIRO Ambev SA  a subsidiary of beverage company Anheuser Busch Inbev SA  missed quarterly profit estimates and gave up on expanding sales in Brazil this year  sending its shares to their lowest point in nearly seven months.",
        "date": "07292016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Ambev profit misses  Brazil revenue outlook flat; shares fall "
    },
    {
        "content": "LONDON  July 26 Aberdeen Asset Management   a top-10 shareholder in drinks firm SABMiller  said on Tuesday that a revised $100 billion-plus bid for the company from rival AB Inbev remained \"unacceptable\".",
        "date": "07262016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Top SABMiller shareholder says revised AB Inbev offer 'remains unacceptable' "
    },
    {
        "content": "* CEO calls for immediate halt to contact with ABI  others - memo",
        "date": "07272016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 2-SABMiller pauses AB InBev integration amid new offer "
    },
    {
        "content": "RIO DE JANEIRO  July 29 Ambev SA  a subsidiary of beverage company Anheuser Busch Inbev SA  missed quarterly profit estimates and gave up on expanding sales in Brazil this year  sending its shares to their lowest point in nearly seven months.",
        "date": "07292016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 2-Ambev profit misses  Brazil revenue outlook flat; shares fall "
    },
    {
        "content": "* Notes announcement by AB InBev that it has made a revised and final offer for entire issued and to be issued share capital of SABMiller",
        "date": "07262016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-SABMiller says to continue review revised AB InBev offer "
    },
    {
        "content": "* SABmiller said to order halt to integration work with AB Inbev - CNBC  citing a report  Further company coverage: [SAB.L ABI.BR]   (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "07272016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-SABmiller said to order halt to integration work with AB InBev - CNBC  citing a report "
    },
    {
        "content": "LONDON/BRUSSELS The board of brewer SABMiller  will recommend its shareholders approve a sweetened takeover offer by Anheuser-Busch InBev   the company said on Friday  capping a week of high drama about the fate of the consumer industry's biggest-ever merger.",
        "date": "07292016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "SABMiller backs AB InBev offer for biggest-ever consumer takeover "
    },
    {
        "content": "LONDON  July 26 Brewer Anheuser-Busch InBev  has sweetened the terms of its $100 billion-plus takeover offer for SABMiller after a fall in sterling since Britain's vote to leave the European Union and a rise in AB InBev's shares reduced the attractiveness of the original terms for SABMiller shareholders.",
        "date": "07262016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Brewer AB InBev boosts offer for rival SABMiller "
    },
    {
        "content": "The board of brewer SABMiller will recommend its shareholders approve a sweetened takeover offer by Anheuser Busch InBev  the company said on Friday  capping a week of high drama about the fate of the consumer industry's biggest-ever merger.",
        "date": "07292016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "SABMiller backs AB InBev offer for biggest-ever consumer merger "
    },
    {
        "content": "* Each SABMiller shareholder will now be entitled to receive: for each SABMiller share: £45.00 in cash",
        "date": "07262016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "CORRECTED-BRIEF-AB InBev offers 45 stg in cash for each SABMiller share "
    },
    {
        "content": "LONDON  July 29 Fund manager Aberdeen Asset Management reiterated on Friday it would vote against the takeover of SABMiller by Belgian rival AB Inbev  after the company said it backed the revised terms.",
        "date": "07292016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Aberdeen Asset Management says will vote against SABMiller  AbInbev deal "
    },
    {
        "content": "* Ab InBev believes that proposed combination represents a compelling opportunity for all SABMiller and AB InBev shareholders  Source text for Eikon:  Further company coverage:",
        "date": "07292016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev says welcomes SABMiller's board recommendation for offer "
    },
    {
        "content": "WASHINGTON  July 20 The U.S. Justice Department said on Wednesday it had agreed to a settlement with Anheuser-Busch InBev SA that will permit ABI to proceed with its acquisition of SABMiller Plc.",
        "date": "07202016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "U.S. Justice Department says it approves SABMiller  ABI deal "
    },
    {
        "content": "* SABMiller board recommendation of AB Inbev revised and final offer",
        "date": "07292016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-SABMiller board to recommend final AB InBev offer "
    },
    {
        "content": "* Says owns 1.03 mln ordinary shares of Anheuser-Busch InBev SA/NV as of July 14",
        "date": "07152016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-Elliott Capital Advisors discloses latest AB InBev stake "
    },
    {
        "content": "July 20 Anheuser-Busch InBev SA has secured U.S. antitrust approval for its takeover of SABMiller Plc  after the  Budweiser maker agreed to give up ownership of the Miller brand  Bloomberg reported  citing people familiar with the matter.",
        "date": "07202016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev set to win U.S. antitrust approval for SABMiller deal - BBG "
    },
    {
        "content": "LONDON SABMiller  has not ruled out asking Anheuser-Busch InBev  to revamp its proposed $100 billion-plus takeover offer before formally recommending the bid  a source close to the London-listed brewer told Reuters  amid rising shareholder disquiet about the terms.",
        "date": "07202016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "SABMiller board to weigh AB InBev takeover terms as shareholder meeting looms: source "
    },
    {
        "content": "LONDON  July 29 The board of brewer SABMiller  will recommend shareholders approve the final takeover offer by Anheuser Busch InBev  the company said on Friday.",
        "date": "07292016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "SABMiller board to recommend final AB InBev offer "
    },
    {
        "content": "SABMiller's board will review its $107 billion merger deal with Anheuser Busch InBev once all regulatory approvals have been secured  its chairman said on Thursday.",
        "date": "07212016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "SABMiller to scrutinize AB InBev mega-deal after regulator approval - chairman "
    },
    {
        "content": "* Board has now met formally to consider revised and final offer for entire issued and to be issued share capital of SABMiller as announced by Anheuser-Busch Inbev SA/NV on July 26 2016",
        "date": "07292016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-SABMiller says board to recommend final AB InBev offer "
    },
    {
        "content": "LONDON SABMiller's  board will review its $107 billion merger deal with Anheuser Busch InBev  once all regulatory approvals have been secured  its chairman said on Thursday.",
        "date": "07212016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "SABMiller says to review AB InBev deal once approved by regulators "
    },
    {
        "content": "* Chairman du Plessis defends takeover's PSA structure   (Adds Breakingviews link)",
        "date": "07212016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 2-SABMiller says to review AB InBev deal once approved by regulators "
    },
    {
        "content": "* SABMiller awaiting China preconditions before scrutinising terms",
        "date": "07212016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "SABMiller to scrutinise AB InBev mega-deal after regulator approval - chairman "
    },
    {
        "content": "* SABMiller chairman Jan du Plessis says will make a point of asking AB Inbev for issue of Ab Inbev shares in order to conduct share swap for SABMiller shareholders as part of takeover  Source text for Eikon:  Further company coverage: [ ]   (Reporting by Freya Berry  writing by Pamela Barbaglia)",
        "date": "07212016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-SABMiller to ask for issue of AB Inbev shares to conduct share swap for SABMiller shareholders - chairman "
    },
    {
        "content": "NEW YORK Brewers Anheuser-Busch InBev  and SABMiller  received U.S. antitrust approval for their $107 billion merger on Wednesday  bringing the largest-ever consumer products deal a big step closer to completion.",
        "date": "07212016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev  SABMiller deal wins U.S. approval  adds craft beer protections "
    },
    {
        "content": "BRUSSELS Anheuser-Busch InBev  said on Wednesday it welcomed the approval of its takeover of SABMiller  by the United States Department of Justice  and reaffirmed its intention to close the deal by the end of the year.",
        "date": "07212016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev says welcomes U.S. approval of SABMiller deal "
    },
    {
        "content": "NEW YORK  July 21 Brewers Anheuser-Busch InBev  and SABMiller received U.S. antitrust approval for their $107 billion merger on Wednesday  bringing the largest-ever consumer products deal a big step closer to completion.",
        "date": "07212016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 5-AB InBev  SABMiller deal wins U.S. approval  adds craft beer protections "
    },
    {
        "content": "LONDON Brewer SABMiller   in the process of being bought by Anheuser-Busch InBev   reported lower quarterly revenue on Thursday  hurt by tough conditions in some African markets.",
        "date": "07212016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "SABMiller sales hurt by economic volatility in Africa "
    },
    {
        "content": "* Conditions include no employee be laid off   (Adds analyst  CEO comment  details)",
        "date": "06302016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "UPDATE 2-South Africa clears AB InBev's takeover of SABMiller "
    },
    {
        "content": "BRUSSELS EU antitrust regulators will investigate whether brewer Anheuser-Busch InBev  is illegally blocking cheaper imports of its own beer into the Belgian market  the European Commission said on Thursday.",
        "date": "06302016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "EU opens investigation into AB InBev Belgian beer practices "
    },
    {
        "content": "* Welcomes clearance decision in South Africa for proposed combination with Sabmiller",
        "date": "06302016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-Ab Inbev welcomes clearance decision in South Africa for proposed combination with Sabmiller "
    },
    {
        "content": "* S.African authorities have given conditional approval to deal",
        "date": "06232016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "South Africa's union threatens to strike over SABMiller scheme "
    },
    {
        "content": "* Approves Anheuser-Busch InBev merger with SABMiller with attached conditions",
        "date": "06302016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-S. Africa's Competition Tribunal approves AB InBev  SABMiller deal "
    },
    {
        "content": "JOHANNESBURG  June 7 South Africa's Competition Tribunal will hold hearings over the proposed $100 billion-plus merger by brewer Anheuser-Busch Inbev and SABMiller  in June  it said on Tuesday.",
        "date": "06072016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "REFILE-South Africa's competition tribunal to hold hearings over AB Inbev and SABMiller merger "
    },
    {
        "content": "* Provides details on its proposal to enhance SAB's broad-based black economic empowerment scheme (\"Zenzele\" / \"Zenzele Scheme\"",
        "date": "06072016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-Ab Inbev details proposal for SAB's broad-based black economic empowerment scheme "
    },
    {
        "content": "June 1 The U.S. Justice Department is set to approve Anheuser-Busch InBev SA's takeover of SABMiller Plc later this month  in an agreement that may include measures to keep the merged entity from edging craft brewers out of the market  Bloomberg reported  citing people familiar with the matter.",
        "date": "06012016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev-SABMiller deal set to gain U.S. approval - Bloomberg "
    },
    {
        "content": "* U.S. Justice Department is close to approving AB InBev-Sabmiller deal - Bloomberg  citing sources",
        "date": "06012016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-U.S. Justice Department is close to approving AB InBev-Sabmiller deal - Bloomberg "
    },
    {
        "content": "* Competition Commission of South Africa makes recommendation to the Competition Tribunal",
        "date": "06012016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-SABMiller says S.Africa's Competition Commission has recommended Ab Inbev deal with conditions "
    },
    {
        "content": "* South African Reserve Bank grants exchange control approval for proposed combination between AB InBev and SABMiller  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "05252016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev says South Africa's Reserve Bank grants exchange control approval for SAB deal "
    },
    {
        "content": "* \"With this clearance  we remain firmly on track for a closing in second half of 2016\" - CEO of AB InBev.",
        "date": "05242016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-Anheuser Busch InBev says welcomes EU clearance for SABMiller deal "
    },
    {
        "content": "WASHINGTON U.S. antitrust officials are investigating Anheuser-Busch InBev  over its new incentives that encourage independent distributors to sell more of its own beer brands at the expense of competing craft brews  two people with knowledge of the matter said.",
        "date": "05252016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Exclusive: U.S. queries AB InBev on distribution incentives amid merger probe "
    },
    {
        "content": "BRUSSELS  May 24 - EU antitrust regulators approved on Tuesday Anheuser-Busch InBev's $100 billion-plus takeover of SABMiller on condition that it sell almost the whole of SABMiller's beer business in Europe.",
        "date": "05242016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "EU regulators clear $100 bln-plus AB InBev  SABMiller deal "
    },
    {
        "content": "* Q1 sales fall 3 pct to 13.01 bln DKK  missing 13.18 seen in poll",
        "date": "05112016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 1-Carlsberg's Q1 sales hit by China decline  currency headwind "
    },
    {
        "content": "SAO PAULO  May 12 Brazilian drinks company Ambev SA agreed to hand off operations in Peru  Colombia and Ecuador to its parent company Anheuser-Busch InBev SA   according to a securities filing on Thursday.",
        "date": "05122016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Brazil's Ambev passes Peru  Colombia  Ecuador ops to AB InBev "
    },
    {
        "content": "May 10 What could be more American than standing in a backyard at a barbecue while holding a beer on the Memorial Day weekend in the United States? Budweiser thinks it has the answer: Holding a beer called America.",
        "date": "05102016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 1-Budweiser renames itself 'America' to inspire drinkers "
    },
    {
        "content": "BRUSSELS  May 10 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "05102016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "EU mergers and takeovers (May 10) "
    },
    {
        "content": "(The following statement was released by the rating agency) MOSCOW/MILAN/LONDON  May 06 (Fitch) Fitch Ratings has downgraded Anheuser-Busch  InBev's (ABI) Long-Term Foreign and Local Currency Issuer Default Ratings (IDRs)  and senior unsecured ratings to 'BBB+' from 'A' and its Short-Term IDR to 'F2'  from 'F1'. The ratings remain on Rating Watch Negative (RWN) pending completion  of the planned acquisition of SABMiller plc (SABM). A full list of rating  actions is shown at the end of this comme",
        "date": "05062016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Fitch Downgrades ABI to 'BBB+'; Rating Watch Negative "
    },
    {
        "content": "* Announces a solicitation of participation to general bondholder meetings",
        "date": "05062016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev launches a noteholder consent solicitation process "
    },
    {
        "content": "SYDNEY Australia's antitrust regulator on Thursday cleared beer giant Anheuser Busch Inbev SA's planned $100 billion takeover of rival SABMiller Plc  saying the deal would not adversely affect the domestic market.",
        "date": "05052016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Australia clears AB Inbev's $100 billion SABMiller buyout plan "
    },
    {
        "content": "* AB InBev updates package of commitments with offer to divest SABMiller's central and eastern european operations",
        "date": "04292016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-SABMiller says AB InBev to sell some of SAB's asset for EU nod "
    },
    {
        "content": "* Q1 normalized profit (equity holders AB Inbev) 844 million USD versus 1.34 billion USD in Reuters Poll",
        "date": "05042016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-AB Inbev Q1 results below Reuters Poll estimates "
    },
    {
        "content": "SAO PAULO  April 22 Citigroup Inc and U.S. Bancorp have agreed to sell Brazilian card payment processing joint venture Elavon do Brasil to a local rival for an undisclosed sum  ending months of negotiations to exit the money-losing company.",
        "date": "04222016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 1-Citigroup  U.S. Bancorp exit money-losing Brazil card venture "
    },
    {
        "content": "SAN FRANCISCO  April 22 Boston Beer Company  shares slumped on Friday after the brewer of Sam Adams posted quarterly revenue below Wall Street's expectations and warned that it lost business to a growing legion of small craft brewers.",
        "date": "04222016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Boston Beer slumps as Wall Street loses thirst "
    },
    {
        "content": "* S&P On Anheuser Busch InBev - Belgium-Based Anheuser-Busch InBev 'A-/A-2' ratings affirmed; outlook stable",
        "date": "04192016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-S&P - Belgium-Based Anheuser-Busch InBev 'A-/A-2' ratings affirmed; outlook stable "
    },
    {
        "content": "JOHANNESBURG Anheuser-Busch InBev  will invest 1 billion rand ($69 million) to support small South African farmers as part of concessions agreed with the government to secure regulatory approval for its $100 billion-plus takeover of SABMiller   it said on Thursday.",
        "date": "04152016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev agrees to concessions with South Africa over SAB deal "
    },
    {
        "content": "* S&P - U.K.-based SABMiller 'A-/A-2' ratings affirmed; outlook stable",
        "date": "04192016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-S&P - U.K.-based SABMiller 'A-/A-2' ratings affirmed; outlook stable "
    },
    {
        "content": "LONDON  April 19 Anheuser-Busch InBev  the brewer which is in the process of acquiring rival SABMiller   said it accepted an offer from Japan's Asahi Group  for Peroni and a group of other SAB beer brands.",
        "date": "04192016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Anheuser-Busch InBev accepts Asahi offer for SAB's Peroni "
    },
    {
        "content": "* Anheuser Busch InBev-Controlling shareholders to extend agreement with additional term of 10 years until 2034 subject to completion of SABMiller deal  Source text (http://1.usa.gov/1N7ahWT)",
        "date": "04122016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-Anheuser Busch InBev-controlling shareholders to extend agreement with additional term of 10 years until 2034 subject to completion of SABMiller deal "
    },
    {
        "content": "BRUSSELS/LONDON - Anheuser-Busch InBev  has formally informed European Union antitrust regulators of its plan to sell SABMiller's  premium European brands to try to secure approval for its $100 billion-plus takeover of the London-based brewer.",
        "date": "04122016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB Inbev offers concessions in bid to win EU okay for SABMiller buy "
    },
    {
        "content": "BRUSSELS/LONDON  April 12 - Anheuser-Busch InBev  has formally informed European Union antitrust regulators of its plan to sell SABMiller's premium European brands to try to secure approval for its $100 billion-plus takeover of the London-based brewer.",
        "date": "04122016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 1-AB Inbev offers concessions in bid to win EU okay for SABMiller buy "
    },
    {
        "content": "JOHANNESBURG/LONDON South Africa's competition watchdog wants to extend the deadline again for its investigation of Anheuser-Busch InBev's  planned $106 billion takeover of SABMiller   raising the possibility of a delay for the beer industry's biggest-ever deal.",
        "date": "04042016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "South Africa still wants more time to scrutinize SAB  AB InBev deal "
    },
    {
        "content": "April 4 Anheuser Busch Inbev SA has been sued by a U.S. beer drinker who claimed he was duped into believing its Leffe brand beer was brewed in a Belgian abbey  rather than mass produced in an automated factory that also makes Stella Artois.",
        "date": "04042016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Anheuser's Leffe is not Belgian 'abbey' beer - U.S. lawsuit "
    },
    {
        "content": "Anheuser Busch Inbev SA  has been sued by a U.S. beer drinker who claimed he was duped into believing its Leffe brand beer was brewed in a Belgian abbey  rather than mass produced in an automated factory that also makes Stella Artois.",
        "date": "04042016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Anheuser's Leffe is not Belgian 'abbey' beer: U.S. lawsuit "
    },
    {
        "content": "* Today that it has completed pricing of EUR 13.25 billion aggregate principal amount of notes",
        "date": "03172016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-Anheuser-Busch InBev completes pricing of 13.25 bln euros notes "
    },
    {
        "content": "LONDON  March 16 (IFR) - Anheuser-Busch InBev is expected to raise at least \u007f11.75bn from a six-part bond issue on Wednesday with demand surpassing \u007f28bn  according to a lead bank.",
        "date": "03162016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev attracts over \u007f28bn of demand for jumbo financing "
    },
    {
        "content": "LONDON  March 16 (IFR) - Anheuser-Busch InBev has started marketing a six-part euro benchmark deal for a minimum \u007f6bn size  according to a lead bank.",
        "date": "03162016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB Inbev starts marketing six-part euro bond "
    },
    {
        "content": "HONG KONG/LONDON China Resources Beer has agreed to buy SABMiller's  stake in their CR Snow venture for a less-than-expected $1.6 billion  removing another regulatory obstacle to the London-based brewer's takeover by Anheuser-Busch InBev .",
        "date": "03022016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "China Resources to buy SABMiller's Snow stake  easing AB InBev deal "
    },
    {
        "content": "* AB InBev  SABMiller shares little changed   (Releads  adds analyst comments  share activity)",
        "date": "03022016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 2-China Resources to buy SABMiller's Snow stake  easing AB InBev deal "
    },
    {
        "content": "* Says Anheuser-Busch InBev enters into agreement to sell SABMiller's interest in China Resources Snow Breweries",
        "date": "03022016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev says to dispose SABMiller's stake in China Resource Snow for $1.6 bln "
    },
    {
        "content": "HONG KONG  March 2 Shares of China Resources Beer (Holdings) Co Ltd are set to open 25.2 percent higher on Wednesday after the Chinese brewer said it would buy a 49 percent stake in China Resources Snow Breweries in a bid to gain full ownership of the country's top beer brand.",
        "date": "03022016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "China Resources Beer jumps on deal to buy $1.6 bln stake in Snow "
    },
    {
        "content": "* Sees challenges in Brazil  China  strong Mexico   (Adds Breakingviews link)",
        "date": "02252016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "UPDATE 3-AB InBev suffers in U.S. ahead of SABMiller takeover "
    },
    {
        "content": "BERLIN  Feb 25 A German environmental group said on Thursday it has found traces of the widely used weed-killer ingredient glyphosate in Germany's 14 most popular beers  a potential blow to the country's reputation for \"pure\" brewing.",
        "date": "02252016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "German beer purity in question after environment group finds weed-killer traces "
    },
    {
        "content": "* Total volume in Q4 reaches \u007f\u007f111.4 million hls; 114 mlh hls in Reuters poll\u007f\u007f",
        "date": "02252016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-Anheuser Busch Inbev total volume in Q4 reaches \u007f\u007f111.4 million hls "
    },
    {
        "content": "* AB InBev seeking antitrust approval for SABMiller takeover   (Adds financial details from source)",
        "date": "02102016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "UPDATE 4-Japan's Asahi closes in on SABMiller's Peroni and Grolsch "
    },
    {
        "content": "* AB Inbev receives a binding offer from Asahi Group Holdings Ltd to acquire part of Sabmiller's European business",
        "date": "02102016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev gets binding offer from Asahi for Peroni  Grolsch "
    },
    {
        "content": "TOKYO  Feb 10 Japan's Asahi Group Holdings said on Wednesday it had reached a preliminary agreement with Anheuser-Busch InBev to buy four of SABMiller's  units  including its Peroni and Grolsch brands  for around 329.7 billion yen ($2.9 billion).",
        "date": "02102016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Japan's Asahi in preliminary pact to buy four SABMiller units for $2.9 bln "
    },
    {
        "content": "NEW YORK  Jan 27 (IFR) - Molson Coors Brewing expects to issue up to US$6.8bn of notes to help fund its planned US$12bn acquisition of the Miller beer brands from AB InBev  according to an SEC filing.",
        "date": "01272016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Molson eyes US$6.8bn bond to fund Miller purchase "
    },
    {
        "content": "Anheuser-Busch InBev  said on Thursday that it had canceled $42.5 billion of a record $75 billion senior acquisition loan after raising a hugely successful bond which was used to repay part of the loan.",
        "date": "01282016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev cancels $42.5 billion of acquisition loans after bond issue "
    },
    {
        "content": "* AB InBev announces partial cancellation of usd 75.0 billion committed senior acquisition facilities\u007f",
        "date": "01282016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev says partial cancellation of $75 bln committed senior acquisition facilities\u007f "
    },
    {
        "content": "BANGKOK  Jan 25 Thai Beverage has used its Singapore-listed unit Fraser and Neave to bid for SABMiller's Peroni and Grolsch beer brands  the Thai firm's Chief Executive Thapana Sirivadhanabhakdi said on Monday.",
        "date": "01252016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 1-Thai Bev says F&N bids for Peroni  Grolsch beer brands "
    },
    {
        "content": "Jan 20 Goldman Sachs Group Inc  the 2015 M&A champion  is putting a brave face on the prospects for its dealmaking business this year even with markets plunging.",
        "date": "01202016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Goldman Sachs sees M&A business weathering market slump "
    },
    {
        "content": "NEW YORK  Jan 15 (IFR) - Allocations have long been one of the touchier subjects in the bond business  but there was little complaining about this week's US$46bn deal  the second-largest ever  from AB InBev.",
        "date": "01152016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "No allocation fuss over AB InBev US$46bn bond "
    },
    {
        "content": "NEW YORK  Jan 12 (IFR) - Investors could easily soak up a US$60bn bond from AB InBev if the beer giant wants to sell that much debt this week to help fund its acquisition of rival brewer SABMiller.",
        "date": "01122016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Bond investors hope AB InBev will wet their whistles "
    },
    {
        "content": "NEW YORK  Jan 13 (IFR) - Brewing giant AB InBev on Wednesday announced its much-awaited bond to help finance its purchase rival SABMiller  an up to eight-part jumbo deal expected to price later in the day.",
        "date": "01132016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "UPDATE 1-AB InBev announces up to 8-part jumbo bond "
    },
    {
        "content": "NEW YORK  Jan 13 (IFR) - Brewing giant AB InBev on Wednesday announced its much-awaited bond to help finance its purchase rival SABMiller  an up to eight-part jumbo deal expected to price later in the day.   (Reporting by Mike Gambale; Editing by Marc Carnegie)",
        "date": "01132016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB Inbev announces up to 8-part jumbo bond "
    },
    {
        "content": "* \u007fJSE has granted co secondary listing by way of introduction of all its shares on main board of exchange operated by JSE\u007f",
        "date": "01082016",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev says to list in Johannesburg on Jan. 15 "
    },
    {
        "content": "WASHINGTON Anheuser-Busch InBev   the world's biggest brewer  faced tough questions on Tuesday from U.S. lawmakers unhappy over its plan to buy SABMiller  due to concerns the deal will hurt the fast-growing U.S. craft beer industry.",
        "date": "12092015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Lawmakers worry AB InBev beer deal will hurt craft brewers "
    },
    {
        "content": "WASHINGTON  Dec 8 Anheuser-Busch InBev  the world's biggest brewer  faced tough questions on Tuesday from U.S. lawmakers unhappy over its plan to buy SABMiller  due to concerns the deal will hurt the fast-growing U.S. craft beer industry.",
        "date": "12082015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "U.S. lawmakers worry AB InBev beer deal will hurt craft brewers "
    },
    {
        "content": "* Heineken still market leader in Italy  Netherlands  UK   (Updates with potential buyers)",
        "date": "12032015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "UPDATE 2-AB InBev seeks to sell SABMiller's Grolsch  Peroni brands "
    },
    {
        "content": "BRUSSELS  Dec 3 Anheuser-Busch InBev is looking to sell SABMiller's Grolsch and Peroni brands in what it said was a bid to address potential EU antitrust concerns over its planned acquisition of the world's second largest brewer.",
        "date": "12032015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev seeks to sell SABMiller's Grolsch  Peroni brands "
    },
    {
        "content": "WASHINGTON Anheuser-Busch InBev's bid to buy its biggest rival  SABMiller  will be the subject of a U.S. Senate hearing next week  the Senate Judiciary Committee said on Monday.",
        "date": "11302015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Senate calls hearing in Anheuser-Busch InBev mega beer deal "
    },
    {
        "content": "* Anheuser-Busch InBev exploring sale of part of SABMiller's European business",
        "date": "12032015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev says exploring sale of part of SABMiller's European business "
    },
    {
        "content": "WASHINGTON  Nov 30 Anheuser-Busch InBev's  bid to buy its biggest rival  SABMiller  will be the subject of a U.S. Senate hearing next week  the Senate Judiciary Committee said on Monday.",
        "date": "11302015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "U.S. senate calls hearing in Anheuser-Busch InBev mega beer deal "
    },
    {
        "content": "Anheuser-Busch InBev is planning to sell the Peroni and Grolsch brands it would gain from its acquisition of SABMiller to head off European regulatory concerns over the 71 billion pounds ($107 billion) brewery merger  the Financial Times said on Sunday.",
        "date": "11302015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Anheuser-Busch InBev to sell Peroni  Grolsch to smooth merger: FT "
    },
    {
        "content": "Nov 29 Anheuser-Busch InBev is planning to sell the Peroni and Grolsch brands it would gain from its acquisition of SABMiller to head off European regulatory concerns over the 71 billion pounds ($107 billion) brewery merger  the Financial Times said on Sunday.",
        "date": "11302015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Anheuser-Busch InBev to sell Peroni  Grolsch to smooth merger -FT "
    },
    {
        "content": "LONDON  Nov 12 Brewer SABMiller reported higher underlying sales for the second quarter on Thursday  a day after larger rival Anheuser-Busch InBev launched a $100 billion-plus takeover bid for it.",
        "date": "11122015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "SABMiller reports second-quarter acceleration as forex weighs "
    },
    {
        "content": " (This November 11 story has been corrected to change maturity of bridge loan to one year from two years in paragraphs 9 and 11)",
        "date": "11132015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev backs SABMiller buy with record $75 billion loan "
    },
    {
        "content": "The following company announcements  scheduled economic indicators  debt and currency market moves and political events may affect South African markets on Thursday.",
        "date": "11122015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "South African Markets - Factors to watch on Nov 12 "
    },
    {
        "content": "BRUSSELS/LONDON Anheuser-Busch InBev   the world's biggest brewer  launched its $100 billion-plus offer for nearest rival SABMiller  on Wednesday and agreed to sell the latter's stake in U.S. venture MillerCoors to help win regulatory approval. | Video ",
        "date": "11132015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev launches SAB bid  to sell MillerCoors stake "
    },
    {
        "content": "Nov 11 The following bids  mergers  acquisitions and disposals were reported by 2120 GMT on Wednesday:",
        "date": "11112015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "LONDON  Nov 11 AB InBev is backing its $100 billion-plus bid for SABMiller with a record $75 billion syndicated loan  which is the largest commercial loan in the history of the global loan markets  adviser to the lenders Allen & Overy said on Wednesday.",
        "date": "11132015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "CORRECTED-UPDATE 2-LPC-AB InBev backs SABMiller buy with record $75 bln loan "
    },
    {
        "content": "BRUSSELS/LONDON Anheuser-Busch InBev   the world's biggest brewer  launched its $100 billion-plus offer for nearest rival SABMiller  on Wednesday and agreed to sell the latter's stake in U.S. venture MillerCoors to help win regulatory approval. | Video ",
        "date": "11112015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev launches SAB bid  to sell MillerCoors stake "
    },
    {
        "content": "RIO DE JANEIRO  Nov 10 Ambev SA  the Brazilian unit of Belgium's Anheuser-Busch InBev SA  said on Tuesday it agreed to buy the Canadian rights to beer and cider brands owned by Canada's Mark Anthony Group for $350 million.",
        "date": "11102015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "InBev's Brazil unit buys Canadian beer  cider brands for $350 mln "
    },
    {
        "content": "* Role of Director of Integrated Supply and Human Resources would be split into two new positions on SABMiller's executive committee",
        "date": "11132015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-SABMiller says Philip Hodges will not take up his position as Group Director "
    },
    {
        "content": "LONDON  Nov 11 Britain's top equity index advanced on Wednesday  lifted by credit data company Experian  and SABMiller  which rose after AB InBev  launched its $100 billion-plus bid for SAB.",
        "date": "11112015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Britain's FTSE lifted higher by Experian and SABMiller "
    },
    {
        "content": "COPENHAGEN Carlsberg's  new chief executive said on Wednesday the company would not be interested in buying China's top beer brand  CR Snow  should regulators demand its sale as a part of  Anheuser-Busch InBev's  takeover of SABMiller .",
        "date": "11112015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Carlsberg not eyeing China's top beer  should InBev-SABMiller sell "
    },
    {
        "content": "* Molson Coors to buy SAB stake in MillerCoors for $12 bln   (Updates with further reaction)",
        "date": "11112015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 4-AB InBev launches SAB bid  to sell MillerCoors stake "
    },
    {
        "content": "LONDON  Nov 11 Britain's top equity index advanced on Wednesday  lifted by credit data company Experian  and SABMiller  which rose after AB InBev  launched its $100 billion-plus bid for SAB.",
        "date": "11112015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Britain's FTSE climbs as Experian and SABMiller rally "
    },
    {
        "content": "LONDON AB InBev  is backing its $100 billion-plus bid for SABMiller  with a record $75 billion syndicated loan  which is the largest commercial loan in the history of the global loan markets  adviser to the lenders Allen & Overy said on Wednesday.",
        "date": "11112015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev backs SABMiller buy with record $75 billion loan "
    },
    {
        "content": "BRUSSELS Brewer SABMiller Plc  has extended the deadline for rival Anheuser-Busch InBev  to make a formal $100 billion-plus takeover offer by a further week in order to finalize shareholder support for the deal.",
        "date": "11042015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev  SABMiller extend takeover deadline to November 11 "
    },
    {
        "content": "LONDON  Nov 11 AB InBev is backing its $100 billion-plus bid for SABMiller with a record $75 billion syndicated loan  which is the largest commercial loan in the history of the global loan markets  adviser to the lenders Allen & Overy said on Wednesday.",
        "date": "11112015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 2-LPC-AB InBev backs SABMiller buy with record $75 bln loan "
    },
    {
        "content": "* Deal currently worth $107 bln  fourth biggest ever   (Adds details on deadline extension)",
        "date": "11042015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 1-AB InBev  SABMiller extend takeover deadline to Nov. 11 "
    },
    {
        "content": "* SABMiller and AB InBev have made good progress in agreeing terms of possible offer which will be set out in detail in any announcement of a firm intention to make an offer",
        "date": "11042015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-SABMiller  AB InBev seek extension of takeover deadline "
    },
    {
        "content": "BRUSSELS  Nov 4 Brewer SABMiller Plc has extended the deadline for rival Anheuser-Busch InBev to make a formal $100 billion-plus takeover offer by a further week.",
        "date": "11042015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev  SABMiller extend takeover deadline to Nov. 11 "
    },
    {
        "content": "LONDON  Nov 11 AB InBev is backing its $100 billion-plus bid for SABMiller with a record $75 billion syndicated loan  which is the largest commercial loan in the history of the global loan markets  adviser to the lenders Allen & Overy said on Wednesday.",
        "date": "11112015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "LPC-AB InBev backs SABMiller buy with record US$75bn loan "
    },
    {
        "content": "* Reports Q3 revenue $11.38 billion compared to $12.24 billion a year ago",
        "date": "10302015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-Anheuser-Busch Inbev reports Q3 results in organic growth "
    },
    {
        "content": "BRUSSELS Brewer SABMiller Plc  has extended the deadline for rival Anheuser-Busch InBev  to make a formal $100 billion-plus takeover offer by a week.",
        "date": "10282015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev  SABMiller extend takeover deadline to Nov. 4 "
    },
    {
        "content": "LONDON SABMiller Plc  plans to ask UK regulators to extend again the deadline for Anheuser-Busch InBev NV  to make a formal takeover offer  Bloomberg reported  citing people familiar with the negotiations.",
        "date": "10272015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "SABMiller to seek extension for AB InBev bid deadline: Bloomberg "
    },
    {
        "content": "DUBLIN  Oct 28 Irish cider maker C&C has no plans to retreat from its less profitable U.S. and English operations  the chief executive of the Irish company said on Wednesday  rebuffing an activist investor's call to focus its efforts on Ireland and Scotland.",
        "date": "10282015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Cider maker C&C says no plan to retreat from U.S.  English markets "
    },
    {
        "content": "LONDON  Oct 27 SABMiller Plc plans to ask UK regulators to extend again the deadline for Anheuser-Busch InBev NV to make a formal takeover offer  Bloomberg reported  citing people familiar with the negotiations.",
        "date": "10272015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 1-SABMiller to seek extension for AB InBev bid deadline -Bloomberg "
    },
    {
        "content": "* SABMiller shareholders entitled to any dividends declared by SABMiller prior to completion of transaction  Source text for Eikon:  Further company coverage:",
        "date": "10282015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB InBev  SABMiller extend takeover deadline to Nov 4 "
    },
    {
        "content": "Oct 27 SABMiller Plc plans to ask UK regulators to again extend the deadline for Anheuser-Busch InBev NV to make a formal takeover offer  Bloomberg reported  citing people familiar with the negotiations.",
        "date": "10272015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "SABMiller to ask UK regulators to extend AB InBev offer deadline- Bloomberg "
    },
    {
        "content": "BRUSSELS  Oct 28 Brewer SABMiller Plc  has extended the deadline for rival Anheuser-Busch InBev  to make a formal $100 billion-plus takeover offer by a week.",
        "date": "10282015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 1-AB InBev  SABMiller extend takeover deadline to Nov 4 "
    },
    {
        "content": "BRUSSELS  Oct 28 Brewer SABMiller Plc  has extended the deadline for rival Anheuser-Busch InBev  to make a formal $100 billion-plus takeover offer by a week.",
        "date": "10282015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev  SABMiller extend takeover deadline to Nov 4 "
    },
    {
        "content": "LONDON Oct 28 Britain's FTSE 100 index is seen opening 1 to 4 points higher  or up as much as 0.1 percent on Wednesday  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The UK blue chip index closed 0.8 percent lower on Tuesday at 6 365.27 points.      * SABMILLER - SABMiller Plc plans to ask UK regulators to extend again the deadline for Anheuser-Busch InBev NV to make a formal takeover offer  Bloomberg reported  citin",
        "date": "10282015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UK Stocks-Factors to watch on Wednesday Oct 28 "
    },
    {
        "content": "MIAMI  Oct 20 Anheuser-Busch will pay up to $28 million to settle a class action lawsuit over Beck's brand labeling that consumers said falsely led them to believe the beer was brewed in Germany under an agreement approved in Florida federal court on Tuesday.",
        "date": "10202015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Anheuser-Busch to pay up to $28 million over Beck's labeling "
    },
    {
        "content": "WASHINGTON  Oct 20 The U.S. Senate Judiciary Committee's antitrust subcommittee will hold a hearing to discuss Anheuser-Busch Inbev SA's plans to buy rival SABMiller PLC  two senators said on Tuesday.",
        "date": "10202015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "U.S. senators announce hearing on AB InBev's planned purchase of SABMiller "
    },
    {
        "content": "JOHANNESBURG The planned takeover of SABMiller   by Anheuser-Busch InBev  should comply with conditions imposed by South Africa on SABMiller when it relocated its head office to Britain in 1999  South Africa's National Treasury said on Thursday.",
        "date": "10152015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "South Africa says SABMiller takeover by AB InBev should comply with conditions "
    },
    {
        "content": "JOHANNESBURG  Oct 15 The planned takeover of SABMiller  by Anheuser-Busch InBev  should comply with conditions imposed by South Africa on SABMiller when it relocated its head office to Britain in 1999  South Africa's National Treasury said on Thursday.",
        "date": "10152015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 1-South Africa says SABMiller takeover by AB InBev should comply with conditions "
    },
    {
        "content": "* No formal regulatory application to South African Reserve Bank from SABMiller as yet  so premature to comment on deal",
        "date": "10152015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-S.Africa says SABMiller takeover by AB-InBev should comply with conditions "
    },
    {
        "content": "JOHANNESBURG  Oct 15 South Africa's National Treasury said on Thursday the planned takeover of SABMiller   by AB InBev should comply with conditions imposed on SABMiller when it relocated its head office to the UK in 1999.",
        "date": "10152015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "S.Africa says SABMiller takeover by AB-InBev should comply with conditions "
    },
    {
        "content": "BRUSSELS/LONDON The world's top two brewers  Anheuser-Busch InBev  and SABMiller   have agreed in principle to one of the biggest mergers in corporate history after a near month-long courtship resulted in SABMiller accepting an offer worth more than $100 billion. | Video ",
        "date": "10132015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev  SABMiller brew up $100 billion deal "
    },
    {
        "content": "LONDON Anheuser-Busch InBev  is planning a $55 billion bond sale to fund its $100 billion-plus acquisition of SABMiller   Bloomberg reported on Thursday  citing sources familiar with the matter.",
        "date": "10152015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev plans $55 billion bond sale for SAB deal: Bloomberg "
    },
    {
        "content": "* Africa is chief prize for AB InBev   (Adds Breakingviews link)",
        "date": "10132015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 8-AB InBev  SABMiller brew up $100 bln deal "
    },
    {
        "content": "LONDON  Oct 15 Anheuser-Busch InBev is planning a $55 billion bond sale to fund its $100 billion-plus acquisition of SABMiller  Bloomberg reported on Thursday  citing sources familiar with the matter.",
        "date": "10152015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev plans $55 bln bond sale for SAB deal - Bloomberg "
    },
    {
        "content": "TOKYO The planned $100 billion merger of Anheuser-Busch InBev  and SABMiller  will be a wake-up call to the overseas ambitions of Japanese brewers  which are struggling to grow at home in a saturated market with a shrinking population.",
        "date": "10152015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Mega beer deal set to reignite Japanese brewers' foreign ambitions "
    },
    {
        "content": "LONDON Brewer Anheuser-Busch InBev  may raise its takeover offer for SABMiller  ahead of Wednesday's bid deadline  a source close to the matter said on Sunday.",
        "date": "10112015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev may raise bid for SABMiller: source "
    },
    {
        "content": "WASHINGTON The U.S. Justice Department is probing allegations that Anheuser-Busch InBev  is seeking to curb competition in the beer market by buying distributors  making it harder for fast-growing craft brewers to get their products on store shelves  according to three people familiar with the matter.",
        "date": "10122015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Exclusive: U.S. probes allegations AB InBev seeking to curb craft beer distribution "
    },
    {
        "content": "(Fixes garble in spelling of Warner-Lambert)     BRUSSELS  Oct 13 Brewer SABMiller accepted on Tuesday a takeover proposal from Anheuser-Busch InBev   the world's largest brewer.      If completed  the deal would rank as one of the world's biggest takeovers:                 Announced  Target                                Buyer                                   Value(incl debt)  Sector  1   Nov 1999   Mannesmann AG (Germany)               Vodafone AirTouch PLC (UK)              $2",
        "date": "10132015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "REFILE-FACTBOX-AB InBev-SABMiller merger would be among largest in corporate history "
    },
    {
        "content": "LONDON  Oct 11 Brewer Anheuser-Busch InBev  may raise its takeover offer for SABMiller  ahead of Wednesday's bid deadline  a source close to the matter said on Sunday.",
        "date": "10112015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev may raise bid for SABMiller-source "
    },
    {
        "content": "WASHINGTON  Oct 12 Anheuser-Busch InBev  said it is talking to both the  U.S. Justice Department and the California attorney general's office about any queries they have about its plans to acquire two beer distributors in California  the company confirmed on Monday.",
        "date": "10122015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev says talking to DOJ  California AG about two planned distributor deals "
    },
    {
        "content": "* Portuguese banks lower  hit by political uncertainty   (Adds quote  detail)",
        "date": "10132015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "European shares fall on Chinese import data  SABMiller soars "
    },
    {
        "content": "Oct 9 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "10092015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "BRUSSELS/LONDON Anheuser-Busch InBev Chief Executive Carlos Brito repeated his appeal to SABMiller shareholders on Thursday  again urging them to push the brewer's board into more serious takeover discussions.",
        "date": "10082015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev CEO appeals to SAB shareholders for second day "
    },
    {
        "content": "WASHINGTON The U.S. Justice Department is probing allegations that Anheuser-Busch InBev is seeking to curb competition in the beer market by buying distributors  making it harder for fast-growing craft brewers to get their products on store shelves  according to three people familiar with the matter.",
        "date": "10122015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "US probes allegations AB InBev seeking to curb craft beer distribution-sources "
    },
    {
        "content": "LONDON/BRUSSELS Anheuser-Busch InBev  raised its proposed takeover offer for SABMiller on Monday  as the world's largest brewer tries to win over its smaller rival to the idea of creating a giant that would make nearly a third of the world's beer.",
        "date": "10122015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev ups offer for SABMiller as deadline looms "
    },
    {
        "content": "Oct 13 The Public Investment Corporation (PIC)  SABMiller's fourth-largest shareholder  said all shareholders in the brewer be treated equally in its deal with Anheuser-Busch InBev.",
        "date": "10132015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "RPT-S.Africa's PIC says all SABMiller shareholders be treated equally "
    },
    {
        "content": "* Notes the board's decision to recommend the proposal to sabmiller shareholders and believes that the decision was arrived at with shareholders' interests in mind",
        "date": "10132015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "PIC updates position on proposed SABMiller takeover "
    },
    {
        "content": "LONDON Brewer SABMiller Plc  announced an expanded cost-cutting plan on Friday  stepping up its defense against an unsolicited $100 billion takeover offer from bigger rival Anheuser-Busch InBev .",
        "date": "10092015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "SABMiller declares new savings goal in defense against AB InBev "
    },
    {
        "content": "* CEO repeats frustration  says rival's view lacks credibility",
        "date": "10082015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 2-AB InBev CEO appeals to SAB shareholders for second day "
    },
    {
        "content": "BRUSSELS  Oct 8 Anheuser-Busch InBev  Chief Executive Carlos Brito urged shareholders of SABMiller  on Thursday to see the value of its 68 billion pound ($104 billion) takeover proposal and not let the UK-based rival's board thwart its advances.",
        "date": "10082015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev urges investors not to let SABMiller thwart bid "
    },
    {
        "content": "* Eyes on Santo Domingos as SAB board weighs new proposal   (Adds report of board meeting  comments  background)",
        "date": "10122015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 7-AB InBev ups offer for SABMiller as deadline looms "
    },
    {
        "content": "LONDON  Oct 13 World share prices fell on Tuesday  snapping their longest winning streak since February after Chinese trade data gave a further sign the world's economic growth engine is sputtering.",
        "date": "10132015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "GLOBAL MARKETS-Shares fall as Chinese data dims economic outlook "
    },
    {
        "content": " (This story corrects fifth paragraph to show SAB margin 29.5 percent  not 23 percent)",
        "date": "10062015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev seen reining in SABMiller's decentralized culture "
    },
    {
        "content": "BRUSSELS/LONDON SABMiller   the world's second largest brewer  has promptly rejected an improved takeover proposal from Anheuser-Busch InBev   saying its 68 billion-pound ($104 billion) valuation was \"very substantially\" under par. | Video ",
        "date": "10072015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "SABMiller rejects AB InBev's $104 billion takeover approach "
    },
    {
        "content": "LONDON  Oct 9 Two major SABMiller  shareholders came out in support of the brewer's board late on Friday  saying it was right to reject Anheuser-Busch InBev's  $100 billion takeover offer.",
        "date": "10092015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "SABMiller investors come out in support of bid rejection "
    },
    {
        "content": "* Has repeatedly offered to share this analysis with SABMiller and its advisers",
        "date": "10082015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-AB Inbev says plans to work with regulators over SABMiller deal "
    },
    {
        "content": "Oct 12 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "10122015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Oct 13 SABMiller Plc shareholder Altria Group said it was pleased that the brewer was willing to accept larger rival Anheuser-Busch InBev's new offer worth more than $100 billion.",
        "date": "10132015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Altria welcomes SABMiller's willingness to accept AB InBev offer "
    },
    {
        "content": "LONDON  Oct 5 If brewing giant Anheuser-Busch InBev buys SABMiller  it will likely force its centralised and standardised operating model on a business known for regional independence.",
        "date": "10062015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "CORRECTED-AB InBev seen reining in SABMiller's decentralised culture "
    },
    {
        "content": "LONDON  Oct 6 SABMiller  the brewing giant which is in talks about a potential takeover by rival Anheuser-Busch InBev  said growth accelerated in its second quarter with volumes up 2 percent.",
        "date": "10062015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "SABMiller  in offer period  says Q2 volumes up 2 pct "
    },
    {
        "content": "* Top shareholder Altria supports offer  No. 2 does not   (Adds comments by AB InBev CEO)",
        "date": "10072015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 5-SABMiller rejects AB InBev's $104 bln takeover approach "
    },
    {
        "content": "LONDON  Oct 9 The level of announced mergers and acquisitions (M&A) for the year has reached an all-time high  helped by Anheuser-Busch InBev's record $100 billion offer for London-listed brewer SABMiller  Thomson Reuters data showed on Friday.",
        "date": "10092015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev bid for SABMiller helps lift global M&A levels to record high "
    },
    {
        "content": "Oct 12 Anheuser-Busch InBev on Monday confirmed it had made a higher 43.50 pound-per-share takeover proposal for SABMiller as the world's largest brewer tries to win over its smaller rival to create a global brewing giant.",
        "date": "10122015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev returns with higher takeover proposal for SABMiller "
    },
    {
        "content": "JOHANNESBURG The fourth largest shareholder in SABMiller on Monday rejected Anheuser-Busch InBev's $100 billion takeover offer as too low  piling pressure on the Belgian brewer to sweeten the deal that would a create beer colossus.",
        "date": "10122015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "SABMiller's fourth largest investor rejects AB InBev offer "
    },
    {
        "content": "* FIFA image tarnished by Swiss criminal probe of Blatter   (Update with comments)",
        "date": "10022015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "UPDATE 3-Soccer-Coke  McDonald's join sponsor call for FIFA's Blatter to resign "
    },
    {
        "content": "* ABI could scrap JSE listing since unnecessary for many investors",
        "date": "10012015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "South African funds to fight for Jo'burg listing in SABMiller deal "
    },
    {
        "content": "BRUSSELS/LONDON  Sept 30 A $70 billion debt package being arranged to fund Anheuser-Busch InBev's  takeover of SABMiller still leaves the world's largest brewer with a tricky balancing act in satisfying a range of shareholder camps with different needs.",
        "date": "09302015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev faces delicate balance in structuring SABMiller bid "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 07 (Fitch) Anheuser-Busch InBev's ongoing pursuit of  British-South African beer brewer SABMiller is weighing on the company's credit  default swap (CDS) spreads  according to Fitch Solutions in its latest CDS Case  Study snapshot. Five-year CDS on Anheuser-Busch InBev have widened out 25% over the past month  to price at the widest levels observed in three years. After pricing  consistently in line with 'A/A-' levels ",
        "date": "10072015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Fitch Solutions: Anheuser-Busch InBev CDS Widen to Three-Year Highs "
    },
    {
        "content": "BRUSSELS/LONDON  Sept 30 A $70 billion debt package being arranged to fund Anheuser-Busch InBev's  takeover of SABMiller still leaves the world's largest brewer with a tricky balancing act in satisfying a range of shareholder camps with different needs.",
        "date": "10012015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "RPT-AB InBev faces delicate balance in structuring SABMiller bid "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON/MOSCOW  October 07 (Fitch) Fitch Ratings has placed Anheuser-Busch  InBev's (ABI) and SABMiller plc's (SABM) Long-term Issuer Default Ratings (IDR)  and senior unsecured ratings on Rating Watch Negative (RWN) following today's  announcement by ABI that it has made an offer to take over SABMiller plc. A full  list of rating actions is shown at the end of this commentary. The rating action reflects likely higher leverage for both A",
        "date": "10072015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Fitch Places Anheuser-Busch InBev and SABMiller plc on Rating Watch Negative "
    },
    {
        "content": "LONDON Anheuser-Busch InBev  is asking banks to underwrite up to $70 billion in debt financing to back its potential takeover of SABMiller   banking sources said.",
        "date": "09292015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "LPC-AB InBev lining up $70 billion debt for SABMiller offer "
    },
    {
        "content": "NEW YORK Anheuser-Busch InBev SA  could bid about $106 billion for SABMiller  within days  with an opening offer expected as early as Monday morning  the Sunday Times reported.",
        "date": "09272015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev could bid $106 billion for SAB Miller: Sunday Times "
    },
    {
        "content": "(The following statement was released by the rating agency) Link to Fitch Ratings' Report: Rating Implications of an ABI/SABMiller  Combination https://www.fitchratings.com/creditdesk/reports/report_frame.cfm?rpt_id=871621 MILAN/LONDON  September 28 (Fitch) Fitch Ratings has updated in a new report its  scenario analysis of the rating implications of a possible acquisition of  SABMiller plc (SABMiller) by Anheuser-Busch InBev NV/SA (ABI). This follows our  first analysis of this potential merger",
        "date": "09282015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Fitch Updates Scenario Analysis of ABI/SABMiller Combination "
    },
    {
        "content": "LONDON Anheuser-Busch InBev is continuing talks with its relationship banks about a financing of up to $70 billion to back an improved all-cash proposed bid for SABMiller  after offering just over 68 billion pounds($104 billion)for its largest rival on Wednesday.",
        "date": "10072015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev continues talks with lenders on jumbo acquisition loan "
    },
    {
        "content": "LONDON  Sept 29 Anheuser-Busch InBev is asking banks to underwrite up to $70 billion in debt financing to back its potential takeover of SABMiller  banking sources said.",
        "date": "09292015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 2-LPC-AB InBev lining up $70 bln debt for SABMiller offer "
    },
    {
        "content": "NEW YORK  Sept 27 Anheuser-Busch InBev SA  could bid about $106 billion for SABMiller  within days  with an opening offer expected as early as Monday morning  the Sunday Times reported.",
        "date": "09272015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 1-AB InBev could bid $106 bln for SAB Miller -Sunday Times "
    },
    {
        "content": "* Spain's IBEX down 1.5 pct after Catalan vote  banks outperform",
        "date": "09282015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "European shares end lower led by Glencore  Volkswagen "
    },
    {
        "content": "Sept 23 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "09232015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "SABMiller  the world's second largest brewer  rejected a revised offer from bigger rival Anheuser-Busch InBev on Wednesday  citing the proposal  which values its equity at up to $104 billion  \"very substantially\" undervalued the company.",
        "date": "10072015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Factbox: SABMiller  from South African gold rush to brewing giant "
    },
    {
        "content": "LONDON  Sept 29 AB InBev is asking banks to underwrite up to $70 billion in debt financing to back its potential merger with SABMiller  banking sources said.",
        "date": "09292015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "LPC-AB InBev lining up $70 bln debt for SABMiller offer - bankers "
    },
    {
        "content": "Sept 29 Anheuser-Busch InBev SA is in talks with lenders including Bank of America and Banco Santander to raise as much as $70 billion as it prepares to approach rival SABMiller Plc for a takeover  Bloomberg reported.",
        "date": "09292015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev in talks to raise up to $70 bln for SABMiller-Bloomberg "
    },
    {
        "content": "NEW YORK  Sept 27 Anheuser-Busch InBev SA  could bid about $106 billion for SABMiller PLC  within days  with an opening offer expected as early as Monday morning  the Sunday Times reported.",
        "date": "09272015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev could bid $106 bln for SAB Miller -Sunday Times "
    },
    {
        "content": "LONDON  Oct 7 Anheuser-Busch InBev  Chief Executive Carlos Brito does not want to talk about making a hostile bid for rival brewer SABMiller  saying he hopes shareholders will urge the board to engage concerning the existing offer.",
        "date": "10072015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev CEO delays talk of hostile bid for SABMiller "
    },
    {
        "content": "NEW YORK  Sept 27 Source link: http://www.thesundaytimes.co.uk/sto/business/Companies/article1612009.ece  Note: Reuters has not confirmed the content of this story.",
        "date": "09272015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "MEDIA- Anheuser-Busch set to bid $106 bln for SAB Miller -Sunday Times "
    },
    {
        "content": "LONDON  Sept 28 SABMiller announced changes to the makeup of certain board committees on Monday  as the brewer girds for a possible takeover offer from its larger rival Anheuser-Busch InBev.",
        "date": "09282015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "SABMiller amends board committees as girds for takeover offer "
    },
    {
        "content": "LONDON  Oct 7 Anheuser-Busch InBev is continuing talks with its relationship banks about a financing of up to $70 billion to back an improved all-cash proposed bid for SABMiller  after offering just over 68 billion pounds($104 billion)for its largest rival on Wednesday.",
        "date": "10072015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "LPC-AB InBev continues talks with lenders on jumbo acquisition loan "
    },
    {
        "content": "NEW YORK  Sept 17 Anheuser-Busch InBev's  prospective deal for SABMiller PLC is expected to ripple across other consumer industries in the next few years  from soda makers and bottlers to snack manufacturers.",
        "date": "09182015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Big beer merger could ripple across wider beverage sector "
    },
    {
        "content": "LONDON  Sept 28 European shares fell on Monday  with miner Glencore seeing nearly a quarter of its value wiped out by debt concerns and carmaker Volkswagen   which has been hit by an emissions data scandal  extending losses.",
        "date": "09282015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "European shares led lower by Glencore  VW "
    },
    {
        "content": "MUNICH  Germany Investors in Adidas are increasingly worried that the FIFA corruption scandal risks tarnishing the German sportswear brand after the company declined to join other major sponsors and demand the immediate departure of President Sepp Blatter.",
        "date": "10072015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Investors concerned as Adidas declines to join Blatter exit call "
    },
    {
        "content": "Sept 18 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "09182015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "LONDON  Sept 28 European shares dipped lower on Monday  although Vodafone lagged after ending talks with Liberty Global and carmaker Volkswagen  which has been hit by an emissions data scandal  also declined.",
        "date": "09282015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "European shares dip as VW and Vodafone lose ground "
    },
    {
        "content": "BRUSSELS/LONDON Anheuser-Busch InBev  the world's largest brewer  has approached rival SABMiller about a takeover that would form a colossus producing a third of the world's beer. | Video ",
        "date": "09172015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Brewer AB InBev seeks $275 billion tie-up with SABMiller "
    },
    {
        "content": "Anheuser-Busch InBev SA  reached out to SABMiller Plc's  largest shareholder  Altria Group Inc   before making a takeover approach  Bloomberg reported.",
        "date": "09182015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev talked to SABMiller investor Altria before approach: Bloomberg "
    },
    {
        "content": "LONDON  Sept 28 Britain's FTSE 100 futures dipped 0.5 percent on Monday  with European equity markets expected to open lower in the wake of similar declines on Asian stock markets. For more on the factors affecting European stocks  please click on.",
        "date": "09282015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UK Factors to watch-FTSE futures slip lower "
    },
    {
        "content": "Brewer AB InBev has approached rival SABMiller regarding what would be one of the largest mergers in history.",
        "date": "09172015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Factbox: Comparing an AB InBev-SABMiller merger to the biggest ever "
    },
    {
        "content": "Sept 18 Anheuser-Busch InBev SA reached out to SABMiller Plc's largest shareholder  Altria Group Inc  before making a takeover approach  Bloomberg reported.",
        "date": "09182015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 1-AB InBev talked to SABMiller investor Altria before approach-Bbg "
    },
    {
        "content": "(Adds futures prices  company news items)     LONDON  Sept 28 European equity futures fell on Monday  tracking a similar decline on Asian markets  while Spanish shares could come into focus after separatists won a clear majority of seats in Catalonia's parliament in an election.     Futures for the euro zone's blue-chip Euro STOXX 50  Germany's DAX  and France's CAC were all down by around 1 percent  while futures on Britain's FTSE 100 fell 0.5 percent.     The victory of Cataloni",
        "date": "09282015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "European Factors to Watch-Futures fall  Spain in focus after Catalan result "
    },
    {
        "content": "Anheuser-Busch InBev   the world's largest brewer  has approached nearest rival SABMiller  about a takeover that would bring together a third of the world's commercial beer production.",
        "date": "09162015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Factbox: AB InBev and SABMiller  the world's two biggest brewers "
    },
    {
        "content": "SHANGHAI/HONG KONG A successful marriage between beer giants Anheuser-Busch InBev (ABI)  and SABMiller (SAB)  would almost certainly have to be done without one of the jewels in SAB's crown: its 49 percent stake in China's biggest-selling beer brand.",
        "date": "09182015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Beer mega deal would likely miss out on prize China asset "
    },
    {
        "content": "Sept 16 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "09162015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Sept 16 Anheuser-Busch InBev has approached rival SABMiller about a takeover that would form a brewing group producing a third of the world's beer.",
        "date": "09162015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "TIMELINE-SABMiller would be culmination of years of deals for AB Inbev "
    },
    {
        "content": "MILAN  Sept 16 European shares ended higher for a second session on Wednesday  with M&A hopes sending SABMiller  and InBev up sharply  while investors remained cautious ahead of the Federal Reserve's interest rate decision.",
        "date": "09162015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "European shares end higher led by SABMiller  eyes on Fed "
    },
    {
        "content": "MILAN  Sept 16 European shares were higher for a second session on Wednesday  with M&A hopes sending SABMiller  and InBev sharply higher  while investors remained cautious ahead of the Federal Reserve's interest rate decision.",
        "date": "09162015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "European shares rise led by SABMiller  eyes on Fed decision "
    },
    {
        "content": "LONDON  Sept 16 Britain's top share index rose on Wednesday  with SABMiller surging about 20 percent after news that AB InBev  the world's largest brewer  was to make an offer to acquire the British firm  the world's No. 2.",
        "date": "09162015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "SABMiller rally helps Britain's FTSE to gain sharply "
    },
    {
        "content": "LONDON  Sept 16 The European loan market is pinning its hopes on a potential jumbo loan financing backing the merger of the world's largest brewer AB InBev and SABMiller  almost a year since the merger was last seriously considered  banking sources said.",
        "date": "09162015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "LPC-AB InBev raises lenders' hopes for jumbo financing "
    },
    {
        "content": "** Spirits stocks up between 2-20 pct after Anheuser-Busch InBev announces planned offer for SABMiller",
        "date": "09162015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BUZZ-European beverage sector: in high spirits "
    },
    {
        "content": "LONDON/MILAN  Sept 16 European shares were higher at midday on Wednesday  with M&A hopes sending SABMiller  and InBev sharply higher while the broader market was underpinned by overnight gains on Wall Street and in Asia.",
        "date": "09162015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "European shares climb; SABMiller  InBev boosted by M&A hopes "
    },
    {
        "content": "* Restoration of the shares/warrants/derivatives Anheuser-Busch Inbev",
        "date": "09162015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-Trading on AB Inbev shares/warrants/derivatives to resume as of 12:15 - FSMA "
    },
    {
        "content": "LONDON  July 31 The stock market  rather than the real economy  is the big winner of the euro zone's nascent recovery so far this year.",
        "date": "07312015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "INVESTMENT FOCUS-Eurozone recovery lifts buybacks  clouds capex "
    },
    {
        "content": "BRUSSELS  July 30 Anheuser-Busch InBev  the world's largest brewer  reported lower than expected earnings in the second quarter as it sold less beer in Brazil and Europe a year on from the World Cup and suffered from bad weather in the United States and China.",
        "date": "07302015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "UPDATE 1-AB InBev suffers in key markets Brazil and China "
    },
    {
        "content": "* Revenue grew by 4.1 pct in Q2 2015  with solid revenue per hl growth of 6.5 pct",
        "date": "07302015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-Anheuser-Busch Inbev total Q2 beer volumes fall to 116.8 million hls "
    },
    {
        "content": "BRUSSELS  July 30 Anheuser-Busch InBev  the world's largest brewer  reported lower than expected earnings in the second quarter as it sold less beer in Brazil and Europe a year on from the World Cup and suffered from bad weather in the United States and China.",
        "date": "07302015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev suffers in key markets Brazil and China "
    },
    {
        "content": "* Announced on Thursday that its unit Anheuser-Busch InBev Finance Inc. has completed the pricing of $565 000 000 aggregate principal amount of fixed rate notes due 2045",
        "date": "07102015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "BRIEF-Anheuser-Busch InBev unit prices $565 000 000 notes due 2045 "
    },
    {
        "content": "San Miguel Brewery Hong Kong Ltd expects to take a hit after its 15-year-old distribution deal with American brewer Anheuser-Busch  maker of Budweiser expired  BusinessWorld reported  citing a regulatory filing.",
        "date": "07082015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "PHILIPPINES PRESS-End of deal with Budweiser maker hurts San Miguel HK unit - BusinessWorld "
    },
    {
        "content": "July 7 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "07072015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "SAO PAULO  July 7 Ambev SA  Brazil's largest drinks company  said on Tuesday it had bought craft brewer Colorado for an undisclosed sum  continuing its new strategy of buying premium brands amid stagnant sales volumes in South America's biggest beer market.",
        "date": "07072015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev unit Ambev buys Brazilian craft brewer Colorado "
    },
    {
        "content": "* Adidas  Coca-Cola Hyundai  McDonald's  Anheuser-Busch concerned",
        "date": "05282015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "UPDATE 4-Visa threatens to ditch FIFA as sponsor dismay mounts "
    },
    {
        "content": "SAO PAULO  May 19 Whirlpool Corp and Anheuser-Busch InBev on Tuesday started selling a countertop appliance that makes soda  juice and coffee with single-serve capsules  marking the start of a joint venture worth more than $70 million.",
        "date": "05192015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Whirlpool and AB InBev team up on hot-and-cold drink machine "
    },
    {
        "content": "LONDON  May 21 The consumer goods world has long been dominated by marketing whiz kids raised through the ranks of Procter & Gamble or PepsiCo  but the executives now in demand come from a new school that values cost-cutting and mergers over marketing.",
        "date": "05212015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "INSIGHT-New breed of food execs raised on mergers  not marketing "
    },
    {
        "content": "LONDON Shares of brewer SABMiller  rose more than 3 percent on Thursday  with traders citing a revival of talk of a possible takeover bid from rival Anheuser-Busch InBev .",
        "date": "05072015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "SABMiller shares rise on takeover talk  AB InBev cited "
    },
    {
        "content": "BRUSSELS Anheuser-Busch InBev  the world's largest brewer  increased first quarter profit by more than expected as it lifted prices and sold more premium lagers in Brazil and China  making up for sharply lower U.S. shipments.",
        "date": "05062015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "AB InBev profits from Brazil prices as U.S. sales drop "
    },
    {
        "content": "* Revenue per litre up by 7.5 pct on price hikes  premium beer",
        "date": "05062015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 2-AB InBev profits from Brazil prices as U.S. sales drop "
    },
    {
        "content": "LONDON  May 6 European equity indexes edged higher in choppy trade early on Wednesday  helped by a boost from strong results at Anheuser-Busch InBev and Vestas Wind  among other firms.",
        "date": "05062015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "Results boost help European shares after selloff "
    },
    {
        "content": "BRUSSELS  May 6 Anheuser-Busch InBev  the world's largest brewer  increased profit by slightly more than expected as it made up for lower beer volumes with price hikes and higher-priced beers.",
        "date": "05062015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev raises profit despite lower beer sales "
    },
    {
        "content": "Underlying govt bond    Over midswaps equivalent to 126.6 bps",
        "date": "04132015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "New Issue- Anheuser-Busch prices a multi tranche deal "
    },
    {
        "content": "LONDON/NEW YORK Anheuser-Busch InBev   the world's largest brewer  is close to proposing JAB Holding Chief Executive Olivier Goudet as its next chairman  according to four sources familiar with the matter.",
        "date": "03262015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Exclusive: AB InBev to nominate JAB partner as chairman - sources "
    },
    {
        "content": "LONDON  Feb 26 Major European share indexes climbed to new multi-year highs on Thursday  with the world's largest brewer Anheuser-Busch InBev leading the food and beverages sector higher after announcing a sharp dividend hike and a share buyback plan.",
        "date": "02262015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "topStory",
        "symbol": "BUD",
        "title": "Food and beverages firms push European stocks to new highs "
    },
    {
        "content": "LONDON  Feb 26 Major European share indexes climbed to new multi-year highs on Thursday  with the world's largest brewer Anheuser-Busch InBev leading the food and beverages sector higher after announcing a sharply higher dividend and a share buyback plan.",
        "date": "02262015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "European stocks set new multi-year highs  InBev helps "
    },
    {
        "content": "* Q4 core profit $5.07 bln vs Reuters poll consensus of $5.30 bln   (Updates after conference call  adds shares)",
        "date": "02262015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "UPDATE 2-AB InBev sharply hikes dividend  plans $1 bln share buyback "
    },
    {
        "content": "PARIS  Feb 26 European stocks were seen steady at the open on Thursday  as investors focused on a flurry of corporate results from blue chips including Anheuser-Busch InBev  Allianz and Deutsche Telekom .     AB InBev  the world's largest brewer  announced a sharply higher dividend and a $1-billion share buyback on Thursday. It also forecast improved beer sales in most of its major markets.      German insurer Allianz raised its dividend by less than expected after full year operatin",
        "date": "02262015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "European Factors to Watch-Shares seen steady; eyes on earnings "
    },
    {
        "content": "* Anheuser-Busch Inbev reports fourth quarter and full year 2014 results",
        "date": "02262015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "BRIEF-Anheuser-Busch Inbev FY revenue rises 5.9 pct to $47.06 bln "
    },
    {
        "content": "BRUSSELS  Feb 26 Anheuser-Busch InBev  the world's largest brewer  announced a sharply higher dividend and a $1 billion share buyback on Thursday and forecast improving income from beer sales in the year ahead.",
        "date": "02262015",
        "name": "Anheuser-Busch Inbev SA",
        "news_type": "normal",
        "symbol": "BUD",
        "title": "AB InBev hikes dividend and plans $1 bln share buyback "
    }
]