[
    {
        "content": "LIMA  Nov 6 Peru's Buenaventura resumed normal operations at its Uchucchacua silver mine on Saturday after an Andean community ended a protest that had halted output  the company said.",
        "date": "11062017",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "Buenaventura says silver mine in Peru resumes output "
    },
    {
        "content": "AREQUIPA  Peru Peruvian precious metals miner Buenaventura is evaluating making a bid on $2 billion copper project Michiquillay in an auction planned for mid-November  the company's chairman told Reuters on Tuesday.",
        "date": "09192017",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "Peru miner Buenaventura eyes Michiquillay copper project: chairman "
    },
    {
        "content": "SANTIAGO  Aug 29 Buenaventura  a leading Peruvian miner  will look for a partner to develop a plant that reduces the arsenic level in copper  the firm's chief executive said on Tuesday.",
        "date": "08292017",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "Peru's Buenaventura seeks partner for arsenic copper project "
    },
    {
        "content": "LIMA Buenaventura  Peru's largest producer of precious metals  has no plans to restart its Conga gold mine this year or in 2018 and will instead focus on efficiency gains at four of its fully owned operations in the country  the company's top executive said on Wednesday.",
        "date": "08092017",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "Peru's Buenaventura CEO says no near-term Conga gold mine revival "
    },
    {
        "content": "LIMA Peruvian precious metals miner Buenaventura reported a $70.7 million profit in the first quarter of 2017  up 37 percent from its $51.6 million profit in the same period last year  the company said on Thursday.",
        "date": "04272017",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "Peruvian miner Buenaventura posts $70.7 million first-quarter profit "
    },
    {
        "content": "* Qtrly ebitda from direct operations was us$80.4 million compared to us$19.6 million reported in 4q15",
        "date": "03012017",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "BRIEF-Buenaventura Qtrly loss per share $1.60 "
    },
    {
        "content": "LIMA The new chief executive of Peru's biggest precious metals miner  Buenaventura  said on Tuesday that the price of gold would not likely trigger an industry-wide wave of new mining projects until it reached at least $1 350 per ounce.",
        "date": "02152017",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "Buenaventura says gold must climb higher to unleash new projects "
    },
    {
        "content": "LIMA  Feb 14 The new chief executive of Peru's biggest precious metals miner  Buenaventura   said on Tuesday that the price of gold will not likely trigger an industry-wide wave of new mining projects until it reaches at least $1 350 per ounce.",
        "date": "02142017",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "UPDATE 1-Buenaventura CEO says gold price will not trigger new projects yet "
    },
    {
        "content": "LIMA  Feb 14 The new chief executive of Peru's biggest precious metals miner  Buenaventura   said on Tuesday that he does not think the price of gold will trigger the mining industry to initiate new mining projects until it reaches at least $1 350 per ounce.",
        "date": "02142017",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "normal",
        "symbol": "BVN",
        "title": "Buenaventura CEO says $1 350 gold price could trigger new mining projects "
    },
    {
        "content": "LIMA  Sept 15 Peruvian precious metals miner Buenaventura  expects its Tambomayo mine to produce its first bar of gold in November and reach full output at the end of this year or the start of next  the company said late on Wednesday.",
        "date": "09152016",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "Buenaventura says new mine to kick off production in November "
    },
    {
        "content": "LIMA  July 26 Peruvian precious metals miner Buenaventura  on Tuesday reported $55.5 million in net profit in the second quarter  up from its $18.7 million loss in the same period a year ago.",
        "date": "07262016",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "Buenaventura reports $55.5 million net profit in second quarter "
    },
    {
        "content": "LIMA  April 28 Peruvian precious metals miner Buenaventura  said on Thursday that its net profit nearly tripled in the first quarter from the same period in 2014  rising to $51.6 million.",
        "date": "04282016",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "Peru miner Buenaventura says net profit tripled in 1st quarter "
    },
    {
        "content": "LIMA  March 31 Workers at Freeport McMoRan Inc's  Cerro Verde mine in Peru  one of the country's biggest copper deposits  plan to go on a 48-hour strike starting April 8 for unspecified reasons  the union said in a statement on Thursday.",
        "date": "04012016",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "normal",
        "symbol": "BVN",
        "title": "Workers at Cerro Verde copper mine in Peru plan strike next month "
    },
    {
        "content": "LIMA  Feb 26 Peruvian precious metals miner Buenaventura  reported a $293 million loss in net profit in the fourth quarter on weak prices and slipping gold output  81 percent steeper than its shortfall in the same period in 2014.",
        "date": "02262016",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "Peru miner Buenaventura reports $293 mln loss in fourth quarter "
    },
    {
        "content": "LIMA  Oct 29 Peruvian precious metals miner Buenaventura  reported a $23.2 million net loss in the third quarter on slumping gold and silver prices that hurt sales.",
        "date": "10302015",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "Peru's Buenaventura posts Q3 net loss on weak gold prices "
    },
    {
        "content": "* Miners pushing for bargains from contract  supply companies",
        "date": "09242015",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "UPDATE 2-Peru miners push for bargains with contractors to weather slumping prices "
    },
    {
        "content": "LIMA  Sept 23 Buenaventura   will likely produce 23 million ounces of silver this year  500 000 less than previously expected because of a month-long strike at its Uchucchacua mine in May  the company said Wednesday.   (Reporting by Mitra Taj and Teresa Cespedes; Editing by Lisa Shumaker)",
        "date": "09242015",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "normal",
        "symbol": "BVN",
        "title": "Buenaventura sees 2015 silver output at 23 mln ounces "
    },
    {
        "content": "AREQUIPA  Peru  Sept 22 Peruvian precious metals miner Buenaventura  expects the government to issue an environmental permit for its San Gabriel gold project at the end of the year  the company's vice president of operations said Tuesday.",
        "date": "09222015",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "Buenaventura expects key permit for gold project by end of year "
    },
    {
        "content": "LIMA  June 8 A month-long strike by contract workers at a Peruvian silver mine that ended last week curbed output by 1 million ounces  operator Buenaventura   said on Monday.",
        "date": "06082015",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "Buenaventura says strike at silver mine in Peru curbed 1 mln ounces in output "
    },
    {
        "content": "LIMA  May 11 Contract workers at Peruvian Buenaventura's  silver mine Uchucchacua went on strike to press for better working conditions  the company said on Monday in a filing with the country's market regulator.",
        "date": "05112015",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "UPDATE 1-Workers at Buenaventura silver mine in Peru on strike -company "
    },
    {
        "content": "LIMA  May 11 Contract workers at Peruvian Buenaventura's  silver mine Uchucchacua went on strike to press for better working conditions  the company said on Monday in a filing with the country's market regulator.   (Reporting By Marco Aquino; Editing by Ted Botha)",
        "date": "05112015",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "normal",
        "symbol": "BVN",
        "title": "Workers at Buenaventura silver mine in Peru on strike -company "
    },
    {
        "content": "LIMA  April 29 Peruvian precious metals miner Buenaventura  reported first-quarter net income of $17.3 million on Wednesday  well above its $16.1 million loss in the same period a year ago.",
        "date": "04302015",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "UPDATE 1-Buenaventura reports $17.3 mln in first-quarter profit "
    },
    {
        "content": "LIMA  April 29 Peruvian precious metals miner Buenaventura  reported first-quarter net income of $17.3 million on Wednesday  well above its $16.1 million loss in the same period a year ago.   (Reporting by Mitra Taj; Editing by Lisa Shumaker)",
        "date": "04292015",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "Peru miner Buenaventura reports $17.3 mln in first-quarter profit "
    },
    {
        "content": "March 5 Creativ Hotel Buenaventura S.A.U. and others:",
        "date": "03052015",
        "name": "Buenaventura Mining Company Inc",
        "news_type": "topStory",
        "symbol": "BVN",
        "title": "BRIEF-Creativ Hotel Buenaventura exempted from bidding for IFA Hotel & Touristik AG "
    }
]