[
    {
        "content": "* Cloverleaf Cold Storage announces recapitalization led by Blackstone",
        "date": "11132017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Cloverleaf Cold Storage announces recapitalization led by Blackstone "
    },
    {
        "content": "HONG KONG Global asset manager Blackstone Group LP  has reached a deal to acquire China-based cosmetics packaging firm ShyaHsin Packaging (China) Co Ltd for about $800 million to $900 million  four people with knowledge of the matter told Reuters.",
        "date": "11102017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone buys China-based packager ShyaHsin in $800-900 million deal: sources "
    },
    {
        "content": "* Blackstone Group Lp - ‍announced plans to implement private multi-family residential rooftop solar project in United States​",
        "date": "11082017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone Group Lp plans to implement private multi-family residential rooftop solar project in U.S. "
    },
    {
        "content": "HONG KONG  Nov 10 Global asset manager Blackstone Group LP has reached a deal to acquire China-based cosmetics packaging firm ShyaHsin Packaging (China) Co Ltd for about $800 million to $900 million  four people with knowledge of the matter told Reuters.",
        "date": "11102017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "REFILE-Blackstone buys China-based packager ShyaHsin in $800-900 mln deal -sources "
    },
    {
        "content": "HONG KONG/SHANGHAI Blackstone   KKR  and some Chinese investors are among potential bidders shortlisted by Link Real Estate Investment Trust  to buy some of its Hong Kong retail assets valued at about $2 billion  three sources said.",
        "date": "10232017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone  KKR  others shortlisted for Link REIT's $2 billion Hong Kong assets: sources "
    },
    {
        "content": "RIYADH Fund manager BlackRock Inc  and private equity firm Blackstone Group  are planning to open offices in Saudi Arabia  encouraged by the investment opportunities offered by the kingdom  Crown Prince Mohammed bin Salman told Reuters.",
        "date": "10272017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BlackRock  Blackstone to open offices in Saudi Arabia: Crown Prince "
    },
    {
        "content": "* The Blackstone Group L.P. reports 5.2 pct stake in NuStar Energy LP as of Oct 16 - SEC filing Source text: (http://bit.ly/2heuyxD) Further company coverage:",
        "date": "10262017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone Group reports 5.2 pct stake in NuStar Energy "
    },
    {
        "content": "RIYADH Saudi Arabia's Public Investment Fund (PIF)  the country's main sovereign wealth fund  will contribute $20 billion to a $40 billion fund with U.S. private equity firm Blackstone  its managing director said on Tuesday.",
        "date": "10242017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Saudi's PIF commits $20 bln to $40 billion fund with Blackstone "
    },
    {
        "content": "RIYADH  Oct 27 Fund manager BlackRock Inc and private equity firm Blackstone Group are planning to open offices in Saudi Arabia  encouraged by the investment opportunities offered by the kingdom  Crown Prince Mohammed bin Salman told Reuters.",
        "date": "10272017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BlackRock  Blackstone to open offices in Saudi Arabia-Crown Prince "
    },
    {
        "content": "RIYADH  Oct 24 Saudi Arabia's Public Investment Fund (PIF)  the country's main sovereign wealth fund  will contribute $20 billion to a $40 billion fund with U.S. private equity firm Blackstone  its managing director said on Tuesday.",
        "date": "10242017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "CORRECTED (OFFICIAL)-UPDATE 1-Saudi's PIF commits $20 bln to $40 billion fund with Blackstone "
    },
    {
        "content": "BRUSSELS  Oct 17 EU antitrust regulators on Tuesday opened a full-scale investigation into private equity firm Blackstone's plan to combine its acetone tow with that of U.S. speciality material company Celanese.",
        "date": "10172017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "EU regulators to investigate Blackstone  Celanese acetate tow merger "
    },
    {
        "content": "* Blackstone closes acquisition of Harvest Fund Advisors Llc Source text for Eikon: Further company coverage:",
        "date": "10162017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone closes acquisition of Harvest Fund Advisors Llc "
    },
    {
        "content": "* Blackstone Group LP Q3 2017 total revenues $1.75 billion versus $1.43 billion ‍​",
        "date": "10192017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone Group LP Q3 2017 total revenues $1.75 billion versus $1.43 billion ‍​ "
    },
    {
        "content": "* Blackstone announces expiration and results of tender offer for any and all of its 6.625% senior notes due 2019",
        "date": "10022017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone announces expiration of tender offer for its 6.625% senior notes "
    },
    {
        "content": "* Blackstone announces pricing of tender offer for any and all of its 6.625% senior notes due 2019",
        "date": "09292017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone prices tender offer of 6.625 pct senior notes due 2019 "
    },
    {
        "content": "* Priced offering of $300 million of 3.150% senior notes due 2027  $300 million of 4.000% senior notes due 2047 of Blackstone Holdings Finance Source text for Eikon: Further company coverage:",
        "date": "09252017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone prices $600 million senior notes offering "
    },
    {
        "content": "* Hudson Pacific Properties - On Sept 14  co entered into agreement with affiliates of Blackstone to sell 100% interest in Hudson MC Partners at price of $350 million",
        "date": "09252017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BRIEF-Hudson Pacific Properties says entered into agreement with affiliates of Blackstone to sell 100% interest in Hudson MC Partners "
    },
    {
        "content": "* Blackstone commences tender offer for any and all of its 6.625% senior notes due 2019",
        "date": "09252017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BRIEF-Blackstone commences tender offer for 6.625% senior notes due 2019 "
    },
    {
        "content": "* Blackstone Group Lp - ‍announced its intention to offer senior notes of Blackstone Holdings Finance Co. L.L.C.  its indirect subsidiary​ Source text for Eikon: Further company coverage:",
        "date": "09252017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BRIEF-Blackstone to offer senior notes "
    },
    {
        "content": "FRANKFURT  Sept 21 Buyout group Blackstone has bought German measuring technology group Schenck Process from private equity investor IK Investment Partners  the groups said on Thursday.",
        "date": "09212017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone buys German measuring firm Schenck "
    },
    {
        "content": "* Hilton Grand Vacations announces pricing of secondary common stock offering",
        "date": "09202017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Hilton Grand Vacations announces pricing of secondary common stock offering "
    },
    {
        "content": "FRANKFURT Buyout group Blackstone  has tasked Morgan Stanley  with finding a buyer for its 45 percent stake in German iconic camera maker Leica  people close to the matter said on Monday.",
        "date": "09182017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone taps Morgan Stanley for sale of camera maker Leica: sources "
    },
    {
        "content": "FRANKFURT  Sept 18 Buyout group Blackstone has tasked Morgan Stanley with finding a buyer for its 45 percent stake in German iconic camera maker Leica  people close to the matter said on Monday.",
        "date": "09182017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone taps Morgan Stanley for sale of camera maker Leica -sources "
    },
    {
        "content": "HONG KONG  Sept 14 Asia Alternatives  a regional private equity fund-of-funds (FOF) manager  said on Thursday it has raised about $1.8 billion for its most recent fund and associated vehicles  benefiting from increased demand for the relatively high returns promised by buyout deals and early-stage investing in Asian companies.",
        "date": "09142017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "RPT-Private equity investor Asia Alternatives closes new $1.8 bln fund "
    },
    {
        "content": "SYDNEY Private equity giant Blackstone Group has called off the sale of its A$3.5 billion ($2.8 billion) Australian shopping mall portfolio  a source said  as the looming arrival of Amazon.com spooks buyers of bricks-and-mortar stores.",
        "date": "09052017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Amazon fears sink Blackstone's $2.8 billion Australian mall sale "
    },
    {
        "content": "* Blackstone to focus on managing 10-mall portfolio (Recasts  adds fund manager and analyst quotes  background)",
        "date": "09052017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 2-Amazon fears sink Blackstone's $2.8 bln Australian mall sale "
    },
    {
        "content": "SYDNEY  Sept 5 Private equity giant Blackstone Group cancelled the sale of a A$3.5 billion ($2.8 billion) Australian shopping mall portfolio after it was unable to find a buyer  a source familiar with the matter said on Tuesday.",
        "date": "09052017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone cancels $2.8 bln Australian mall sale on weak interest - source "
    },
    {
        "content": "Aug 27 Blackstone has hired Katsuyuki Kuki to be its chairman and representative director for Japan  the private equity firm said on Sunday.",
        "date": "08282017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone hires Katsuyuki Kuki as chairman  representative director for Japan "
    },
    {
        "content": "Aug 25 U.S. department store operator Sears Holdings Corp is having trouble stocking shelves  as some vendors have fled while others are demanding stricter payment terms because of difficulties hedging against default risk.",
        "date": "08252017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "RPT-INSIGHT-Without insurance  some vendors balk at stocking Sears’ shelves "
    },
    {
        "content": "Aug 25 U.S. department store operator Sears Holdings Corp is having trouble stocking shelves  as some vendors have fled while others are demanding stricter payment terms because of difficulties hedging against default risk.",
        "date": "08252017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "INSIGHT-Without insurance  some vendors balk at stocking Sears’ shelves "
    },
    {
        "content": "BOSTON  Aug 24 Commodity oriented hedge fund firm Madava Asset Management has hired industry veteran Nedim Soylemez to trade natural gas  oil and energy  a person familiar with the hire said on Thursday.",
        "date": "08242017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Hedge fund Madava hires Soylemez from JPMorgan to trade energy "
    },
    {
        "content": "Aug 22 Private equity firm Blackstone Group LP is exploring an initial public offering (IPO) of Gates Global LLC  three years after it acquired the U.S. auto parts and building products maker for $5.4 billion  people familiar with the matter said on Tuesday.",
        "date": "08222017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "REFILE-UPDATE 1-Blackstone explores IPO of Gates Global -sources "
    },
    {
        "content": "Private equity firm Blackstone Group LP  is exploring an initial public offering (IPO) of Gates Global LLC  three years after it acquired the U.S. auto parts and building products maker for $5.4 billion  people familiar with the matter said on Tuesday.",
        "date": "08232017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone explores IPO of Gates Global: sources "
    },
    {
        "content": "* Blackstone Group Lp - ‍terms of agreement were not disclosed.​",
        "date": "08172017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone agrees to acquire Harvest Fund Advisors "
    },
    {
        "content": "Aug 22 Private equity firm Blackstone Group LP is exploring an initial public offering (IPO) of Gates Global LLC  three years after it acquired the U.S. auto parts and building products maker for $5.4 billion  people familiar with the matter said on Tuesday.",
        "date": "08222017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone explores IPO of Gates Global -sources "
    },
    {
        "content": "Blackstone Group  has pulled out of discussions to buy part of Israeli mobile surveillance software maker NSO Group  according to people familiar with the talks that had been criticized by digital privacy activists.",
        "date": "08152017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone ends talks for NSO Group stake that prompted protest: sources "
    },
    {
        "content": "* FUNDS UNDER MANAGEMENT OF GSO CAPITAL PARTNERS LP HAVE ON 10 AUGUST 2017 SOLD 1 384 478 SHARES OF NORSKE SKOGINDUSTRIER ASA AT A NET PRICE OF NOK 0.35 PER SHARE",
        "date": "08112017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone Group cuts stake to 8.6 pct Norske Skogindustrier "
    },
    {
        "content": "Aug 15 Blackstone Group has pulled out of discussions to buy part of Israeli mobile surveillance software maker NSO Group  according to people familiar with the talks that had been criticized by digital privacy activists.",
        "date": "08152017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone ends talks for NSO Group stake that prompted protest -sources "
    },
    {
        "content": "Aug 10 Invitation Homes Inc said on Thursday it would buy Starwood Waypoint Homes in an all-stock deal that would create a $11 billion U.S. single-family rental company.",
        "date": "08102017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone's Invitation Homes to buy Starwood Waypoint "
    },
    {
        "content": "Aug 15 American International Group Inc wants to sell a $2 billion portfolio of life insurance policies that would pay out when sick or elderly customers die  two people familiar with the matter said.",
        "date": "08152017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "AIG shops $2 billion death benefits portfolio -sources "
    },
    {
        "content": "* Blackstone Group's Invitation Homes and starwood Waypoint Homes plan to combine- WSJ  citing sources",
        "date": "08102017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BRIEF-Blackstone's Invitation Homes and Starwood Waypoint Homes plan to combine- WSJ  citing sources "
    },
    {
        "content": "LONDON Goldman Sachs has sold its remaining stake in British pensions insurance business Rothesay Life to a trio of existing investors a decade after setting up the company.",
        "date": "08092017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone  GIC lead buyout of Goldman's Rothesay Life stake "
    },
    {
        "content": "* Singapore's GIC  MassMutual and Blackstone  will announce deal early next week to buy Goldman's 33 pct stake in Rothesay Life- Sky News citing sources",
        "date": "08042017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Singapore's GIC  MassMutual and Blackstone to buy Goldman's stake in Rothesay Life- Sky News "
    },
    {
        "content": "* Demand to offload corporate pension risk increasing (Adds quote  background  bullet points)",
        "date": "08092017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone  GIC lead buyout of Goldman's Rothesay Life stake "
    },
    {
        "content": "LONDON  Aug 9 Goldman Sachs has sold its remaining stake in British pensions insurance business Rothesay Life to a trio of existing investors including Singapore's sovereign wealth fund a decade after setting up the company.",
        "date": "08092017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "CORRECTED-Blackstone  GIC lead buy out of Goldman Sachs stake in Rothesay Life "
    },
    {
        "content": "FRANKFURT  Aug 9 Spanish bank Santander has sold control of property worth 10 billion euros ($12 billion) to U.S. investor Blackstone Group  following its rescue of Banco Popular.",
        "date": "08092017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Santander seals biggest sale yet of Spanish property "
    },
    {
        "content": "* GE Power CEO  Steve Bolze  joins Blackstone’S infrastructure business as head of portfolio operations and asset management",
        "date": "08032017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-GE Power CEO  Steve Bolze  joins Blackstone’s infrastructure business as head of portfolio operations and asset management "
    },
    {
        "content": "FRANKFURT Buyout group Blackstone  is in talks with potential buyers for its 45 percent stake in iconic high-end camera and sport optics maker Leica  people close to the matter said.",
        "date": "08022017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Exclusive: Blackstone in talks to sell stake in camera maker Leica - sources "
    },
    {
        "content": "HONG KONG  July 28 The China Investment Corp sovereign wealth fund is arranging a 6.8 billion euro ($7.96 billion) loan to fund its acquisition of European warehouse firm Logicor  people with direct knowledge of the matter told Thomson Reuters publication Basis Point.",
        "date": "07282017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "China's CIC raising $8 bln loan for Logicor acquisition -Basis Point "
    },
    {
        "content": "MADRID U.S. asset manager Blackstone  has entered into exclusive talks with Banco Popular over the sale of a majority stake in the rescued Spanish lender's property portfolio  Popular said in a statement on Monday.",
        "date": "07312017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone in exclusive talks with Banco Popular on property portfolio "
    },
    {
        "content": "MADRID  July 31 Spain's Banco Popular said on Monday it had entered into exclusive talks with U.S. asset management fund Blackstone Group over the sale of a majority stake in its property portfolio  confirming an earlier report in online newspaper Vozpopuli.",
        "date": "07312017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Banco Popular says in exclusive talks with Blackstone "
    },
    {
        "content": "MADRID  July 31 U.S. asset managers Blackstone have agreed to acquire 51 percent of Banco Popular's portfolio of repossessed property assets and non-performing loans  Spanish online newspaper El Confidencial reported on Monday  without citing sources.",
        "date": "07312017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to buy 51 pct of Banco Popular portfolio -media "
    },
    {
        "content": "TEL AVIV Blackstone Group  is in advanced talks to pay $400 million for 40 percent of privately held Israeli firm NSO Group  a maker of spyware for mobile devices  Israel's Calcalist business newspaper reported on Sunday.",
        "date": "07242017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone in talks to buy 40 pct of Israel cyber firm NSO -report "
    },
    {
        "content": "July 27 Digital rights group Access Now on Thursday began circulating a petition urging Blackstone Group to abandon any plan to invest in Israeli firm NSO Group  a maker of spyware for mobile devices  following a report that such a deal may be imminent.",
        "date": "07272017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Digital rights groups pressure Blackstone on reported NSO Group deal "
    },
    {
        "content": "TEL AVIV  July 23 Blackstone Group is in advanced talks to pay $400 million for 40 percent of privately held Israeli firm NSO Group  a maker of spyware for mobile devices  Israel's Calcalist business newspaper reported on Sunday.",
        "date": "07232017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone in talks to buy 40 pct of Israel cyber firm NSO -report "
    },
    {
        "content": "TEL AVIV  July 23 Blackstone Group is in advanced talks to acquire 40 percent of Israeli cyber firm NSO Group for $400 million  Israel's Calcalist business newspaper reported on Sunday.",
        "date": "07232017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone in talks to buy 40 pct of Israel cyber firm NSO -report "
    },
    {
        "content": "July 21 A consortium of Blackstone and CVC Capital Partners has made a 2.86 billion pound ($3.71 billion) takeover proposal for payments processing company Paysafe Group  the British group said on Friday.",
        "date": "07212017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone  CVC make $3.7 bln bid for payments firm Paysafe "
    },
    {
        "content": "BOSTON Blackstone Group has written the first check from its latest seeding fund  sources familiar with the matter said this week  committing $100 million in start-up capital to a new hedge fund run by a former TPG-Axon executive.",
        "date": "07192017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone backs ex-TPG-Axon executive's new fund with seed investment: sources "
    },
    {
        "content": "NEW YORK Buyout firm Blackstone Group LP  on Thursday reported quarterly earnings that grew but was a touch lower than expected  as strong gains in real estate holdings were eroded by a pullback in credit investment performance.",
        "date": "07202017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Buyout firm Blackstone second quarter earnings grow but miss forecasts "
    },
    {
        "content": "BOSTON  July 19 Blackstone Group has written the first check from its latest seeding fund  sources familiar with the matter said this week  committing $100 million in start-up capital to a new hedge fund run by a former TPG-Axon executive.",
        "date": "07192017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone backs ex-TPG-Axon exec's new fund with seed investment -sources "
    },
    {
        "content": "NEW YORK  July 20 Buyout firm Blackstone Group LP on Thursday reported quarterly earnings that grew but was a touch lower than expected  as strong gains in real estate holdings were eroded by a pullback in credit investment performance.",
        "date": "07202017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Buyout firm Blackstone Q2 earnings grow but miss forecasts "
    },
    {
        "content": "* Blackstone Group LP - Qtrly net income per common unit $0.51",
        "date": "07202017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BRIEF-Blackstone Group LP - Qtrly net income per common unit $0.51 "
    },
    {
        "content": "NEW YORK  July 20 Buyout firm Blackstone Group LP reported slightly lower-than-expected quarterly earnings on Thursday  after strong gains in real estate holdings were offset by a pullback in credit investment performance.",
        "date": "07202017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Buyout firm Blackstone Q2 earnings grow but miss forecasts "
    },
    {
        "content": "HONG KONG Blackstone Group LP is seeking to raise up to $3 billion in its first Pan-Asia buyout fund for investments in sectors including high-end manufacturing and healthcare  people familiar with the plan told Reuters.",
        "date": "07202017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone raising at least $3 billion in first Asia PE fund: sources "
    },
    {
        "content": "* Fund size not finalised  could be bigger than $3 bln-source",
        "date": "07202017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone raising at least $3 bln in first Asia PE fund-sources "
    },
    {
        "content": "* Fund size not finalised  could be bigger than $3 bln-source",
        "date": "07202017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone raising at least $3 bln in first Asia PE fund "
    },
    {
        "content": "* Agreement to acquire International Market Centers  from Bain Capital Private Equity and funds managed by Oaktree Capital Management Source text for Eikon: Further company coverage:",
        "date": "07062017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone to acquire International Market Centers Inc. "
    },
    {
        "content": "SINGAPORE  June 28 U.S. private equity group Blackstone Group LLP agreed to buy Singapore-listed and Japan-focused Croesus Retail Trust (CRT) for S$900.6 million ($650 million)  part of an trend of buyouts of real estate investment trusts (REITs).",
        "date": "06282017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone agrees to buy Singapore-listed REIT for $650 mln "
    },
    {
        "content": "SINGAPORE/HONG KONG  June 30 The race to buy Global Logistic Properties narrowed to between a Chinese consortium backed by the company's management and a rival group led by Warburg Pincus  sources said  as bidders submitted offers for the $10 billion-valued firm.",
        "date": "06302017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "REFILE-UPDATE 3-Race to buy $10 bln-valued GLP narrows down to two groups -sources "
    },
    {
        "content": "LONDON Buyout fund Blackstone  said on Monday it had agreed to acquire a majority interest in The Office Group (TOG)  valuing the flexible workspace provider at about 500 million pounds  ($640 million).",
        "date": "06192017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Buyout fund Blackstone buys The Office Group valuing it at $640 million "
    },
    {
        "content": "June 18 Specialty material company Celanese Corp said on Sunday it agreed with private equity firm Blackstone Group LP to combine their cellulose acetate tow units to form a bigger supplier of the material used in cigarette filters.",
        "date": "06182017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Celanese  Blackstone to form acetate tow joint venture "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL/SINGAPORE  June 15 (Fitch) Fitch Ratings has assigned Marble II Pte. Ltd.'s (Marble II) USD500 million 5.3% senior notes due 2022 a final rating of 'BB'. The final rating follows the receipt of documents conforming to information already received and is in line with the expected rating assigned on 5 June 2016. The notes are secured by Marble I Pte. Ltd.'s 100% equity stake in Marble II and the interest reserve account. The notes a",
        "date": "06152017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Fitch Rates Marble II's USD500m Note Final 'BB' "
    },
    {
        "content": "LONDON  June 19 Buyout fund Blackstone said on Monday it had agreed to acquire a majority interest in The Office Group (TOG)  valuing the flexible workspace provider at about 500 million pounds  ($640 million).",
        "date": "06192017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Buyout fund Blackstone buys The Office Group valuing it at $640 mln "
    },
    {
        "content": "* Blackstone buys british flexible office provider The Office Group in 500 million stg deal - Sky News Source text : http://bit.ly/2sfFbWC Further company coverage:",
        "date": "06182017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BRIEF-Blackstone buys The Office Group in 500 mln stg deal - Sky News "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - In a sense  Blackstone is back where it started. On June 22  2007  at what turned out to be a market peak  Steve Schwarzman and Pete Peterson took their private-equity firm public in a ballyhooed transaction that inspired rivals to do the same. A decade on  the firm's units are trading only just above the $31 price where they sold ahead of their New York Stock Exchange debut. A better result over the next 10 years could require Blackstone to financially re-engi | Video ",
        "date": "06222017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone may have to financially engineer itself "
    },
    {
        "content": "NEW YORK  June 13 J. Crew Group Inc disclosed terms on Tuesday of a debt restructuring deal that would roughly cut in half the value of its nearly $567 million in bonds  as well as extend their maturity by two years  after receiving the backing of some key creditors.",
        "date": "06142017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "U.S. fashion retailer J. Crew launches debt restructuring deal "
    },
    {
        "content": "U.S. oil and gas company Penn Virginia Corp  has hired investment bank Jefferies LLC as it explores a possible sale  less than a year after it emerged from bankruptcy  as its former creditors seek to cash out  people familiar with the matter said on Monday.",
        "date": "06122017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Oil and gas explorer Penn Virginia taps Jefferies for sale: sources "
    },
    {
        "content": "Blackstone Group   has closed a 7.8 billion-euro ($8.79 billion) fund that will focus on European commercial real estate  a source familiar with the matter said.",
        "date": "06072017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone closes 7.8 billion-euro European property fund  source says "
    },
    {
        "content": "June 7 Blackstone Group  has closed a 7.8 billion-euro ($8.79 billion) fund that will focus on European commercial real estate  a source familiar with the matter said.",
        "date": "06072017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone closes 7.8 bln-euro European property fund  source says "
    },
    {
        "content": "* Blackstone Group - funds managed by Blackstone tactical opportunities made equity investment in Ascenty  a data center & telecom services co in Brazil",
        "date": "06052017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone Group says funds managed by Blackstone tactical opportunities made equity investment in Ascenty "
    },
    {
        "content": "HELSINKI U.S. private equity group Blackstone Group  said on Monday it had offered to buy all shares in Finnish real estate investment company Sponda  for about 1.8 billion euros ($2.0 billion) as it seeks to expand its real estate business in the Nordic region.",
        "date": "06052017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone offers $2 billion for Finnish real estate firm Sponda "
    },
    {
        "content": "* Bid had been expected in the Finnish sector (Adds Areim detail  bullets  updates shares)",
        "date": "06052017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 2-Blackstone offers $2 bln for Finnish real estate firm Sponda "
    },
    {
        "content": "HELSINKI  June 5 Private equity group Blackstone Group said on Monday it had offered to buy all shares in Finnish real estate investment company Sponda for about 1.8 billion euros ($2.0 billion) as it seeks to expand its real estate business in the Nordic region.",
        "date": "06052017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone offers to buy Finnish real estate firm Sponda for $2 billion "
    },
    {
        "content": "(The following statement was released by the rating agency) SEOUL/SINGAPORE  June 05 (Fitch) Fitch Ratings has assigned Singapore-based Marble II Pte. Limited Long-Term Foreign- and Local-Currency Issuer Default Ratings (IDR) of 'BB'. The Outlook is Stable. The agency has simultaneously assigned an expected 'BB(EXP)' rating to the company's proposed USD500 million senior notes  which are secured by Marble I Pte. Limited's 100% equity stake in Marble II. The final rating on the notes is contingen",
        "date": "06052017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Fitch Assigns Marble II First-Time 'BB' Rating; Outlook Stable "
    },
    {
        "content": "LONDON Private equity group Blackstone  has agreed to sell European warehouse firm Logicor to China Investment Corporation [CIC.UL] (CIC) for 12.25 billion euros ($13.8 billion)  cementing China's position as a player in European private equity exits.",
        "date": "06022017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone sells Logicor to China Investment Corporation for $14 billion "
    },
    {
        "content": "LONDON  June 2 Private equity group Blackstone has agreed to sell warehouse company Logicor to China Investment Corporation for 12.25 billion euros ($13.8 billion)  the fund said on Friday.",
        "date": "06022017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone sells Logicor to China Investment Corporation for $14 bln "
    },
    {
        "content": "* Kosmos energy announces secondary public offering of common shares",
        "date": "05222017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "CORRECTED-BRIEF-Kosmos Energy announces secondary offering "
    },
    {
        "content": "RIYADH U.S. private equity firm Blackstone  and Saudi Arabia's main sovereign wealth fund said on Saturday they planned to create a $40 billion vehicle to invest in infrastructure projects  mainly in the United States.",
        "date": "05202017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone  Saudi's PIF plan $40 billion infrastructure investment fund "
    },
    {
        "content": "RIYADH  May 20 U.S. private equity firm Blackstone and Saudi Arabia's main sovereign wealth fund said on Saturday they planned to create a $40 billion vehicle to invest in infrastructure projects  mainly in the United States.",
        "date": "05202017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone  Saudi's PIF plan $40 bln infrastructure investment fund "
    },
    {
        "content": "RIYADH  May 20 U.S. private equity firm Blackstone and Saudi Arabia's main sovereign wealth fund said on Saturday they planned to create a $40 billion vehicle to invest in infrastructure projects  mainly in the United States.",
        "date": "05202017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone  Saudi's PIF plan $40 bln infrastructure investment fund "
    },
    {
        "content": "AMSTERDAM Intertrust   the Dutch trust company operator  said on Thursday a subsidiary of Blackstone Group  now owns a 23.39 percent stake in the company following a transaction in which it placed 10 million Intertrust shares with institutional investors.",
        "date": "05112017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Trust office operator Intertrust: Blackstone holds 23.39 percent stake "
    },
    {
        "content": "AMSTERDAM  May 11 Intertrust  the Dutch trust company operator  said on Thursday a subsidiary of Blackstone Group now owns a 23.39 percent stake in the company following a transaction in which it placed 10 million Intertrust shares with institutional investors. (Reporting by Toby Sterling; Editing by Amrutha Gayathri)",
        "date": "05112017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Trust office operator Intertrust: Blackstone holds 23.39 pct stake "
    },
    {
        "content": "May 7 Sinclair Broadcast Group Inc is nearing a deal to acquire Tribune Media Co for close to $4 billion after prevailing in an auction for one of the largest U.S. television station operators  according to people familiar with the matter.",
        "date": "05082017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 4-Sinclair Broadcast nears deal for Tribune Media "
    },
    {
        "content": "TORONTO/NEW YORK  May 2 Buyout firms Apollo Global Management LLC  Blackstone Group LP and Centerbridge Partners LP are among potential suitors studying bids for Canada's biggest alternative mortgage lender  Home Capital Group Inc  people familiar with the matter told Reuters.",
        "date": "05022017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 2-Apollo  Blackstone among potential bidders for Home Capital -sources "
    },
    {
        "content": "NEW YORK Twenty-First Century Fox Inc  is in talks with Blackstone Group LP  about submitting an offer to buy Tribune Media Co   one of the largest U.S. television station operators  sources familiar with the matter said on Sunday.",
        "date": "05012017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Twenty-First Century Fox in talks with Blackstone to buy Tribune "
    },
    {
        "content": "NEW YORK  April 30 Twenty-First Century Fox Inc is in talks with Blackstone Group LP about submitting an offer to buy Tribune Media Co  one of the largest U.S. television station operators  sources familiar with the matter said on Sunday.",
        "date": "05012017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Twenty-First Century Fox in talks with Blackstone to buy Tribune "
    },
    {
        "content": "* Zeta Global says has secured $140 million in its series f financing round from GPI Capital & Funds sponsored by franklin square capital partners Source text for Eikon: Further company coverage:",
        "date": "04272017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Zeta Global says has secured $140 mln in its series F financing round from GPI Capital & Funds sponsored by Franklin square capital partners "
    },
    {
        "content": "Blackstone Group LP   the largest manager of private equity and real estate assets  reported a bigger-than-expected jump in quarterly earnings on Thursday after the Wall Street rally helped it realize record proceeds from sales of its holdings.",
        "date": "04202017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone's earnings more than double on higher asset values "
    },
    {
        "content": "April 20 Blackstone Group LP  the largest manager of private equity and real estate assets  reported a bigger-than-expected jump in quarterly earnings on Thursday after the Wall Street rally helped it realize record proceeds from sales of its holdings.",
        "date": "04202017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 2-Blackstone's earnings more than double on higher asset values "
    },
    {
        "content": "April 20 Blackstone Group LP  the world's largest manager of assets such as private equity and real estate  reported a 165 percent rise in first-quarter earnings on Thursday  as the value of its holdings soared and it cashed out on some of them.",
        "date": "04202017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone's first-quarter earnings more than double "
    },
    {
        "content": "* Total assets under management grew to a record $368.2 billion at quarter end; increased 7 pct year-over-year",
        "date": "04202017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BRIEF-Blackstone says AUM grew to $368.2 billion at quarter end "
    },
    {
        "content": "EagleClaw Midstream Ventures LLC  the largest privately held operator of pipelines and processing facilities in West Texas' Delaware Basin  said it agreed to be bought by funds managed by Blackstone Group LP  for about $2 billion.",
        "date": "04172017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone to buy EagleClaw Midstream for about $2 billion "
    },
    {
        "content": "* EagleClaw's assets include over 375 miles of gas pipelines (Adds background)",
        "date": "04172017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 2-Blackstone to buy EagleClaw Midstream for about $2 bln "
    },
    {
        "content": "April 17 EagleClaw Midstream Ventures LLC said on Monday it agreed to be bought by funds managed by Blackstone Group LP for about $2 billion.",
        "date": "04172017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to buy EagleClaw Midstream for about $2 bln "
    },
    {
        "content": "Private equity firm Blackstone Group LP  is in advanced talks to acquire Ascend Learning LLC  a privately held U.S. maker of educational software  for more than $2 billion  including debt  according to people familiar with the matter.",
        "date": "04132017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Exclusive: Blackstone in advanced talks to buy Ascend Learning - sources "
    },
    {
        "content": "SYDNEY Blackstone Group  has put an A$3.5 billion ($2.65 billion) shopping mall portfolio in Australia up for sale  said a source familiar with the matter  in what could be one of the country's largest ever real estate transactions.",
        "date": "04052017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone to sell $2.7 billion Australian mall portfolio: source "
    },
    {
        "content": "SYDNEY  April 5 Blackstone Group has put an A$3.5 billion ($2.65 billion) shopping mall portfolio in Australia up for sale  said a source familiar with the matter  in what could be one of the country's largest ever real estate transactions.",
        "date": "04052017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to sell $2.7 bln Australian mall portfolio - source "
    },
    {
        "content": "NEW YORK  March 30 Pacific Investment Management Co on Thursday said it had hired Gregory Hall as a managing director and head of private strategies.",
        "date": "03302017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Pimco hires former Blackstone senior managing director Greg Hall "
    },
    {
        "content": "SeaWorld Entertainment Inc  said China's Zhonghong Zhuoye Group Co Ltd would buy Blackstone Group LP's  stake in the embattled U.S.-based marine park operator  sending SeaWorld's shares up 10 percent in morning trading on Friday.",
        "date": "03242017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "China's Zhonghong Zhuoye to buy Blackstone's stake in SeaWorld "
    },
    {
        "content": "* Shares rise about 10 pct to $19.00   (Adds background  shares)",
        "date": "03242017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 2-China's Zhonghong Zhuoye to buy Blackstone's stake in SeaWorld "
    },
    {
        "content": "March 24 China-based Zhonghong Zhuoye Group Co Ltd will buy Blackstone Group LP's 21 percent stake in SeaWorld Entertainment Inc  the embattled U.S.-based marine park operator said on Friday.",
        "date": "03242017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone sells 21 pct stake in SeaWorld to China's Zhonghong Zhuoye "
    },
    {
        "content": "Britain's Hansteen Holdings  has agreed to sell its German and Dutch property portfolios for 1.28 billion euros ($1.38 billion) to entities owned by funds advised by affiliates of the Blackstone Group LP  and M7 Real Estate  the company said on Monday.",
        "date": "03202017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Hansteen to sell German  Dutch industrial properties for $1.4 billion "
    },
    {
        "content": "March 20 Britain's Hansteen Holdings has agreed to sell its German and Dutch property portfolios for 1.28 billion euros ($1.38 billion) to entities owned by funds advised by affiliates of the Blackstone Group LP and M7 Real Estate  the company said on Monday.",
        "date": "03202017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Hansteen to sell German  Dutch industrial properties for $1.4 bln "
    },
    {
        "content": "* Blackstone looks to cash out of European warehouse platform - WSJ  citing sources",
        "date": "03212017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone looks to cash out of European warehouse platform - WSJ "
    },
    {
        "content": "LONDON Private equity firm Blackstone  is among a number of financial services companies to have chosen Luxembourg as the site for a European Union subsidiary following Britain's vote to leave the EU  the head of Luxembourg's financial development agency said.",
        "date": "03132017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone picks Luxembourg for EU base: Luxembourg official says "
    },
    {
        "content": "* NCR Corporation announces launch of secondary offering of series a convertible preferred stock and concurrent stock repurchase from the selling stockholders",
        "date": "03132017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BRIEF-NCR Corp announces launch of secondary offering of Series A convertible preferred stock "
    },
    {
        "content": "LONDON  March 10 Private equity firm Blackstone  has appointed more banks to help prepare for an initial public offering (IPO) of shares in its giant European warehouse owner Logicor  that could be valued at 13 billion euros ($13.8 billion)  according to two sources familiar with the matter.",
        "date": "03102017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone appoints more banks to prepare IPO for warehouse giant Logicor "
    },
    {
        "content": "* NCR announces Blackstone agreement  updates guidance and announces additional share repurchase authorization",
        "date": "03132017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BRIEF-NCR announces Blackstone agreement  updates guidance "
    },
    {
        "content": "LONDON  March 10 Private equity firm Blackstone  has appointed more banks to help prepare for an initial public offering (IPO) of shares in its European warehouse owner Logicor  that could be valued at 13 billion euros ($14 billion)  according to two sources familiar with the matter.",
        "date": "03102017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone appoints more banks to prepare IPO for warehouse giant Logicor "
    },
    {
        "content": "SINGAPORE/HONG KONG Private equity firms Warburg Pincus [WP.UL]  Blackstone Group LP  and Hopu Investment were among the bidders short-listed to present a potential offer for Singapore-listed Global Logistic Properties   people familiar with the process said on Tuesday.",
        "date": "02282017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Warburg Pincus  Blackstone in bidders' short-list for Singapore's GLP: sources "
    },
    {
        "content": "LONDON  Feb 27 Buyout firm Blackstone Group  and insurer Prudential are the preferred bidders for about 12.5 billion pounds ($15.5 billion) in mortgages made by failed British lender Bradford & Bingley  a person with knowledge of the matter said.",
        "date": "02272017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone  Prudential top pick for failed Bradford & Bingley's U.K. mortgages "
    },
    {
        "content": "SINGAPORE/HONG KONG  Feb 28 Private equity firms Warburg Pincus  Blackstone Group LP and Hopu Investment were among the bidders short-listed to present a potential offer for Singapore-listed Global Logistic Properties   people familiar with the process said on Tuesday.",
        "date": "02282017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Warburg Pincus  Blackstone in bidders' short-list for Singapore's GLP-sources "
    },
    {
        "content": "NEW YORK Private equity firm Blackstone Group LP  has agreed to acquire insurance broker Aon Plc's  employee benefits outsourcing business for around $4.8 billion  people familiar with the matter said on Thursday.",
        "date": "02092017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Exclusive: Blackstone to acquire Aon's benefits outsourcing for $4.8 billion - sources "
    },
    {
        "content": "Auto repair-center operator Service King Paint & Body LLC  owned by Blackstone Group LP and Carlyle Group LP  is considering a potential sale of the company for more than $2 billion  Bloomberg reported citing sources.",
        "date": "02142017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone and Carlyle Group consider sale of Service King: Bloomberg "
    },
    {
        "content": "Insurance broker Aon Plc  said on Friday it agreed to sell its employee benefits outsourcing business to private equity firm Blackstone Group LP  for up to $4.8 billion.",
        "date": "02102017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Aon to sell benefits outsourcing to Blackstone for up to $4.8 billion "
    },
    {
        "content": "LONDON  Feb 16 Blackstone has acquired a majority stake in cloud computing business Cloudreach for an undisclosed sum  the buyout fund said on Thursday.",
        "date": "02162017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone acquires London-based cloud computing firm Cloudreach "
    },
    {
        "content": "Feb 13 Auto repair-center operator Service King Paint & Body LLC  owned by Blackstone Group LP and Carlyle Group LP  is considering a potential sale of the company for more than $2 billion  Bloomberg reported citing sources.",
        "date": "02142017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "REFILE-Blackstone and Carlyle Group consider sale of Service King -Bloomberg "
    },
    {
        "content": "Feb 10 Insurance broker Aon Plc said on Friday it agreed to sell its employee benefits outsourcing business to private equity firm Blackstone Group LP for up to $4.8 billion.",
        "date": "02102017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 3-Aon to sell benefits outsourcing to Blackstone for up to $4.8 bln "
    },
    {
        "content": "* Blackstone announces acquisition of aon's technology-enabled benefits & hr platform",
        "date": "02102017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BRIEF-Blackstone Group announces acquisition of AON's technology-enabled benefits & HR platform "
    },
    {
        "content": "Feb 10 Insurance broker Aon PLC said on Friday it agreed to sell its benefits administration and HR BPO platform to Blackstone Group LP for $4.3 billion in cash.",
        "date": "02102017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Aon to sell benefits outsourcing to Blackstone for $4.3 bln "
    },
    {
        "content": "CHICAGO Blackstone Group LP said on Wednesday it will invest $500 million to renovate Chicago's Willis Tower  upgrading amenities for tenants and adding new dining and entertainment space in a building that was once the world's tallest.",
        "date": "02012017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone to invest $500 million in overhaul of Chicago's Willis Tower "
    },
    {
        "content": "CHICAGO  Feb 1 Blackstone Group LP said on Wednesday it will invest $500 million to renovate Chicago's Willis Tower  upgrading amenities for tenants and adding new dining and entertainment space in a building that was once the world's tallest.",
        "date": "02012017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to invest $500 mln in overhaul of Chicago's Willis Tower "
    },
    {
        "content": "NEW YORK  Jan 24 (IFR) - Some investors started trying to shrink their exposure Monday to the single-family rental bond market in advance of the Blackstone Group's planed IPO of its home rental company.",
        "date": "01242017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Investors eye SFR bond exit due to Blackstone IPO "
    },
    {
        "content": "NEW YORK Blackstone Group LP   the world's biggest alternative asset manager  said on Thursday it was hopeful it can cope with any U.S. tax reforms after posting better-than-expected fourth-quarter earnings on the back of a stronger stock market.",
        "date": "01262017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone's fourth-quarter profit beats forecasts "
    },
    {
        "content": "NEW YORK  Jan 26 Blackstone Group LP  the world's biggest alternative asset manager  said on Thursday it was hopeful it can cope with any U.S. tax reforms after posting better-than-expected fourth-quarter earnings on the back of a stronger stock market.",
        "date": "01262017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 2-Blackstone's 4th-quarter profit beats forecasts "
    },
    {
        "content": "* Quarter-End total assets under management reached $366.6 billion",
        "date": "01262017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BRIEF-Blackstone Group quarter-end total assets under management reached $366.6 bln "
    },
    {
        "content": "NEW YORK  Jan 26 Blackstone Group LP  the world's biggest alternative asset manager  posted better-than-expected fourth-quarter earnings on Thursday as gains across its investments almost doubled its income.",
        "date": "01262017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Buyout firm Blackstone Q4 earnings beat forecasts on broad gains "
    },
    {
        "content": "HONG KONG Blackstone Group LP  is readying a new Asia-focused real estate fund that aims to raise a record $5 billion or more  betting on strong returns from property investments in the region  people familiar with the plans told Reuters.",
        "date": "01232017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Exclusive: Blackstone readies new Asia real estate fund of at least $5 billion: sources "
    },
    {
        "content": "MADRID Spain's Banco Popular  has sold 620 million euros ($660.98 million) of non-performing property loans to U.S. asset managers Apollo  and Blackstone   a bank spokesman said on Thursday.",
        "date": "01122017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Banco Popular sells 620 million euros in loans to Blackstone  Apollo "
    },
    {
        "content": "* Kosmos energy -on January 11  2017  funds affiliated with Blackstone Group L.P. and warburg pincus have agreed to sell kosmos common shares in public offering",
        "date": "01112017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Kosmos Energy - on Jan. 11  2017  funds affiliated with Blackstone Group  Warburg Pincus have agreed to sell Kosmos common shares in public offering "
    },
    {
        "content": "Brookdale Senior Living Inc  is in talks with private equity firm Blackstone Group LP  and others about a potential deal to sell a part or all of the company  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "01102017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Brookdale Senior in deal talks with Blackstone  others: WSJ "
    },
    {
        "content": "Private-equity firm Blackstone Group LP  is no longer looking at buying a $5 billion stake in Energy Transfer Partners   a source familiar with the matter confirmed on Monday.",
        "date": "01092017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone ends talks for $5 billion Energy Transfer stake "
    },
    {
        "content": "Jan 9 Private-equity firm Blackstone Group LP  is no longer looking at buying a $5 billion stake in Energy Transfer Partners  a source familiar with the matter confirmed on Monday.",
        "date": "01092017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone ends talks for $5 bln Energy Transfer stake "
    },
    {
        "content": "Jan 9 Private-equity firm Blackstone Group LP  is no longer looking at buying a $5 billion stake in Energy Transfer Partners  Bloomberg reported on Monday  citing people familiar with the matter.",
        "date": "01092017",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone ends talks for $5 bln Energy Transfer stake - Bloomberg "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Blackstone is going long music. For its first venture into buying and holding companies for extended periods of time  the private-equity firm is taking over SESAC  a group that manages song rights for the likes of Bob Dylan and Mariah Carey. The growth of streaming provides a steady outlook. With some financial improvisation  it's easy to compose a healthy return.",
        "date": "01052017",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone's new investment tune hits right notes "
    },
    {
        "content": "Private-equity firm Blackstone Group LP is in talks to buy a stake in assets owned by Energy Transfer Partners LP  the company building the controversial Dakota Access pipeline  a source familiar with the situation said on Thursday.",
        "date": "12232016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone in talks to buy stake in Energy Transfer assets "
    },
    {
        "content": "BOSTON Blackstone Group  is winding down its \"big bet\" hedge fund Senfina Advisors LLC after it faced mounting double-digit losses on its investments this year  a spokeswoman confirmed on Tuesday.",
        "date": "12202016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Exclusive: Blackstone Group winds down Senfina hedge fund "
    },
    {
        "content": "BRUSSELS Belgian chemicals group Solvay  said on Wednesday it had agreed to sell its Acetow unit  which makes material used in cigarette filters  to private equity group Blackstone  for 1 billion euros ($1.07 billion)  including debt.",
        "date": "12072016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Solvay to sell cigarette filter business Acetow to Blackstone "
    },
    {
        "content": "LONDON/FRANKFURT Buyout fund Blackstone is hiring banks to prepare for an initial public offering (IPO) of its warehouse firm Logicor  several people with knowledge of the situation said.",
        "date": "12092016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone prepares to list European warehouse firm Logicor "
    },
    {
        "content": "Blackstone Group LP  Chairman and CEO Steve Schwarzman said on Tuesday he expected to see a \"very substantial reversal of regulations of all types \" for the financial sector  following Donald Trump's U.S. presidential election victory.",
        "date": "12062016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone's Schwarzman sees historic regulatory overhaul from Trump "
    },
    {
        "content": "Private equity firm KKR & Co  said on Tuesday it would acquire a majority stake in cybersecurity company Optiv Security Inc  which is majority owned by Blackstone Group LP .",
        "date": "12062016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "KKR to buy majority stake in cybersecurity firm Optiv from Blackstone "
    },
    {
        "content": "TOKYO China's Anbang Insurance Group Co [ANBANG.UL] is in talks to buy as much as $2.3 billion in Japanese residential property assets  from Blackstone Group   two people involved in the discussions said  in what would be Japan's biggest property deal since the global financial crisis.",
        "date": "11212016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Exclusive: China's Anbang may buy $2.3 billion in Japanese property from Blackstone - sources "
    },
    {
        "content": "* Blackstone Group  Carlyle Group LP  KKR & Co among buyout firms in talks with banks for financing to back bids for Valeant's Australian drug unit - Bloomberg",
        "date": "11102016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone  Carlyle  KKR among firms in talks to bid for Valeant's Inova unit - Bloomberg "
    },
    {
        "content": "Oct 31 TeamHealth Holdings Inc on Monday said private equity firm Blackstone Group LP would buy it for $6.1 billion  in a deal meant to help the U.S. hospital staffing company better cope with pricing pressure during a wave of consolidation.",
        "date": "10312016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "UPDATE 3-Blackstone to buy TeamHealth for $6.1 billion "
    },
    {
        "content": "TeamHealth Holdings Inc  on Monday said private equity firm Blackstone Group LP  would buy it for $6.1 billion  in a deal meant to help the U.S. hospital staffing company better cope with pricing pressure during a wave of consolidation.",
        "date": "10312016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to buy TeamHealth for $6.1 billion "
    },
    {
        "content": "* Teamhealth holdings inc says  blackstone and its co-investors will acquire all of outstanding shares of teamhealth common stock for $43.50 per share in cash",
        "date": "10312016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BRIEF-Teamhealth to be bought by Blackstone in $6.1 bln deal "
    },
    {
        "content": "Oct 31 U.S. hospital staffing provider TeamHealth Holdings Inc said on Monday it agreed to be acquired by Blackstone Group LP in a deal valued at about $6.1 billion.",
        "date": "10312016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to buy TeamHealth in $6.1 bln deal "
    },
    {
        "content": "* Says transactions to result in restructurings or lease terminations for 97 hcp-leased communities",
        "date": "11012016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Brookdale says enters into agreements with HCP and Blackstone "
    },
    {
        "content": "* Co cuts 2016 RevPAR growth forecast to 1.5-2 pct from 2-4 pct",
        "date": "10262016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 3-Weak business travel weighs on Hilton forecast "
    },
    {
        "content": "China's aviation and shipping giant HNA Group extended its push into hotels and Chinese tourism on Monday  paying $6.5 billion to buy a 25 percent stake in Hilton Worldwide Holdings Inc  from biggest shareholder Blackstone Group LP . | Video ",
        "date": "10252016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "China's HNA Group buys $6.5 billion stake in Hilton  extends hotels push "
    },
    {
        "content": "NEW YORK  Oct 27 Blackstone Group LP  the world's biggest alternative asset manager  posted stronger-than-expected third-quarter earnings on Thursday as rebounding oil prices and a firm U.S. stock market bolstered returns.",
        "date": "10272016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Buyout firm Blackstone Q3 earnings beat estimates "
    },
    {
        "content": "* Co cuts 2016 RevPAR growth forecast to 1.5-2 pct from 2-4 pct",
        "date": "10262016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "CORRECTED-UPDATE 2-Hilton forecasts slower growth for a key revenue measure "
    },
    {
        "content": "* Chinese overseas M&A spree at record $191 bln year-to-date   (Adds HNA Group details  Chinese buyers in hotel industry)",
        "date": "10252016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 3-China's HNA Group buys $6.5 bln stake in Hilton  extends hotels push "
    },
    {
        "content": "* Says has declared a quarterly distribution of $0.41 per common unit",
        "date": "10272016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BRIEF-Blackstone Group posts Q3 net income per common unit of $0.47 "
    },
    {
        "content": "Blackstone Group LP  is the lead bidder to acquire Team Health Holdings Inc   the U.S. hospital staffing provider that has been the target of activist funds  including Jana Partners LLC  according to people familiar with the matter.",
        "date": "10182016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone in the lead to acquire Team Health: sources "
    },
    {
        "content": "Oct 18 Blackstone Group LP is the lead bidder to acquire Team Health Holdings Inc  the U.S. hospital staffing provider that has been the target of activist funds  including Jana Partners LLC  according to people familiar with the matter.",
        "date": "10182016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone in the lead to acquire Team Health -sources "
    },
    {
        "content": "Oct 18 Blackstone Group LP is the lead bidder to acquire Team Health Holdings Inc  the U.S. hospital staffing provider that has been the target of activist funds  including Jana Partners LLC  according to people familiar with the matter.",
        "date": "10182016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone in lead to acquire Team Health -sources "
    },
    {
        "content": "* Team Health is in talks with Blackstone Group LP and Bain Capital and could reach a deal to go private this month-WSJ  citing sources  Source (http://on.wsj.com/2dHEs7B)",
        "date": "10042016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Team Health in talks with Blackstone and Bain Capital to go private- WSJ "
    },
    {
        "content": "* Blackstone updates its proposal for election of board members ahead of extraordinary general meeting in D. Carnegie & Co AB (publ) on Oct. 14  2016",
        "date": "10032016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF- D. Carnegie & Co: Blackstone updates proposal for election of board members "
    },
    {
        "content": "MANILA  Oct 4 The Philippines' Aboitiz Power Corp said on Tuesday it will acquire stakes held by funds managed by Blackstone Group LP in a local coal-fired power plant and another power project under construction for about $1.2 billion.",
        "date": "10042016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Philippines' AboitizPower to buy power plant stakes for $1.2 bln "
    },
    {
        "content": "* Blackstone Group L.P. Through Willis Lux Holdings 2 S.À R.L. and German Bmep Ord Gmbh & Co. Kg complete placement of 13.6 million shares in Scout24 AG",
        "date": "09232016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone completes placement of 13.6 million shares in Scout24 AG- bookrunner "
    },
    {
        "content": "* Blackstone Group  Arclight Capital Partners nearing deal to buy four midwest power plants from American Electric Power for about $2.1 bln - WSJ  citing sources  Source text : http://on.wsj.com/2c71Edq",
        "date": "09132016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone  ArcLight to buy Midwest power plants from AEP for about $2.1 bln - WSJ "
    },
    {
        "content": "* AEP to sell four competitive power plants to Blackstone and Arclight joint venture",
        "date": "09142016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-AEP to sell four power plants to Blackstone  Arclight JV "
    },
    {
        "content": "* Principal accounting officer Kathleen Skero reports open market sale of 11 500 shares of co's common stock at average price of $26.51 per share on Sept 7  Source: (http://bit.ly/2c6wBV7) Further company coverage:",
        "date": "09092016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone's Principal Accounting Officer reports open market sale of 11 500 shares of co "
    },
    {
        "content": "* Entered into an amended and restated $1.50 billion revolving credit facility",
        "date": "09072016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone Group enters into $1.50 bln revolving credit facility "
    },
    {
        "content": "BOSTON  Aug 31 Activist hedge fund Barington Capital has hired a new executive to spearhead marketing and investor relations at a time when the fund is putting up strong numbers but as investors' taste for portfolio managers who push for corporate change has ebbed.",
        "date": "08312016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Hedge fund Barington hires Moss from Optima to head marketing "
    },
    {
        "content": "FRANKFURT Buyout group Blackstone is in talks to acquire German real estate group Officefirst in a potential 3 billion euro ($3.6 billion) deal  three people familiar with the matter said.",
        "date": "08302016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone in talks to buy real estate group Officefirst: sources "
    },
    {
        "content": "FRANKFURT  Aug 30 Buyout group Blackstone  is in talks to acquire German real estate group Officefirst in a potential 3 billion euro ($3.6 billion) deal  three people familiar with the matter said.",
        "date": "08302016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone in talks to buy real estate group Officefirst -sources "
    },
    {
        "content": "Asset manager Blackstone Group LP  will invest about $1.5 billion in the oil-rich Permian basin  in Texas and New Mexico.",
        "date": "08252016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone to invest $1.5 billion in Permian basin "
    },
    {
        "content": "Aug 25 Asset manager Blackstone Group LP  will invest about $1.5 billion in the oil-rich Permian basin  in Texas and New Mexico.",
        "date": "08252016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to invest $1.5 bln in Permian basin "
    },
    {
        "content": "* Blackstone Energy Partners and Jetta form pure play Delaware basin acquisition partnership - Jetta Permian  LP",
        "date": "08252016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BRIEF-Blackstone  Jetta form pure play Delaware basin acquisition partnership "
    },
    {
        "content": "* JDA announces $570 million equity investment from Blackstone and New Mountain Capital",
        "date": "08192016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-JDA Announces $570 Million Equity Investment from Blackstone and New Mountain Capital "
    },
    {
        "content": "Blackstone Group LP  has offered a financing plan to help debt-laden U.S. supply chain management company JDA Software Group Inc  giving it an alternative option to selling itself to Honeywell International Inc   people familiar with the matter said.",
        "date": "08162016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Exclusive: Blackstone challenges Honeywell with JDA financing plan - sources "
    },
    {
        "content": "TAIPEI Blackstone  has pulled out of a potential $700 million investment in the Taipei 101 tower operator after the Taiwanese group declined to disclose certain financial details  two sources with direct knowledge of the situation told Reuters.",
        "date": "08162016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone pulls out of Taipei 101 tower deal: sources "
    },
    {
        "content": "NEW YORK Blackstone Group LP   the world's biggest alternative asset manager  posted stronger-than-expected earnings on Thursday as gains in property holdings and rebounding oil prices offset losses from Britain's shock decision to leave the European Union.",
        "date": "07212016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone profit beats forecasts on real estate  energy "
    },
    {
        "content": "NEW YORK  July 21 Blackstone Group LP  the world's biggest alternative asset manager  posted stronger-than-expected earnings on Thursday as gains in property holdings and rebounding oil prices offset losses from Britain's shock decision to leave the European Union.",
        "date": "07212016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 2-Blackstone profit beats forecasts on real estate  energy "
    },
    {
        "content": "NEW YORK  July 21 Blackstone Group LP  the world's largest alternative asset manager  reported higher-than-expected economic net income of 44 cents per share for the second quarter  helped by strong real estate investments and a rebound in energy prices.",
        "date": "07212016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone earnings beat forecasts on real estate  energy "
    },
    {
        "content": "HONG KONG Developer China Vanke Co Ltd  said on Thursday it and its partners have sealed a $1.9 billion deal with Blackstone Group LP  and third parties  with itself putting in 3.89 billion yuan ($583.02 million) to buy their property firms.",
        "date": "07212016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Vanke seals deal with Blackstone  chips in $583 million "
    },
    {
        "content": "HONG KONG  July 21 Developer China Vanke Co Ltd  said on Thursday it and its partners have sealed a $1.9 billion deal with Blackstone Group LP and third parties  with itself putting in 3.89 billion yuan ($583.02 million) to buy their property firms.",
        "date": "07212016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Vanke seals deal with Blackstone  chips in $583 mln "
    },
    {
        "content": "* Jim Breyer to join Blackstone's board of directors  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07142016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Jim Breyer to join Blackstone's board of directors "
    },
    {
        "content": "HONG KONG China Vanke Co Ltd  and its partners are in talks with Blackstone Group LP  and third parties to buy property firms for 12.9 billion yuan ($1.9 billion)  the Chinese developer said on Tuesday.",
        "date": "07122016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Vanke in talks with Blackstone to buy property firms for $1.9 billion "
    },
    {
        "content": "* Director who abstained from deal vote is employed by Blackstone",
        "date": "07122016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 2-Vanke in talks with Blackstone to buy property firms for $1.9 bln "
    },
    {
        "content": "HONG KONG  July 12 China Vanke Co Ltd  said it and partners planned to pay Blackstone Group L.P.  and other third parties 12.9 billion yuan ($1.9 billion) to acquire some commercial property firms.",
        "date": "07122016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "China Vanke  partners plan to pay Blackstone $1.9 bln for property firms "
    },
    {
        "content": "* Blackstone appoints marc bolland as head of european portfolio operations",
        "date": "07052016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone Group appoints Marc Bolland as head of European portfolio operations "
    },
    {
        "content": "BOSTON  June 22 Blackstone Group LP has bought a minority stake in $13 billion hedge fund Marathon Asset Management  the two companies said on Wednesday.",
        "date": "06222016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone buys minority stake in hedge fund Marathon "
    },
    {
        "content": "* Blackstone's pan-European retail platform  will manage Blanchardstown Centre post acquisition  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06172016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone acquires Blanchardstown Centre "
    },
    {
        "content": "BOSTON  June 22 Blackstone Group LP  the world's biggest investor in hedge funds  said on Wednesday that it bought a minority stake in $13 billion hedge fund Marathon Asset Management.",
        "date": "06222016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone buys minority stake in hedge fund Marathon "
    },
    {
        "content": "* Blackstone announces sale of majority interest in WindMW to China Three Gorges; WindMW is owner of Meerwind  one of Germany's largest offshore windfarms  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06132016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone sells sale majority interest in Germany's offshore windfarm WindMW "
    },
    {
        "content": "LONDON  June 13 China Three Gorges  which operates the world's largest hydropower plant on China's Yangtze river  will buy German offshore wind park Meerwind from U.S. buyout firm Blackstone  the companies said on Monday.",
        "date": "06132016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "China Three Gorges to buy German wind park Meerwind from Blackstone "
    },
    {
        "content": "* Blackstone announces sale of majority interest in windmw to china three gorges",
        "date": "06132016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BRIEF-Blackstone sells majority interest in WindMW to China Three Gorges "
    },
    {
        "content": "NEW YORK  May 10 Blackstone Group is hiring a former top enforcement lawyer at the U.S. Securities and Exchange Commission  a source said on Tuesday  less than a year after the world's largest alternative asset manager was fined by the regulator for failing to disclose certain fees.",
        "date": "05102016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "MOVES-Asset manager Blackstone to hire former top SEC lawyer -source "
    },
    {
        "content": "April 22 Stock futures pointed to a higher start for Canada's main stock index on Friday as oil prices hovered near $45 per barrel.",
        "date": "04222016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "CANADA STOCKS-Futures up as oil prices rise "
    },
    {
        "content": "Chinese life sciences entrepreneur Wei Zhou submitted a $1.5 billion bid for U.S. gene testing company Affymetrix last month - topping a $1.3 billion agreed acquisition by Thermo Fisher Scientific Inc . A few days later  he got an unusual deadline.",
        "date": "04272016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "U.S. companies skeptical of corporate China's advances "
    },
    {
        "content": "April 27 Chinese life sciences entrepreneur Wei Zhou submitted a $1.5 billion bid for U.S. gene testing company Affymetrix last month - topping a $1.3 billion agreed acquisition by Thermo Fisher Scientific Inc. A few days later  he got an unusual deadline.",
        "date": "04272016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "DEALTALK-U.S. companies skeptical of corporate China's advances "
    },
    {
        "content": "* Fed and BOJ monetary policy decisions in focus in next 24 hours",
        "date": "04272016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "FOREX-Dollar languishes ahead of Fed  BOJ meetings "
    },
    {
        "content": "NEW YORK Blackstone Group  the world's largest alternative asset manager  on Thursday posted unexpectedly weak earnings growth between January and March  hit by a difficult financial market  but it promised to scour for bargains in a tough environment.",
        "date": "04212016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone eyes bargains after first quarter earnings miss forecast "
    },
    {
        "content": "April 21 Shares of Canada's Concordia Healthcare Corp  surged 25 percent on Thursday after Bloomberg reported that U.S. private equity firm Blackstone Group LP is considering a takeover  citing people familiar with the matter.",
        "date": "04212016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Concordia shares surge after report of Blackstone interest "
    },
    {
        "content": "NEW YORK  April 21 Blackstone Group  the world's largest alternative asset manager  on Thursday posted unexpectedly weak earnings growth between January and March  hit by a difficult financial market  but it promised to scour for bargains in a tough environment.",
        "date": "04212016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 2-Blackstone eyes bargains after Q1 earnings miss forecast "
    },
    {
        "content": "April 21 Asset manager Blackstone Group LP  is considering a takeover of Canada's Concordia Healthcare Corp  Bloomberg reported  citing people familiar with the matter.",
        "date": "04212016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone in talks to buy Canada's Concordia Healthcare-Bloomberg "
    },
    {
        "content": "NEW YORK  April 21 Blackstone Group LP  the world's largest alternative asset manager  reported lower-than-expected economic net income of 31 cents per share for the first quarter as choppy financial markets dragged on investment returns.",
        "date": "04212016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone earnings miss forecast in choppy markets "
    },
    {
        "content": "* Says in Q1 reached $344 bln in total AUM  with $80 bln of gross inflows driving 11% year over-year AUM growth",
        "date": "04212016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BRIEF-Blackstone group Q1 total revenue falls to $929.4 mln "
    },
    {
        "content": "April 13 Cyber security company Optiv Security Inc is working with Goldman Sachs Group Inc and Morgan Stanley on an initial public offering that could come as soon as the second half of 2016  a source familiar with the matter said on Wednesday.",
        "date": "04132016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Optiv Security pursues IPO -source "
    },
    {
        "content": "* Blackstone Group LP Reports 15 pct active stake in CVR Partners LP As Of April 1  2016 - SEC filing",
        "date": "04112016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone Group LP reports 15 percent active stake in CVR Partners LP as of April 1  2016 "
    },
    {
        "content": "MUMBAI Blackstone Group  is buying a majority stake in Indian IT outsourcing services provider Mphasis Ltd  from Hewlett Packard Enterprise Co  in an up to $1.1 billion deal  in the U.S. asset manager's single-biggest investment in India.",
        "date": "04042016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone takes control of India's Mphasis in up to $1.1 billion deal "
    },
    {
        "content": "* Mphasis shares end down 2.9 pct  after rising 11 pct since March   (Adds details from conference call  analyst reaction)",
        "date": "04042016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 2-Blackstone takes control of India's Mphasis in up to $1.1 bln deal "
    },
    {
        "content": "RIO DE JANEIRO Investment firm Blackstone Group LP  on Sunday said it is not considering an acquisition of Brazilian shopping mall operator BR Malls Participacoes SA   denying a report published early in the day by newspaper O Globo.",
        "date": "04032016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone denies seeking to acquire Brazil mall operator "
    },
    {
        "content": "MADRID  April 6 The sale of hundreds of subsidised flats by Madrid's former city council to private equity investors such as Blackstone was riddled with flaws  a preliminary report from a local auditing body said on Wednesday.",
        "date": "04062016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Spanish social housing sale to Blackstone was flawed  auditor finds "
    },
    {
        "content": "MUMBAI  April 4 Blackstone Group LP has agreed to buy a majority stake in Indian IT outsourcing services provider Mphasis Ltd from Hewlett Packard Enterprise Co  in a deal that will cost up to $1.1 billion.",
        "date": "04042016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to buy majority of India's Mphasis in up to $1.1 bln deal "
    },
    {
        "content": "RIO DE JANEIRO  April 3 Investment firm Blackstone Group LP on Sunday said it is not considering an acquisition of Brazilian shopping mall operator BR Malls Participacoes SA  denying a report published early in the day by newspaper O Globo.",
        "date": "04032016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone denies seeking to acquire Brazil mall operator "
    },
    {
        "content": "RIO DE JANEIRO  April 3 Investment firm Blackstone Group LP hired advisers from JP Morgan Chase & Co. to consider acquiring a controlling stake in Brazilian shopping mall operator BR Malls Participacoes SA   a newspaper reported on Sunday.",
        "date": "04032016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone Group considering $3.38 billion mall deal in Brazil - paper "
    },
    {
        "content": "China's Anbang Insurance Group Co said on Thursday it has abandoned its $14 billion bid for Starwood Hotels & Resorts Worldwide Inc   paving the way for Marriott International Inc  to buy the Sheraton and Westin hotels operator.",
        "date": "04012016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "China's Anbang abandons $14 billion bid to buy Starwood Hotels "
    },
    {
        "content": "SEOUL/FRANKFURT Anbang Insurance Group has agreed to buy German insurer Allianz's  South Korean businesses for more than $3 million  the Chinese company said on Wednesday  extending a push that has so far seen it spend billions of dollars on overseas assets.",
        "date": "04062016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "China's Anbang resumes overseas push  pays $3 million for Allianz's Korean units "
    },
    {
        "content": "* Allianz sees up to 3-digit mln euro hit to P&L from sale   (Adds detail on sales price)",
        "date": "04062016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 3-China's Anbang resumes overseas push  pays $3 mln for Allianz's Korean units "
    },
    {
        "content": "* Anbang dropped out to avoid long bidding war - Primavera's Hu",
        "date": "04012016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 7-China's Anbang abandons $14 billion bid to buy Starwood Hotels "
    },
    {
        "content": "NEW YORK  March 12 China's Anbang Insurance Group has agreed to acquire Strategic Hotels & Resorts Inc for around $6.5 billion  as the owner of New York's iconic Waldorf Astoria expands its U.S. hotel portfolio  a person briefed on the matter said Saturday.",
        "date": "03122016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "China's Anbang to acquire Strategic Hotels for $6.5 billion- source "
    },
    {
        "content": "WASHINGTON China's Anbang Insurance Group  which is looking to buy U.S. hotel operator Starwood  has won approval from a U.S. national security panel to buy U.S. annuities and life insurer Fidelity & Guaranty Life  Fidelity said on Tuesday.",
        "date": "03152016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "China's Anbang wins U.S. security panel OK to buy Fidelity & Guaranty "
    },
    {
        "content": "* Starwood shares up 8 pct  Marriott up 3.1 pct   (Adds break-up fee in paragraph 21  graphic)",
        "date": "03142016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 5-China's Anbang challenges Marriott with $13 bln Starwood offer "
    },
    {
        "content": "WASHINGTON  March 15 China's Anbang Insurance Group  which is looking to buy U.S. hotel operator Starwood   has won approval from a U.S. national security panel to buy U.S. annuities and life insurer Fidelity & Guaranty Life   Fidelity said on Tuesday.",
        "date": "03152016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-China's Anbang wins U.S. security panel OK to buy Fidelity & Guaranty "
    },
    {
        "content": "WASHINGTON  March 15 China's Anbang Insurance Group  which is looking to buy U.S. hotel operator Starwood   has won approval from a U.S. national security panel to buy U.S. annuities and life insurer Fidelity & Guaranty Life .",
        "date": "03152016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "China's Anbang wins CFIUS approval to buy Fidelity & Guaranty Life "
    },
    {
        "content": "NEW YORK  Feb 26 Blackstone Group LP  Chief Executive Stephen Schwarzman took home $810.6 million in 2015  after the New York-based asset manager returned a record amount of cash to its shareholders following a wave of lucrative asset sales.",
        "date": "02272016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone CEO took home $810.6 million in 2015 "
    },
    {
        "content": "SINGAPORE Blackstone Group LP  and Hong Kong-based Gaw Capital Partners are among three suitors that submitted preliminary bids to buy Singapore's Ascendas Hospitality Trust   people familiar with the matter said.",
        "date": "02262016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone  Gaw Capital make initial bids for Ascendas Hospitality: sources "
    },
    {
        "content": "SINGAPORE  Feb 26 Blackstone Group LP and Hong Kong-based Gaw Capital Partners are among three suitors that submitted preliminary bids to buy Singapore's Ascendas Hospitality Trust  people familiar with the matter said.",
        "date": "02262016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone  Gaw Capital make initial bids for Ascendas Hospitality - sources "
    },
    {
        "content": "BEIJING  Feb 1 U.S. private equity firm Blackstone Group has reduced its stake in a key unit of state-owned China National Chemical Corp (ChemChina)  by more than half to less than 10 percent  two people with knowledge of the situation told Reuters.",
        "date": "02012016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone has cut stake in ChemChina unit to below 10 pct-sources "
    },
    {
        "content": "Canada's Amaya Inc    operator of online gambling website PokerStars  said it received a non-binding proposal from Chief Executive David Baazov to take the company private.",
        "date": "02012016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "PokerStars owner Amaya says CEO proposes takeover "
    },
    {
        "content": "NEW YORK Blackstone Group LP   the world's largest alternative asset manager  said on Thursday it is seizing on the market turmoil to make new investments  as it posted disappointing fourth-quarter earnings due partly to falling oil prices.",
        "date": "01282016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone ups new investments as fourth quarter earnings disappoint "
    },
    {
        "content": "* Q4 economic net income slumps 70 percent y/y to $0.37/shr   (Adds background  quote  share price)",
        "date": "01282016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 2-Blackstone ups new investments as Q4 earnings disappoint "
    },
    {
        "content": "NEW YORK  Jan 28 Blackstone Group LP  the world's largest alternative asset manager  posted a lower-than-expected economic net income (ENI) of 37 cents per share in the fourth quarter as falling energy and stock prices dragged on its investments.",
        "date": "01282016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone's Q4 earnings miss forecasts "
    },
    {
        "content": "LONDON Blackstone Group is planning to bring its multi-manager hedge fund platform Senfina Advisors to Britain  three sources with direct knowledge of the move told Reuters.",
        "date": "01082016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Exclusive: Blackstone to launch hedge fund platform Senfina in Britain "
    },
    {
        "content": "LONDON Blackstone Group  is planning to bring its multi-manager hedge fund platform Senfina Advisors to Britain  three sources with direct knowledge of the move told Reuters.",
        "date": "01072016",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Exclusive: Blackstone to launch hedge fund platform Senfina in Britain "
    },
    {
        "content": "SINGAPORE Private equity investors Blackstone Group LP  and Gaw Capital Partners are weighing separate bids for Singapore's Ascendas Hospitality Trust   people familiar with the matter said  eyeing a target with a market value $600 million.",
        "date": "01072016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone  Gaw Capital weigh bids for Ascendas Hospitality Trust: sources "
    },
    {
        "content": "* Weak valuations seen spurring more property trust deals   (Adds details on trust  security price movement)",
        "date": "01072016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone  Gaw Capital weigh bids for Ascendas Hospitality Trust - sources "
    },
    {
        "content": "SINGAPORE  Jan 7 Private equity investors Blackstone Group LP and Gaw Capital Partners are weighing separate bids for Singapore's Ascendas Hospitality Trust   people familiar with the matter said on Thursday.",
        "date": "01072016",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone  Gaw Capital weigh bids for Ascendas Hospitality Trust - sources "
    },
    {
        "content": "Blackstone Group LP   the largest alternative asset manager  said on Monday it had raised $18 billion for its latest global private equity fund  highlighting the healthy pace of fundraising by large buyout firms.",
        "date": "12152015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone raises $18 billion for global buyout fund "
    },
    {
        "content": "MUMBAI U.S. private equity firm Blackstone Group LP has bought a minority stake in India's IBS Software for $170 million from  General Atlantic and other shareholders.",
        "date": "12162015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone invests $170 million in India's IBS Software "
    },
    {
        "content": "MUMBAI  Dec 16 U.S. private equity firm Blackstone Group LP has bought a minority stake in India's IBS Software for $170 million from  General Atlantic and other shareholders  according to a joint statement.",
        "date": "12162015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone invests $170 mln in India's IBS Software "
    },
    {
        "content": "MUMBAI  Dec 16 U.S. private equity firm Blackstone Group LP has bought a minority stake in India's IBS Software for $170 million from  General Atlantic and other shareholders.",
        "date": "12162015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone invests $170 mln in India's IBS Software "
    },
    {
        "content": "Blackstone Group LP  the largest alternative asset manager  said on Monday it had raised $18 billion for its latest global private equity fund  highlighting the healthy pace of fundraising by large buyout firms.",
        "date": "12142015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone raises $18 billion for global buyout fund "
    },
    {
        "content": "Dec 14 Blackstone Group LP  the largest alternative asset manager  said on Monday it had raised $18 billion for its latest global private equity fund  highlighting the healthy pace of fundraising by large buyout firms.",
        "date": "12142015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone raises $18 bln for global buyout fund "
    },
    {
        "content": "Nov 23 General Electric Co said on Monday it would sell its $5.9 billion portfolio of UK home loans to an investment consortium led by Blackstone Group LP  as it exits its UK mortgage business.",
        "date": "11232015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "UPDATE 1-GE to sell UK home loan portfolio to Blackstone-led consortium "
    },
    {
        "content": "Nov 23 General Electric Co said on Monday it would sell its $5.9 billion worth portfolio of UK home loans to an investment consortium led by Blackstone Group LP  as it exits its UK mortgage business.",
        "date": "11232015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "GE to sell UK home lending portfolio to Blackstone-led consortium "
    },
    {
        "content": "NEW YORK Main Street investors in the United States may soon be a step closer to stocking their retirement accounts with hedge fund portfolios called liquid alternatives  a top executive at the Blackstone Group said on Monday.",
        "date": "11162015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone sees progress in getting hedge funds into retirement plans "
    },
    {
        "content": "NEW YORK Blackstone Group   the world's largest alternative asset manager  is considering adjusting its investment strategy in the wake of last week's deadly attacks in Paris.",
        "date": "11162015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "After Paris attacks  Blackstone weighs consumer fear "
    },
    {
        "content": "Shares of SunEdison Inc  slid 10 percent in extended trade on Wednesday after Reuters reported that Blackstone Group LP's  credit investment arm GSO was not looking to invest in the solar company  which is facing concerns on Wall Street about its access to capital.",
        "date": "11182015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone's GSO will not backstop SunEdison debt: source "
    },
    {
        "content": "NEW YORK Blackstone Group LP   which invests clients' money with William Ackman's Pershing Square Capital Management  is sticking with the hedge fund manager despite his heavy losses in Valeant Pharmaceuticals International Inc   said Tom Hill  president and chief executive officer of Blackstone Alternative Asset Management.",
        "date": "11162015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone remains confident in Ackman's Pershing Square: Hill "
    },
    {
        "content": "Nov 18 Blackstone Group LP's credit investment arm GSO is not looking to invest in solar company SunEdison Inc  a person familiar with the matter said on Wednesday on condition of anonymity.",
        "date": "11182015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone's GSO not looking at SunEdison -source "
    },
    {
        "content": "* For other news from Reuters Global Investment Outlook Summit  click on http://www.reuters.com/summit/Investment16   (Adds more comments from summit  background on Pershing Square)",
        "date": "11162015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "REUTERS SUMMIT-Blackstone remains confident in Ackman's Pershing Square -Hill "
    },
    {
        "content": "* For other news from Reuters Global Investment Outlook Summit  click on http://www.reuters.com/summit/Investment16",
        "date": "11162015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "REUTERS SUMMIT-Blackstone to stick with Ackman's Pershing Square -Hill "
    },
    {
        "content": "TOKYO U.S. asset manager Blackstone Group LP  said on Friday it is acquiring Japan Residential Investment Company   which owns residential assets in Japan  in a deal worth about $450 million  including debt.",
        "date": "11132015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone to buy Japan Residential for $450 million including debt "
    },
    {
        "content": "Blackstone Group LP  said on Monday it would sell facility management company GCA Services Group Inc to a consortium of Goldman Sachs Group Inc's  private equity arm and Thomas H.Lee Partners LP.",
        "date": "11162015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to sell GCA Services to Thomas Lee  Goldman Sachs "
    },
    {
        "content": "Nov 16 Blackstone Group LP said on Monday it would sell facility management company GCA Services Group Inc to a consortium of Goldman Sachs Group Inc's private equity arm and Thomas H.Lee Partners LP.",
        "date": "11162015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "REFILE-Blackstone to sell GCA Services to Thomas Lee  Goldman Sachs "
    },
    {
        "content": "TOKYO  Nov 13 U.S. asset manager Blackstone Group LP said on Friday it is acquiring Japan Residential Investment Company  which owns residential assets in Japan  in a deal worth about $450 million  including debt.",
        "date": "11132015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to buy Japan Residential for $450 mln including debt "
    },
    {
        "content": "Nov 15 Goldman Sachs Group Inc's private equity arm and buyout firm Thomas H. Lee Partners LP have agreed to acquire facility management company GCA Services Group Inc from Blackstone Group LP  according to people familiar with the matter.",
        "date": "11162015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Goldman  Thomas H. Lee to acquire Blackstone's GCA Services-sources "
    },
    {
        "content": "NCR Corp   one of the world's biggest makers of automated teller machines  said on Thursday that private equity firm Blackstone Group LP  would invest $820 million in the company to receive a 17 percent stake.",
        "date": "11122015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone to invest $820 million in ATM-maker NCR Corp "
    },
    {
        "content": "Blackstone Group LP  has agreed to invest more than $800 million in NCR Corp  that will give it the equivalent of more than a 15 percent stake in the automated teller machines maker  a source familiar with the matter said on Wednesday.",
        "date": "11112015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone to take minority stake in NCR Corp: source "
    },
    {
        "content": "Nov 12 NCR Corp  one of the world's biggest makers of automated teller machines  said on Thursday that private equity firm Blackstone Group LP would invest $820 million in the company to receive a 17 percent stake.",
        "date": "11122015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 3-Blackstone to invest $820 mln in ATM-maker NCR Corp "
    },
    {
        "content": "Blackstone Group LP  the world's largest alternative asset manager  has agreed to buy about $3 billion worth of stakes in real estate funds from Californian public pension fund Calpers  a boost to its so-called secondaries business.",
        "date": "11122015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to buy about $3 billion in property fund stakes from Calpers "
    },
    {
        "content": "Nov 11 Blackstone Group LP has agreed to invest more than $800 million in NCR Corp that will give it the equivalent of more than a 15 percent stake in the automated teller machines maker  a source familiar with the matter said on Wednesday.",
        "date": "11112015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to take minority stake in NCR Corp -source "
    },
    {
        "content": "Nov 12 Blackstone Group LP  the world's largest alternative asset manager  has agreed to buy about $3 billion worth of stakes in real estate funds from Californian public pension fund Calpers  a boost to its so-called secondaries business.",
        "date": "11122015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to buy about $3 bln in property fund stakes from Calpers "
    },
    {
        "content": "Activist investor P. Schoenfeld Asset Management (PSAM) is questioning NCR Corp's  motivation for striking a deal that gave Blackstone Group  a major stake in the company  according to sources familiar with the matter.",
        "date": "11122015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Activist investor PSAM questions NCR deal with Blackstone: sources "
    },
    {
        "content": "Nov 12 Activist investor P. Schoenfeld Asset Management (PSAM) is questioning NCR Corp's motivation for striking a deal that gave Blackstone Group a major stake in the company  according to sources familiar with the matter.",
        "date": "11122015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Activist investor PSAM questions NCR deal with Blackstone-sources "
    },
    {
        "content": "Nov 12 NCR Corp  a maker of automated teller machines  said Blackstone Group LP would invest $820 million to help it speed up its transformation into a software and services company.",
        "date": "11122015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to invest $820 mln in NCR Corp "
    },
    {
        "content": "Blackstone Group LP  has agreed to invest more than $800 million in NCR Corp  that will give it the equivalent of more than a 15 percent stake in the automated teller machines maker  a source familiar with the matter said on Wednesday.",
        "date": "11122015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to take minority stake in NCR Corp: source "
    },
    {
        "content": "TAIPEI Taipei Financial Center Corp (TFCC)  which operates skyscraper Taipei 101  said it has allowed Blackstone Group  to examine its financial books ahead of a potential stake purchase in it by the U.S. private equity firm.",
        "date": "10282015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Taiwan's TFCC allows Blackstone to inspect books before potential stake deal "
    },
    {
        "content": "ADDIS ABABA  Oct 28 Black Rhino  owned by funds of U.S. investment company Blackstone Group  said on Wednesday it was looking at investments in Ethiopia's power generation sector.",
        "date": "10282015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Black Rhino looks at renewable power investments in Ethiopia "
    },
    {
        "content": "TOKYO  Oct 28 Japanese developer Hulic Co  will buy Tokyo-based Simplex Investment Advisors for about 155 billion yen ($1.3 billion) from U.S. investment Aetos Capital in Japan's largest property deal this year  the two firms said on Wednesday.",
        "date": "10282015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "REFILE-UPDATE 2-Japan's Hulic will buy Simplex for $1.3 bln  sell some assets "
    },
    {
        "content": "* Blackstone seeks to buy 37 pct in TFCC  its 1st Taiwan foray   (Updates to change sourcing to TFCC)",
        "date": "10282015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Taiwan's TFCC allows Blackstone to inspect books before potential stake deal "
    },
    {
        "content": "TAIPEI  Oct 28 Taipei Financial Center Corp (TFCC)  which operates skyscraper Taipei 101  has allowed Blackstone Group to examine its financial books ahead of a potential stake purchase in it by the U.S. private equity firm  according to two sources with direct knowledge of the matter.",
        "date": "10282015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Taiwan's TFCC allows Blackstone to check books ahead of potential stake sale-sources "
    },
    {
        "content": "TOKYO Japanese developer Hulic Co will buy Tokyo-based Simplex Investment Advisors for about 155 billion yen ($1.3 billion) but only plans to keep the firm's properties and will sell its other assets  a person involved in the deal said on Wednesday.",
        "date": "10282015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Japan's Hulic to buy Simplex for $1.3 billion  to sell some assets: source "
    },
    {
        "content": "Blackstone Group LP is nearing a deal to acquire Manhattan's Stuyvesant Town-Peter Cooper Village apartment complex for around $5.3 billion  according to a person familiar with the matter who was not authorized to discuss it publicly.",
        "date": "10202015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone nears deal to buy Manhattan apartment complex for $5.3 bln - source "
    },
    {
        "content": "Blackstone Group LP  is nearing a deal to acquire Manhattan's Stuyvesant Town-Peter Cooper Village apartment complex for around $5.3 billion  according to a person familiar with the matter who was not authorized to discuss it publicly.",
        "date": "10202015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone nears deal to buy Manhattan apartment complex for $5.3 billion - source "
    },
    {
        "content": "Oct 19 Blackstone Group LP is nearing a deal to acquire Manhattan's Stuyvesant Town-Peter Cooper Village apartment complex for around $5.3 billion  according to a person familiar with the matter who was not authorized to discuss it publicly.",
        "date": "10202015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone nears deal to buy Manhattan apartment complex for $5.3 bln - source "
    },
    {
        "content": "Oct 15 Blackstone Group LP  the world's largest alternative asset manager  reported a third-quarter economic net loss on Thursday as the stock market plunge weighed on the value of its portfolio  though it generated more cash through asset sales.",
        "date": "10152015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone posts third-quarter loss as asset values drop "
    },
    {
        "content": "Oct 15 Blackstone Group LP  the largest alternative asset manager  reported its first quarterly economic net loss in four years on Thursday  as the summer's stock market plunge weighed on the value of its portfolio  even as it generated more cash.",
        "date": "10152015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 2-Blackstone posts third-quarter loss as asset values drop "
    },
    {
        "content": "Blackstone Group LP agreed to buy BioMed Realty Trust Inc  a supplier of office space to healthcare companies  in a deal valued at $8 billion  adding to the private equity firm's huge real estate portfolio.",
        "date": "10082015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone to buy BioMed Realty in $8 billion deal "
    },
    {
        "content": "* Shares rise 8.6 pct  shy of offer price   (Adds background  share movement)",
        "date": "10082015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 2-Blackstone to buy BioMed Realty in $8 bln deal "
    },
    {
        "content": "WASHINGTON  Oct 7 Blackstone Group  the world's largest private equity firm  will pay about $39 million to settle civil charges over disclosure failures in connection with certain types of fees it charged its portfolio companies  U.S. regulators said on Wednesday.",
        "date": "10072015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to pay about $39 mln to settle SEC charges over fees "
    },
    {
        "content": "WASHINGTON Blackstone Group  the world's largest private equity firm  will pay about $39 million to settle civil charges over disclosure failures in connection with certain types of fees it charged its portfolio companies  U.S. regulators said on Wednesday.",
        "date": "10072015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to pay about $39 million to settle SEC charges over fees "
    },
    {
        "content": "WASHINGTON  Oct 7 Blackstone Group  the world's largest private equity firm  will pay about $39 million to settle civil charges over disclosure failures in connection with certain types of fees it charged its portfolio companies  U.S. regulators said on Wednesday.",
        "date": "10072015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 2-Blackstone to pay about $39 mln to settle SEC charges over fees "
    },
    {
        "content": "JPMorgan Chase & Co plans to bid for about 12 billion pounds ($18.2 billion) of mortgages being sold by the British government's \"bad bank\"  Bloomberg reported on Thursday.",
        "date": "10012015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "JPMorgan to bid for about 12 billion pounds UK mortgage book: Bloomberg "
    },
    {
        "content": "NAIROBI  Sept 30 Black Rhino  owned by funds of U.S. investment firm Blackstone Group  and a South African-based firm have signed framework agreements to build a fuel pipeline between Djibouti and Ethiopia  the contractors said on Wednesday.",
        "date": "09302015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Contractors sign deal to build Djibouti-Ethiopia fuel pipeline "
    },
    {
        "content": "Sept 22 The following bids  mergers  acquisitions and disposals were reported by 2010 GMT on Tuesday:",
        "date": "09222015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Blackstone Group LP  is once again taking a look at bidding for NCR Corp   according to a person familiar with the matter.",
        "date": "09112015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone considers bidding for NCR: source "
    },
    {
        "content": "Sept 11 Blackstone Group LP is once again taking a look at bidding for NCR Corp  according to a person familiar with the matter.",
        "date": "09112015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone considers bidding for NCR -source "
    },
    {
        "content": "Blackstone Group LP  will buy real estate investment trust Strategic Hotels & Resorts  in a deal valued at $6 billion  attracted by the company's iconic hotel properties in key locations of the United States.",
        "date": "09082015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone to buy Strategic Hotels in $6 billion deal "
    },
    {
        "content": "* Deal expected to close by 1st-qtr 2016   (Adds Breakingviews link)",
        "date": "09082015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 3-Blackstone to buy Strategic Hotels in $6 bln deal "
    },
    {
        "content": "Sept 8 The following bids  mergers  acquisitions and disposals were reported by  2000 GMT on Tuesday:",
        "date": "09082015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Sept 8 Strategic Hotels & Resorts Inc  said affiliates of Blackstone Real Estate Partners VIII LP  the real estate fund of Blackstone Group LP  would buy the company and  subsidiary Strategic Hotels Funding LLC in a deal valued at $6 billion including debt.",
        "date": "09082015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to buy Strategic Hotels & Resorts for $6 bln "
    },
    {
        "content": "Aug 25 German payments company Wirecard AG  has joined the bidding for British rival Worldpay Ltd   Bloomberg reported.",
        "date": "08252015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "German payments company Wirecard to bid for Worldpay - Bloomberg "
    },
    {
        "content": "Blackstone Group LP  is exploring the sale of GCA Services Group Inc  in a deal that could value the provider of janitors and cleaners to schools and businesses at more than $1 billion  including debt  according to people familiar with the matter.",
        "date": "08102015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone seeks sale of facility management firm GCA: sources "
    },
    {
        "content": "Aug 10 Blackstone Group LP is exploring the sale of GCA Services Group Inc  in a deal that could value the provider of janitors and cleaners to schools and businesses at more than $1 billion  including debt  according to people familiar with the matter.",
        "date": "08102015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone seeks sale of facility management firm GCA-sources "
    },
    {
        "content": "TOKYO U.S. investment funds Blackstone Group   Fortress Investment Group  and Elliot Management are among those shortlisted for the second round of bidding to buy Japan's Simplex Investment Advisors in a deal that could top $1 billion  three people with knowledge of the transaction said.",
        "date": "08032015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone  Fortress among bidders for Japan's Simplex: sources "
    },
    {
        "content": "TOKYO  Aug 3 U.S. investment funds Blackstone Group  Fortress Investment Group and Elliot Management are among those shortlisted for the second round of bidding to buy Japan's Simplex Investment Advisors in a deal that could top $1 billion  three people with knowledge of the transaction said.",
        "date": "08032015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone  Fortress among bidders for Japan's Simplex-sources "
    },
    {
        "content": "Plastic packaging products maker Berry Plastics Group Inc  said it would buy Avintiv Inc  which makes materials used in products ranging from diapers to disinfectant wipes  for about $2.45 billion in cash from Blackstone Group LP .",
        "date": "07312015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Berry Plastics to buy Blackstone-owned Avintiv for $2.45 billion "
    },
    {
        "content": "July 30 A fund run by U.S. private equity firm Blackstone Group has sold its 97.9 percent stake in Indian auto components maker  Agile Electric Sub Assembly to a group of buyers  including Japan's Igarashi Electric Works  for an undisclosed amount.",
        "date": "07302015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone sells stake in Indian auto parts maker to consortium "
    },
    {
        "content": "July 31 Plastic packaging products maker Berry Plastics Group Inc said it would buy Avintiv Inc  which makes materials used in products ranging from diapers to disinfectant wipes  for about $2.45 billion in cash from Blackstone Group LP.",
        "date": "07312015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Berry Plastics to buy Blackstone-owned Avintiv for $2.45 bln "
    },
    {
        "content": "July 31 Berry Plastics Group Inc said it would buy Avintiv Inc  which makes materials used in products ranging from diapers to disinfectant wipes  for about $2.45 billion in cash from Blackstone Group LP.",
        "date": "07312015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Berry Plastics to buy Blackstone-owned Avintiv for $2.45 bln "
    },
    {
        "content": "July 24 Blackstone Group LP said Chief Financial Officer Laurence Tosi had resigned to become the CFO of online home rental website Airbnb Inc.",
        "date": "07242015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Airbnb hires Blackstone CFO Tosi "
    },
    {
        "content": "July 24 Airbnb Inc  the fast-growing online home rental website operator  said it hired Blackstone Group LP  Chief Financial Officer Laurence Tosi as its finance head.",
        "date": "07242015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Airbnb hires Blackstone CFO Tosi "
    },
    {
        "content": "Airbnb Inc  the website where home owners rent out properties on a temporary basis  has hired Blackstone Group LP  Chief Financial Officer Laurence Tosi to fill its own CFO vacancy  Bloomberg reported on Thursday  citing anonymous sources.",
        "date": "07232015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Airbnb hires Blackstone CFO Tosi: Bloomberg "
    },
    {
        "content": "NEW YORK John McCormick has been on a mission for the past five years: to bring hedge funds to the masses.",
        "date": "07222015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Special Report: Blackstone champions hedge funds for the little guy "
    },
    {
        "content": "July 23 Airbnb Inc  the website where home owners rent out properties on a temporary basis  has hired Blackstone Group LP Chief Financial Officer Laurence Tosi to fill its own CFO vacancy  Bloomberg reported on Thursday  citing anonymous sources.",
        "date": "07232015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Airbnb hires Blackstone CFO Tosi - Bloomberg "
    },
    {
        "content": "NEW YORK  July 22 John McCormick has been on a mission for the past five years: to bring hedge funds to the masses.",
        "date": "07222015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "SPECIAL REPORT-Blackstone champions hedge funds for the little guy "
    },
    {
        "content": "July 20 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "07202015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Private equity firms Blackstone Group LP and Corsair Capital have agreed to acquire a majority stake in First Eagle Investment Management  valuing the company at around $4 billion including debt  First Eagle announced on Monday.",
        "date": "07202015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone  Corsair clinch $4 billion deal for First Eagle "
    },
    {
        "content": "Blackstone Group LP   the world's largest alternative asset manager  reported a 62 percent slump in second-quarter earnings on Thursday  yet performance fee revenue generated from selling assets surpassed many analysts' expectations.",
        "date": "07162015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone earnings slump 62 percent but performance fees strong "
    },
    {
        "content": "July 13 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "07132015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "MOVES-JPMorgan  Templeton  Fitch and Bluebay "
    },
    {
        "content": "July 20 Private equity firms Blackstone Group LP  and Corsair Capital have agreed to acquire a majority stake in First Eagle Investment Management  valuing the company at around $4 billion including debt  First Eagle announced on Monday.",
        "date": "07202015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 2-Blackstone  Corsair clinch $4 bln deal for First Eagle "
    },
    {
        "content": "July 20 Private equity firms Blackstone Group LP  and Corsair Capital have agreed to acquire a majority stake in First Eagle Investment Management  valuing the company at around $4 billion including debt  according to people familiar with the matter.",
        "date": "07202015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone  Corsair clinch $4 bln deal for First Eagle -sources "
    },
    {
        "content": "(Adds analyst comment  updates shares)     By Greg Roumeliotis     July 16 Blackstone Group LP  the world's largest alternative asset manager  reported a 62 percent slump in second-quarter earnings on Thursday  yet performance fee revenue generated from selling assets surpassed many analysts' expectations.     Weak global stock markets weighed on the value of Blackstone's portfolio in the quarter. But investors cheered as the New York-based firm declared its third highest quarterl",
        "date": "07162015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 3-Blackstone earnings slump 62 pct but performance fees strong "
    },
    {
        "content": "July 16 Blackstone Group LP  the world's largest alternative asset manager  reported a 62 percent slump in second-quarter earnings  blaming weak global equity markets that weighed on the value of some of its holdings.",
        "date": "07162015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "CORRECTED-Blackstone quarterly earnings slump 62 pct amid weak world equity markets "
    },
    {
        "content": "* Neil Harvey to serve as Credit Suisse's Greater China CEO   (Recasts with company confirmation)",
        "date": "07042015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "UPDATE 2-MOVES-Blackstone hires Liping Zhang as Greater China chairman -sources "
    },
    {
        "content": "LONDON/HONG KONG July 3 Private-equity firm Blackstone Group LP has hired Liping Zhang as its chairman for Greater China  sources familiar with the move said on Friday.",
        "date": "07032015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "MOVES-C.Suisse banker leaving for Blackstone as Greater China chair -sources "
    },
    {
        "content": "July 3 Private equity firm Blackstone Group LP  has hired Liping Zhang as its chairman for Greater China  sources familiar with the move said on Friday.",
        "date": "07032015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone hires ex-Credit Suisse executive as Greater China chairman-sources "
    },
    {
        "content": "Blackstone Group LP is seeking to restructure some of the 6.4 billion euros ($7.13 billion) of Spanish home loans it bought last year to help borrowers meet repayments  Bloomberg reported  citing people familiar with the matter.",
        "date": "07012015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone to offer debt relief on some Spanish mortgages: Bloomberg "
    },
    {
        "content": "July 1 Blackstone Group LP is seeking to restructure some of the 6.4 billion euros ($7.13 billion) of Spanish home loans it bought last year to help borrowers meet repayments  Bloomberg reported  citing people familiar with the matter.",
        "date": "07012015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to offer debt relief on some Spanish mortgages- Bloomberg "
    },
    {
        "content": "June 16 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "06162015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Blackstone Group LP has sold a 25 percent stake in Irish telecoms firm Eircom to hedge fund Anchorage Capital Group  a source familiar with the matter said on Wednesday  a day after Eircom rejected a 3.3 billion euro ($3.66 billion) buyout offer.",
        "date": "05202015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone sells 25 percent of Eircom to Anchorage Capital: source "
    },
    {
        "content": "TOKYO  May 13 Blackstone Group  Hong Kong-based investor PAG and Japanese property firm Hulic Co  are among potential bidders for property asset manager Simplex Investment Advisors in a deal that could fetch around 150 billion yen ($1.25 billion)  people with knowledge of the matter said.",
        "date": "05132015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone  PAG eyeing bids for Japan's Simplex in deal seen worth $1.25 bln -sources "
    },
    {
        "content": "May 20 Blackstone Group LP has sold a 25 percent stake in Irish telecoms firm Eircom to hedge fund Anchorage Capital Group  a source familiar with the matter said on Wednesday  a day after Eircom rejected a 3.3 billion euro ($3.66 billion) buyout offer.",
        "date": "05202015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 3-Blackstone sells 25 pct of Eircom to Anchorage Capital-source "
    },
    {
        "content": "May 20 Blackstone Group LP has agreed to sell a 25 percent stake in Irish telecoms firm Eircom to hedge fund Anchorage Capital Group  a source familiar with the matter told Reuters.",
        "date": "05202015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to sell 25 pct in Irish telecoms firm Eircom-source "
    },
    {
        "content": "May 14 Hedge fund Magnetar Capital said Blackstone Group LP has bought a minority interest in it for an undisclosed sum.",
        "date": "05142015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Hedge fund Magnetar Capital says Blackstone buys minority interest "
    },
    {
        "content": "* Blackstone Group To Sell 25 Pct Stake In Irish Telecoms Firm Eircom To Hedge Fund Anchorage Capital Group - Source",
        "date": "05202015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BRIEF-Blackstone Group to sell 25 pct stake in Eircom to Anchorage Capital- Source "
    },
    {
        "content": "LONDON/BOSTON London-based Denjoy Capital Partners  backed by powerful investor Blackstone Group  is shutting down its European long-short equity hedge fund following a slump in returns  a letter to investors seen by Reuters showed.",
        "date": "04232015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone-backed Denjoy Capital to shut down hedge fund - document "
    },
    {
        "content": "LONDON/BOSTON London-based Denjoy Capital Partners  backed by powerful investor Blackstone Group  is shutting down its European long-short equity hedge fund following a slump in returns  a letter to investors seen by Reuters showed.",
        "date": "04232015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone-backed Denjoy Capital to shut down hedge fund "
    },
    {
        "content": "LONDON/BOSTON  April 23 London-based Denjoy Capital Partners  backed by powerful investor Blackstone Group   is shutting down its European long-short equity hedge fund following a slump in returns  a letter to investors seen by Reuters showed.",
        "date": "04232015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone-backed Denjoy Capital to shut down hedge fund - document "
    },
    {
        "content": "MIAMI  April 15 Blackstone Group LP has secured a $600 million loan for a Florida developer turning a once dingy  warehouse district in Miami into a premier luxury retail destination  according to sources familiar with the deal.",
        "date": "04152015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone secures $600 million for Miami luxury mall "
    },
    {
        "content": "Blackstone Group LP   the world's largest alternative asset manager  said on Thursday that its first-quarter profit doubled from a year ago  as strong asset sales generated by its private equity and real estate units brought in record cash.",
        "date": "04162015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone's first-quarter earnings soar on asset sales "
    },
    {
        "content": "April 16 Blackstone Group LP  the world's largest alternative asset manager  said on Thursday that its first-quarter profit doubled from a year ago  as strong asset sales generated by its private equity and real estate units brought in record cash.",
        "date": "04162015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone's first-quarter earnings soar on asset sales "
    },
    {
        "content": "April 16 Blackstone Group LP  the world's largest alternative asset manager  said on Thursday that its first-quarter profit doubled from a year ago  as strong asset sales generated by its private equity and real estate units generated record cash.",
        "date": "04162015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone's first quarter earnings soar on asset sales "
    },
    {
        "content": "April 10 It took Blackstone Group LP less than four weeks after an approach from General Electric Co  to clinch the biggest real estate deal since the financial crisis. Yet the seeds of that deal were planted seven years ago  during the crisis.",
        "date": "04102015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone swooped on regulation-weary GE to do mega real estate deal "
    },
    {
        "content": "RIO DE JANEIRO  April 8 An international arbitrator ruled that Brazil's CCX Carvão da Colombia  may not enter talks to sell three coal-mining projects in Colombia to investors represented by the Blackstone Group LP  CCX's main shareholder said on Wednesday.",
        "date": "04082015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Arbitrator blocks CCX talks to sell Colombia mines to Blackstone "
    },
    {
        "content": "Private equity firms Blackstone Group LP  and Corsair Capital are in talks to acquire a major stake in First Eagle Investment Management  valuing the company at around $4 billion  including debt  according to people familiar with the matter.",
        "date": "04082015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone  Corsair in talks to invest in First Eagle: sources "
    },
    {
        "content": "General Electric Co will shed most of its finance unit and return as much as $90 billion to shareholders as it becomes a “simpler” industrial business instead of an unwieldy hybrid of banking and manufacturing. | Video ",
        "date": "04102015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "GE to sell bulk of finance unit  return up to $90 billion to investors "
    },
    {
        "content": "Blackstone Group LP is the largest private real estate investment business in the world  with funds focused on opportunistic transactions  debt  core assets and a publicly traded real estate investment trust  Blackstone Mortgage Trust.",
        "date": "04102015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Factbox: State of Blackstone's real estate empire "
    },
    {
        "content": "April 10 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "04102015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "April 10 General Electric Co will shed most of its finance unit and return as much as $90 billion to shareholders as it becomes a \"simpler\" industrial business instead of an unwieldy hybrid of banking and manufacturing.",
        "date": "04102015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 5-GE to sell bulk of finance unit  return up to $90 billion to investors "
    },
    {
        "content": "April 2 Global investment banking fees fell 8 percent to $20 billion in the first quarter  the poorest start to the year since 2012  hurt by weak deal activity in Europe  Asia Pacific and Japan.",
        "date": "04022015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Investment banking fees fall 8 pct in weakest Q1 since 2012 "
    },
    {
        "content": " ",
        "date": "04102015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 4-GE to sell bulk of finance unit  return up to $90 billion to investors "
    },
    {
        "content": "April 10 General Electric Co said it would shed the bulk of its finance unit and return as much as $90 billion to shareholders as it becomes a \"simpler\" industrial business instead of an unwieldy hybrid of banking and manufacturing.",
        "date": "04102015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 3-GE to sell bulk of finance unit  return up to $90 billion to investors "
    },
    {
        "content": "Real estate investment trust Excel Trust Inc  said it would be bought by Blackstone Property Partners LP  part of Blackstone Group LP   for about $2 billion in cash.",
        "date": "04102015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to buy Excel Trust for about $2 billion "
    },
    {
        "content": "March 30 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "03302015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "April 10 Real estate investment trust Excel Trust Inc said it would be bought by Blackstone Property Partners LP  part of Blackstone Group LP  for about $2 billion in cash.",
        "date": "04102015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone to buy Excel Trust for about $2 bln "
    },
    {
        "content": "Blackstone Group LP   the world's largest private equity investor in real estate  has almost finished raising its next flagship global real estate fund  amassing $15.8 billion  a person familiar with the matter said on Monday.",
        "date": "03302015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone Group raises $15.8 billion for real estate fund: source "
    },
    {
        "content": "March 30 Blackstone Group LP  the world's largest private equity investor in real estate  has almost finished raising its next flagship global real estate fund  amassing $15.8 billion  a person familiar with the matter said on Monday.",
        "date": "03302015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone Group raises $15.8 bln for real estate fund-source "
    },
    {
        "content": "March 30 Barclays Plc has hired former Blackstone Group LP advisory banker Peter Cohen as its global head of media banking  the bank said in an internal memo Monday.",
        "date": "03302015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "MOVES-Barclays hires Blackstone banker to be global media head "
    },
    {
        "content": "March 24 Britain's Land Securities Group Plc  said it had struck a deal to sell its 95 percent stake in an office building in Times Square  London  to real estate funds managed by Blackstone Group LP for 268.4 million pounds ($400.5 million).",
        "date": "03242015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Land Securities sells Times Square  London property to Blackstone "
    },
    {
        "content": "TOKYO U.S.-based property investment fund Aetos Capital Real Estate is preparing to sell Simplex Investment Advisors  a Japanese real estate asset management firm  seeking as much as 200 billion yen ($1.7 billion)  people with knowledge of the deal said.",
        "date": "03242015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Aetos Capital preparing to sell Japan's Simplex  seeks $1.7 billion: sources "
    },
    {
        "content": "TOKYO  March 24 U.S.-based property investment fund Aetos Capital Real Estate is preparing to sell Simplex Investment Advisors  a Japanese real estate asset management firm  seeking as much as 200 billion yen ($1.7 billion)  people with knowledge of the deal said.",
        "date": "03242015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Aetos Capital preparing to sell Japan's Simplex  seeks $1.7 bln -sources "
    },
    {
        "content": "TOKYO  March 24 U.S.-based property investment fund Aetos Capital Real Estate is preparing to sell Simplex Investment Advisors  a Japanese real estate asset management firm  seeking as much as 200 billion yen ($1.7 billion)  people with knowledge of the deal said.",
        "date": "03242015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Aetos Capital preparing to sell Japan's Simplex  seeks $1.7 bln -sources "
    },
    {
        "content": "NEW YORK  March 18 More than half of the 17 senior managing directors working in Blackstone Group LP's  mergers and acquisitions advisory arm may leave as the business is combined with the advisory firm headed by star Wall Street investment banker Paul Taubman  according to people familiar with the matter.",
        "date": "03182015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Many Blackstone M&A bankers expected to depart ahead of spin off to Taubman "
    },
    {
        "content": "NEW YORK The Blackstone Group LP agreed on Monday to buy the Willis Tower  the former Sears Tower that for 25 years was the world's largest building  in a deal that features an observation deck as a tourist attraction and unique revenue stream.",
        "date": "03162015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone to buy former Sears Tower in Chicago for $1.3 billion "
    },
    {
        "content": "NEW YORK  March 16 The Blackstone Group LP  agreed on Monday to buy the Willis Tower  the former Sears Tower that for 25 years was the world's largest building  in a deal that features an observation deck as a tourist attraction and unique revenue stream.",
        "date": "03162015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone to buy former Sears Tower in Chicago for $1.3 bln "
    },
    {
        "content": "NEW YORK  March 16 The Blackstone Group LP  agreed on Monday to buy the Willis Tower  the former Sears Tower that for 25 years was the world's largest building  in a deal that features an observation deck as a tourist attraction and unique revenue stream.",
        "date": "03162015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to buy former Sears Tower in Chicago for $1.3 bln "
    },
    {
        "content": "March 12 Shares of cement maker Summit Materials Inc  controlled by Blackstone Group LP  rose as much as 12.5 percent in their trading debut on Thursday  valuing the company at $1.87 billion.",
        "date": "03122015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone-controlled cement maker Summit Materials rises 12.5 pct in debut "
    },
    {
        "content": "MUMBAI  March 9 Blackstone Group LP has agreed to sell its 57 percent stake in India's CMS Info Systems Ltd to Baring Private Equity (Asia) for $250 million  two sources with direct knowledge of the matter told Reuters.",
        "date": "03092015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Baring to buy Blackstone's stake in India's CMS for $250 mln-sources "
    },
    {
        "content": "March 12 Shares of Summit Materials Inc  a cement maker controlled by Blackstone Group LP  rose as much as 12.5 percent in their trading debut on Thursday  valuing the company at $1.87 billion.",
        "date": "03122015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone-controlled cement maker Summit Materials rises 12.5 pct in debut "
    },
    {
        "content": "March 6 The following corporate finance-related stories were reported by media:",
        "date": "03062015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Market Chatter - Corporate finance press digest "
    },
    {
        "content": "DAKAR Private equity will play a key role in developing Africa given the massive needs for capital on the continent  says Blackstone Group   which is focusing on infrastructure projects involving power generation and transmission.",
        "date": "03052015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone eyes opportunities in African power shortages "
    },
    {
        "content": "Blackstone Group LP  is exploring a sale of AlliedBarton Security Services in a deal that could value the largest U.S. security officer services company at around $1.5 billion  including debt  according to people familiar with the matter.",
        "date": "03052015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Exclusive: Blackstone seeks sale of AlliedBarton Security Services - sources "
    },
    {
        "content": "* Entities owned by certain funds advised by affiliates of CVC Capital Partners SICAV-FIS S.A and certain funds managed or advised by affiliates of The Blackstone Group L.P. have sold an aggregate of 156 541 347 ordinary shares in the capital of Merlin",
        "date": "03032015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone  CVC raise 653 mln stg through Merlin share sale "
    },
    {
        "content": "Feb 27 Blackstone Group LP Chief Executive Stephen Schwarzman took home $690 million in 2014  more than any other private equity executive  as his firm and the wider industry benefited from the favorable conditions for cashing out on investments.",
        "date": "03022015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone's Schwarzman tops 2014 private equity earnings "
    },
    {
        "content": "NEW YORK  Feb 27 (IFR) - When the final slug of a US$1.8bn Motel 6 mortgage bond deal sold on Thursday  the Blackstone Group took its US$626m equity in the low-cost lodging chain off the table.",
        "date": "02272015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "REFILE-Blackstone cashes out through Motel 6 CMBS "
    },
    {
        "content": "* LPs have to commit prior to first close for benefit * Fee holiday lasts six months * Expect first close of around $10 billion in April",
        "date": "02272015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "BUYOUTS-Blackstone uses fee holiday to entice Fund VII investors "
    },
    {
        "content": "NEW YORK  Feb 26 (IFR) - The Blackstone Group's US$1.8bn CMBS refinancing of Motel 6  a low-cost lodging chain it bought three years ago  was the biggest structured finance deal to price on Thursday  bankers and investors said.",
        "date": "02262015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone's large US$1.8bn CMBS tops list of priced deals "
    },
    {
        "content": "Feb 27 Blackstone Group LP Chief Executive Stephen Schwarzman took home $690 million in 2014  more than any other private equity executive  as his firm and the wider industry benefited from the favorable conditions for cashing out on investments.",
        "date": "02282015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone's Schwarzman tops 2014 private equity earnings "
    },
    {
        "content": "Feb 10 PGI Specialty Materials Inc  owned by Blackstone Group LP  filed with U.S. regulators for an initial public offering of common stock.",
        "date": "02102015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone-owned PGI Specialty Materials files for IPO "
    },
    {
        "content": "Feb 10 Blackstone Group LP's PGI Specialty Materials Inc  which makes materials that are used in products ranging from diapers to disinfectant wipes  filed with U.S. regulators for an initial public offering of common stock.",
        "date": "02102015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 1-Blackstone-owned PGI Specialty Materials files for IPO "
    },
    {
        "content": "Blackstone Group LP   the world's largest alternative asset manager  said on Thursday it had reduced its exposure to oil prices and was eyeing new opportunities in the energy sector as it reported a 6 percent decline in fourth-quarter profit.",
        "date": "01292015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone seeks energy investments as fourth-quarter profit falls "
    },
    {
        "content": "Jan 29 Blackstone Group LP  the world's largest alternative asset manager  said on Thursday it had extended the vesting period for shares given to employees  a move that could help retain investment bankers in a unit to be spun out this year.",
        "date": "01292015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone defers more compensation ahead of unit spinout "
    },
    {
        "content": "* Total assets under management of $290.4 bln as of end of December",
        "date": "01292015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "UPDATE 2-Blackstone seeks energy investments as Q4 profit falls "
    },
    {
        "content": "Jan 29 Blackstone Group LP  the world's largest alternative asset manager  reported a 6 percent decline in 2014 fourth-quarter profit on Thursday as its real estate funds appreciated less than they did a year ago.",
        "date": "01292015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone's quarterly earnings drop on real estate "
    },
    {
        "content": "NEW YORK Blackstone Group LP   the world's largest alternative asset manager  is raising its first energy-focused credit fund  according to people familiar with the matter  the latest sign that private equity firms are seeing investment opportunities among distressed energy assets.",
        "date": "01272015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Exclusive: Blackstone sets up new credit fund to seek undervalued oil and gas assets "
    },
    {
        "content": "HONG KONG U.S. private equity firm Blackstone Group said it has agreed to sell a prime Sydney office building to China's Dalian Wanda Group for about A$415 million ($327 million).",
        "date": "01262015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "Blackstone to sell prime Sydney property to Dalian Wanda for $327 million "
    },
    {
        "content": "HONG KONG  Jan 26 U.S. private equity firm Blackstone Group said it has agreed to sell a prime Sydney office building to China's Dalian Wanda Group for about A$415 million ($327 million).",
        "date": "01262015",
        "name": "The Blackstone Group LP",
        "news_type": "normal",
        "symbol": "BX",
        "title": "Blackstone to sell prime Sydney property to Dalian Wanda for $327 mln "
    },
    {
        "content": "NEW YORK  Jan 11 New York Governor Andrew Cuomo has appointed Bill Mulrow  a former senior managing director at Blackstone Group LP  the world's largest alternative asset manager  as secretary to the governor  according to a statement on Sunday.",
        "date": "01112015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "MOVES-Ex-Blackstone director named top aide to New York governor "
    },
    {
        "content": "* Spain's bad bank Sareb says it has sold a portfolio of non-performing loans with a nominal worth of 237 million euros  ($280.02 million)",
        "date": "01092015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Spain's bad bank sells 237 mln euros worth of loans to Blackstone "
    },
    {
        "content": "* Funds managed by Blackstone Tactical Opportunities and TPG Special Situations Partners to acquire Acenden Mortgage from administrators of Lehman Brothers",
        "date": "01072015",
        "name": "The Blackstone Group LP",
        "news_type": "topStory",
        "symbol": "BX",
        "title": "BRIEF-Blackstone  TSSP to buy Acenden Mortgage from Lehman Brothers' administrators "
    }
]