[
    {
        "content": "* CA Technologies reports second quarter fiscal year 2018 results",
        "date": "10252017",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "BRIEF-CA Technologies reports Q2 non-GAAP earnings per share $0.62 "
    },
    {
        "content": "* CA technologies reports first quarter fiscal year 2018 results",
        "date": "08022017",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "BRIEF-CA Technologies Q1 adj earnings per share $0.61 "
    },
    {
        "content": "July 27 Private equity-owned business software company BMC Software Inc has ended talks to merge with enterprise software maker CA Inc after struggling to arrange financing for the deal  a source familiar with the matter said on Thursday.",
        "date": "07272017",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "BMC Software ends merger talks with peer CA -source "
    },
    {
        "content": "* BMC Software Inc's talks to combine with CA Inc and take the software company private have ended - WSJ  citing sources Source text - http://on.wsj.com/2uBlbPj Further company coverage: (Bengaluru Newsroom)",
        "date": "07272017",
        "name": "CA Inc",
        "news_type": "normal",
        "symbol": "CA",
        "title": "BRIEF-BMC Software Inc's talks to combine with CA Inc and take the software company private have ended - WSJ  citing sources "
    },
    {
        "content": "* CA Inc - amended and restated its $1.0 billion unsecured revolving credit facility",
        "date": "06282017",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "BRIEF-CA says amended  restated its $1 bln unsecured revolving credit facility "
    },
    {
        "content": "* CA Inc says CEO Michael P. Gregoire total 2017 compensation was $11.9 million versus $10.4 million in 2016 - SEC filing Source text for Eikon: (http://bit.ly/2s0H32h) Further company coverage:",
        "date": "06222017",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "BRIEF-CA Inc says CEO Michael P. Gregoire's total 2017 compensation was $11.9 mln "
    },
    {
        "content": "June 20 Privately owned BMC Software has contacted banks about putting together a financing package for an acquisition offer for enterprise software maker CA Inc   according to a source familiar with the matter.",
        "date": "06212017",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "CORRECTED-BMC Software explores merger with CA -source "
    },
    {
        "content": "* BMC  CA Inc said to mull deal to combine  take CA private- Bloomberg  citing sources Source https://bloom.bg/2syjqzO",
        "date": "06202017",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "BRIEF-BMC  CA Inc said to mull deal to combine  take CA private- Bloomberg  citing sources "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 15 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to CA   Inc.'s (CA) issuance of $850 million multi-tranche senior unsecured notes with  five- to 10-year maturities. CA intends to use the proceeds for general  corporate purposes  which may include the funding of some or all of the Veracode  acquisition and the repayment of existing notes due 2018. CA's Long-Term Issuer  Rating (IDR) is 'BBB+' with a Stable Outlook. A",
        "date": "03152017",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "Fitch Rates CA's $850MM Senior Unsecured Notes 'BBB+' "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 07 (Fitch) According to Fitch Ratings  CA Inc.'s (CA) ratings   including the 'BBB+' Long-Term Issuer Default Rating (IDR)  are unaffected by  the acquisition of leading applications security testing software-as-a-service  (SaaS) provider  Veracode  for approximately $614 million in cash. The Rating  Outlook is Stable. A full list of current ratings follows at the end of this  release. The acquisition of Veracode will str",
        "date": "03072017",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "CA's 'BBB+' IDR and Stable Outlook Unaffected by Acquisition of Veracode "
    },
    {
        "content": "WASHINGTON  March 10 Information technology firm CA Inc has agreed to pay $45 million to resolve allegations it made false statements and claims involving a U.S. government contract  the Justice Department said on Friday.",
        "date": "03102017",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "CA Inc to pay $45 mln to resolve false claims allegations -US Justice Dept "
    },
    {
        "content": "* CA Technologies to acquire Veracode  a leading SAAS-based secure devops platform provider",
        "date": "03062017",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "BRIEF-CA Technologies to acquire Veracode "
    },
    {
        "content": "* THE BANK OF NEW YORK MELLON CORP REPORTS 5.69 PERCENT PASSIVE STAKE IN CA INC  AS OF DECEMBER 31  2016 - SEC FILING  Source text - http://bit.ly/2k4FOMr Further company coverage:",
        "date": "02032017",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "BRIEF-BANK OF NEW YORK MELLON CORP REPORTS 5.69 PCT PASSIVE STAKE IN CA INC "
    },
    {
        "content": "* Says announced it has submitted its EU-US privacy shield self-certification to US department of commerce  Source text for Eikon:  Further company coverage:",
        "date": "09282016",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "BRIEF-CA Technologies signs up to EU - U.S. Privacy Shield "
    },
    {
        "content": "* Ca Technologies to acquire Blazemeter to drive speed and quality of application testing practices",
        "date": "09202016",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "BRIEF-CA technologies to acquire Blazemeter "
    },
    {
        "content": "* Effective July 26  2016  appointed Kieran McGrath  currently senior vice president and corporate controller  as interim CFO",
        "date": "07272016",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "BRIEF-CA Inc. appoints Kieran McGrath interim CFO "
    },
    {
        "content": "* Sees 2017 Non-GAAP earnings per share $2.49 to $2.54 from continuing operations",
        "date": "07272016",
        "name": "CA Inc",
        "news_type": "normal",
        "symbol": "CA",
        "title": "BRIEF-CA Technologies Reports First Quarter Fiscal Year 2017 Results "
    },
    {
        "content": "* Sees FY 2017 gaap earnings per share $1.92 to $1.97 from continuing operations",
        "date": "05112016",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "BRIEF-CA Q4 non-gaap earnings per share $0.60 "
    },
    {
        "content": "* Long-term instability could damage budget  C/A deficit -finmin",
        "date": "09092015",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "UPDATE 1-Turkish finance minister says political uncertainty biggest risk to economy "
    },
    {
        "content": "* Consolidated sales revenues for q2 were up to eur 232.3 million  Source text for Eikon:  Further company coverage:",
        "date": "07312015",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "BRIEF-Cancom H1 EBITDA up 15 pct "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  June 26 (Fitch) Fitch Ratings has affirmed the ratings of CA  Inc.  (CA) at 'BBB+'  including the long-term Issuer Default Rating (IDR). The Rating  Outlook is Stable.  Fitch's actions affect approximately $2.3 billion of total debt  including CA's  undrawn $1 billion revolving credit facility (RCF). A full list of ratings  follows at the end of this press release. Overall  the ratings and Outlook reflect CA's strong competiti",
        "date": "06262015",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "Fitch Affirms CA  Inc.'s Ratings at 'BBB+'; Outlook Stable "
    },
    {
        "content": "June 1 Business software maker CA Inc  appointed Otto Berkes  one of the four founders of Microsoft Corp's Xbox console  as chief technology officer.",
        "date": "06012015",
        "name": "CA Inc",
        "news_type": "normal",
        "symbol": "CA",
        "title": "CA Inc names Xbox co-founder as tech chief "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  May 27 (Fitch) Fitch Ratings believes the ratings for CA  Inc. (CA)   including the 'BBB+' long-term Issuer Default Rating (IDR)  are unaffected by  the proposed acquisition of Rally Software Development Corp. (Rally).  Total rated debt was approximately $2.3 billion including CA's undrawn $1  billion revolving credit facility (RCF). A full list of current ratings follows  at the end of this release. CA announced it entered in",
        "date": "05272015",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "Fitch: CA's 'BBB+' IDR Unaffected by Acquisition of Rally Software "
    },
    {
        "content": "SANTA CLARA  Ca.  Feb 24 Hillary Clinton lamented the pay gap between men and women to a crowd of female technology executives on Tuesday  in a speech that showed she may make gender inequality a main theme in her likely 2016 presidential bid.",
        "date": "02252015",
        "name": "CA Inc",
        "news_type": "topStory",
        "symbol": "CA",
        "title": "Hillary Clinton highlights gender pay gap ahead of likely presidential bid "
    }
]