[
    {
        "content": "* Bloomin' Brands announces 2017 Q3 diluted EPS of $0.05 and adjusted diluted EPS of $0.12; posts comparable restaurant sales of 0.6 pct at outback with positive traffic; updates fiscal 2017 financial outlook",
        "date": "11032017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Bloomin' Brands Q3 earnings per share $0.05 "
    },
    {
        "content": "* Says ‍completed acquisition of Angie's Artisan Treats LLC from TPG Growth for $250 million​ Source text for Eikon: Further company coverage:",
        "date": "10232017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra completes $250 mln acquisition of Angie's Artisan Treats "
    },
    {
        "content": "* Mike Mohan elected to the Bloomin' Brands board of directors",
        "date": "10232017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "BRIEF-Mike Mohan elected to the Bloomin' Brands board of directors "
    },
    {
        "content": "WASHINGTON The U.S. Supreme Court on Tuesday refused to hear a bid by Conagra Brands Inc  to escape a class-action lawsuit accusing it of falsely labeling its cooking oil as 100 percent natural even though it had genetically modified ingredients.",
        "date": "10102017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "U.S. top court lets Conagra cooking oil class action proceed "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 10 (Fitch) Fitch Ratings has assigned a 'BBB' rating to Conagra Brands  Inc.'s approximately $500 million floating-rate senior unsecured note offering. The notes rank pari passu with its existing senior unsecured debt  and will mature in October 2020. Proceeds will be used for general corporate purposes  including the repayment of outstanding commercial paper at maturity and the repurchase of common stock. A full list ",
        "date": "10102017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "Fitch Rates Conagra Brands  Inc.'s Approximately $500MM Debt Issuance 'BBB'; Outlook Stable "
    },
    {
        "content": "WASHINGTON  Oct 10 The U.S. Supreme Court on Tuesday refused to hear a bid by Conagra Brands Inc to escape a class-action lawsuit accusing it of falsely labeling its cooking oil as 100 percent natural even though it had genetically modified ingredients.",
        "date": "10102017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "UPDATE 1-U.S. top court lets Conagra cooking oil class action proceed "
    },
    {
        "content": "WASHINGTON  Oct 10 The U.S. Supreme Court on Tuesday refused to hear a bid by Conagra Brands Inc to escape a class-action lawsuit accusing it of falsely labeling its cooking oil as 100 percent natural even though it had genetically modified ingredients.",
        "date": "10102017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "U.S. Supreme Court will not review Conagra cooking oil class action "
    },
    {
        "content": "* Files preliminary prospectus supplement related to a potential offering of floating rate notes due 2020 - SEC filing‍​ Source text: (http://bit.ly/2zc05rc) Further company coverage:",
        "date": "10102017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Brands files preliminary prospectus supplement related to potential offering of floating rate notes due 2020 - SEC filing‍​ "
    },
    {
        "content": "Conagra Brands Inc   which makes Reddi-Wip whipped cream and Chef Boyardee pasta  reported a stronger-than-expected quarterly profit  as the packaged food maker's efforts to cut back on discounts lifted margins.",
        "date": "09282017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "Conagra tops profit estimates as fewer discounts lift margins "
    },
    {
        "content": "Sept 28 Conagra Brands Inc  which makes Reddi-Wip whipped cream and Chef Boyardee pasta  reported a stronger-than-expected quarterly profit  as the packaged food maker's efforts to cut back on discounts lifted margins.",
        "date": "09282017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "UPDATE 2-Conagra tops profit estimates as fewer discounts lift margins "
    },
    {
        "content": "* Qtrly ‍adjusted diluted EPS from continuing operations $0.46​",
        "date": "09282017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "BRIEF-ConAgra Brands Inc Q1 EPS $0.36 from continuing operations "
    },
    {
        "content": "Sept 28 Conagra Brands Inc  which makes Reddi-Wip whipped cream and Chef Boyardee pasta  said on Thursday its quarterly profit fell about 18 percent  as it paid more to slot brands such as PAM and P.F. Chang's Home Menu at more supermarkets.",
        "date": "09282017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra's profit dips 18 pct "
    },
    {
        "content": "* Conagra Brands enters agreement to acquire Angie's Artisan Treats Llc  maker of Angie's Boomchickapop ready-to-eat popcorn  from TPG Growth",
        "date": "09222017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Brands enters agreement to buy Angie's Artisan Treats LLC "
    },
    {
        "content": "ConAgra Foods Inc avoided a default judgment in a case involving  alleged unfair labor practices because it did not get prior notice that it may have breached the terms of a settlement agreement it had with a union at a Slim Jim's manufacturing plant in Ohio  the National Labor Relations Board ruled.",
        "date": "09112017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "NLRB rejects general counsel's bid for default judgment against ConAgra "
    },
    {
        "content": "* Says CEO Sean Connolly's FY 2017 total compensation was $9.8 million versus $9.9 million in FY 2016 - SEC Filing‍​ Source text: [http://bit.ly/2vVrUWo] Further company coverage:",
        "date": "08112017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Brands says CEO Sean Connolly's FY 2017 total compensation was $9.8 mln - SEC Filing‍​ "
    },
    {
        "content": "* Conagra brands names Delu Jackson vice president of Precision Marketing Source text for Eikon: Further company coverage:",
        "date": "08142017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra brands names Delu Jackson vice president of Precision Marketing "
    },
    {
        "content": "* Takes sole share stake of 3.3 million shares in Altaba Inc ‍​- SEC filing",
        "date": "08142017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "BRIEF-Jana Partners takes sole share stake in Altaba  Pandora  Zimmer Biomet "
    },
    {
        "content": "* Bloomin' Brands announces 2017 Q2 diluted eps of $0.35 and adjusted diluted eps of $0.28; reaffirms full year 2017 adjusted diluted eps and u.s. Comparable sales; and repurchases $233 million of common stock year-to-date",
        "date": "07262017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Bloomin' Brands Q2 adjusted earnings per share $0.28 "
    },
    {
        "content": "* Files for potential mixed shelf offering; size not disclosed - SEC filing Source text for Eikon: (http://bit.ly/2uJHN0C) Further company coverage:",
        "date": "07212017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Brands files for potential mixed shelf offering "
    },
    {
        "content": "* Conagra Brands Inc - ‍board of directors approved a quarterly dividend payment of $0.2125 per share of CAG common stock​ Source text for Eikon: Further company coverage:",
        "date": "07202017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Brands announces quarterly dividend payment "
    },
    {
        "content": "Late Thursday  Conagra filed a new brief at the U.S. Supreme Court  asserting an irrefutable argument: If there was any doubt that federal appellate courts continue to struggle with the issue of class certification and identifying class members  this week resolved it. According to Conagra  rulings in the last seven days from the 2nd and 6th Circuit Courts of Appeals make it all the more obvious that the Supreme Court must tell the lower courts what to do about class action ascertaina",
        "date": "07142017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "Conagra’s new SCOTUS pitch: Seesaw week proves need for ascertainability review "
    },
    {
        "content": "Chef Boyardee pasta maker Conagra Brands Inc  reported a 29 percent rise in quarterly profit as it cut back on promotions and jettisoned low-margin products.",
        "date": "06292017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "Conagra profit jumps  but shares fall as margins disappoint "
    },
    {
        "content": "June 29 Chef Boyardee pasta maker Conagra Brands Inc reported a 29 percent rise in quarterly profit as it cut back on promotions and jettisoned low-margin products.",
        "date": "06292017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "UPDATE 2-Conagra profit jumps  but shares fall as margins disappoint "
    },
    {
        "content": "* Conagra Brands' transformation continues with solid end to strong fiscal 2017",
        "date": "06292017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "BRIEF-Conagra qtrly adjusted earnings per share ‍$0.37​ "
    },
    {
        "content": "June 29 Chef Boyardee pasta maker Conagra Brands Inc reported a 29 percent rise in quarterly profit as it cut back on promotions and jettisoned unprofitable products.",
        "date": "06292017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "Conagra Brands quarterly profit jumps 29 pct "
    },
    {
        "content": "Reddi-wip whipped cream owner Conagra Brands Inc  has concluded talks to acquire Pinnacle Foods Inc   the maker of packaged foods such as Vlasic pickles  after failing to agree on a price  a person familiar with the matter said on Friday.",
        "date": "06022017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "Conagra's talks to acquire Pinnacle Foods end with no deal: source "
    },
    {
        "content": "June 2 Reddi-wip whipped cream owner Conagra Brands Inc has concluded talks to acquire Pinnacle Foods Inc  the maker of packaged foods such as Vlasic pickles  after failing to agree on a price  a person familiar with the matter said on Friday.",
        "date": "06022017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "Conagra's talks to acquire Pinnacle Foods end with no deal -source "
    },
    {
        "content": "Reddi-wip whipped cream owner Conagra Brands Inc  has approached Pinnacle Foods Inc   the maker of packaged foods such as Vlasic pickles  to express interest in an acquisition  people familiar with the matter said on Wednesday.",
        "date": "05312017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "Exclusive: Conagra makes takeover approach to Pinnacle Foods - sources "
    },
    {
        "content": "* Simon will succeed Gerrit Schutte  who announced his plans to retire from company",
        "date": "06012017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Brands names Mindy Simon Chief Information Officer "
    },
    {
        "content": "June 1 The following bids  mergers  acquisitions and disposals were reported by 1400 GMT on Thursday:",
        "date": "06012017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "May 30 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "05302017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Packaged food maker Conagra Brands Inc  said on Tuesday it would sell its Wesson cooking oil brand to Folgers coffee maker J. M. Smucker Co  for about $285 million.",
        "date": "05302017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "Conagra to sell Wesson oil brand to J. M. Smucker "
    },
    {
        "content": "* Smucker sees deal adding about $230 mln to annual net sales (Adds details  updates shares)",
        "date": "05302017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "UPDATE 3-Conagra to sell Wesson oil brand to J. M. Smucker "
    },
    {
        "content": "May 30 Folgers coffee maker J. M. Smucker Co said it would buy packaged food maker Conagra Brands Inc's edible oil brand  the Wesson  for about $285 million.",
        "date": "05302017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "J.M. Smucker to buy Conagra's Wesson oil brand "
    },
    {
        "content": "* The J. M. Smucker company to acquire the Wesson® oil brand from Conagra Brands  Inc.",
        "date": "05302017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "BRIEF-J. M. Smucker company to acquire Wesson Oil Brand from Conagra Brands for about $285 mln "
    },
    {
        "content": "* ConAgra Brands Inc -on May 10  co and Jana Partners entered letter agreement with respect to previously disclosed amended  restated cooperation agreement between parties",
        "date": "05152017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-ConAgra agrees to nominate Bradley Alford  Thomas Dickson for election to board at 2017 annual meeting "
    },
    {
        "content": "* Third Point LLC dissolves share stake in Apple Inc - sec filing",
        "date": "05122017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Third Point LLC dissolves share stake in Apple  Goldman Sachs "
    },
    {
        "content": "* Bloomin' Brands Inc - sale and refranchising of 45 outback steakhouses in Arizona  Colorado  Nevada and New Mexico",
        "date": "04282017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Bloomin' Brands to sell and refranchise 45 outback steakhouses in four states "
    },
    {
        "content": "* Bloomin' Brands announces Q1 EPS of $0.41; adjusted EPS of $0.54; posts comparable sales at Outback Steakhouse of 1.4%; reaffirms FY17 guidance including adjusted EPS  U.S. Comparable sales; repurchases $78 million of common stock YTD",
        "date": "04262017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Bloomin' Brands reports Q1 adjusted EPS of $0.54 "
    },
    {
        "content": "* Conagra Brands names Barry Calpino vice president of innovation Source text for Eikon: Further company coverage:",
        "date": "04252017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Brands names Barry Calpino vice president of innovation "
    },
    {
        "content": "Conagra Brands Inc's  third-quarter profit beat analysts' estimates as the packaged-foods maker discontinued sales of lower-margin products and cut back on discounts.",
        "date": "03232017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "Fewer discounts  higher prices drive Conagra's profit beat "
    },
    {
        "content": "* Forecasts FY adj. profit at high end or above $1.65-$1.70/shr   (Adds details from conference call  shares)",
        "date": "03232017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "UPDATE 2-Fewer discounts  higher prices drive Conagra's profit beat "
    },
    {
        "content": "March 23 Conagra Brands Inc  the maker of Chef Boyardee pasta and Orville Redenbacher's popcorn  reported a 9.9 percent drop in third-quarter net sales as it cut down on unprofitable products and reduced discounts.",
        "date": "03232017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "Conagra's quarterly sales fall 9.9 pct "
    },
    {
        "content": "* Conagra brands enters into definitive agreement to acquire Thanasi Foods  maker of Duke's® meat snacks and Bigs® seeds",
        "date": "03162017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Brands to buy Thanasi Foods LLC "
    },
    {
        "content": "* On February 16 co entered into a revolving credit agreement - SEC Filing",
        "date": "02172017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Brands on Feb 16 entered into a revolving credit agreement - SEC Filing "
    },
    {
        "content": "* Bloomin' Brands Inc - on February 15  2017  company decided to close 43 underperforming restaurants",
        "date": "02172017",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "BRIEF-Bloomin' Brands says most of the restaurants will close in 2017 "
    },
    {
        "content": "* Third Point Llc dissolves share stake in Allergan Plc - SEC Filing",
        "date": "02102017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Third Point LLC takes share stake in JPMorgan  Bank of America - SEC Filing "
    },
    {
        "content": "* Launching Reddi-wip in new recipe featuring cream from cows not treated with artifical growth hormone and no artificial flavors  Source text for Eikon:  Further company coverage:",
        "date": "01092017",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Brands says launching Reddi-wip in new recipe "
    },
    {
        "content": "CHICAGO Reddi-wip  the top-selling U.S. ready-made whipped cream  is going into hiding for the holidays.",
        "date": "12222016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "Where's the Reddi-wip? ConAgra lowers product profile during shortage "
    },
    {
        "content": "ConAgra Brands Inc   the maker of Chef Boyardee pasta and Orville Redenbacher's popcorn  reported a better-than-expected quarterly profit as the company benefited from less discounting and lower costs.",
        "date": "12222016",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra's profit beat sends shares to record high "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 21 (Fitch) Fitch Ratings has affirmed Conagra Brands  Inc.'s  (Conagra) long-term Issuer Default Rating (IDR) at 'BBB-'. The Rating Outlook  has been revised to Positive from Stable. A full list of ratings follows at the  end of this release. The Positive Outlook recognizes Conagra's evolution to a business model that  should align well with the largest U.S. packaged food companies  given the  potential for low-single",
        "date": "11212016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "Fitch Affirms Conagra's IDR at 'BBB-'; Outlook to Positive "
    },
    {
        "content": "* CST Brands announces stockholders approve merger with Alimentation Couche-Tard Inc.",
        "date": "11162016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-CST Brands announces stockholders approve merger with Alimentation Couche-Tard Inc. "
    },
    {
        "content": "* Conagra Brands Inc - with addition  conagra brands board will consist of 10 members",
        "date": "11112016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Brands appoints Craig P. Omtvedt to its board "
    },
    {
        "content": "TreeHouse Foods Inc  cut its full-year profit forecast due to weak results at its newly acquired private label business and announced the departure of an executive who had a key role in making the company the largest U.S. private label food maker.",
        "date": "11032016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "TreeHouse struggles with private label business  key exec quits "
    },
    {
        "content": "* Lamb Weston announces proposed private offering of $1.666 billion combined aggregate principal amount of senior notes due 2024 and senior notes due 2026",
        "date": "10262016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Lamb Weston to use net proceeds of issuance of notes to partially fund a cash payment to ConAgra foods "
    },
    {
        "content": "* ConAgra Brands executive says the company will be 91 percent branded after the Lamb Weston spin-off - investor day conf call",
        "date": "10182016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-ConAgra says it will be 91 pct branded after Lamb Weston spin-off "
    },
    {
        "content": "Oct 13 Lamb Weston  the frozen potato business that ConAgra Foods Inc is spinning off  expects net sales to rise in the low-single digits in percentage terms in the year ending May  the company said in its first investor day conference on Thursday.",
        "date": "10132016",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "Lamb Weston expects full-year sales to rise in low-single digits "
    },
    {
        "content": "* ConAgra - Goldman  Sachs & Co.  Merrill Lynch  and others commenced cash tender offers to buy series of outstanding debt securities of co",
        "date": "10112016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-ConAgra says Goldman Sachs  others commenced cash tender offers to buy series of outstanding debt securities "
    },
    {
        "content": "* Says board of directors approves conditional $1.25 billion share repurchase plan",
        "date": "10112016",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Foods says board of directors approves conditional $1.25 bln share repurchase plan "
    },
    {
        "content": "ConAgra Foods Inc   the maker of Chef Boyardee pasta and Hunt's ketchup  reported a quarterly profit that handily beat analysts' estimates as it raised prices on some products and discounted less.",
        "date": "09292016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "ConAgra's profit beats on higher prices  less discounting "
    },
    {
        "content": "* Shares rise as much as 8.2 pct   (Adds executive comments and company background; updates share move)",
        "date": "09292016",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "UPDATE 2-ConAgra's profit beats on higher prices  less discounting "
    },
    {
        "content": "* Company in conference call says Q1 volume declines in grocery  snack segment largely concentrated on a few brands such as Chef Boyardee   Snack Pack where co is reversing historical practice of promoting below $1 price point",
        "date": "09292016",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "BRIEF-Conagra says reversing historical practice of promoting below $1 price point "
    },
    {
        "content": "* Conagra foods acquires frontera  red fork and salpica brands",
        "date": "09262016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Foods acquires Frontera  Red Fork and Salpica brands "
    },
    {
        "content": "* ConAgra Foods delivers continued margin expansion propelling first quarter EPS ahead of expectations",
        "date": "09292016",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "BRIEF-ConAgra Foods Q1 adjusted earnings per share $0.61 "
    },
    {
        "content": "Sept 29 ConAgra Foods Inc  the maker of Chef Boyardee pasta and Hunt's ketchup  reported lower-than-expected quarterly sales  hurt by lower demand for its grocery  snacks and frozen food items.",
        "date": "09292016",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra reports lower-than-expected quarterly sales "
    },
    {
        "content": "* Approved a dividend payment of $0.25 per share of CAG common stock to be paid on November 30  2016 to stockholders  Source text for Eikon:  Further company coverage:",
        "date": "09232016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Foods announces dividend payment "
    },
    {
        "content": "* Gehring's employment in service to Lamb Weston under Gehring agreement is generally expected to continue until December 15  2016",
        "date": "09292016",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "BRIEF-Conagra foods inc- John Gehring will serve as Vice president and interim CFO of company's Lamb Weston business "
    },
    {
        "content": "Supervisors at a ConAgra Foods processing plant who lacked the authority to hire and fire employees are still considered managers ineligible for overtime pay under the U.S. Fair Labor Standards Act  a federal appeals court ruled on Monday.",
        "date": "08162016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "ConAgra 'team leaders' not due overtime under FLSA - 8th Circuit "
    },
    {
        "content": "* Says CEO Sean Connolly FY 2016 total compensation $9.95 million versus $6.64 million in FY 2015 - SEC filing",
        "date": "08102016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-ConAgra says CEO total compensation was $9.95 mln in FY 2016 "
    },
    {
        "content": "* ConAgra Foods completes sales of JM Swank and Spicetec Flavors & Seasonings  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07252016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-ConAgra completes sales of JM Swank and Spicetec Flavors & Seasonings "
    },
    {
        "content": "* CFO Marberger's initial base salary will be $580 000 - SEC filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07192016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Foods CFO Marberger's initial base salary will be $580 000 "
    },
    {
        "content": "July 14 ConAgra Foods Inc  known for its Chef Boyardee pasta and Healthy Choice dinners  named David Marberger of Prestige Brands Holdings Inc as its chief financial officer.",
        "date": "07142016",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra hires CFO from Prestige Brands "
    },
    {
        "content": "* Lamb Weston Holdings Files For Form 10 Registration Statement Related To Spinoff From Conagra Foods - SEC filing",
        "date": "07132016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Lamb Weston will have common stock listed on NYSE under symbol \"LW\" "
    },
    {
        "content": "* Conagra Foods Inc says approved a dividend payment of $0.25 per share of CAG common stock  Source text for Eikon:  Further company coverage:",
        "date": "07122016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Foods says dividend payment of $0.25 per share "
    },
    {
        "content": "* ConAgra Foods names David Marberger chief financial officer",
        "date": "07142016",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "BRIEF-ConAgra Foods names David Marberger CFO "
    },
    {
        "content": "ConAgra Foods Inc  on Thursday reported a 9.5 percent drop in quarterly net sales  missing analysts' estimates as demand weakened for its consumer foods  which include Chef Boyardee pasta and Hunt's ketchup.",
        "date": "06302016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "ConAgra reports lower quarterly sales and earnings "
    },
    {
        "content": "June 30 ConAgra Foods Inc on Thursday reported a 9.5 percent drop in quarterly net sales  missing analysts' estimates as demand weakened for its consumer foods  which include Chef Boyardee pasta and Hunt's ketchup.",
        "date": "06302016",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "UPDATE 3-ConAgra reports lower quarterly sales and earnings "
    },
    {
        "content": "* Qtrly consumer foods segment posted sales of approximately $1.7 billion  down 12 percent",
        "date": "06302016",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "BRIEF-ConAgra Foods Q4 loss per share $0.07 from cont ops "
    },
    {
        "content": "June 30 ConAgra Foods Inc quarterly net sales fell 9.5 percent  missing analysts' estimates  as demand weakened for its consumer foods  which include Chef Boyardee pasta and Hunt's ketchup.",
        "date": "06302016",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra quarterly sales drop 9.5 pct  miss analyst estimate "
    },
    {
        "content": "June 21 Raisin Bran cereal maker Post Holdings Inc held talks to merge with ConAgra Foods Inc's  Lamb Weston frozen potato products unit  said a source familiar with the matter.",
        "date": "06212016",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "Post Holdings held talks to merge with ConAgra's Lamb Weston unit "
    },
    {
        "content": "* As of June 2  discontinued use of partially hydrogenated oils (PHOs) in manufacturing of all spreads in company's portfolio  Source text - http://bit.ly/1TXD11X  Further company coverage:",
        "date": "06092016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Foods discontinues use of PHOs in all spreads "
    },
    {
        "content": "* Entered into a definitive agreement for Platinum Equity to acquire Conagra Foods' JM Swank Business  Source text for Eikon:",
        "date": "06082016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra foods to sell JM Swank to Platinum Equity "
    },
    {
        "content": "* Conagra says has agreed that board will nominate bradley  alford and timothy mclevish for election to board",
        "date": "05312016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Foods says board to nominate Bradley Alford and Timothy McLevish for election to board "
    },
    {
        "content": "NEW YORK ConAgra Foods' stock  could climb up to 30 percent in the coming months as the U.S. packaged food company seeks to shed businesses  improve existing brands and achieve lower overheads  Barron's said in its latest online edition.",
        "date": "05302016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "ConAgra Foods stock seen rising 30 percent: Barron's "
    },
    {
        "content": "NEW YORK  May 29 ConAgra Foods' stock  could climb up to 30 percent in the coming months as the U.S. packaged food company seeks to shed businesses  improve existing brands and achieve lower overheads  Barron's said in its latest online edition.",
        "date": "05292016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "ConAgra Foods stock seen rising 30 pct - Barron's "
    },
    {
        "content": "* Gehring will remain in his current role until a successor has been named and will assist with an orderly transition",
        "date": "05242016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Foods says CFO John Gehring to retire "
    },
    {
        "content": "* Said on Monday is acquiring ConAgra Foods' Spicetec Flavors & Seasonings business",
        "date": "05242016",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "BRIEF-Givaudan acquires ConAgra Foods' Spicetec Flavors & Seasonings business "
    },
    {
        "content": "* Conagra foods to sell spicetec flavors & seasonings to givaudan",
        "date": "05232016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-ConAgra Foods to sell spicetec flavors & seasonings to Givaudan "
    },
    {
        "content": "ConAgra Foods Inc  reported higher-than-expected quarterly sales  helped by strong demand for its Lamb Weston potato products sold mainly to restaurants and other food industry customers.",
        "date": "04072016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "Lamb Weston business helps ConAgra beat sales estimates "
    },
    {
        "content": "* Shares up 2.8 percent premarket   (Adds details  background; updates shares)",
        "date": "04072016",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "UPDATE 2-Lamb Weston business helps ConAgra beat sales estimates "
    },
    {
        "content": "April 7 ConAgra Foods Inc  the maker of Chef Boyardee pasta and Healthy Choice dinners  reported higher-than-expected quarterly sales  helped by strong demand for products it sells to restaurants and other food industry customers.",
        "date": "04072016",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra Foods' quarterly sales beat estimates "
    },
    {
        "content": "TreeHouse Foods Inc  said it would introduce more premium  healthy snacks and popular drinks to revitalize the struggling private-label business it bought from ConAgra Foods Inc  last month.",
        "date": "03242016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "TreeHouse aims to turn around private brands unit with new snacks "
    },
    {
        "content": "* Conagra Foods says will begin adding labels to products nationwide by july 2016 to meet Vermont's GMO labeling requirements",
        "date": "03222016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "BRIEF-Conagra Foods to add labels to products nationwide by July to meet Vermont GMO labeling requirements "
    },
    {
        "content": "ConAgra Foods Inc did not violate federal labor law when it disciplined a worker for soliciting union membership at the company's Slim Jims manufacturing plant in Ohio  a U.S. appeals court ruled on Friday.",
        "date": "02192016",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "ConAgra worker impermissibly solicited union support at work - 8th Circuit "
    },
    {
        "content": "ConAgra Foods Inc reported profits that topped estimates on Tuesday  helped by cost-cutting and lower commodity expenses as the company shifts to healthier  less processed foods that consumers want.",
        "date": "12222015",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "ConAgra second-quarter profit tops estimates despite sales miss "
    },
    {
        "content": "Dec 22 ConAgra Foods Inc reported profits that topped estimates on Tuesday  helped by cost-cutting and lower commodity expenses as the company shifts to healthier  less processed foods that consumers want.",
        "date": "12222015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "UPDATE 2-ConAgra 2nd-qtr profit tops estimates despite sales miss "
    },
    {
        "content": "Dec 22 ConAgra Foods Inc  the maker of Chef Boyardee pasta and Healthy Choice dinners  reported lower-than-expected revenue for the third straight quarter  hurt by weak sales in its consumer foods business  which includes frozen dinners and pasta.",
        "date": "12222015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra Foods' quarterly sales miss estimates "
    },
    {
        "content": "Nov 18 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Wednesday:",
        "date": "11182015",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "ConAgra Foods Inc  said it will spin off its Lamb Weston frozen potato products business into a separate public company  the latest in a series of changes announced by the maker of Chef Boyardee pasta and Slim Jim jerky at a time when consumers are  shifting to less-processed foods.",
        "date": "11182015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra to spin off Lamb Weston frozen potato unit  rename itself "
    },
    {
        "content": "Nov 18 ConAgra Foods Inc said it will spin off its Lamb Weston frozen potato products business into a separate public company  the latest in a series of changes announced by the maker of Chef Boyardee pasta and Slim Jim jerky at a time when consumers are  shifting to less-processed foods.",
        "date": "11182015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "UPDATE 3-ConAgra to spin off Lamb Weston frozen potato unit  rename itself "
    },
    {
        "content": "Nov 18 ConAgra Foods Inc said it would separate into two independent public companies  one of which would focus on its consumer brands and the other on its frozen potato products business.",
        "date": "11182015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra Foods to split into two public companies "
    },
    {
        "content": "ConAgra Foods Inc  said it would sell its private-label unit to TreeHouse Foods Inc  for $2.7 billion  after struggling to turn around the business it acquired just two years ago.",
        "date": "11022015",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "ConAgra to sell private brands unit to TreeHouse for $2.7 billion "
    },
    {
        "content": "* Indexes up: Dow 0.55 pct  S&P 0.70 pct  Nasdaq 0.96 pct   (Updates to early afternoon)",
        "date": "11022015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "US STOCKS-Wall St up on factory activity data  health care rally "
    },
    {
        "content": "* ConAgra shares up 1.7 percent; TreeHouse down 5.6 percent   (Adds analyst comment  company comment and updates share price)",
        "date": "11022015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "UPDATE 3-ConAgra to sell private brands unit to TreeHouse for $2.7 bln "
    },
    {
        "content": "* Indexes up: Dow 0.62 pct  S&P 0.72 pct  Nasdaq 0.90 pct   (Adds details  changes comment  updates prices)",
        "date": "11022015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "US STOCKS-Wall St higher after better-than-expected factory data "
    },
    {
        "content": "Nov 2 Private-label food manufacturer TreeHouse Foods Inc said it would buy ConAgra Foods Inc's  private brands business for $2.7 billion to expand its dry and refrigerated grocery business.",
        "date": "11022015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "TreeHouse to buy ConAgra's private brands business for $2.7 bln "
    },
    {
        "content": "TreeHouse Foods Inc  is in advanced talks to acquire Ralcorp  the private label business of ConAgra Foods Inc   in a deal that could be valued between $2.5 billion and $2.7 billion  according to people familiar with the matter.",
        "date": "10222015",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "Exclusive: TreeHouse in late-stage talks to buy ConAgra's Ralcorp "
    },
    {
        "content": "ConAgra Foods Inc said it would cut about 1 500 jobs and move its headquarters to Chicago from Omaha as part of a plan to save at least $300 million in three years.",
        "date": "10012015",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "ConAgra to cut 1 500 jobs  shift base to Chicago from Omaha "
    },
    {
        "content": "* To save at least $300 mln within three years   (Adds Nebraska Governor's statement  CEO comment  analyst comment  updates shares)",
        "date": "10012015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "UPDATE 3-ConAgra to cut 1 500 jobs  shift base to Chicago from Omaha "
    },
    {
        "content": "Oct 1 ConAgra Foods Inc said it will cut about 1 500 jobs  or about 30 percent of its office-based workforce  and outsource technology and back office functions to reduce costs.",
        "date": "10012015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra to cut 1 500 jobs  outsource tech jobs to lower costs "
    },
    {
        "content": "Sept 22 ConAgra Foods Inc reported a better-than-expected quarterly profit  helped by a 3.5 percent rise in sales in its commercial foods business  which makes ingredients for other manufacturers and restaurants.",
        "date": "09222015",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "UPDATE 1-ConAgra profit beats estimates on higher sales of food ingredients "
    },
    {
        "content": "Sept 22 ConAgra Foods Inc  the maker of Slim Jim beef jerky and Chef Boyardee pasta  reported a 1.1 percent rise in quarterly sales  helped by higher demand in its commercial foods business   which makes ingredients for other manufacturers and restaurants.",
        "date": "09222015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra sales rise on higher demand for food ingredients "
    },
    {
        "content": "ConAgra Foods Inc  has started talks with TreeHouse Foods Inc  and Post Holdings Inc  regarding the sale of its private label unit Ralcorp  which could be valued at around $3.5 billion  according to people familiar with the matter.",
        "date": "07282015",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "Exclusive: TreeHouse  Post join ConAgra's private label auction - sources "
    },
    {
        "content": "July 9 The following bids  mergers  acquisitions and disposals were reported by 1000 GMT on Thursday:",
        "date": "07092015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "ConAgra Foods Inc  has hired Centerview Partners to explore a sale of its private label unit Ralcorp  just two years after it acquired the troubled business with advice from the same investment bank  people familiar with the matter said.",
        "date": "07082015",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "ConAgra turns to Centerview again for advice on Ralcorp: sources "
    },
    {
        "content": "July 8 ConAgra Foods Inc said it will appoint two directors   including former Nestle USA CEO Bradley Alford  one of the three nominees of its second-largest shareholder Jana Partners LLC.",
        "date": "07082015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra appoints Jana Partners' nominee to board "
    },
    {
        "content": "July 8 ConAgra Foods Inc said it would add two directors  including a former Nestle executive nominated by Jana Partners LLC  three weeks after the activist investor took a stake in the food processing company and called for changes.",
        "date": "07082015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "UPDATE 1-ConAgra appoints Jana Partners' nominee to board "
    },
    {
        "content": "July 8 ConAgra Foods Inc has hired Centerview Partners to explore a sale of its private label unit Ralcorp  just two years after it acquired the troubled business with advice from the same investment bank  people familiar with the matter said.",
        "date": "07082015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra turns to Centerview again for advice on Ralcorp -sources "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 01 (Fitch) Fitch Ratings has affirmed the Long-term Issuer Default  Ratings (IDRs) for ConAgra Foods  Inc. (ConAgra) and its subsidiary  Ralcorp  Holdings  Inc. (Ralcorp) at 'BBB-' and has affirmed ConAgra's Short-term IDR at  'F3'. The Rating Outlook is Negative.  Fitch views ConAgra's announcement that it will exit the Private Brands  operation and essentially unwind the Ralcorp acquisition (completed just two  years ago",
        "date": "07012015",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "Fitch Affirms ConAgra's IDRs at 'BBB-/F3'; Outlook Negative "
    },
    {
        "content": "June 30 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "06302015",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "July 1 The following are the top stories on the New York Times business pages. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "07012015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "PRESS DIGEST- New York Times business news - July 1 "
    },
    {
        "content": "ConAgra Foods Inc   the maker of Slim Jim beef jerky and Chef Boyardee pasta  said it planned to exit its struggling private label foods business as it seeks to boost profit margins and focus on its faster growing consumer foods segment.",
        "date": "06302015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra Foods to exit struggling private label business "
    },
    {
        "content": "* Shares up 1.7 pct   (Adds context  quotes from the earnings call  and updates share price)",
        "date": "06302015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "UPDATE 4-ConAgra Foods to exit struggling private label business "
    },
    {
        "content": "June 30 ConAgra Foods Inc  the maker of Slim Jim beef jerky and Chef Boyardee pasta  said it would exit its struggling private label foods business and reported a 3.7 percent rise in quarterly sales.",
        "date": "06302015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra Foods to exit private label business "
    },
    {
        "content": "* Indexes down: Dow 0.27 pct  S&P 0.28 pct  Nasdaq 0.28 pct   (Updates to early afternoon)",
        "date": "06192015",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "US STOCKS-Wall St dips but indexes on track for best week in two months "
    },
    {
        "content": "Activist hedge fund Jana Partners LLC took a stake in ConAgra Foods Inc  and said it was prepared to nominate directors to the company's board to help address \"persistent underperformance\" since the acquisition of RalCorp in 2013.",
        "date": "06182015",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "Jana Partners takes stake in ConAgra  ready to nominate directors "
    },
    {
        "content": "* Indexes down: Dow 0.21 pct  S&P 0.16 pct  Nasdaq 0.16 pct   (Adds details  changes comment  updates prices)",
        "date": "06192015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "US STOCKS-Wall St falls as rally stalls; Greece eyed "
    },
    {
        "content": "June 18 Activist hedge fund Jana Partners LLC took a stake in ConAgra Foods Inc and said it was prepared to nominate directors to the company's board to help address \"persistent underperformance\" since the acquisition of RalCorp in 2013.",
        "date": "06182015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "UPDATE 1-Jana Partners takes stake in ConAgra  ready to nominate directors "
    },
    {
        "content": "June 18 Activist hedge fund Jana Partners LLC on Thursday disclosed a 7.2 percent stake in ConAgra Foods Inc   saying the Slim Jim Beef Jerky maker's shares were \"undervalued\".",
        "date": "06182015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "Jana Partners picks up 7 pct stake in ConAgra "
    },
    {
        "content": "A unit of ConAgra Foods Inc pleaded guilty to a criminal misdemeanor and will pay $11.2 million to end a federal probe into a 2007 recall of peanut butter  including the Peter Pan brand  linked to a salmonella outbreak that sickened hundreds.",
        "date": "05202015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra pleads guilty  pays record fine tied to peanut butter recall "
    },
    {
        "content": "* U.S. says more than 700 sickened by salmonella taint   (Adds details of allegations  ConAgra comment  separate prosecution  byline)",
        "date": "05202015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "UPDATE 1-ConAgra pleads guilty  pays record fine tied to peanut butter recall "
    },
    {
        "content": "May 20 A unit of ConAgra Foods Inc has pleaded guilty to a criminal misdemeanor and will pay $11.2 million to end a federal probe into a 2007 recall of peanut butter linked to a salmonella outbreak  court papers showed.",
        "date": "05202015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra enters guilty plea tied to 2007 peanut butter recall "
    },
    {
        "content": "ConAgra Foods Inc   the maker of Slim Jim beef jerky and Chef Boyardee pasta  reported a higher-than-expected quarterly profit due to cost cuts and the company raised its full-year earnings forecast.",
        "date": "03262015",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "ConAgra reports better-than-expected profit  raises forecast "
    },
    {
        "content": "March 26 ConAgra Foods Inc  the maker of Slim Jim beef jerky and Chef Boyardee pasta  reported a higher-than-expected quarterly profit due to cost cuts and the company raised its full-year earnings forecast.",
        "date": "03262015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "UPDATE 1-ConAgra reports better-than-expected profit  raises forecast "
    },
    {
        "content": "March 26 ConAgra Foods Inc  the maker of Slim Jim beef jerky  reported a quarterly loss  hurt by a $1.3 billion charge in its private brands business.",
        "date": "03262015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra reports quarterly loss  lower sales "
    },
    {
        "content": "ConAgra Foods Inc   the maker of Slim Jim beef jerky and Chef Boyardee pasta  appointed former Hillshire Brands Co Chief Executive Sean Connolly its CEO  replacing Gary Rodkin.",
        "date": "02122015",
        "name": "ConAgra Brands Inc",
        "news_type": "topStory",
        "symbol": "CAG",
        "title": "ConAgra names Sean Connolly CEO  cuts profit forecast "
    },
    {
        "content": "Feb 12 ConAgra Foods Inc  the maker of Slim Jim beef jerky and Chef Boyardee pasta  appointed former Hillshire Brands Co Chief Executive Sean Connolly its CEO  replacing Gary Rodkin.",
        "date": "02122015",
        "name": "ConAgra Brands Inc",
        "news_type": "normal",
        "symbol": "CAG",
        "title": "ConAgra names Sean Connolly CEO  cuts 2015 profit forecast "
    }
]