[
    {
        "content": "* Cardinal Health put business up for sale due to rule changes",
        "date": "11152017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "UPDATE 3-Shanghai Pharma buys U.S. Cardinal Health's China business for $557 mln "
    },
    {
        "content": "Nov 15 State-owned Shanghai Pharmaceuticals Holding Co has agreed to acquire Cardinal Health Inc's China business  one of the nation's largest drug distributors  for $557 million.",
        "date": "11152017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Shanghai Pharma buys U.S. Cardinal Health's China business for $557 mln "
    },
    {
        "content": "* Cardinal health signs definitive agreement to sell its china business to Shanghai Pharma",
        "date": "11152017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health to sell its china business to Shanghai Pharma for $1.2 bln‍​ "
    },
    {
        "content": "* Cardinal Health - ‍based on preliminary results of shareholder voting at co's annual meeting  shareholders re-elected all 11 members to board​ Source text for Eikon: Further company coverage:",
        "date": "11082017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health says shareholders re-elected all 11 members to board in preliminary voting ​ "
    },
    {
        "content": "U.S. drug distributor Cardinal Health Inc's  quarterly revenue fell short of analysts' forecasts  as prices for generic drugs remained stubbornly low  sending the company's shares down to a four-year low on Monday.",
        "date": "11062017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "Cardinal Health misses revenue estimates; names new CEO "
    },
    {
        "content": "Nov 6 U.S. drug distributor Cardinal Health Inc on Monday named its chief financial officer as its next CEO  and reported a lower-than-expected quarterly revenue as it deals with stubbornly low prices for generic drugs.",
        "date": "11062017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "CORRECTED-UPDATE 1-Drug distributor Cardinal names Mike Kaufmann as new CEO "
    },
    {
        "content": "* Cardinal Health Inc - ‍Jorge Gomez  CFO of Cardinal Health's medical segment  to succeed Kaufmann as chief financial officer​",
        "date": "11062017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health Inc outlines leadership succession plan "
    },
    {
        "content": "Nov 6 U.S. drug distributor Cardinal Health's quarterly profit fell nearly 63 percent  hurt by restructuring costs related to an agreement to directly distribute surgeon gloves in some markets.",
        "date": "11062017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Drug distributor Cardinal's profit falls 63 pct "
    },
    {
        "content": "* Cardinal Health Inc reports first-quarter results for fiscal year 2018",
        "date": "11062017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health reports Q1 GAAP earnings per share $0.36 "
    },
    {
        "content": "BOSTON  Oct 30 U.S. shareholder activists are addressing a soaring death toll from opioid drug abuse  asking companies that make and distribute the painkillers to review the risks their businesses could face from their role in the sector.",
        "date": "10302017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "UPDATE 1-Investor group presses U.S. drug companies on opioid controls "
    },
    {
        "content": "BOSTON  Oct 30 U.S. shareholder activists are addressing the soaring death toll from opioid drug abuse  asking companies that make and distribute the painkillers to review the risks their businesses could face from their role in the sector.",
        "date": "10302017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Investor group presses U.S. drug companies on opioid controls "
    },
    {
        "content": "* Galena Biopharma Inc says on October 12  co and Cardinal Health entered into a settlement relating to product swap agreement​ - SEC filing",
        "date": "10182017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Galena Biopharma says co and Cardinal Health entered into a settlement relating to product swap agreement​ "
    },
    {
        "content": "* Shanghai Pharma makes two non-binding bids for Cardinal China",
        "date": "10182017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "UPDATE 1-Shanghai Pharma bids for U.S. Cardinal Health's China business "
    },
    {
        "content": "HONG KONG  Oct 18 Shanghai Pharmaceuticals Holding Co said it has bid for Cardinal Health Inc's China business  as the U.S. drug distributor looks to exit over worries China's upcoming drug distribution reform could slow its growth.",
        "date": "10182017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Shanghai Pharma says bid for U.S. Cardinal Health's China business "
    },
    {
        "content": "* Says it has submitted bids for U.S. drug distributor Cardinal Health's China business",
        "date": "10182017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "BRIEF-Shanghai Pharmaceuticals submits bids for U.S. drug distributor Cardinal Health's China business "
    },
    {
        "content": "* Cardinal Health - ‍expects to incur estimated costs associated with exit or disposal activities of $130 million on a pre-tax basis",
        "date": "10042017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health - ‍Expects to incur estimated exit or disposal activities costs of $130 mln "
    },
    {
        "content": "* CEO George Barrett's 2017 ‍​total compensation was about $11 million  versus $13.7 million in 2016 - SEC filing Source text for Eikon: [ID: nEOL4YHpNn] Further company coverage:",
        "date": "09212017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health CEO 2017 ‍​total compensation was about $11 mln vs. $13.7 mln in 2016 "
    },
    {
        "content": "* Cardinal Health - on Aug 30  unit entered into third amendment to the fourth amended and restated receivables purchase agreement - SEC filing‍​",
        "date": "08312017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health increases size of sales facility program to $1 bln "
    },
    {
        "content": "Aug 3 The largest U.S. retail pharmacies  including Wal-Mart Stores Inc and Walgreens Boots Alliance Inc  are wielding more leverage when buying generic drugs  accelerating a decline in prices likely to affect drug companies for some time  industry experts said on Thursday.",
        "date": "08032017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Wal-Mart  Walgreens  CVS turn up the heat on generic drugmaker deals "
    },
    {
        "content": "Drug distributor AmerisourceBergen Corp  cut its fiscal 2017 revenue growth forecast on Thursday and warned investors of the continuing fall in generic drug prices  adding that the pace of branded drug price increases could slow further.",
        "date": "08032017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Drug pricing pressure weighs on AmerisourceBergen forecast "
    },
    {
        "content": "* Shares fall as much as 11 pct; rivals also slump (Adds conf call details  analysts' comments  updates shares)",
        "date": "08032017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "UPDATE 3-Drug pricing pressure weighs on AmerisourceBergen forecast "
    },
    {
        "content": "* Cardinal Health reports Q4 and fiscal 2017 results  provides 2018 guidance",
        "date": "08022017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health Q4 non-GAAP earnings per share $1.31 "
    },
    {
        "content": "Cardinal Health Inc forecast fiscal year 2018 profit well below analyst estimates  highlighting the drag on drug distributors and generic drugmakers due to stubbornly low generic drug prices.",
        "date": "08022017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Cardinal Health's dismal forecast drags rivals  drugmakers down "
    },
    {
        "content": "* Expects fiscal year 2018 profit to be $4.85-$5.10 per share",
        "date": "08022017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "UPDATE 3-Cardinal Health's dismal forecast drags rivals  drugmakers down "
    },
    {
        "content": "* Cardinal Health CFO sees fiscal-year 2018 revenue in mid-single digit percent growth versus prior year - Conf Call",
        "date": "08022017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health says exploring strategic alternatives for its service and distribution business in China - Conf Call "
    },
    {
        "content": "Aug 2 U.S. drug distributor Cardinal Health reported a 17.7 percent decline in quarterly profit on Wednesday  hurt by weak generic drug prices.",
        "date": "08022017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "US drug distributor Cardinal Health's profit dips 17.7 pct "
    },
    {
        "content": "Cardinal Health Inc has agreed to pay nearly $2.72 million to resolve claims a company it later acquired engaged in a scheme to defraud Medicare through its marketing of negative pressure wound treatment devices  the U.S. Justice Department said.",
        "date": "06302017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "Cardinal Health to pay $2.72 million in false claims settlement "
    },
    {
        "content": "* Cardinal Health announces redemption price for outstanding notes",
        "date": "06292017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health announces redemption price for outstanding notes "
    },
    {
        "content": "* On June 12  co will issue and sell $1 billion aggregate principal amount of 1.948% notes due 2019 - SEC filing",
        "date": "06122017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health to issue  sell $1 bln aggregate principal amount of 1.948 pct notes due 2019 "
    },
    {
        "content": "* Cardinal Health Inc- ‍intends to redeem all of its outstanding 1.7 percent notes due 2018​",
        "date": "06012017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health reports redemption of outstanding notes "
    },
    {
        "content": "* Cardinal Health -board of directors approved a 3 percent increase in company's quarterly dividend from $0.4489 per share to $0.4624 per share Source text for Eikon: Further company coverage:",
        "date": "05032017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health board approved 3 pct increase in qtrly dividend "
    },
    {
        "content": "* Ceo says \"experiencing pricing deflation in generics  some heightened reimbursement pressures which affect our customers\"-conf call",
        "date": "05012017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health says generic pricing definitely getting better "
    },
    {
        "content": "Cardinal Health Inc  reported a better-than-expected quarterly profit  helped by strong performance in its medical unit even as the drug distributor continues to face declining generic drug prices.",
        "date": "05012017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Cardinal Health quarterly profit ahead of estimates "
    },
    {
        "content": "May 1 Cardinal Health Inc reported a better-than-expected quarterly profit  helped by strong performance in its medical unit even as the drug distributor continues to face declining generic drug prices.",
        "date": "05012017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "UPDATE 1-Cardinal Health quarterly profit ahead of estimates "
    },
    {
        "content": "* Cardinal health reports third-quarter results for fiscal year 2017",
        "date": "05012017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health Q3 non-gaap EPS $1.53 "
    },
    {
        "content": "May 1 Cardinal Health Inc reported a 3.8 percent rise in quarterly revenue  helped by strength in its pharmaceutical business even as the drug distributor faces declining generic drug prices.",
        "date": "05012017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Cardinal Health quarterly revenue rises 3.8 pct "
    },
    {
        "content": "April 18 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "04182017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Cardinal Health Inc said on Tuesday it expected full-year adjusted earnings at the lower end of its forecast  underscoring the U.S. drug distribution industry's struggles with declining generic drug prices.",
        "date": "04182017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Cardinal Health's dull forecast drags along rivals' shares "
    },
    {
        "content": "* Shares fall 12 pct; rivals down 5 pct (Adds analyst comments  shares)",
        "date": "04182017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "UPDATE 3-Cardinal Health's dull forecast drags along rivals' shares "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK/BUENOS AIRES  April 18 (Fitch) Fitch Ratings has revised Cardinal Health  Inc.'s (Cardinal  NYSE: CAH) Rating Outlook to Negative from Stable following the announcement that it had agreed to acquire certain assets from Medtronic (Not Rated) for approximately $6 billion. KEY RATING DRIVERS The Negative Outlook reflects Fitch's expectation that Cardinal's leverage will remain elevated for the rating category for an extended perio",
        "date": "04182017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Fitch Revises Cardinal Health's Outlook to Negative Following $6B Deal "
    },
    {
        "content": "* Medtronic signs definitive agreement to divest a portion of its patient monitoring & recovery division to Cardinal Health for $6.1 billion",
        "date": "04182017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "BRIEF-Medtronic to divest part of its unit to Cardinal Health for $6.1 bln "
    },
    {
        "content": "April 18 U.S. drug distributor Cardinal Health Inc said on Tuesday it would buy medical device maker Medtronic Plc's medical supplies businesses for $6.1 billion in cash.",
        "date": "04182017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Cardinal Health to buy Medtronic units for $6.1 bln "
    },
    {
        "content": "* Cardinal Health updates fiscal 2017 guidance; provides early outlook for future fiscal years",
        "date": "04182017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health updates fiscal 2017 guidance "
    },
    {
        "content": "* Cardinal Health to acquire leading patient product portfolio from Medtronic for $6.1 billion in cash",
        "date": "04182017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health to acquire patient product portfolio from Medtronic for $6.1 bln "
    },
    {
        "content": "NEW YORK U.S. drug distributor Cardinal Health Inc’s deal to buy Medtronic Plc’s medical supplies units days after Abbott Laboratories agreed to a long-awaited purchase of diagnostic testing company Alere Inc has raised the pulse of a sector suppressed by potential healthcare policy upheaval.",
        "date": "04202017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "LPC: U.S. healthcare lending rouses from policy-induced sedation "
    },
    {
        "content": "NEW YORK  April 20 US drug distributor Cardinal Health Inc’s deal to buy Medtronic Plc’s medical supplies units days after Abbott Laboratories agreed to a long-awaited purchase of diagnostic testing company Alere Inc has raised the pulse of a sector suppressed by potential healthcare policy upheaval.",
        "date": "04202017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "LPC: US healthcare lending rouses from policy-induced sedation "
    },
    {
        "content": "U.S. drug distributor Cardinal Health Inc  is nearing a deal to acquire medical device maker Medtronic Plc's  medical supplies business for close to $6 billion  people familiar with the matter said on Wednesday.",
        "date": "04052017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "Exclusive: Cardinal Health nears $6 billion deal for Medtronic unit - sources "
    },
    {
        "content": "* Cardinal Health  Inc reports  5.8 percent passive stake in navidea biopharmaceuticals inc as of March 3  2017 - sec filing  Source text for Eikon:  Further company coverage:",
        "date": "03132017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health reports 5.8 pct passive stake in Navidea Biopharma "
    },
    {
        "content": "* Files for potential mixed shelf  size undisclosed - SEC filing  Source text for Eikon: (http://bit.ly/2lnvjol) Further company coverage:",
        "date": "02072017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health files for potential mixed shelf  size undisclosed - SEC filing "
    },
    {
        "content": "Drug distributor Cardinal Health Inc  reported lower-than-expected quarterly revenue on Tuesday  hurt in part by pricing pressure for generic drugs  and cut its full-year adjusted earnings forecast for the second straight quarter.",
        "date": "02072017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Cardinal Health revenue misses on generic drug pricing pressure "
    },
    {
        "content": "Feb 7 Drug distributor Cardinal Health Inc  reported lower-than-expected quarterly revenue on Tuesday  hurt in part by pricing pressure for generic drugs  and cut its full-year adjusted earnings forecast for the second straight quarter.",
        "date": "02072017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "CORRECTED-UPDATE 2-Cardinal Health revenue misses on generic drug pricing pressure "
    },
    {
        "content": "Feb 7 Cardinal Health Inc reported a better-than-expected quarterly profit on Tuesday helped by lower costs and tax rate even as the drug distributor faced generic pricing pressure.",
        "date": "02072017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "UPDATE 3-Cardinal Health profit beats estimates on lower costs "
    },
    {
        "content": "* Second-quarter revenue for pharmaceutical segment increased 5 percent to $29.7 billion",
        "date": "02072017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health reports Q2 EPS $1.02 "
    },
    {
        "content": "Feb 7 Drug distributor Cardinal Health Inc  reported a 5 percent rise in quarterly revenue  helped by strength in its pharmaceutical business  which more than offset generic pricing pressure.",
        "date": "02072017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Cardinal Health quarterly revenue rises about 5 percent "
    },
    {
        "content": "WASHINGTON Cardinal Health 200 LLC  a unit of Cardinal Health Inc   has been awarded a $2.25 billion U.S. defense contract to provide worldwide ordering and distribution of surgical supplies  the Pentagon said on Thursday.",
        "date": "02022017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "Cardinal Health wins $2.25 billion U.S. defense contract: Pentagon "
    },
    {
        "content": "WASHINGTON  Feb 2 Cardinal Health 200 LLC  a unit of Cardinal Health Inc  has been awarded a $2.25 billion U.S. defense contract to provide worldwide ordering and distribution of surgical supplies  the Pentagon said on Thursday.",
        "date": "02022017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Cardinal Health wins $2.25 bln U.S. defense contract -Pentagon "
    },
    {
        "content": "Jan 25 Drug distributor McKesson Corp's  quarterly revenue missed estimates due to slowing pace of branded drug price increases amid rising concerns over soaring prices of medicines.",
        "date": "01252017",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "UPDATE 2-McKesson's revenue misses as pace of drug price hikes slow "
    },
    {
        "content": "* Cardinal health has agreed to pay $20 million to state of West Virginia to resolve issues",
        "date": "01092017",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health reaches settlement with West Virginia "
    },
    {
        "content": "NEW YORK A drug distributor owned by Cardinal Health Inc has agreed to pay $10 million to resolve claims it failed to alert the U.S. Drug Enforcement Administration to suspiciously large orders of addictive painkillers by New York-area pharmacies.",
        "date": "12232016",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "Cardinal settles with U.S. over painkiller shipments to pharmacies "
    },
    {
        "content": "* Press release - Navidea signs asset purchase agreement with Cardinal Health",
        "date": "11232016",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Navidea Biopharmaceuticals enters asset purchase agreement with Cardinal Health "
    },
    {
        "content": "* Fy2017 earnings per share view $5.59  revenue view $130.84 billion -- Thomson Reuters I/B/E/S",
        "date": "10312016",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health sees FY 2017 non-gaap EPS $5.40 to $5.60 from cont ops "
    },
    {
        "content": "* Cardinal Health reports Q4 and fiscal 2016 results  provides fiscal 2017 outlook",
        "date": "08022016",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health Q4 non-gaap earnings per share $1.14 "
    },
    {
        "content": "* On June 16  2016  co entered into an amended and restated five-year credit agreement - SEC Filing",
        "date": "06212016",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health enters into amended and restated 5-yr credit agreement "
    },
    {
        "content": "* Advanced Accelerator Applications S.A. says selected Cardinal Health to supply Gallium 68 dotatate doses to u.s. Hospitals and imaging centers  Source text for Eikon:  Further company coverage:    )",
        "date": "06092016",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health to prepare NETSPOT doses for Advanced Accelerator Applications "
    },
    {
        "content": "* Has entered into a strategic distribution agreement with Cardinal Health",
        "date": "05122016",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Biosensors announces strategic agreement with Cardinal Health "
    },
    {
        "content": "* Cardinal Health board of directors approves quarterly dividend  authorizes share repurchase program",
        "date": "05042016",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "BRIEF-Cardinal Health board approves 16 pct raise in quarterly dividend "
    },
    {
        "content": "Cardinal Health Inc  said it would buy privately held drug distributor Harvard Drug Group for $1.12 billion to boost volumes of its generic distribution business.",
        "date": "06052015",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "Cardinal Health to buy generics distributor for $1.12 billion "
    },
    {
        "content": "* To add more than 15 cents/share to adj profit in 2016   (Adds details  analyst comment)",
        "date": "06052015",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "UPDATE 2-Cardinal Health to buy generics distributor for $1.12 bln "
    },
    {
        "content": "June 5 Cardinal Health Inc said it would buy privately held drug distributor Harvard Drug Group for $1.12 billion.",
        "date": "06052015",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Cardinal to buy private generic drug distributor for $1.12 bln "
    },
    {
        "content": "The Federal Trade Commission split along political party lines in a deal announced on Monday in which Cardinal Health will pay $26.8 million to settle charges that it illegally monopolized markets in 25 cities for the sale of low-energy radiopharmaceuticals to hospitals and clinics.",
        "date": "04212015",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "Cardinal Health settlement splits FTC along party lines "
    },
    {
        "content": " (This March 29 story corrects to show that sales tax fell for third time since 2010  instead of second time  in first and third paragraphs; and adds graphic)",
        "date": "03302015",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "In Texas oil town  early signs of economic strain as drilling slows "
    },
    {
        "content": "NEW YORK U.S. pharmaceutical and medical equipment maker Johnson & Johnson  said on Monday it agreed to sell its Cordis vascular technology unit to Cardinal Health  for $1.9 billion  completing its exit from the cardiovascular stent business.",
        "date": "03022015",
        "name": "Cardinal Health Inc",
        "news_type": "topStory",
        "symbol": "CAH",
        "title": "Cardinal to buy J&J vascular technology unit Cordis for $1.9 billion "
    },
    {
        "content": "NEW YORK  March 2 U.S. pharmaceutical and medical equipment maker Johnson & Johnson said on Monday it agreed to sell its Cordis vascular technology unit to Cardinal Health for $1.9 billion  completing its exit from the cardiovascular stent business.",
        "date": "03022015",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "UPDATE 3-Cardinal to buy J&J vascular technology unit Cordis for $1.9 bln "
    },
    {
        "content": "NEW YORK  March 2 Cardinal Health said on Monday that it would buy Johnson & Johnson's Cordis vascular technology unit for $1.9 billion and that the acquisition would boost 2017 earnings by 20 cents per share.",
        "date": "03022015",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Cardinal to buy J&J vascular technology unit Cordis for $1.9 bln "
    },
    {
        "content": "Feb 3 Healthcare services provider Cardinal Health Inc said its unit was accused of fraud and violating U.S. healthcare laws by a whistleblower under the False Claims Act.",
        "date": "02042015",
        "name": "Cardinal Health Inc",
        "news_type": "normal",
        "symbol": "CAH",
        "title": "Whistleblower files U.S. fraud suit against Cardinal Health "
    }
]