[
    {
        "content": "* Canon unit sales seen at 9.5 million units for year ending december  up 8 percent on previous outlook - Nikkei‍​​ Source text: (s.nikkei.com/2hGabNh) Further company coverage: (bangalore.newsroom@thomsonreuters.com)",
        "date": "11162017",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "BRIEF-Canon unit sales seen at 9.5 mln units for year ending December - Nikkei‍​ "
    },
    {
        "content": "* Canon plans to lift its regular dividend for fiscal 2018 by 10 yen per share over current-year projections to 160 yen - Nikkei",
        "date": "11152017",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "BRIEF-Canon to raise ordinary dividend for fiscal 2018 - Nikkei "
    },
    {
        "content": "TOKYO Japan's Canon Inc hiked its annual profit forecast for the third time on Tuesday on the back of expanding demand for \"business-to-business\" products from surveillance cameras to organic light-emitting diode (OLED) screen production equipment.",
        "date": "10242017",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Canon hikes profit outlook on demand for surveillance cameras  OLED production gear "
    },
    {
        "content": "* Weaker yen gives tailwind to Q3 results (Writes through; adds context  details of currency moves)",
        "date": "10242017",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 2-Canon hikes profit outlook on demand for surveillance cameras  OLED production gear "
    },
    {
        "content": "TOKYO  Oct 24 Japan's Canon Inc raised its annual operating profit forecast on Tuesday  its third upward revision this year  on the back of increased demand for organic light-emitting diode (OLED) screen production equipment and a weaker yen.",
        "date": "10242017",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon raises annual profit forecast on demand for OLED kit  weaker yen "
    },
    {
        "content": "* Canon Inc's consolidated operating profit for the year ending in December is expected to jump 40% to 330 billion yen ($2.94 billion) - Nikkei",
        "date": "07202017",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "BRIEF-Canon's consolidated operating profit is expected to jump 40 pct for year ending in December - Nikkei "
    },
    {
        "content": " (Adds accounting period) Jul 27 (Reuters)-  Canon Inc  CONSOLIDATED FINANCIAL HIGHLIGHTS (in billions of yen unless specified)            6 months ended  6 months ended     Year to             Jun 30  2017   Jun 30  2016    Dec 31  2017                   LATEST      YEAR-AGO       COMPANY                  RESULTS       RESULT       FORECAST   Sales         1.97 trln     1.66 trln     4.05 trln                (+18.6 pct)   (-9.5 pct)    (+19.1 pct)   Operating       171.98       108.68        33",
        "date": "07272017",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "REFILE-TABLE-Canon- 6 MONTH group results (SEC) "
    },
    {
        "content": "* Printer  camera businesses recovering (Adds risk of hefty EU fines)",
        "date": "07272017",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 1-Canon lifts annual profit forecast on recovery in printer  camera sales "
    },
    {
        "content": "TOKYO  July 27 Japan's Canon Inc raised its annual operating profit forecast on Thursday in its second upward revision this year  helped by a recovery in printer sales.",
        "date": "07272017",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon lifts annual profit forecast on recovery in printer sales "
    },
    {
        "content": "* Dollar-yen impact limited on Japan stocks longer-term - analyst",
        "date": "07212017",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Nikkei edges down as market analyses ECB; Yaskawa soars "
    },
    {
        "content": "TOKYO  July 7 Canon Inc's stock fell to its lowest levels in more than two months on Friday after EU regulators said they may fine it up to 10 percent of annual revenue for jumping the gun in its acquisition of Toshiba Corp's medical unit.",
        "date": "07072017",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Canon drops to more than two-month low after EU threatens huge fine "
    },
    {
        "content": "BRUSSELS  July 6 EU antitrust regulators accused German drugmaker Merck KGaA  General Electric and Japan's Canon of providing misleading information during their merger deals  as regulators stepped up their crackdown on such practices.",
        "date": "07062017",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "EU charges Merck KGaA  GE  Canon of misleading merger info "
    },
    {
        "content": "* May fine it up to 10 pct of annual revenue  roughly $2.9 bln",
        "date": "07072017",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 1-Canon drops to more than 2-month low after EU threatens huge fine "
    },
    {
        "content": "TOKYO  July 7 Shares of Canon Inc dropped to their lowest levels in more than two months on Friday after EU antitrust regulators said they could fine it up to 10 percent of annual revenue if they concluded it had breached merger rules.",
        "date": "07072017",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon falls to more than 2-month low after EU threatens huge fine "
    },
    {
        "content": "* Says co lost lawsuit filed by Canon Inc against Color Imaging Inc and the company  regarding patent disputes",
        "date": "06222017",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "BRIEF-General Plastic Industrial says lawsuit in patent case "
    },
    {
        "content": "TOKYO  April 26 Japan's Canon Inc on Wednesday lifted its full-year operating profit forecast after reporting strong first-quarter results on the back of earnings from a medical equipment unit it bought from Toshiba Corp last year.",
        "date": "04262017",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon raises annual profit outlook on Toshiba medical unit acquisition "
    },
    {
        "content": "* Not considering bidding for Toshiba chip unit -CFO (Adds CFO comments on existing businesses  Toshiba chip sale)",
        "date": "04262017",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 1-Canon raises annual profit outlook on Toshiba medical unit acquisition "
    },
    {
        "content": "* Says it will fully acquire Miyazaki Daishin Canon Inc through stock swap  effective June 1",
        "date": "04262017",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "BRIEF-Canon to fully acquire Miyazaki Daishin Canon Inc through stock swap "
    },
    {
        "content": "* Canon Inc probably saw its group operating profit roughly double on the year in the January-March quarter to about 80 billion yen - Nikkei",
        "date": "04192017",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "BRIEF-Canon Inc probably saw group operating profit roughly double on the year in the January-March quarter - Nikkei "
    },
    {
        "content": "* Says the co plans to sell its 65-percent-owned unit Toshiba Medical Finance to Canon Inc  with selling price at 3.14 billion yen",
        "date": "02212017",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "BRIEF-Toshiba to sell 65 pct stake in Toshiba Medical Finance to Canon "
    },
    {
        "content": "TOKYO Japanese camera and printer maker Canon Inc forecast full-year operating profit to climb 11.4 percent  its first rise in three years  bolstered by earnings from a medical equipment unit it bought from Toshiba Corp last year.",
        "date": "01312017",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Canon sees first profit gain in three years after medical unit acquisition "
    },
    {
        "content": "TOKYO Japan's Canon Inc said would be difficult to invest in Toshiba Corp's memory chip business  dousing hopes that the struggling conglomerate could count on its business partner for help as it scrambles for funds to offset a multi-billion dollar writedown.",
        "date": "01312017",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon unlikely to help Toshiba with investment in memory chip business "
    },
    {
        "content": "* Canon says needs to prioritise investment for its own growth",
        "date": "01312017",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 1-Canon unlikely to help Toshiba with investment in memory chip business "
    },
    {
        "content": "TOKYO  Jan 31 Investing in Toshiba Corp's  chips business would be a difficult proposition for Canon Inc as it needs to prioritise investment for its own growth  the camera and printer maker's chief financial officer said Tuesday.",
        "date": "01312017",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon CFO says difficult to invest in Toshiba chip business "
    },
    {
        "content": "* Q4 operating profit slumps by a quarter on yen strength   (Recasts on profit outlook for 2017)",
        "date": "01312017",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 1-Canon sees first profit gain in 3 years after medical unit acquisition "
    },
    {
        "content": "TOKYO  Jan 31 Japan's Canon Inc  the world's biggest maker of cameras and printers  said on Tuesday fourth-quarter operating profit fell 25.1 percent  after the yen strengthened following Britain's vote in June to leave the European Union.",
        "date": "01312017",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon Q4 profit tumbles  hurt by yen strength after Brexit decision "
    },
    {
        "content": "* Canon's group operating profit is seen topping 250 billion yen ($2.17 billion) for the fiscal year ending December 2017 - nikkei",
        "date": "01272017",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "BRIEF-Canon Inc's sales seen growing nearly 20 pct for FY ending Dec 2017 - Nikkei "
    },
    {
        "content": "TOKYO Japan's Canon Inc  is considering investing in Toshiba Corp's  chip business  Kyodo news agency reported on Friday.",
        "date": "01202017",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Canon considering investment in Toshiba's chip business: Kyodo "
    },
    {
        "content": "TOKYO  Jan 20 Japan's Canon Inc is considering investing in Toshiba Corp's chip business  Kyodo news agency reported on Friday.",
        "date": "01202017",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon considering investment in Toshiba's chip business - Kyodo "
    },
    {
        "content": "* Rating and Investment Information  Inc. (R&I) affirmed the company's rating at \"AA+\" - R&I",
        "date": "01162017",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "BRIEF-R&I affirms Canon's rating at \"AA+\" and announces stable outlook - R&I "
    },
    {
        "content": "* Q3 operating profit falls 48 pct vs year ago  below expectations",
        "date": "10262016",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "UPDATE 1-Canon trims annual profit outlook as post-Brexit yen rise hits Q3 "
    },
    {
        "content": "TOKYO  Oct 26 Japan's Canon Inc said on Tuesday its third quarter operating profit fell 48 percent  hurt by a strengthened yen following Britain's vote to leave the European Union.",
        "date": "10262016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon Q3 operating profit nearly halves on post-Brexit yen strength "
    },
    {
        "content": "* Signed an industrial agreement with Canon for the integration of its dynamic sensor on its radiology solutions  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "10102016",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "BRIEF-Diagnostic Medical Systems signs an industrial agreement with Canon "
    },
    {
        "content": "* Japan's Canon Inc reports 19.9 pct stake in T2 Biosystems Inc as of September 21  2016 - SEC filing",
        "date": "09302016",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "BRIEF-Japan's Canon Inc reports 19.9 pct stake in T2 Biosystems - SEC filing "
    },
    {
        "content": "* Tokyo Electron aims to boost operating profit at its display production equipment business to at least 12 billion yen in fiscal 2019 - Nikkei",
        "date": "08302016",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "BRIEF-Canon sees oper profit of 7 bln yen in segment that includes Canon Tokki for FY ending Dec - Nikkei "
    },
    {
        "content": "TOKYO  July 26 Japan's Canon Inc on Tuesday cut its full-year profit forecast  becoming the first major technology company to report a weaker outlook on the yen's surge following Britain's vote to leave the European Union.",
        "date": "07262016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon cuts profit forecast as post-Brexit yen strength bites "
    },
    {
        "content": "TOKYO Japan's anti-monopoly regulator has approved Canon Inc's  acquisition of Toshiba Corp's  medical equipment unit  but issued a warning over the way they carried out the deal  which antitrust experts have called questionable.",
        "date": "06302016",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Japan regulator approves Canon deal to buy Toshiba unit  warns on method "
    },
    {
        "content": "* Unorthodox deal structure allowed Toshiba to raise cash in hurry   (Adds comments from the FTC)",
        "date": "06302016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 4-Japan regulator approves Canon deal to buy Toshiba unit  warns on method "
    },
    {
        "content": "* issued warning to Canon over the way it notified authorities about Toshiba Medical purchase",
        "date": "06302016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "BRIEF-Japan Fair Trade Commission: Approves Canon's purchase of Toshiba Medical "
    },
    {
        "content": "- says to brief on Canon Inc's deal to purchase Toshiba's medical unit at 3 p.m. (0600 GMT)",
        "date": "06302016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "BRIEF-Japan Fair Trade Commission to brief on Canon's deal to buy Toshiba Medical "
    },
    {
        "content": "TOKYO Canon Inc  Chief Executive Fujio Mitarai said on Friday he was \"very dismayed\" by Britain's shock decision to leave the European Union  saying the move hurt Japan's economic growth prospects.",
        "date": "06242016",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Canon CEO: 'very dismayed' by Brexit  could halt Japan recovery "
    },
    {
        "content": "TOKYO  June 30 Japan's anti-monopoly regulator is investigating Canon Inc over a possible breach of disclosure rules in the company's acquisition of Toshiba Corp's  medical equipment unit  a source with direct knowledge of the matter said.",
        "date": "06302016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "CORRECTED-Japan regulators probing Canon on Toshiba Medical deal -source "
    },
    {
        "content": "TOKYO  June 24 Canon Inc Chief Executive Fujio Mitarai said on Friday he was \"very dismayed\" by Britain's shock decision to leave the European Union  saying the move hurt Japan's economic growth prospects.",
        "date": "06242016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon CEO: \"very dismayed\" by Brexit  could halt Japan recovery "
    },
    {
        "content": "TOKYO  May 12 Japan's Toshiba Corp said it expects to post an operating profit this financial year after a big loss last year on large writedowns and restructuring costs in the wake of a damaging accounting scandal.",
        "date": "05122016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Toshiba expects to swing to annual profit after scandal-related loss "
    },
    {
        "content": "* Firm trying to diversify away from consumer cameras   (Adds segment breakdown  context)",
        "date": "04262016",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "UPDATE 1-Canon says Q1 profit hit by weak printer  camera sales; cuts FY outlook "
    },
    {
        "content": "TOKYO  April 25 Toshiba Corp  in a hurry to raise cash before closing its books for the business year that ended at the end of last month  was able to structure the sale of its medical equipment business to Canon Inc  in an unorthodox way so that it could book the 665.5 billion yen ($5.95 billion) proceeds before the deal had been approved by regulators.",
        "date": "04242016",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "How Toshiba got paid before a sale closed in a maneuver skirting antitrust rules "
    },
    {
        "content": "TOKYO Toshiba Corp  in a hurry to raise cash before closing its books for the business year that ended at the end of last month  was able to structure the sale of its medical equipment business to Canon Inc in an unorthodox way so that it could book the 665.5 billion yen ($5.95 billion) proceeds before the deal had been approved by regulators.",
        "date": "04252016",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "How Toshiba got paid before a sale closed in a maneuver skirting antitrust rules "
    },
    {
        "content": "TOKYO  April 26 Japan's Toshiba Corp  said on Tuesday that it booked an impairment charge of 260 billion yen ($2.34 billion) for the past fiscal year on the nuclear business  a much-anticipated move to address lingering doubts over its book-keeping.",
        "date": "04262016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Toshiba books $2.3 bln impairment charge in FY2015 on nuclear business "
    },
    {
        "content": "* Medical unit sale to offset writedown's earnings impact   (Adds additional sourcing on CEO  background and shares)",
        "date": "04202016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 2-Toshiba preparing Westinghouse writedown  CEO to step down -sources "
    },
    {
        "content": "* Says Canon IT solutions makes further inroads into Japanese IT security market with Clavister solutions",
        "date": "04012016",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "BRIEF-Clavister receives further orders from Canon IT Solutions "
    },
    {
        "content": "TOKYO  March 15 Toshiba Corp is set to drop plans to seek about $1.8 billion in additional loans as its planned sale of a medical unit will likely provide it with enough funds for the time being  sources familiar with the situation said on Tuesday.",
        "date": "03152016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Toshiba  banking on medical unit sale  drops plans for more loans-sources "
    },
    {
        "content": "TOKYO  March 15 Japan's Toshiba Corp  said it would unveil its business strategy for next fiscal year on Friday in an announcement expected to include plans to sell its medical equipment unit to Canon Inc and boost its finances after a $1.3 billion accounting scandal.",
        "date": "03152016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Toshiba to announce business plan on Friday "
    },
    {
        "content": "TOKYO Canon Inc has agreed to buy Toshiba Corp's medical equipment unit for 665.5 billion yen ($5.9 billion)  the companies said on Thursday.",
        "date": "03172016",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Canon agrees to buy Toshiba's medical equipment unit for $5.9 billion "
    },
    {
        "content": "* Toshiba says deal could yield $5.3-bln profit in current fiscal",
        "date": "03172016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 1-Canon agrees to buy Toshiba's medical equipment unit for $5.9 bln "
    },
    {
        "content": "TOKYO  March 17 Canon Inc has agreed to buy Toshiba Corp's medical equipment unit for 665.5 billion yen ($5.9 billion)  the companies said on Thursday.",
        "date": "03172016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon agrees to buy Toshiba's medical equipment unit for $5.9 bln "
    },
    {
        "content": "TOKYO  March 8 Toshiba Corp plans an extraordinary executive meeting on Wednesday  indicating the troubled conglomerate will settle on a preferred bidder for its healthcare unit  two people with knowledge of the process said on Monday.",
        "date": "03072016",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "REFILE-Toshiba to name bidder for healthcare unit Wednesday; Canon  Fujifilm lead-sources "
    },
    {
        "content": "TOKYO  March 9 Canon Inc is front-runner to buy the healthcare business of Toshiba Corp  with a bid of over 700 billion yen ($6.2 billion)  Japan's Nikkei newspaper reported.",
        "date": "03082016",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Canon front-runner with $6 bln bid for Toshiba Medical - Nikkei "
    },
    {
        "content": "TOKYO Toshiba Corp  has granted Canon Inc  exclusive negotiating rights for its medical equipment unit after a hotly contested auction  with a report putting Canon's offer at more than $6 billion.",
        "date": "03092016",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Canon closes in on Toshiba's medical unit after fierce bidding "
    },
    {
        "content": "* Canon has offered more than 700 bln yen for the unit - Nikkei",
        "date": "03092016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 3-Canon closes in on Toshiba's medical unit after fierce bidding "
    },
    {
        "content": "* gives Canon Inc exclusive negotiating rights for Toshiba Medical",
        "date": "03092016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "BRIEF-Toshiba says gives Canon exclusive negotiating rights for medical unit "
    },
    {
        "content": "TOKYO  March 9 Japan's Canon Inc is set to buy Toshiba Corp's medical equipment unit for 700 billion yen ($6.2 billion)  beating rival Fujifilm Holdings Corp  in a hotly contested auction  the Nikkei business daily reported on Wednesday.",
        "date": "03092016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon to buy Toshiba Medical for around $6.2 bln -Nikkei "
    },
    {
        "content": "TOKYO Canon Inc is front-runner to buy the healthcare business of Toshiba Corp with a bid of over 700 billion yen ($6.2 billion)  Japan's Nikkei newspaper reported.",
        "date": "03092016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon front-runner with $6 billion bid for Toshiba Medical: Nikkei "
    },
    {
        "content": "TOKYO  March 9 Toshiba Corp said its board of directors would hold a meeting on Wednesday to discuss the planned sale of its medical equipment unit and announce the outcome \"swiftly\" if any decision is reached.",
        "date": "03092016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Toshiba: board to discuss sale of medical equipment unit Wednesday "
    },
    {
        "content": "* Toshiba plans to sell entire unit to bolster finances -sources",
        "date": "02292016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 1-Toshiba to sell entire medical unit  deal may see aggressive bids -sources "
    },
    {
        "content": "TOKYO  Feb 29 Struggling Toshiba Corp  plans to sell its entire medical equipment unit rather than just a controlling stake  people familiar with matter said  adding that aggressive bidding could value the business at much more than initial estimates of $3.5 billion.",
        "date": "02292016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Toshiba to sell entire medical unit  deal may see aggressive bids -sources "
    },
    {
        "content": "TOKYO  Jan 27 Canon Inc is interested in buying Toshiba Medical Systems  a subsidiary that Japan's Toshiba Corp has put on sale  a Canon executive said on Wednesday.",
        "date": "01272016",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Canon interested in buying Toshiba Medical -exec "
    },
    {
        "content": "* Canon to appoint senior managing director Masaya Maeda to president and COO - Nikkei",
        "date": "01272016",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "BRIEF-Canon to appoint senior managing director Masaya Maeda to president and COO-Nikkei "
    },
    {
        "content": "TOKYO Japan's Canon Inc  on Tuesday cut its full-year profit view citing weaker-than-expected demand for consumer cameras in China and Southeast Asia  adding weight to its near $3 billion decision this year to expand into surveillance equipment.",
        "date": "10272015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Canon cuts full-year profit outlook on sluggish China demand "
    },
    {
        "content": "* Camera recovery hard to predict  China stimulus could help -CFO   (Adds camera sales forecasts  shares  context)",
        "date": "10272015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 1-Canon cuts full-year profit outlook on sluggish China demand "
    },
    {
        "content": "Tokyo  Oct 27 Japan's Canon Inc on Tuesday lowered its full-year earnings forecast  citing slower-than-expected demand for digital cameras in China and Southeast Asian countries.",
        "date": "10272015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon cuts full-year profit outlook on sluggish China  SE Asia demand "
    },
    {
        "content": "PARIS Canon Inc  the world's biggest maker of cameras and printers  is setting its sights on higher growth fueled by acquisitions as it expands into related markets like video surveillance and medical imaging  Chairman Fujio Mitarai said.",
        "date": "10142015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Acquisitions bring Canon's 5 trln-yen sales target back into view "
    },
    {
        "content": "* Signs distribution agreement with Canon IT Solutions  a subsidiary of Canon Marketing Japan group",
        "date": "10062015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "BRIEF-Clavister signs distribution agreement with Japan's Canon IT Solutions "
    },
    {
        "content": "* Says orders machinery equipment from Canon Inc  for T$578 million ($17.75 million)",
        "date": "09042015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "BRIEF-Taiwan's Innolux orders machinery equipment from Canon for T$578 mln "
    },
    {
        "content": "TOKYO Japan's Canon Inc cut its earnings outlook for the full year and reported a 16 percent fall in quarterly profit as consumers  increasingly in the habit of taking photos with their smartphones  bought fewer compact digital cameras.",
        "date": "07272015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Canon cuts outlook as weak camera sales hit second-quarter profit "
    },
    {
        "content": "* Compact camera sales continue decline   (Adds company comments  context  shares)",
        "date": "07272015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 1-Canon cuts outlook as weak camera sales hit Q2 profit "
    },
    {
        "content": "TOKYO  July 27 Japan's Canon Inc on Monday lowered its earnings outlook for the full year and reported a 16 percent fall in second-quarter net profit  as fewer consumers bought new compact digital cameras.",
        "date": "07272015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon marks down outlook as weak camera sales hit Q2 profit "
    },
    {
        "content": "STOCKHOLM  June 16 Hedge fund Elliott Management has moved to bring in a special examiner at Axis as its standoff with Japan's Canon in the Swedish video surveillance firm intensified.",
        "date": "06162015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Hedge fund Elliott to bring in special examiner at Canon's Axis "
    },
    {
        "content": "* Yen weakness is positive  helps economy  Further company coverage:    (Reporting by Ritsuko Ando)",
        "date": "06022015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "BRIEF-Canon CEO says yen weakness is positive  helps economy "
    },
    {
        "content": "TOKYO Japan's Canon Inc  reported first-quarter net profit that fell by almost a third on Monday  grossly undershooting expectations  citing a collapse in demand for compact digital cameras.",
        "date": "04272015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Canon first quarter profit drops as compact camera demand collapses "
    },
    {
        "content": "* No rush to buy 100 pct of Axis - executive   (Adds further reasons for profit decline  executive comments on Axis)",
        "date": "04272015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 2-Canon Q1 profit drops as compact camera demand collapses "
    },
    {
        "content": "TOKYO Canon Inc  said on Friday it owned 84 percent of the shares in Swedish video-surveillance firm Axis AB   and said it was extending the period for other shareholders to accept but would not raise its offer price of 340 Swedish crowns per share.",
        "date": "04242015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Canon says owns 84 percent of Axis  won't raise offer "
    },
    {
        "content": "TOKYO  April 27 Japan's Canon Inc on Monday said net profit fell 28.7 percent in its first quarter  falling short of analyst estimates  as the company faced slumping sales of digital compact cameras.",
        "date": "04272015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon Q1 net profit falls 28.7 pct  misses estimates "
    },
    {
        "content": "TOKYO  April 24 Canon Inc said on Friday it owned 84 percent of the shares in Swedish video-surveillance firm Axis AB  and said it was extending the period for other shareholders to accept but would not raise its offer price of 340 Swedish crowns per share.",
        "date": "04242015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon says owns 84 pct of Axis  won't raise offer "
    },
    {
        "content": "Apr 27 (Reuters)-            Canon Inc            CONSOLIDATED FINANCIAL HIGHLIGHTS       (in billions of yen unless specified)                     3 months ended      3 months ended       Yearto                     Mar 31  2015        Mar 31  2014     Dec 31  2015                       LATEST             YEAR-AGO          COMPANY                         RESULTS             RESULT          FORECAST      Sales              857.45              868.31          3.86 trln                      (-1.3 p",
        "date": "04272015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "TABLE-Canon -Q1 group results (SEC) "
    },
    {
        "content": "* Market focused on central banks' policy meetings     * Canon  Fanuc among companies reporting earnings Mon     * Volume may stay low before Golden Week holidays - analysts      By Ayai Tomisawa     TOKYO  April 27 Japanese stocks were flat in a choppy Monday morning as investors were cautious amid the earnings season and ahead of some key events later this week  including central bank meetings in Japan and the United States.     The Bank of Japan is expected to hold off on expandin",
        "date": "04272015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Nikkei flat as earnings  central bank meetings cap risk appetite "
    },
    {
        "content": "* Elliott Management complicated bid with purchase of 10 pct stake",
        "date": "04082015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "UPDATE 1-Canon extends Axis offer period  says will not sweeten bid "
    },
    {
        "content": "April 6 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "04062015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "TOKYO  April 8 Canon Inc said on Wednesday it was extending the offer period for its proposed $2.8 billion takeover of Axis AB until April 21  after it acquired 76 percent of the shares in the Swedish video-surveillance firm.",
        "date": "04082015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon says has 76 pct of Axis  extends offer period to April 21 "
    },
    {
        "content": "TOKYO Japan's Canon Inc is unlikely to raise its offer for Swedish surveillance camera maker Axis AB for now but won't back out of the deal either  despite pressure from hedge fund Elliott Management  sources said on Monday.",
        "date": "04062015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon won't raise Axis offer yet  won't back out either: sources "
    },
    {
        "content": "TOKYO  April 6 Japan's Canon Inc is unlikely to raise its offer for Swedish surveillance camera maker Axis AB for now but won't back out of the deal either  despite pressure from hedge fund Elliott Management  sources said on Monday.",
        "date": "04062015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon won't raise Axis offer yet  won't back out either -sources "
    },
    {
        "content": "STOCKHOLM/TOKYO Hedge fund Elliott Management has raised its stake in  surveillance camera maker Axis AB   a disclosure notice showed  possibly putting pressure on Japan's Canon Inc  to sweeten its 23.6 billion crown ($2.75 billion) takeover bid.",
        "date": "03312015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Elliott Management ups Axis stake  complicating Canon bid "
    },
    {
        "content": "STOCKHOLM Hedge fund Elliott Management has raised its stake in  surveillance camera maker Axis AB   a disclosure notice showed on Monday  further pressuring Japan's Canon Inc  to sweeten its bid for it.",
        "date": "03302015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Hedge fund Elliot Management raises stake in Axis to 10 percent "
    },
    {
        "content": "STOCKHOLM Hedge fund Elliott Management disclosed a 7.5 percent stake in Swedish surveillance camera maker Axis AB   potentially raising pressure on Japan's Canon Inc  to raise its bid for the firm.",
        "date": "03272015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Hedge fund Elliott Management discloses stake in Axis after Canon bid "
    },
    {
        "content": "STOCKHOLM/TOKYO  March 31 Hedge fund Elliott Management has raised its stake in  surveillance camera maker Axis AB  a disclosure notice showed  possibly putting pressure on Japan's Canon Inc to sweeten its 23.6 billion crown ($2.75 billion) takeover bid.",
        "date": "03312015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 1-Elliott Management ups Axis stake  complicating Canon bid "
    },
    {
        "content": "STOCKHOLM  March 30 Hedge fund Elliott Management has raised its stake in  surveillance camera maker Axis AB  a disclosure notice showed on Monday  further pressuring Japan's Canon Inc to sweeten its bid for it.",
        "date": "03302015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Hedge fund Elliot Management raises stake in Axis to 10 pct "
    },
    {
        "content": "STOCKHOLM  March 27 Hedge fund Elliott Management disclosed a 7.5 percent stake in Swedish surveillance camera maker Axis AB  potentially raising pressure on Japan's Canon Inc to raise its bid for the firm.",
        "date": "03272015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 1-Hedge fund Elliott Management discloses stake in Axis after Canon bid "
    },
    {
        "content": "* Last week  Elliot disclosed a 7.5 percent stake in Axis  potentially raising pressure on Japan's Canon Inc to raise its bid for the firm   Source text for Eikon:  Further company coverage:",
        "date": "03302015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "BRIEF-Elliott Capital raises Axis stake to 10.01 percent "
    },
    {
        "content": "STOCKHOLM Hedge fund Elliott Management on Thursday said it owned a 7.5 percent stake in Swedish surveillance camera maker Axis   potentially raising pressure on Japan's Canon  to raise its bid for the firm.",
        "date": "03262015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Hedge fund Elliott Management has 7.5 percent of Sweden's Axis: filing "
    },
    {
        "content": "STOCKHOLM  March 26 Hedge fund Elliott Management on Thursday said it owned a 7.5 percent stake in Swedish surveillance camera maker Axis  potentially raising pressure on Japan's Canon to raise its bid for the firm.",
        "date": "03262015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Hedge fund Elliott Management has 7.5 pct of Sweden's Axis -filing "
    },
    {
        "content": "Bar code printer maker Domino Printing Sciences Plc  is planning to sell itself to a Japanese company in a deal worth close to 1 billion British pounds ($1.51 billion)  Sky News reported.",
        "date": "03102015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Domino Printing Sciences reaches a deal with a Japanese company: Sky News "
    },
    {
        "content": "TOKYO Canon Inc  Chief Executive Fujio Mitarai said his company had the funds and willingness for more acquisitions this year after a planned 23.6 billion Swedish crown ($2.8 billion) takeover of network video surveillance leader Axis AB .",
        "date": "03032015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Canon has funds  willingness for more M&As after Axis: CEO "
    },
    {
        "content": "* Follows Canon offer for Swedish firm at 50 pct premium   (Updates with company announcement)",
        "date": "02172015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "UPDATE 3-Japan's Kintetsu Express to buy Singapore's APL Logistics for $1.2 bln "
    },
    {
        "content": "TOKYO/STOCKHOLM Canon Inc made a 23.6 billion-Swedish-crown ($2.83 billion) offer for network video surveillance leader Axis AB on Tuesday -- the biggest purchase ever for the Japanese firm trying to expand beyond a shrinking camera market.",
        "date": "02102015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Canon to buy video surveillance leader Axis for $2.8 bln "
    },
    {
        "content": "Feb 10 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "02102015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "TOKYO/STOCKHOLM Canon Inc  made a 23.6 billion-Swedish-crown ($2.83 billion) offer for network video surveillance leader Axis AB  on Tuesday -- the biggest purchase ever for the Japanese firm trying to expand beyond a shrinking camera market.",
        "date": "02102015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Canon to buy video surveillance leader Axis for $2.8 billion "
    },
    {
        "content": "* Deal to help Canon expand in growing surveillance market   (Adds analyst on potential rivals  updates Axis share price)",
        "date": "02102015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 3-Canon to buy video surveillance leader Axis for $2.8 bln "
    },
    {
        "content": "STOCKHOLM  Feb 10 The following stocks may be affected by newspaper reports and other factors on Tuesday:",
        "date": "02102015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 1-NORDIC STOCKS - Factors to watch on Feb 10 "
    },
    {
        "content": "* Says board of directors of axis has based on a financial short and mid-term perspective concluded to unanimously recommend that shareholders of axis accept public offer made by canon",
        "date": "02102015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "BRIEF-Axis board recommends Canon bid of SEK 340/share "
    },
    {
        "content": "* Fed upgrades economic view  on track to rate hikes     * Komatsu  Hitachi Construction fall sharply after earnings     * Canon disappoint investors  a weaker yen only bright spot     * Market supported by buying from BOJ  pensions - analysts      By Hideyuki Sano     TOKYO  Jan 29 Japan's Nikkei average slipped on Thursday in sympathy with falls in Wall Street shares following the Fed's unwavering stance on rate hikes  with construction equipment makers badly hit by disappointing e",
        "date": "01292015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Nikkei falls after Fed  construction equipment makers battered "
    },
    {
        "content": "TOKYO Japan's Canon Inc  reported a slight increase in fourth-quarter profit  with a weaker yen and rising sales of office equipment countering difficulties faced by its camera division.",
        "date": "01282015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Weaker yen helps to lift Canon profit as camera demand slows "
    },
    {
        "content": "TOKYO  Feb 10 Japan's Canon Inc said on Tuesday that it is launching a tender offer to buy all of Sweden's Axis AB for about 23.6 billion crowns  or about 333.7 billion yen ($2.8 billion).",
        "date": "02102015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Japan's Canon to launch $2.8 bln bid for Sweden's Axis AB "
    },
    {
        "content": "TOKYO Japan's Canon Inc  reported a slight increase in fourth-quarter profit  with a weaker yen and rising sales of office equipment countering difficulties faced by its camera division.",
        "date": "01292015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Weaker yen helps to lift Canon profit as camera demand slows "
    },
    {
        "content": "* Sees compact camera sales falling in 2015   (Adds 2015 sales and profit outlook)",
        "date": "01282015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "UPDATE 2-Weaker yen helps to lift Canon profit as camera demand slows "
    },
    {
        "content": "TOKYO  Jan 28 Japan's Canon Inc  reported a slight rise in fourth-quarter profit thanks to a weaker yen and solid office equipment sales  although its camera business struggled to attract photographers who are increasingly turning to rivals' compact models.",
        "date": "01282015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "Weaker yen helps lift Canon profit despite poor camera sales "
    },
    {
        "content": "* Canon Inc says sees interchangeable lens camera sales in 2015 of 6.4 million units versus 6.36 million in 2014",
        "date": "01282015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "BRIEF-Canon announces unit sales  forex forecasts for 2015 "
    },
    {
        "content": "Jan 28 (Reuters)-            Canon Inc            CONSOLIDATED FINANCIAL HIGHLIGHTS       (in billions of yen unless specified)                     Year ended      Year ended       Year to        NEXT                   Dec 31  2014    Dec 31  2013   Dec 31  2015      YEAR                        LATEST         YEAR-AGO        COMPANY      COMPANY                       RESULTS         RESULT        FORECAST    H1 FORECAST    Sales           3.73 trln       3.73 trln      3.90 trln                 ",
        "date": "01282015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "TABLE-Canon -2014 group results (SEC) "
    },
    {
        "content": "Jan 28 (Reuters)-            Canon Inc            PARENT-ONLY FINANCIAL HIGHLIGHTS       (in billions of yen unless specified)                    Year ended      Year ended       Year to       NEXT                    Dec 31  2014    Dec 31  2013   Dec 31  2015     YEAR                         LATEST         YEAR-AGO        COMPANY      COMPANY                       RESULTS         RESULTS       FORECAST    H1 FORECAST    Sales           2.08 trln       2.15 trln                                  ",
        "date": "01282015",
        "name": "Canon Inc",
        "news_type": "normal",
        "symbol": "CAJ",
        "title": "TABLE-Canon -2014 parent results "
    },
    {
        "content": "TOKYO  Jan 9 Canon Inc and other Japanese electronics companies want to bring production of some goods back home  reversing a years-old trend of overseas manufacturing as a rapid decline in the value of the yen makes local goods more competitive.",
        "date": "01092015",
        "name": "Canon Inc",
        "news_type": "topStory",
        "symbol": "CAJ",
        "title": "Weak yen spurs Japan electronics firms to bring production home "
    }
]