[
    {
        "content": "* CHUBB CREATES SMALL COMMERCIAL DIVISION FOR SMES IN ASIA PACIFIC Source text for Eikon: Further company coverage:",
        "date": "11142017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb says it creates small commercial division for SMEs in Asia Pacific "
    },
    {
        "content": "* Chubb ltd - ‍ on October 25  Chubb limited  Chubb Bermuda insurance  among others   entered into an amended and restated credit agreement - sec filing​",
        "date": "10302017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb  on Oct 25  Chubb Ltd  Chubb Bermuda Insurance  among others  entered into amended  restated credit agreement "
    },
    {
        "content": "* Chubb reports third quarter per share net loss and operating loss of $(0.15) and $(0.13)  respectively  including catastrophe losses of $3.27 per share  in line with midpoint of preannounced estimates",
        "date": "10262017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb reports Q3 operating loss $0.13/shr "
    },
    {
        "content": "Oct 26 Insurers and reinsurers around the globe are looking to raise rates after what looks set to be their most costly quarter on record.",
        "date": "10262017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "Global insurers look to raise rates after catastrophic quarter "
    },
    {
        "content": "Oct 20 The following financial services industry appointments were announced on Friday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "10202017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "MOVES-Chubb Ltd  ICG "
    },
    {
        "content": "Oct 4 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "10042017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "MOVES-Chubb  Nomura  Deutsche Bank  Metro Bank  PJT Partners "
    },
    {
        "content": "* Chubb announces distribution agreement with Singapore's DBS bank",
        "date": "09282017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb announces distribution agreement with Singapore's DBS bank "
    },
    {
        "content": "Oct 3 Property and casualty insurer Chubb Ltd on Tuesday appointed Cunqiang Li as chief operating officer of Chubb Life  the company's international life insurance division.",
        "date": "10032017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "MOVES-Chubb names new management for global life  general insurance ops "
    },
    {
        "content": "U.S. property and casualty insurer Chubb Ltd  on Wednesday estimated after-tax losses of up to $1.28 billion from hurricanes Harvey and Irma.",
        "date": "09272017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "Chubb estimates after-tax losses of up to $1.28 billion from Harvey  Irma "
    },
    {
        "content": "Oct 2 Insurer Chubb Ltd said on Monday it made two appointments within its Middle Market Independent Broker business.",
        "date": "10022017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "MOVES-Chubb makes two appointments in Middle Market Independent Broker unit "
    },
    {
        "content": "Sept 27 U.S. property and casualty insurer Chubb Ltd on Wednesday estimated after-tax losses of up to $1.28 billion from hurricanes Harvey and Irma.",
        "date": "09272017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "Chubb estimates after-tax losses of up to $1.28 bln from Harvey  Irma "
    },
    {
        "content": "Property and casualty insurer Chubb Ltd  on Monday estimated that the maximum net insurance and net reinsurance losses related to Hurricane Maria would be about $200 million after tax for the third quarter.",
        "date": "10022017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "Chubb expects Hurricane Maria-related third quarter insurance losses of $200 million "
    },
    {
        "content": "Oct 2 Property and casualty insurer Chubb Ltd on Monday estimated that the maximum net insurance and net reinsurance losses related to Hurricane Maria would be about $200 million after tax for the third quarter.",
        "date": "10022017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "Chubb expects Hurricane Maria-related Q3 insurance losses of $200 mln "
    },
    {
        "content": "* Chubb announces preliminary loss estimates for hurricanes Harvey and Irma",
        "date": "09272017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "BRIEF-Chubb announces preliminary loss estimates for Hurricanes Harvey and Irma "
    },
    {
        "content": "* Chubb estimates maximum net insurance and net reinsurance losses for Hurricane Maria of $220 million pre-tax  or approximately $200 million after tax; net loss estimate for Mexican earthquakes is $25 million pre-tax  or approximately $24 million after tax",
        "date": "10022017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "BRIEF-Chubb provides net insurance and net reinsurance loss estimates for Hurricane Maria & Mexican earthquakes "
    },
    {
        "content": "* Chubb to establish EU headquarters in france if UK leaves EU",
        "date": "09112017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb to establish EU headquarters in France if UK leaves EU "
    },
    {
        "content": "LONDON  Sept 11 U.S. insurer Chubb plans to put its European Union headquarters in Paris if Britain leaves the EU as expected in March 2019  it said on Monday.",
        "date": "09112017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "U.S. insurer Chubb pans EU HQ in Paris after Brexit "
    },
    {
        "content": "NEW YORK The damage from Hurricane Harvey  while likely one of the costliest disasters for property and casualty insurers  probably will not meaningfully dent the industry's capital base  Barron's said on Sunday  naming insurer Chubb as a top pick.",
        "date": "09032017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "Chubb  Allstate able to absorb Harvey losses: Barron's "
    },
    {
        "content": "NEW YORK  Sept 3 The damage from Hurricane Harvey  while likely one of the costliest disasters for property and casualty insurers  probably will not meaningfully dent the industry's capital base  Barron's said on Sunday  naming insurer Chubb as a top pick.",
        "date": "09032017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "Chubb  Allstate able to absorb Harvey losses -Barron's "
    },
    {
        "content": "* REG-GLOBAL INSURANCE GIANT CHUBB SIGNS AGREEMENT WITH GWS PRODUCTION AB",
        "date": "08302017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Reg-Global Insurance signs agreement with GWS Production "
    },
    {
        "content": "* Sets quarterly dividend of $0.71per share Source text for Eikon: Further company coverage:",
        "date": "08102017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb sets quarterly dividend of $0.71per share "
    },
    {
        "content": "* Says Tata Motors strengthens presence in Philippines with launch of its range of commercial vehicles",
        "date": "07262017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-India's Tata Motors launches range of commercial vehicles in Philippines "
    },
    {
        "content": "* Chubb reports second quarter net income per share of $2.77 versus $1.54 prior year and operating income per share of $2.50 versus $2.25 prior year  up 11%; p&c combined ratio is 88.0%",
        "date": "07252017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb Q2 earnings per share $2.77 "
    },
    {
        "content": "* Chubb Ltd executive vice chairman & COO John Keogh reports sale of 20 999 shares of co's common shares on June 16 - SEC filing Source text: (http://bit.ly/2smDbMq) Further company coverage:",
        "date": "06202017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb Ltd executive vice chairman & COO John Keogh sells 20 999 shares of co's common shares on June 16 "
    },
    {
        "content": "* ‍Will offer increased insurance capacity of up to us$150m/ eur 150m (previously us$100m/ eur 100m) for terrorism  political violence and war risks",
        "date": "06122017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb raises terrorism  political violence and war insurance capacity ‍to $150 mln ​ "
    },
    {
        "content": "* Chubb CEO Evan Greenberg elected chair of the US-China business council Source text for Eikon: Further company coverage:",
        "date": "06082017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb CEO Evan Greenberg elected chair of the US-China business council "
    },
    {
        "content": "May 30 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "05302017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "MOVES-Chubb  Deutsche Bank  Goldman Sachs  Wells Fargo "
    },
    {
        "content": "* Chubb ltd says shareholders approved a 3% increase in company's dividend to $2.84 per share annually ($0.71 per quarter) from $2.76 per share Source text for Eikon: Further company coverage:",
        "date": "05182017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb Ltd shareholders approve annual dividend increase "
    },
    {
        "content": "May 17 Chubb Ltd said on Wednesday it appointed Adair Lord Turner as non-executive chairman of two of its key European companies  Chubb European Group Ltd and Chubb Underwriting Agencies Ltd.",
        "date": "05172017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "MOVES-Chubb Ltd names Adair Turner non-exec chairman of key European units "
    },
    {
        "content": "* Chubb names C. Scott Gunter division president  North America Commercial Insurance Source text for Eikon: Further company coverage:",
        "date": "04072017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb names Scott Gunter division president  North America Commercial Insurance "
    },
    {
        "content": "* Chubb Ltd - CEO Evan G. Greenberg's 2016 total compensation was $24.4 million versus $20.4 million in 2015 – SEC Filing",
        "date": "04042017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb says CEO Evan Greenberg's 2016 total compensation was $24.4 mln – SEC Filing "
    },
    {
        "content": "* Chubb appoints Adrian Matthews as chief operating officer  continental Europe",
        "date": "02202017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb appoints Adrian Matthews as COO Continental Europe "
    },
    {
        "content": "* Board will recommend to shareholders at company's 2017 annual general meeting an increase in its quarterly dividend",
        "date": "02232017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb declares quarterly dividend of $0.69 per share "
    },
    {
        "content": "* Chubb ltd- unfavorable foreign currency movement negatively impacted book value by $302 million and tangible book value by $154 million in q4",
        "date": "01312017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb Ltd reports Q4 EPS $3.41 "
    },
    {
        "content": "* Nordson Corporation acquires Ace Production Technologies Inc to add selective soldering capabilities for electronics assembly customers",
        "date": "01062017",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Nordson Corp acquires Ace Production Technologies "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 29 (Fitch) Fitch Ratings has affirmed the 'A+' Issuer Default  Rating (IDR) of Chubb Limited and the 'AA' Insurer Financial Strength (IFS)  rating of its insurance operating subsidiaries. The Rating Outlook for all  ratings is Stable. A complete list of ratings follows at the end of this  release. KEY RATING DRIVERS On Jan. 14  2016 Chubb Limited was created when legacy ACE acquired legacy Chubb  for approximately $29.",
        "date": "11292016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "Fitch Affirms Chubb's 'AA' IFS Ratings; Outlook Stable "
    },
    {
        "content": "* Chubb ltd says  on november 17  2016  board  amended organizational regulations of chubb limited",
        "date": "11212016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb Ltd says board amended organizational regulations of Chubb Limited "
    },
    {
        "content": "* Announced authorization of a share repurchase program of $1 billion through December 31  2017.",
        "date": "11172016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb Ltd board declares quarterly dividend and authorizes share repurchase program "
    },
    {
        "content": "* Ultragenyx announces withdrawal of marketing authorization application for Aceneuramic acid prolonged release (ACE-ER) in the European Union",
        "date": "11112016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Ultragenyx to withdraw marketing authorization application for ACE-ER in European Union "
    },
    {
        "content": "* Third Point Llc - takes 2.6 million sponsored ADS stake in Alibaba Group Holding Ltd - SEC Filing",
        "date": "11102016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Third Point takes stake in Alibaba  cuts in Chubb "
    },
    {
        "content": "* Chubb reports strong third quarter net income per share and record operating income per share  both $2.88  up 77.8% and 5.1%  respectively; P&C combined ratio is 86.0%; annualized roe and operating roe are 11.4% and 12.0%  respectively",
        "date": "10252016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb Q3 oper earnings per share $2.88 "
    },
    {
        "content": "* On August 26   Received Letter From Chubb  Whereby Ace American Insurance  Makes Demand To Post Collateral In Amount Of $19.8 Million",
        "date": "09012016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-ITT Educational says receives letter from Chubb to post collateral of $19.8 mln "
    },
    {
        "content": "* Provision for credit losses drastically reduced   (Adds analyst comment  further details on earnings)",
        "date": "08312016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "UPDATE 2-National Bank of Canada profit boosted by ABA purchase "
    },
    {
        "content": "* Chubb names Michael Kessler Chief Reinsurance Officer  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07282016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb names Michael Kessler Chief Reinsurance Officer "
    },
    {
        "content": "* Chubb Ltd says has expanded number of security services it provides to yacht owners in united states  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "07212016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb Ltd expands number of security services it provides to yacht owners in US "
    },
    {
        "content": "* Chubb reports second quarter net and operating income of $1.54 and $2.25 per share  respectively; annualized roe and operating roe are 6.2 pct and 9.5 pct  respectively  for the quarter and 5.3 pct and 9.8 pct year-to-date",
        "date": "07262016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb reports Q2 operating earnings per share $2.25 "
    },
    {
        "content": "July 12 Property and casualty insurer Chubb Ltd  estimated natural catastrophe losses for the second quarter to be about 54 percent higher than the first quarter  indicating another quarter of high losses due to natural disasters for insurers.",
        "date": "07122016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "Chubb sees higher catastrophe losses due to storms  wildfires "
    },
    {
        "content": "* Chubb announces catastrophe loss estimates for second quarter",
        "date": "07122016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "BRIEF-Chubb estimates Q2 natural catastrophe losses of $390 mln pre-tax "
    },
    {
        "content": "* Brian joins towergate from Chubb where he had been chief risk officer since 2007",
        "date": "07062016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Towergate appoints Brian Hardwick as chief risk officer "
    },
    {
        "content": "* Chubb announces changes to its regional presidents in Asia Pacific and Latin America; New division president named for company's International Accident & Health Business",
        "date": "06302016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb names regional presidents in Asia Pacific and Latin America "
    },
    {
        "content": "* Launched new suite of insurance coverages that responds to professional and management liability exposures faced by u.s. Family offices  Source text for Eikon:  Further company coverage:",
        "date": "05242016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb launches new suite of insurance coverages for U.S. family offices "
    },
    {
        "content": "* Chubb shareholders approve 23rd consecutive annual dividend increase; board declares record date for first dividend installment; all other shareholder proposals approved  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05192016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb hikes annual dividend 3 pct to $2.76/shr "
    },
    {
        "content": "* Third Point LLC  takes share stake of 1.2 million shares in VMware inc",
        "date": "05132016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Third Point LLC takes share stake in VMware  Chubb "
    },
    {
        "content": "* Day stub period is $2.29; p&c combined ratio is 90.0% and annualized operating roe is 10.2%; operating return on tangible equity is 18.5%",
        "date": "05042016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb sees quarterly investment income of $820 million-$840 million for rest of 2016 "
    },
    {
        "content": "* Chubb announces preferred provider distribution agreement with chinese retailing giant suning",
        "date": "04152016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb signs preferred provider distribution agreement with Suning "
    },
    {
        "content": "* Chubb announces retirement of Robert C. Cox  division chairman  north america financial lines",
        "date": "04072016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb announces retirement of Division chairman Robert Cox "
    },
    {
        "content": "* Says Mark James appointed Senior Vice President  Commercial Marine Insurance for Chubb's North America Commercial Insurance Division  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "04082016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb says Mark James appointed Senior Vice President  Commercial Marine Insurance "
    },
    {
        "content": "* CEO Evan G. Greenberg's FY 2015 total compensation was $20.4 million versus $19.7 million in FY 2014 - sec filing  Source text for Eikon: (http://1.usa.gov/1TAbEPd) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04052016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "BRIEF-Chubb CEO's 2015 total compensation was $20.4 mln vs $19.7 mln in 2014 - SEC Filing "
    },
    {
        "content": "March 30 Insurer Chubb Ltd said on Wednesday it has added coverage to help U.S. victims of cyber bullying pay for costs  including mental health treatment  legal expenses and lost wages.",
        "date": "03302016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "Chubb adds cyber bullying coverage to U.S. home insurance policies "
    },
    {
        "content": "* Added cyber bullying coverage to one of its policies to help cover clients from expenses associated with a cyber bullying incident  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "03302016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "BRIEF-Chubb adds cyber bullying coverage to one of its policies "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 04 (Fitch) Fitch Ratings has withdrawn the 'A+' long-term  Issuer Default Rating (IDR) and 'F1' short-term ratings for The Chubb  Corporation as the rated entity and commercial paper program no longer exist  following its merger with and into ACE INA Holdings Inc. (ACE INA) effective   Jan. 15  2016. ACE INA survived as a wholly owned subsidiary of Chubb Limited  (formerly known as ACE Limited). Accordingly  Fitch will",
        "date": "02042016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "Fitch Withdraws The Chubb Corporation Issuer Default Ratings "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 15 (Fitch) Fitch Ratings has affirmed all the ratings for ACE  Limited and its subsidiaries (ACE) and the Insurer Financial Strength (IFS)  ratings for The Chubb Corporation (Chubb) operating subsidiaries. Fitch has  downgraded Chubb's Issuer Default Rating (IDR) to 'A+' from 'AA-' and downgraded  all other holding company obligations one notch. The Rating Outlook for all  ratings is Stable. A complete list of ratings f",
        "date": "01152016",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "Fitch Affirms ACE Ltd & Chubb's IFS Ratings Following Acquisition; Downgrades Chubb Holding Company "
    },
    {
        "content": "NEW YORK  Oct 27 (IFR) - Swiss insurer Ace Group on Tuesday announced a US$5.3bn four-part bond to help finance its US$28.3bn acquisition of Chubb  and is expected to price the trade later in the day.",
        "date": "10272015",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "UPDATE 1-Ace Group announces US$5.3bn bond to fund Chubb buy "
    },
    {
        "content": "NEW YORK  Oct 27 (IFR) - Insurer Ace Group on Tuesday announced a US$5.3bn four-part bond to help finance its acquisition of Chubb  a deal expected to price later in the day.",
        "date": "10272015",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "Ace Group announces US$5.3bn bond to fund Chubb buy "
    },
    {
        "content": "July 1 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "07012015",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Indexes up: Dow 0.55 pct  S&P 0.44 pct  Nasdaq 0.3 pct   (Changes quotes  updates prices)",
        "date": "07012015",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "US STOCKS-Wall St trims gains; energy stocks fall  Greece hopes fade "
    },
    {
        "content": "* Indexes up: Dow 0.53 pct  S&P 0.47 pct  Nasdaq 0.35 pct   (Changes quote  updates prices)",
        "date": "07012015",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "US STOCKS-Wall St trims gains as Greece deal hopes fade "
    },
    {
        "content": "Swiss insurance giant ACE Ltd  will buy upmarket property insurer Chubb Corp  for $28.3 billion to get access to wealthy clients who pay higher premiums at a time when fierce competition has cut deeply into the industry's profit margins. | Video ",
        "date": "07012015",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "ACE buys upmarket Chubb in biggest ever insurance takeover "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 01 (Fitch) Fitch Ratings has affirmed the Insurer Financial  Strength ratings (IFS) of The Chubb Corporation's (NYSE: CB) (Chubb)  property/casualty insurance subsidiaries  which are led by Federal Insurance  Company (Federal) at 'AA' with a Stable Outlook. Fitch has also placed Chubb's  'AA-' Issuer Default Rating (IDR) and 'A+' senior debt rating on Rating Watch  Negative. A full rating list is shown below.  KEY RATING D",
        "date": "07012015",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "Fitch Affirms Chubb's IFS Following Ace Acquisition Announcement; Places Debt Ratings on Watch Neg "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 01 (Fitch) Fitch Ratings has affirmed the 'AA' Insurer Financial  Strength (IFS) ratings of ACE Limited's (NYSE: ACE) insurance subsidiaries with  a Stable Rating Outlook. Fitch has also placed the ACE holding company ratings   including the 'AA-' Issuer Default Rating (IDR) and 'A+' senior debt rating on  Rating Watch Negative. A complete list of ratings follows at the end of this  release. Fitch last affirmed all of ACE'",
        "date": "07012015",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "Fitch Affirms ACE's IFS Following Chubb Acquisition Announcement; Places Debt Ratings on Watch Neg "
    },
    {
        "content": "Thomson Reuters April 28  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04282015",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "Property and casualty insurer Chubb Corp's  quarterly operating profit rose 3.4 percent as premium income increased.",
        "date": "01292015",
        "name": "D/B/A Chubb Limited New",
        "news_type": "topStory",
        "symbol": "CB",
        "title": "Chubb operating profit rises 3.4 percent as premium income increases "
    },
    {
        "content": "Jan 29 Property and casualty insurer Chubb Corp's quarterly operating profit rose 3.4 percent as premium income increased.",
        "date": "01292015",
        "name": "D/B/A Chubb Limited New",
        "news_type": "normal",
        "symbol": "CB",
        "title": "Chubb operating profit rises 3.4 pct as premium income increases "
    }
]