[
    {
        "content": "SAO PAULO  Oct 26 Brazilian retailer GPA SA swung to profit on Thursday as its Assai \"cash-and-carry\" division continued a successful expansion  offsetting losses in the group's traditional formats.",
        "date": "10262017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "UPDATE 2-Brazil's GPA books profit as Assai division offsets weak supermarkets "
    },
    {
        "content": "SAO PAULO  Oct 26 Brazilian retailer GPA SA on Thursday reported third-quarter net income of 72 million reais ($22 million) up from a net loss of 308 million reais a year earlier.",
        "date": "10262017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "Brazil retailer GPA swings to net profit  EBITDA slips "
    },
    {
        "content": "SAO PAULO  Oct 27 Brazilian retailer GPA SA is currently focused on organic growth rather than acquisitions  Chief Executive  Ronaldo Iabrudi said in a conference call on Friday following the release of the company's quarterly results.",
        "date": "10272017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "GPA bets on organic growth  similar strategy for 2018: CEO "
    },
    {
        "content": "SAO PAULO  July 25 Brazilian retailer GPA SA posted a second-quarter profit of 165 million reais ($52 million) on Tuesday  compared with a net loss of 277 million reais a year earlier  according to a securities filing.",
        "date": "07252017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "Brazil retailer GPA swings to profit  eyes better EBITDA margin "
    },
    {
        "content": "SAO PAULO  July 26 Brazilian retailer GPA SA expects a drop in prices for food staples to weigh on revenue in the third quarter  executives told analysts on a Wednesday earnings call.",
        "date": "07262017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "Brazil's GPA sees falling food prices weighing on 3rd-qtr revenue "
    },
    {
        "content": "SAO PAULO  April 28 Shares of GPA SA jumped to a 20-month high on Friday after Brazil's biggest retailer reported stronger profit margins at its struggling supermarkets but executives said the fruits of a nascent economic recovery are still to come.",
        "date": "04282017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "UPDATE 1-GPA surges on profit margins  Brazil rebound still to come "
    },
    {
        "content": "SAO PAULO  April 27 GPA SA  Brazil's biggest retailer  posted net income of 215 million reais ($68 million) in the first quarter  compared to a net loss of 157 million reais a year earlier  according to a securities filing on Thursday.",
        "date": "04272017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "Brazil retailer GPA swings to profit in first quarter "
    },
    {
        "content": "SAO PAULO  April 28 GPA SA  Brazil's biggest retailer  has seen better-than-expected results from turning its Extra hypermarkets into Assai cash-and-carry stores and is accelerating investments in those conversions  its chief executive said on Friday.",
        "date": "04282017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "Brazil's GPA says retail-to-wholesale conversions beating forecasts "
    },
    {
        "content": "SAO PAULO  April 27 GPA SA  Brazil's biggest retailer  on Thursday reported a swing to a profit in the first quarter as easing inflation helped the profitability of food sales and ongoing job cuts kept a lid on costs.",
        "date": "04282017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "UPDATE 1-Brazil retailer GPA swings to profit as inflation eases "
    },
    {
        "content": "PARIS  April 18 Retailer Casino posted slower first-quarter sales growth on Tuesday that reflected weakening sales at its Geant Casino hypermarkets in France  and sluggishness at its recession-hit Brazilian market.",
        "date": "04182017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "Casino Q1 sales growth slowed down by weak French hypermarkets "
    },
    {
        "content": "SAO PAULO  April 13 GPA SA  Brazil's biggest retailer  reported a 9.5 percent rise in first-quarter net revenue from its food division to 10.553 billion reais ($3.37 billion)  according to a securities filing on Thursday.",
        "date": "04132017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "Brazil's GPA books 9.5 pct rise in revenue from food division "
    },
    {
        "content": "SAO PAULO GPA SA  Brazil's largest diversified retailer  plans to invest as much as 1.2 billion reais ($384 million) this year to bolster growth in supermarket  cash-and-carry and real estate.",
        "date": "03272017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "Brazilian retailer GPA plans $384 million capital spending plan this year "
    },
    {
        "content": "SAO PAULO  March 27 GPA SA  Brazil's largest diversified retailer  plans to invest as much as 1.2 billion reais ($384 million) this year to bolster growth in supermarket  cash-and-carry and real estate.",
        "date": "03272017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "Brazilian retailer GPA plans $384 mln capital spending plan this year "
    },
    {
        "content": "SAO PAULO  March 27 GPA SA  Brazil's largest diversified retailer  denied on Monday reports that it had suspended the sale of a controlling stake in its appliance unit Via Varejo SA  according to a securities filing.",
        "date": "03272017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "Brazil's GPA denies reports Via Varejo stake sale suspended "
    },
    {
        "content": "March 7 Casino Chairman and CEO Jean-Charles Naouri and CFO Antoine Giscard d'Estaing tell a news conference:",
        "date": "03072017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "BRIEF-Casino says 2017 profit guidance is cautious "
    },
    {
        "content": "SAO PAULO  Feb 24 GPA SA posted a seventh consecutive quarterly loss on Friday as costs from a broad two-year restructuring continued to hamper results at Brazil's largest diversified retailer.",
        "date": "02242017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "UPDATE 2-Brazil's GPA loses money for 7th straight quarter as restructuring bites "
    },
    {
        "content": "SAO PAULO  Feb 24 Brazil's GPA SA will close fewer than 60 food store units in 2017  a move that will help the country's largest diversified retailer cut expenses related to a two-year internal restructuring  Chief Financial Officer Christophe Hidalgo said in an earnings call on Friday.",
        "date": "02242017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "Brazil's GPA should close fewer than 60 stores in 2017 - management "
    },
    {
        "content": "SAO PAULO  Feb 24 Brazil's largest diversified retailer GPA SA reported a fourth-quarter net loss of 29 million reais ($9 million) on Friday  falling short of forecasts for a first profit in seven quarters.",
        "date": "02242017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "Brazil retailer GPA reports quarterly loss  missing forecasts "
    },
    {
        "content": "PARIS  Jan 17 French retailer Casino  said on Tuesday it would deliver on its French profit forecast for 2016 after fourth-quarter sales reflected an improvement in its home market on a same-store basis  notably at the Geant hypermarkets.",
        "date": "01172017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "Retailer Casino keeps French profit goal after Q4 sales improvement "
    },
    {
        "content": "SAO PAULO  Jan 13 Same-store food sales at GPA SA  Brazil's largest diversified retailer  rose in the fourth quarter despite the country's harshest recession ever  a sign that the company's efforts to bolster cash-and-carry operations are bearing fruit.",
        "date": "01132017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "UPDATE 1-Brazil's GPA 4th-qtr sales rose on cash-and-carry boost "
    },
    {
        "content": "SAO PAULO  Jan 12 Brazilian retailer GPA SA  reported a 7.7 percent rise in fourth-quarter same-store food sales despite the country's prolonged recession.",
        "date": "01132017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "Brazil's GPA reports 7.7 pct rise in Q4 same-store food sales "
    },
    {
        "content": "SAO PAULO Sales in the Assaí cash-and-carry division of Brazilian retailer GPA SA  rose about 50 percent last year as consumers spurned traditional supermarkets in search of lower prices in a harsh recession  a senior executive said in an interview.",
        "date": "01112017",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "GPA cash-and-carry unit sees accelerating 2016 sales: executive "
    },
    {
        "content": "SAO PAULO Brazilian retailer GPA SA  insisted on Monday that a sale of its controlling stake in Via Varejo SA  is its only strategic option  disputing comments by a Via Varejo executive who said other alternatives are available.",
        "date": "11282016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "GPA says sale of Via Varejo stake is only option on table "
    },
    {
        "content": "SAO PAULO  Nov 28 Brazilian retailer GPA SA  insisted on Monday that a sale of its controlling stake in Via Varejo SA is its only strategic option  disputing comments by a Via Varejo executive who said other alternatives are available.",
        "date": "11282016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "UPDATE 1-GPA says sale of Via Varejo stake is only option on table "
    },
    {
        "content": "SAO PAULO  Nov 28 Brazilian retailer Grupo Pão de Açúcar SA sees a sale of its controlling stake in Via Varejo SA as its best strategic option  but would consider alternatives if a deal falls through  Via Varejo's head of investor relations Alexandre Gonçalves said on Monday.",
        "date": "11282016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "Via Varejo says GPA has alternatives if stake sale falls through "
    },
    {
        "content": "SAO PAULO  Nov 23 The board of GPA SA   Brazil's largest retailer  authorized management of the company to initiate the sale of its controlling stake in its Via Varejo unit  the company said on Wednesday.",
        "date": "11232016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "Brazil's GPA initiates sale of controlling stake in Via Varejo "
    },
    {
        "content": "SAO PAULO  Nov 24 Shares in Brazil appliance retailer Via Varejo SA soared on Thursday by the most since March on reports that three suitors have expressed interest in a controlling stake in the company.",
        "date": "11242016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "UPDATE 2-Brazil's Via Varejo soars on reports of Falabella  Steinhoff interests "
    },
    {
        "content": "SAO PAULO  Nov 24 SACI Falabella SA  Steinhoff International Holdings Ltd and Lojas Americanas SA are among a group of retailers interested in acquiring appliance retailer Via Varejo SA  Valor Econômico newspaper said on Thursday.",
        "date": "11242016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "Falabella  Steinhoff in race for Brazil's Via Varejo -newspaper "
    },
    {
        "content": "SAO PAULO  Nov 3 Brazilian retailer GPA SA  is considering strategic alternatives for its stake in appliance retailing unit Via Varejo SA in an effort to concentrate on food retail amid a severe recession  the company said on Thursday.",
        "date": "11032016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "UPDATE 1-Brazil's GPA mulls alternatives for Via Varejo stake "
    },
    {
        "content": "SAO PAULO  Nov 3 GPA SA  Brazil's biggest retailer  said on Thursday the company is considering \"strategic alternatives\" for its stake in appliance retailing unit Via Varejo SA.",
        "date": "11032016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "Brazil's GPA mulls 'strategic alternatives' for Via Varejo stake "
    },
    {
        "content": "SAO PAULO  Oct 26 Brazilian retailer Companhia Brasileira de Distribuição will have to pay a 150 million reais penalty ($47.5 million) in connection with an arbitration claim won by Morzan Empreendimentos e Participações.",
        "date": "10272016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "Brazil's market regulator imposes 150 mln reais penalty on CBD "
    },
    {
        "content": "SAO PAULO  Oct 28 GPA SA  Brazil's largest diversified retailer  said on Friday it is stepping up the opening of more cash-and-carry stores over the next year and enhancing cost-efficiencies in its appliance and e-commerce units in a bid to return to profit after six straight quarters of losses.",
        "date": "10282016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "UPDATE 2-Brazil's GPA sharpens focus on cash-and-carry to offset downturn "
    },
    {
        "content": "SAO PAULO  Oct 28 Companhia Brasileira de Distribuição (GPA)  Brazil's No 1 retailer by sales  missed forecasts with a widened third-quarter net loss  a securities filing showed on Friday.",
        "date": "10282016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "CORRECTED-Brazil's GPA reports $97 mln Q3 net loss "
    },
    {
        "content": "SAO PAULO  Oct 11 GPA SA  Brazil's biggest retailer  reported strong third-quarter sales in its cash-and-carry wholesale division on Tuesday  but a disappointing performance by its restructured e-commerce unit sent shares sliding.",
        "date": "10112016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "UPDATE 1-Brazil's GPA sales rise but e-commerce disappoints; shares slide "
    },
    {
        "content": "SAO PAULO  Oct 11 GPA SA  Brazil's biggest diversified retailer  on Tuesday reported net revenue of 15.094 billion reais in the third quarter  up 4.4 percent from the same period of last year.",
        "date": "10112016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "CORRECTED-Brazil's GPA says 3rd qtr net sales up by 4.4 pct "
    },
    {
        "content": "* Says the company Carlos Casado which is held by Grupo Empresarial San Jose in about 52 percent has reached an agreement with Brasilagro Companhia Brasilera de Propiedades Agricolas (Brasilagro) to sell property of joint venture Cresca worth $120 million",
        "date": "10072016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "BRIEF-San Jose unit Carlos Casado agrees with Brasilagro to sell property of joint venture "
    },
    {
        "content": "* Said on Wednesday its board of directors approved an issue of simple non-convertible debentures in the total amount of 750.0 million Brazilian reais ($233.0 million) which can be increased up to 1.01 billion reais",
        "date": "10062016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "BRIEF-Companhia Brasileira de Distribuicao to issue up to 1.01 bln reais in debt "
    },
    {
        "content": "Sept 22Brasilagro Companhia Brasileira de Propriedades Agricolas :",
        "date": "09222016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "CORRECTED-BRIEF-Brasilagro proposes dividend payment  announces new share buy back programme "
    },
    {
        "content": "SAO PAULO  Aug 8 Cnova N.V. on Monday announced a reorganization plan regarding its operations in Brazil with home appliances retailer Via Varejo  according to a securities filing.",
        "date": "08082016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "UPDATE 1-Casino's Cnova announces reorganization plan with Via Varejo "
    },
    {
        "content": "PARIS  April 28 Cnova  the e-commerce arm of French retailer Casino  said on Thursday that it was reviewing the possibility of merging its business in Brazil with Via Varejo S.A  the consumer electronics business of Brazilian retailer Grupo Pao de Acucar (GPA).",
        "date": "04282016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "Casino's Cnova says reviewing possible Brazil merger with Via Varejo "
    },
    {
        "content": "PARIS  April 14 Retailer Casino posted forecast-beating first-quarter sales on Thursday that reflected an improved performance in its core French market thanks to cost cuts  while a decline in consumer electronics demand in recession-hit Brazil slowed.",
        "date": "04142016",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "normal",
        "symbol": "CBD",
        "title": "Casino Q1 sales beat forecasts  France improves "
    },
    {
        "content": "RIO DE JANEIRO  Jan 13 Grupo Pão de Açucar   Brazil's largest retailer  said on Tuesday that net sales rose 16.2 percent 19.66 billion reais ($7.49 billion) in the fourth quarter compared with a year earlier.",
        "date": "01132015",
        "name": "Companhia Brasileira de Distribuicao",
        "news_type": "topStory",
        "symbol": "CBD",
        "title": "Brazil's Grupo Pao de Acucar 4th quarter net sales rose 16.2 pct "
    }
]