[
    {
        "content": "Nov 16 Comcast Corp and Verizon Communications Inc have both expressed interest in acquiring a significant part of Rupert Murdoch's Twenty-First Century Fox Inc's assets  two people familiar with the situation told Reuters on Thursday.",
        "date": "11172017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 4-Comcast  Verizon approached Twenty-First Century Fox to buy some assets -sources "
    },
    {
        "content": "* CBS Corp sets final exchange ratio of 5.6796 for CBS radio exchange offer Source text for Eikon: Further company coverage:",
        "date": "11142017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-CBS Corp sets final exchange ratio of 5.6796 for CBS radio exchange offer "
    },
    {
        "content": "* CBS CORP - ‍PRICING OF A PRIVATE DEBT OFFERING OF $400 MILLION OF 2.900% SENIOR NOTES DUE 2023 AND $500 MILLION OF 3.700% SENIOR NOTES DUE 2028​ Source text for Eikon: Further company coverage:",
        "date": "11132017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-CBS CORPORATION PRICES $900 MILLION SENIOR NOTES OFFERING "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 13 (Fitch) Fitch Ratings has assigned a 'BBB' rating to CBS Corporation's (CBS) proposed offering of five- (2023) and ten-year (2028) senior unsecured notes. The Rating Outlook is Stable. The proceeds of the offering are expected to be used for general corporate purposes including the discretionary funding of the company's qualified defined benefit plans and repayment of outstanding debt. Fitch currently rates CBS's I",
        "date": "11132017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Fitch Rates CBS's Senior Unsecured Note Offering 'BBB'; Outlook Stable "
    },
    {
        "content": "SYDNEY  Nov 10 CBS Corp's buyout of embattled Australian broadcaster Ten Network Holdings won approval from an Australian court on Friday  leaving only sign-off from the nation's securities regulator before the deal is done.",
        "date": "11102017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS' buyout of Australia's Ten Network nears final hurdle "
    },
    {
        "content": "* Court judgement on s444ga application granted leave to deed administrators to transfer shares in TEN to CBS as provided for in doca​ Source text for Eikon: Further company coverage:",
        "date": "11102017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Korda Mentha updates on transfer of Ten shares to CBS "
    },
    {
        "content": "* Files for potential mixed shelf; size not disclosed - SEC filing Source text: (http://bit.ly/2xYayp8) Further company coverage:",
        "date": "11032017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-CBS files for potential mixed shelf  size not disclosed "
    },
    {
        "content": "CBS Corp   owner of the most-watched U.S. TV network  on Thursday reported revenue that missed Wall Street estimates largely due to lower ad sales  sending shares down to a 13-month low in extended trading.",
        "date": "11022017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS Corp reports lower revenues  sending shares down "
    },
    {
        "content": "Nov 2 CBS Corp  owner of the most-watched U.S. TV network  on Thursday reported revenue that missed Wall Street estimates largely due to lower ad sales  sending shares down to a 13-month low in extended trading.",
        "date": "11022017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-CBS Corp reports lower revenues  sending shares down "
    },
    {
        "content": "Nov 2 CBS Corp  owner of the most-watched U.S. TV network  reported 3 percent rise in third-quarter revenue  driven by higher affiliate and subscription fees.",
        "date": "11022017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS Corp reports 3 pct rise in quarterly revenue "
    },
    {
        "content": "* On 18 Oct Foreign Investment Review Board says Commonwealth has no objection to acquisition of stake in Ten by CBS Corp​ Source text for Eikon: Further company coverage:",
        "date": "10232017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Kordamentha Restructuring updates on Ten's acquisition by CBS Corp​ "
    },
    {
        "content": "* CBS and Gray Television renew affiliations for all of Gray's CBS stations nationwide",
        "date": "10022017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Gray Television and CBS renew affiliations for all of Gray's CBS stations nationwide "
    },
    {
        "content": "Oct 3 Media content companies must get bigger to compete in the quickly changing media landscape  Shari Redstone  whose family controls Viacom Inc and CBS  told attendees of a luncheon on Tuesday at the Paley Center for Media in New York City.",
        "date": "10032017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom  CBS owner Shari Redstone says media companies need scale "
    },
    {
        "content": "SYDNEY Two Australian media moguls have lost a court challenge to CBS Corp's  planned buyout of bankrupt television broadcaster Ten Network Holdings Ltd   giving the U.S. media giant a strong upper hand ahead of a creditor vote on Tuesday.",
        "date": "09182017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Australian moguls lose court challenge to CBS' planned buyout of Ten Network "
    },
    {
        "content": "SYDNEY  Sept 18 An Australian judge dismissed a challenge by a group involving Rupert Murdoch's Twenty-First Century Fox on Monday against an agreed takeover by CBS Corp of struggling television broadcaster Ten Network Holdings Ltd. (Reporting by Tom Westbrook; Editing by Paul Tait)",
        "date": "09172017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Australia judge dismisses 21st Century Fox challenge of CBS television buyout "
    },
    {
        "content": "LOS ANGELES  Sept 22 Former U.S. President Bill Clinton's debut novel will not hit shelves for almost a year  but it is already getting the TV treatment as Showtime said Friday that it would adapt the anticipated book into a series.",
        "date": "09222017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Bill Clinton's upcoming suspense novel to become Showtime series "
    },
    {
        "content": "SYDNEY Creditors of Australia's embattled Ten Network Holdings Ltd  on Tuesday agreed to a A$209.7 million ($167 million) buyout from CBS Corp   effectively ending a battle for control between the U.S. broadcasting giant and Lachlan Murdoch. | Video ",
        "date": "09192017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Creditors back CBS's bid for Australia's Ten Network "
    },
    {
        "content": "* Murdoch  Gordon on back foot despite sweetened offer (Recasts with CBS position ahead of creditor vote)",
        "date": "09182017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 3-Australian moguls lose court challenge to CBS' planned buyout of Ten Network "
    },
    {
        "content": "* Rival bidders set to appeal earlier court loss - Sky News (Recasts with result of creditors meeting)",
        "date": "09192017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Creditors back CBS's bid for Australia's Ten Network "
    },
    {
        "content": "SYDNEY Creditors of Australian broadcaster Ten Network Holdings Ltd  voted in favor of a takeover bid from CBS Corp  on Tuesday  a spokesman for Ten's administrator said.",
        "date": "09192017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Creditors of Australia's Ten Network vote in favor of CBS bid "
    },
    {
        "content": "SYDNEY  Sept 19 Creditors of Australian broadcaster Ten Network Holdings Ltd voted in favour of a takeover bid from CBS Corp on Tuesday  a spokesman for Ten's administrator said.",
        "date": "09192017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Creditors of Australia's Ten Network vote in favour of CBS bid "
    },
    {
        "content": "* Received DOCA proposal from Birketu and Illyria to recapitalise Ten Network",
        "date": "09152017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Kordamentha Restructuring receives revised proposal from Birketu & Illyria to recapitalise Ten "
    },
    {
        "content": "SYDNEY  Sept 14 Australian lawmakers were set to approve legislation on Thursday allowing the consolidation of media companies  clearing the path for a likely rival bid to CBS Corp's proposed buyout of television broadcaster Ten Network Holdings after reaching a late-night deal on media ownership.",
        "date": "09132017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Australian senate set to clear way for rival bid to CBS's Ten TV "
    },
    {
        "content": "SYDNEY  Sept 12 Rupert Murdoch's Twenty-First Century Fox Inc joined a court challenge on Tuesday against rival U.S. cable network CBS Corp's proposed buyout of struggling Australian television broadcaster Ten Network Holdings Ltd.",
        "date": "09122017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Rupert Murdoch's Fox joins court challenge to CBS' Australian TV buyout "
    },
    {
        "content": "SYDNEY Media scion Lachlan Murdoch made a revised offer for Ten Network Holdings Ltd  on Friday  a day after Australia's senate voted to lift a ban on the ownership of multiple types of media assets  allowing him to challenge U.S. suitor CBS Corp .",
        "date": "09152017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Law reform sparks bidding war for Australia's Ten Network "
    },
    {
        "content": "* Sinclair Broadcast Group Inc. and CBS announce affiliation agreement renewals",
        "date": "09112017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Sinclair Broadcast Group Inc and CBS announce affiliation agreement renewals "
    },
    {
        "content": "* CBS previously agreed to buy Ten for at least A$201 mln in cash (Recasts on media law changes  adds academic quote)",
        "date": "09152017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Law reform sparks bidding war for Australia's Ten Network "
    },
    {
        "content": "SYDNEY  Sept 15 Lachlan Murdoch's private company on Friday made a revised takeover offer for Australia's struggling Ten Network Holdings Ltd  which did not give a total value  according to bid documents reviewed by Reuters.",
        "date": "09152017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Lachlan Murdoch makes fresh bid for Australia's Ten Network "
    },
    {
        "content": "SYDNEY CBS Corp  will pay at least A$201.1 million ($162 million) in cash to buy Australian broadcaster Ten Network Holdings   according to documents released on Monday by Ten's administrator.",
        "date": "09112017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS paying at least $162 million cash for Australia's Ten Network "
    },
    {
        "content": "* Ten's market cap before being placed under admin was A$58 mln (Adds detail of CBS deal  background)",
        "date": "09112017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-CBS paying at least $162 mln cash for Australia's Ten Network "
    },
    {
        "content": "SYDNEY  Sept 11 CBS Corp will pay at least A$201.1 million ($162 million) in cash to buy Australian broadcaster Ten Network Holdings  according to documents released on Monday by Ten's administrator.",
        "date": "09112017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS paying at least $162 mln cash for Australia's Ten Network "
    },
    {
        "content": "SYDNEY CBS Corp's  buyout of struggling Australian broadcaster Ten Network Holdings Ltd  will be delayed at least a week  after a court on Thursday said it would pause the deal to hear a challenge by a rival bidder.",
        "date": "09072017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Court challenge delays vote on CBS' Australian TV station buyout "
    },
    {
        "content": "* Australian court says will pause deal to hear matter (Adds judge quote  extra detail of challenger's case)",
        "date": "09072017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Court challenge delays vote on CBS' Australian TV station buyout "
    },
    {
        "content": "SYDNEY  Sept 7 A business partner of News Corp Co-Chairman Lachlan Murdoch filed a motion in an Australian court on Thursday seeking to stop a vote on CBS Corp's planned buyout of a struggling local television station.",
        "date": "09072017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Lachlan Murdoch partner in court to delay vote on CBS TV station buyout "
    },
    {
        "content": "SYDNEY  Aug 28 CBS Corp  owner of the most-watched U.S. TV network  agreed to buy Australian free-to-air broadcaster Ten Network Holdings Ltd  the Australian broadcaster's administrators said on Monday.",
        "date": "08272017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS Corp agrees to buy Australia's Ten Network "
    },
    {
        "content": "SYDNEY CBS Corp   the United States' most-watched television network  on Monday said it plans to buy its biggest customer in Australia  Ten Network Holdings Ltd   and launch its streaming service in the country.",
        "date": "08282017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS agrees to buy embattled Australian customer Ten Network "
    },
    {
        "content": "* CBS to launch streaming service in Australia via Ten assets",
        "date": "08282017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-CBS agrees to buy embattled Australian customer Ten Network "
    },
    {
        "content": "Aug 28 The following are the top stories on the New York Times business pages. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "08282017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "PRESS DIGEST- New York Times business news - Aug 28 "
    },
    {
        "content": "* Administrators  receivers and managers entered into binding transaction documents with wholly owned entities of Cbs Corp",
        "date": "08282017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Kordamentha Restructuring updates on sale of Ten Network to CBS Corp "
    },
    {
        "content": "Aug 17 Alphabet Inc's Google has expanded its YouTube TV streaming service into 14 new U.S. markets to reach half of American households  with an additional 17 markets to launch in the next few weeks  the company said on Thursday.",
        "date": "08172017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "YouTube TV expands to 14 new markets  partners with Sinclair stations "
    },
    {
        "content": "NEW YORK Unikrn  a U.S. sports betting digital platform backed by some of the biggest names in media  entertainment and sports  will launch the sale of $100 million in cryptocurrency next month  the company's co-founder and chief executive officer  Rahul Sood  told Reuters in an interview earlier this week.",
        "date": "08172017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "U.S. e-sports platform to launch $100 million cryptocurrency sale in September "
    },
    {
        "content": "* CBS Corp - ‍on August 9  2017  CBS Corporation sent a notice to its directors and executive officers - SEC filing​",
        "date": "08092017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-CBS Corp - ‍on Aug 9  CBS Corp sent a notice to its directors and executive officers​ "
    },
    {
        "content": "CBS Corp is taking its streaming service abroad and launching an online sports service to appeal to the growing number of viewers who prefer to watch their favorite shows online  executives said on Monday.",
        "date": "08072017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS expands streaming services as earnings beat expectations "
    },
    {
        "content": "Aug 7 CBS Corp is taking its streaming service abroad and launching an online sports service to appeal to the growing number of viewers who prefer to watch their favorite shows online  executives said on Monday.",
        "date": "08072017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-CBS expands streaming services as earnings beat expectations "
    },
    {
        "content": "Aug 7 CBS Corp  owner of the most-watched U.S. TV network  reported a 9.4 percent rise in second-quarter revenue  driven by higher content licensing and subscription fees.",
        "date": "08072017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS reports 9.4 percent rise in quarterly revenue "
    },
    {
        "content": "CBS Corp said on Monday it signed a deal for its shows to feature on AT&T Inc's DirecTV Now online streaming service.",
        "date": "08072017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS signs with AT&T to stream networks on DirecTV Now "
    },
    {
        "content": "Aug 7 CBS Corp said on Monday it signed a deal for its shows to feature on AT&T Inc's DirecTV Now online streaming service.",
        "date": "08072017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-CBS signs with AT&T to stream networks on DirecTV Now "
    },
    {
        "content": "* Says Jo Ann Ross  who has led CBS television network sales efforts since 2002  has been promoted to president and chief advertising revenue officer",
        "date": "08032017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-CBS Corp repositions its advertising sales organization "
    },
    {
        "content": "Aug 7 CBS Corp said on Monday that AT&T Inc's DirecTV Now will livestream some of its channels including CBS  CBS Sports Network and Showtime.",
        "date": "08072017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "AT&T's DirecTV Now to stream some CBS networks "
    },
    {
        "content": "* CBS Corp reaches agreement with AT&T to join \"DirecTV Now\" live tv service",
        "date": "08072017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-CBS Corp reaches agreement with AT&T to join \"DirecTV Now\" live tv service "
    },
    {
        "content": "* Sets quarterly dividend of $0.18 per share Source text for Eikon: Further company coverage:",
        "date": "07272017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-CBS Corp sets quarterly dividend of $0.18 per share "
    },
    {
        "content": "NEW YORK CBS Corp's  CBS News division said on Thursday it has signed a new editorial and newsgathering partnership with BBC News to share video  editorial content and other resources across the globe.",
        "date": "07132017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS News forms partnership with BBC  replacing Sky "
    },
    {
        "content": "NEW YORK  July 13 CBS Corp's CBS News division said on Thursday it has signed a new editorial and newsgathering partnership with BBC News to share video  editorial content and other resources across the globe.",
        "date": "07132017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-CBS News forms partnership with BBC  replacing Sky "
    },
    {
        "content": "* SAID ON SATURDAY BUYS PLAYER CHRIS WILLOCK FOR FIVE YEARS FROM ARSENAL",
        "date": "07032017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Benfica signs 5-year deal with Arsenal's Chris Willock "
    },
    {
        "content": "NEW YORK  June 30 AT&T Inc has expanded the lineup of local channels on its DirecTV Now internet streaming service  it said on Friday  as the No. 2 wireless carrier seeks to win online subscribers who prefer not to pay for a traditional cable package.",
        "date": "06302017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "AT&T expands local television stations on DirecTV Now service "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  June 26 (Fitch) Fitch Ratings has assigned a 'BBB' rating to CBS Corporation's (CBS) proposed offering of five-year and 10-year senior unsecured notes. The Rating Outlook is Stable. The proceeds of the offering are expected to be used for general corporate purposes including the repayment of outstanding debt. Fitch currently rates CBS's Issuer Default Rating (IDR) 'BBB'. Approximately $9 billion of debt was outstanding as of M",
        "date": "06262017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Fitch Rates CBS' Senior Unsecured Note Offering 'BBB'; Outlook Stable "
    },
    {
        "content": "* Entry into an agreement for additional subscription of new shares in Citybuilders Pte Ltd",
        "date": "06162017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Amplefield enters agreement for additional subscription of shares in Citybuilders "
    },
    {
        "content": "* CBS and Sinclair Broadcast Group Inc announce affiliation agreement renewals",
        "date": "06122017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-CBS  Sinclair Broadcast Group announce affiliation agreement renewals "
    },
    {
        "content": "NEW YORK Just over a decade ago  CBS Corp  accelerated its push to own more of the shows it broadcasts  rather than licensing them from studios.",
        "date": "06012017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS move to own shows like 'MacGyver' pays off in overseas sales "
    },
    {
        "content": "NEW YORK  May 31 Just over a decade ago  CBS Corp accelerated its push to own more of the shows it broadcasts  rather than licensing them from studios.",
        "date": "06012017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "RPT-UPDATE 1-CBS move to own shows like 'MacGyver' pays off in overseas sales "
    },
    {
        "content": "NEW YORK  May 31 Just over a decade ago  CBS Corp accelerated its push to own more of the shows it broadcasts  rather than licensing them from studios.",
        "date": "06012017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-CBS move to own shows like 'MacGyver' pays off in overseas sales "
    },
    {
        "content": "NEW YORK  May 31 Just over a decade ago  CBS Corp accelerated its push to own more of the shows it broadcasts  rather than licensing them from studios.",
        "date": "05312017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS move to own shows like 'MacGyver' pays off in overseas sales "
    },
    {
        "content": "Arsenal majority owner Stan Kroenke's KSE (Kroenke Sports & Entertainment) UK Inc said on Monday its shares in the Premier League club were not for sale after media reports that the club's second-largest investor had made an offer to buy out Kroenke.",
        "date": "05222017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Soccer: Arsenal owner Kroenke says his shares in club not for sale "
    },
    {
        "content": "May 22 Arsenal majority owner Stan Kroenke's KSE (Kroenke Sports & Entertainment) UK Inc said on Monday its shares in the Premier League club were not for sale after media reports that the club's second-largest investor had made an offer to buy out Kroenke.",
        "date": "05222017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Soccer-Arsenal owner Kroenke says his shares in club not for sale "
    },
    {
        "content": "NEW YORK CBS Corp  Chief Executive Leslie Moonves said in response to a shareholder question on Friday that he believed shares of Viacom Inc   which the network considered merging with last year  were undervalued.",
        "date": "05192017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS' CEO Moonves says Viacom undervalued "
    },
    {
        "content": "NEW YORK  May 19 CBS Corp Chief Executive Leslie Moonves said in response to a shareholder question on Friday that he believed shares of Viacom Inc   which the network considered merging with last year  were undervalued.",
        "date": "05192017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-CBS' CEO Moonves says Viacom undervalued "
    },
    {
        "content": "* Sets quarterly dividend of $0.18 per share Source text for Eikon: Further company coverage:",
        "date": "05192017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Cbs Corp sets quarterly dividend of $0.18 per share "
    },
    {
        "content": "May 19 CBS Chief Executive Officer Leslie Moonves told shareholders on Friday he believes shares of Viacom   which the network considered merging with last year  are undervalued.",
        "date": "05192017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS CEO Moonves says Viacom is undervalued "
    },
    {
        "content": "* Appaloosa lp takes share stake of 1.0 million of class b shares in cbs corp",
        "date": "05122017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Appaloosa LP takes share stake in CBS  cuts in Allergan "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  May 08 (Fitch) Fitch Ratings has affirmed Coventry Building Society's (CBS) Long- and Short-Term Issuer Default Ratings (IDRs) at 'A'/'F1' and Viability Rating (VR) at 'a'. The Outlook on the Long-Term IDR is Stable. Fitch has assigned a 'A(dcr)' Derivative Counterparty Rating (DCR) to CBS as part of its roll-out of DCRs in western Europe and the US. DCRs are issuer ratings and express Fitch's view of banks' relative vulnerabili",
        "date": "05082017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Fitch Affirms Coventry Building Society at 'A'; Outlook Stable "
    },
    {
        "content": "NEW YORK CBS Corp's  on Thursday posted quarterly revenue and profit which beat analysts' estimates as the most-watched U.S. TV network benefited from higher content licensing and subscription fees.",
        "date": "05042017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS Corp first-quarter revenue  profit beat estimates "
    },
    {
        "content": "NEW YORK  May 4 CBS Corp's on Thursday posted quarterly revenue and profit which beat analysts' estimates as the most-watched U.S. TV network benefited from higher content licensing and subscription fees.",
        "date": "05042017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-CBS Corp 1st-qtr revenue  profit beat estimates "
    },
    {
        "content": "May 1 Hulu said on Monday its soon-to-be-launched live TV streaming service will include content from NBCUniversal's networks.",
        "date": "05012017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Hulu's live-streaming service to include NBCUniversal networks "
    },
    {
        "content": "* Conduent Inc- on April 7 entered into amendment no. 1 to credit agreement  dated as of December 7  2016",
        "date": "04112017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Conduent Inc enters into amendment no. 1 to credit agreement "
    },
    {
        "content": "* CBS Corp - CEO Leslie Moonves's 2016 total compensation $69.6 million versus $56.8 million in 2015 - SEC filing",
        "date": "04072017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-CBS Corp says CEO Leslie Moonves's 2016 total compensation $69.6 mln vs $56.8 mln in 2015 - SEC filing "
    },
    {
        "content": "* Outfront Media - announced partnership with CBS  Turner Broadcasting to display real-time 2017 NCAA men's basketball tournament scores to digital canvases  Source text for Eikon:  Further company coverage:",
        "date": "03202017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Outfront Media says announced partnership with CBS  Turner Broadcasting "
    },
    {
        "content": "CBS Corp   owner of the most widely-viewed U.S. television network  reported a fourth-quarter profit that beat analysts' estimates  helped by higher political advertising and a rise in retransmission revenue.",
        "date": "02152017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS Corp's profit beats despite drop in advertising revenue "
    },
    {
        "content": "Feb 15 CBS Corp  owner of the most widely-viewed U.S. television network  reported a fourth-quarter profit that beat analysts' estimates  helped by higher political advertising and a rise in retransmission revenue.",
        "date": "02152017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 3-CBS Corp's profit beats despite drop in advertising revenue "
    },
    {
        "content": "Feb 15 CBS Corp  owner of the most-watched U.S. television network  reported a 46.5 percent drop in quarterly profit  hurt mainly by a one-time pension settlement charge.",
        "date": "02152017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS Corp's quarterly profit falls 46.5 pct "
    },
    {
        "content": "Feb 13 CBS Corp's airing of the 59th Annual Grammy Awards drew 26.05 million viewers on Sunday night  up 4 percent from last year  according to Nielsen data.",
        "date": "02132017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "RPT-Ratings for 2017 Grammys up slightly from last year "
    },
    {
        "content": "Feb 13 CBS Corp's airing of the 59th Annual Grammy Awards drew a 16.0 overnight rating on Sunday night  down slightly from last year  according to Nielsen data.",
        "date": "02132017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Ratings for 2017 Grammys on par with last year "
    },
    {
        "content": "Feb 9 Viacom Inc will focus on five of its cable television brands and the Paramount movie studio  license less content to video streaming companies and consider selling assets as part of a turnaround plan  it said on Thursday.",
        "date": "02092017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 5-Viacom puts its might behind six brands in turnaround push "
    },
    {
        "content": "CBS Corp  has taken an ownership stake in Kapital Entertainment  the independent production company behind such series as HBO's \"Divorce \" CBS' \"Life in Pieces\" and Netflix Corp's \"Santa Clarita Diet.\"",
        "date": "02102017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS invests in Kapital Entertainment in bid to own more content "
    },
    {
        "content": "Feb 10 CBS Corp has taken an ownership stake in Kapital Entertainment  the independent production company behind such series as HBO's \"Divorce \" CBS' \"Life in Pieces\" and Netflix Corp's \"Santa Clarita Diet.\"",
        "date": "02102017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "REFILE-CBS invests in Kapital Entertainment in bid to own more content "
    },
    {
        "content": "Feb 6 Newly named Viacom Inc Chief Executive Officer Bob Bakish will outline his plans to revive the company's struggling business on Thursday during an earnings call  he told shareholders on Monday.",
        "date": "02062017",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom CEO to present turnaround strategy on Thursday "
    },
    {
        "content": "* If deal is terminated by Cbs or Co under certain circumstances  then Co is obligated to pay CBS onetime fee equal to $30 million",
        "date": "02032017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Entercom communications to pay CBS $30mln in case deal gets terminated "
    },
    {
        "content": "* CBS Corp - Winfrey will make her first appearance on CBS News' sunday night broadcast '60 Minutes' this fall  Source text for Eikon:  Further company coverage:",
        "date": "01312017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Oprah Winfrey becomes a special contributor to 60 Minutes "
    },
    {
        "content": "* Says signs agreement with Arsenal and continues its revised product strategy",
        "date": "01272017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Hugo Games says signs agreement with Arsenal "
    },
    {
        "content": "* SETS QUARTERLY DIVIDEND OF $0.18 PER SHARE  Source text for Eikon:  Further company coverage:",
        "date": "01262017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-CBS CORP SETS QUARTERLY DIVIDEND OF $0.18 PER SHARE "
    },
    {
        "content": "CBS Corp has signed a deal to have its broadcast network and some cable programming on Hulu's live streaming service  which is expected to go live this year  the companies said Wednesday.",
        "date": "01042017",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS signs deal to be on Hulu's live-streaming platform "
    },
    {
        "content": "Sumner Redstone's holding company National Amusements Inc's decision to abandon a merger of its prized media assets  CBS Corp and Viacom Inc  leaves them under pressure to buy or partner with peers in an industry where scale matters.",
        "date": "12132016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Abandoned CBS  Viacom merger leaves scale issue lingering "
    },
    {
        "content": "NEW YORK Media mogul Sumner Redstone and his daughter Shari called off their failed effort to merge CBS Corp  and Viacom Inc  on Monday  sending shares of Viacom - widely viewed as the weaker company - down almost 8 percent. | Video ",
        "date": "12122016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Sumner Redstone and daughter pull CBS  Viacom merger plan "
    },
    {
        "content": "Shari Redstone  vice chair of Viacom Inc and the daughter of controlling shareholder Sumner Redstone  has withdrawn her support for a merger between CBS Corp and Viacom  CNBC reported on Monday.",
        "date": "12122016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Shari Redstone withdraws support for CBS-Viacom merger: CNBC "
    },
    {
        "content": "* Viacom waiting for CBS to make offer; Viacom delivered presentation to CBS last Wednesday - CNBC  citing sources",
        "date": "11292016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Viacom waiting for CBS to make offer - CNBC  citing sources "
    },
    {
        "content": "Nov 28 The top priorities of Viacom Inc's  acting president and chief executive are improving key relations with affiliates as well as the struggling media company's internal culture  Bob Bakish told Reuters at the end of his first week on the job.",
        "date": "11282016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom CEO looks to improve culture  affiliate relations  amid CBS talk "
    },
    {
        "content": "* Sets quarterly dividend of $0.18 per share  Source text for Eikon:  Further company coverage:",
        "date": "11222016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-CBS corporation announces quarterly dividend "
    },
    {
        "content": "Nov 21 AT&T has signed a deal with Fox Networks Group to continue showing its networks across its offerings including its online video service  DirectTV Now  the two companies announced on Monday.",
        "date": "11212016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "AT&T signs on Fox for DirectTV Now "
    },
    {
        "content": "NEW YORK  Nov 10 Shari Redstone  a controlling shareholder of Viacom Inc and CBS Corp  never wanted to separate the two media companies 10 years ago  she told attendees of The New York Times DealBook conference on Thursday.",
        "date": "11102016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Shari Redstone says she did not support a Viacom/CBS split "
    },
    {
        "content": "CBS Corp   owner of the most-watched U.S. television network  reported results that exceeded Wall Street expectations and said it was still in the early stages of exploring a merger with Viacom Inc   a deal favored by its controlling shareholders.",
        "date": "11032016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS results top Street  Viacom merger exploration at early stage "
    },
    {
        "content": "Nov 3 CBS Corp  owner of the most-watched U.S. television network  reported results that exceeded Wall Street expectations and said it was still in the early stages of exploring a merger with Viacom Inc  a deal favored by its controlling shareholders.",
        "date": "11032016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 3-CBS results top Street  Viacom merger exploration at early stage "
    },
    {
        "content": "* Viacom Inc - new CEO Bakish's salary will be $2.75 million per year - SEC filing",
        "date": "11012016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Viacom's new CEO Bakish's salary will be $2.75 mln per year - SEC filing "
    },
    {
        "content": "Oct 31 Media company Viacom Inc said on Monday it named Bob Bakish  a 19-year company veteran  as acting chief executive  replacing Tom Dooley.",
        "date": "10312016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "UPDATE 2-Viacom names Bob Bakish acting CEO "
    },
    {
        "content": "Nov 3 CBS Corp  owner of the most-watched U.S. TV network  reported a 4.3 percent rise in quarterly revenue  helped by increase in fees from CBS-affiliated stations as well as growth from digital distribution platforms.",
        "date": "11032016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS Corp revenue rises 4.3 percent "
    },
    {
        "content": "* Says Robert Bakish appointed acting CEO and acting president",
        "date": "10312016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom says Robert Bakish appointed acting CEO  acting president "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.20 per share  Source text for Eikon:  Further company coverage:",
        "date": "10312016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom sets qtrly cash dividend of $0.20/shr "
    },
    {
        "content": "Viacom Inc   the owner of Comedy Central  Nickelodeon and MTV  is in talks to acquire Argentine broadcaster Television Federal SA from phone carrier Telefonica SA  for up to $385 million  according to people familiar with the deal.",
        "date": "11032016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom in talks to buy Telefonica's Telefe for around $385 million: sources "
    },
    {
        "content": "* Viacom Inc - Robert Bakish appointed acting president and CEO  having led Viacom's international growth since 2007",
        "date": "10312016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom says Robert Bakish named acting CEO  president "
    },
    {
        "content": "Nov 3 Viacom Inc  the owner of Comedy Central  Nickelodeon and MTV  is in talks to acquire Argentine broadcaster Television Federal SA from phone carrier Telefonica SA for up to $385 million  according to people familiar with the deal.",
        "date": "11032016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom in talks to buy Telefonica's Telefe for around $385 million -sources "
    },
    {
        "content": "Viacom Inc  said on Monday it named Bob Bakish  a 19-year company veteran  as acting chief executive  replacing Tom Dooley.",
        "date": "10312016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom names Bob Bakish acting CEO "
    },
    {
        "content": "Oct 25 Media mogul Sumner Redstone on Tuesday sued two ex-girlfriends for civil claims including elder abuse  alleging he was forced to borrow $100 million from the private company that holds his voting shares of CBS Corp and Viacom Inc to cover tax obligations on gifts he gave to the women.",
        "date": "10262016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "UPDATE 3-Redstone sues ex-girlfriends  says had to borrow from National Amusements "
    },
    {
        "content": "NEW YORK  Oct 25 AT&T Inc's upcoming DirecTV Now online video service will cost $35 per month  including mobile streaming costs  and target viewers who shun pay-television subscriptions  Chief Executive Randall Stephenson said on Tuesday.",
        "date": "10252016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-AT&T's DirecTV Now online video service to cost $35 per month "
    },
    {
        "content": "Oct 31 Viacom Inc said on Monday it named Robert Bakish acting chief executive officer effective Nov. 15  replacing Tom Dooley.",
        "date": "10312016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom names Robert Bakish acting CEO "
    },
    {
        "content": "Oct 25 Media mogul Sumner Redstone on Tuesday sued two ex-girlfriends for civil claims including elder abuse  alleging he was forced to borrow $100 million from the private company that holds his shares in CBS Corp and Viacom  to cover tax obligations on gifts he gave to the women.",
        "date": "10252016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Sumner Redstone forced to borrow $100 mln from National Amusements -lawsuit "
    },
    {
        "content": "Oct 19 Alphabet Inc's Google has reached an agreement with CBS Corp to carry the network on its planned web TV service and is in advanced talks with 21st Century Fox  Walt Disney Co and Viacom Inc  to distribute their channels  people with knowledge of the talks told Reuters on Wednesday.",
        "date": "10202016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "UPDATE 3-Google signs CBS  in talks with others on web TV -sources "
    },
    {
        "content": "* CBS Corp says on october 17  CBS radio inc entered into a five-year $250 million senior secured revolving credit facility due 2021",
        "date": "10182016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-CBS Corp says CBS Radio entered into a $250 mln senior secured revolving credit facility "
    },
    {
        "content": "Oct 19 Alphabet Inc unit Google has reached an agreement with CBS Corp to carry the network on its web TV service  according to a source familiar with the matter.",
        "date": "10192016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Google signs up CBS for Internet TV service - source "
    },
    {
        "content": "* Google signed deal with CBS; skinny bundle expected to launch in first quarter and will include all of CBS's content  including live NFL games - source   Further company coverage: [GOOGL.O CBS.N]",
        "date": "10192016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Google signs up CBS for Internet TV service - source "
    },
    {
        "content": "* Google signs up CBS for planned web TV service; Google in advanced talks with Fox & Disney for the service - CNBC  citing Dow Jones",
        "date": "10192016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Google signs up CBS for planned web TV service- CNBC  citing DJ "
    },
    {
        "content": "Oct 11 CBS Corp Chief Executive Leslie Moonves should get five years without interference from Sumner Redstone's family if the media company is merged with Viacom Inc   investor Mario Gabelli told CNBC on Tuesday.",
        "date": "10112016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Moonves needs 5 years free reign if CBS merged with Viacom -Gabelli "
    },
    {
        "content": "CBS Corp Chief Executive Leslie Moonves should get five years without interference from Sumner Redstone's family if the media company is merged with Viacom Inc  investor Mario Gabelli told CNBC on Tuesday.",
        "date": "10122016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Moonves needs five years free rein if CBS merged with Viacom -Gabelli "
    },
    {
        "content": "* CBS and Viacom have not yet engaged  but are preparing for merger talks; CBS CEO Leslie Moonves seeks governance rights -CNBC  citing sources  Source text: http://bit.ly/2d4RmzQ",
        "date": "10112016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-CBS and Viacom have not yet engaged  but are preparing for merger talks; CBS CEO Leslie Moonves seeks governance rights-CNBC "
    },
    {
        "content": "* Beginning qtrly report on form 10-Q for period ended Sept 30  Local Broadcasting segment will be separated into two operating segments",
        "date": "10142016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-CBS to split reporting of Local Broadcasting segment to two segments "
    },
    {
        "content": "CBS Corp  Chief Executive Leslie Moonves is planning to seek autonomy from the Redstone family  the broadcaster's controlling shareholder  in leading the company if it merges with Viacom Inc   two people familiar with the matter said.",
        "date": "10102016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS CEO Moonves to seek autonomy following any deal with Viacom: sources "
    },
    {
        "content": "Oct 14 Viacom Inc said it had hired financial advisers as part of its review of a proposal by National Amusements Inc to explore a merger with CBS Corp .",
        "date": "10142016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom hires financial advisers to explore CBS merger "
    },
    {
        "content": "Oct 10  CBS Corp Chief Executive Leslie Moonves is planning to seek autonomy from the Redstone family  the broadcaster's controlling shareholder  in leading the company if it merges with Viacom Inc  two people familiar with the matter said.",
        "date": "10102016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS CEO Moonves to seek autonomy following any deal with Viacom -sources "
    },
    {
        "content": "* CBS Corporation announces pricing of debt financing by CBS Radio Inc",
        "date": "10072016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-CBS Corp announces pricing of debt financing by CBS Radio Inc "
    },
    {
        "content": "Oct 14 Viacom Inc said on Friday that it had hired financial advisers to explore a merger with CBS Corp following a proposal by Sumner Redstone's National Amusements Inc  a majority shareholder of both companies.",
        "date": "10142016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Viacom hires financial advisers to explore CBS merger "
    },
    {
        "content": "* Viacom has retained financial advisors in connection with special committee's evaluation of request by national",
        "date": "10142016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom special committee retains financial advisors "
    },
    {
        "content": "Viacom Inc  said it had formed a special committee to consider National Amusements Inc's proposal to combine the company with CBS Corp .",
        "date": "09302016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom forms committee to consider Redstone's CBS merger push "
    },
    {
        "content": "Sumner Redstone's National Amusements  the majority shareholder of CBS Corp  and Viacom Inc   on Thursday proposed a merger of the two and said it would not support the acquisition of either media company by a third party or surrender its control of either firm. | Video ",
        "date": "09292016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Sumner Redstone urges Viacom-CBS deal  rules out others "
    },
    {
        "content": "Sept 30 Viacom Inc said it had formed a special committee to consider National Amusements Inc's proposal to combine the company with CBS Corp.",
        "date": "09302016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Viacom forms committee to consider Redstone's CBS merger push "
    },
    {
        "content": "Sept 29 Sumner Redstone's National Amusements  the majority shareholder of CBS Corp and Viacom Inc   on Thursday proposed a merger of the two and said it would not support the acquisition of either media company by a third party or surrender its control of either firm.",
        "date": "09292016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 3-Sumner Redstone urges Viacom-CBS deal  rules out others "
    },
    {
        "content": "LOS ANGELES/NEW YORK Eleven years ago  media mogul Sumner Redstone declared \"the age of the conglomerate is over\" as he prepared to split old-school broadcaster CBS from the fast-growing Viacom Inc  cable networks and the Paramount film studio.",
        "date": "09292016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS  Viacom reunion could lift both after media upheaval "
    },
    {
        "content": "Sept 30 Viacom Inc said it had formed a special committee to consider National Amusements Inc's proposal to combine the company and CBS Corp.",
        "date": "09302016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom sets up committee to consider National Amusements proposal "
    },
    {
        "content": "* Viacom Inc files for two-part U.S. dollar offering of senior notes - SEC filing   Source text (http://bit.ly/2dgTsKw) Further company coverage:",
        "date": "09292016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom files for two-part U.S. dollar offering of senior notes - SEC filing "
    },
    {
        "content": "* Viacom announces receipt of letter from national amusements",
        "date": "09292016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom announces receipt of letter from national amusements "
    },
    {
        "content": "Sumner Redstone's National Amusements Inc is preparing to call on CBS Corp  and Viacom Inc  to explore a merger  two people familiar with the matter said on Wednesday.",
        "date": "09282016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Redstone's National Amusements to call on CBS  Viacom to explore merger: sources "
    },
    {
        "content": "* Special committee is comprised of independent directors thomas may and Nicole Seligman  who will act as co-chairs",
        "date": "09302016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom board forms special committee to evaluate national amusements request "
    },
    {
        "content": "* National Amusements  Inc. proposes combination of CBS and Viacom",
        "date": "09292016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-National Amusements Inc proposes combination of CBS and Viacom "
    },
    {
        "content": "Sept 29 Sumner Redstone's National Amusements Inc on Thursday urged the boards of Viacom Inc and CBS Corp to explore a combination.",
        "date": "09292016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Sumner Redstone's National Amusements calls on CBS  Viacom to merge "
    },
    {
        "content": "* CBS corporation announces proposed $1.46 billion debt financing by CBS Radio Inc. in connection with the separation of the CBS radio business",
        "date": "09282016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-CBS corporation announces proposed $1.46 billion debt financing by CBS Radio Inc in connection with the separation of the CBS radio business "
    },
    {
        "content": "* Intends to use net proceeds from offering primarily for repayment of outstanding indebtedness",
        "date": "09302016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom announces $1.3 bln debt offering "
    },
    {
        "content": "* Moody's says Viacom's 50% dividend cut is credit negative for NAI but does not impact ratings  Source text for Eikon:  Further company coverage:",
        "date": "09222016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Moody's says Viacom's dividend cut credit negative for NAI  does not impact ratings "
    },
    {
        "content": "Sept 25 Shares of CBS Corp could jump 30 percent in the next year  double in the next three or do even better if the network successfully attempts to buy Viacom Inc  at an attractive price  a report in Barron's said.",
        "date": "09252016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS shares could get boost from Viacom deal - Barron's "
    },
    {
        "content": "Viacom Inc 's board plans to look both internally and externally for a new chief executive to replace interim CEO Tom Dooley  a source familiar with the situation told Reuters on Wednesday.",
        "date": "09212016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom to look internally and externally for new CEO: source "
    },
    {
        "content": "* Ends process seeking investor for Paramount Pictures   (Recasts to say company looking internally and externally  mentions possible candidates)",
        "date": "09212016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 3-Viacom to look internally and externally for new CEO -source "
    },
    {
        "content": "Sept 21 Viacom Inc said on Wednesday that its interim chief executive  Tom Dooley  had decided to leave the company.",
        "date": "09212016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom says interim CEO Dooley to leave; cuts dividend "
    },
    {
        "content": "* Viacom board acts to position the company for future growth",
        "date": "09212016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom board acts to position the company for future growth "
    },
    {
        "content": "A jury should decide whether dust blown off of mechanical parts made by the former Westinghouse Electric Corp during repairs several decades ago contained asbestos or not  a federal appeals court held on Tuesday.",
        "date": "09142016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "3rd Circuit revives asbestos dust claim against CBS "
    },
    {
        "content": "CBS Corp  is not in \"active discussions \" about recombining with Viacom Inc   CBS Chief Executive Leslie Moonves said on Thursday.",
        "date": "09152016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS CEO Moonves says 'no active discussions' with Viacom "
    },
    {
        "content": "Sept 15 CBS Corp is not in \"active discussions \" about recombining with Viacom Inc  CBS Chief Executive Leslie Moonves said on Thursday.",
        "date": "09152016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-CBS CEO Moonves says 'no active discussions' with Viacom "
    },
    {
        "content": "Sept 15 CBS Corp is not in \"active discussions \" about recombining with Viacom Inc  CBS Chief Executive Leslie Moonves said on Thursday.",
        "date": "09152016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS CEO Moonves says \"no active discussions\" with Viacom "
    },
    {
        "content": "NEW YORK Viacom Inc  has hired Morgan Stanley  and LionTree Llc to review its capital structure  a source familiar with the situation said on Wednesday  as the media company seeks ways to shore up its finances in the face of falling advertising sales.",
        "date": "09072016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom hires Morgan Stanley  LionTree for capital review: source "
    },
    {
        "content": "NEW YORK  Sept 7 Viacom Inc has hired Morgan Stanley and LionTree Llc to review its capital structure  a source familiar with the situation said on Wednesday  as the media company seeks ways to shore up its finances in the face of falling advertising sales.",
        "date": "09072016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Viacom hires Morgan Stanley  LionTree for capital review -source "
    },
    {
        "content": "* \"CBS All Access\" rolls out commercial-free option for subscribers",
        "date": "08312016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-\"CBS All Access\" rolls out commercial-free option for subscribers "
    },
    {
        "content": "* Director Dauman sold 749 281 of co's class B common stock at prices between $41.4324per share to $41.4282per share between aug 26 and aug 29- SEC filing",
        "date": "08302016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Viacom Director Dauman sold 749 281 of co's class B common stock - SEC filing "
    },
    {
        "content": "Viacom Inc affirmed its support for Brad Grey as head of its Paramount Pictures movie studio in a statement Friday.",
        "date": "08262016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom affirms support for Paramount studio head Grey "
    },
    {
        "content": "CANTON  Mass.  Aug 26 The granddaughter of Viacom Inc's controlling shareholder Sumner Redstone has agreed to let a Massachusetts court dismiss claims brought by former company leaders  a step that will help end a battle over the fate of the media empire.",
        "date": "08262016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Redstone granddaughter agrees to case dismissal  helps broader deal "
    },
    {
        "content": "BOSTON  Aug 26 The granddaughter of Viacom Inc's  controlling shareholder Sumner Redstone has agreed to let a Massachusetts court dismiss claims brought by former company leaders  a step that will help end a battle over the fate of the media empire.",
        "date": "08262016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Redstone granddaughter agrees to Viacom case dismissal "
    },
    {
        "content": "Aug 26 Viacom Inc affirmed its support for Brad Grey as head of its Paramount Pictures movie studio in a statement Friday.",
        "date": "08262016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Viacom affirms support for Paramount studio head Grey "
    },
    {
        "content": "Aug 26    Viacom Inc affirmed its support for Brad Grey as head of its Paramount Pictures movie studio in a statement Friday.",
        "date": "08262016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom affirms support for Paramount head -statement "
    },
    {
        "content": "NEW YORK  Aug 20 Viacom Inc said on Saturday that Chief Executive Philippe Dauman will leave the company next month  marking a victory for the family of controlling shareholder Sumner Redstone in the battle for the $40 billion media empire.",
        "date": "08202016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom says CEO Dauman to leave in September "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 22 (Fitch) According to Fitch Ratings  Viacom  Inc.'s (Viacom)  announced leadership transition  creation of an expanded board of directors and  the settlement of the litigation related to corporate governance issues is a  credit positive but will not have an impact on Viacom's 'BBB' Issuer Default  Rating.  The Rating Outlook remains Negative.   Viacom's approximately $12.8 billion of debt (face value - including commer",
        "date": "08222016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Fitch: Viacom Leadership Transition is Neutral to Ratings "
    },
    {
        "content": "BEIJING China's richest man  Wang Jianlin  said on Tuesday that Dalian Wanda Commercial Properties Co   the real estate flagship of his Wanda empire  would re-list on the Shanghai Stock Exchange either through an initial public offering (IPO) or a backdoor listing.",
        "date": "08232016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Exclusive: Wanda Commercial to re-list via Shanghai IPO or backdoor listing - chairman "
    },
    {
        "content": "NEW YORK Viacom Inc  said on Saturday that Chief Executive Philippe Dauman will resign immediately  marking a victory for the family of controlling shareholder Sumner Redstone in the battle for the $40 billion media empire.",
        "date": "08212016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom says CEO Dauman to resign post immediately; Dooley steps in "
    },
    {
        "content": "NEW YORK  Aug 20 Viacom Inc said on Saturday that Chief Executive Philippe Dauman will resign immediately  marking a victory for the family of controlling shareholder Sumner Redstone in the battle for the $40 billion media empire.",
        "date": "08212016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Viacom says CEO Dauman to resign post immediately; Dooley steps in "
    },
    {
        "content": "NEW YORK  Aug 19 As Viacom Inc prepares to announce the impending departure of CEO Philippe Dauman  his interim replacement  Thomas Dooley  is planning to reach out to investors  setting a new tone for a company that has kept communications minimal.",
        "date": "08192016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Incoming Viacom CEO plans investor campaign as shakeup looms "
    },
    {
        "content": "Settlement talks between Viacom Inc  Chief Executive Philippe Dauman and controlling shareholder Sumner Redstone have resumed after weeks of stops and starts  a source familiar with the situation told Reuters on Tuesday.",
        "date": "08172016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom settlement talks resume: source "
    },
    {
        "content": "NEW YORK  Aug 19 As Viacom Inc prepares for the impending departure of CEO Philippe Dauman  his interim replacement  Thomas Dooley  is planning to reach out to investors  setting a new tone for a company that has kept communications minimal.",
        "date": "08192016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Incoming Viacom CEO plans investor campaign as shakeup looms "
    },
    {
        "content": "Aug 16 Settlement talks between Viacom Inc  Chief Executive Philippe Dauman and controlling shareholder Sumner Redstone have resumed after weeks of stops and starts  a source familiar with the situation told Reuters on Tuesday.",
        "date": "08172016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom settlement talks resume -source "
    },
    {
        "content": "NEW YORK - Viacom Inc  and controlling shareholder Sumner Redstone have come to an agreement on terms of a settlement that would result in the departure of Chief Executive Philippe Dauman  two sources familiar with the situation told Reuters on Thursday. | Video ",
        "date": "08192016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom and controlling shareholder Sumner Redstone agree on settlement: sources "
    },
    {
        "content": "Aug 19 The following are the top stories on the New York Times business pages. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "08192016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "PRESS DIGEST- New York Times business news - Aug 19 "
    },
    {
        "content": "CANTON  Mass.  Aug 12 An attorney for Sumner Redstone said the media mogul would be willing to be interviewed briefly under oath in a lawsuit over his mental competency that could influence the future of his majority ownership of Viacom and CBS.",
        "date": "08122016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "UPDATE 1-Sumner Redstone willing to be deposed in competency lawsuit "
    },
    {
        "content": "NEW YORK - Viacom Inc and controlling shareholder Sumner Redstone have come to an agreement on terms of a settlement that would result in the departure of Chief Executive Philippe Dauman  two sources familiar with the situation told Reuters on Thursday.",
        "date": "08192016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom and controlling shareholder Sumner Redstone agree on settlement -sources "
    },
    {
        "content": "NEW YORK  Aug 18 - Viacom Inc and controlling shareholder Sumner Redstone have come to an agreement on terms of a settlement that would result in the departure of Chief Executive Philippe Dauman  two sources familiar with the situation told Reuters on Thursday.",
        "date": "08192016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 3-Viacom and controlling shareholder Sumner Redstone agree on settlement -sources "
    },
    {
        "content": "Viacom Inc  Chief Executive Philippe Dauman said on Thursday his victories in a legal battle with Sumner Redstone for control of the media company would help him push through a plan to sell a minority stake in Paramount Pictures. | Video ",
        "date": "08042016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom's legal wins will help Paramount sale process : CEO Dauman "
    },
    {
        "content": "Aug 4 Viacom Inc Chief Executive Philippe Dauman said on Thursday his victories in a legal battle with Sumner Redstone for control of the media company would help him push through a plan to sell a minority stake in Paramount Pictures.",
        "date": "08042016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 4-Viacom's legal wins will help Paramount sale process -CEO Dauman "
    },
    {
        "content": "Viacom Inc Chief Executive Philippe Dauman said on Thursday his recent victories in a legal battle with Sumner Redstone for control of the media company would help him push through a plan to sell a minority stake in Paramount Pictures.",
        "date": "08042016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom's Dauman says legal wins will help Paramount sale process "
    },
    {
        "content": "* Q3 filmed entertainment revenues $621 million versus $479 million",
        "date": "08042016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom reports quarterly earnings per share $1.09 "
    },
    {
        "content": "Aug 4 Viacom Inc  the owner of MTV  Comedy Central and Nickelodeon  reported a 1.6 percent rise in quarterly revenue  helped by higher license fees and theatrical revenue at its movie business.",
        "date": "08042016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom revenue rises as movie business drives gains "
    },
    {
        "content": "Top Viacom Inc  executives recently held discussions with National Amusements Inc to settle litigation surrounding the media empire of Sumner Redstone  the Wall Street Journal reported on Tuesday.",
        "date": "08022016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom and Redstone's National Amusements held settlement talks: WSJ "
    },
    {
        "content": "July 29 A Delaware judge on Friday ruled that Sumner Redstone's lawyers must defend in a trial his move to oust five directors from Viacom Inc's board.",
        "date": "07292016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Delaware judge proposes October trial over removal of Viacom directors "
    },
    {
        "content": "Aug 2 Top Viacom Inc executives recently held discussions with National Amusements Inc to settle litigation related to control of Sumner Redstone's media empire  the Wall Street Journal reported on Tuesday.",
        "date": "08022016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Viacom and Redstone's National Amusements held settlement talks -WSJ "
    },
    {
        "content": "July 29 A Delaware judge on Friday ruled that Sumner Redstone's lawyers must defend in a trial his move to oust five directors from Viacom Inc's board and suggested that he wants to get a better picture of the 93-year-old media mogul's mental capacity.",
        "date": "07292016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Delaware judge proposes October trial over removal of Viacom directors "
    },
    {
        "content": "July 28 CBS Corp  the owner of the most-watched U.S. TV network  reported a 2.1 percent rise in quarterly revenue  helped by higher political ad sales amid a high-pitched race for the White House.",
        "date": "07282016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS Corp's quarterly revenue rises 2.1 pct "
    },
    {
        "content": "A Massachusetts judge on Thursday rejected Sumner Redstone's bid to quickly end a case that will likely determine the future of the media mogul's holdings and set an October trial date  marking a victory for Viacom Inc  Chief Executive Philippe Dauman.",
        "date": "07282016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Judge rejects Sumner Redstone bid to end Viacom CEO lawsuit "
    },
    {
        "content": "July 28 A Massachusetts judge on Thursday rejected Sumner Redstone's bid to quickly end a case that will likely determine the future of the media mogul's holdings and set an October trial date  marking a victory for Viacom Inc  Chief Executive Philippe Dauman.",
        "date": "07282016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 3-Judge rejects Sumner Redstone bid to end Viacom CEO lawsuit "
    },
    {
        "content": "Viacom Inc Chief Executive Philippe Dauman and Chief Operating Officer Thomas Dooley have reserved their legal right to resign \"with good reason\" in a move to protect tens of millions of dollars in potential severance pay.",
        "date": "07182016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom's top two execs reserve right to resign  look to protect millions in pay "
    },
    {
        "content": "* Announces it has extended its agreement with CBS Sports Network for 2016 and 2017 seasons  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07142016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-TerraCross Championship extends agreement with CBS Sports Network for 2016  2017 "
    },
    {
        "content": "Chinese real estate and entertainment conglomerate Dalian Wanda Group has held talks with Viacom Inc about acquiring a minority stake in its Paramount Pictures unit  according to two people familiar with the situation.",
        "date": "07132016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Exclusive: China's Wanda shows interest in Viacom's Paramount - sources "
    },
    {
        "content": "Sumner Redstone's privately held movie theater company said on Friday it opposes the sale of a minority stake in Viacom Inc's Paramount Pictures  because such a transaction could hurt the chances of a deal involving all of Viacom.",
        "date": "07152016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Paramount stake sale could hamper deal for Viacom: National Amusements "
    },
    {
        "content": "Viacom Inc  Chief Executive Philippe Dauman and Chief Operating Officer Thomas Dooley have reserved their legal right to resign \"with good reason\" in a move to protect tens of millions of dollars in potential severance pay.",
        "date": "07182016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom's top two executives reserve right to resign  look to protect millions in pay "
    },
    {
        "content": "July 15 Sumner Redstone's privately held movie theater company said on Friday it opposes the sale of a minority stake in Viacom Inc's Paramount Pictures  because such a transaction could hurt the chances of a deal involving all of Viacom.",
        "date": "07152016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Paramount stake sale could hamper deal for Viacom -National Amusements "
    },
    {
        "content": "July 18 Viacom Inc Chief Executive Philippe Dauman and Chief Operating Officer Thomas Dooley have reserved their legal right to resign \"with good reason\" in a move to protect tens of millions of dollars in potential severance pay.",
        "date": "07182016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Viacom's top two execs reserve right to resign  look to protect millions in pay "
    },
    {
        "content": "* CEO's counsel says Dauman's effective date of resignation for \"good reason\" is August 15  unless reinstated as executive chairman- CNBC",
        "date": "07182016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom CEO's counsel says Dauman's effective date of resignation for \"good reason\" is August 15  unless reinstated as executive chairman- CNBC "
    },
    {
        "content": "* CEO Dauman says he has \"good reason\" to resign due to being \"improperly\" removed as executive chairman by Redstone's National Amusements-CNBC",
        "date": "07182016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom CEO Dauman says he has \"good reason\" to resign due to being \"improperly\" removed as executive chairman by Redstone's National Amusements-CNBC "
    },
    {
        "content": "NAI SAYS SALE OF STAKE IN PARAMOUNT 'WOULD CHILL THE INTEREST OF PARTIES THAT MAY BE INTERESTED IN A LARGER TRANSACTION INVOLVING ALL OF VIACOM'",
        "date": "07152016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "NAI SAYS SALE OF STAKE IN PARAMOUNT 'WOULD CHILL THE INTEREST OF PARTIES THAT MAY BE INTERESTED IN A LARGER TRANSACTION INVOLVING ALL OF VIACOM' "
    },
    {
        "content": "LOS ANGELES  July 11 An ex-girlfriend of media mogul Sumner Redstone will not be granted a new trial over her lawsuit that challenged the 93-year-old's mental competence  a California judge said in a tentative ruling on Monday.",
        "date": "07112016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "UPDATE 2-Judge rejects new trial for Sumner Redstone's ex-girlfriend "
    },
    {
        "content": "Mario Gabelli  Viacom Inc's  second-largest holder of voting shares behind majority owner Sumner Redstone  believes that Chief Executive Philippe Dauman can do nothing to save his job because he cannot win his battle with the Redstone family over control of the media company.",
        "date": "07072016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Exclusive: Top Viacom investor Gabelli says CEO's exit is inevitable "
    },
    {
        "content": "* CBS Corporation announces $700 million senior notes offering",
        "date": "07062016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-CBS Corp announces pricing of debt offering of $700 mln of 2.90 pct senior notes due 2027 "
    },
    {
        "content": "July 8 CBS Radio Inc filed for an initial public offering with U.S. securities regulators on Friday  months after its parent  CBS Corp  said it would explore strategic alternatives for its radio business.",
        "date": "07082016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS Corp's radio unit files for IPO "
    },
    {
        "content": "NEW YORK  June 29 Investor groups are using the high-profile battle for control of Viacom Inc to rally support for their campaigns against dual-class share structures which give founders and insiders outsized voting rights.",
        "date": "06292016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Investors use Viacom battle to campaign against special voting stock "
    },
    {
        "content": "NEW YORK/SAN FRANCISCO Viacom Inc's  board rejected an offer by Sumner Redstone's attorneys to have one of Viacom's independent directors meet face-to-face with the 93-year-old media mogul to get an understanding of his views on the media company  a spokesman for Redstone confirmed on Monday.",
        "date": "06272016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom board rejected offer for director to meet Sumner Redstone "
    },
    {
        "content": "NEW YORK/SAN FRANCISCO  June 27 Viacom Inc's  board rejected an offer by Sumner Redstone's attorneys to have one of Viacom's independent directors meet face-to-face with the 93-year-old media mogul to get an understanding of his views on the media company  a spokesman for Redstone confirmed on Monday.",
        "date": "06272016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 3-Viacom board rejected offer for director to meet Sumner Redstone "
    },
    {
        "content": "Google and Viacom on Monday defeated an appeal in a nationwide class action lawsuit by parents who claimed the companies illegally tracked the online activity of children under the age of 13 who watched videos and played video games on Nickelodeon's website.",
        "date": "06272016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Google beats children's web privacy appeal  Viacom to face one claim "
    },
    {
        "content": "June 27 A federal appeals court on Monday said Google and Viacom need not face a nationwide lawsuit claiming they illegally tracked the activity of children under the age of 13 who watched videos and played video games on the Nickelodeon website.",
        "date": "06272016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Google beats children's web privacy appeal  Viacom must face one claim "
    },
    {
        "content": "Viacom Inc  Chief Executive Philippe Dauman and board member George Abrams asked a Massachusetts court on Thursday to require an immediate medical exam of controlling shareholder Sumner Redstone.",
        "date": "06242016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom CEO asks court to order medical exam of Sumner Redstone "
    },
    {
        "content": "Viacom Inc Chief Executive Philippe Dauman and board member George Abrams asked a Massachusetts court on Thursday to require an immediate medical exam of controlling shareholder Sumner Redstone.",
        "date": "06232016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom CEO asks court to order medical exam of Sumner Redstone "
    },
    {
        "content": "WILMINGTON  Del.  June 22 Viacom Inc's  directors can stay in place  at least for now  as a Delaware judge said at a hearing on Wednesday that a legal fight over who should sit on the media company's board may turn on the mental competence of 93-year-old controlling shareholder Sumner Redstone.",
        "date": "06222016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom board stays in place as judge steers away from Redstone competence question "
    },
    {
        "content": "June 20 Viacom Inc controlling stockholder Sumner Redstone called it \"offensive and untrue\" to suggest that he was unduly influenced by his daughter to remove Viacom Chief Executive Officer Philippe Dauman from a trust overseeing his shares  according to a court filing.",
        "date": "06202016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Sumner Redstone calls Viacom CEO claims 'offensive' -filing "
    },
    {
        "content": "June 23 Viacom Inc Chief Executive Philippe Dauman and board member George Abrams asked a Massachusetts court on Thursday to require an immediate medical exam of controlling shareholder Sumner Redstone.",
        "date": "06232016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Viacom CEO asks court to order medical exam of Sumner Redstone "
    },
    {
        "content": "WILMINGTON  Del.  June 22 Viacom Inc's  directors can stay in place  at least for now  as a Delaware judge said at a hearing on Wednesday that a legal fight over the media company's board may turn on the mental competence of 93-year-old controlling shareholder Sumner Redstone  which may take some time to resolve.",
        "date": "06222016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Viacom board stays in place as judge steers away from Redstone competence question "
    },
    {
        "content": "Viacom Inc  controlling stockholder Sumner Redstone called it \"offensive and untrue\" to suggest that he was unduly influenced by his daughter to remove Viacom Chief Executive Officer Philippe Dauman from a trust overseeing his shares  according to a court filing.",
        "date": "06202016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Sumner Redstone calls Viacom CEO claims 'offensive': filing "
    },
    {
        "content": "June 20 Viacom Inc controlling stockholder Sumner Redstone called it \"offensive and untrue\" to suggest that he was unduly influenced by his daughter to remove Viacom Chief Executive Officer Philippe Dauman from a trust overseeing his shares  according to a court filing.",
        "date": "06202016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Sumner Redstone calls Viacom CEO claims 'offensive' -filing "
    },
    {
        "content": "LOS ANGELES  June 15 Sumner Redstone said he \"no longer trusts\" Viacom Inc's board or Chief Executive Philippe Dauman to act in the media company's best interests  according to a spokesman for the 93-year-old mogul.",
        "date": "06162016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Media mogul Redstone says he 'no longer trusts' Viacom CEO "
    },
    {
        "content": "* Announced extended agreement with The Recording Academy to keep Grammy awards on CBS Television Network through 2026  Source text for Eikon:  Further company coverage:",
        "date": "06152016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Grammy awards to remain on CBS television network through 2026 "
    },
    {
        "content": "Viacom Inc's lead independent director on Tuesday pleaded for a meeting with controlling shareholder Sumner Redstone and warned of further court battles if the media tycoon remained inaccessible to the board.",
        "date": "06152016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom director pleads for access to Sumner Redstone "
    },
    {
        "content": "Viacom Inc disclosed on Friday it would foot the bill for embattled Chief Executive Officer Philippe Dauman's legal fight against controlling shareholder Sumner Redstone  even as Wall Street cheers the executive's potential departure.",
        "date": "06172016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom investors pay CEO's legal bills in Redstone spat "
    },
    {
        "content": "* On June 9  2016  CBS corporation amended and restated its unsecured revolving credit agreement - SEC filing",
        "date": "06102016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-CBS amends  restates unsecured revolving credit agreement "
    },
    {
        "content": "Viacom Inc warned on Friday that its shares could fall as a result of a bylaw change by controlling shareholder Sumner Redstone to restrict Viacom's planned sale of a stake in its Paramount film unit.",
        "date": "06102016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom warns bylaw change may hurt stock - SEC filing "
    },
    {
        "content": "June 17 Viacom Inc disclosed on Friday it would foot the bill for embattled Chief Executive Officer Philippe Dauman's legal fight against controlling shareholder Sumner Redstone  even as Wall Street cheers the executive's potential departure.",
        "date": "06172016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 5-Viacom investors pay CEO's legal bills in Redstone spat "
    },
    {
        "content": "NEW YORK Viacom Inc  warned on Friday that its shares could fall as a result of a bylaw change by controlling shareholder Sumner Redstone to restrict Viacom's planned sale of a stake in its Paramount film unit.",
        "date": "06102016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom warns bylaw change may hurt stock: SEC filing "
    },
    {
        "content": "June 17 Viacom Inc forecast third-quarter adjusted profit below analysts' estimates due to lackluster collections for \"Teenage Mutant Ninja Turtles: Out of the Shadows\"  as well as a delay in completing a video streaming agreement.",
        "date": "06172016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom forecasts third-quarter profit below analysts' estimates "
    },
    {
        "content": "* On June 13  entered into an indemnification agreement with each of Philippe P. Dauman  George S. Abrams",
        "date": "06172016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom enter into indemnification agreement "
    },
    {
        "content": "NEW YORK  June 9 Viacom Inc is still looking to sell a minority stake in its Paramount film unit  but objections from controlling shareholder Sumner Redstone have impeded the deal  CEO Philippe Dauman told investors on Thursday.",
        "date": "06092016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "UPDATE 3-Viacom still pursuing Paramount Studios stake sale -CEO "
    },
    {
        "content": "June 7 Media investors are looking beyond the legal battle between the Redstone family and Viacom Inc O> CEO Philippe Dauman  speculating that a deal for the $18 billion media conglomerate could be on the horizon.",
        "date": "06072016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "DEALTALK-Viacom investors look beyond Dauman  betting on suitors "
    },
    {
        "content": "Sumner Redstone's National Amusements Inc amended the bylaws of Viacom Inc  to require unanimous approval from Viacom's board for any deal related to Paramount Pictures  creating a new hurdle for Chief Executive Philippe Dauman's plan to sell a stake in the movie studio.",
        "date": "06062016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom bylaw change raises bar for Paramount sale "
    },
    {
        "content": "NEW YORK  June 10 Viacom Inc warned on Friday that its shares could fall as a result of a bylaw change by controlling shareholder Sumner Redstone to restrict Viacom's planned sale of a stake in its Paramount film unit.",
        "date": "06102016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Viacom warns bylaw change may hurt stock -SEC filing "
    },
    {
        "content": "* Viacom Inc lead independent director files lawsuit to prevent invalid attempt to remove members of company's board of directors  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "06172016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom lead independent director files lawsuit to prevent  attempt to remove members of board of directors "
    },
    {
        "content": "NEW YORK  June 9 Viacom Inc is still looking to sell a minority stake in its Paramount film unit  but objections from controlling shareholder Sumner Redstone have slowed the process  CEO Philippe Dauman told investors on Thursday.",
        "date": "06092016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom still pursuing Paramount Studios stake sale -CEO "
    },
    {
        "content": "Media investors are looking beyond the legal battle between the Redstone family and Viacom Inc O> CEO Philippe Dauman  speculating that a deal for the $18 billion media conglomerate could be on the horizon.",
        "date": "06072016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom investors look beyond Dauman  betting on suitors "
    },
    {
        "content": "June 6 Sumner Redstone's National Amusements Inc amended the bylaws of Viacom Inc to require unanimous approval from Viacom's board for any deal related to Paramount Pictures  creating a new hurdle for Chief Executive Philippe Dauman's plan to sell a stake in the movie studio.",
        "date": "06062016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Viacom bylaw change raises bar for Paramount sale "
    },
    {
        "content": "NEW YORK  June 10 Viacom Inc warned that controlling shareholder Sumner Redstone's bylaw change to restrict the planned sale of a stake in its Paramount film unit could have a \"significant adverse effect\" on the media company's share price  according to a regulatory filing on Friday.",
        "date": "06102016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom warns bylaw change may hurt stock -SEC filing "
    },
    {
        "content": "Attorneys for Sumner Redstone and his daughter asked a court to reject Viacom Inc  Chief Executive Philippe Dauman's request to move up the trial over Dauman's removal from the media mogul's trust  according to court filings on Friday.",
        "date": "06042016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Redstones oppose speeding up Viacom CEO's legal case "
    },
    {
        "content": "NEW YORK  June 6 Sumner Redstone's National Amusements Inc said on Monday that it had amended Viacom Inc's  bylaws to require unanimous approval by Viacom's board for any deal related to Paramount Pictures.",
        "date": "06062016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CORRECTED-National Amusements amends Viacom's bylaws "
    },
    {
        "content": "NEW YORK  June 6 Viacom's Chief Executive Philippe Dauman  who is suing over his removal from Sumner Redstone's trust  on Monday said in a court filing that a judge should expedite the matter because the 93-year-old media mogul is in ill health and may soon not be able to provide needed evidence.",
        "date": "06062016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom CEO lawyers urge speedy trial  citing Redstone's health "
    },
    {
        "content": "* NAI owns about 79.8% of Viacom's Class A common stock and about 10% of Viacom's common equity",
        "date": "06102016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom says NAI delivers two bylaw amendment actions by written consent "
    },
    {
        "content": "June 3 Attorneys for Sumner Redstone and his daughter asked a court to reject Viacom Inc Chief Executive Philippe Dauman's request to move up the trial over Dauman's removal from the media mogul's trust  according to court filings on Friday.",
        "date": "06042016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 3-Redstones oppose speeding up Viacom CEO's legal case "
    },
    {
        "content": "NEW YORK Viacom Inc  is still looking to sell a minority stake in its Paramount film unit  but objections from controlling shareholder Sumner Redstone have impeded the deal  CEO Philippe Dauman told investors on Thursday.",
        "date": "06102016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom still pursuing Paramount Studios stake sale: CEO "
    },
    {
        "content": "Attorneys for media mogul Sumner Redstone filed a motion on Friday opposing the request by Viacom Inc  Chief Executive Philippe Dauman to move up the trial over his removal from Redstone's trust  Massachusetts state court papers showed.",
        "date": "06032016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Sumner Redstone opposes speeding up Viacom CEO's legal case "
    },
    {
        "content": "Sumner Redstone's granddaughter Keryn said on Wednesday she plans to support the independent directors of Viacom Inc to help free the 93-year-old media mogul from the \"clutches\" of his daughter  Shari.",
        "date": "06022016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Redstone's granddaughter says she backs Viacom's directors "
    },
    {
        "content": "June 1 Sumner Redstone's granddaughter Keryn said on Wednesday she plans to support the independent directors of Viacom Inc to help free the 93-year-old media mogul from the \"clutches\" of his daughter  Shari.",
        "date": "06012016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Granddaughter of Sumner Redstone backs Viacom's directors "
    },
    {
        "content": "A psychiatrist who examined Sumner Redstone twice last month found the 93-year-old retained the mental capacity needed to remove Viacom Inc  Chief Executive Philippe Dauman from the trust that will eventually control the company  according to a spokesman for the media mogul.",
        "date": "06032016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Sumner Redstone has capacity to make trust decisions  says doctor "
    },
    {
        "content": "NEW YORK  May 31 Viacom Inc's chief executive and independent directors would face an uphill courtroom battle to remain on the board if controlling shareholder Sumner Redstone followed through on a threat to remove them  legal experts said on Tuesday.",
        "date": "06012016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "RPT-Viacom CEO  board face tough fight against Redstone - experts "
    },
    {
        "content": "* Viacom CEO's attorney says exam doesn't answer key questions   (Adds details from doctor's report  statement from Viacom CEO's attorney)",
        "date": "06032016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Sumner Redstone has capacity to make trust decisions  says doctor "
    },
    {
        "content": "June 2 Sumner Redstone's spokesman said the 93-year-old is mentally capable of removing Viacom Inc  Chief Executive Philippe Dauman and board member George Abrams from the Redstone National Amusements Trust  citing a report by the media mogul's psychiatrist.",
        "date": "06032016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Sumner Redstone has capacity to make trust decisions  says his doctor "
    },
    {
        "content": "NEW YORK Viacom Inc's  chief executive and independent directors would face an uphill courtroom battle to remain on the board if controlling shareholder Sumner Redstone followed through on a threat to remove them  legal experts said on Tuesday.",
        "date": "05312016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom CEO  board face tough fight against Redstone: experts "
    },
    {
        "content": "NEW YORK  May 30 Viacom Inc's six independent directors vowed on Monday to fight any attempt to oust them from the board  saying they found \"inexplicable\" the assertion that controlling shareholder Sumner Redstone was mentally competent and acted of his own free will.",
        "date": "05302016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "UPDATE 2-Viacom's independent directors vow to fight ouster attempt "
    },
    {
        "content": "* Viacom renews comprehensive carriage agreement with Cox Communications",
        "date": "05272016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Viacom renews comprehensive carriage agreement with Cox Communications "
    },
    {
        "content": "June 1 Sumner Redstone's granddaughter Keryn said on Wednesday she plans to support the independent directors of Viacom Inc to help free the 93-year-old media mogul from the \"clutches\" of his daughter  Shari.",
        "date": "06022016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Redstone's granddaughter says she backs Viacom's directors "
    },
    {
        "content": "June 1 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "06012016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "PRESS DIGEST - Wall Street Journal - June 1 "
    },
    {
        "content": "LOS ANGELES  May 31 Shari Redstone  the daughter of media mogul Sumner Redstone  said in a statement on Tuesday that she has no desire to manage Viacom Inc or to chair its board.",
        "date": "05312016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Shari Redstone says she does not want to manage Viacom "
    },
    {
        "content": "NEW YORK  May 31 Viacom Inc's chief executive and independent directors would face an uphill courtroom battle to remain on the board if controlling shareholder Sumner Redstone followed through on a threat to remove them  legal experts said on Tuesday.",
        "date": "05312016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom CEO  board face tough fight against Redstone - experts "
    },
    {
        "content": "LOS ANGELES  May 31 Shari Redstone  vice chair of Viacom Inc and the daughter of controlling shareholder Sumner Redstone  said on Tuesday she has no desire to manage the media conglomerate or to chair its board.",
        "date": "05312016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Shari Redstone says she does not want to manage Viacom "
    },
    {
        "content": "NEW YORK  May 30 Viacom Inc's  independent directors will fight any attempt to remove them from the media company's board  Lead Independent Director Fred Salerno said in a letter to shareholders on Monday.",
        "date": "05302016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom Director Salerno says board will contest removal attempt "
    },
    {
        "content": "* Viacom inc. Management and governance assessment revised to fair from satisfactory; 'BBB-' rating affirmed",
        "date": "05272016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-S&P says Viacom's Management and governance assessment revised to fair "
    },
    {
        "content": "Viacom Inc Chief Executive Officer Philippe Dauman has asked a Massachusetts court to expedite a legal challenge to his removal from a trust that will determine the entertainment company's future after controlling shareholder Sumner Redstone dies or is deemed incapacitated.",
        "date": "05262016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom CEO asks court to set trial over trust by end-Sept "
    },
    {
        "content": "Viacom Inc  Chief Executive Officer Philippe Dauman has asked a Massachusetts court to expedite a legal challenge to his removal from a trust that will determine the entertainment company's future after controlling shareholder Sumner Redstone dies or is deemed incapacitated.",
        "date": "05262016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom CEO Dauman seeks trial by end-Sept over Redstone trust "
    },
    {
        "content": "NEW YORK  May 24 Sumner Redstone  chairman emeritus of Viacom Inc said on Tuesday he has appointed two\u007f new trustees to a trust that will determine the direction of the media conglomerate and CBS in the event of his incapacitation or death.",
        "date": "05242016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "UPDATE 1-Sumner Redstone appoints two new members to his trust "
    },
    {
        "content": "May 23 The legal battle over control of Sumner Redstone's $40 billion media empire has investors hopeful that change will come to underperforming Viacom Inc.",
        "date": "05232016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "UPDATE 5-Battle over Redstone's media empire sparks hope for change "
    },
    {
        "content": "May 26 Viacom Inc Chief Executive Officer Philippe Dauman has asked a Massachusetts court to expedite a legal challenge to his removal from a trust that will determine the entertainment company's future after controlling shareholder Sumner Redstone dies or is deemed incapacitated.",
        "date": "05262016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 4-Viacom CEO Dauman seeks trial by end-Sept over Redstone trust "
    },
    {
        "content": "May 23 Viacom Inc Chief Executive Philippe Dauman filed a complaint Monday morning to stop Sumner Redstone from removing him and George Abrams from the media mogul's trust  Dauman and Abrams said in a statement Monday.",
        "date": "05232016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom CEO Dauman files suit over removal from Sumner Redstone's trust "
    },
    {
        "content": "* Sets quarterly dividend of $0.15 per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "05262016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-CBS sets quarterly dividend of $0.15 per share "
    },
    {
        "content": "May 23 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "05232016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "PRESS DIGEST - Wall Street Journal - May 23 "
    },
    {
        "content": "NEW YORK  May 21 Viacom Inc said on Saturday its board members have been unable to meet with controlling shareholder Sumner Redstone because his daughter Shari is blocking access to the media mogul.",
        "date": "05212016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom says its board has not had access to Redstone "
    },
    {
        "content": "May 20 Media mogul Sumner Redstone has removed Viacom CEO Philippe Dauman and Viacom board member George Abrams from the seven-person trust that will determine the fate of both Viacom and CBS in the event of his incapacitation or death  two people familiar with the situation told Reuters Friday.",
        "date": "05212016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Sumner Redstone removes Viacom CEO and board member from trust "
    },
    {
        "content": "May 20 Media mogul Sumner Redstone has removed Viacom CEO Philippe Dauman and Viacom board member George Abrams from the seven-person trust that will determine the fate of both Viacom and CBS in the event of his incapacitation or death  two people familiar with the situation told Reuters Friday.",
        "date": "05212016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Sumner Redstone removes Viacom CEO and board member from trust "
    },
    {
        "content": "May 18 Viacom Inc's board voted on Wednesday to stop paying 92-year-old controlling shareholder and Chairman Emeritus Sumner Redstone  according to a source familiar with the matter.",
        "date": "05182016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom board votes to stop paying Sumner Redstone "
    },
    {
        "content": "* Board of directors has declared a quarterly cash dividend of $0.40 per share on both its class A and class B common stock  Source text for Eikon:  Further company coverage:",
        "date": "05182016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom sets qtrly dividend of $0.40/shr on class A and class B stock "
    },
    {
        "content": "May 17 Viacom Inc and American Express Co on Tuesday said they will launch a data-driven product aimed at providing  television advertisers deeper understanding into consumers' future purchases.",
        "date": "05172016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom  AmEx to help advertisers target TV viewers "
    },
    {
        "content": "* Viacom and American Express form exclusive partnership and launch a data-driven ad product  \"Vantage Intent\"  Source text for Eikon:  Further company coverage:",
        "date": "05172016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom and American Express form exclusive partnership "
    },
    {
        "content": "May 17 Sumner Redstone has the power to remove Viacom Inc Chief Executive Philippe Dauman  but not his daughter Shari  from the trust that will control his $40 billion media empire after his incapacitation or death  according to two sources familiar with the matter.",
        "date": "05172016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "RPT-Sumner Redstone has power to remove Viacom CEO from his trust "
    },
    {
        "content": "May 17 Sumner Redstone has the power to remove Viacom Inc Chief Executive Philippe Dauman  but not his daughter Shari  from the trust that will control his $40 billion media empire after his incapacitation or death  according to two sources familiar with the matter.",
        "date": "05172016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Sumner Redstone has power to remove Viacom CEO from his trust "
    },
    {
        "content": "May 9 Viacom Inc's board is considering whether to further cut the pay of its Chairman Emeritus Sumner Redstone  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "05102016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom board weighs further cuts in Redstone's pay- WSJ "
    },
    {
        "content": "A trial over Sumner Redstone's mental competence appeared to come to an abrupt end on Monday when a California judge threw out a lawsuit brought by the 92-year-old media mogul's former girlfriend  Manuela Herzer.",
        "date": "05092016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Judge throws out Redstone competence lawsuit "
    },
    {
        "content": "* Board members from CBS  Viacom planning to visit Redstone to investigate his competency for themselves  now that trial is over - WSJ  citing sources  Source text - (http://on.wsj.com/1VR4A2v) Further company coverage:    (Bengaluru Newsroom)",
        "date": "05102016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Board members from CBS Viacom planning to visit Redstone to investigate his competency for themselves - WSJ  citing sources "
    },
    {
        "content": "LOS ANGELES Even as a Los Angeles judge dismissed one case brought by a former girlfriend of media mogul Sumner Redstone  she filed a new lawsuit that threatens to keep salacious allegations about the 92-year-old's lifestyle alive.",
        "date": "05102016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "New lawsuit alleges paid informants  pricey escort at Redstone mansion "
    },
    {
        "content": "CBS Corp  the owner of the most-watched U.S. TV network  reported a 10 percent rise in quarterly revenue  beating Wall Street estimates  as the U.S. presidential campaign and Super Bowl broadcast boosted spending on advertising.",
        "date": "05032016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Political ads and Super Bowl boost CBS in first quarter "
    },
    {
        "content": "NEW YORK CBS Corp's executives are talking to investment bankers about how their CEO and executive chairman  Les Moonves  can gain more control over the broadcaster after Sumner Redstone dies  or if he is declared mentally incompetent  said two sources familiar with the situation.",
        "date": "04282016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS weighs share options for post-Redstone era-sources "
    },
    {
        "content": "April 28 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "04282016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Viacom Inc  has narrowed the number of bidders for a minority stake in its Paramount Pictures movie studio from more than 40 to a handful and expects to begin negotiations late next month  Chief Executive Officer Philippe Dauman told analysts on Thursday morning.",
        "date": "04282016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom narrows down bidders for Paramount stake to handful: CEO "
    },
    {
        "content": "April 28 Viacom Inc has narrowed the number of bidders for a minority stake in its Paramount Pictures movie studio from more than 40 to a handful and expects to begin negotiations late next month  Chief Executive Officer Philippe Dauman told analysts on Thursday morning.",
        "date": "04282016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 3-Viacom narrows down bidders for Paramount stake to handful -CEO "
    },
    {
        "content": "* Viacom says process of identifying minority investor in Paramount is continuing and on track to secure deal by end of June -earnings conf call",
        "date": "04282016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom says search for minority investor in Paramount is continuing-conf call "
    },
    {
        "content": "* Announced partnership \"to utilize aggregated audience insights from Roku (reg) to deliver targeted advertising on Roku platform\"",
        "date": "04282016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom announces partnership with Roku Inc for targeted advertising "
    },
    {
        "content": "April 28 Viacom Inc  the owner of MTV  Comedy Central and Nickelodeon  reported a 2.5 percent decline in quarterly revenue  weighed down by lower domestic advertising revenue and a lack of hit movie releases at its Paramount film studio.",
        "date": "04282016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom revenue falls 2.5 pct as domestic ad sales fall "
    },
    {
        "content": "NEW YORK CBS Corp's executives are talking to investment bankers about how their CEO and executive chairman  Les Moonves  can gain more control over the broadcaster after Sumner Redstone dies  or if he is declared mentally incompetent  said two sources familiar with the situation.",
        "date": "04292016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Exclusive: CBS weighs share options for post-Redstone era - sources "
    },
    {
        "content": "Dish Network Corp Chief Executive Charlie Ergen said on Wednesday that talks to renew the satellite TV provider's contract to carry Viacom Inc programs have turned positive  though a deal remains uncertain ahead of a midnight deadline.",
        "date": "04202016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Dish CEO says talks to renew Viacom deal have turned productive "
    },
    {
        "content": "Viacom Inc  on Tuesday began alerting Dish Network Corp's  satellite TV subscribers that they might soon lose its networks  including Comedy Central  Nickelodeon and MTV  as an agreement between the companies is set to expire Wednesday night.",
        "date": "04192016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom warns Dish TV viewers of blackout if contract not renewed "
    },
    {
        "content": "Viacom Inc said on Thursday it has renewed a multiyear distribution contract with satellite TV provider Dish Network Corp  lifting the media company's shares over 11 percent.",
        "date": "04212016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom shares soar after deal to renew Dish contract "
    },
    {
        "content": "LOS ANGELES  April 20 A California judge on Wednesday rejected a bid by Sumner Redstone's granddaughter to join the media mogul's ex-girlfriend in a lawsuit that challenges the 92-year-old billionaire's mental competency.",
        "date": "04202016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Judge denies Redstone granddaughter's bid to join competency suit "
    },
    {
        "content": "April 19 Viacom Inc on Tuesday began alerting Dish Network Corp's satellite TV subscribers that they might soon lose its networks  including Comedy Central  Nickelodeon and MTV  as an agreement between the companies is set to expire Wednesday night.",
        "date": "04192016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 3-Viacom warns Dish TV viewers of blackout if contract not renewed "
    },
    {
        "content": "April 21 Viacom Inc said on Thursday it has renewed a multiyear distribution contract with satellite TV provider Dish Network Corp  lifting the media company's shares over 11 percent.",
        "date": "04212016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Viacom shares soar after deal to renew Dish contract "
    },
    {
        "content": "April 21 Viacom Inc said it reached an agreement with Dish Network Corp  averting a blackout of its programs on the satellite TV network.",
        "date": "04212016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom  Dish agree to renew contract "
    },
    {
        "content": "April 19 Viacom Inc's carriage deal with Dish Network Corp is scheduled to expire at the end of the day Wednesday and there is no agreement in sight  a Viacom spokesman told Reuters Tuesday.",
        "date": "04192016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom carriage deal with Dish to expire Wednesday night "
    },
    {
        "content": "* Select Viacom live and video-on-demand content to join Sling TV single- and multi-stream services",
        "date": "04212016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom and Dish agree to multi-year renewal "
    },
    {
        "content": "NEW YORK  April 21 A midnight deadline has passed without the announcement of a programming deal between Viacom Inc and Dish Network Corp.",
        "date": "04212016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Dish  Viacom deadline passes with no programming deal announced "
    },
    {
        "content": "Lawyers for Viacom Inc Chairman Emeritus Sumner Redstone are in talks to settle a lawsuit challenging the 92-year-old media mogul's mental competency  people familiar with the situation said on Tuesday.",
        "date": "04052016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Lawyers in settlement talks over Sumner Redstone competency lawsuit: sources "
    },
    {
        "content": "April 5 Lawyers for Viacom Inc Chairman Emeritus Sumner Redstone are in talks to settle a lawsuit challenging the 92-year-old media mogul's mental competency  people familiar with the situation said on Tuesday.",
        "date": "04052016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Lawyers in settlement talks over Sumner Redstone competency lawsuit -sources "
    },
    {
        "content": "April 5 Representatives of Viacom Inc  Chairman Emeritus Sumner Redstone are in settlement talks related to a lawsuit challenging the 92-year-old media mogul's mental competency  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "04052016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Sumner Redstone team in settlement talks over competency suit-WSJ "
    },
    {
        "content": "* Sumner Redstone's team is in settlement talks in competency case  deposition of Viacom CEO scheduled for today is suspended -CNBC citing DJ  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04052016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Sumner Redstone's team in settlement talks in competency case - CNBC citing DJ "
    },
    {
        "content": "* Viacom board of directors creates new role of lead independent director; independent directors elect Frederic V. Salerno to position",
        "date": "03162016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "BRIEF-Viacom creates new role of lead Independent Director "
    },
    {
        "content": "Viacom Inc is looking to name a lead independent director  most likely one of its existing board members  and could make an announcement within the next few days  two sources familiar with the situation told Reuters  as the media company faces investor questions about its corporate governance.",
        "date": "03162016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom looks to name lead independent director to board "
    },
    {
        "content": "Viacom Inc  has received interest from three dozen companies for a minority stake in its Paramount Pictures studio  Chief Executive Philippe Dauman said in an interview with the Wall Street Journal.",
        "date": "03182016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom receives interest for Paramount minority stake: WSJ "
    },
    {
        "content": "March 15 CBS Corp will explore strategic alternatives for its radio business  Chief Executive Les Moonves said at an investor presentation on Tuesday.",
        "date": "03152016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS to explore strategic options for radio unit "
    },
    {
        "content": "Viacom Inc  has extended the employment agreement of Chief Operating Officer Thomas Dooley through 2018  settling uncertainty over whether the executive would stay with the multi-billion dollar media company 10 months before his current contract was set to expire.",
        "date": "03172016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom extends COO's employment contract through 2018  no pay rise "
    },
    {
        "content": "March 17 Viacom Inc has received interest from three dozen companies for a minority stake in its Paramount Pictures studio  Chief Executive Philippe Dauman said in an interview with the Wall Street Journal.",
        "date": "03182016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Viacom receives interest for Paramount minority stake-WSJ "
    },
    {
        "content": "NEW YORK  March 15 CBS Corp will explore strategic alternatives for its radio business  Chairman and Chief Executive Les Moonves said at an investor presentation on Tuesday.",
        "date": "03152016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-CBS to explore strategic options for radio unit "
    },
    {
        "content": "NEW YORK Viacom Inc's  new lead independent director pledged on Wednesday to represent all of the media company's shareholders and improve board and management coordination  including on potential mergers and acquisitions.",
        "date": "03172016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom's new lead independent director pledges close eye on strategy "
    },
    {
        "content": "March 14 Viacom Inc investors re-elected the media company's directors and rejected a proposal to extend voting rights to all shareholders despite recommendations by the leading proxy advisory firm to withhold support for some directors and approve the proposal.",
        "date": "03142016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom shareholders re-elect directors  reject voting rights proposal "
    },
    {
        "content": "NEW YORK  March 16 Viacom Inc's new lead independent director pledged on Wednesday to represent all of the media company's shareholders and improve board and management coordination  including on potential mergers and acquisitions.",
        "date": "03172016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 3-Viacom's new lead independent director pledges close eye on strategy "
    },
    {
        "content": "MIAMI  March 14 A substantial majority of Viacom Inc's independent shareholders on Monday voted to re-elect the media company's directors and rejected a move to extend voting rights to all shareholders  going against recommendations by the leading proxy advisory firm.",
        "date": "03142016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 4-Viacom shareholders re-elect directors  reject voting rights proposal "
    },
    {
        "content": "* Ceo dauman says did not seek to be in charge of Sumner Redstone's health care directive",
        "date": "03142016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "BRIEF-Viacom CEO says Sumner Redstone enjoying life and getting best medical care "
    },
    {
        "content": "LOS ANGELES  Feb 29 A lawsuit that challenges the mental competence of media mogul Sumner Redstone  the former executive chairman of Viacom Inc  can proceed  a California judge said in a tentative ruling on Monday.",
        "date": "02292016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Judge allows case against media mogul Redstone to proceed-tentative ruling "
    },
    {
        "content": "Viacom Inc Chief Executive Philippe Dauman's lawyers failed to persuade a New York judge to quash his deposition in a high-profile lawsuit over media mogul Sumner Redstone's mental competency.",
        "date": "02252016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "New York judge grants request to depose Viacom CEO "
    },
    {
        "content": "Hollywood studio DreamWorks Animation SKG Inc  would be interested in a merger with Viacom Inc's  Paramount Pictures  the company's chief executive said on Tuesday.",
        "date": "03012016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "DreamWorks interested in Viacom's Paramount Pictures: CEO "
    },
    {
        "content": "Feb 25 Viacom Inc Chief Executive Philippe Dauman's lawyers failed to persuade a New York judge to quash his deposition in a high-profile lawsuit over media mogul Sumner Redstone's mental competency.",
        "date": "02252016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-New York judge grants request to depose Viacom CEO "
    },
    {
        "content": "March 1 Hollywood studio DreamWorks Animation SKG Inc would be interested in a merger with Viacom Inc's Paramount Pictures  the company's chief executive said on Tuesday.",
        "date": "03012016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "DreamWorks interested in Viacom's Paramount Pictures - CEO "
    },
    {
        "content": "LOS ANGELES  Feb 29 Media mogul Sumner Redstone's lawyers suffered a defeat in court on Monday as a California judge tentatively ruled that a lawsuit challenging his mental competency could proceed to trial.",
        "date": "03012016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 5-Judge sets trial for dispute over Redstone's mental capacity "
    },
    {
        "content": "BOSTON  Feb 19 Proxy adviser Institutional Shareholder Services on Friday recommended Viacom Inc  investors withhold support for six of the media company's directors  citing concerns about their oversight of executive compensation and other matters.",
        "date": "02192016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "ISS recommends Viacom investors withhold support for six directors "
    },
    {
        "content": "BOSTON Institutional Shareholder Services on Friday recommended Viacom Inc investors withhold support for six of the media company's directors  as the largest proxy adviser cited several concerns including their oversight of executive compensation.",
        "date": "02202016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "ISS recommends Viacom investors withhold support for six directors "
    },
    {
        "content": "Feb 23 Viacom Inc is considering selling a \"significant\" minority stake in its Paramount Pictures movie studio  Chief Executive Philippe Dauman said on Tuesday",
        "date": "02232016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "UPDATE 3-Viacom weighs selling minority stake in Paramount film unit "
    },
    {
        "content": "Viacom Inc  Chief Executive Philippe Dauman's lawyers failed to persuade a New York judge to quash his deposition in a high-profile lawsuit over media mogul Sumner Redstone’s mental competency.",
        "date": "02262016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "NY judge grants request to depose Viacom CEO "
    },
    {
        "content": "BOSTON  Feb 19 Institutional Shareholder Services on Friday recommended Viacom Inc investors withhold support for six of the media company's directors  as the largest proxy adviser cited several concerns including their oversight of executive compensation.",
        "date": "02202016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-ISS recommends Viacom investors withhold support for six directors "
    },
    {
        "content": "Feb 23 Viacom Inc is considering selling a minority stake in its Paramount Pictures movie studio  Chief Executive Philippe Dauman said on Tuesday.",
        "date": "02232016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom to consider selling minority stake in Paramount Pictures "
    },
    {
        "content": "CBS Corp  profit rose in line with Wall Street expectations on Thursday as the media company reported a bump in network advertising and said international sales of its television shows were strong.",
        "date": "02112016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS profit meets Wall Street targets but shares slip "
    },
    {
        "content": "Feb 10 Viacom Inc investor SpringOwl Asset Management called for the media company's independent directors to step down immediately  days after the board appointed Chief Executive Philippe Dauman as executive chairman.",
        "date": "02102016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom investor SpringOwl urges independent directors to quit "
    },
    {
        "content": "Feb 11 CBS Corp profit rose in line with Wall Street expectations on Thursday as the media company reported a bump in network advertising and said international sales of its television shows were strong.",
        "date": "02112016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 3-CBS profit meets Wall Street targets but shares slip "
    },
    {
        "content": "Feb 10 Viacom Inc investor SpringOwl Asset Management urged the media company's six independent directors to step down immediately  days after the board appointed Chief Executive Philippe Dauman to the additional post of executive chairman.",
        "date": "02102016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Viacom investor SpringOwl urges independent directors to quit "
    },
    {
        "content": "Feb 10 In a conference call after the company's disappointing results on Tuesday  Viacom Inc Chief Executive Philippe Dauman  among other things  said he was \"focused on getting Viacom's stock price back\" to levels it had been \"just a short time ago.\"",
        "date": "02102016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom's past share buyback binge leaves investors hungry "
    },
    {
        "content": "Viacom Inc CEO Philippe Dauman railed at critics of his leadership after a fifth straight quarter missing Wall Street's sales estimates on Tuesday  unnerving investors and sending the media company's shares down more than 21 percent to a five-year low.",
        "date": "02092016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom CEO rails against 'naysayers' as sales miss estimates  shares tumble "
    },
    {
        "content": "Feb 9 Viacom Inc CEO Philippe Dauman railed at critics of his leadership after a fifth straight quarter missing Wall Street's sales estimates on Tuesday  unnerving investors and sending the media company's shares down more than 21 percent to a five-year low.",
        "date": "02092016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 6-Viacom CEO rails against 'naysayers' as sales miss estimates  shares tumble "
    },
    {
        "content": "Feb 9 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Tuesday:",
        "date": "02092016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Feb 8 CBS Corp CEO Leslie Moonves  who was given the additional title of executive chairman last week  is planning more original content and looking at taking some of his network's shows off the air and putting them exclusively on its subscription-based CBS All Access service  to compete with the growing popularity of Netflix Inc and Hulu.",
        "date": "02082016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "RPT-With full power at CBS  CEO Moonves sees more aggressive move to digital "
    },
    {
        "content": "NEW YORK Viacom Inc's board of directors named Chief Executive Officer Philippe Dauman as executive chairman  replacing majority owner Sumner Redstone  overriding calls for an independent board chief from Redstone's daughter  who voted against Dauman. | Video ",
        "date": "02052016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom names CEO Dauman as chair as Redstone exits; daughter protests "
    },
    {
        "content": "Feb 3 CBS Corp said on Wednesday that media mogul Sumner Redstone had resigned as executive chairman  a move that comes amid heightened questions about the 92-year-old billionaire's physical and mental health.",
        "date": "02032016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "RPT-UPDATE 2-Sumner Redstone resigns as CBS executive chairman "
    },
    {
        "content": "Feb 9 Viacom Inc  the owner of MTV  Comedy Central  Nickelodeon and movie studio Paramount  reported a steeper-than-expected drop in quarterly revenue  hurt by lower advertising sales in the United States and few hit movie releases in the period  sending its shares down 11.3 percent.",
        "date": "02092016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CORRECTED-UPDATE 3-Viacom sales miss estimates  shares drop; CEO hits out at critics "
    },
    {
        "content": "Feb 3 CBS Corp said on Wednesday Sumner Redstone had resigned as executive chairman  a move that comes amid heightened questions about the billionaire's physical and mental health.",
        "date": "02032016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Sumner Redstone resigns as CBS executive chairman "
    },
    {
        "content": "Viacom Inc  and Snapchat have extended a deal that will allow Viacom to sell advertising on the mobile app's behalf.",
        "date": "02092016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom extends ad deal with Snapchat "
    },
    {
        "content": "Feb 9 Viacom Inc  the owner of television channel MTV and movie studio Paramount  reported a 5.7 percent fall in quarterly revenue  hurt by lower domestic advertising revenue and a lack of hit movie releases in the period.",
        "date": "02092016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom's quarterly revenue falls 5.7 pct "
    },
    {
        "content": "Feb 4 Viacom Inc Chief Executive Philippe Dauman is expected to take over the role of executive chairman from Sumner Redstone  CNBC tweeted  citing sources.",
        "date": "02042016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom CEO Philippe Dauman likely to become chairman - CNBC "
    },
    {
        "content": "Feb 8 Viacom Inc and Snapchat have extended a deal that will allow Viacom to sell advertising on the mobile app's behalf.",
        "date": "02092016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Viacom extends ad deal with Snapchat "
    },
    {
        "content": "NEW YORK/LOS ANGELES Viacom's board appears poised to replace Sumner Redstone as chairman on Thursday  after the aging mogul stepped down from his executive role at the top of CBS  but it was not apparent who would get his job at Viacom as Redstone's daughter made clear she did not want CEO Philippe Dauman to succeed her father. | Video ",
        "date": "02042016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Redstone seen resigning as Viacom chair after stepping down at CBS "
    },
    {
        "content": "Feb 8 Viacom Inc is said to be extending its deal with Snapchat which will allow it to sell advertising on the mobile app's behalf  the Wall Street Journal reported citing people familiar with the matter.",
        "date": "02092016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom to sell Snapchat ads in multi-year deal - WSJ "
    },
    {
        "content": "The National Football League will split the broadcast rights for its Thursday Night Football games between NBC and CBS Corp  a move that reportedly earns the League higher fees and underlines the increasing cost of content for TV networks.",
        "date": "02012016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "NFL says CBS to share Thursday Night Football games with NBC "
    },
    {
        "content": "LOS ANGELES  Jan 28 Viacom Inc  Executive Chairman Sumner Redstone will undergo an examination on Friday by a doctor hired by an ex-girlfriend in a lawsuit that challenges his mental competency  a spokesman for the former girlfriend said.",
        "date": "01282016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom's Redstone to undergo mental exam on Friday "
    },
    {
        "content": "NEW YORK/LOS ANGELES  Feb 3 Viacom's board appears poised to replace Sumner Redstone as chairman on Thursday  after the aging mogul stepped down from his executive role at the top of CBS  but it was not apparent who would get his job at Viacom as Redstone's daughter made clear she did not want CEO Philippe Dauman to succeed her father.",
        "date": "02042016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 6-Redstone seen resigning as Viacom chair after stepping down at CBS "
    },
    {
        "content": "Feb 1 The National Football League will split the broadcast rights for its Thursday Night Football games between NBC and CBS Corp  a move that reportedly earns the League higher fees and underlines the increasing cost of content for TV networks.",
        "date": "02012016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-NFL says CBS to share Thursday Night Football games with NBC "
    },
    {
        "content": "Feb 1 The National Football League said CBS Corp  would share the broadcast of its primetime \"Thursday Night Football\" games with NBC.",
        "date": "02012016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "NFL says NBC  CBS to share Thursday Night Football broadcast "
    },
    {
        "content": "LOS ANGELES  Jan 28 Viacom Inc  Executive Chairman Sumner Redstone will undergo an examination on Friday by a doctor hired by an ex-girlfriend in a lawsuit that challenges his mental competency  a spokesman for the former girlfriend said.",
        "date": "01282016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Viacom's Redstone to undergo mental exam on Friday "
    },
    {
        "content": "Jan 27 A vocal investor in Yahoo Inc  and Viacom Inc is calling for the boards of both companies to seek outside investments from strategic partners in the vein of legendary investor Warren Buffett to help boost the value of their stocks.",
        "date": "01282016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Investor calls on Yahoo  Viacom to take on 'Buffett-like' partners "
    },
    {
        "content": "BOSTON  Jan 22 Viacom Inc said on Friday it cut the pay of Executive Chairman Sumner Redstone by 85 percent to $2 million last year in light of his \"reduced responsibilities.\"",
        "date": "01222016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom Chairman Redstone gets reduced pay  responsibilities; pay hike for CEO "
    },
    {
        "content": "Jan 21 European pay-TV group Sky Plc  has struck a deal to screen programmes from CBS Corp's  popular Showtime stable  including Billions starring Damian Lewis  as competition for top shows heats up among European broadcasters.",
        "date": "01212016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Sky strikes deal to screen CBS's Showtime programmes in Europe "
    },
    {
        "content": "BOSTON Media giant Viacom Inc said on Wednesday it cut the compensation of its top two executives  Executive Chairman Sumner Redstone and Chief Executive Philippe Dauman  as the company faced business pressures and a sharp drop in its share price.",
        "date": "01202016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom cut pay for Redstone  CEO Dauman in 2015 "
    },
    {
        "content": "Viacom Inc's 92-year-old Executive Chairman Sumner Redstone should be examined by a psychiatrist hired by the ex-girlfriend who has questioned his mental competency  a California judge ruled on Friday.",
        "date": "01232016",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Viacom's Redstone may undergo medical exam in competency suit "
    },
    {
        "content": "BOSTON  Jan 20 Media giant Viacom Inc said on Wednesday it cut the compensation of its top two executives  Executive Chairman Sumner Redstone and Chief Executive Philippe Dauman  as the company faced business pressures and a sharp drop in its share price.",
        "date": "01202016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Viacom cut pay for Redstone  CEO Dauman in 2015 "
    },
    {
        "content": "BOSTON Viacom Inc said on Friday it cut the total pay of its 92-year-old Executive Chairman Sumner Redstone by 85 percent to $2 million last year in light of his \"reduced responsibilities\" and that it had raised the pay of Viacom Chief Executive Philippe Dauman.",
        "date": "01232016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom cuts Redstone pay due to reduced responsibilities; CEO pay rises "
    },
    {
        "content": "Investors targeted Viacom Inc on two fronts on Tuesday  in a lawsuit alleging Executive Chairman Sumner Redstone is incapacitated and should not have been paid millions in compensation  and in an activist investor presentation calling for changes to the board and management.",
        "date": "01192016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Investors target Viacom in suit on Redstone pay  call for change "
    },
    {
        "content": "BOSTON  Jan 20 Media giant Viacom Inc said on Wednesday the annual compensation for its executive chairman Sumner Redstone declined 85 percent to $2 million for fiscal 2015.",
        "date": "01202016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Viacom says Redstone paid $2 million in 2015  down 85 pct from prior year "
    },
    {
        "content": "Jan 22 Viacom Inc's 92-year-old Executive Chairman Sumner Redstone should be examined by a psychiatrist hired by the ex-girlfriend who has questioned his mental competency  a California judge ruled on Friday.",
        "date": "01232016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 3-Viacom's Redstone may undergo medical exam in competency suit "
    },
    {
        "content": "* Lawsuit alleges Viacom  CBS misrepresented Redstone's health   (Adds information about shareholder lawsuit  comments from Jackson and Viacom)",
        "date": "01192016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Investors target Viacom in suit on Redstone pay  call for change "
    },
    {
        "content": "Jan 19 A shareholder filed a lawsuit against Viacom's board on Tuesday  alleging the company and CBS  improperly paid millions to executive chairman Sumner Redstone \"while he was physically and mentally incapacitated.\"",
        "date": "01192016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Shareholder sues Viacom board over Sumner Redstone health "
    },
    {
        "content": "BOSTON  Jan 22 Viacom Inc said on Friday it cut the total pay of its 92-year-old Executive Chairman Sumner Redstone by 85 percent to $2 million last year in light of his \"reduced responsibilities\" and that it had raised the pay of Viacom Chief Executive Philippe Dauman.",
        "date": "01232016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Viacom cuts Redstone pay due to reduced responsibilities; CEO pay rises "
    },
    {
        "content": "Activist investor Eric Jackson said Viacom Inc should change its board and leadership  cut costs and make a push into digital offerings to boost its stock price.",
        "date": "01192016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Activist investor Eric Jackson seeks management shakeup at Viacom "
    },
    {
        "content": "Jan 4 Media mogul Sumner Redstone has filed a motion seeking the dismissal of a petition filed by his former girlfriend Manuela Herzer to have him examined to see if he was able to make healthcare decisions for himself.",
        "date": "01052016",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "REFILE-Sumner Redstone seeks dismissal of former girlfriend's petition "
    },
    {
        "content": "Dec 21 Shari Redstone refused an offer from her media mogul father Sumner to sell her 20 percent stake in the holding company that controls Viacom Inc and CBS Corp  for $1 billion  the Wall Street Journal reported.",
        "date": "12212015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Shari Redstone refused to sell stake in media empire - WSJ "
    },
    {
        "content": "Dec 21 Shari Redstone refused an offer from her media mogul father Sumner to sell her 20 percent stake in the holding company that controls Viacom Inc and CBS Corp  for $1 billion  the Wall Street Journal reported.",
        "date": "12212015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Shari Redstone refused to sell stake in media empire - WSJ "
    },
    {
        "content": "Media mogul Sumner Redstone's compensation as executive chairman of CBS Corp and Viacom Inc was reduced for 2015  CNBC reported  citing sources.",
        "date": "12222015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS  Viacom executive chair Redstone's compensation cut in 2015: CNBC "
    },
    {
        "content": "Dec 22 Media mogul Sumner Redstone's compensation as executive chairman of CBS Corp and Viacom Inc was reduced for 2015  CNBC reported  citing sources.",
        "date": "12222015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS  Viacom exec chair Redstone's compensation cut in 2015-CNBC "
    },
    {
        "content": "Shari Redstone refused an offer from her media mogul father Sumner to sell her 20 percent stake in the holding company that controls Viacom Inc and CBS Corp for $1 billion  the Wall Street Journal reported.",
        "date": "12222015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Shari Redstone refused to sell stake in media empire: WSJ "
    },
    {
        "content": "Sumner Redstone's former girlfriend filed a new lawsuit on Monday alleging that the 92-year-old media mogul's signature was forged on a document  supporting her allegation that he was being manipulated in his business and personal affairs.",
        "date": "12152015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Media mogul Redstone's ex-girlfriend alleges forgery in U.S. lawsuit "
    },
    {
        "content": "Dec 14 Sumner Redstone's former girlfriend filed a new lawsuit on Monday alleging that the 92-year-old media mogul's signature was forged on a document  supporting her allegation that he was being manipulated in his business and personal affairs.",
        "date": "12152015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CORRECTED-UPDATE 1-Media mogul Redstone's ex-girlfriend alleges forgery in U.S. lawsuit "
    },
    {
        "content": "Dec 14 Sumner Redstone's former girlfriend  Manuela Herzer  filed a new lawsuit in California on Monday alleging that the 92-year-old media mogul's signature was forged on a document removing her as his health care agent.",
        "date": "12152015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CORRECTED-Redstone's ex-girlfriend alleges forgery in latest court case "
    },
    {
        "content": "Dec 14 Sumner Redstone's former girlfriend  Manuela Herzer  filed a new lawsuit in California on Monday alleging that the 92-year-old media mogul's signature was forged on a document removing her as his health care agent.",
        "date": "12142015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Redstone's ex-girlfriend alleges forgery in latest court case "
    },
    {
        "content": "BOSTON/NEW YORK An official for the second-largest U.S. public pension system on Thursday urged Viacom Inc to do away with its dual-class share structure  the latest call from an investor for change at the media empire controlled by the aging mogul Sumner Redstone as doubts grow over his ability to lead.",
        "date": "12032015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Exclusive: Viacom should end non-voting stock  give vote to all investors - California fund "
    },
    {
        "content": "Facebook Inc said on Wednesday it launched its news app Notify for iPhone users in the United States  featuring content from media partners such as Fox News  Washington Post and CBS.",
        "date": "11112015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Facebook launches news app 'Notify' in U.S "
    },
    {
        "content": "Nov 11 Facebook Inc said on Wednesday it launched its news app Notify for iPhone users in the United States  featuring content from media partners such as Fox News  Washington Post and CBS.",
        "date": "11112015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Facebook launches news app 'Notify' in U.S. "
    },
    {
        "content": "Nov 3 CBS Corp is discussing launching a higher-priced ad-free version of its All Access streaming digital video service  Chief Executive Les Moonves said on Tuesday.",
        "date": "11042015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "UPDATE 1-CBS eyes ad-free version of streaming digital offering "
    },
    {
        "content": "CBS Corp   owner of the most-watched U.S. TV network  beat Wall Street's earnings expectations  but reported quarterly revenue slightly below analysts' estimates due to lower advertising sales and content licensing fees.",
        "date": "11032015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS beats earnings expectations  despite slight revenue miss "
    },
    {
        "content": "Nov 3 CBS Corp is discussing launching an ad-free version of its All Access streaming digital video service  Chief Executive Les Moonves told analysts on a conference call Tuesday.",
        "date": "11042015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CORRECTED-CBS eyes ad-free version of streaming digital offering "
    },
    {
        "content": "Nov 3 CBS Corp  owner of the most-watched U.S. TV network  beat Wall Street's earnings expectations  but reported quarterly revenue slightly below analysts' estimates due to lower advertising sales and content licensing fees.",
        "date": "11032015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-CBS beats earnings expectations  despite slight revenue miss "
    },
    {
        "content": "Nov 3 CBS Corp is discussing launching an ad-free version of its All Access streaming digital video service  Chief Executive Less Moonves told analysts on a conference call Tuesday.",
        "date": "11032015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS eyes ad-free version of streaming digital offering "
    },
    {
        "content": "Oct 1 Amazon.com Inc signed a content licensing deal with CBS Corp for three new shows  the latest move in the e-commerce giant's attempt to cater to the rising popularity of on-demand content.",
        "date": "10012015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Amazon signs content licensing deal with CBS for three new shows "
    },
    {
        "content": "Sept 15 Cable network operator AMC Networks Inc  was in preliminary talks to buy billionaire John Malone's premium TV cable network Starz  Bloomberg reported.",
        "date": "09152015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-AMC Networks in talks to buy Starz- Bloomberg "
    },
    {
        "content": "Sept 1 CBS Corp-owned CBS Sports said it will allow viewers to live stream two regular NFL season games  in addition to AFC coverage  on their portable devices  expanding its services to the fast-growing Internet viewer base.",
        "date": "09022015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "RPT-CBS bringing limited live NFL to portable devices "
    },
    {
        "content": "CBS Corp-owned CBS Sports said it will allow viewers to live stream two regular NFL season games  in addition to AFC coverage  on their portable devices  expanding its services to the fast-growing Internet viewer base.",
        "date": "09022015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS bringing limited live NFL to portable devices "
    },
    {
        "content": "Aug 26 Dish Network Corp said subscribers have lost access to more than 100 local stations due to a distribution dispute with Sinclair Broadcast Group Inc   affecting viewers of a string of ABC  CBS  Fox  and NBC channels.",
        "date": "08262015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Local channels blacked out on Dish across 36 states "
    },
    {
        "content": "Aug 5 CBS Corp  owner of the most-watched U.S. TV network  reported a better-than-expected quarterly profit due to higher revenue from affiliates and subscription fees.",
        "date": "08052015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "UPDATE 1-CBS profit beats estimates as affiliate revenue jumps "
    },
    {
        "content": "Aug 5 CBS Corp  owner of the most-watched U.S. TV network  reported a better-than-expected quarterly profit due to higher revenue from affiliates and increase in subscription fees.",
        "date": "08052015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS profit beats estimates as affiliate revenue rises "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 07 (Fitch) Fitch Ratings has assigned a 'BBB' rating to CBS  Corporation's (CBS) proposed issuance of benchmark-sized senior unsecured notes  maturing in 2025. The proceeds from the offering are expected to be used for  general corporate purpose including the repayment of short-term debt and share  repurchases. Fitch currently has a 'BBB' Issuer Default Rating (IDR) for CBS. The Rating  Outlook for the IDR  as well as all ",
        "date": "07072015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Fitch Rates CBS' Senior Notes 'BBB'; Outlook Stable "
    },
    {
        "content": "CBS Corp said AT&T Inc has agreed to keep the television network's channels on its web-based TV service  U-verse.",
        "date": "07022015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "AT&T's U-verse TV service to carry CBS channels "
    },
    {
        "content": "July 1 CBS Corp said AT&T Inc has agreed to keep the television network's channels on its web-based TV service  U-verse.",
        "date": "07022015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-AT&T's U-verse TV service to carry CBS channels "
    },
    {
        "content": "July 1 CBS Corp said AT&T Inc has agreed to carry the television network's channels on its IP-based TV service  U-verse.",
        "date": "07012015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "AT&T's internet TV service to carry CBS channels "
    },
    {
        "content": "June 23 Online video-streaming service Hulu said it would soon allow its users to add CBS Corp's  television network Showtime to their Hulu subscriptions.",
        "date": "06232015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Hulu to offer users access to Showtime streaming service "
    },
    {
        "content": "June 3 CBS Corp said its Showtime network will start streaming programs on Apple Inc  devices on July 12  coinciding with the new seasons of \"Masters of Sex\" and \"Ray Donovan\".",
        "date": "06032015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "UPDATE 1-CBS's Showtime streaming service to start in July "
    },
    {
        "content": "March 17 Apple Inc's much-hinted-at TV service may soon become a reality as the iPhone maker is in talks with programmers to offer a slimmed-down bundle of TV networks this fall  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "03172015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Apple in talks to launch online TV service - WSJ "
    },
    {
        "content": "March 16 Apple Inc is in talks with programmers to offer a slimmed-down bundle of TV networks this fall  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "03172015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Apple in talks to launch online TV service - WSJ "
    },
    {
        "content": "* Shares rise as much as 15.4 percent   (Adds details from conference call  updates shares)",
        "date": "03122015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "UPDATE 3-Lumber Liquidators defends floor product safety  offers free tests "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  February 27 (Fitch) Fitch Ratings has published its new Rating  Navigators for the following North American diversified Media companies: --CBS Corporation --Cox Enterprises  Inc. --Discovery Communications LLC --NBCUniversal Media LLC --Time Warner Inc. --Twenty-First Century Fox  Inc. --Viacom  Inc. --The Walt Disney Company  Inc.  These Rating Navigators should be read in tandem with its companion report  entitled 'Media:  R",
        "date": "02272015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Fitch Publishes Rating Navigators for U.S. Diversified Media Companies "
    },
    {
        "content": "CBS Corp  owner of the most-watched U.S. TV network  reported slightly higher-than-expected quarterly revenue and profit  helped by its Thursday night football broadcasts.",
        "date": "02132015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Thursday night football helps CBS beat estimates "
    },
    {
        "content": "Jerry Tarkanian  a colorful  towel-chomping Hall of Fame basketball coach who transformed once-obscure University of Nevada-Las Vegas into a national powerhouse and won an NCAA title  died on Wednesday at age 84.",
        "date": "02112015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Hall of Fame basketball coach Jerry Tarkanian dead at 84 "
    },
    {
        "content": "LOS ANGELES CBS Corp is winning a battle to convince more advertisers to pay for commercial views that take place up to seven days after a program airs  Chief Executive Leslie Moonves said  a sign of the power broadcasters hold even as audiences embrace digital viewing options.",
        "date": "02132015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS says more advertisers will pay for seven-day commercial viewing "
    },
    {
        "content": "CBS Corp  owner of the most-watched U.S. TV network  reported slightly higher-than-expected quarterly revenue and profit  helped by its Thursday night football broadcasts.",
        "date": "02122015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "Thursday night football helps CBS beat estimates "
    },
    {
        "content": "LOS ANGELES  Feb 12 CBS Corp is winning a battle to convince more advertisers to pay for commercial views that take place up to seven days after a program airs  Chief Executive Leslie Moonves said  a sign of the power broadcasters hold even as audiences embrace digital viewing options.",
        "date": "02132015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS says more advertisers will pay for 7-day commercial viewing "
    },
    {
        "content": "LOS ANGELES  Feb 12 CBS Corp Chief Executive Officer Leslie Moonves  when asked if he was considering any potential mergers  said the media company is performing well on its own.",
        "date": "02122015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS CEO says company strong by itself  does not need partners "
    },
    {
        "content": "Feb 12 CBS Corp  owner of the most-watched U.S. TV network  reported slightly higher-than-expected quarterly revenue and profit  helped by its Thursday night football broadcasts.",
        "date": "02122015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 1-Thursday night football helps CBS beat estimates "
    },
    {
        "content": "Feb 12 CBS Corp  owner of the most-watched U.S. television network  reported a 3 percent rise in quarterly revenue  helped by its Thursday night football broadcasts.",
        "date": "02122015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Thursday night football lifts CBS revenue "
    },
    {
        "content": "WASHINGTON  Feb 10 The New York Times Co   J.C. Penney Corp and CBS Corp lost a round on Tuesday in a patent fight with Helferich Patent Licensing LLC  which had accused them of infringing on patents for looking at websites on mobile telephones.",
        "date": "02102015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "UPDATE 1-Patent licenser Helferich wins court round against New York Times  others "
    },
    {
        "content": "WASHINGTON  Feb 10 The New York Times Co   J.C. Penney Corp and CBS Corp lost a round Tuesday in a patent fight with Helferich Patent Licensing  LLC  which had accused them of infringing on patents for looking at websites on mobile telephones.",
        "date": "02102015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Patent licenser Helferich wins court round against New York Times  others "
    },
    {
        "content": "CBS Corp Chief Executive Leslie Moonves is discussing ways to buy out the broadcaster's controlling shareholder  National Amusements Inc  ahead of a potential deal with Viacom Inc  the New York Post reported  citing sources.",
        "date": "02052015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "CBS's Moonves plans to buy company ahead of potential Viacom deal: NY Post "
    },
    {
        "content": "Feb 5 CBS Corp Chief Executive Leslie Moonves is discussing ways to buy out the broadcaster's controlling shareholder  National Amusements Inc  ahead of a potential deal with Viacom Inc  the New York Post reported  citing sources.",
        "date": "02052015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS's Moonves plans to buy company ahead of potential Viacom deal - NY Post "
    },
    {
        "content": "NEW YORK  Jan 18 The National Football League will continue its partnership with CBS Corp to broadcast Thursday-night football during the 2015 season  company officials said Sunday.",
        "date": "01182015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "CBS and NFL continue partnership on Thursday-night football "
    },
    {
        "content": "LOS ANGELES  Jan 15 The Fox News and Fox Business channels returned on Thursday to satellite TV provider Dish Network Corp's lineup after both sides agreed to a multiyear deal.",
        "date": "01162015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "UPDATE 2-Dish reaches deal that brings back Fox news  business channels "
    },
    {
        "content": "Jan 17 CBS Sports basketball analyst Greg Anthony has been suspended indefinitely by the network  a CBS spokesperson said on Saturday  a day after he was arrested in Washington  D.C.  on a charge of soliciting prostitution.",
        "date": "01172015",
        "name": "CBS Corporation",
        "news_type": "topStory",
        "symbol": "CBS",
        "title": "UPDATE 2-CBS suspends sports analyst Greg Anthony after his arrest "
    },
    {
        "content": "LOS ANGELES  Jan 12 Stephen Colbert will debut as the new host of CBS Corp's \"Late Show \" on Sept. 8  the U.S. broadcast television network said on Monday.",
        "date": "01122015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Stephen Colbert's 'Late Show' set for September debut  CBS says "
    },
    {
        "content": "NEW YORK/LAS VEGAS Jan 8 Media companies that are starting to allow their programs onto Internet-delivered TV and mobile devices are putting limits on digital rights as a safety hatch if problems arise with the new distribution systems  executives say.",
        "date": "01082015",
        "name": "CBS Corporation",
        "news_type": "normal",
        "symbol": "CBS",
        "title": "Media embracing digital TV with strings attached "
    }
]