[
    {
        "content": "* Priced previously announced public offering of 2.250% senior notes due 2021 in an aggregate principal amount of $700 million",
        "date": "08222016",
        "name": "Crown Castle International Corporation",
        "news_type": "topStory",
        "symbol": "CCI",
        "title": "BRIEF-Crown castle announces pricing of senior notes offering "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 01 (Fitch) Fitch Ratings has upgraded the Issuer Default Ratings  (IDR) of Crown Castle International Corp. (Crown) and its subsidiaries to 'BBB-'  from 'BB'. In addition  Fitch has upgraded the long-term debt ratings of Crown  and its subsidiaries as listed at the end of this release. The Outlook is  Stable  resolving the previous Positive Outlook. KEY RATING DRIVERS Crown's ratings reflect the strong recurring cash flows",
        "date": "07012015",
        "name": "Crown Castle International Corporation",
        "news_type": "topStory",
        "symbol": "CCI",
        "title": "Fitch Upgrades Crown Castle's IDR to 'BBB-'; Outlook Stable "
    },
    {
        "content": "Telecommunications tower operator Crown Castle International Corp  said it would sell its Australian unit for about A$2 billion ($1.6 billion) in cash to a group of investors led by Macquarie Infrastructure and Real Assets.",
        "date": "05142015",
        "name": "Crown Castle International Corporation",
        "news_type": "topStory",
        "symbol": "CCI",
        "title": "Crown Castle to sell Australian unit for $1.6 billion "
    },
    {
        "content": "May 14 Telecommunications tower operator Crown Castle International Corp said it would sell its Australian unit for about A$2 billion ($1.6 billion) in cash to a group of investors led by Macquarie Infrastructure and Real Assets.",
        "date": "05142015",
        "name": "Crown Castle International Corporation",
        "news_type": "normal",
        "symbol": "CCI",
        "title": "UPDATE 1-Crown Castle to sell Australian unit for A$2 bln "
    },
    {
        "content": "SYDNEY Macquarie Group Ltd   Australia's top investment bank  said it jointly bought the country's largest owner of mobile telephone towers from a business owned by U.S. wireless infrastructure giant Crown Castle International Corp .",
        "date": "05152015",
        "name": "Crown Castle International Corporation",
        "news_type": "topStory",
        "symbol": "CCI",
        "title": "Macquarie-led group pays $1.6 billion for Crown Castle wireless towers "
    },
    {
        "content": "May 14 Telecommunications tower operator Crown Castle International Corp said it would sell its majority-owned Australian unit  CCAL  to a group of investors led by Macquarie Infrastructure and Real Assets for about A$2 billion in cash.",
        "date": "05142015",
        "name": "Crown Castle International Corporation",
        "news_type": "normal",
        "symbol": "CCI",
        "title": "CORRECTED-Crown Castle to sell Australian unit for A$2 bln "
    },
    {
        "content": "SYDNEY  May 15 Macquarie Group Ltd  Australia's top investment bank  said it jointly bought the country's largest owner of mobile telephone towers from a business owned by U.S. wireless infrastructre giant Crown Castle International Corp.",
        "date": "05152015",
        "name": "Crown Castle International Corporation",
        "news_type": "normal",
        "symbol": "CCI",
        "title": "UPDATE 1-Macquarie-led group pays $1.6 bln for Crown Castle wireless towers "
    },
    {
        "content": "SYDNEY  May 15 Macquarie Group Ltd  Australia's top investment bank  said it jointly bought the country's largest owner of mobile telephone towers from a business owned by U.S. wireless infrastructre giant Crown Castle International Corp.",
        "date": "05152015",
        "name": "Crown Castle International Corporation",
        "news_type": "normal",
        "symbol": "CCI",
        "title": "Australia's Macquarie buys wireless towers from U.S.-owned Crown Castle "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 30 (Fitch) Fitch Ratings believes Crown Castle International  Corp.'s (Crown) proposed acquisition of Quanta Fiber Networks  Inc. (Sunesys)  for $1 billion in cash will not affect its current 'BB' Issuer Default Rating or  Positive Rating Outlook.  Crown has agreed to acquire Sunesys  a wholly owned subsidiary of Quanta  Services  Inc.  in a transaction expected to close by the end of the year.  Sunesys is a fiber service",
        "date": "04302015",
        "name": "Crown Castle International Corporation",
        "news_type": "topStory",
        "symbol": "CCI",
        "title": "Fitch: Crown Castle's Rating Unaffected by Proposed Acquisition of Sunesys "
    },
    {
        "content": "Wireless infrastructure provider Crown Castle International Corp  said it would buy Quanta Fiber Networks Inc for $1 billion to expand its presence in top U.S. metropolitan markets.",
        "date": "04302015",
        "name": "Crown Castle International Corporation",
        "news_type": "normal",
        "symbol": "CCI",
        "title": "Crown Castle to buy Quanta Fiber Networks for $1 billion "
    },
    {
        "content": "April 30 Wireless infrastructure provider Crown Castle International Corp said it would buy Quanta Fiber Networks Inc for $1 billion to expand its presence in top U.S. metropolitan markets.",
        "date": "04302015",
        "name": "Crown Castle International Corporation",
        "news_type": "normal",
        "symbol": "CCI",
        "title": "Crown Castle to buy Quanta Fiber Networks for 1 bln "
    }
]