[
    {
        "content": "Canada's Cameco Corp   reported a surprise quarterly loss and cut its full-year production outlook on Friday as uranium prices extended their slump  driving its shares down 12 percent.",
        "date": "10272017",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "Uranium miner Cameco posts surprise loss  shares dive 12 percent "
    },
    {
        "content": "TORONTO  Oct 27 Canada's main stock index slipped early on Friday  weighed by banks and Cameco Corp's disappointing earnings and outlook  while gold miners gained and dairy company Saputo Inc rose after agreeing to buy an Australian milk producer.",
        "date": "10272017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "CANADA STOCKS-TSX slips with banks  Cameco; Saputo jumps "
    },
    {
        "content": "Oct 27 Canada's Cameco Corp  on Friday reported a surprise quarterly loss and cut its full-year production outlook  as uranium prices remain weak.",
        "date": "10272017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "UPDATE 1-Miner Cameco posts surprise Q3 loss  cuts production outlook "
    },
    {
        "content": "Oct 27 Canada's Cameco Corp  on Friday reported a quarterly loss  compared with a year-ago profit  hurt by weak uranium prices.",
        "date": "10272017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "Miner Cameco posts third-quarter loss "
    },
    {
        "content": "Canada's Cameco Corp  the world's second-largest uranium producer  said on Thursday it had settled a U.S. tax dispute for a fraction of the original claim  which may bode well for the company's multi-billion-dollar battle with the Canada Revenue Agency.",
        "date": "07272017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "Miner Cameco settles U.S. tax spat  bigger Canada fight looms "
    },
    {
        "content": "July 27 Canada's Cameco Corp  the world's second-largest uranium producer  said on Thursday it had settled a U.S. tax dispute for a fraction of the original claim  which may bode well for the company's multi-billion-dollar battle with the Canada Revenue Agency.",
        "date": "07272017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "UPDATE 3-Miner Cameco settles U.S. tax spat  bigger Canada fight looms "
    },
    {
        "content": "July 27 Cameco Corp   the world's second-largest uranium miner  reported a small quarterly loss  compared with the year-earlier period when it booked an impairment charge.",
        "date": "07272017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "REFILE-Cameco Corp reports small quarterly loss "
    },
    {
        "content": "* Cameco Corp - appointment of Brian Reilly as Cameco's senior vice-president and chief operating officer",
        "date": "05112017",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "BRIEF-Cameco Corp appoints Brian Reilly as Cameco's COO "
    },
    {
        "content": "May 11 Cameco Corp CEO  speaking at the company's annual general meeting:",
        "date": "05112017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "BRIEF-Cameco COO to retire  replaced by Brian Reilly July 1 "
    },
    {
        "content": "April 28 Cameco Corp   the world's second-biggest uranium producer  posted a bigger-than-expected quarterly loss  partly hurt by the termination of a key sales contract  driving shares to a nearly five-month low.",
        "date": "04282017",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "UPDATE 2-Uranium miner Cameco posts surprisingly big loss  shares plunge "
    },
    {
        "content": "* Q1 earnings per share view c$-0.01 -- Thomson Reuters I/B/E/S",
        "date": "04282017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "BRIEF-Cameco Q1 adjusted loss per share $0.07 "
    },
    {
        "content": "April 28 Cameco Corp   the world's second-biggest uranium producer  posted a quarterly loss  partly hurt by weak prices and the termination of a contract by Tokyo Electric Power Co.",
        "date": "04282017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "Uranium producer Cameco posts loss vs year-ago profit "
    },
    {
        "content": "March 6 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Monday:",
        "date": "03062017",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "TORONTO Canada's Cameco Corp   the world's second-biggest uranium producer  is exploring the sale of its U.S. production facilities  its chief executive said on Monday  as a six-year industry slump drags on.",
        "date": "03062017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "Exclusive: Cameco explores U.S. mines sale as uranium slump drags on - CEO "
    },
    {
        "content": "* Co  Cameco have signed a memorandum of understanding  involving termination of Halliday/Stewardson option agreement",
        "date": "03062017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "BRIEF-Uravan and Cameco form joint venture "
    },
    {
        "content": "Feb 28 Canada’s Cameco Corp  the world’s second-biggest uranium producer  said on Tuesday it may not be finished cutting production as prices remain low after a major customer cancelled a supply contract.",
        "date": "02282017",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "Cameco may cut uranium output further  as prices stay low - CEO "
    },
    {
        "content": "Feb 28 Cameco Corp CEO Tim Gitzel  speaking at an investor conference in Florida:",
        "date": "02282017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "BRIEF-Cameco CEO says may review uranium production levels "
    },
    {
        "content": "* Sets quarterly cash dividend of C$0.10per share  Source text for Eikon:  Further company coverage:",
        "date": "02082017",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "BRIEF-Cameco sets quarterly cash dividend of C$0.10per share "
    },
    {
        "content": "Canada's Cameco Corp   reported a lower-than-expected quarterly profit  hurt by weak uranium prices.",
        "date": "02092017",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "Canadian uranium producer Cameco's profit misses estimate "
    },
    {
        "content": "Feb 9 Canada's Cameco Corp   reported a lower-than-expected quarterly profit  hurt by weak uranium prices.",
        "date": "02092017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "UPDATE 1-Canadian uranium producer Cameco's profit misses estimate "
    },
    {
        "content": "* \"We see continued growth in reactor construction and  consequently  increasing uranium demand\"",
        "date": "02092017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "BRIEF-Cameco Q4 adjusted earnings per share $0.23 "
    },
    {
        "content": "Feb 9 Canadian uranium producer Cameco Corp   on Thursday reported a bigger fourth-quarter loss  hurt by lower uranium prices and an impairment charge.",
        "date": "02092017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "Canadian uranium producer Cameco posts bigger quarterly loss "
    },
    {
        "content": "* Has been informed that Cameco has elected not to fund exploration expenditures on co's Athabasca Basin Stewardson project for 2017",
        "date": "02092017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "BRIEF-Uravan Minerals has been informed that Cameco will not to fund Athabasca Basin Stewardson project for 2017 "
    },
    {
        "content": "TORONTO  Feb 1 Canada's main stock index ended slightly higher on Wednesday  boosted by gains for some miners and energy companies  while a scrapped contract to supply uranium pushed Cameco Corp down 11.3 percent.",
        "date": "02012017",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "CANADA STOCKS-TSX rises with resources stocks  Cameco slumps "
    },
    {
        "content": "TORONTO  Feb 1 Canada's main stock index slipped on Wednesday as nuclear producer Cameco Corp sunk on news of a scrapped contract and gold miners pulled back ahead of a U.S. Federal Reserve interest rate decision.",
        "date": "02012017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "CANADA STOCKS-TSX falls as Cameco sinks  gold miners weigh "
    },
    {
        "content": "Feb 1 Canadian uranium producer Cameco Corp  said on Wednesday that Tokyo Electric Power (Tepco)   the operator of Japan's wrecked Fukushima nuclear plant  had scrapped its uranium supply contract with the company.",
        "date": "02012017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "UPDATE 1-Tepco scraps uranium supply contract with Canada's Cameco "
    },
    {
        "content": "TORONTO  Feb 1 Canada's main stock index gained early on Wednesday as energy stocks jumped with higher oil prices  while uranium producer Cameco Corp sank after saying its contract to supply the operator of Japan's wrecked Fukushima nuclear plant had been scrapped.",
        "date": "02012017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "CANADA STOCKS-TSX rises early as oil boosts energy stocks; Cameco slumps "
    },
    {
        "content": "Feb 1 Canadian uranium producer Cameco Corp  said on Wednesday that Tokyo Electric Power (Tepco)   the operator of Japan's wrecked Fukushima nuclear plant  had scrapped its uranium supply contract with the company.",
        "date": "02012017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "Tepco scraps uranium supply contract with Canada's Cameco "
    },
    {
        "content": "* Cameco Corp- on January 31  2017  Tepco confirmed it would not accept a uranium delivery scheduled for February 1  2017",
        "date": "02012017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "BRIEF-Cameco rejects Tepco's uranium contract termination notice "
    },
    {
        "content": "TORONTO  Jan 19 Canada's main stock index edged higher on Thursday  helped by a jump in Canadian Pacific Railway shares on prospects of consolidation in the railroad industry and a rebound in uranium producer Cameco Corp.",
        "date": "01192017",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "CANADA STOCKS-TSX edges higher  led by CP Rail and Cameco "
    },
    {
        "content": "TORONTO  Jan 19 Canada's main stock index moved higher in morning trade on Thursday  helped by a jump in Canadian Pacific Railway shares and a rebound in uranium producer Cameco Corp.",
        "date": "01192017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "CANADA STOCKS-TSX rises as CP Rail and Cameco gain "
    },
    {
        "content": "TORONTO  Jan 18 Canada's main stock index fell on Wednesday as energy stocks weighed with a fall in oil prices and as uranium producer Cameco Corp plunged on a negative outlook.",
        "date": "01182017",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "CANADA STOCKS-Cameco plunge leads TSX lower  energy also weighs "
    },
    {
        "content": "TORONTO  Jan 18 Canada's main stock index closed lower on Wednesday  hurt by a 17 percent fall in shares of uranium producer Cameco Corp after a profit warning and as lower oil prices weighed on energy companies.",
        "date": "01182017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "CANADA STOCKS-TSX ends down as Cameco plunges  energy stocks weigh "
    },
    {
        "content": "TORONTO  Jan 18 Canada's main stock index fell on Wednesday as energy stocks weighed with a fall in oil prices and uranium producer Cameco Corp plunged on a negative outlook.",
        "date": "01182017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "CANADA STOCKS-TSX falls as energy stocks slip  Cameco falls "
    },
    {
        "content": "TORONTO  Jan 18 Canada's main stock index slipped in early trade on Wednesday  weighed down by energy stocks as oil prices slid and by a slump in uranium miner Cameco Corp after it warned of a net loss and job cuts.",
        "date": "01182017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "CANADA STOCKS-TSX falls as Cameco slides  oil fall weighs on energy stocks "
    },
    {
        "content": "* Do not currently expect that any changes to financial outlook for 2016 will have a material impact on actual 2016 earnings",
        "date": "01172017",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "CORRECTED-BRIEF-Cameco says to cut 10 pct workforce at three operations "
    },
    {
        "content": "Jan 17 Canadian uranium producer Cameco Corp   on Tuesday said it expected its 2016 adjusted profit to be significantly lower than analysts' estimates and also said it would cut 120 jobs at three of its uranium mines in 2017.",
        "date": "01182017",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "Cameco expects to report net loss for 2016  cut jobs at uranium mines "
    },
    {
        "content": "* Denison executes agreement to increase ownership of Wheeler River Project up to 66%",
        "date": "01102017",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "BRIEF-Denison executes agreement to increase ownership of Wheeler River Project up to 66 pct "
    },
    {
        "content": "Nov 2 Canadian uranium producer Cameco Corp   on Wednesday reported a better-than-expected quarterly profit  largely helped by a jump in uranium sales volumes.",
        "date": "11022016",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "UPDATE 1-Cameco's profit beats estimates on higher uranium sales "
    },
    {
        "content": "Nov 2 Canadian uranium producer Cameco Corp   swung to a quarterly profit  largely helped by a 35 percent jump in uranium sales volumes.",
        "date": "11022016",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "Cameco swings to quarterly profit "
    },
    {
        "content": "Cameco Corp  the world's No.2 uranium producer  reported a surprise quarterly loss due to weak uranium demand and prices  sending its shares down 7 percent to touching a nearly 12-year low of C$12.87.",
        "date": "07282016",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "Cameco posts surprise loss on weak uranium prices  shares dive "
    },
    {
        "content": "July 28 Cameco Corp   the world's No.2 uranium producer  reported a surprise quarterly loss due to weak uranium demand and prices  sending its shares down 7 percent to touching a nearly 12-year low of C$12.87.",
        "date": "07282016",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "UPDATE 2-Cameco posts surprise loss on weak uranium prices  shares dive "
    },
    {
        "content": "July 28 Cameco Corp   the world's No.2 uranium producer  reported a quarterly loss due to weak uranium prices and a charge related to the suspension of its Rabbit Lake operation in northern Saskatchewan.",
        "date": "07282016",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "Cameco posts loss on weak uranium prices  impairment charge "
    },
    {
        "content": "* Canadian Nuclear Safety Commission (cnsc) has approved an application by Areva Resources Canada Inc.",
        "date": "05312016",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "BRIEF-Cameco updates production outlook for Cigar Lake mine "
    },
    {
        "content": "* New agreement replaces memorandum of agreement signed by cameco and kazatomprom in september 2012",
        "date": "05272016",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "BRIEF-Cameco and Kazatomprom sign agreement to restructure JV Inkai "
    },
    {
        "content": "* Q1 earnings per share view c$0.16 -- Thomson Reuters I/B/E/S",
        "date": "04292016",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "BRIEF-Cameco Q1 earnings per share C$0.20 "
    },
    {
        "content": "April 29 Canada's uranium producer Cameco Corp   reported an adjusted loss for the first quarter  compared with a year-ago profit  as uranium prices continued to soften and demand remained low.",
        "date": "04292016",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "Uranium producer Cameco posts Q1 adjusted loss "
    },
    {
        "content": "April 21 Canadian uranium producer Cameco Corp  said it is suspending production at its Rabbit Lake operation in northern Saskatchewan  while also reducing production across Cameco Resources' U.S. operations.",
        "date": "04222016",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "Cameco suspends production at its Rabbit Lake operations  cuts 500 jobs "
    },
    {
        "content": "* Cameco announces operational changes in saskatchewan and the united states",
        "date": "04212016",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "BRIEF-Cameco suspends production at rabbit lake operation in northern saskatchewan "
    },
    {
        "content": "TORONTO Cameco Corp is slowly expanding the world's biggest uranium mine  betting utilities that are currently well-supplied will need the radioactive metal in coming years  Chief Executive Officer Tim Gitzel said on Monday.",
        "date": "03072016",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "Cameco slowly expands world's biggest uranium mine  betting on recovery "
    },
    {
        "content": "Feb 5 Canadian uranium producer Cameco Corp   reported a quarterly loss  hurt by a higher impairment charge and weakness in the Canadian dollar.",
        "date": "02052016",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "Canadian uranium producer Cameco reports quarterly loss "
    },
    {
        "content": "Feb 8 Cameco Corp holding quarterly conference call",
        "date": "02082016",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "BRIEF-Cameco expects to meet Cigar Lake output target by 2017 - CEO "
    },
    {
        "content": "Feb 5 Canadian uranium producer Cameco Corp   reported a quarterly loss  hurt by a higher impairment charge and weakness in the Canadian dollar and forecast a fall in uranium sales for 2016.",
        "date": "02052016",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "UPDATE 1-Canadian uranium producer Cameco reports quarterly loss "
    },
    {
        "content": "WINNIPEG  Manitoba  Jan 6 Cameco Corp    the world's second-largest uranium producer  said on Wednesday it expects its newest mine at Cigar Lake  Saskatchewan to produce 16 million packaged pounds of uranium concentrate in 2016  subject to regulatory approval.",
        "date": "01062016",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "Cameco aims for bigger uranium output from new mine "
    },
    {
        "content": "Oct 30 Cameco Corp   the world's second-largest uranium producer  reported lower adjusted quarterly earnings on Friday   as an oversupply in the market continued to affect demand and pricing.",
        "date": "10312015",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "UPDATE 1-Cameco Q3 adjusted profit falls amid oversupply "
    },
    {
        "content": "Oct 30 Canadian uranium producer Cameco Corp   reported  lower adjusted quarterly earnings on Friday as an oversupply in the market continued to affect demand and pricing.",
        "date": "10302015",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "Cameco Q3 adjusted profit falls "
    },
    {
        "content": "Aug 4 Canpotex Ltd  the potash export sales arm for Potash Corp of Saskatchewan  Mosaic Co and Agrium Inc  said on Tuesday that Ken Seitz would succeed Steve Dechka as chief executive officer on Nov. 1.",
        "date": "08042015",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "Canpotex taps Cameco's Seitz as next CEO "
    },
    {
        "content": "Canada's Cameco Corp    one of the world's largest uranium producers  raised its full-year revenue forecast  helped by increased capacity from its purchase of nuclear fuel broker Nukem Energy GmbH in 2013.",
        "date": "07302015",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "Uranium producer Cameco sees 5-10 percent rise in 2015 revenue "
    },
    {
        "content": "July 30 Canada's Cameco Corp   one of the world's largest uranium producers  raised its full-year revenue forecast  helped by increased capacity from its purchase of nuclear fuel broker Nukem Energy GmbH in 2013.",
        "date": "07302015",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "UPDATE 1-Uranium producer Cameco sees 5-10 pct rise in 2015 revenue "
    },
    {
        "content": "July 30 Canadian uranium producer Cameco Corp   reported a 31 percent fall in quarterly profit due to higher costs and a $28 million settlement charge.",
        "date": "07302015",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "Canadian uranium producer Cameco's profit falls 31 pct "
    },
    {
        "content": "April 29 Canadian uranium miner Cameco Corp   said it expects revenue to rise 5 percent in 2015 due to a weak Canadian dollar  reversing its earlier forecast of a 5 percent decline.",
        "date": "04292015",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "UPDATE 1-Uranium producer Cameco sees 5 pct rise in 2015 revenue "
    },
    {
        "content": "April 29 Canadian uranium producer Cameco Corp   reported a loss compared with a year-ago profit due to foreign exchange derivatives losses.",
        "date": "04292015",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "Uranium producer Cameco posts loss on forex derivatives "
    },
    {
        "content": "OTTAWA  April 15 Canada's Cameco Corp  has signed a C$350 million ($280 million) five-year deal to supply uranium fuel to Indian nuclear reactors  the Canadian government announced on Wednesday.",
        "date": "04152015",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "Cameco signs C$350 mln deal to supply uranium to India reactors "
    },
    {
        "content": "TORONTO  April 15 Canada and India are expected to announce Wednesday a uranium supply deal worth hundreds of millions of dollars where Canadian producer Cameco Corp  would provide fuel for Indian reactors  according to a newspaper report on Wednesday.",
        "date": "04152015",
        "name": "Cameco Corporation",
        "news_type": "normal",
        "symbol": "CCJ",
        "title": "India  Canada expected to announce uranium supply deal "
    },
    {
        "content": "Feb 6 Canadian uranium producer Cameco Corp   reported on Friday a 14 percent increase in quarterly earnings  helped by higher uranium prices and a decline in the average unit cost of sales.",
        "date": "02062015",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "Cameco earnings rise 14 pct on higher realized uranium prices "
    },
    {
        "content": "Feb 6 Canadian uranium producer Cameco Corp   reported on Friday a 14 percent increase in quarterly earnings  helped by higher uranium prices.",
        "date": "02072015",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "UPDATE 1-Cameco earnings rise 14 pct on higher realized uranium prices "
    },
    {
        "content": "WINNIPEG  Manitoba  Jan 13 Canadian uranium producer Cameco Corp said on Tuesday  it expected its newest mine at Cigar Lake  Saskatchewan  to produce 6 million to 8 million pounds of uranium concentrate in 2015.",
        "date": "01132015",
        "name": "Cameco Corporation",
        "news_type": "topStory",
        "symbol": "CCJ",
        "title": "Cameco sees 2015 uranium output of 6-8 mln pounds at Canada mine "
    }
]