[
    {
        "content": "* Signed agreement with Shell NA LNG LLC to be its supplier of marine LNG for fully LNG-powered cruise ships in North America Source text for Eikon: Further company coverage:",
        "date": "11082017",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "BRIEF-Carnival Cruise Line​ ‍signs marine LNG agreement with Shell NA LNG "
    },
    {
        "content": "Sept 28 Carnival Corp's chief executive said on Thursday that the cruise company expected Puerto Rico and the Caribbean to rebound by winter after hurricanes that wrecked havoc on the islands.",
        "date": "09282017",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "UPDATE 1-Carnival sees hurricane-whipped Caribbean rebounding by winter "
    },
    {
        "content": "Sept 28 Carnival Corp's chief executive said on Thursday damage from recent devastating storms in Puerto Rico and the Caribbean will temporarily disrupt the cruise operator's business  but a robust holiday season is still expected as the region likely recovers by Christmas.",
        "date": "09282017",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "Carnival business disrupted but CEO sees Caribbean rebound by winter "
    },
    {
        "content": "Cruise operator Carnival Corp  rode out the first effects of a devastating hurricane season for the Caribbean to raise its full-year forecast for earnings on Tuesday and report a better than expected quarter to the end of August.",
        "date": "09262017",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "Cruise stocks bounce as Carnival says Caribbean back in business "
    },
    {
        "content": "Sept 26 Cruise operator Carnival Corp rode out the first effects of a devastating hurricane season for the Caribbean to raise its full-year forecast for earnings on Tuesday and report a better than expected quarter to the end of August.",
        "date": "09262017",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "UPDATE 2-Cruise stocks bounce as Carnival says Caribbean back in business "
    },
    {
        "content": "* On conf call- \"Caribbean is open for business and is going strong\"",
        "date": "09262017",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "BRIEF-Carnival CEO- \"Caribbean is open for business and is going strong\" "
    },
    {
        "content": "* Q3 earnings per share view $2.20 -- Thomson Reuters I/B/E/S",
        "date": "09262017",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "BRIEF-Carnival Corporation Q3 GAAP earnings per share $1.83 "
    },
    {
        "content": "Sept 26 Carnival Corp  the world's largest cruise operator  reported a 8.2 percent rise in quarterly revenue  helped by an uptick in ticket prices and higher onboard spending.",
        "date": "09262017",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "Carnival Corp reports 8.2 pct rise in revenue "
    },
    {
        "content": "HOUSTON  Aug 25 Carnival Corp said on Friday that three of its cruise ships are unable to return to the Port of Galveston  Texas  which is closed ahead of Hurricane Harvey.",
        "date": "08252017",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "Carnival cruise ships blocked from Galveston port by Hurricane Harvey "
    },
    {
        "content": "* Carnival corp qtrly u.s. Gaap net income of $379 million  or $0.52 diluted eps",
        "date": "06222017",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "BRIEF-Carnival Corp qtrly diluted EPS $0.52 "
    },
    {
        "content": "* Carnival Corporation & PLC announces exchange rate for quarterly dividend",
        "date": "06022017",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "BRIEF-Carnival Corp & PLC announces exchange rate for quarterly dividend "
    },
    {
        "content": "* Carnival Corporation & plc increases quarterly dividend and authorizes additional $1 billion share repurchase program",
        "date": "04072017",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "BRIEF-Carnival Corp increases quarterly dividend  authorizes additional $1 bln share repurchase program "
    },
    {
        "content": "Carnival Corp   the world's largest cruise operator  reported a better-than-expected quarterly profit on Tuesday and raised its forecast for full-year earnings  sending its shares to a record high.",
        "date": "03282017",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "Carnival's shares cruise to record after profit tops estimates "
    },
    {
        "content": "March 28 Carnival Corp  the world's largest cruise operator  reported a better-than-expected quarterly profit on Tuesday and raised its forecast for full-year earnings  sending its shares to a record high.",
        "date": "03282017",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "UPDATE 2-Carnival's shares cruise to record after profit tops estimates "
    },
    {
        "content": "March 28 Carnival Corp  the world's largest cruise operator  reported a 3.8 percent rise in quarterly revenue  helped by higher ticket prices and on-board spending.",
        "date": "03282017",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "Cruise operator Carnival's revenue rises 3.8 pct "
    },
    {
        "content": "Italian shipbuilder Fincantieri  and China State Shipbuilding Corp have agreed a $1.5 billion deal with Carnival Corp  to build two cruise ships for the fast-growing Chinese cruise market.",
        "date": "02222017",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "Fincantieri signs $1.5 billion China cruise ship deal with Carnival "
    },
    {
        "content": "* Carnival Corp - Cruise JV in China has signed a new memorandum of agreement to order first-ever cruise ships built in China for chinese market",
        "date": "02222017",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "BRIEF-Carnival Corp says Cruise JV in China signed MoA to order first-ever cruise ships built in China for Chinese market "
    },
    {
        "content": "Feb 22 Italian shipbuilder Fincantieri and China State Shipbuilding Corp have agreed with Carnival Corp  to build two cruise ships for the fast-growing Chinese cruise market under a $1.5 billion agreement.",
        "date": "02222017",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "Fincantieri signs $1.5 bln China cruise ship deal with Carnival "
    },
    {
        "content": "* Carnival Cruise Line - Carnival Cruise Line has now received approval to sail to Cuba  Source text for Eikon:  Further company coverage:",
        "date": "02142017",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "BRIEF-Carnival Cruise receives approval to sail to Cuba "
    },
    {
        "content": "* Wartsilä and Carnival Corporation announce strategic performance-based partnership",
        "date": "01252017",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "BRIEF-Finlands's Wartsila signs 12-yr maintenance deal with Carnival Corp "
    },
    {
        "content": "* SETS QUARTERLY DIVIDEND OF $0.35 PER SHARE  Source text for Eikon:  Further company coverage:",
        "date": "01192017",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "BRIEF-CARNIVAL CORP SETS QUARTERLY DIVIDEND OF $0.35 PER SHARE "
    },
    {
        "content": "* CARNIVAL CORPORATION TO BUILD TWO NEW CRUISE SHIPS WITH FINCANTIERI S.P.A.",
        "date": "01192017",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "BRIEF-CARNIVAL CORP TO BUILD TWO NEW CRUISE SHIPS WITH FINCANTIERI S.P.A. "
    },
    {
        "content": "Carnival Corp   the world's largest cruise operator  reported higher-than-expected quarterly revenue and profit  helped by an increase in ticket prices and onboard spending.",
        "date": "12202016",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "Carnival Corp quarterly profit  revenue beat estimates "
    },
    {
        "content": "WASHINGTON Carnival Corp's Princess Cruise Lines will plead guilty to seven felony charges for polluting the seas and deliberate acts to cover it up  and pay a record $40 million criminal penalty  the U.S. Justice Department said on Thursday.",
        "date": "12012016",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "Carnival Princess to pay record $40 million for pollution cover-up "
    },
    {
        "content": "WASHINGTON U.S. companies are looking for ways to persuade President-elect Donald Trump to soften his threats to cancel the Obama administration's opening to Cuba  a reversal they fear could cost them hundreds of millions of dollars.",
        "date": "11292016",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "U.S. companies hope Trump will stick to business roots  back Cuba ties "
    },
    {
        "content": "* Signs agreement with shell to fuel world's first LNG-powered cruise ships",
        "date": "10032016",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "BRIEF-Carnival Corporation signs agreement with Shell "
    },
    {
        "content": "Sept 26 - Carnival Corp  the world's largest cruise operator  reported its slowest quarterly growth in sales from ticket and onboard spending in six quarters  sending its shares down as much as 3 percent in morning trading.",
        "date": "09262016",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "UPDATE 2-Carnival issues cautious outlook  shares fall "
    },
    {
        "content": "Carnival Corp   the world's largest cruise operator  reported higher-than-expected quarterly profit and revenue and boosted its earnings forecast for the year as its benefits from strong demand for its cruises in North America and Europe.",
        "date": "09262016",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "Demand for North America  Europe cruises drives Carnival's results "
    },
    {
        "content": "* Carnival corporation & plc reports record third quarter earnings",
        "date": "09262016",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "BRIEF-Carnival corporation & plc reports record third quarter earnings "
    },
    {
        "content": "Sept 26 - Carnival Corp  the world's largest cruise operator  reported a 4.4 percent increase in quarterly revenue  helped by strong sales in North America and Europe.",
        "date": "09262016",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "Carnival Corp revenue rises on higher N. America  Europe sales "
    },
    {
        "content": "* Has created three original TV programs that will air on major networks on Saturday mornings beginning October 1  Source text for Eikon:  Further company coverage:",
        "date": "09192016",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "BRIEF-Carnival Corp has created three original TV programs "
    },
    {
        "content": "* Carnival Corporation's Fathom Brand Adds Two Cuba Cruise Dates In Fall 2016",
        "date": "09092016",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "BRIEF-Carnival Corp's Fathom brand adds two Cuba cruise dates in fall 2016 "
    },
    {
        "content": "* To Build Three New Lng Powered cruise ships with Meyer Werft and Meyer Turku",
        "date": "09062016",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "BRIEF-Carnival Corporation to build three new lng-powered cruise ships with Meyer Werft and Meyer Turku "
    },
    {
        "content": "* Carnival Corporation and Port Everglades extend landmark agreement to 2030",
        "date": "08162016",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "BRIEF-Carnival Corp and Port Everglades extend agreement to 2030 "
    },
    {
        "content": "* Carnival Corporation & Plc names Helen Deeble to board of directors  announces quarterly dividend",
        "date": "07142016",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "BRIEF-Carnival Corporation announces quarterly dividend "
    },
    {
        "content": "Carnival Corp   the world's largest cruise operator  reported a better-than-expected rise in quarterly revenue as it benefited from higher ticket prices and onboard spending and said it did not see any impact from \"Brexit\" this year.",
        "date": "06282016",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "Carnival cruises past estimates after hiking ticket prices "
    },
    {
        "content": "* CEO says \"no need to adjust\" guidance in response to \"Brexit\"",
        "date": "06282016",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "UPDATE 2-Carnival cruises past estimates after hiking ticket prices "
    },
    {
        "content": "June 28 Carnival Corp reported a 3.2 percent rise in quarterly revenue as the world's largest cruise operator gained from higher ticket prices and onboard spending.",
        "date": "06282016",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "Carnival Corp revenue rises on higher ticket prices "
    },
    {
        "content": "HAVANA Cuba said on Friday it would lift a ban on Cuban-born citizens entering and leaving the Caribbean island by commercial vessels  opening the way for U.S. cruise operator Carnival Corp to set sail for the country from Miami next week.",
        "date": "04222016",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "Cuba lifts sea ban for citizens  clears way for historic Carnival voyage "
    },
    {
        "content": "HAVANA  April 22 Cuba said on Friday it would lift a ban on Cuban-born citizens entering and leaving the Caribbean island by commercial vessels  opening the way for U.S. cruise operator Carnival Corp to set sail for the country from Miami next week.",
        "date": "04222016",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "UPDATE 3-Cuba lifts sea ban for citizens  clears way for historic Carnival voyage "
    },
    {
        "content": "* Carnival corporation to sail to cuba with all travelers  including cuban-born passengers",
        "date": "04222016",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "BRIEF-Carnival corporation to sail to cuba with all travelers "
    },
    {
        "content": "HAVANA Cruise company Carnival Corporation believes Cuba will soon modify rules that bar Cuban-Americans from traveling on its planned cruises to the island  the company said on Friday  after pressure mounted for the trip to be postponed.",
        "date": "04162016",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "Carnival expects Cuba to allow Cuban-Americans on inaugural cruise "
    },
    {
        "content": "April 18 U.S. cruise operator Carnival Corp  said it may delay its voyages to Cuba  scheduled to start on May 1  unless Cuban authorities allow Cuban-born Americans to travel in cruise ships as they are allowed in airlines.",
        "date": "04182016",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "UPDATE 1-Carnival Corp may delay start of Cuba cruises "
    },
    {
        "content": "HAVANA  April 15 Cruise company Carnival Corporation believes Cuba will soon modify rules that bar Cuban-Americans from travelling on its planned cruises to the island  the company said on Friday  after pressure mounted for the trip to be postponed.",
        "date": "04152016",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "Carnival expects Cuba to allow Cuban-Americans on inaugural cruise "
    },
    {
        "content": "HAVANA  April 15 Cruise company Carnival Corporation believes Cuba will soon modify rules that bar Cuban-Americans from travelling on its planned cruises to the island  the company said on Friday  after pressure mounted for the trip to be postponed.",
        "date": "04162016",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "UPDATE 1-Carnival expects Cuba to allow Cuban-Americans on inaugural cruise "
    },
    {
        "content": "April 18 U.S. cruise operator Carnival Corp  said it may delay its voyages to Cuba  scheduled to start on May 1  unless Cuban authorities allow cruise ships to operate in the same manner as air charter operations.",
        "date": "04182016",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "Carnival Corp may delay start of Cuba cruises "
    },
    {
        "content": "MIAMI U.S. Secretary of State John Kerry condemned Carnival Corp  on Thursday for barring Cuban-Americans from its planned cruises to Cuba and called on the Cuban government to change its policies to allow them.",
        "date": "04152016",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "John Kerry: Carnival should not bar Cuban-Americans from cruises to Cuba "
    },
    {
        "content": "MIAMI  April 14 U.S. Secretary of State John Kerry said on Thursday that Carnival Corp should not bar Cuban-Americans from cruises to Cuba.",
        "date": "04142016",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "Kerry: Carnival should not bar Cuban-Americans from cruises to Cuba "
    },
    {
        "content": "* Declared a dividend of $0.35 per share  an increase of 17 percent",
        "date": "04142016",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "BRIEF-Carnival Corp increases quarterly dividend by 17 pct "
    },
    {
        "content": "PERTH  April 14 The world's top producers of liquefied natural gas (LNG) are investing in ship-fuelling operations  floating import terminals and power plants to open new markets and keep from drowning in a fuel surplus expected to last into the next decade.",
        "date": "04142016",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "Global LNG producers look to open new markets to soak up surplus "
    },
    {
        "content": "* Carnival Corp finalizes contracts with Fincantieri to build five new cruise ships",
        "date": "04042016",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "BRIEF-Carnival Corp finalizes contracts with Fincantieri to build 5 new cruise ships "
    },
    {
        "content": "The following factors could affect Italian markets on Monday.",
        "date": "04042016",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "Italy - Factors to watch on April 4 "
    },
    {
        "content": "* Q1 adj shr 39 cents vs est. of 32 cents   (Adds details from conference call  analyst comment; updates shares)",
        "date": "03302016",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "UPDATE 2-Carnival profit beats; says no impact from Brussels attacks "
    },
    {
        "content": "March 30 Carnival Corp's quarterly revenue rose 3.4 percent  helped by higher prices and bookings.",
        "date": "03302016",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "Carnival Corp quarterly revenue rises 3.4 pct "
    },
    {
        "content": "March 21 Cruise operator Carnival Corp  said on Monday it received approval from Cuban authorities to begin operations to the country  starting May 1.",
        "date": "03212016",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "Carnival Corp gets Cuba's approval to begin cruises "
    },
    {
        "content": "* Carnival corporation's fathom granted approval by cuba to cruise from u.s. To cuba  Source text for Eikon:  Further company coverage:",
        "date": "03212016",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "BRIEF-Carnival Corp says Fathom granted approval by Cuba to cruise from U.S. to Cuba "
    },
    {
        "content": "* Signs memorandum of agreement with \u007fCarnival Corporation & plc for the construction of four cruise ships for the total value of 2.5 billion euros ($2.73 billion)\u007f  Source text for Eikon:  Further company coverage:   ($1 = 0.9166 euros)   (Gdynia Newsroom)",
        "date": "12302015",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "BRIEF-Fincantieri signs MoA with Carnival Corp to build 4 cruise ships "
    },
    {
        "content": "Oct 21 Cruise operator Carnival Corp   said it has formed a 2.6-billion-pound ($4 billion) joint venture with two Chinese state-owned firms to launch a cruise line focused on the fast-growing Chinese market.",
        "date": "10212015",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "China firms  Carnival Corp form JV to launch Chinese cruise line "
    },
    {
        "content": "Carnival Corp   the world's largest cruise ship operator  issued a profit forecast for the current quarter that missed analysts' estimates  overshadowing better-than-expected third quarter results.",
        "date": "09222015",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "Carnival's weak forecast overshadows better-than-expected results "
    },
    {
        "content": "* Shares down as much as 5.7 pct   (Adds CEO comments  details)",
        "date": "09222015",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "UPDATE 3-Carnival's weak forecast overshadows better-than-expected results "
    },
    {
        "content": "ST. THOMAS  U.S. Virgin Islands  Sept 8 An engine fire on board a cruise ship operated by Carnival Corp  left about 4 500 passengers and crew stranded in the U.S. Virgin Islands for a second day on Tuesday and forced the cruise operator to cut the trip short.",
        "date": "09092015",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "REFILE-UPDATE 1-Cruise ship fire leaves guests stranded on Caribbean island "
    },
    {
        "content": "ST. THOMAS  U.S. Virgin Islands  Sept 8 An engine fire on board a cruise ship operated by Carnival Corp  left about 4 500 passengers and crew stranded in the U.S. Virgin Islands for a second day on Tuesday and forced the cruise operator to cut the trip short.",
        "date": "09082015",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "UPDATE 1-Cruise ship fire leaves guests stranded on Caribbean island "
    },
    {
        "content": "ST. THOMAS  U.S. Virgin Islands  Sept 8 About 4 500 passengers and crew were stranded in the U.S. Virgin Islands for a second day after an engine fire on board a cruise ship operated by Carnival Corp.",
        "date": "09082015",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "Cruise ship fire leaves guests stranded on Caribbean island "
    },
    {
        "content": "WASHINGTON  July 23 Carnival Corp will pay a $55 000 penalty and $350 000 in damages over alleged accessibility violations for people with disabilities on its cruise ships  the Justice Department said on Thursday.",
        "date": "07232015",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "Carnival Corp reaches settlement with U.S. over alleged disability violations "
    },
    {
        "content": "MIAMI Carnival Corp  has won U.S. approval to operate culturally-themed cruises to Cuba and plans to start taking travelers there next May  joining a growing list of maritime companies hoping to profit from a thaw in relations between Washington and Havana.",
        "date": "07072015",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "Carnival aims to start 'cultural' Cuba cruises next May "
    },
    {
        "content": "MIAMI  July 7 Carnival Corp has won U.S. approval to operate culturally-themed cruises to Cuba and plans to start taking travelers there next May  joining a growing list of maritime companies hoping to profit from a thaw in relations between Washington and Havana.",
        "date": "07072015",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "UPDATE 4-Carnival aims to start 'cultural' Cuba cruises next May "
    },
    {
        "content": "July 7 Carnival Corp  the world's largest cruise operator  said it had received U.S. approvals to operate cruises to Cuba and planned to start in May.",
        "date": "07072015",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "Carnival gets US approval to operate Cuba cruises "
    },
    {
        "content": "June 23 Carnival Corp's quarterly profit more than doubled due to lower fuel costs.",
        "date": "06232015",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "Carnival profit more than doubles "
    },
    {
        "content": "MIAMI  June 4 Carnival Corp will tap into the volunteer tourism market with week-long trips beginning in 2016 that include up to three days of organized humanitarian work in the Dominican Republic  the company announced on Thursday.",
        "date": "06042015",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "Carnival launches cruises for tourists who want volunteer work "
    },
    {
        "content": "ORLANDO Carnival Corp will tap into the volunteer tourism market with week-long trips beginning in 2016 that include up to three days of organized humanitarian work in the Dominican Republic  the company announced on Thursday.",
        "date": "06052015",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "Carnival launches cruises for tourists who want volunteer work "
    },
    {
        "content": "ORLANDO  June 4 Carnival Corp will tap into the volunteer tourism market with week-long trips beginning in 2016 that include up to three days of organized humanitarian work in the Dominican Republic  the company announced on Thursday.",
        "date": "06052015",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "REFILE-Carnival launches cruises for tourists who want volunteer work "
    },
    {
        "content": "Carnival Corp  reported a better-than-expected quarterly profit  helped by higher onboard spending and lower fuel prices  and the company said bookings for Caribbean cruises  its biggest business  were strong for the rest of the year.",
        "date": "03272015",
        "name": "Carnival Corporation",
        "news_type": "topStory",
        "symbol": "CCL",
        "title": "Carnival profit beats as onboard spending rises  fuel costs fall "
    },
    {
        "content": "* Shares rise as much as 7 pct   (Adds details from conference call  analyst comment; updates shares)",
        "date": "03272015",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "UPDATE 2-Carnival profit beats as onboard spending rises  fuel costs fall "
    },
    {
        "content": "March 27 Carnival Corp  the world's largest cruise operator by revenue  swung to a quarterly profit  helped by lower costs.",
        "date": "03272015",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "REFILE-Carnival Corp swings to profit as costs fall "
    },
    {
        "content": "* Announces order for five next-generation ships for Carnival Corporation",
        "date": "03272015",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "BRIEF-Fincantieri to build five ships for Carnival Corporation "
    },
    {
        "content": "SHANGHAI  Jan 27 Cruise operator Carnival Corp   is in talks with state-owned China Merchants Group Ltd (CMG) to develop a new cruise line for the fast-growing China market  the U.S. firm said in a statement on Tuesday.",
        "date": "01272015",
        "name": "Carnival Corporation",
        "news_type": "normal",
        "symbol": "CCL",
        "title": "Carnival eyes new China line for burgeoning cruise market "
    }
]