[
    {
        "content": "* Air France  Vietnam Airlines j/v to start Nov. 1 (Adds quote from Vietnam Airlines CEO)",
        "date": "10102017",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "UPDATE 2-Air France continues long-haul drive with Vietnam Airlines joint venture "
    },
    {
        "content": "* Air France-KLM says regulatory approvals of completion of capital increases reserved to China Eastern Airlines and Delta Air Lines",
        "date": "09272017",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "BRIEF-Air France-KLM says capital increases reserved to China Eastern Airlines and Delta Air Lines approved "
    },
    {
        "content": "SHANGHAI  Sept 27 Chinese stocks held steady on Wednesday  bolstered by strong gains in resources shares after upbeat industrial profit data and a robust earnings forecast by a major steelmaker helped to ease worries about slowing economic growth.",
        "date": "09272017",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "China stocks steady as strong industrial profits temper slowdown fears "
    },
    {
        "content": "SHANGHAI  Sept 27 Chinese and Hong Kong stocks were firm in Wednesday trade  with resources shares rebounding sharply after China's upbeat August industrial profit data and robust earnings forecast by a major steelmaker helped ease fears of China's economic recovery losing steam.",
        "date": "09272017",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "China  HK stocks steady as upbeat industrial data eases slowdown fears "
    },
    {
        "content": "* REG-AIR FRANCE - KLM : EQUITY INVESTMENT OF CHINA EASTERN AND DELTA AIR LINES IN AIR FRANCE-KLM'S SHARE CAPITAL APPROVED BY MORE THAN 94% OF THE SHAREHOLDERS' VOTING CAST Source text for Eikon: Further company coverage: (Gdynia Newsroom:)",
        "date": "09042017",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "BRIEF-Shareholders approve equity investment of China Eastern and Delta Air Lines in Air France-KLM "
    },
    {
        "content": "* S.Korea one of Chinese airlines' most profitable destinations",
        "date": "08272017",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "Korean peninsula crisis to trim Chinese airline profits "
    },
    {
        "content": "SINGAPORE/SHANGHAI China Eastern Airlines Corp Ltd said on Friday it is buying a 10 percent stake in Europe's Air France KLM SA  in what will be the first investment by one of China's three largest state-owned airlines in a Western carrier.",
        "date": "07282017",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "China Eastern buying 10 percent Air France KLM stake as part of airline JVs' rejig "
    },
    {
        "content": "* Investment compatible with \"Belt and Road\": China Eastern (Recasts  adds analyst comment)",
        "date": "07282017",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "UPDATE 1-China Eastern buying 10 pct Air France KLM stake as part of airline JVs' rejig "
    },
    {
        "content": "SINGAPORE  July 28 China Eastern Airlines Corp Ltd said on Friday it would buy a 10 percent stake in European carrier Air France KLM SA and form a strategic partnership to improve its presence in the China-Europe market.",
        "date": "07282017",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "China Eastern buys 10 pct Air France KLM stake to boost European presence "
    },
    {
        "content": "* REG-AIR FRANCE-KLM EXPANDS ITS ALLIANCES BETWEEN THE NORTH ATLANTIC  EUROPE AND ASIA  AND AFFIRMS ITS POSITION IN THE WORLDWIDE AIRLINE INDUSTRY",
        "date": "07272017",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "BRIEF-Air France signs JV with Delta and Virgin Atlantic  strengthens partnership with China Eastern "
    },
    {
        "content": "* Chinese aviation sector's first mixed-ownership reform deal",
        "date": "06192017",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "UPDATE 1-China Eastern sells stakes in cargo unit to four firms "
    },
    {
        "content": "BEIJING  June 13 China's aviation regulator said on Tuesday it will join other authorities to investigate an incident this week that forced a China Eastern Airlines plane to return to an airport soon after takeoff  the Xinhua state news agency reported.",
        "date": "06132017",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "China aviation regulator to join probe of China Eastern incident - Xinhua "
    },
    {
        "content": "* \"I was really scared. Our group was terrified\" - passenger (Adds details in paragraphs 5 and 10)",
        "date": "06122017",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "UPDATE 2-China Eastern flight lands safely in Sydney with hole torn in engine "
    },
    {
        "content": "May 31 China Aircraft Leasing Group Holdings Ltd :",
        "date": "05312017",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "BRIEF-China Aircraft Leasing says entered into agreements with China Eastern Airlines "
    },
    {
        "content": "SHANGHAI  Nov 14 China Eastern Airlines   said it has applied for government permission to operate as an investment firm - a move that would allow it to reduce its reliance on ticket sales and diversify into other businesses.",
        "date": "11142016",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "China Eastern Airlines seeks govt approval to become investment firm "
    },
    {
        "content": "SHANGHAI  Aug 31 China Eastern Airlines Corp Ltd   said on Wednesday it has signed a code-sharing deal with British Airways (BA) for flights on seven Chinese and seven British routes  a move China Eastern said could boost sales outside its home base.",
        "date": "08312016",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "China Eastern sign code-share deal with British Airways to boost sales overseas "
    },
    {
        "content": "LONDON British engineering company Rolls-Royce  said it won a $1.5 billion order for its Trent 700 engines from China Eastern Airlines  to power 15 of the Chinese carrier's Airbus  A330 aircraft.",
        "date": "08242016",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "Rolls-Royce wins $1.5 billion engine order with China Eastern Airlines "
    },
    {
        "content": "LONDON  Aug 24 British engineering company Rolls-Royce said it won a $1.5 billion order for its Trent 700 engines from China Eastern Airlines to power 15 of the Chinese carrier's Airbus A330 aircraft.",
        "date": "08242016",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "Rolls-Royce wins $1.5 bln engine order with China Eastern Airlines "
    },
    {
        "content": "BEIJING  July 5 China Eastern Airlines Corp  has raised 8.55 billion yuan ($1.28 billion) in a private sale of shares to a group of investors including China's biggest online travel agency Ctrip  which becomes the airline's fifth-biggest shareholder.",
        "date": "07052016",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "China Eastern raises $1.3 bln in private share placement "
    },
    {
        "content": "* Boeing  China Eastern Airlines finalize order for 15 787-9 dreamliners  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04282016",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "BRIEF-Boeing  China Eastern Airlines finalize order for 15 787-9 dreamliners "
    },
    {
        "content": "ATLANTA  April 29 Delta Air Lines Inc  sees opportunities for the airlines in which it owns equity stakes to cooperate more in the next five years  Delta's incoming Chief Executive Ed Bastian told reporters in Atlanta on Friday.",
        "date": "04292016",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "Delta Air sees chance for equity partners to cooperate more - incoming CEO "
    },
    {
        "content": "BEIJING  April 21 Ctrip.com International Ltd   China's biggest online travel agency  has agreed to invest 3 billion yuan ($463 million) in China Eastern Airlines  through a private share placement.",
        "date": "04212016",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "China's Ctrip to invest $463 mln in China Eastern Airlines "
    },
    {
        "content": "* Strategic collaboration between Ctrip and China Eastern Air Holding Company",
        "date": "04212016",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "BRIEF-Ctrip says agreed to invest RMB3 billion in China Eastern Airlines' "
    },
    {
        "content": "* Says controlling shareholder China Eastern Air Holding signs strategic agreement with Ctrip.com International",
        "date": "04212016",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "BRIEF-China Eastern Airlines' controlling shareholder signs strategic agreement with Ctrip "
    },
    {
        "content": "SHANGHAI  April 15 China Eastern Airlines   plans to expand its fleet of aircraft to more than 800 by 2020  up from 561 as of the end of 2015  its president Ma Xulun said in an interview on Friday.",
        "date": "04152016",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "UPDATE 1-China Eastern to expand fleet to over 800 aircraft "
    },
    {
        "content": "SHANGHAI  April 15 China Eastern Airlines   plans to expand its fleet of aircraft to more than 800 by 2020  up from 561 as of the end of 2015  its president Ma Xulun said in an interview on Friday.",
        "date": "04152016",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "China Eastern to expand fleet to over 800 aircraft by 2020 vs 561 at end-2015 -Pres "
    },
    {
        "content": "* China Eastern Airlines Corp' Qingdao subsidiary capitalized at 2.7 billion yuan ($417.55 million)",
        "date": "03312016",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "BRIEF-China eastern airlines to form new subsidiary airline - state assets supervisor "
    },
    {
        "content": "BEIJING  Sept 30 China Eastern Airlines  is seeking buyers for its  remaining 5 percent stake in loss-making Joy Air  a small domestic airline that has been blighted by safety concerns over its propeller-powered planes.",
        "date": "09302015",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "China Eastern to sell off 5 pct stake in loss-making Joy Air "
    },
    {
        "content": "* Competes with Airbus in key Chinese market   (Adds details of deals  industry background)",
        "date": "09232015",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "UPDATE 2-Boeing to sell 300 jets to China firms  set up China plant-Xinhua "
    },
    {
        "content": "* CEO  speaking in Shanghai  says decision to invest in China Eastern Airlines Corp Ltd \"quick and easy\" despite recent stock market volatility    (Reporting by Christopher Cushing)",
        "date": "09012015",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "BRIEF-Delta Air CEO: Decision to invest in China Eastern \"quick  easy\" "
    },
    {
        "content": "SHANGHAI  Sept 1 China Eastern Airlines Corp's  Chairman Liu Shaoyong said on Tuesday that the carrier's equity deal with Delta Air Lines will give the U.S. airline an opportunity to extend code-sharing in China's domestic network.",
        "date": "09012015",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "China Eastern chmn says equity tie gives Delta new code-share opening in China network "
    },
    {
        "content": "SYDNEY  Aug 21 An Australian regulator reversed an earlier decision and cleared a code-sharing deal between Qantas Airways Ltd and China Eastern Airlines Corp Ltd  after the carriers agreed to increase flights between their countries by a fifth.",
        "date": "08212015",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "Australian regulator clears Qantas  China Eastern alliance "
    },
    {
        "content": "BEIJING Delta Air Lines Inc  has agreed to buy 3.55 percent of China Eastern Airlines Corp Ltd   a move that would make it the first U.S. carrier to own part of a Chinese airline.",
        "date": "07272015",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "Delta to buy 3.55 percent stake of China Eastern for $450 million "
    },
    {
        "content": "BEIJING  July 27 Delta Air Lines Inc has agreed to buy 3.55 percent of China Eastern Airlines Corp Ltd    a move that would make it the first U.S. carrier to own part of a Chinese airline.",
        "date": "07272015",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "UPDATE 2-Delta to buy 3.55 pct stake of China Eastern for $450 mln "
    },
    {
        "content": "BEIJING  July 27 Delta Air Lines has agreed to buy an estimated 3.55-percent stake in China Eastern Airlines  for $450 million  the Chinese operator said in stock filing on Monday.",
        "date": "07272015",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "RPT-Delta to buy 3.55 pct stake of China Eastern for $450 mln "
    },
    {
        "content": "BEIJING/SHANGHAI  July 28 China Eastern Airlines  plans to work with new investor Delta Air Lines  to expand its global footprint beyond China-U.S. routes  an executive from the Shanghai-based carrier said.",
        "date": "07282015",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "China Eastern says looks beyond U.S.-China routes with Delta stake deal "
    },
    {
        "content": "BEIJING  July 27 Delta Air Lines has agreed to buy an estimated 3.55-percent stake in China Eastern Airlines  for $450 million  the Chinese operator said in stock filing on Monday.",
        "date": "07272015",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "Delta to buy 3.55 pct stake of China Eastern for $450 mln "
    },
    {
        "content": "BEIJING  July 28 Air China Ltd said on Tuesday it aims to raise up to 12 billion yuan ($1.93 billion) in a private placement of A-shares to help fund the purchase of 15 Boeing planes and upgrade its direct sales service.",
        "date": "07282015",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "Air China to raise up to 12 bln yuan to fund plane order "
    },
    {
        "content": "* Says Delta Air Lines agrees to acquire 465.91 million new H-shares for HK$3.49 billion ($450.30 million)",
        "date": "07272015",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "BRIEF-Delta Air agrees to acquire China Eastern's new H-shares "
    },
    {
        "content": "* China Eastern Airlines falls after Delta agrees to buy stake",
        "date": "07282015",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "normal",
        "symbol": "CEA",
        "title": "China stocks fall as Beijing renews support  Hong Kong up "
    },
    {
        "content": "BEIJING  July 17 China Aircraft Leasing Group Holdings said late on Thursday it will lease six aircraft to China Eastern Airlines.",
        "date": "07172015",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "CALG to lease six Airbus planes to China Eastern "
    },
    {
        "content": "* Says aims to raise up to 15 billion yuan ($2.42 billion) in private placement of A-shares to buy 28 aircrafts  repay bank loans",
        "date": "06162015",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "BRIEF-China Eastern Airlines plans private placement to fund aircraft purchase "
    },
    {
        "content": "* Headache in PM Abbott's efforts to boost Beijing trade   (Recasts lede  adds share price  Qantas and analyst comments)",
        "date": "03242015",
        "name": "China Eastern Airlines Corporation Ltd",
        "news_type": "topStory",
        "symbol": "CEA",
        "title": "UPDATE 2-Australia watchdog says may reject Qantas  China Eastern tie-up "
    }
]