[
    {
        "content": "* Celgene Corp and bluebird bio announce bb2121 anti-BCMA CAR-T cell therapy has been granted Breakthrough Therapy designation from FDA and prime eligibility from EMA for relapsed and refractory multiple myeloma",
        "date": "11162017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene Corp and bluebird bio announce bb2121 anti-BCMA CAR-T cell therapy has been granted Breakthrough Therapy designation from FDA "
    },
    {
        "content": "The U.S. Justice Department is opposing a former Celgene Corp sales manager's request for a nearly $77.8 million share of a recent $280 million settlement with the drugmaker  saying the sum would amount to an \"inappropriate windfall.\"",
        "date": "11152017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "U.S. opposes 'windfall' award to Celgene whistleblower "
    },
    {
        "content": "A former Celgene Corp sales manager has urged a federal judge to dismiss a lawsuit by law firm Grant & Eisenhofer  which is seeking a cut of a $280 million settlement of a whistleblower lawsuit in which it previously represented her.",
        "date": "11142017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Celgene whistleblower seeks dismissal of law firm's lawsuit "
    },
    {
        "content": "* Temasek Holdings (Private) Ltd ups share stake in Mastercard to 923 068 class a shares from 267 006 class a shares",
        "date": "11142017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Temasek Holdings (Private) Ltd ups share stake in Mastercard  Visa and Monsanto "
    },
    {
        "content": "* Celgene Corp - ‍announced pricing of three series of senior unsecured notes for aggregate principal amount of $3 000 million​ Source text for Eikon: Further company coverage: (Bangalore.newsroom@thomsonreuters.com)",
        "date": "11012017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene prices $3 billion of senior unsecured notes "
    },
    {
        "content": "* Celgene-To use proceeds for repayment of $1 billion outstanding 2.125% senior notes & $400 million outstanding 2.300% senior notes  each maturing Aug 2018​ Source text for Eikon: Further company coverage:",
        "date": "10312017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene announces offering of senior unsecured notes "
    },
    {
        "content": "* Lannett and Celgene enter into settlement and license agreement related to Thalomid",
        "date": "10302017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Lannett and Celgene enter into settlement and license agreement related to Thalomid "
    },
    {
        "content": "* Celgene Corp says ‍​in Aug  co received an order issued by the Federal Court in Ottawa  Ontario  Canada at request of Canadian Competition Bureau",
        "date": "10262017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene Corp updates on court order at request of Canadian Competition Bureau - SEC filing "
    },
    {
        "content": "Celgene Corp on Thursday reported third-quarter sales of its key psoriasis drug Otezla that badly missed expectations and significantly scaled down its 2020 targets for product sales and earnings  sending its shares tumbling 18 percent.",
        "date": "10262017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene cuts 2020 outlook  Otezla sales disappoint; shares plunge "
    },
    {
        "content": "Oct 26 Celgene Corp on Thursday reported third-quarter sales of its key psoriasis drug Otezla that badly missed expectations and significantly scaled down its 2020 targets for product sales and earnings  sending its shares tumbling 18 percent.",
        "date": "10262017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 5-Celgene cuts 2020 outlook  Otezla sales disappoint; shares plunge "
    },
    {
        "content": "* U.S. Senate passes budget plan that could usher in tax reform",
        "date": "10202017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "GLOBAL MARKETS-U.S. tax plan hopes lift stocks  dollar strengthens "
    },
    {
        "content": "* Commodities stocks  staples support index (Udpates prices  adds detail)",
        "date": "10262017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 1-FTSE 100 gets sterling boost while Barclays dives after results "
    },
    {
        "content": "* U.S. Senate passes budget plan that could usher in tax reform",
        "date": "10202017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "GLOBAL MARKETS-U.S. tax plan hopes lift stocks  strengthen dollar "
    },
    {
        "content": "* Celgene CFO says initiating share repurchase plan beginning immediately Source text for Eikon: Further company coverage: (Reporting By Bill Berkrot)",
        "date": "10262017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Celgene initiating share repurchase plan "
    },
    {
        "content": "* Celgene reports third quarter 2017 operating and financial results",
        "date": "10262017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Celgene reports Q3 earnings per share of $1.21 "
    },
    {
        "content": "Oct 26 Celgene Corp said its third-quarter profit was nearly six times higher than a year ago  helped by a rise in sales of its multiple myeloma drug Revlimid as well as lower costs.",
        "date": "10262017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene posts higher quarterly profit "
    },
    {
        "content": "Celgene Corp said it would abandon testing a drug to treat Crohn's disease  in a major setback to the U.S. biotechnology company's pipeline amid attempts to lower dependence on its mainstay Revilimid.",
        "date": "10192017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Celgene abandons Crohn's drug trials  shares drop "
    },
    {
        "content": "Oct 19 Celgene Corp said it would abandon testing a drug to treat Crohn's disease  in a major setback to the U.S. biotechnology company's pipeline amid attempts to lower dependence on its mainstay Revilimid.",
        "date": "10192017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 2-Celgene abandons Crohn's drug trials  shares drop "
    },
    {
        "content": "Oct 19 Celgene Corp said on Thursday it would stop two studies of its drug for an inflammatory bowel disease and would not begin a third  following a recommendation by a data monitoring committee.",
        "date": "10192017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene abandons Crohn's disease drug trials "
    },
    {
        "content": "* Celgene provides update on GED-0301 (mongersen) inflammatory bowel disease program",
        "date": "10192017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Celgene provides update on GED-0301 (mongersen) inflammatory bowel disease program "
    },
    {
        "content": "A former Grant & Eisenhofer lawyer has asked a federal judge in Washington D.C. to toss out the firm's \"recklessly false\" claims that he unlawfully poached a client in a whistleblower case against Celgene Corp that recently settled for $280 million.",
        "date": "10122017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Former Grant & Eisenhofer lawyer says he didn't poach Celgene whistleblower "
    },
    {
        "content": "* ‍Evotec achieves first milestone in neurodegeneration alliance with Celgene​",
        "date": "10102017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Evotec achieves first milestone in neurodegeneration alliance with Celgene​‍​ "
    },
    {
        "content": "* Says ‍announced today that its strategic alliance with celgene has reached a first milestone triggering revenues of $ 5.0 m to evotec  which are recognised in q3 of 2017​ Source text for Eikon: Further company coverage: (Frankfurt newsroom)",
        "date": "10102017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Evotec receives $5 million milestone in Celgene alliance "
    },
    {
        "content": "* Nimbus therapeutics and Celgene enter long-term strategic immunology alliance to develop programs for patients with autoimmune disorders",
        "date": "10032017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene and Nimbus Therapeutics enter long-term strategic immunology alliance to develop programs for patients with autoimmune disorders "
    },
    {
        "content": "* Bluebird Bio Inc - to receive $15 million option exercise payment from Celgene​",
        "date": "09282017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Bluebird Bio says to receive $15 mln option exercise payment from Celgene​ "
    },
    {
        "content": "* Acceleron Pharma - on September 18  2017  co and Celgene Corporation entered into an amended and restated collaboration  license and option agreement",
        "date": "09192017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Acceleron Pharma says entered into an agreement with Celgene Corp "
    },
    {
        "content": "* Alvogen subsidiary confirms ANDA filing and patent challenge for generic Revlimid",
        "date": "09112017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Alvogen unit confirms ANDA filing and patent challenge for generic Revlimid "
    },
    {
        "content": "* Data presented at ESMO 2017 further evaluate role of Abraxane® for patients with historically challenging cancers Source text for Eikon: Further company coverage:",
        "date": "09082017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene's ESMO data further evaluates drug's potential to treat various cancers "
    },
    {
        "content": "U.S. health regulators stopped five blood cancer trials testing AstraZeneca Plc's immunotherapy Imfinzi in combination with Celgene Corp medicines from accepting new patients  and halted another study entirely  the companies said on Thursday.",
        "date": "09072017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "FDA widens holds on immunotherapy combination blood cancer trials "
    },
    {
        "content": "Sept 7 U.S. health regulators stopped five blood cancer trials testing AstraZeneca Plc's immunotherapy Imfinzi in combination with Celgene Corp medicines from accepting new patients  and halted another study entirely  the companies said on Thursday.",
        "date": "09072017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 2-FDA widens holds on immunotherapy combination blood cancer trials "
    },
    {
        "content": "Sept 7 Celgene Corp said on Thursday the U.S. Food and Drug Administration had placed a partial clinical hold on the company's five trials and a full clinical hold on one trial.",
        "date": "09072017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "FDA puts Celgene's multiple cancer trials on hold "
    },
    {
        "content": "* ‍Patients enrolled in trials on partial clinical hold who are receiving clinical benefit from treatment as determined by investigator may remain on treatment​",
        "date": "09072017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Celgene provides update on the Fusion clinical program "
    },
    {
        "content": "* Celgene Corp reports 5.6 percent passive stake in BeiGene as of Aug 31 - SEC filing‍​ Source text : (http://bit.ly/2guND0F) Further company coverage:",
        "date": "09012017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene Corp reports 5.6 percent passive stake in BeiGene as of Aug 31 - SEC filing‍​ "
    },
    {
        "content": "* Celgene Corporation exercised option to extend strategic collaboration scope and term with Forma Therapeutics Source text for Eikon: Further company coverage:",
        "date": "08292017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene exercised option to extend collaboration with Forma Therapeutics "
    },
    {
        "content": "Plaintiffs' law firm Grant & Eisenhofer on Thursday sued a former partner who it said engaged in a \"treacherous\" scheme to steal a client pursuing a whistleblower lawsuit against Celgene Corp that recently settled for $280 million.",
        "date": "08242017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Grant & Eisenhofer accuses ex-partner of stealing Celgene whistleblower client "
    },
    {
        "content": "Plaintiffs' law firm Grant & Eisenhofer has sued a former Celgene Corp sales manager and the lawyers who represented her in a whistleblower lawsuit against the drugmaker  claiming it is owed a cut of a recent $280 million settlement in the case.",
        "date": "08142017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Grant & Eisenhofer sues for cut of $280 million Celgene settlement "
    },
    {
        "content": "* Temasek Holdings (Private) Ltd takes share stake in JPMorgan Chase & Co of 264 337 shares",
        "date": "08142017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Temasek Holdings takes stake in JPMorgan  Biogen  Celgene "
    },
    {
        "content": "* Celgene Corp - on August 10  2017  co issued $500 million aggregate principal amount of 2.250% senior notes due 2021 - SEC filing Source text - (http://bit.ly/2hNCc4D) Further company coverage:",
        "date": "08102017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene Corp says on August 10  co issued $500 million aggregate principal amount of 2.250% senior notes due 2021 "
    },
    {
        "content": "Aug 1 The U.S. Food and Drug Administration (FDA) on Tuesday approved Celgene Corp and Agios Pharmaceuticals Inc's    treatment for acute myeloid leukemia (AML) patients with a specific genetic mutation.",
        "date": "08012017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "FDA approves leukemia treatment developed by Celgene  Agios "
    },
    {
        "content": "* Oppenheimer estimates Idhifa sales of $1.4 bln in 2021 (Adds pricing details  analyst comments and share move)",
        "date": "08012017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 2-FDA approves leukemia treatment developed by Celgene  Agios "
    },
    {
        "content": "The U.S. Justice Department said on Tuesday that Celgene Corp  had agreed to pay $280 million to settle a lawsuit that accused the company of promoting its cancer drugs Revlimid and Thalomid for off-label uses.",
        "date": "07252017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Celgene to pay $280 million to settle off-label marketing case "
    },
    {
        "content": "July 25 The U.S. Justice Department said on Tuesday that Celgene Corp had agreed to pay $280 million to settle a lawsuit that accused the company of promoting its cancer drugs Revlimid and Thalomid for off-label uses.",
        "date": "07252017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene to pay $280 mln to settle off-label marketing case "
    },
    {
        "content": "Celgene Corp rode its flagship multiple myeloma drug Revlimid and a rebound in sales of Otezla for psoriasis to a modestly higher-than-expected second-quarter profit and raised its full-year earnings forecast on Thursday.",
        "date": "07272017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Revlimid drives Celgene profit beat; raises EPS forecast "
    },
    {
        "content": "July 27 Celgene Corp rode its flagship multiple myeloma drug Revlimid and a rebound in sales of Otezla for psoriasis to a modestly higher-than-expected second-quarter profit and raised its full-year earnings forecast on Thursday.",
        "date": "07272017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 3-Revlimid drives Celgene profit beat; raises EPS forecast "
    },
    {
        "content": "July 27 Celgene Corp reported a 77.4 percent rise in quarterly profit on Thursday  helped by higher sales of its flagship cancer drug  Revlimid.",
        "date": "07272017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene's profit rises 77.4 pct on Revlimid demand "
    },
    {
        "content": "* Dermavant Sciences appoints Dr. Jacqualyn Fouse as executive chairman",
        "date": "07102017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Dermavant Sciences names Celgene's ex-COO Jacqualyn fouse executive chairman "
    },
    {
        "content": "Celgene Corp  said it would buy a stake in BeiGene Ltd  to help develop and commercialize the China-based cancer immunotherapy developer's treatment for solid tumor cancers  expanding its position in the field of immuno-oncology.",
        "date": "07062017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Celgene signs deal with BeiGene for tumor cancer treatment "
    },
    {
        "content": "July 5 Biopharmaceutical company Celgene Corp will buy a stake in BeiGene Ltd and help develop and commercialize BeiGene's investigational treatment for tumor cancers  the companies said on Wednesday.",
        "date": "07062017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene to buy BeiGene stake  to develop tumor cancer treatment "
    },
    {
        "content": "* Celgene Corporation enters into global strategic immuno-oncology collaboration with BeiGene to advance PD-1 inhibitor program for solid tumor cancers",
        "date": "07062017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Celgene enters collaboration with BeiGene to advance inhibitor program for solid tumor cancers "
    },
    {
        "content": "Merck & Co  said on Wednesday the U.S. Food and Drug Administration had placed a clinical hold on three multiple myeloma studies testing its Keytruda in combination with other medicines for the blood cancer after more deaths were reported in patients receiving the Merck immunotherapy.",
        "date": "07062017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "FDA puts hold on Merck multiple myeloma trials after deaths "
    },
    {
        "content": "* Bluebird Bio and Celgene Corporation announce updated clinical results from ongoing first-in-human multicenter study of bb2121 anti-bcma car t cell therapy in relapsed/refractory multiple myeloma at ASCO annual meeting",
        "date": "06052017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Bluebird Bio  Celgene Corp announce updated clinical results from ongoing first-in-human multicenter study "
    },
    {
        "content": "* Celgene and Acceleron complete target enrollment in the medalist and believe Phase 3 studies of luspatercept in myelodysplastic syndromes and beta-thalassemia",
        "date": "06012017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene and Acceleron complete enrollment in MEDALIST  BELIEVE Phase 3 studies of luspatercept "
    },
    {
        "content": "Celgene Corp's multiple sclerosis drug met the main goal of reducing annualized relapse rate  compared with Biogen Inc's Avonex  in a second late-stage trial  but failed to outperform Avonex in slowing disability progression rate.",
        "date": "05222017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Celgene MS drug clears key trial  but disability data falls short "
    },
    {
        "content": "May 22 Celgene Corp's multiple sclerosis drug met the main goal of reducing annualized relapse rate  compared with Biogen Inc's Avonex  in a second late-stage trial  but failed to outperform Avonex in slowing disability progression rate.",
        "date": "05222017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 2-Celgene MS drug clears key trial  but disability data falls short "
    },
    {
        "content": "May 22 Celgene Corp said its oral drug to treat relapsing multiple sclerosis met the main goal of reducing annualized relapse rate  when compared to Biogen Inc's Avonex  in a second late-stage study.",
        "date": "05222017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene's multiple sclerosis drug succeeds in late-stage trial "
    },
    {
        "content": "* Celgene announces positive results from radiance  the second pivotal phase III trial of oral ozanimod in patients with relapsing multiple sclerosis",
        "date": "05222017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Celgene announces positive results from radiance "
    },
    {
        "content": "May 17 Nearly 20 percent of patients with an aggressive form of leukemia experienced complete remission along with prolonged survival from treatment with an experimental Celgene Corp drug  according to data from an early-stage study released on Wednesday.",
        "date": "05172017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene leukemia drug extends survival in early stage trial "
    },
    {
        "content": "Celgene Corp on Thursday reported lower-than-expected first-quarter revenue with Otezla sales well short of Wall Street estimates  but the U.S. biotechnology company promised  the psoriasis drug was poised to rebound.",
        "date": "04272017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Celgene 1st quarter sales miss; expects psoriasis drug rebound "
    },
    {
        "content": "April 27 Celgene Corp on Thursday reported lower-than-expected first-quarter revenue with Otezla sales well short of Wall Street estimates  but the U.S. biotechnology company promised  the psoriasis drug was poised to rebound.",
        "date": "04272017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 3-Celgene 1st quarter sales miss; expects psoriasis drug rebound "
    },
    {
        "content": "* Celgene CEO says on track to achieve or exceed 2020 forecast",
        "date": "04272017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Celgene on track to achieve or exceed 2020 forecast - CEO "
    },
    {
        "content": "April 27 U.S. biotechnology company Celgene Corp reported a better-than-expected profit on Thursday  helped by demand for its flagship multiple myeloma drug Revlimid.",
        "date": "04272017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "RPT-UPDATE 1-Celgene quarterly profit beats on Revlimid demand "
    },
    {
        "content": "April 27 U.S. biotechnology company Celgene Corp reported a 17.5 percent jump in quarterly net income on Thursday  helped by demand for its flagship multiple myeloma drug Revlimid.",
        "date": "04272017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene quarterly profit rises 17.5 percent "
    },
    {
        "content": "* Celgene reports first quarter 2017 operating and financial results",
        "date": "04272017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Celgene Corp Q1 earnings per share $1.16 "
    },
    {
        "content": "* Diplomat Pharmacy Inc - on March 31 co   units  Celgene Corp entered into a pharmacy distribution and services agreement to be effective July 1  2017",
        "date": "04132017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Diplomat Pharmacy on March 31 co  units  Celgene entered into pharmacy distribution  services agreement to be effective July 1  2017 "
    },
    {
        "content": "* Announces registration pathway and clinical development plan",
        "date": "04122017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Oncolytics Biotech announces registration pathway and clinical development plan "
    },
    {
        "content": "April 10 OncoMed Pharmaceuticals Inc said on Monday its experimental drug  in combination with Celgene Corp's Abraxane and chemotherapy  failed a mid-stage study as an initial therapy for advanced pancreatic cancer.",
        "date": "04102017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "OncoMed's pancreatic cancer drug fails mid-stage study "
    },
    {
        "content": "* Oncolytics biotech enters into first-in-class collaboration with Myeloma UK and Celgene using Reolysin in combination with Imnovid or Revlimid in patients with Myeloma",
        "date": "03162017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Oncolytics Biotech enters collaboration with Myeloma UK and Celgene "
    },
    {
        "content": "* On March 13  2017  co and Celgene entered into a side letter agreement - sec filing",
        "date": "03152017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Alliqua Biomedical says co and Celgene entered into side letter agreement "
    },
    {
        "content": "* Agios announces MTAP pathway research program as development program and development candidate under master research and collaboration agreement with Celgene",
        "date": "03132017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Agios Pharmaceuticals announces MTAP pathway research program and collaboration agreement with Celgene "
    },
    {
        "content": "Celgene Corp and a whistleblower who brought a lawsuit accusing it of promoting its cancer drugs Revlimid and Thalomid for off-label uses have asked the judge presiding over the case not to issue any substantive rulings for 30 days while they pursue mediation.",
        "date": "03012017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Celgene  whistleblower pursuing mediation in off-label marketing case "
    },
    {
        "content": "* FDA expands indication for Revlimid® (lenalidomide) as a maintenance treatment for patients with multiple myeloma following autologous hematopoietic stem cell transplant (auto-HSCT)",
        "date": "02222017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-FDA expands indication for Revlimid in multiple myeloma patients following auto-HSCT "
    },
    {
        "content": "* Celgene announces retirement of president and Chief Operating Officer  Jacqualyn Fouse  Ph.D. And promotion of Scott Smith to president and chief operating officer  Source text for Eikon: Further company coverage:",
        "date": "02232017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene announces retirement of president and COO Jacqualyn Fouse "
    },
    {
        "content": "* Celgene announces positive results from Phase III sunbeam trial of oral ozanimod in patients with relapsing multiple sclerosis",
        "date": "02172017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene reports positive results from Phase III sunbeam trial of oral ozanimod in patients with relapsing multiple sclerosis "
    },
    {
        "content": "Biopharmaceutical company Celgene Corp has agreed to pay $198.5 million to resolve a lawsuit accusing it of failing to pay royalties on patents for two drugs subject to a licensing agreement.",
        "date": "02162017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Celgene to pay $198.5 million to settle drug patent licensing case "
    },
    {
        "content": "* Soros Fund Management takes share stake in facebook inc of 353 686 shares",
        "date": "02142017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Soros Fund Management takes in Facebook  ups in T Mobile and Alphabet "
    },
    {
        "content": "* Acquired by a consortium of private investors led by former Celgene and Medtronic ceos  Source text for Eikon:",
        "date": "02142017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Neximmune acquired by group of investors led by former Celgene and Medtronic CEOs "
    },
    {
        "content": "* Says received a second subpoena requesting materials primarily related to patient assistance to a past inquiry - sec filing",
        "date": "02102017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene receives second subpoena relating to past inquiry - SEC filing "
    },
    {
        "content": "Celgene Corp has asked a court to reconsider an order allowing a whistleblower lawsuit accusing it of promoting its cancer drugs Revlimid and Thalomid for off-label uses to go forward  saying a recent appeals court decision had raised the standard for the whistleblower's claims.",
        "date": "02012017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Celgene renews bid to escape lawsuit over off-label marketing "
    },
    {
        "content": "* Celgene receives positive CHMP opinion to expand REVLIMID\u007f (lenalidomide) indication as monotherapy for the maintenance treatment of patients with newly diagnosed multiple myeloma (mm) after autologous stem cell transplantation",
        "date": "01272017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene receives positive CHMP opinion to expand REVLIMID indication "
    },
    {
        "content": "* Celgene Inc says Health Canada has expanded indication for REVLIMID in multiple myeloma",
        "date": "01242017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene Inc says Health Canada has expanded indication for REVLIMID in multiple myeloma "
    },
    {
        "content": "* Celgene says Q4 topline growth was predominantly volume driven with 14 percent of growth coming from product volume: Conf Call",
        "date": "01262017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene CEO says tax reform could provide significant benefit to U.S. economy  healthcare industry - Conf Call "
    },
    {
        "content": "Celgene Corp  on Thursday reported a better-than-expected adjusted profit for the fourth quarter  helped by demand for its flagship multiple myeloma drug  Revlimid.",
        "date": "01262017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene's adjusted profit beats estimates on demand for Revlimid "
    },
    {
        "content": "Jan 26 Celgene Corp on Thursday reported a better-than-expected adjusted profit for the fourth quarter  helped by demand for its flagship multiple myeloma drug  Revlimid.",
        "date": "01262017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 1-Celgene's adjusted profit beats estimates on demand for Revlimid "
    },
    {
        "content": "* Celgene reports fourth quarter and full-year 2016 operating and financial results",
        "date": "01262017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Celgene reports earnings per share $0.53 "
    },
    {
        "content": "Jan 26 U.S. biotechnology company Celgene Corp  on Thursday  reported a 16 percent jump in quarterly revenue  helped by demand for its flagship multiple myeloma drug  Revlimid.",
        "date": "01262017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene revenue up 16 pct on demand for Revlimid "
    },
    {
        "content": "* Medidata Solutions - Celgene increases adoption of Medidata Clinical Cloud  Source text for Eikon:  Further company coverage:",
        "date": "01122017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Medidata Solutions says Celgene increased adoption of Medidata Clinical Cloud "
    },
    {
        "content": "Celgene Corp  on Monday raised its 2017 revenue and profit forecasts on the strength of its flagship Revlimid multiple myeloma drug and increased expectations for other treatments for cancer and psoriasis.",
        "date": "01092017",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Celgene raises 2017 revenue  profit forecast; maintains 2020 view "
    },
    {
        "content": "Jan 9 Celgene Corp on Monday raised its 2017 revenue and profit forecasts on the strength of its flagship Revlimid multiple myeloma drug and increased expectations for other treatments for cancer and psoriasis.",
        "date": "01092017",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 2-Celgene raises 2017 revenue  profit forecast; maintains 2020 view "
    },
    {
        "content": "* Celgene enters service license arrangement for rights to operate GNS Healthcare REFS(TM) causal machine learning and simulation platform",
        "date": "11292016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene enters into service and license arrangement for GNS Healthcare's causal machine learning platform "
    },
    {
        "content": "* Triphase accelerator to sell assets relating to Marizomib to Celgene  via affiliate  for undisclosed amount",
        "date": "11212016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-MaRS Innovation announces acquisition of first compound from Triphase by Celgene "
    },
    {
        "content": "* Celgene Corp - active trial in biologic-naïve patients met its primary endpoint",
        "date": "11142016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene - Data on early onset of efficacy for oral otezla in active psoriatic arthritis presented at American College Of Rheumatology "
    },
    {
        "content": "* Pharmakea Inc-extension of strategic collaboration with Celgene for its drug discovery platform and novel small-molecule therapies targeting fibrotic diseases  Source text for Eikon:",
        "date": "11182016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-PharmAkea extends collaboration with Celgene "
    },
    {
        "content": "* says Celgene Corp  through an affiliate  has acquired co's assets related to its proteasome inhibitor  marizomib",
        "date": "11182016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Triphase Accelerator says Celgene will buy co's assets related to marizomib "
    },
    {
        "content": "* Celgene and IBM Watson Health forge collaboration designed to transform patient safety monitoring",
        "date": "11012016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene and IBM Watson Health collaborate to transform patient safety monitoring "
    },
    {
        "content": "* Celgene Corp reports 12.3 percent stake in CRISPR Therapeutics Ag as of October 24 - SEC filing  Source text for Eikon:  Further company coverage:    ;))",
        "date": "10312016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene Corp reports 12.3 pct stake in CRISPR Therapeutics AG - SEC filing "
    },
    {
        "content": "A U.S. Patent and Trademark Office tribunal has invalidated two Celgene Corp patents related to its cancer drugs Revlimid  Pomalyst and Thalomid  marking a second victory for hedge fund manager Kyle Bass in his ongoing campaign of challenging drug patents.",
        "date": "10282016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Fund manager wins challenge to Celgene drug safety patents "
    },
    {
        "content": "* Files for potential mixed shelf; size not disclosed - sec filing  Source: http://bit.ly/2eg2oOZ Further company coverage:",
        "date": "10272016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene files for potential mixed shelf offering "
    },
    {
        "content": "U.S. biotechnology company Celgene Corp  raised its profit and revenue forecast for the year after posting third-quarter results ahead of Wall Street estimates  lifted by higher demand for its flagship multiple myeloma drug  Revlimid.",
        "date": "10272016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene's Revlimid sales spark forecast raise  shares jump "
    },
    {
        "content": "* Shares rise as much as 6.9 pct to $105.29   (Adds analyst comments  conf call details; updates shares)",
        "date": "10272016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 3-Celgene's Revlimid sales spark forecast raise  shares jump "
    },
    {
        "content": "* Says q3 growth rate was predominantly volume driven: conf call",
        "date": "10272016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Celgene says Q3 growth rate mainly volume driven - conf call "
    },
    {
        "content": "* Bristol-Myers  Celgene lead health stocks higher post results",
        "date": "10272016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "US STOCKS-Healthcare  tech stocks drive Wall Street higher "
    },
    {
        "content": "* Celgene reports third quarter 2016 operating and financial results",
        "date": "10272016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Celgene Q3 adjusted earnings per share $1.58 "
    },
    {
        "content": "Oct 27 U.S. biotechnology company Celgene Corp  reported a 28  percent jump in quarterly revenue  fueled by higher demand for its flagship multiple myeloma drug  Revlimid.",
        "date": "10272016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene quarterly revenue rises 28 percent as Revlimid shines "
    },
    {
        "content": "* Celgene Corporation and Sage Bionetworks announce technology collaboration to develop observational study using the apple researchkit framework",
        "date": "10182016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene & Sage Bionetworks use apple researchkit for observational study "
    },
    {
        "content": "* Celgene and Agios announce collaborations with Abbott for diagnostic identification of IDH mutations in AML",
        "date": "10122016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene & Agios collaborates with Abbott to develop diagnostic tests for leukemia "
    },
    {
        "content": "* Amgen stock down about 1.2 pct   (Adds comments from conference call  analysts  details)",
        "date": "09272016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 3-Amgen's multiple myeloma drug falls short in new-patient study "
    },
    {
        "content": "* Celgene Corp -Oral Ozanimod efficacy and safety results at 2 years from Phase 2 RADIANCE trial of patients with relapsing multiple Sclerosis presented at 32nd Ectrims",
        "date": "09162016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene Corp- releases data on Phase 2 RADIANCE trial "
    },
    {
        "content": "* Sutro Biopharma Inc says financial terms of milestones are not being disclosed.",
        "date": "09072016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Sutro Biopharma receives 2 milestone payments from Celgene "
    },
    {
        "content": "* Celgene corporation expects to submit a new drug application to U.S. FDA for Enasidenib (ag-221)",
        "date": "09072016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Agios Pharma says Celgene expects to submit NDA to U.S. FDA for enasidenib "
    },
    {
        "content": "* Celgene Corporation reports 8.1 pct passive stake in Oncomed Pharmaceuticals Inc as of August 23  2016 - SEC filing  Source text: (http://bit.ly/2bBcQ6P) Further company coverage:",
        "date": "08242016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene reports 8.1 pct passive stake in Oncomed Pharmaceuticals "
    },
    {
        "content": "* Sanofi  Pfizer  Gilead & Celgene interested in Medivation as company asks for indications of interest by mid-August - CNBC citing sources   Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "07292016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Sanofi  Pfizer  Gilead & Celgene interested in Medivation - CNBC citing sources "
    },
    {
        "content": "NEW YORK Celgene Corp raised its 2016 profit forecast and exceeded expectations for second-quarter earnings on Thursday on the strength of its flagship multiple myeloma drug Revlimid and growth in newer medicines  sparking a 2 percent jump in its shares.",
        "date": "07282016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Sales of flagship drug Revlimid drive Celgene profit; forecast raised "
    },
    {
        "content": "NEW YORK  July 28 Celgene Corp raised its 2016 profit forecast and exceeded expectations for second-quarter earnings on Thursday on the strength of its flagship multiple myeloma drug Revlimid and growth in newer medicines  sparking a 2 percent jump in its shares.",
        "date": "07282016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 3-Sales of flagship drug Revlimid drive Celgene profit; forecast raised "
    },
    {
        "content": "July 25 Celgene Corp said on Monday that its flagship drug Revlimid failed to extend survival as a maintenance therapy for a type of blood cancer after patients had responded to prior treatment.",
        "date": "07252016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene drug fails to extend survival in lymphoma study "
    },
    {
        "content": "July 28 U.S. biotechnology company Celgene Corp  reported a 21 percent jump in quarterly revenue  driven by demand for its key multiple myeloma drug  Revlimid.",
        "date": "07282016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene revenue rises on higher demand for flagship drug Revlimid "
    },
    {
        "content": "* Celgene reports second quarter 2016 operating and financial results",
        "date": "07282016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Celgene reports Q2 GAAP earnings per share $0.75 "
    },
    {
        "content": "* Interim analysis of overall survival  a key secondary endpoint  showed no benefit in revlimid",
        "date": "07252016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Celgene and LYSARC provide update on the phase III study "
    },
    {
        "content": "* Jounce Therapeutics says to receive upfront payment of $225 million and $36 million equity investment  up to $2.3 billion in future milestone payments",
        "date": "07192016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "CORRECTED-BRIEF-Jounce Therapeutics to collaborate with Celgene to develop immuno-oncology therapies "
    },
    {
        "content": "* Celgene announces additional $3 billion share repurchase authorization",
        "date": "06152016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Celgene announces additional $3 bln share repurchase authorization "
    },
    {
        "content": "* Says scientific collaborations include possible extension of ongoing collaboration with Celgene Corporation   Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "06132016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Bionor Pharma says possible extension of alliance with Celgene "
    },
    {
        "content": "* Acceleron and Celgene announce updated results from an ongoing Phase 2 study of Luspatercept in beta-thalassemia presented at the 21st congress of the European Hematology Association",
        "date": "06102016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Acceleron  Celgene says data with Luspatercept show increases in hemoglobin levels "
    },
    {
        "content": "June 5 Johnson & Johnson's therapy for advanced multiple myeloma sharply reduced the risk of disease progression when taken with two standard treatments for the blood cancer  according to research the company hopes will pave the way for wider use of the treatment.",
        "date": "06052016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "J&J myeloma drug  in combo regimen  delays worsening of the disease "
    },
    {
        "content": "* Says maintains its focus on HIV immunotherapy and overall strategy to further advance VACC-4x in clinical development in combination with other medicines",
        "date": "05312016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Bionor Pharma: Updated clinical strategy  reduced capital needs "
    },
    {
        "content": "* Agios and Celgene establish new collaboration in metabolic immuno-oncology and amend certain rights from 2010 agreement",
        "date": "05172016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Agios Pharmaceuticals  Celgene establish new collaboration in metabolic immuno-oncology "
    },
    {
        "content": "* Expanding current collaboration with Celgene Corp in development of marizomib for potential treatment of malignant gliomasb  Source text for Eikon:  Further company coverage:",
        "date": "05032016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Triphase expands current collaboration with Celgene in development of marizomib "
    },
    {
        "content": "U.S. biotechnology company Celgene Corp  reported first-quarter revenue that fell just shy of analysts estimates due to the stronger dollar  sending the company's shares down 1.5 percent in premarket trading.",
        "date": "04282016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Celgene revenue rises less than expected due to strong dollar "
    },
    {
        "content": "* Celgene reports first quarter 2016 operating and financial results",
        "date": "04282016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Celgene reports Q1 earnings $0.99/shr "
    },
    {
        "content": "April 28 U.S. biotechnology company Celgene Corp  reported a 20.7 percent rise in quarterly revenue  helped by higher demand for its flagship multiple myeloma drug  Revlimid.",
        "date": "04282016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene revenue rises about 21 pct "
    },
    {
        "content": "* Co and Celgene Corp agreed to defer from April 14  2016 to June 1  2016 selection process for allocating rights to certain discovery programs",
        "date": "04142016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Agios  Celgene Corp to defer selection process for allocating rights to certain discovery programs "
    },
    {
        "content": "NEW YORK The tumble in share prices for biotechnology stocks has created some buying opportunities  with drugmakers Celgene Corp  and Gilead Sciences  poised for a 30 percent rise over the next year  Barron's said.",
        "date": "02082016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Celgene  Gilead Sciences shares could rise 30 percent: Barron's "
    },
    {
        "content": "* Company bullish on prospects of cancer drug Revlimid - call",
        "date": "01282016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "UPDATE 2-Celgene's profit misses estimates as costs rise "
    },
    {
        "content": "Jan 28 U.S. biotechnology company Celgene Corp  reported a  23 percent rise in quarterly revenue due to higher demand for its flagship multiple myeloma drug  Revlimid.",
        "date": "01282016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene's quarterly revenue rises 23 pct "
    },
    {
        "content": "Jan 11 Celgene Corp Chief Executive Officer Bob Hugin on Monday said he would step down as of March 1 and hand the reins to current President and Chief Operating Officer Mark Alles.",
        "date": "01112016",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Celgene names Alles CEO from March 1; shares fall 7 pct "
    },
    {
        "content": "* Ceo says very optimistic about meeting or exceeding 2020 targets",
        "date": "01112016",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Celgene sees 2016 adjusted eps $5.50-$5.70 "
    },
    {
        "content": "Celgene Corp said it would allow for the sale of a generic version of its flagship multiple myeloma drug  Revlimid  in the United States over a year before patents covering the drug expire.",
        "date": "12222015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene settles U.S. patent litigation for top seller Revlimid "
    },
    {
        "content": "Dec 22 Celgene Corp said it would allow the sale of a generic version of its flagship multiple myeloma drug  Revlimid  in the United States more than a year before the drug's patent expires.",
        "date": "12222015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene to allow sale of generic Revlimid before patent expiry "
    },
    {
        "content": "Nov 30 The U.S. Food and Drug Administration said on Monday it had approved a drug to be sold by Bristol-Myers Squibb Co as a treatment for a form of blood cancer.",
        "date": "11302015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "FDA approves new Bristol-Myers treatment for multiple myeloma "
    },
    {
        "content": "Celgene Corp  posted its smallest revenue growth in five quarters due to slower sales of its two key cancer drugs.",
        "date": "11052015",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Celgene's revenue misses as key cancer drug sales slow "
    },
    {
        "content": "* Company says Abraxane faces competition from rival treatments",
        "date": "11052015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 3-Celgene's revenue misses as key cancer drug sales slow "
    },
    {
        "content": "Nov 5 Drugmaker Celgene Corp posted an 18 percent jump in quarterly revenue as demand for its cancer and psoriasis drugs increased.",
        "date": "11052015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene revenue rises on demand for cancer  psoriasis drugs "
    },
    {
        "content": "Oct 16 The most influential source for U.S. oncology treatment guidelines on Friday unveiled ratings aimed at helping doctors and patients assess the costs versus benefits of current therapies for two types of blood cancer.",
        "date": "10162015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "U.S. oncology group rates blood cancer regimens  including cost "
    },
    {
        "content": "NEW YORK  July 29 Celgene Corp  one of the world's largest biotechnology companies  has accused U.S. hedge fund manager Kyle Bass of attempting to profit from his attempts to wipe out several major drug patents through his Coalition for Affordable Drugs.",
        "date": "07292015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene says patent-fighting hedge fund manager wants to short its shares "
    },
    {
        "content": "U.S. stocks edged lower on Wednesday following comments from Federal Reserve Chair Janet Yellen  as a decline in energy shares outweighed gains in the financial sector in the latter stages of trading.",
        "date": "07152015",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Wall Street edges lower as energy weighs "
    },
    {
        "content": "Celgene Corp's  effort to reduce dependence on its flagship cancer drug through the $7.2 billion bet on Receptos Inc's  potential blockbuster drug won the backing of Wall Street.",
        "date": "07152015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Wall Street lauds Celgene's $7.2 billion Receptos buy "
    },
    {
        "content": "* Enters into romidepsin supply agreement enabling advancement of its HIV therapeutic vaccine with Vacc-4x into full scale clinical Phase II",
        "date": "07162015",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Bionor Pharma agrees with Celgene on continued supply of romidepsin "
    },
    {
        "content": "* Indexes up: Dow 0.07 pct  S&P 0.09 pct  Nasdaq 0.16 pct   (Updates to early afternoon)",
        "date": "07152015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "US STOCKS-Wall St higher; financial stocks lead "
    },
    {
        "content": "* Indexes up: Dow 0.17 pct  S&P 0.2 pct  Nasdaq 0.36 pct   (Adds details  changes comment  updates prices)",
        "date": "07152015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "US STOCKS-Wall St up as Fed says on track to raise rates in 2015 "
    },
    {
        "content": "July 15 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Wednesday:",
        "date": "07152015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Celgene Corp said on Tuesday it would buy Receptos Inc for $7.2 billion in a move that will give the U.S. biotechnology company a potential multibillion-dollar drug in late stage development for inflammatory bowel disease and multiple sclerosis.",
        "date": "07142015",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Celgene to buy Receptos for $7.2 billion; gains promising drug "
    },
    {
        "content": "July 14 Celgene Corp said on Tuesday it would buy Receptos Inc for $7.2 billion in a move that will give the U.S. biotechnology company a potential multibillion-dollar drug in late stage development for inflammatory bowel disease and multiple sclerosis.",
        "date": "07142015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 2-Celgene to buy Receptos for $7.2 bln; gains promising drug "
    },
    {
        "content": "* Siegfried and Celgene  American bio-technology company  have put their existing close cooperation on a firm long-term footing",
        "date": "07102015",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "BRIEF-Siegfried Holding and Celgene sign long-term cooperation agreement "
    },
    {
        "content": "July 14 Celgene Corp said it agreed to buy Receptos Inc for about $7.2 billion to expand its pipeline with Receptos' immune-inflammatory bowel drug  Ozanimod.",
        "date": "07142015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene to buy Receptos for $7.2 bln "
    },
    {
        "content": "Celgene Corp on Monday launched a 10-year partnership with Juno Therapeutics  announcing a $1 billion investment aimed at bringing to market Juno technologies that harness the immune system to treat cancer and autoimmune diseases.",
        "date": "06292015",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Celgene to invest $1 billion in Juno to partner in cancer therapies "
    },
    {
        "content": "June 29 Celgene Corp on Monday launched a 10-year partnership with Juno Therapeutics  announcing a $1 billion investment aimed at bringing to market Juno technologies that harness the immune system to treat cancer and autoimmune diseases.",
        "date": "06292015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 2-Celgene to invest $1 bln in Juno to partner in cancer therapies "
    },
    {
        "content": "June 29 Celgene Corp and Juno Therapeutics Inc said they signed a deal to develop and commercialize immunotherapies for the treatment of cancer and autoimmune diseases.",
        "date": "06292015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "REFILE-Celgene  Juno collaborate to develop cancer therapies "
    },
    {
        "content": "May 7 Celgene Corp on Thursday said the European Patent Office revoked a key patent on the company's flagship multiple myeloma drug Revlimid  a move that could shave a year or two from the medicine's exclusivity in Europe.",
        "date": "05072015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "EU patent office revokes Celgene Revlimid patent; appeal planned "
    },
    {
        "content": "May 7 Celgene Corp on Thursday said the European Patent Office revoked a key patent on the company's flagship multiple myeloma drug Revlimid  a move that could shave a year or two from the medicine's exclusivity in Europe.",
        "date": "05072015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 1-EU patent office revokes Celgene Revlimid patent; appeal planned "
    },
    {
        "content": "May 6 The hefty premium Alexion Pharmaceuticals Inc has agreed to pay to acquire Synageva BioPharma Corp highlights how the popularity of so-called orphan drug makers is leading to valuations many investors now deem frothy.",
        "date": "05062015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "CORRECTED-Rich Synageva M&A premium epitomizes appetite for orphan drugs "
    },
    {
        "content": "* Indexes down: Dow 1.1 pct  S&P 1 pct  Nasdaq 1.6 pct   (Updates close with LinkedIn  solar company shares down after the bell  Gilead up  small caps down  new quote)",
        "date": "04302015",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "US STOCKS-Wall St drops with tech shares; LinkedIn falls late "
    },
    {
        "content": "* Indexes down: Dow 1.1 pct  S&P 1 pct  Nasdaq 1.6 pct   (Updates to close)",
        "date": "04302015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "US STOCKS-Wall St drops with tech shares; indexes up for month "
    },
    {
        "content": "April 30 Celgene Corp's dependence on its big-selling multiple myeloma drug Revlimid raised investor concerns on Thursday as sales of its other medicines fell short of expectations.",
        "date": "04302015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene sales highlight Revlimid dependence ahead of patent ruling "
    },
    {
        "content": "* Indexes down: Dow 1.4 pct  S&P 1.3 pct  Nasdaq 1.9 pct   (Updates to late afternoon)",
        "date": "04302015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "US STOCKS-Wall St drops with tech shares; Nasdaq down for 4th day "
    },
    {
        "content": "* Indexes down: Dow 0.5 pct  S&P 0.5 pct  Nasdaq 0.9 pct   (Changes comment  updates prices)",
        "date": "04302015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "US STOCKS-Wall St falls on mixed economic data; Apple weighs "
    },
    {
        "content": "LONDON AstraZeneca  is getting a $450 million windfall by letting Celgene  develop a prized immunotherapy drug for blood cancers but its chief executive insists the deal is about strategy  not cash.",
        "date": "04242015",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "AstraZeneca insists Celgene deal about strategy  not cash "
    },
    {
        "content": "LONDON  April 24 AstraZeneca is getting a $450 million windfall by letting Celgene develop a prized immunotherapy drug for blood cancers but its chief executive insists the deal is about strategy  not cash.",
        "date": "04242015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "CORRECTED-AstraZeneca insists Celgene deal about strategy  not cash "
    },
    {
        "content": "* CEO says no comment on Pfizer  completely focused on developing pipeline",
        "date": "04242015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-AstraZeneca open to acquisitions  smaller deals more likely "
    },
    {
        "content": "U.S. biotechnology company Celgene Corp  posted a lower-than-expected quarterly revenue  hit by a stronger dollar  but said the dollar would not hurt full-year sales and profit more that it had already forecast.",
        "date": "04302015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene revenue rises less than expected due to strong dollar "
    },
    {
        "content": "* Drugmaker reiterates financial forecasts for year   (Adds analyst comment  latest shares)",
        "date": "04242015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "UPDATE 2-AstraZeneca looks beyond Nexium hit with new cancer deals "
    },
    {
        "content": "* Indexes down: Dow 0.7 pct  S&P 0.7 pct  Nasdaq 1 pct   (Updates to open)",
        "date": "04302015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "US STOCKS-Wall St opens lower as Apple  Celgene weigh "
    },
    {
        "content": "* Says now expects 2015 Revlimid sales at or above upper end of forecast range of $5.6 billion to $5.7 billion  Further company coverage:    (Reporting By Bill Berkrot)",
        "date": "04302015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Celgene sees 2015 Revlimid sales at or above high end of forecast range "
    },
    {
        "content": "FRANKFURT Morphosys still believes that its MOR202 compound has a good chance of becoming a success after U.S. drugmaker Celgene scrapped cooperation on the drug candidate  the German company's chief executive told a newspaper.",
        "date": "04052015",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Morphosys CEO says MOR202 drug candidate still promising: newspaper "
    },
    {
        "content": "FRANKFURT  April 5 Morphosys still believes that its MOR202 compound has a good chance of becoming a success after U.S. drugmaker Celgene scrapped cooperation on the drug candidate  the German company's chief executive told a newspaper.",
        "date": "04052015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Morphosys CEO says MOR202 drug candidate still promising - newspaper "
    },
    {
        "content": "FRANKFURT Morphosys and Celgene have agreed to end their cooperation on MOR202  but clinical trials of the drug candidate will continue  Morphosys said on Thursday.",
        "date": "03262015",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "Morphosys  Celgene end cooperation on MOR202 drug candidate "
    },
    {
        "content": "WASHINGTON The U.S. Food and Drug Administration has expanded the authorized use of Celgene Corp's cancer drug Revlimid to include newly diagnosed patients with multiple myeloma  the company said on Wednesday.",
        "date": "02182015",
        "name": "Celgene Corporation",
        "news_type": "topStory",
        "symbol": "CELG",
        "title": "FDA approves new use for Celgene's cancer drug Revlimid "
    },
    {
        "content": "WASHINGTON  Feb 18 The U.S. Food and Drug Administration has expanded the authorized use of Celgene Corp's  cancer drug Revlimid to include newly diagnosed patients with multiple myeloma  the company said on Wednesday.",
        "date": "02182015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "U.S. FDA approves new use for Celgene's cancer drug Revlimid "
    },
    {
        "content": "Jan 29 Celgene Corp on Thursday said early first quarter sales trends indicate the year is off to a strong start  and that it has growth drivers in place to meet or exceed its 2015 and long- term forecasts.",
        "date": "01292015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "Celgene says 2015 off to strong start; key growth drivers in place "
    },
    {
        "content": "Jan 29 Celgene Corp :  * Says early Q1 trends indicate strong start to year  * Says plans to initiate 8 new phase i clinical programs in 2015  * Says received Revlimid reimbursement approval in Russia  * Says anticipates Revlimid pricing approval in Mexico  * Says growth drivers exist to meet or exceed 2015 and longer term forecasts",
        "date": "01292015",
        "name": "Celgene Corporation",
        "news_type": "normal",
        "symbol": "CELG",
        "title": "BRIEF-Celgene says year off to strong start "
    }
]