[
    {
        "content": "* CF Industries Holdings  Inc. reports third quarter net loss of $87 million and EBITDA of $139 million; adjusted net loss of $90 million and adjusted EBITDA of $134 million",
        "date": "11012017",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "BRIEF-CF Industries Reports third quarter net loss of $87 mln "
    },
    {
        "content": "North America's largest nitrogen fertilizer maker CF Industries Holdings Inc  reported a smaller-than-expected quarterly loss on Wednesday  as higher sales volumes more than offset lower average selling prices.",
        "date": "11012017",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "CF Industries posts smaller-than-expected third-quarter loss "
    },
    {
        "content": "Nov 1 Nitrogen fertilizer maker CF Industries Holdings Inc reported a bigger quarterly loss on Wednesday  hit by lower prices of ammonia.",
        "date": "11012017",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "CF Industries 3rd-qtr loss widens on lower ammonia prices "
    },
    {
        "content": "U.S. fertilizer producer CF Industries Holdings Inc  reported a 93.6 percent fall in quarterly profit on Wednesday and said it expects nitrogen pricing to be challenged through 2017 and into 2018.",
        "date": "08022017",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "Fertilizer maker CF Industries posts 93.6 percent plunge in profit "
    },
    {
        "content": "Aug 2 U.S. fertilizer producer CF Industries Holdings Inc reported a 93.6 percent fall in quarterly profit on Wednesday and said it expects nitrogen pricing to be challenged through 2017 and into 2018.",
        "date": "08022017",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "UPDATE 1-Fertilizer maker CF Industries posts 93.6 pct plunge in profit "
    },
    {
        "content": "* CF Industries Holdings Inc - ‍plan was originally scheduled to expire on September 5  2017​ Source text for Eikon: Further company coverage:",
        "date": "07252017",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "BRIEF-CF Industries terminates tax benefits preservation plan "
    },
    {
        "content": "* John W. Eaves and Michael J. Toelle elected to board of directors of CF Industries Holdings  Inc.",
        "date": "07242017",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "BRIEF-CF Industries says John W. Eaves and Michael J. Toelle elected to Board "
    },
    {
        "content": "U.S. nitrogen fertilizer producer CF Industries Holdings Inc  reported a better-than-expected adjusted profit on Wednesday  as higher production offset lower fertilizer prices.",
        "date": "05032017",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "Fertilizer maker CF Industries' profit beats estimates "
    },
    {
        "content": "May 3 U.S. nitrogen fertilizer producer CF Industries Holdings Inc reported a better-than-expected adjusted profit on Wednesday  as higher production offset lower fertilizer prices.",
        "date": "05032017",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "UPDATE 1-Fertilizer maker CF Industries' profit beats estimates "
    },
    {
        "content": "* Cf Industries Holdings  Inc. reports first quarter net loss of $23 million and EBITDA of $218 million; adjusted net earnings of $11 million and adjusted EBITDA of $272 million",
        "date": "05032017",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "BRIEF-CF Industries Holdings reports Q1 2017 results "
    },
    {
        "content": "May 3 U.S. nitrogen fertilizer producer CF Industries Holdings Inc reported a first-quarter loss compared with a profit in the year-ago period  hurt by lower realized prices of ammonia and urea.",
        "date": "05032017",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "Fertilizer maker CF Industries posts quarterly loss "
    },
    {
        "content": "* CEO Anthony Will's FY 2016 total compensation was $6.4 million versus $5.7 million in FY 2015 - sec filing Source text : http://bit.ly/2opTfJl Further company coverage:",
        "date": "03312017",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "BRIEF-CF Industries Holdings CEO Anthony Will's FY 2016 total compensation was $6.4 Mln "
    },
    {
        "content": "U.S.-based CF Industries Holdings Inc   the third-largest global nitrogen fertilizer producer  would welcome a U.S. border tax on imports  as it would mirror conditions the company already faces selling into other markets  Chief Executive Tony Will said on Thursday.",
        "date": "02162017",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "Fertilizer maker CF Industries cheers possible U.S. border tax "
    },
    {
        "content": "Feb 16 U.S.-based CF Industries Holdings Inc   the third-largest global nitrogen fertilizer producer  would welcome a U.S. border tax on imports  as it would mirror conditions the company already faces selling into other markets  Chief Executive Tony Will said on Thursday.",
        "date": "02162017",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "Fertilizer maker CF Industries welcomes possible US border tax "
    },
    {
        "content": "U.S. nitrogen fertilizer producer CF Industries Holdings Inc  reported a bigger-than-expected loss  but said it expects  prices in North America to improve through the first half of the year.",
        "date": "02152017",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "CF Industries posts bigger-than-expected loss "
    },
    {
        "content": "Feb 15 U.S. nitrogen fertilizer producer CF Industries Holdings Inc reported a bigger-than-expected loss  but said it expects  prices in North America to improve through the first half of the year.",
        "date": "02152017",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "UPDATE 1-CF Industries posts bigger-than-expected loss "
    },
    {
        "content": "* CF Industries Holdings  Inc. reports fourth quarter net loss of $320 million and EBITDA loss of $135 million; adjusted net loss of $90 million and adjusted EBITDA of $133 million",
        "date": "02152017",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "BRIEF-CF Industries Holdings Q4 adjusted loss per share $0.39 "
    },
    {
        "content": "Feb 15 U.S. nitrogen fertilizer producer CF Industries Holdings Inc reported a loss for the fourth quarter  compared with a year-ago profit  as it recorded a bigger impairment charge.",
        "date": "02152017",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "Fertilizer producer CF Industries posts quarterly loss "
    },
    {
        "content": "* CF Industries announces completion of debt capital structure changes",
        "date": "11212016",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "BRIEF-CF Industries announces completion of debt capital structure changes "
    },
    {
        "content": "Nov 14 Cf Industries Holdings Inc  presentation at Morgan Stanley investor conference:",
        "date": "11142016",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "BRIEF-CF Industries sees nitrogen fertilizer recovery in 2018 "
    },
    {
        "content": "* Notes due 2021 will be issued at a price of 99.853% of face value  notes due 2026 will be issued at a price of 99.385% of face value",
        "date": "11102016",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "BRIEF-CF Industries announces pricing of $1.25 bln senior secured notes offering "
    },
    {
        "content": "* CF Industries announces $1 250 000 000 senior secured notes offering",
        "date": "11072016",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "BRIEF-CF Industries announces $1.25 bln senior secured notes offering "
    },
    {
        "content": "* On October 31  co entered into amendment No. 3 to the third amended and restated revolving credit agreement- SEC filing",
        "date": "11032016",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "BRIEF-CF Industries enters into amendment to third amended and restated revolving credit agreement "
    },
    {
        "content": "Nov 2 U.S. nitrogen fertilizer producer CF Industries Holdings Inc on Wednesday reported a loss for the third quarter  its first in six and a half years  pressured by lower prices.",
        "date": "11022016",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "UPDATE 1-Fertilizer maker CF Industries posts first quarterly loss since 2010 "
    },
    {
        "content": "* CF Industries Holdings Inc - New Port Neal  IA  plants are in process of starting up",
        "date": "11022016",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "BRIEF-CF Industries Holdings Q3 sales $680 million "
    },
    {
        "content": "Nov 2 U.S. nitrogen fertilizer producer CF Industries Holdings Inc on Wednesday reported a loss for the third quarter  pressured by large supplies and lower prices.",
        "date": "11022016",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "Fertilizer producer CF Industries posts quarterly loss "
    },
    {
        "content": "* CF Industries Announces Start-Up of New Ammonia Plant at Donaldsonville Nitrogen Complex   Source text for Eikon:  Further company coverage:",
        "date": "10262016",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "BRIEF-CF Industries announces start-up of new ammonia plant at Donaldsonville Nitrogen Complex "
    },
    {
        "content": "* Estimates that it will generate a federal tax net operating loss in excess of $2 billion in 2016",
        "date": "09062016",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "BRIEF-CF Industries adopts one-year tax benefits preservation plan "
    },
    {
        "content": "CF Industries Holdings Inc  known as an active dealmaker  intends to now focus on its own expanding operations as the nitrogen fertilizer industry slumps  its chief executive officer said on Thursday.",
        "date": "08042016",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "CF Industries to back off on dealmaking as market slumps "
    },
    {
        "content": "Aug 4 CF Industries Holdings Inc plans to run its expanded U.S. nitrogen fertilizer plants at full throttle  its chief executive officer said on Thursday  and expects its domestic rivals to do the same  despite global oversupply that has hurt prices and profits.",
        "date": "08042016",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "CF Industries to run nitrogen plants full-out despite oversupply "
    },
    {
        "content": "Aug 3 Two of North America's biggest fertilizer companies reported large drops in quarterly profit on Wednesday  and warned of tough times ahead as abundant supplies weighed on prices.",
        "date": "08032016",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "Fertilizer price slump chops profits at CF Industries  Agrium "
    },
    {
        "content": "U.S. nitrogen fertilizer producer CF Industries Holdings Inc  reported an 87 percent plunge in quarterly profit - more than expected - and warned on Wednesday that prices would likely remain weak into next year due to abundant supplies.",
        "date": "08032016",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "CF Industries profit tumbles as fertilizer prices slump "
    },
    {
        "content": "Aug 3 U.S. nitrogen fertilizer producer CF Industries Holdings Inc reported an 87 percent plunge in quarterly profit - more than expected - and warned on Wednesday that prices would likely remain weak into next year due to abundant supplies.",
        "date": "08032016",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "UPDATE 1-CF Industries profit tumbles as fertilizer prices slump "
    },
    {
        "content": "Aug 3 U.S. nitrogen fertilizer producer CF Industries Holdings Inc reported sharply lower quarterly profit on Wednesday  and warned that prices would likely remain weak into next year due to abundant supplies.",
        "date": "08032016",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "CF Industries profit tumbles  as fertilizer prices slump "
    },
    {
        "content": "May 23 U.S. fertilizer maker CF Industries Holdings Inc and Dutch rival OCI NV ended their merger agreement on Monday  following the U.S. Treasury's steps to curb tax avoiding inversion deals.",
        "date": "05232016",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "Fertilizer maker CF Industries  OCI end merger deal "
    },
    {
        "content": "* Termination of proposed combination of cf industries with OCI's European  North American and global distribution businesses",
        "date": "05232016",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "BRIEF-CF Industries terminates combination with OCI's European  North American and global distribution businesses "
    },
    {
        "content": "* Termination of proposed combination of CF Industries  with OCI's European  North American and global distribution businesses",
        "date": "05232016",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "BRIEF-OCI and CF Industries announce termination proposed combination "
    },
    {
        "content": "U.S. nitrogen fertilizer producer CF Industries Holdings Inc's quarterly profit slumped 89 percent due to lower selling prices and higher operating expenses.",
        "date": "05042016",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "Fertilizer producer CF Industries' profit tumbles 89 percent "
    },
    {
        "content": "* CF industries holdings  inc. Reports first quarter net earnings of $26 million and ebitda of $207 million; adjusted net earnings of $95 million and adjusted ebitda of $300 million",
        "date": "05042016",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "BRIEF-CF industries holdings qtrly net sales $ 1 004  million versus $ 954 million "
    },
    {
        "content": "* Sets quarterly dividend of $0.30per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04252016",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "BRIEF-CF Industries sets quarterly dividend of $0.30 per share "
    },
    {
        "content": "* Ceo w. Anthony will's total compensation for fy 2015 was $5.7 million compared to $4.4 million in fy 2014 - sec filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "03312016",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "BRIEF-CF Industries CEO Anthony Will's compensation for 2015 was $5.7 mln vs $4.4 mln in 2014 "
    },
    {
        "content": "Netherlands-based OCI NV  has agreed to sell to Consolidated Energy Limited a 50 percent stake in Natgasoline LLC  a sale that alters a larger deal between OCI and U.S. fertilizer producer CF Industries Inc   CF said in a regulatory filing on Monday.",
        "date": "03142016",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "Fertilizer maker OCI to sell Natgasoline stake to Consolidated "
    },
    {
        "content": "Feb 17 U.S. nitrogen fertilizer producer CF Industries Holdings Inc reported a lower-than-expected quarterly profit  hurt by weakening prices and higher costs.",
        "date": "02172016",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "UPDATE 1-CF Industries profit misses estimates as prices weaken "
    },
    {
        "content": "Feb 17 U.S. nitrogen fertilizer producer CF Industries Holdings Inc reported an 89 percent drop in fourth-quarter profit as costs rose sharply.",
        "date": "02172016",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "CF Industries profit falls 89 pct as costs rise "
    },
    {
        "content": "* CF Industries and OCI announce amended combination agreement",
        "date": "12212015",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "BRIEF-CF Industries and OCI announce amended combination agreement "
    },
    {
        "content": "BRUSSELS  Dec 7 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "12072015",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "EU mergers and takeovers (Dec 7) "
    },
    {
        "content": "LONDON  Dec 3 The boss of $4 billion U.S. hedge fund Passport Capital said on Thursday he had bought into U.S. agro-chemicals firm CF Industries as he thought it was undervalued and was likely to launch a $3.5 billion share buy back in 2016.",
        "date": "12032015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "Passport Capital's Burbank likes CF Industries for buybacks "
    },
    {
        "content": "BRUSSELS  Dec 2 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "12022015",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "EU mergers and takeovers (Dec 2) "
    },
    {
        "content": "Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "11232015",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "BRIEF-OCI and CF committed to pursuing combination "
    },
    {
        "content": "* Announces the filing with the U.S. Securities and Exchange Commission of a registration statement on Form S-4 containing a preliminary proxy statement/shareholders circular/prospectus in connection with the proposed combination of CF Industries Holdings  Inc. and OCI's European  North American and Global Distribution businesses  Source text: http://bit.ly/1HC3TyG Further company coverage:    (Gdynia Newsroom)",
        "date": "11092015",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "BRIEF-Registration statement filed for combination of its OCI NV unit with CF Industries "
    },
    {
        "content": "* CF Industries Holdings Inc and OCI announce expiration of Hart-Scott-Rodino act waiting period",
        "date": "11032015",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "BRIEF-Oci and CF Industries announce expiration Hart-Scott-Rodino act waiting period "
    },
    {
        "content": "U.S. fertilizer producer CF Industries Holdings Inc  reported a 31 percent drop in third-quarter profit on Wednesday after markets closed  pressured by weakening prices.",
        "date": "11042015",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "Fertilizer maker CF Industries' profit tumbles 31 percent "
    },
    {
        "content": "Nov 4 U.S. fertilizer producer CF Industries Holdings Inc reported a 31 percent drop in third-quarter profit on Wednesday after markets closed  pressured by weakening prices.",
        "date": "11042015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "UPDATE 1-Fertilizer maker CF Industries' profit tumbles 31 pct "
    },
    {
        "content": "Nov 4 U.S. fertilizer producer CF Industries Holdings Inc reported lower third-quarter profit on Wednesday after markets closed.",
        "date": "11042015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "Fertilizer maker CF Industries' profit tumbles "
    },
    {
        "content": "Sinking crop prices and frenzied output growth by nitrogen fertilizer producers have sparked nearly $10 billion worth of deals in the fragmented sector and signal more consolidation may  be ahead in the largest of three crop nutrient markets.",
        "date": "08132015",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "Bleak outlook sparks frenzied dealmaking in nitrogen fertilizer market "
    },
    {
        "content": "U.S.-based agribusiness CHS Inc  said it would invest $2.8 billion in a unit of fertilizer producer CF Industries Holdings Inc  to secure nitrogen fertilizer supplies.",
        "date": "08122015",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "CHS in $2.8 billion deal with CF for fertilizer supply "
    },
    {
        "content": "Aug 12 U.S.-based agribusiness CHS Inc  said it would invest $2.8 billion in a unit of fertilizer producer CF Industries Holdings Inc to secure nitrogen fertilizer supplies.",
        "date": "08122015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "UPDATE 2-CHS in $2.8 bln deal with CF for fertilizer supply "
    },
    {
        "content": "Aug 12 U.S.-based agribusiness CHS  said it will invest $2.8 billion in a unit of U.S. fertilizer producer CF Industries Holdings Inc.",
        "date": "08122015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "CHS to invest $2.8 bln in fertilizer maker CF Industries' unit "
    },
    {
        "content": "LONDON  Aug 7 Worldwide dealmaking in the basic materials sector rose in July to a seven-year high  lifted by U.S. fertiliser maker CF Industries' $8 billion bid for some of Dutch firm OCI NV's North American and European  Thomson Reuters data shows.",
        "date": "08072015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "Basic materials M&A hits seven-year high buoyed by chemicals deals "
    },
    {
        "content": "Aug 5 North American nitrogen fertilizer producers Agrium Inc and CF Industries reported on Wednesday higher second-quarter profits after markets closed.",
        "date": "08052015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "Fertilizer makers Agrium  CF post higher profits "
    },
    {
        "content": "Aug 6 The following bids  mergers  acquisitions and disposals were reported by 2045 GMT on Thursday:",
        "date": "08062015",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "U.S. fertilizer maker CF Industries Holdings Inc  said on Thursday it will buy OCI NV's  North American and European plants for $6 billion  making CF the world's largest publicly traded nitrogen company.",
        "date": "08062015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "Fertilizer maker CF Industries to buy OCI assets for $6 bln "
    },
    {
        "content": "* CF will become unit of new company based in UK after the deal   (Adds Breakingviews link  updates share price)",
        "date": "08062015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "UPDATE 4-Fertilizer maker CF Industries to buy OCI assets for $6 bln "
    },
    {
        "content": "* Says he doesn't expect significant anti-trust issue in OCI deal",
        "date": "08062015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "BRIEF-CF Industries chief doesn't expect anti-trust concern in OCI deal "
    },
    {
        "content": "Aug 6 U.S. fertilizer producer CF Industries Holdings Inc said it will buy Netherlands-based rival OCI NV's North American and global distribution businesses in a deal valued at about $8 billion  including debt.",
        "date": "08062015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "CF Industries to buy businesses from OCI in $8 bln deal "
    },
    {
        "content": "U.S. fertilizer maker CF Industries Holdings Inc  and Netherlands-based rival OCI NV  are nearing an agreement to merge  Bloomberg reported.",
        "date": "08062015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "Fertilizer makers CF Industries  OCI near merger: Bloomberg "
    },
    {
        "content": "Aug 6 U.S. fertilizer maker CF Industries Holdings Inc and Netherlands-based rival OCI NV  are nearing an agreement to merge  Bloomberg reported.",
        "date": "08062015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "Fertilizer makers CF Industries  OCI near merger - Bloomberg "
    },
    {
        "content": "July 17 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Friday:",
        "date": "07172015",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "U.S. fertilizer maker CF Industries Holdings Inc  is in advanced merger talks with Amsterdam-listed chemical company OCI NV   the Wall Street Journal reported.",
        "date": "07172015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "Fertilizer maker CF Industries in merger talks with OCI: WSJ "
    },
    {
        "content": "July 17 U.S. fertilizer maker CF Industries Holdings Inc is in advanced merger talks with Amsterdam-listed chemical company OCI NV  the Wall Street Journal reported.",
        "date": "07172015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "UPDATE 1-Fertilizer maker CF Industries in merger talks with OCI -WSJ "
    },
    {
        "content": "July 17 U.S. fertilizer maker CF Industries Holdings Inc is in advanced merger talks with the Netherlands-based chemical company OCI NV  the Wall Street Journal reported.",
        "date": "07172015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "CF Industries in merger talks with OCI - WSJ "
    },
    {
        "content": "OSLO  July 1 Norway's Yara could increase its dividend after agreeing on Wednesday to sell its 50 percent stake in British fertiliser manufacturer GrowHow UK to joint venture partner CF Industries for a cash payment of $580 million.",
        "date": "07012015",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "Norway's Yara says UK sale to CF Industries could boost dividend "
    },
    {
        "content": "May 6 U.S. fertilizer producer CF Industries  reported lower first-quarter profit on Wednesday after markets closed  with the drop reflecting a one-time gain a year ago from the sale of its phosphate business.",
        "date": "05062015",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "CF Industries posts smaller profit after year-ago sale "
    },
    {
        "content": "U.S. fertilizer producer CF Industries  reported lower fourth quarter profit on Tuesday  and said costs of its nitrogen capacity expansion had risen by 10 percent.",
        "date": "02172015",
        "name": "CF Industries Holdings Inc",
        "news_type": "topStory",
        "symbol": "CF",
        "title": "CF Industries fourth quarter profit slips  expansion costs rise "
    },
    {
        "content": "Feb 17 U.S. fertilizer producer CF Industries  reported lower fourth quarter profit on Tuesday  and said costs of its nitrogen capacity expansion had risen by 10 percent.",
        "date": "02172015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "UPDATE 1-CF Industries 4th qtr profit slips  expansion costs rise "
    },
    {
        "content": "Feb 17 U.S. fertilizer producer CF Industries  reported lower fourth quarter profit on Tuesday.",
        "date": "02172015",
        "name": "CF Industries Holdings Inc",
        "news_type": "normal",
        "symbol": "CF",
        "title": "CF Industries 4th qtr profit slips "
    }
]