[
    {
        "content": "Varo Energy BV's owners  U.S. private equity firm Carlyle Group  and commodities trader Vitol  are looking at an initial public offering next year that could value the European oil refiner at about $2 billion  the Wall Street Journal reported on Wednesday.",
        "date": "11152017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle eyes Varo Energy IPO valuing European refiner at $2 billion: WSJ "
    },
    {
        "content": "Nov 15 Varo Energy BV's owners  U.S. private equity firm Carlyle Group and commodities trader Vitol  are looking at an initial public offering next year that could value the European oil refiner at about $2 billion  the Wall Street Journal reported on Wednesday.",
        "date": "11152017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle eyes Varo Energy IPO valuing European refiner at $2 bln-WSJ "
    },
    {
        "content": "Nov 17 Private equity firms are awash in cash  with nearly US$1trn of available capital  but the industry is facing internal competition as Limited Partner (LP) investors seek to play a more active role in buyouts  according to David Rubenstein  co-founder and co-CEO of the Carlyle Group.",
        "date": "11172017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "LPC - Private equity to face competition from investors - Carlyle Co-CEO "
    },
    {
        "content": "* ‍NIF Group  Inc says have agreed to acquire privately held Agency Intermediaries  Inc. and A.I.I. Insurance brokerage of Mass.  Inc. (A.I.I.)​ Source text for Eikon: Further company coverage:",
        "date": "11142017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-NIF Group acquires Agency Intermediaries "
    },
    {
        "content": "Private equity firm Carlyle Group LP is exploring a sale or initial public offering of Ortho-Clinical Diagnostics Inc  a U.S. diagnostics company that could be valued at more than $7 billion  including debt  people familiar with the matter said.",
        "date": "11102017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Exclusive: Carlyle explores sale or IPO of Ortho-Clinical Diagnostics - sources "
    },
    {
        "content": "* China Literature has market value of nearly $12 bln (Adds closing prices  quotes)",
        "date": "11082017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 4-Tencent's China Literature in smashing debut  boosts outlook for HK tech IPOs "
    },
    {
        "content": "* Valuation for China Literature is way too high - analyst (Recasts with huge demand from retail investors)",
        "date": "11072017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-China Literature IPO raises $1.1 bln amid heavy demand  stellar debut expected "
    },
    {
        "content": "* Carlyle Group says Dynamic Energy Networks forms strategic alliance with Schneider Electric and the Carlyle Group to deliver energy-as-a-service‍​ Source text for Eikon: Further company coverage:",
        "date": "11062017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Dynamic Energy Networks forms strategic alliance with Schneider Electric and Carlyle Group "
    },
    {
        "content": "WASHINGTON/NEW YORK  Nov 2 Jerome Powell was not on President Donald Trump's early radar as a possible successor to Federal Reserve Chair Janet Yellen  and was angling instead for a job as the U.S. central bank's vice chair for supervision.",
        "date": "11022017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 2-Powell rose to top of Trump's list as safe  savvy choice for Fed "
    },
    {
        "content": "WASHINGTON  Nov 2 Jerome Powell was not on President Donald Trump's early radar as a possible successor to Federal Reserve Chair Janet Yellen and was angling instead for a job as the U.S. central bank's vice chair for supervision.",
        "date": "11022017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Fed's Powell rose to top of Trump's list as safe  business-savvy choice "
    },
    {
        "content": "AMSTERDAM Dutch paints maker Akzo Nobel  under pressure after rejecting a lucrative takeover offer and two profit warnings  has confirmed merger talks with smaller U.S. rival Axalta Coating Systems Ltd to create a $30 billion company.",
        "date": "10302017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Akzo Nobel seeks $30 billion merger with smaller U.S. rival Axalta "
    },
    {
        "content": "* Akzo considered buying Axalta in 2014 (Adds industry background  deal rationale  analyst and investor comments)",
        "date": "10302017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 3-New Akzo Nobel boss pursues $30 billion deal with Axalta "
    },
    {
        "content": "* Duff & Phelps to be acquired by the Permira Funds for $1.75 billion",
        "date": "11012017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Duff & Phelps to be acquired by the Permira Funds for $1.75 bln "
    },
    {
        "content": "HONG KONG China Literature  China's No.1 online publisher  and some of its existing shareholders are set to raise a combined HK$8.33 billion ($1.1 billion)  after pricing its Hong Kong public offering at top of the indicative range  the IFR reported.",
        "date": "11012017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Tencent unit raises $1.1 billion after pricing Hong Kong IPO at top end: IFR "
    },
    {
        "content": "* The Carlyle Group announces third quarter 2017 financial results",
        "date": "10312017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-The Carlyle Group announces Q3 earnings per share $0.43 "
    },
    {
        "content": "HONG KONG  Nov 1 China Literature  China's No.1 online publisher  and some of its existing shareholders are set to raise a combined HK$8.33 billion ($1.1 billion)  after pricing its Hong Kong public offering at top of the indicative range  the IFR reported.",
        "date": "11012017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Tencent unit raises $1.1 bln after pricing Hong Kong IPO at top end - IFR "
    },
    {
        "content": "SHANGHAI U.S. fast food giant McDonald's Corp  is getting a name change in China - at least on paper. | Video ",
        "date": "10312017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "'Golden Arches': McDonald's gets new China name following unit sale "
    },
    {
        "content": "HONG KONG China Literature Ltd  China's largest online publishing and e-book company  launched an initial public offering for up to $1.1 billion on Monday  seeking funds for acquisitions and to expand its digital publishing business.",
        "date": "10232017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Tencent unit China Literature launches up to $1.1 billion HK IPO "
    },
    {
        "content": "* MACOM ANNOUNCES SUCCESSFUL DIVESTITURE OF APPLIEDMICRO’S COMPUTE BUSINESS",
        "date": "10272017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-MACOM ANNOUNCES SUCCESSFUL DIVESTITURE OF APPLIEDMICRO'S COMPUTE BUSINESS "
    },
    {
        "content": "* HK bourse has been trying to lure more technology IPOs (Adds details on China Literature  underwriters  Hong Kong technology IPOs)",
        "date": "10232017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Tencent unit China Literature launches up to $1.1 bln HK IPO "
    },
    {
        "content": "FRANKFURT/NEW YORK  Oct 27 Dutch paints and coatings giant Akzo Nobel NV has approached U.S. rival Axalta Coating Systems Ltd to discuss a possible merger that would create a global coatings giant  according to sources familiar with the matter.",
        "date": "10272017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "EXCLUSIVE-Akzo Nobel approaches Axalta about possible merger -sources "
    },
    {
        "content": "Carlyle Group LP  said on Wednesday that Glenn Youngkin and Kewsong Lee would become its co-chief executives  in the U.S. private equity firm's biggest shakeup since it was founded by David Rubenstein  William Conway and Daniel D'Aniello 30 years ago. | Video ",
        "date": "10252017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle Group unveils new leadership as founders step back "
    },
    {
        "content": "Oct 25 Carlyle Group LP said on Wednesday that Glenn Youngkin and Kewsong Lee would become its co-chief executives  in the U.S. private equity firm's biggest shakeup since it was founded by David Rubenstein  William Conway and Daniel D'Aniello 30 years ago.",
        "date": "10252017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "CORRECTED-UPDATE 1-Carlyle Group unveils new leadership as founders step back "
    },
    {
        "content": "Oct 25 Carlyle Group LP said on Wednesday that Glenn Youngkin and Kewsong Lee would become its co-chief executives  in the U.S. private equity firm's biggest shakeup since it was founded by David Rubenstein  William Conway and Daniel D'Aniello 30 years ago.",
        "date": "10252017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "CORRECTED-Carlyle Group unveils new leadership as founders step back "
    },
    {
        "content": "* Carlyle Group LP - Kewsong Lee and Glenn Youngkin will become co-chief executive officers of the Carlyle group ‍​",
        "date": "10252017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-The Carlyle Group names new executive leadership team "
    },
    {
        "content": "BRUSSELS  Oct 19 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10192017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "EU mergers and takeovers (Oct 19) "
    },
    {
        "content": "Oct 16 U.S. private equity firm Carlyle Group LP and asset manager OppenheimerFunds Inc will form a joint venture to provide wealth management services to rich investors in the United States  the companies said on Monday.",
        "date": "10162017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle  OppenheimerFunds form wealth management venture "
    },
    {
        "content": "* OppenheimerFunds and the Carlyle Group form joint venture for Wealth Market",
        "date": "10162017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-OppenheimerFunds and the Carlyle Group form joint venture for Wealth Market "
    },
    {
        "content": "Sept 29 Carlyle Group LP signed a definitive agreement to sell  Klenk Holz AG  its German building materials unit  to Binderholz GmbH  the private equity firm said on Friday.",
        "date": "09292017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle Group to sell Klenk Holz unit to Binderholz "
    },
    {
        "content": "* Nikkei says Nippon Life to take 20-30 pct stake (Adds background)",
        "date": "09272017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Nippon Life in talks for stake in US fund manager TCW-sources "
    },
    {
        "content": "NEW YORK  Sept 28 Private equity firm The Carlyle Group is exploring a sale of portfolio company Array Marketing Group  a Canadian provider of retail merchandising displays  that could value it as much as US$1bn  according to two sources familiar with the matter.",
        "date": "09282017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "LPC: Carlyle explores sale of in-store marketer Array "
    },
    {
        "content": "* Further details of the transaction were not disclosed Source: http://bit.ly/2xKtV7s Further company coverage:",
        "date": "09292017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-Carlyle Group to sell Klenk Holz AG to Binderholz‍​ "
    },
    {
        "content": "TOKYO  Sept 27 Japan's biggest private-sector life insurer  Nippon Life Insurance Co  is in talks to buy a minority stake in U.S. investment company TCW Group  sources with direct knowledge of the deal said on Wednesday.",
        "date": "09272017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Nippon Life in talks to buy minority stake in TCW -sources "
    },
    {
        "content": "ISTANBUL U.S. private equity firm Carlyle Group  is looking to sell its 30 percent stake in Turkish lingerie and swimwear retailer Penti and has mandated Goldman Sachs  to advise on the sale  three people familiar with the matter said.",
        "date": "09282017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle mandates Goldman Sachs to sell stake in Turkey's Penti: sources "
    },
    {
        "content": "ISTANBUL  Sept 28 U.S. private equity firm Carlyle Group is looking to sell its 30 percent stake in Turkish lingerie and swimwear retailer Penti and has mandated Goldman Sachs to advise on the sale  three people familiar with the matter said.",
        "date": "09282017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle mandates Goldman Sachs to sell stake in Turkey's Penti - sources "
    },
    {
        "content": "BUCHAREST  Sept 28 An EU-backed natural gas pipeline to connect Bulgaria  Romania  Hungary and Austria and ease reliance on Russian gas will proceed as planned despite a recent setback  officials said on Thursday.",
        "date": "09282017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Gas pipeline through central Europe to go ahead as planned -Romania "
    },
    {
        "content": "ISTANBUL  Sept 28 U.S. private equity firm Carlyle Group is looking to sell its 30 percent stake in Turkish lingerie and swimwear retailer Penti and has mandated Goldman Sachs to advise on the deal  three people familiar with the matter said.",
        "date": "09282017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle mandates Goldman Sachs to sell stake in Turkey's Penti - sources "
    },
    {
        "content": "U.S. private equity firm Carlyle Group is quitting its decade-long mining services play in Australia through the A$517 million ($414 million) sale of its controlling stake in the highly leveraged earth-moving equipment provider Coates Hire.",
        "date": "09202017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "U.S. Carlyle Group exits Australian mining services play Coates Hire "
    },
    {
        "content": "Sept 20 Australian diversified investment company Seven Group Holdings on Wednesday said it would buy the stake it does not already own in earth-moving equipment provider Coates Hire from Carlyle Group and minority owners for A$513 million ($410.66 million).",
        "date": "09192017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Australia's Seven Group to buy remaining stake in Coates Hire from Carlyle "
    },
    {
        "content": "Sept 20 U.S. private equity firm Carlyle Group is quitting its decade-long mining services play in Australia through the A$517 million ($414 million) sale of its controlling stake in the highly leveraged earth-moving equipment provider Coates Hire.",
        "date": "09202017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 3-U.S. Carlyle Group exits Australian mining services play Coates Hire "
    },
    {
        "content": "SAO PAULO  Sept 15 A Brazilian land developer controlled by U.S. buyout firm Carlyle Group LP investment vehicles has appointed turnaround specialist Ivix Value Creation to help it reverse mounting client lawsuits and avoid filing for bankruptcy protection.",
        "date": "09152017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle's Brazil developer bets on fresh leaders to woo creditors "
    },
    {
        "content": "HONG KONG Private equity firm Carlyle Group is planning a sale of South Korean security systems company ADT Caps in what could be the country's biggest M&A deal in two years  sources with knowledge of the matter said.",
        "date": "09132017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle to sell South Korean security firm ADT Caps: sources "
    },
    {
        "content": "* Equinix to expand into Spain and Portugal through acquisition of Itconic",
        "date": "09112017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Equinix to expand into Spain and Portugal through acquisition of Itconic "
    },
    {
        "content": "* ADT Caps sale process to launch this year - source (Adds Carlyle declined to comment  sale process to launch by year end)",
        "date": "09132017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle to sell South Korean security firm ADT Caps - sources "
    },
    {
        "content": "HONG KONG  Sept 13 Private equity firm Carlyle Group is planning a sale of South Korean security systems company ADT Caps  in what could be the country's biggest M&A deal in two years  sources with knowledge of the matter said.",
        "date": "09132017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle to sell South Korean security firm ADT Caps - sources "
    },
    {
        "content": "* The Carlyle Group acquires United Road Services  provider of finished vehicle transport and logistics in North America",
        "date": "09052017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-The Carlyle Group acquires United Road Services "
    },
    {
        "content": "* Carlyle Group Lp - ‍pricing of a $400 million offering of 16 million of its 5.875% series a preferred units​",
        "date": "09062017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Carlyle prices offering of $400 mln in preferred units "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 06 (Fitch) Fitch Ratings expects to rate The Carlyle Group L.P.'s (Carlyle) perpetual preferred units 'BBB-(EXP)'. The preferred units are expected to be subordinated to existing unsecured debt but senior to common units. Distributions  when and if declared by the board of directors  will be payable quarterly at a fixed annual rate. Distributions on the preferred units are non-cumulative. Unless distributions have be",
        "date": "09062017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Fitch Expects to Rate Carlyle Group Preferred Issuance 'BBB-' "
    },
    {
        "content": "* Carlyle Group files for potential offering of units representing LP interests & preferred units representing lp interests; size undisclosed - sec filing",
        "date": "09062017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-Carlyle Group files for potential offering of units representing LP interests  preferred units representing Lp interests "
    },
    {
        "content": "* The Carlyle Group to acquire French insurance software vendor Prima Solutions",
        "date": "09062017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-The Carlyle Group to acquire French insurance software vendor Prima Solutions "
    },
    {
        "content": "* The Carlyle Group and management close majority investment in Thomas Scientific‍​",
        "date": "09012017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Carlyle Group and management close majority investment in Thomas Scientific‍​ "
    },
    {
        "content": "* AMRI announces completion of acquisition by the Carlyle Group and GTCR",
        "date": "08312017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-AMRI announces completion of acquisition by Carlyle Group  GTCR "
    },
    {
        "content": "Buyout firm Carlyle Group LP on Wednesday posted quarterly earnings that topped expectations while rival Apollo Global Management LLC's profits matched estimates as risk-taking investors facing a low-interest rate environment poured more money into their funds.",
        "date": "08022017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle beats view in second quarter  Apollo matches; both draw more cash "
    },
    {
        "content": "Aug 2 Buyout firm Carlyle Group LP on Wednesday posted quarterly earnings that topped expectations while rival Apollo Global Management LLC's profits matched estimates as risk-taking investors facing a low-interest rate environment poured more money into their funds.",
        "date": "08022017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle beats view in 2nd qtr  Apollo matches; both draw more cash "
    },
    {
        "content": "NEW YORK  Aug 2 Private equity firm Carlyle Group LP posted better-than-expected second-quarter earnings on Wednesday  mirroring the performance of some of its peers as rising stock markets and a resilient world economy lifted investment returns.",
        "date": "08022017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle posts better-than-expected quarterly earnings "
    },
    {
        "content": "* The Carlyle Group announces second quarter 2017 financial results",
        "date": "08022017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-Carlyle Group Q2 earnings per share $0.59 "
    },
    {
        "content": "* Epic Insurance Brokers & Consultants- Oak Hill agreed to acquire all of Carlyle Group's stake  giving Oak Hill a controlling equity position in Epic‍​",
        "date": "07272017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Epic Insurance Brokers & Consultants says Oak Hill agreed to buy all of Carlyle Group's stake in co‍​ "
    },
    {
        "content": "An affiliate of buyout firm Carlyle  will buy a 26 percent stake in each of two credit card joint ventures of State Bank of India   the top Indian lender said on Friday.",
        "date": "07212017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle affiliate to buy 26 percent in State Bank of India credit cards JVs "
    },
    {
        "content": "July 21 An affiliate of buyout firm Carlyle will buy a 26 percent stake in each of two credit card joint ventures of State Bank of India  the top Indian lender said on Friday.",
        "date": "07212017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle affiliate to buy 26 pct in State Bank of India credit cards JVs "
    },
    {
        "content": "Private equity firm Carlyle Group LP is looking to raise $15 billion for its next U.S. buyout fund  Bloomberg reported on Monday  citing people familiar with the matter.",
        "date": "07242017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle seeks $15 billion for its seventh U.S. buyout fund: Bloomberg "
    },
    {
        "content": "July 24 Private equity firm Carlyle Group LP is looking to raise $15 billion for its next U.S. buyout fund  Bloomberg reported on Monday  citing people familiar with the matter.",
        "date": "07242017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle seeks $15 billion for its seventh U.S. buyout fund - Bbg "
    },
    {
        "content": "* Carlyle is said to seek $15 billion for next U.S. buyout fund - Bloomberg  citing sources Source text: https://bloom.bg/2eIENM5",
        "date": "07242017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-Carlyle is said to seek $15 bln for next U.S. buyout fund - Bloomberg "
    },
    {
        "content": "* Following transaction close KKR will be majority owner of Nature's Bounty while Carlyle will retain a significant stake in co",
        "date": "07242017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-KKR to acquire majority control of the Nature’s Bounty Co. from the Carlyle Group "
    },
    {
        "content": "TORONTO/NEW YORK  July 19 Canadian pension plan Ontario Municipal Employees Retirement System has been talking with major U.S. and Canadian private equity firms about selling land registry company Teranet in a deal that could fetch about C$3 billion ($2.4 billion)  according to people familiar with the situation.",
        "date": "07192017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "OMERS in talks with buyout firms about C$3 bln Teranet sale -sources "
    },
    {
        "content": "MONTEREY  Calif.  July 17 The California Public Employees' Retirement System (CalPERS) on Monday said it was considering making direct investments in private companies  a potential major shift in strategy that would be the first such action by a U.S. public pension fund.",
        "date": "07182017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "CalPERS says considering making own private equity investments "
    },
    {
        "content": "LONDON/FRANKFURT Buyout group Carlyle has agreed to buy airfield lighting group ADB Safegate at a valuation of about 900 million euros ($1 billion) including debt  sources familiar with the matter said.",
        "date": "07152017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle to buy airfield lighting group ADB Safegate: sources "
    },
    {
        "content": "LONDON/FRANKFURT  July 15 Buyout group Carlyle has agreed to buy airfield lighting group ADB Safegate at a valuation of about 900 million euros ($1 billion) including debt  sources familiar with the matter said.",
        "date": "07152017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle to buy airfield lighting group ADB Safegate -sources "
    },
    {
        "content": "LONDON  July 17 US buyout firm Carlyle Group’s acquisition of airfield lighting group ADB Safegate will be backed with €685m of debt financing  banking sources said on Monday.",
        "date": "07172017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "UPDATE 1-LPC-Carlyle’s ADB Safegate buy backed with €685m of debt "
    },
    {
        "content": "FRANKFURT/LONDON Private equity investment firm Carlyle  is preparing a sale of one of Germany's top three nursing home operators  Alloheim  as it seeks to benefit from high valuations for healthcare assets  people close to the matter said.",
        "date": "07142017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle prepares sale of German nursing home group Alloheim: sources "
    },
    {
        "content": "LONDON  July 17 US buyout firm Carlyle Group’s acquisition of airfield lighting group ADB Safegate will be backed with around €600m of debt financing  banking sources said on Monday.",
        "date": "07172017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "LPC-Carlyle’s ADB Safegate buy backed with approx €600m of debt "
    },
    {
        "content": "July 17 U.S. buyout firm Carlyle Group LP said it agreed to buy airfield lighting group ADB Safegate from private equity group PAI Partners.",
        "date": "07172017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle to buy airfield lighting group ADB Safegate "
    },
    {
        "content": "* Alloheim may be valued at up to 1 bln eur - sources (Adds background  detail)",
        "date": "07142017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle prepares sale of German nursing home group Alloheim - sources "
    },
    {
        "content": "FRANKFURT/LONDON  July 14 Buyout group Carlyle is preparing a sale of German nursing home operator Alloheim as it seeks to benefit from buoyant equities markets  people close to the matter said.",
        "date": "07142017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle preps sale of German nursing home group Alloheim - sources "
    },
    {
        "content": "* Carlyle Group LP says reached settlements with investors in two commodities investment vehicles managed by an affiliate of partnership - sec filing",
        "date": "07062017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Carlyle Group says reached settlements with investors in 2 commodities investment vehicles managed by affiliate of partnership "
    },
    {
        "content": "* Bank of America  Credit Suisse  Morgan Stanley hired as sponsors",
        "date": "07042017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Tencent's online publisher files for Hong Kong IPO seen worth $800 mln "
    },
    {
        "content": "* AMRI announces early termination of Hart-Scott-Rodino waiting period for the Carlyle Group and GTCR's proposed acquisition of AMRI",
        "date": "06292017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-AMRI announces early termination of HSR waiting period for Carlyle Group  GTCR's proposed acquisition "
    },
    {
        "content": "* Carlyle Group enters London flexible office and co-working sector with commitment to invest £150 million into launch of ‘uncommon’ brand",
        "date": "06162017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Carlyle Group enters London flexible office and co-working sector "
    },
    {
        "content": "June 6 Contract research company Albany Molecular Research Inc said on Tuesday it would be bought by private equity firms Carlyle Group LP and GTCR LLC for about $922 million in cash.",
        "date": "06062017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "GTCR  Carlyle to buy contract research firm Albany Molecular "
    },
    {
        "content": "* Albany Molecular shares jump as much as 8.9 pct (Adds analyst comment)",
        "date": "06062017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 4-GTCR  Carlyle to buy contract research firm Albany Molecular "
    },
    {
        "content": "* AMRI signs definitive agreement to be acquired by the Carlyle Group and GTCR for $21.75 per share in cash",
        "date": "06062017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-AMRI to be acquired by the Carlyle Group and GTCR "
    },
    {
        "content": "* Carlyle and EOG Resources announce $400 million drilling partnership",
        "date": "05222017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Carlyle and EOG Resources announce $400 mln drilling partnership "
    },
    {
        "content": "LONDON U.S. private equity firm Carlyle Group is suing a group of its insurers over $400 million worth of oil it claims it lost when Morocco's sole refinery went bankrupt two years ago  court documents show.",
        "date": "05222017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle battles insurers in New York over Moroccan oil losses "
    },
    {
        "content": "LONDON  May 22 U.S. private equity firm Carlyle Group is suing a group of its insurers over $400 million worth of oil it claims it lost when Morocco's sole refinery went bankrupt two years ago  court documents show.",
        "date": "05222017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "REFILE-Carlyle battles insurers in New York over Moroccan oil losses "
    },
    {
        "content": "NEW YORK Private equity firm Carlyle Group LP  posted first quarter earnings that handily beat expectations on Wednesday  in line with its peers  after a buoyant stock market lifted investment returns across the industry.",
        "date": "05032017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle results blow past forecasts  aided by stock rally "
    },
    {
        "content": "NEW YORK  May 3 Private equity firm Carlyle Group LP posted first quarter earnings that handily beat expectations on Wednesday  in line with its peers  after a buoyant stock market lifted investment returns across the industry.",
        "date": "05032017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle results blow past forecasts  aided by stock rally "
    },
    {
        "content": "NEW YORK  May 3 Private equity firm Carlyle Group LP posted first quarter earnings that handily beat expectations on Wednesday  in line with its peers  after a buoyant stock market lifted investment returns across the industry.",
        "date": "05032017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle Q1 results blow past forecasts  aided by stock rally "
    },
    {
        "content": "* The Carlyle group announces first quarter 2017 financial results",
        "date": "05032017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-Carlyle group Qtrly revenue $1.12 bln vs. $483.1 million "
    },
    {
        "content": "* Pharmaceutical Product Development -existing owners  affiliates of hellman & friedman carlyle group  entered into agreements to recapitalize co",
        "date": "04262017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Pharmaceutical Product Development  Carlyle Group  and others enter into agreements to recapitalize company "
    },
    {
        "content": "MILAN  April 14 U.S. private equity group Carlyle Group has gained full control of Italian fashion brand TWINSET by buying the remaining 10 percent stake from founder Simona Barbieri  who will step down as the affordable luxury label's creative director.",
        "date": "04142017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle takes full control of Italian fashion brand TWINSET "
    },
    {
        "content": "MADRID Spanish media company Prisa  has received three bids from investment firms Carlyle   PAI Partners and Rhone Capital for its 75 percent stake in Santillana publishing group  three sources with knowledge of the matter said on Friday.",
        "date": "03312017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle  PAI  Rhone Capital bid for Prisa unit Santillana: sources "
    },
    {
        "content": "MADRID  March 31 Spanish media company Prisa has received three bids from investment firms Carlyle   PAI Partners and Rhone Capital for its 75 percent stake in Santillana publishing group  three sources with knowledge of the matter said on Friday.",
        "date": "03312017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle  PAI  Rhone Capital bid for Prisa unit Santillana - sources "
    },
    {
        "content": "LONDON Carlyle Group  has bought Royal Dutch Shell's  onshore oil fields in Gabon for $587 million  continuing the growing trend of private equity investors looking to squeeze extra profit from oil majors' unloved assets.",
        "date": "03242017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle extends private equity oil rush with $587 million Shell deal "
    },
    {
        "content": "* Deal expected to complete summer 2017   (Recasts  adds detail  background  analyst)",
        "date": "03242017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle extends private equity oil rush with $587 mln Shell deal "
    },
    {
        "content": "LONDON  March 24 Carlyle Group has bought Royal Dutch Shell's onshore assets in Gabon for $587 million as the world's largest private equity fund expands in the global oil and gas sector.",
        "date": "03242017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Shell sells onshore Gabon oil assets to Carlyle for $587 mln "
    },
    {
        "content": "NEW DELHI  March 24 The Carlyle Group has acquired a minority stake in Indian logistics firm Delhivery  while existing investor hedge fund Tiger Global also raised its stake  for a combined investment of more than $100 million  the buyout fund said on Friday.",
        "date": "03242017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle Group takes minority stake in Indian logistics firm Delhivery "
    },
    {
        "content": "* Carlyle Group acquires significant minority stake in Delhivery",
        "date": "03242017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-Carlyle Group acquires significant minority stake in India's Delhivery "
    },
    {
        "content": "BERLIN  March 1 Co-chief executive of buyout fund Carlyle Group David Rubenstein said on Wednesday private equity investors in the energy  healthcare  industrial and financial sectors are likely to benefit from the new U.S. administration.",
        "date": "03012017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Energy  financial sectors to benefit from Trump -Carlyle co-CEO "
    },
    {
        "content": "HONG KONG  Feb 20 The Hong Kong Confederation of Trade Unions (HKCTU) warned that McDonald's Corp's up-to-$2.1 billion sale of its Hong Kong and China operations could hit workers' pay  adding to growing criticism of the deal on the mainland and elsewhere.",
        "date": "02202017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Hong Kong union joins critics of McDonald's HK  China sale  sees pay squeeze "
    },
    {
        "content": "HONG KONG  Feb 20 The Hong Kong Confederation of Trade Unions (HKCTU) warned that McDonald's Corp's up-to-$2.1 billion sale of its Hong Kong and China operations could hit workers' pay  adding to growing criticism of the deal on the mainland and elsewhere.",
        "date": "02202017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Hong Kong union joins critics of McDonald's HK  China sale  sees pay squeeze "
    },
    {
        "content": "Auto repair-center operator Service King Paint & Body LLC  owned by Blackstone Group LP and Carlyle Group LP  is considering a potential sale of the company for more than $2 billion  Bloomberg reported citing sources.",
        "date": "02142017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Blackstone and Carlyle Group consider sale of Service King: Bloomberg "
    },
    {
        "content": "Feb 13 Auto repair-center operator Service King Paint & Body LLC  owned by Blackstone Group LP and Carlyle Group LP  is considering a potential sale of the company for more than $2 billion  Bloomberg reported citing sources.",
        "date": "02142017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "REFILE-Blackstone and Carlyle Group consider sale of Service King -Bloomberg "
    },
    {
        "content": "NEW YORK  Feb 8 Private equity firm Carlyle Group L.P. posted sharply lower-than-expected fourth-quarter earnings on Wednesday after taking losses on a hedge fund business that it has since exited.",
        "date": "02082017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle earnings miss forecasts on hedge fund losses "
    },
    {
        "content": "SAO PAULO A Brazilian land developer controlled by Carlyle Group LP  investment vehicles is buckling under mounting client and creditor lawsuits and an unsustainable debt load  highlighting legal risks facing global buyout giants in Latin America's No. 1 economy.",
        "date": "02132017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Exclusive: Carlyle's Brazil developer battles mounting client  creditor lawsuits "
    },
    {
        "content": "NEW YORK  Feb 8 Private equity firm Carlyle Group L.P. posted sharply lower-than-expected fourth-quarter earnings on Wednesday following losses in its hedge fund businesses that it has since exited.",
        "date": "02082017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle earnings miss forecasts on hedge fund losses "
    },
    {
        "content": "* The Carlyle Group announces fourth quarter and full year 2016 financial results",
        "date": "02082017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-Carlyle Group reports Q4 loss per share $0.16 "
    },
    {
        "content": "Laboratory Corporation of America Holdings (LabCorp) is in talks to acquire contract researcher Pharmaceutical Product Development LLC (PPD) for more than $8 billion  including debt  people familiar with the matter said on Friday.",
        "date": "02032017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Exclusive: LabCorp explores acquisition of clinical trials firm PPD - sources "
    },
    {
        "content": "NEW YORK  Jan 30 (IFR) - Carlyle Group has hired Craig Farr  KKR's former global head of capital markets  as a senior advisor for its credit business  the private equity giant said on Monday.",
        "date": "01302017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "MOVES-Former KKR capital markets head Farr joins Carlyle "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Nutritional supplements are having a healthy effect on Carlyle. The buyout firm may be ready to part with Nature's Bounty. At the $6 billion price tag reported by Bloomberg  it would deliver a substantial return for what was a pivotal deal in 2010.",
        "date": "02012017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle gets a boost from an LBO multivitamin "
    },
    {
        "content": "LONDON Carlyle Group  has agreed to become the largest shareholder in Johannesburg-based Global Credit Ratings (GCR)  the U.S. buyout fund said on Tuesday  looking to broaden the pan-African ratings agency's services.",
        "date": "01172017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle to become largest shareholder in South Africa's Global Credit Ratings "
    },
    {
        "content": "LONDON  Jan 17 Carlyle Group has agreed to become the largest shareholder in Johannesburg-based Global Credit Ratings (GCR)  the U.S. buyout fund said on Tuesday  looking to broaden the pan-African ratings agency's services.",
        "date": "01172017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 2-Carlyle to become largest shareholder in South Africa's Global Credit Ratings "
    },
    {
        "content": "LONDON  Jan 17 Carlyle Group has agreed to acquire Johannesburg-based ratings agency Global Credit Ratings (GCR)  a spokeswoman for the U.S. buyout fund said on Tuesday.",
        "date": "01172017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle to buy South Africa's Global Credit Ratings "
    },
    {
        "content": "Jan 9 Citic Ltd and Carlyle Group LP  would buy a majority interest in McDonald's Corp's  mainland China and Hong Kong businesses for $2.08 billion  the companies said.",
        "date": "01092017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "CORRECTED-Citic  Carlyle to buy stake in McDonald's China  HK businesses for $2.08 bln "
    },
    {
        "content": " ",
        "date": "01092017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 2-McDonald's sells most of China  HK business to CITIC  Carlyle for $2.1 bln "
    },
    {
        "content": "Private equity firm Carlyle Group LP has hired investment bank Goldman Sachs Group Inc to help it explore the sale of one of the largest U.S. herbal supplement makers  Nature's Bounty Co  people familiar with the matter said.",
        "date": "01072017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle hires Goldman Sachs to help sell Nature's Bounty -sources "
    },
    {
        "content": " ",
        "date": "01092017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-McDonald's sells China stake to Citic  Carlyle Group for about $2 bln "
    },
    {
        "content": "Private equity firm Carlyle Group LP  has hired investment bank Goldman Sachs Group Inc  to help it explore the sale of one of the largest U.S. herbal supplement makers  Nature's Bounty Co  people familiar with the matter said.",
        "date": "01072017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle hires Goldman Sachs to help sell Nature's Bounty: sources "
    },
    {
        "content": "Jan 6 Carlyle Group LP is exploring a sale of nutritional-supplements maker Nature's Bounty Co  Bloomberg reported  citing people familiar with the matter.",
        "date": "01062017",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle explores sale of vitamin maker Nature's Bounty - Bloomberg "
    },
    {
        "content": "Jan 6 Private equity firm Carlyle Group LP  has hired investment bank Goldman Sachs Group Inc  to help it explore the sale of one of the largest U.S. herbal supplement makers  Nature's Bounty Co  people familiar with the matter said.",
        "date": "01072017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 2-Carlyle hires Goldman Sachs to help sell Nature's Bounty -sources "
    },
    {
        "content": "* Carlyle Group Lp is exploring a sale of nutritional-supplements maker Nature's Bounty Co - Bloomberg  citing sources  Source text - http://bloom.bg/2hXeEtF Further company coverage:    (Bengaluru Newsroom)",
        "date": "01062017",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-Carlyle Group Lp exploring a sale of nutritional-supplements maker Nature's Bounty Co - Bloomberg "
    },
    {
        "content": "SAO PAULO Brazilian travel agency CVC Brasil Operadora e Agencia de Viagens SA  will buy smaller rival Experimento for 41 million reais ($13 million)  the company said in a securities filing on Thursday.",
        "date": "12292016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Brazilian travel agency CVC buys smaller rival for $13 million "
    },
    {
        "content": "Republican U.S. President-elect Donald Trump resumed meetings at his Mar-a-Lago resort in Palm Beach  Florida  following the Christmas holiday as he prepares to take over the White House from Democrat Barack Obama on Jan. 20.",
        "date": "12292016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Factbox: Trump to meet heads of Carlyle Group  Marvel  World Jewish Congress "
    },
    {
        "content": "A consortium led by private-equity firm Carlyle Group  and Chinese conglomerate Citic Group Corp has neared a deal to buy McDonald's Corp's  stores in China and Hong Kong for up to $3 billion  a source with direct knowledge of the matter said. | Video ",
        "date": "12022016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Citic-Carlyle near deal to buy McDonald's China assets: source "
    },
    {
        "content": "LONDON  Nov 25 Royal Dutch Shell is in advanced talks with a party interested in buying its onshore operations in Gabon as part of a $30 billion divestment plan following its purchase of BG Group  which was completed in February..",
        "date": "11252016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 2-Shell in talks over Gabon sale as seeks to hit divestment target "
    },
    {
        "content": "BRUSSELS  Nov 25 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "11252016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "EU mergers and takeovers (Nov 25) "
    },
    {
        "content": "* The Carlyle Group has agreed to acquire a controlling interest in KAP Beteiligungs-AG (KAP)  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "11182016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-KAP Beteiligungs: Carlyle Group to acquire a controlling interest in KAP Beteiligungs-AG "
    },
    {
        "content": "Varo Energy  a joint venture between the world's top oil trader Vitol and private equity firm Carlyle Group  says it has signed an agreement to acquire 100 percent of the shares in Inter Oil B.V.  the holding company of retail and wholesale businesses operating under the brand names \"Brand Oil\" and \"Amigo\" in the Netherlands",
        "date": "11142016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Vitol-Carlyle venture to buy Dutch firm Inter Oil B.V "
    },
    {
        "content": "** Varo Energy  a joint venture between the world's top oil trader Vitol and private equity firm Carlyle Group  says it has signed an agreement to acquire 100 percent of the shares in Inter Oil B.V.  the holding company of retail and wholesale businesses operating under the brand names \"Brand Oil\" and \"Amigo\" in the Netherlands",
        "date": "11142016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Vitol-Carlyle venture to buy Dutch firm Inter Oil B.V. "
    },
    {
        "content": "* Sale of 19.7 million shares of its common stock on an underwritten basis by an affiliate of Carlyle Group",
        "date": "11102016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-CommScope Holding Company says sale of 19.7 million shares "
    },
    {
        "content": "* Blackstone Group  Carlyle Group LP  KKR & Co among buyout firms in talks with banks for financing to back bids for Valeant's Australian drug unit - Bloomberg",
        "date": "11102016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-Blackstone  Carlyle  KKR among firms in talks to bid for Valeant's Inova unit - Bloomberg "
    },
    {
        "content": "Nov 2 Japan's Fujifilm Holdings Corp is in final talks to buy Takeda Pharmaceutical Co's 70 percent stake in Wako Pure Chemical Industries for about 200 billion yen ($1.94 billion)  the Nikkei business daily reported on Wednesday.",
        "date": "11022016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Fujifilm close to deal to buy Takeda research reagent unit-Nikkei "
    },
    {
        "content": "HONG KONG  Oct 27 Carlyle Group LP and Bain Capital LLC are the only major global buyout firms left bidding for McDonald's Corp's restaurants in China and Hong Kong after TPG Capital Management LP pulled out  people close to the matter said on Thursday.",
        "date": "10272016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle  Bain to battle for McDonald's China assets as TPG pulls out "
    },
    {
        "content": "NEW YORK Private equity firm Carlyle Group L.P.  on Wednesday warned of more losses in its hedge fund and commodities investments  after posting lower-than-expected third-quarter earnings as it set aside $100 million for ongoing lawsuits.",
        "date": "10262016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Buyout firm Carlyle eyes more hedge fund losses  lawsuits drag "
    },
    {
        "content": "NEW YORK  Oct 26 Private equity firm Carlyle Group L.P. on Wednesday warned of more losses in its hedge fund and commodities investments  after posting lower-than-expected third-quarter earnings as it set aside $100 million for ongoing lawsuits.",
        "date": "10262016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 2-Buyout firm Carlyle eyes more hedge fund losses  lawsuits drag "
    },
    {
        "content": "NEW YORK  Oct 26 Private equity firm Carlyle Group L.P. reported lower-than-expected third-quarter earnings on Wednesday  after some of its investments failed to beat gains in the broader U.S. stock market and despite a strong rebound in oil prices.",
        "date": "10262016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Buyout firm Carlyle misses forecasts in Q3 earnings "
    },
    {
        "content": "* The Carlyle Group announces third quarter 2016 financial results",
        "date": "10262016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-The carlyle reports Q3 loss per share of $0.02 "
    },
    {
        "content": "NEW YORK  Oct 12 Erica Frontiero has joined alternative asset manager The Carlyle Group as managing director and head of capital markets for the firm's private credit group  part of Carlyle's global market strategies business  according to sources.",
        "date": "10122016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "MOVES-Antares' Frontiero moves to Carlyle as head of capital markets "
    },
    {
        "content": "PARIS  Oct 7 Total has agreed to sell its speciality chemicals business Atotech to private equity firm Carlyle Group for $3.2 billion  part of a $10 billion asset sale programme the French oil firm hopes to complete by the end of 2017.",
        "date": "10072016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "UPDATE 1-Total sells Atotech chemicals unit to Carlyle for $3.2 bln "
    },
    {
        "content": "PARIS  Oct 7 Total has agreed to sell its speciality chemicals arm Atotech for $3.2 billion to private equity firm Carlyle Group  part of a programme under which the French oil company hopes to divest $10 billion worth of non-core assets by 2017.",
        "date": "10072016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Total sells Atotech speciality chemical arm to Carlyle for $3.2 bln "
    },
    {
        "content": "Sept 28 Motoring group AA Plc reported a 2.2 percent rise in revenue in the first half of its financial year on Wednesday  helped by growth in customers using its roadside assistance service.",
        "date": "09292016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "REFILE-Motoring group AA posts H1 revenue rise  sees no Brexit impact (Sept 28) "
    },
    {
        "content": "JOHANNESBURG Private equity firm Carlyle Group LP  said it will buy a majority stake in South African promotional products and clothing supplier Amrod and plans to expand the business in other markets.",
        "date": "09262016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle to buy South Africa's promotional products supplier "
    },
    {
        "content": "JOHANNESBURG  Sept 26 Private equity firm Carlyle Group LP said it will buy a majority stake in South African promotional products and clothing supplier Amrod and plans to expand the business in other markets.",
        "date": "09262016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "CORRECTION-Carlyle to buy South Africa's promotional products supplier "
    },
    {
        "content": "* Commscope announces sale of 10 million shares of common stock by affiliate of the carlyle group",
        "date": "09202016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Commscope Holding Co says announces sale of 10 mln shares by affiliate of Carlyle Group "
    },
    {
        "content": "LONDON  Sept 13 A consortium including former Barclays chief Bob Diamond remains in the hunt to buy a stake in the British lender's African business  sources with knowledge of the matter said on Tuesday  despite the withdrawal of Carlyle Group.",
        "date": "09132016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Ex-Barclays chief Diamond remains in Africa hunt despite Carlyle exit -sources "
    },
    {
        "content": "NEW YORK  Sept 14 (IFR) - Boris Okuliar  a former UBS banker who was hired by The Carlyle Group in 2014 to bolster its credit investments unit  left the firm last week to join rival Ares Management in London.",
        "date": "09142016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "MOVES-Okuliar joins Ares Management from Carlyle "
    },
    {
        "content": "HONG KONG Private equity firm Carlyle Group LP  launched on Tuesday the sale of a stake in Australian diversified logistics company Qube Holdings Ltd  worth $264 million  IFR reported citing a term sheet of the transaction.",
        "date": "08302016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle launches $264 million selldown in Australian logistics firm Qube: IFR "
    },
    {
        "content": "HONG KONG  Aug 30 Private equity firm Carlyle Group LP launched on Tuesday the sale of a stake in Australian diversified logistics company Qube Holdings Ltd  worth $264 million  IFR reported citing a term sheet of the transaction.",
        "date": "08302016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle launches $264 mln selldown in Australian logistics firm Qube -IFR "
    },
    {
        "content": "HONG KONG  Aug 26 China Vanke Co Ltd   is seeking to buy Central Plaza in Shanghai from private equity firm Carlyle Group for around 2.46 billion yuan ($368.94 million)  Basis Point reported on Friday  quoting sources.",
        "date": "08262016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "China Vanke plans to buy Shanghai office tower from Carlyle for $369 mln - Basis Point "
    },
    {
        "content": "SEOUL Korea Electric Power Corp (KEPCO) signed a contract on Aug. 26 to buy a solar power plant from the U.S.-based Carlyle Group’s Cogentrix Solar Holdings  KEPCO said in a statement released on Sunday.",
        "date": "08282016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "South Korea’s KEPCO buys Colorado solar power plant from Carlyle Group "
    },
    {
        "content": "SEOUL  Aug 28 Korea Electric Power Corp (KEPCO)  signed a contract on Aug. 26 to buy a solar power plant from the U.S.-based Carlyle Group's Cogentrix Solar Holdings  KEPCO said in a statement released on Sunday.",
        "date": "08282016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "S.Korea's KEPCO buys Colorado solar power plant from Carlyle Group "
    },
    {
        "content": "Aug 24 The partners of Emerging Sovereign Group LLC (ESG) have agreed to buy back the majority stake in the emerging markets-focused hedge fund manager that was acquired by Carlyle Group LP in 2011  a Carlyle spokesman said on Wednesday.",
        "date": "08242016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Emerging markets-focused hedge fund ESG to separate from Carlyle "
    },
    {
        "content": "Aug 24 The partners of Emerging Sovereign Group LLC (ESG) have agreed to buy back the majority stake in the emerging markets-focused hedge fund manager that was acquired by Carlyle Group LP in 2011  Carlyle said on Wednesday.",
        "date": "08242016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Emerging markets-focused hedge fund ESG to separate from Carlyle "
    },
    {
        "content": "* CommScope announces sale of 7 million shares of common stock by affiliate of the Carlyle Group",
        "date": "08232016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-CommScope announces sale of 7 mln shares of common stock "
    },
    {
        "content": "HONG KONG Private equity firm Carlyle Group LP  will focus its Asia real estate investments on logistics and office projects in China  optimistic that the country's e-commerce boom will drive growth in those sectors despite a slowing economy.",
        "date": "08172016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle to focus Asia real estate investment on China logistics "
    },
    {
        "content": "* China e-commerce boom to fuel demand for logistics  warehouses",
        "date": "08172016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "INTERVIEW-Carlyle to focus Asia real estate investment on China logistics "
    },
    {
        "content": "SAO PAULO Carlyle Group LP and Brazilian investor Guilherme Paulus raised a combined 1.230 billion reais ($394 million) from the partial sale of their stakes in Brazilian travel agency CVC Brasil Operadora SA    a sign investors are slowly returning to Latin America's largest equity market.",
        "date": "08112016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle  founder raise $394 million in partial exit from Brazil's CVC "
    },
    {
        "content": "SAO PAULO  Aug 11 Carlyle Group LP and Brazilian investor Guilherme Paulus raised a combined 1.230 billion reais ($394 million) from the partial sale of their stakes in Brazilian travel agency CVC Brasil Operadora SA  a sign investors are slowly returning to Latin America's largest equity market.",
        "date": "08112016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle  founder raise $394 mln in partial exit from Brazil's CVC "
    },
    {
        "content": "SAO PAULO  Aug 11 Carlyle Group LP and Brazilian investor Guilherme Paulus raised a combined 1.230 billion reais ($394 million) from the partial sale of their stakes in Brazilian travel agency CVC Brasil Operadora SA  a sign investors are slowly returning to Latin America's largest equity market.",
        "date": "08112016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle  founder raise $394 mln in partial exit from Brazil's CVC "
    },
    {
        "content": "TOKYO Private equity firm Carlyle Group  said it could make a pair of acquisitions in Japan worth $2 billion apiece  a strategic departure from a previous focus on smaller deals as big Japanese firms are gearing up for spinoffs of larger assets.",
        "date": "08022016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle could make a pair of $2 billion acquisitions in Japan: executive "
    },
    {
        "content": "TOKYO  Aug 2 Private equity firm Carlyle Group  said it could make a pair of acquisitions in Japan worth $2 billion apiece  a strategic departure from a previous focus on smaller deals as big Japanese firms are gearing up for spinoffs of larger assets.",
        "date": "08022016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle could make a brace of $2 bln acquisitions in Japan - exec "
    },
    {
        "content": "NEW YORK Private equity firm Carlyle Group L.P.  posted higher-than-expected quarterly earnings on Wednesday as a rebound in oil prices and a firmer global financial market bolstered investment returns.",
        "date": "07272016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle second-quarter earnings beat forecasts  aided by oil recovery "
    },
    {
        "content": "NEW YORK  July 27 Private equity firm Carlyle Group L.P. posted higher-than-expected quarterly earnings on Wednesday as a rebound in oil prices and a firmer global financial market bolstered investment returns.",
        "date": "07272016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 2-Carlyle Q2 earnings beat forecasts  aided by oil recovery "
    },
    {
        "content": "NEW YORK  July 28 At least seven Collateralized Loan Obligation (CLO) managers have refinanced funds so far this year to cut spreads on Triple A tranches with coupons that can step up to more than 10% of the current market rate.",
        "date": "07282016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "LPC: Firms refinance CLO step-up tranches to avoid interest rate increase "
    },
    {
        "content": "NEW YORK  July 27 Private equity firm Carlyle Group L.P. posted higher-than-expected quarterly earnings on Wednesday  in line with its peers  as a firmer global financial market bolstered investment returns.",
        "date": "07272016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle's second-quarter earnings beat estimates "
    },
    {
        "content": "SAO PAULO  July 15 Lupo SA  a Brazilian underwear producer  has agreed to buy Scalina SA  a lingerie and hosiery maker backed by Carlyle Group LP  for an undisclosed sum.",
        "date": "07152016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Brazil's Lupo agrees to buy Carlyle-backed lingerie maker Scalina "
    },
    {
        "content": "SAO PAULO Carlyle Group LP  the world's No. 2 private-equity manager  is in talks to sell its stake in Brazilian lingerie maker Scalina SA  following a series of setbacks that led to a debt restructuring  three sources with direct knowledge of the situation said.",
        "date": "07132016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Exclusive: Carlyle in talks to sell Brazil's Scalina after debt restructuring - sources "
    },
    {
        "content": "June 30 Motoring group AA Plc said it had agreed to sell its Irish business to a Carlyle Group  fund and financial services buyout team for 156.6 million euros ($173.7 million).",
        "date": "06302016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Motoring group AA to sell Irish business to Carlyle arms "
    },
    {
        "content": "FRANKFURT  June 29 Buyout group Carlyle  has bought a minority stake in German clinic chain Schoen to help the family-owned company expand in its home market as well as abroad  Schoen said on Wednesday.",
        "date": "06292016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle invests in German clinic chain Schoen "
    },
    {
        "content": "HONG KONG  June 29 China Logistics Property Holdings Co Ltd (CNLP)  which is backed by private equity firms RRJ Capital and Carlyle Group  launched an initial public offering in Hong Kong worth up to $435 million  IFR reported on Wednesday.",
        "date": "06292016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle-backed China Logistics Property launches up to $435 mln HK IPO -IFR "
    },
    {
        "content": "* Fort Dearborn has attracted private-equity interest from Carlyle Group LP and CCMP Capital Advisors in its auction process - Bloomberg citing sources",
        "date": "06222016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Fort Dearborn has attracted private-equity interest from Carlyle Group LP and CCMP Capital Advisors in its auction process - Bloomberg citing sources "
    },
    {
        "content": "LISBON  June 27 Buyout group Carlyle will take a 50 percent stake in Portugal's plastics packaging firm Logoplaste in a capital increase that will prepare the family-owned company for planned expansion mainly in the United States  Logoplaste's CEO said.",
        "date": "06272016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Logoplaste splits control with Carlyle in capital hike for investment "
    },
    {
        "content": "LISBON  June 27 Buyout group Carlyle has agreed to partner with family-owned Portuguese plastics packaging firm Logoplaste  and will invest to support the continued growth of the company  Logoplaste said in a statement.",
        "date": "06272016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle in partnership deal with Portugal's Logoplaste "
    },
    {
        "content": "* Logoplaste CEO says in talks with other potential buyers   (Adds advisers  background)",
        "date": "06162016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle in talks to invest in Portuguese packaging firm Logoplaste - sources "
    },
    {
        "content": "June 16 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Thursday:",
        "date": "06162016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "June 6 Private equity firm General Atlantic appointed Eric Zhang as managing director and head of China.",
        "date": "06062016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "MOVES-General Atlantic appoints Eric Zhang as China head "
    },
    {
        "content": "* Heads of financial services team  Source text (http://bit.ly/22zJeqz) Further company coverage:",
        "date": "06022016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Carlyle group names John Redett and Brian Schreiber co-heads of financial services team "
    },
    {
        "content": "* Following offering  Carlyle will continue to own 44.8 million shares  or about 18.8%  of Axalta's outstanding common shares",
        "date": "05242016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Axalta says Carlyle Group affiliates to sell 25 mln common shares "
    },
    {
        "content": "* Upon completion of offering  Carlyle will own approximately 11.3% of outstanding common stock of booz allen",
        "date": "05242016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-Booz Allen Hamilton says Carlyle Group affiliate's 13 mln shares priced at $28.20 per share "
    },
    {
        "content": "* Announced sale of an aggregate of 13 million shares of class a common stock by an affiliate of Carlyle Group (",
        "date": "05232016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Booz Allen says Carlyle Group affiliate to sell 13 mln shares "
    },
    {
        "content": "* Kewsong Lee Will Now Also Supervise The Global Market Strategies Segment",
        "date": "05202016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-The Carlyle Group Announces New Leadership Roles "
    },
    {
        "content": "May 20 Carlyle Group LP said on Friday that Mitch Petrick  who leads its credit investment business  is stepping down from the firm.",
        "date": "05202016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle Group's credit executive Petrick to leave firm "
    },
    {
        "content": "LONDON  May 16 Carlyle Group on Monday announced it had invested in Tunisia-focused oil and gas explorer Mazarine Energy which will also receive $500 million for further acquisitions in Europe and north Africa.",
        "date": "05162016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle invests in Tunisia-focused Mazarine Energy "
    },
    {
        "content": "* Coresite Realty Corporation announces sale of common stock by the Carlyle Group",
        "date": "05092016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Coresite Realty announces sale of stock by Carlyle Group "
    },
    {
        "content": "* Commscope announces sale of 20 million shares of common stock by affiliate of the Carlyle Group",
        "date": "05022016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Commscope Holding announces sale of 20 mln shares by affiliate of the Carlyle Group "
    },
    {
        "content": "NEW YORK Private equity firm Carlyle Group LP bucked its sector's trend on Wednesday by posting first-quarter earnings that beat market forecasts  even as it reported a drop in the assets managed by the firm that also set it apart from its peers.",
        "date": "04272016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle first quarter earnings fall almost 80 percent but still beat forecast "
    },
    {
        "content": "NEW YORK  April 28 With U.S. rules forcing managers to hold onto a portion of their fund's risk set to go into effect this year  some firms have chosen to make their deals compliant with both U.S and European risk-retention requirements to expand the buyer base and potentially lock in lower interest rates.",
        "date": "04282016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "LPC/IFR: Managers choose dual compliance as U.S. risk-retention rules loom "
    },
    {
        "content": "NEW YORK  April 27 Private equity firm Carlyle Group LP bucked its sector's trend on Wednesday by posting first-quarter earnings that beat market forecasts  even as it reported a drop in the assets managed by the firm that also set it apart from its peers.",
        "date": "04272016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "CORRECTED-UPDATE 2-Carlyle Q1 earnings fall almost 80 pct but still beat f'cast "
    },
    {
        "content": "LONDON  April 25 Former Barclays Chief Executive Bob Diamond is teaming up with private equity group Carlyle to prepare a bid to buy the bank's African operations  a source familiar with the matter told Reuters on Monday.",
        "date": "04252016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Barclays ex-CEO Bob Diamond eyes bid for Africa unit with Carlyle -source "
    },
    {
        "content": "NEW YORK  April 27 Private equity firm Carlyle Group LP posted better-than-expected first-quarter earnings on Wednesday as gains in its buyout and real estate investments offset losses in other areas including the energy market.",
        "date": "04272016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle first-quarter earnings beat forecasts "
    },
    {
        "content": "* The Carlyle Group announces first quarter 2016 financial results",
        "date": "04272016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-Carlyle Group Q1 earnings per share $0.01 "
    },
    {
        "content": "Carlyle Group LP  has entered the auction for assets that oilfield service providers Halliburton Co  and Baker Hughes Inc  aim to divest to secure antitrust approval for their merger  a person familiar with the matter said.",
        "date": "04142016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle enters race for Halliburton-Baker Hughes assets: sources "
    },
    {
        "content": "April 14 Carlyle Group LP has entered the auction for assets that oilfield service providers Halliburton Co and Baker Hughes Inc aim to divest to secure antitrust approval for their merger  a person familiar with the matter said.",
        "date": "04142016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle enters race for Halliburton-Baker Hughes assets -sources "
    },
    {
        "content": "* Halliburton  Baker Hughes in talks to sell assets to Carlyle Group- WSJ citing sources",
        "date": "04142016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-Halliburton  Baker Hughes in talks to sell assets to Carlyle - WSJ "
    },
    {
        "content": "Private equity firm Carlyle Group LP  is in advanced talks to acquire the healthcare information technology division of U.S. data analytics company Verisk Analytics Inc   according to people familiar with the matter.",
        "date": "04072016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle in the lead to buy Verisk Analytics' healthcare unit: sources "
    },
    {
        "content": "April 7 Private equity firm Carlyle Group LP  is in advanced talks to acquire the healthcare information technology division of U.S. data analytics company Verisk Analytics Inc  according to people familiar with the matter.",
        "date": "04072016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle in the lead to buy Verisk Analytics' healthcare unit -sources "
    },
    {
        "content": "March 3 Private equity firm Carlyle Group LP  is exploring a sale of Zodiac Pool Solutions SAS  hoping a deal will value the U.S. swimming pool and spa equipment maker at more than $800 million  including debt  according to people familiar with the matter.",
        "date": "03032016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle seeks to sell Zodiac Pool Solutions-sources "
    },
    {
        "content": "* Toshiba plans to sell entire unit to bolster finances -sources",
        "date": "02292016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Toshiba to sell entire medical unit  deal may see aggressive bids -sources "
    },
    {
        "content": "Feb 22 Alternative asset manager Carlyle Group LP said on Monday it would shut its hedge fund-of-funds manager Diversified Global Asset Management Corp (DGAM)  two years after it added the unit to its investment platform.",
        "date": "02222016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle to shut DGAM hedge fund-of-funds unit "
    },
    {
        "content": "NEW YORK Private equity firm Carlyle Group LP  unveiled a $200 million share buyback plan on Wednesday as it posted weaker-than-expected fourth-quarter earnings amid turbulent financial markets.",
        "date": "02102016",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle unveils $200 million share buyback  earnings miss forecast "
    },
    {
        "content": "NEW YORK  Feb 10 Private equity firm Carlyle Group LP unveiled a $200 million share buyback plan on Wednesday as it posted weaker-than-expected fourth-quarter earnings amid turbulent financial markets.",
        "date": "02102016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle unveils $200 mln share buyback  earnings miss forecast "
    },
    {
        "content": "NEW YORK  Feb 10 Private equity firm Carlyle Group LP unveiled a $200 million share buyback plan on Wednesday as it posted weaker-than-expected fourth-quarter earnings amid volatile financial markets.",
        "date": "02102016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle unveils $200 mln share buyback  Q4 earnings miss forecast "
    },
    {
        "content": "TOKYO  Jan 27 U.S. buyout funds KKR & Co  and Bain Capital  as well as Fujifilm Holdings Corp  are among potential bidders for a medical equipment unit of financially troubled Toshiba Corp in a deal that could fetch more than $3 billion  people familiar with the process said on Wednesday.",
        "date": "01272016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "KKR  Bain  Fujifilm to bid for Japan's Toshiba Medical-sources "
    },
    {
        "content": "Jan 19 Antivirus software maker Symantec Corp  said on Tuesday it will receive $1 billion less in cash for its data storage unit Veritas from Carlyle Group LP  cutting the price of the biggest leveraged buyout of 2015 after debt backing the deal failed to sell.",
        "date": "01202016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Symantec to get $1 billion less cash in sale of Veritas to Carlyle "
    },
    {
        "content": "Jan 4 A little-known hedge fund has emerged as Carlyle Group LP's biggest outside shareholder after seizing on a sell-off of the U.S. private equity firm's stock as a \"no-brainer\" buying opportunity.",
        "date": "01042016",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Hedge fund views cheap Carlyle stock a 'no-brainer' bargain "
    },
    {
        "content": "HOUSTON  Dec 18 Hilcorp Energy Co  a closely held U.S. independent exploration and production company  on Friday said it had formed a partnership with private equity firm Carlyle Group LP to acquire and develop North American oil and gas properties.",
        "date": "12182015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Hilcorp  Carlyle form oil and gas partnership "
    },
    {
        "content": "* Sale follows refocus of strategy at Airbus   (Adds deal context)",
        "date": "12162015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "UPDATE 1-Airbus shortlists Carlyle  KKR for electronics unit sale - sources "
    },
    {
        "content": "* PAI Partners enters exclusive negotiations to buy B&B Hotels",
        "date": "12152015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-PAI Partners enters exclusive negotiations to buy B&B Hotels\u007f\u007f "
    },
    {
        "content": "HOUSTON/CHICAGO Dec 10 Drained by a 17-month crude rout  some U.S. shale oil companies are merely hanging on for life as oil prices lurch further away from levels that allow them to profitably drill new wells and bring in enough cash to keep them in business.",
        "date": "12102015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "RPT-INSIGHT-Zombies appear in U.S. oilfields as crude plumbs new lows "
    },
    {
        "content": "HOUSTON/CHICAGO Dec 10 Drained by a 17-month crude rout  some U.S. shale oil companies are merely hanging on for life as oil prices lurch further away from levels that allow them to profitably drill new wells and bring in enough cash to keep them in business.",
        "date": "12102015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "INSIGHT-Zombies appear in U.S. oilfields as crude plumbs new lows "
    },
    {
        "content": "LONDON  Dec 8 KKR has won the auction to buy UK forensic sciences group LGC from Bridgepoint  the private equity firm said on Tuesday  after fighting off competition from three other sponsors that also submitted second round bids.",
        "date": "12082015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-LPC-KKR wins battle for forensic science firm LGC "
    },
    {
        "content": "LONDON  Dec 11 U.S. buyout firm Carlyle  said on Friday that it is to buy Dutch lingerie firm Hunkemoller from its private equity owners.",
        "date": "12112015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle to buy Dutch lingerie firm Hunkemoller from PAI "
    },
    {
        "content": "LONDON  Dec 8 KKR has won the auction to buy UK forensic sciences group LGC from Bridgepoint  the private equity firm said on Tuesday  after fighting off competition from three other sponsors that also submitted second round bids.",
        "date": "12082015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "LPC-KKR wins battle for forensic science firm LGC "
    },
    {
        "content": "LONDON  Dec 11 Carlyle will buy Dutch lingerie firm Hunkemoller from its private equity owners  the U.S. buyout fund said on Friday.",
        "date": "12112015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle to buy Dutch lingerie firm Hunkemoller from PAI "
    },
    {
        "content": "TAIPEI  Dec 11 Taiwan's Eastern Media International Corp said on Friday it will sell its 21.32 percent stake in Eastern Broadcasting Corp (EBC) to U.S. filmmaker Dan Mintz for T$3.9 billion ($118.96 million)  joining Carlyle Group in exiting the investment.",
        "date": "12112015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Taiwan's Eastern Media to sell TV station stake to Dan Mintz "
    },
    {
        "content": "* CVC Capital Partners says forms partnership with GIC to invest in the RAC as the Carlyle Group exits",
        "date": "12022015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-CVC Capital says to invest in RAC with GIC as the Carlyle Group exits "
    },
    {
        "content": "Dec 2 The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "12022015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "PRESS DIGEST- Financial Times - Dec 2 "
    },
    {
        "content": "HONG KONG  Nov 23 Private equity firms Carlyle Group LP and TPG Capital Management are selling their entire remaining stake in Australian healthcare operator Healthscope Ltd in a deal worth about $612 million  IFR reported on Monday  citing a source close to the deal.",
        "date": "11232015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "RPT-UPDATE 1-Carlyle  TPG to exit Australia's Healthscope with $612 mln stake sale-IFR "
    },
    {
        "content": "Nov 23 The following bids  mergers  acquisitions and disposals were reported by 1130 GMT on Monday:",
        "date": "11232015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "HONG KONG Private equity firms Carlyle Group LP  and TPG Capital Management [TPG.UL] are selling their entire remaining stake in Australian healthcare operator Healthscope Ltd  in a deal worth about $612 million  IFR reported on Monday  citing a source close to the deal.",
        "date": "11232015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle  TPG to exit Australia's Healthscope with $612 million stake sale: IFR "
    },
    {
        "content": "HONG KONG  Nov 23 Private equity firms Carlyle Group LP and TPG Capital Management are selling their entire remaining stake in Australian healthcare operator Healthscope Ltd in a deal worth about $612 million  IFR reported on Monday  citing a source close to the deal.",
        "date": "11232015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle  TPG to exit Australia's Healthscope with $612 mln stake sale-IFR "
    },
    {
        "content": "TAIPEI  Nov 23 U.S. film maker Dan Mintz has agreed to buy Carlyle's stake in Taiwan's Eastern Broadcasting Corp (EBC) to gain greater exposure to Mandarin content globally and leverage EBC's scale as Taiwan's top TV platform.",
        "date": "11222015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Dan Mintz says to buy Carlyle's stake in Taiwanese broadcaster "
    },
    {
        "content": "HONG KONG  Nov 23 Private equity firms Carlyle Group LP and TPG Capital Management are selling their entire remaining stake in Australian healthcare operator Healthscope Ltd in a deal worth about $612 million  IFR reported on Monday  citing a source close to the deal.",
        "date": "11232015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle  TPG to exit Australia's Healthscope with $612 mln stake sale-IFR "
    },
    {
        "content": "* Shares of EBC  DMG Entertainment both jump 10 pct   (Adds comment on Taiwan regulatory review)",
        "date": "11232015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 2-Hollywood producer Dan Mintz agrees to buy Carlyle stake in Taiwan broadcaster "
    },
    {
        "content": "TAIPEI U.S. film maker Dan Mintz has agreed to buy Carlyle Group's 61 percent stake in Taiwan's Eastern Broadcasting Corp (EBC) for an undisclosed sum  allowing the private equity firm to sell an investment it first tried to dispose of in 2013.",
        "date": "11232015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Hollywood producer Dan Mintz agrees to buy Carlyle stake in Taiwan broadcaster "
    },
    {
        "content": "TAIPEI  Nov 23 Shares of Eastern Media International  a major shareholder of TV broadcaster Eastern Broadcasting Corp (EBC)  opened up by its 10 percent limit on Monday on news U.S. filmmaker Dan Mintz has agreed to buy Carlyle's 's stake in EBC.",
        "date": "11232015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Eastern Media shares open limit up 10 pct "
    },
    {
        "content": "SAO PAULO  Nov 9 Carlyle Group LP purchased a majority stake in Brazilian specialized assistance provider Tempo Participações SA for an undisclosed sum  the U.S. private equity firm's third deal in the country this year.",
        "date": "11092015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle buys majority stake in Brazil's Tempo  aims to take it private "
    },
    {
        "content": "SINGAPORE  Oct 30 India's PNB Housing Finance Ltd has hired banks including Barclays  JPMorgan and Morgan Stanley for a 25 billion rupees (about $385 million) initial public offering  IFR reported on Friday  citing two sources close to transaction.",
        "date": "10302015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "India's PNB Housing Finance hires banks for $385 mln IPO - IFR "
    },
    {
        "content": "Oct 28 Alternative asset managers Carlyle Group LP and Apollo Global Management LLC followed peers on Wednesday in reporting that the third quarter's stock market plunge weighed on their earnings  even as they scored some key wins.",
        "date": "10282015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle  Apollo hit by third-quarter market rout "
    },
    {
        "content": "SAO PAULO  Oct 26 Kroton Educational SA has sold distance learning college Uniasselvi to a group of investment firms for 1.105 billion reais ($285 million)  underscoring growing demand for higher education centers in Latin America's largest economy.",
        "date": "10262015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Brazil's Kroton sells Uniasselvi to Carlyle  Vinci for $285 mln "
    },
    {
        "content": "RIO DE JANEIRO  Oct 23 Brazil's Kroton Educational SA agreed to sell its Uniasselvi university to the Carlyle Group LP and Vinci Partners for 1.1 billion reais ($282.4 million)  a newspaper reported on Friday  though the company said no sale deal for the university has been signed.",
        "date": "10232015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Brazil's Kroton plans to sell Uniasselvi to Carlyle  Vinci -Estado "
    },
    {
        "content": "HONG KONG  Oct 16 Private equity firm Carlyle Group LP said on Friday it named Sunil Kaul to a newly created role of head of Southeast Asia for its buyout advisory team in Asia  betting on the fast-growing region.",
        "date": "10162015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "MOVES-Carlyle names Sunil Kaul head of Southeast Asia's buyout advisory team "
    },
    {
        "content": "SINGAPORE/HONG KONG Private equity firm Carlyle Group LP fired its top dealmaker in Indonesia after the banker was fined by Singapore's financial regulator in an insider trading case  a source with direct knowledge of the decision told Reuters on Thursday.",
        "date": "10152015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle fires Indonesia dealmaker charged in Singapore insider trading: source "
    },
    {
        "content": "SINGAPORE/HONG KONG  Oct 15 Private equity firm Carlyle Group LP fired its top dealmaker in Indonesia after the banker was fined by Singapore's financial regulator in an insider trading case  a source with direct knowledge of the decision told Reuters on Thursday.",
        "date": "10152015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle fires Indonesia dealmaker charged in Singapore insider trading -source "
    },
    {
        "content": "* Shares slump to 2-yr lows on market growth concerns   (Adds Breakingviews link)",
        "date": "09232015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 3-BBA Aviation proposes to buy Landmark Aviation for $2.07 bln "
    },
    {
        "content": "Sept 23 British aircraft services provider BBA Aviation Plc said it has proposed to acquire Landmark Aviation  owned by private equity firm Carlyle Group LP  for $2.065 billion.",
        "date": "09232015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BBA Aviation proposes to acquire Landmark Aviation for $2.06 bln "
    },
    {
        "content": "TOKYO U.S. private equity firm Carlyle Group said on Thursday it has raised 119.5 billion yen ($992 million)for its third fund dedicated to investments in Japan.",
        "date": "09172015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle says it has raised $992 million for Japan fund "
    },
    {
        "content": "TOKYO  Sept 17 U.S. private equity firm Carlyle Group said on Thursday it has raised 119.5 billion yen ($992 million)for its third fund dedicated to investments in Japan.",
        "date": "09172015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle says it has raised $992 mln for Japan fund "
    },
    {
        "content": "Sept 9 A unit of Carlyle Group LP has bought a stake in Metropolis Healthcare Ltd  an India-based global operator of pathology laboratories  for an undisclosed sum  according to a statement from the U.S. private equity firm on Wednesday.",
        "date": "09092015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle Group unit buys stake in India lab operator Metropolis Healthcare "
    },
    {
        "content": "SINGAPORE  Aug 31 Carlyle Group's nominee on the board of China Fishery Group has stepped down  a few months after the U.S. private equity firm declined to take part in the Singapore-listed company's rights issue.",
        "date": "08312015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle's nominee on China Fishery's board steps down "
    },
    {
        "content": "SINGAPORE  Aug 27 Asia-focused private equity firm MBK Partners has partnered with Singapore state investor Temasek Holdings to bid for the South Korea arm of British retailer Tesco  two people familiar with the matter told Reuters.",
        "date": "08272015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Temasek joins MBK-led consortium to bid for Tesco's S.Korea unit-sources "
    },
    {
        "content": "Private equity firm Carlyle Group LP  has been exploring a sale of aircraft leasing and maintenance company Landmark Aviation for as much as $1.7 billion  including debt  people familiar with the matter said on Friday.",
        "date": "08282015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Exclusive: Carlyle looks to sell Landmark Aviation for $1.7 billion "
    },
    {
        "content": "LONDON U.S. private equity firm Carlyle  is in advanced talks about buying Innovation Group  for 40 pence a share in cash  valuing its equity at almost 500 million pounds ($769 million)  the British software company said on Friday.",
        "date": "08282015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle in talks on $770 million takeover of UK's Innovation Group "
    },
    {
        "content": "LONDON  Aug 28 U.S. private equity firm Carlyle  is in advanced talks about buying Innovation Group  for 40 pence a share in cash  valuing its equity at almost 500 million pounds ($769 million)  the British software company said on Friday.",
        "date": "08282015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle in talks on $770 mln takeover of UK's Innovation Group "
    },
    {
        "content": "SEOUL/HONG KONG  Aug 21 Private equity firms Affinity Equity Partners and KKR & Co have teamed up to bid for Tesco plc's South Korean unit valued at about $6 billion  people with knowledge of the matter said on Friday.",
        "date": "08212015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Affinity  KKR team up to bid for Tesco's S.Korean unit-sources "
    },
    {
        "content": "* Confirms that it is in advanced discussions with carlyle group at 40 pence per share in cash",
        "date": "08282015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-Innovation Group says in talks with Carlyle at 40p per share "
    },
    {
        "content": "Aug 17 Carlyle Group has acquired a minority stake in India's DEE Piping Systems  in the latest investment in Asia's third largest economy by the U.S. private equity firm.",
        "date": "08172015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle buys minority stake in India's DEE Piping Systems "
    },
    {
        "content": "Aug 11 Antivirus maker Symantec Corp  said it would sell its data storage business  Veritas  for $8 billion in cash to a group that includes Carlyle Group LP  and Singapore's sovereign wealth fund GIC.",
        "date": "08112015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Symantec to sell Veritas to Carlyle-led group for $8 bln "
    },
    {
        "content": "Software security company Symantec Corp has agreed to sell its data storage business Veritas to private equity firm Carlyle Group LP  according to a person familiar with the matter.",
        "date": "08112015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Symantec agrees to sell data storage unit to Carlyle: source "
    },
    {
        "content": "SAO PAULO Carlyle Group LP  offered to buy Brazilian specialized assistance provider Tempo Participações SA  for up to 718 million reais ($204 million) in what may be the private equity firm's second deal in the country this year.",
        "date": "08142015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle offers to pay up to $204 million for Brazil's Tempo "
    },
    {
        "content": "Aug 11 Software security company Symantec Corp  has agreed to sell its data storage business Veritas to private equity firm Carlyle Group LP  according to a person familiar with the matter.",
        "date": "08112015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Symantec agrees to sell data storage unit to Carlyle - source "
    },
    {
        "content": "SAO PAULO  Aug 14 Carlyle Group LP  offered to buy Brazilian specialized assistance provider Tempo Participações SA for up to 718 million reais ($204 million) in what may be the private equity firm's second deal in the country this year.",
        "date": "08142015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle offers to pay up to $204 mln for Brazil's Tempo "
    },
    {
        "content": "* Price for 82 pct joint stake has to be reasonable -Eastern Media",
        "date": "08062015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle in new bid to exit Taiwan TV network stake -shareholder "
    },
    {
        "content": "TAIPEI  Aug 6 Eastern Media International Corp  said it and Carlyle Group plan to sell their entire stakes in a Taiwanese TV network  sending shares in Eastern Media soaring by the daily limit of 10 percent.",
        "date": "08062015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Eastern Media  Carlyle to sell TV network stakes; Eastern's shares soar "
    },
    {
        "content": "* Tower unit stake sale to help cut debt at Reliance Comm   (Adds details on Reliance debt  source comments  industry context)",
        "date": "07312015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "UPDATE 1-India's Reliance Comm draws interest in sale of tower unit stake -sources "
    },
    {
        "content": "HONG KONG  July 30 Private equity firm Carlyle Group LP said on Thursday it agreed to pay 530 million yuan ($85 million) for an undisclosed stake in Chinese vending machine operator Beijing Ubox Technology & Trade Co Ltd  betting on growing consumer demand for convenient shopping.",
        "date": "07302015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle buys $85 mln stake in Chinese vending machine operator Ubox "
    },
    {
        "content": "NEW YORK Philadelphia Energy Solutions  and its investors expect to sell stock valued at $227 million to $272 million in the refining company's upcoming initial public offering  according to a federal filing on Monday.",
        "date": "07272015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Philadelphia Energy  investors look to sell up to $272 million in stock "
    },
    {
        "content": "July 29 Private equity firm Carlyle Group LP  said on Wednesday its second-quarter earnings dropped 38 percent year-on-year as the value of its energy and hedge funds decreased  even as it generated more cash by cashing out on several of its assets.",
        "date": "07292015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle's second-quarter earnings drop as energy funds suffer "
    },
    {
        "content": "July 29 Private equity firm Carlyle Group LP  said on Wednesday its second-quarter earnings dropped 38 percent year-on-year as the value of its energy and hedge funds decreased  even as it generated more cash by cashing out on several of its assets.",
        "date": "07292015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle's second-quarter earnings drop as energy funds suffer "
    },
    {
        "content": "FRANKFURT U.S. private equity group Carlyle  has closed its fourth European buyout fund  sticking to a so-called hard cap of 3.5 billion euros ($3.87 billion) after attracting far more commitments than it was seeking.",
        "date": "07282015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle closes $3.87 billion European buyout fund "
    },
    {
        "content": "FRANKFURT  July 30 U.S. private equity group Carlyle has closed its fourth European buyout fund  sticking to a so-called hard cap of 3.5 billion euros ($3.87 billion) after attracting far more commitments than it was seeking.",
        "date": "07282015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle closes 3.5 bln euro European buyout fund "
    },
    {
        "content": "PARIS U.S. private equity giant Carlyle  has mandated Morgan Stanley to look into the sale or the stock market listing of its budget hotel chain B&B Hotel Group in the Autumn  French daily Les Echos reported on Friday.",
        "date": "07172015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle eyeing B&B budget hotel chain sale: report "
    },
    {
        "content": "PARIS  July 17 U.S. private equity giant Carlyle  has mandated Morgan Stanley to look into the sale or the stock market listing of its budget hotel chain B&B Hotel Group in the Autumn  French daily Les Echos reported on Friday.",
        "date": "07172015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle eyeing B&B budget hotel chain sale-report "
    },
    {
        "content": "SYDNEY  July 17 Macquarie Group  U.S. private equity giant Carlyle and China's HNA Group  are among the bidders shortlisted for ANZ Banking Group's $6 billion-plus car and equipment loan book  five sources with direct knowledge of the matter said on Friday.",
        "date": "07172015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Macquarie  Carlyle shortlisted for $6.4 bln ANZ car finance unit-sources "
    },
    {
        "content": "SYDNEY Macquarie Group  U.S. private equity giant Carlyle and China's HNA Group are among the bidders shortlisted for ANZ Banking Group's $6 billion-plus car and equipment loan book  five sources with direct knowledge of the matter said on Friday.",
        "date": "07172015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Macquarie  Carlyle among shortlisted bidders for $6.4 billion ANZ car finance unit: sources "
    },
    {
        "content": "SYDNEY  July 17 Macquarie Group  U.S. private equity giant Carlyle and China's HNA Group  are among the bidders shortlisted for ANZ Banking Group's $6 billion-plus car and equipment loan book  five sources with direct knowledge of the matter said on Friday.",
        "date": "07172015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Macquarie  Carlyle among shortlisted bidders for $6.4 bln ANZ car finance unit-sources "
    },
    {
        "content": "July 7 Software security company Symantec Corp  is in talks to sell its Veritas data storage business to private equity firm Carlyle Group LP  a person familiar with the matter said on Tuesday.",
        "date": "07072015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Symantec in talks to sell Veritas storage unit to Carlyle -source "
    },
    {
        "content": "Software security company Symantec Corp  is in talks to sell its Veritas data storage business to private equity firm Carlyle Group LP   a person familiar with the matter said on Tuesday.",
        "date": "07072015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Symantec in talks to sell Veritas storage unit to Carlyle: source "
    },
    {
        "content": "July 7 Software security company Symantec Corp  is in talks to sell its Veritas data storage business to private equity firm Carlyle Group LP  a person familiar with the matter said on Tuesday.",
        "date": "07072015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Symantec in talks to sell Veritas storage unit to Carlyle -source "
    },
    {
        "content": "SEOUL  July 7 Private equity firm KKR & Co  has re-entered the list of eligible bidders for Tesco's  South Korean business after offering to increase its bid price  the Korea Economic Daily reported on Tuesday.",
        "date": "07072015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "KKR rejoins bidding process for Tesco's S.Korea unit-Korea Economic Daily "
    },
    {
        "content": "* Private equity firms shortlisted for about $6 bln asset-sources",
        "date": "07022015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle  MBK on bidders' shortlist for Tesco S.Korea unit-sources "
    },
    {
        "content": "LONDON  July 2 Britain's FTSE 100 index is seen opening down 25 to 26 points  or around 0.4 percent lower  on Thursday according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The blue-chip index was up by 80.88 points  or 1.2 percent  at 6 601.86 points by the close on Wednesday  bouncing back from five-and-a-half month lows  lifted by airline stocks that were boosted by lower oil prices and a recommendation for a new runway a",
        "date": "07022015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UK Stocks-Factors to watch on Thursday July 2 "
    },
    {
        "content": "* Submission of pre-qualification documents moved back to July 16   (Recasts and add names of local lenders interested in bidding)",
        "date": "07022015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Philippines' UCPB bank sale draws U.S. private equity  San Miguel -source "
    },
    {
        "content": "SEOUL Private equity firms Affinity Equity Partners and Carlyle Group  were among four potential buyers shortlisted for the sale of Tesco PLC's  South Korean unit seen worth around $6 billion  a South Korean newspaper reported on Thursday.",
        "date": "07012015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Affinity  Carlyle among four shortlisted for Tesco South Korea unit sale: report "
    },
    {
        "content": "HONG KONG  June 28 Private equity firm Carlyle Group LP said on Sunday it has agreed to pay $120 million for an undisclosed stake in Chinese logistics firm Shanghai ANE Logistics Limited (ANE) as it seeks to benefit from China's booming e-commerce business.",
        "date": "06282015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle bets on China ecommerce boom with $120 mln Shanghai ANE stake "
    },
    {
        "content": "HONG KONG  June 29 Private equity firm Carlyle Group LP said on Monday it agreed to pay $115 million for an 18.5 percent stake in Chinese company JIC Leasing Co Ltd  the firm's second investment in China in two days.",
        "date": "06292015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle to buy 18.5 pct stake in China's JIC Leasing for $115 mln "
    },
    {
        "content": "SEOUL  July 2 Private equity firms Affinity Equity Partners and Carlyle Group were among four potential buyers shortlisted for the sale of Tesco PLC's  South Korean unit seen worth around $6 billion  a South Korean newspaper reported on Thursday.",
        "date": "07012015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Affinity  Carlyle among 4 shortlisted for Tesco S.Korea unit sale-report "
    },
    {
        "content": "* Bidder shortlist expected to be decided in a week   (Adds comments from BMW  Macquarie  Blackstone)",
        "date": "06292015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Germany's BMW among suitors for $6.4 bln ANZ car finance unit -source "
    },
    {
        "content": "July 1 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "07012015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "SYDNEY  June 29 Germany's BMW AG  Australia's Macquarie Group and a host of U.S. private equity firms are expected to bid for Australia and New Zealand Banking Group's more than $6 billion car and equipment loan book  a source said on Monday.",
        "date": "06292015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Germany's BMW among suitors for ANZ car finance unit - source "
    },
    {
        "content": "MILAN  July 1 U.S. private equity firm Carlyle Group has raised its stake in Italy's Twin-Set to 90 percent and named a new chief executive  stepping up efforts to promote the fashion brand's retail expansion.",
        "date": "07012015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle ups stake in Italy's Twin-Set  names new CEO "
    },
    {
        "content": "SEOUL Private equity firms Affinity Equity Partners  Carlyle Group  and CVC Capital Partners were among 7 to 8 preliminary bidders for Tesco's  South Korean unit  a Korean newspaper reported on Thursday.",
        "date": "06242015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Affinity  Carlyle among early bidders for Tesco's South Korean unit: media "
    },
    {
        "content": "SEOUL  June 25 Private equity firms Affinity Equity Partners  Carlyle Group and CVC Capital Partners were among 7 to 8 preliminary bidders for Tesco's South Korean unit  a Korean newspaper reported on Thursday.",
        "date": "06242015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Affinity  Carlyle among early bidders for Tesco's S.Korean unit-media "
    },
    {
        "content": "* Magna is led by ex-deputy CEO and ex-CFO of Cairn Energy   (Adds comments from Magna and Carlyle executives)",
        "date": "06222015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle backs former Cairn Energy execs' Indian venture "
    },
    {
        "content": "June 22 Carlyle Group has committed to invest up to $500 million in Magna Energy Ltd  an India-focused upstream oil and gas company  the global private equity firm said in a statement on Monday.",
        "date": "06222015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle Group commits up to $500 mln to India-focused Magna Energy "
    },
    {
        "content": "* Orion expected to team up with pvt equity for deal - analysts   (Adds details of private equity bids and analyst comment)",
        "date": "06252015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "UPDATE 1-Snack maker Orion  buyout firms make initial bids for Tesco S.Korea unit "
    },
    {
        "content": "SEOUL/HONG KONG  June 17 Any buyer of Tesco's  $6 billion South Korea unit will need a strategy to boost returns in a lethargic and saturated market for traditional retailers  likely involving real estate sales and a greater focus on Internet shopping.",
        "date": "06162015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Brutal retail market awaits buyer of Tesco South Korea business "
    },
    {
        "content": "HONG KONG  June 19 A Shenzhen-listed company that agreed to buy Focus Media Holding Ltd  paving the way for a back-door listing of the Chinese display advertising company  is being investigated by the Chinese securities regulator.",
        "date": "06192015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle-backed Focus Media's reverse listing plan hits snag "
    },
    {
        "content": "HONG KONG/SEOUL British retailer Tesco Plc  has invited at least six firms including KKR & Co  and Carlyle Group  to bid for its South Korean unit Homeplus  valued at about $6 billion  people familiar with the matter told Reuters.",
        "date": "06092015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "KKR  Carlyle among firms invited to bid for Tesco's South Korea unit: sources "
    },
    {
        "content": "* Growth opportunities seen limited but property assets valuable",
        "date": "06092015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 2-KKR  Carlyle among firms invited to bid for Tesco's S.Korea unit-sources "
    },
    {
        "content": "* Carlyle Group and global private equity and investment advisory firm CVC Capital Partners  today announced that they have agreed to fund Neptune Oil & Gas Ltd",
        "date": "06092015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "BRIEF-Ex-Centrica boss Laidlaw to head $5 bln oil and gas investment fund "
    },
    {
        "content": "HONG KONG  June 9 British retailer Tesco Plc  has invited about six firms including KKR & Co  and Carlyle Group to bid for its South Korean unit  valued at about $6 billion  people familiar with the matter told Reuters.",
        "date": "06092015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "KKR  Carlyle among firms invited to bid for Tesco S.Korea unit -sources "
    },
    {
        "content": "HONG KONG Focus Media Holding Ltd  one of several Chinese firms that delisted in the United States after short-seller attacks  is set to go public again via a reverse takeover in Shenzhen that values it at more than $7 billion  filings showed.",
        "date": "06032015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle-backed Focus Media set for $7 billion backdoor listing in Shenzhen "
    },
    {
        "content": "* Was taken private in 2013 for $3.7 bln by Carlyle-led group",
        "date": "06032015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle-backed Focus Media set for $7 bln backdoor listing in Shenzhen "
    },
    {
        "content": "LONDON  May 28 Varo Energy  a joint venture between the world's top oil trader Vitol and private equity firm Carlyle Group  is expanding its reach in Europe through a merger with Dutch-based storage and trading company Argos  the companies said on Thursday.",
        "date": "05282015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Vitol and Carlyle's Varo merge with Argos to create downstream powerhouse "
    },
    {
        "content": "MADRID Private equity firm Carlyle  has hired Goldman Sachs to advise it on the possible sale of its controlling stake in Spanish telecoms operator Telecable  two sources with knowledge of the deal said on Tuesday.",
        "date": "05262015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle hires Goldman for possible Telecable stake sale: sources "
    },
    {
        "content": "MADRID  May 26 Private equity firm Carlyle  has hired Goldman Sachs to advise it on the possible sale of its controlling stake in Spanish telecoms operator Telecable  two sources with knowledge of the deal said on Tuesday.",
        "date": "05262015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle hires Goldman for possible Telecable stake sale - sources "
    },
    {
        "content": "Comcast Corp  on Monday named Carlyle Group LP  Co-President Michael Cavanagh as chief financial officer  bringing on a prominent dealmaker after its failed attempt to acquire Time Warner Cable Inc .",
        "date": "05112015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Comcast names Carlyle Group's Michael Cavanagh as CFO "
    },
    {
        "content": "May 11 Comcast Corp on Monday named Carlyle Group LP Co-President Michael Cavanagh as chief financial officer  bringing on a prominent dealmaker after its failed attempt to acquire Time Warner Cable Inc.",
        "date": "05112015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 2-Comcast names Carlyle Group's Michael Cavanagh as CFO "
    },
    {
        "content": "May 11 Comcast Corp named Michael Cavanagh chief financial officer to replace Michael Angelakis  who moves on to head the cable operator's new investment arm.",
        "date": "05112015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Comcast names Carlyle Group's Michael Cavanagh CFO "
    },
    {
        "content": "SAO PAULO  April 27 Private-equity firm Carlyle Group LP agreed on Monday to pay 1.75 billion reais ($600 million) for a stake in Rede D'Or São Luiz SA  Brazil's largest hospital chain  a source with direct knowledge of the deal said.",
        "date": "04282015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle to pay $600 mln for Brazil's Rede D'Or stake -source "
    },
    {
        "content": "SAO PAULO  April 27 Private-equity firm Carlyle Group LP agreed on Monday to pay 1.75 billion reais ($600 million) for a stake in Rede D'Or São Luiz SA  Brazil's largest hospital chain  a source with direct knowledge of the deal said.",
        "date": "04272015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle to pay $600 mln for Brazil's Rede D'Or stake - source "
    },
    {
        "content": "SAO PAULO  April 27 Private-equity firm Carlyle Group LP agreed on Monday to pay about 1.75 billion reais ($600 million) for an 8 percent stake in Rede D'Or São Luiz SA  Brazil's largest hospital chain  a source with direct knowledge of the deal said.",
        "date": "04272015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle to pay $600 mln for Brazil's Rede D'Or stake  source says "
    },
    {
        "content": "April 29 Carlyle Group LP reported a 13 percent year-on-year drop in first-quarter profit  as it was asked to pay $112 million in a French tax court case involving one of its real estate funds  yet it still beat most analysts' expectations on performance.",
        "date": "04292015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle's first-quarter earnings drop on French tax ruling "
    },
    {
        "content": "MUMBAI U.S. private equity firm Advent International is in talks with Carlyle Group  and three separate healthcare providers to sell its 72 percent stake in India's CARE Hospitals for $250 million to $300 million  two sources with direct knowledge of the matter said.",
        "date": "04292015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "U.S. firm plans stake sale in India's CARE Hospitals for up to $300 million: sources "
    },
    {
        "content": "HONG KONG Focus Media Holding Ltd  a Chinese display advertising company backed by Carlyle Group LP  and other private equity firms  has sealed a $1.4 billion loan from a group of three banks to refinance existing debt ahead of a planned listing in Shanghai  Basis Point reported on Monday  citing sources familiar with the plans.",
        "date": "04212015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle-backed Focus Media seals $1.4 billion loan ahead of Shanghai listing "
    },
    {
        "content": "HONG KONG  April 21 Focus Media Holding Ltd  a Chinese display advertising company backed by Carlyle Group LP  and other private equity firms  has sealed a $1.4 billion loan from a group of three banks to refinance existing debt ahead of a planned listing in Shanghai  Basis Point reported on Monday  citing sources familiar with the plans.",
        "date": "04212015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle-backed Focus Media seals $1.4 bln loan ahead of Shanghai listing "
    },
    {
        "content": "Carlyle Group LP  has enlisted Mike Duke  former chief executive of Wal-Mart Stores Inc   to the executive team that the asset management firm taps for advise on deals  the Wall Street Journal reported.",
        "date": "04162015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle Group names ex-Wal-Mart CEO Duke as operating executive: WSJ "
    },
    {
        "content": "April 16 Carlyle Group LP has enlisted Mike Duke  former chief executive of Wal-Mart Stores Inc   to the executive team that the asset management firm taps for advise on deals  the Wall Street Journal reported.",
        "date": "04162015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "REFILE-MOVES-Carlyle Group names ex-Wal-Mart CEO Duke as operating executive -WSJ "
    },
    {
        "content": "HONG KONG  April 15 Carlyle Group is seeking to raise about $430 million by selling its entire remaining shares in China's Haier Electronics Group Co   IFR reported on Wednesday  citing a deal term sheet.",
        "date": "04152015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle seeks to raise about $430 mln via Haier stake sale "
    },
    {
        "content": "Paint maker Axalta Coating Systems Ltd  said Berkshire Hathaway Inc  would buy an 8.7 percent stake in the company from controlling shareholder Carlyle Group  for $560 million.",
        "date": "04072015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Berkshire takes 8.7 percent stake in Carlyle-controlled Axalta "
    },
    {
        "content": "April 7 Paint maker Axalta Coating Systems Ltd  said Berkshire Hathaway Inc would buy an 8.7 percent stake in the company from controlling shareholder Carlyle Group for $560 million.",
        "date": "04072015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Berkshire takes 8.7 pct stake in Carlyle-controlled Axalta "
    },
    {
        "content": "April 7 Paints company Axalta Coating Systems Ltd said Berkshire Hathaway Inc would buy an 8.7 percent stake in the company from controlling shareholder Carlyle Group for $560 million.",
        "date": "04072015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Berkshire takes 8.7 pct stake in Carlyle-controlled Axalta "
    },
    {
        "content": "* Recommended cash offer for Nationwide Accident Repair Services Plc by Canaveral Bidco",
        "date": "04012015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "BRIEF-Carlyle offers to buy Nationwide Accident Repair Services for about 43.2 mln stg "
    },
    {
        "content": "March 26 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "03262015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON  March 26 Private equity firm Carlyle Group said on Thursday it had agreed to buy Sterling Resources' Romanian gas fields  days after it raised $2.5 billion to snap up energy assets around the world.",
        "date": "03262015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle launches energy asset buying spree with Romanian deal "
    },
    {
        "content": "HONG KONG Private equity firm CVC Capital Partners [CVC.UL]  a unit of Carlyle Group LP  and Singapore's sovereign wealth fund GIC [GIC.UL] raised a combined $710 million after Hong Kong's second-largest broadband Internet provider  HKBN Ltd   priced its IPO at the top of expectations  people familiar with the deal said on Thursday.",
        "date": "03052015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "HKBN IPO priced at top of range as CVC  GIC  Carlyle raise $710 million "
    },
    {
        "content": "HONG KONG  March 5 Private equity firm CVC Capital Partners  a unit of Carlyle Group LP and Singapore's sovereign wealth fund GIC raised a combined $710 million after Hong Kong's second-largest broadband Internet provider  HKBN Ltd  priced its IPO at the top of expectations  people familiar with the deal said on Thursday.",
        "date": "03052015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-HKBN IPO priced at top of range as CVC  GIC  Carlyle raise $710 mln "
    },
    {
        "content": "HONG KONG  March 5 Private equity firm CVC Capital Partners  a unit of Carlyle Group LP and Singapore's sovereign wealth fund GIC raised a combined $710 million after Hong Kong's second-largest broadband Internet provider  HKBN  priced its initial public offering at the top of expectations  IFR reported on Thursday citing people familiar with the deal.",
        "date": "03052015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "CORRECTED-CVC  GIC  Carlyle raise $710 mln after HKBN prices IPO at top of range -IFR "
    },
    {
        "content": "Technology consultant Computer Sciences Corp  drew buyout interest from French consulting company Cap Gemini SA  and private equity firm Carlyle Group LP   according to people familiar with the matter.",
        "date": "02242015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Exclusive: Cap Gemini  Carlyle held talks to buy Computer Sciences - sources "
    },
    {
        "content": "A federal appeals court has ruled in favor of Carlyle Group LP in concluding that a dispute over losses arising from the 2008 liquidation of its Carlyle Capital Corp affiliate should be addressed in Delaware Chancery Court.",
        "date": "02252015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "U.S. court says non-signatory bound by Carlyle contract's forum clause "
    },
    {
        "content": "Technology consultant Computer Sciences Corp drew buyout interest from French consulting company Cap Gemini SA and private equity firm Carlyle Group LP  according to people familiar with the matter.",
        "date": "02252015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Exclusive: Cap Gemini  Carlyle held talks to buy Computer Sciences - sources "
    },
    {
        "content": "Carlyle Group LP paid its co-president who was hired last year from JPMorgan Chase & Co $31.2 million in 2014  a higher compensation than many veterans received at the private equity firm  a regulatory filing showed on Thursday.",
        "date": "02272015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle splashes out $31.2 million on former JPMorgan executive "
    },
    {
        "content": "Feb 26 Carlyle Group LP paid its co-president who was hired last year from JPMorgan Chase & Co  $31.2 million in 2014  a higher compensation than many veterans received at the private equity firm  a regulatory filing showed on Thursday.",
        "date": "02272015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "REFILE-Carlyle splashes out $31.2 million on former JPMorgan executive "
    },
    {
        "content": "Feb 17 Philadelphia Energy Solutions  a joint venture part owned by Carlyle Group LP  filed with U.S. regulators for an initial public offering.",
        "date": "02172015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle-backed Philadelphia Energy Solutions files for IPO "
    },
    {
        "content": "Carlyle Group LP  reported a 68 percent year-on-year drop in fourth-quarter profit  as the appreciation of its portfolio slowed down  yet the decline was smaller than most analysts expected due to strong cash proceeds from asset sales.",
        "date": "02112015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Carlyle beats fourth-quarter profit estimates on asset sales "
    },
    {
        "content": "Feb 11 Carlyle Group LP reported a 68 percent year-on-year drop in fourth-quarter profit  as the appreciation of its portfolio slowed down  yet the decline was smaller than most analysts expected due to strong cash proceeds from asset sales.",
        "date": "02112015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "UPDATE 1-Carlyle beats Q4 profit estimates on asset sales "
    },
    {
        "content": "Feb 11 Carlyle Group LP reported a 68 percent year-on-year drop in fourth-quarter profit  as the appreciation of its portfolio slowed down  yet the decline was smaller than most analysts expected due to strong cash generation from asset sales.",
        "date": "02112015",
        "name": "The Carlyle Group LP",
        "news_type": "normal",
        "symbol": "CG",
        "title": "Carlyle beats Q4 profit estimates on asset sales "
    },
    {
        "content": "Jan 9 Carlyle Group LP said on Friday the value of its natural resources-focused private equity fund portfolio fell by 8 percent in the fourth quarter  highlighting the impact of lower oil and natural gas prices on such investments.",
        "date": "01092015",
        "name": "The Carlyle Group LP",
        "news_type": "topStory",
        "symbol": "CG",
        "title": "Low energy prices hit some Carlyle funds "
    }
]