[
    {
        "content": "SAO PAULO  Nov 8 Tim Participações SA   Brazil's second-largest wireless phone company  expressed concerns on Wednesday about the potential acquisition of debt-laden carrier Oi SA by state-run China Telecom Corp Ltd  adding to criticism already put forth by rival Telefonica Brasil SA.",
        "date": "11082017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "UPDATE 1-Brazil's TIM criticizes China Telecom tactics in Oi bid "
    },
    {
        "content": "* Additional 168 businesses have signed sales agreements through china telecom wuxi to deploy netlinkz's patented cloud networking solution​",
        "date": "11082017",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "BRIEF-Netlinkz says additional 168 businesses have signed sales agreements through China Telecom Wuxi "
    },
    {
        "content": "BRASILIA/SAO PAULO Representatives of U.S. private equity firm TPG Capital Management LP and state-owned China Telecom Corp Ltd  met with Brazil's solicitor general on Monday to discuss a possible takeover of debt-laden telecom provider Oi SA .",
        "date": "11012017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "TPG  China Telecom discuss possible Oi bid with Brazilian official "
    },
    {
        "content": "RIO DE JANEIRO China Telecom Corp  may invest up to 20 billion reais ($6 billion) to acquire a majority stake in Brazilian carrier Oi SA   a source with knowledge of the matter told Reuters on Friday.",
        "date": "11032017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "China Telecom may spend up to $6 bln to control Brazil's Oi: source "
    },
    {
        "content": "BRASILIA/SAO PAULO  Nov 1 Representatives of U.S. private equity firm TPG Capital Management LP and state-owned China Telecom Corp Ltd met with Brazil's solicitor general on Monday to discuss a possible takeover of debt-laden telecom provider Oi SA.",
        "date": "11012017",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "UPDATE 1-TPG  China Telecom discuss possible Oi bid with Brazilian official "
    },
    {
        "content": "RIO DE JANEIRO  Nov 3 China Telecom Corp may invest up to 20 billion reais($6 billion) to acquire a majority stake in Brazilian carrier Oi SA  a source with knowledge of the matter told Reuters on Friday.",
        "date": "11032017",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "China Telecom may spend up to $6 bln to control Brazil's Oi -source "
    },
    {
        "content": "SAO PAULO  Nov 1 Representatives of U.S. private equity firm TPG Capital Management LP and state-owned China Telecom Corp Ltd are meeting with Brazil's solicitor general on Monday to discuss a possible takeover of debt-laden telecom provider Oi SA  local media reported.",
        "date": "11012017",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "TPG  China Telecom discuss possible Oi bid with Brazilian official -media "
    },
    {
        "content": "* 9-month ‍operating revenues were RMB274 702 million  up 4.1%​",
        "date": "10272017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-China Telecom 9-mnth ‍profit up 5.5 pct "
    },
    {
        "content": "* Says it signed a strategic cooperation framework agreement with China Telecom",
        "date": "10242017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF- Kyland Technology signs strategic cooperation framework agreement with China Telecom "
    },
    {
        "content": "HONG KONG  Aug 23 State-owned telecommunications operator China Telecom Corp reported on Wednesday a 7.5 percent rise in first-half profit  as it added fourth generation (4G) mobile subscribers.",
        "date": "08232017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "China Telecom posts 7.5 pct rise in H1 profit on 4G growth "
    },
    {
        "content": "* China Telecom Wuxi signed sales contracts to provide Netlinkz's patented cloud networking solution to initial 5 customers in xinwu region Source text for Eikon: Further company coverage:",
        "date": "08232017",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "BRIEF-Netlinkz signs sales contract with China Telecom Wuxi "
    },
    {
        "content": "* Hy ‍profit attributable to equity holders of company was rmb12 537 million  up  7.4%​",
        "date": "08232017",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "BRIEF-China Telecom Corp's HY ‍profit attributable RMB12.54 bln  up 7.4 pct​ "
    },
    {
        "content": "* Says it plans to buy technology firm from controlling shareholder China Telecom Corporation for up to 250 million yuan ($37.11 million)",
        "date": "07272017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-Besttone Holding to buy technology firm from controlling shareholder China Telecom "
    },
    {
        "content": "BEIJING  May 31 The former chairman of the parent firm of China Telecom Corp was sentenced to six years in prison over corruption charges  China's state media said on Wednesday.",
        "date": "05312017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "Former chairman of China Telecom parent jailed for six years for graft "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG  May 24 (Fitch) Fitch Ratings has affirmed China Telecom Corporation Limited's (CTCL) Long-Term Foreign-Currency and Local-Currency Issuer Default Ratings (IDRs) at 'A+'. The Outlook is Stable. KEY RATING DRIVERS Government Support: The ratings benefit from a one-notch uplift for state support and CTCL's strategic importance to the Chinese sovereign (A+/Stable)  the company's ultimate majority owner. CTCL is 71% owned by China",
        "date": "05252017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "Fitch Affirms China Telecom at 'A+'  Outlook Stable "
    },
    {
        "content": "* Shareholders approved profit distribution proposal and declaration of a final dividend of RMB0.093043 per share for year ended 31 Dec 2016 Source text for Eikon: Further company coverage:",
        "date": "05232017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-China Telecom says shareholders approved declaration of final dividend "
    },
    {
        "content": "* Jan-March profit at 5.3 bln yuan vs 5.12 bln yuan year prior",
        "date": "04272017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "UPDATE 1-China Telecom says first-quarter profit rises 4.5 pct on 4G growth "
    },
    {
        "content": "* Shows Singapore's GIC Private Ltd has bought 15.9 million H-shares in China Telecom Corp Ltd at average HK$3.81 ($0.4900) per share on April 19  taking its long position to 6.04 percent from 5.93 percent",
        "date": "04212017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-GIC increases holding in China Telecom - HKEx disclosure "
    },
    {
        "content": "BEIJING Chang Xiaobing  the former chief executive and chairman of China Telecom Corp   pleaded guilty on Tuesday to taking bribes at the beginning of his trial  the official Xinhua News Agency reported.",
        "date": "04182017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "Former China Telecom chief pleads guilty to bribery: Xinhua "
    },
    {
        "content": "BEIJING  April 18 Chang Xiaobing  the former chief executive and chairman of China Telecom Corp  pleaded guilty on Tuesday to taking bribes at the beginning of his trial  the official Xinhua News Agency reported.",
        "date": "04182017",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "Former China Telecom chief pleads guilty to bribery - Xinhua "
    },
    {
        "content": "WASHINGTON The U.S. Department of Commerce will remove Chinese telecommunications equipment maker ZTE Corp  from a trade blacklist on Wednesday after the company pleaded guilty to violating sanctions on Iran and agreed to pay nearly $900 million  the agency said in a notice.",
        "date": "03292017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "China telecom firm ZTE removed from U.S. trade blacklist "
    },
    {
        "content": "WASHINGTON  March 28    The U.S. Department of Commerce will remove Chinese telecommunications equipment maker ZTE Corp from a trade blacklist on Wednesday after the company pleaded guilty to violating sanctions on Iran and agreed to pay nearly $900 million  the agency said in a notice.",
        "date": "03282017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "UPDATE 1-China telecom firm ZTE removed from U.S. trade blacklist "
    },
    {
        "content": "* Dividend per share HK$0.105  up from HK$0.095   (Adds details on CAPEX from earnings press conference)",
        "date": "03212017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "UPDATE 2-China Telcom books 10 pct profit fall  says 4G subscribers doubled "
    },
    {
        "content": "HONG KONG  March 21 Chinese state-owned telecommunications network operator China Telecom Corp Ltd  said on Tuesday it had earmarked 89 billion yuan ($12.90 billion) for capital spending this year  down 8 percent from 2016.",
        "date": "03212017",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "China Telecom says 2017 capex 89 bln yuan  down 8 pct "
    },
    {
        "content": "HONG KONG  March 21 Chinese state-owned telecommunications network operator China Telecom Corp Ltd  on Tuesday said net profit fell 10.2 percent last year due to one-off factors.",
        "date": "03212017",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "China Telcom says full year profit fell 10.2 pct due to one-off factors "
    },
    {
        "content": "* Netlinkz signs China JV  testing phase with China Telecom-Net.ax",
        "date": "02202017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-Netlinkz Ltd signs agreement with Jiannan Information Technology "
    },
    {
        "content": "\u007f Entered strategic agreement with China Telecom Corporation Ltd to develop convergent network dedicated to connected-car services \u007f Under agreement parties will develop a convergent mobile delivery network",
        "date": "02062017",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-CMMB Vision enters strategic agreement with China Telecom Corp "
    },
    {
        "content": "Further company coverage:    (Reporting by Hong Kong newsroom)",
        "date": "11222016",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-Zhejiang Haers Vacuum Containers signs strategic agreement with China Telecom "
    },
    {
        "content": "* 9-month net profit RMB 17.543 billion versus RMB 16.36 billion",
        "date": "10282016",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-China Telecom posts 7.2 pct rise in net profit for nine-months "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG  October 12 (Fitch) Fitch Ratings says that the potential  mixed-ownership reform pilot for China Unicom (Hong Kong) Limited (CUHKL) is  unlikely to harm the market positions and credit profiles of China Mobile  Limited (CML  A+/Stable) and China Telecom Corporation Limited (CTCL   A+/Stable). However  the reform could delay or derail any merger between CTCL  and CUHKL  the second- and third-largest Chinese telecommunications ",
        "date": "10132016",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "Fitch: Mixed-Ownership Pilot May Derail Chinese Telcos' Mega-Merger "
    },
    {
        "content": "* Will work with China Telecom satellite to offer in-flight connectivity service on international flights operating in and out of China  Source text for Eikon:  Further company coverage:",
        "date": "08152016",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-Gogo will work with China Telecom satellite "
    },
    {
        "content": "* Says Nokia and China Telecom have signed an agreement to expand deployment of 4G technology in 19 provinces in China",
        "date": "08122016",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-Finland's Nokia signs 4G deal with China Telecom "
    },
    {
        "content": "* Singapore's GIC Pte Ltd acquires 3.632 million shares in China Telecom at an average price of HK$3.91 a share",
        "date": "08042016",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-Singapore's GIC acquires shares in China Telecom - HKEx filing "
    },
    {
        "content": "* China Telecom Corp and Saudi Telecom expressed interest in acquiring 4G mobile-phone licenses offered by Egyptian government - Bloomberg  Source text : http://bloom.bg/2a6otST   (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "07192016",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-China Telecom  Saudi Telecom show interest in Egyptian 4G licenses- Bloomberg "
    },
    {
        "content": "BEIJING  July 11 Chang Xiaobing  the former chief executive and chairman of China Telecom Corp  has been expelled from China's Communist Party and will face prosecution  the Communist Party's anti-graft watchdog announced on Monday.",
        "date": "07112016",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "Former China Telecom boss to face prosecution for graft "
    },
    {
        "content": "* Says it unit signs cooperation contract with Huanggang Branch of China Telecom Corporation Limited",
        "date": "06302016",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-Beijing Lanxum Technology unit signs cooperation contract "
    },
    {
        "content": "* Says its unit wins bid of China Telecom for smart set top box procurement",
        "date": "07052016",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-Sichuan Jiuzhou Electric units wins bid of China Telecom worth 41 mln yuan "
    },
    {
        "content": "BEIJING  April 11 China's state assets supervisor said on Monday a new chairman had been appointed for the parent of state-run China Telecom Corp  after its previous chairman resigned amid investigation for alleged disciplinary violation.",
        "date": "04112016",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "UPDATE 1-China Telecom gets new chairman after ex-head resigned amid investigation "
    },
    {
        "content": "BEIJING  April 11 China's state assets supervisor said on Monday a new chairman had been appointed for the parent of state-run China Telecom Corp  after its previous chairman resigned amid investigation for alleged disciplinary violation.",
        "date": "04112016",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "China Telecom gets new chairman after ex-head resigned amid investigation "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG/SYDNEY/SINGAPORE  April 01 (Fitch) Fitch Ratings has affirmed China  Telecom Corporation Limited's (CTCL) Long-Term Foreign-Currency and  Local-Currency Issuer Default Ratings (IDRs) at 'A+' with a Stable Outlook. KEY RATING DRIVERS Government Support: The ratings benefit by one notch from state support and  CTCL's strategic importance to the Chinese sovereign (A+/Stable) - the company's  ultimate majority owner. CTCL is 71% o",
        "date": "04012016",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "Fitch Affirms China Telecom at 'A+' with Stable Outlook "
    },
    {
        "content": "BEIJING  Feb 6 Cai Xiyou  president of Sinochem Group  the Chinese energy and chemicals conglomerates  has been put under investigation for serious discipline violations  China's main anti-corruption agency said on Saturday  using the usual euphemism for graft.",
        "date": "02062016",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "China starts investigation of Sinochem Group president Cai Xiyou "
    },
    {
        "content": "* Says signs strategic cooperation agreement with China Telecom",
        "date": "01132016",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-China Unicom  China Telecom sign strategic agreement "
    },
    {
        "content": "HONG KONG  Dec 30 State-run China Telecom Corp Ltd said on Wednesday that Chairman and Chief Eexecutive Chang Xiaobing has resigned with immediate effect  just days after authorities said he was being investigated for alleged disciplinary violation.",
        "date": "12302015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "China Telecom chairman steps down amid investigation "
    },
    {
        "content": "BEIJING/HONG KONG The chairman of state-run China Telecom Corp Ltd is being investigated for alleged disciplinary violation  the ruling Communist Party's anti-corruption watchdog said  the latest senior executive to be caught in an anti-graft dragnet.",
        "date": "12282015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "China Telecom chairman under investigation as anti-graft probe widens "
    },
    {
        "content": "* Chairman is latest executive ensnared in anti-graft crackdown",
        "date": "12282015",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "UPDATE 2-China Telecom chairman under investigation as anti-graft probe widens "
    },
    {
        "content": "BEIJING  Dec 27 The chairman of China Telecom Corp Ltd is being investigated for alledged disciplinary violation  the ruling Communist Party's anti-corruption watchdog said on Sunday.",
        "date": "12272015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "China Telecom chairman under investigation - anti-graft agency "
    },
    {
        "content": "* Alcatel-Lucent and China Telecom expand 4G LTE across 12 provinces of China  Source text: http://bit.ly/1Ons1u1 Further company coverage:    (Gdynia Newsroom:)",
        "date": "11232015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-Alcatel-Lucent and china telecom expand 4G LTE across 12 provinces of China "
    },
    {
        "content": "BELGRADE  Nov 4 China Telecom Corp has joined a list of companies interested in purchasing a majority stake in Serbia's biggest telecom provider  a government official said on Wednesday.",
        "date": "11042015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "China Telecom Corp is latest company to show interest in Serbia telecoms sale "
    },
    {
        "content": "BEIJING/HONG KONG  Oct 22 China Unicom Hong Kong Ltd's net income for the first nine months fell 23 percent as the company continued to lose lucrative high-speed data customers to rivals such as China Mobile Ltd and China Telecom Corp Ltd.",
        "date": "10222015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "China Unicom 9-month net profit falls 23 pct "
    },
    {
        "content": "* Says signs data center service contract with China Telecom's Shanghai branch",
        "date": "10202015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-Baosight Software signs service contract with China Telecom's Shanghai branch "
    },
    {
        "content": "* China occasionally rotates state-owned sector chiefs   (Combines three firms' appointments  context)",
        "date": "08242015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "UPDATE 1-China's state-owned telecoms firms shuffle top executives "
    },
    {
        "content": "* Says H1 net profit up 43.2 percent y/y at 1.6 billion yuan  ($249.63 million)",
        "date": "08262015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-China telecom equipment  handsets maker ZTE's H1 net profit up 43.2 pct "
    },
    {
        "content": "BEIJING  Aug 19 China Telecom Corp Ltd   the smallest of three national carriers  said on Wednesday its half-year profit fell 4 percent to 11 billion yuan ($1.72 billion) as Internet data demand failed to fully offset a continued slide in mobile voice calls.",
        "date": "08192015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "China Telecom H1 profit falls 4 pct as data fails to offset slide in voice services "
    },
    {
        "content": "BANGKOK  June 24 Thailand's Loxley PCL  said on Wednesday its unit Loxley Wireless Co Ltd had signed a memorandum of understanding with a unit of China Telecom to jointly propose to be a strategic partner of state-run telecoms firm TOT.",
        "date": "06242015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "Thailand's Loxley  China Telecom unit to jointly seek TOT partnership "
    },
    {
        "content": "* Its modified game 'Frederic: Resurrection of Music' debuts on China Telecom as of June 21  Source text for Eikon:",
        "date": "06222015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-Forever Entertainment game debuts on China Telecom "
    },
    {
        "content": "BEIJING  April 28 China Telecom's  quarterly net profit fell 9 percent from a year ago to 5.05 billion yuan ($815 million)  hurt by the introduction of China's new value-added tax which replaced a flat rate tax.",
        "date": "04282015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "China Telecom Q1 net profit falls 9 pct after tax reform "
    },
    {
        "content": "SHANGHAI Chinese e-commerce leader Alibaba Group Holding Ltd and state-owned China Telecom Corp Ltd have tied up to sell inexpensive smartphones aimed at boosting mobile commerce in smaller cities and rural areas.",
        "date": "04252015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "Alibaba  China Telecom tie up to sell phones "
    },
    {
        "content": "BEIJING  April 17 China's top anti-graft agency has opened an investigation into former China Telecom Corp Ltd  vice president and chief engineer Leng Rongquan  a 20-year executive and Communist Party member who retired in 2010.",
        "date": "04172015",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "China says investigating former China Telecom vice president "
    },
    {
        "content": "BEIJING  April 17 China's top anti-graft agency has opened an investigation into former China Telecom Corp Ltd  president and chief engineer Leng Rongquan  a 20-year executive and Communist Party member who retired in 2010.",
        "date": "04172015",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "UPDATE 1-China says investigating former China Telecom vice president "
    },
    {
        "content": "BEIJING  April 2 International Business Machines (IBM) has struck a deal with China Telecom Corp Ltd  to offer and manage corporate-grade mobile apps  the latest in a string of tie-ups with Chinese firms.",
        "date": "04022015",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "IBM forges mobile app partnership with China Telecom "
    },
    {
        "content": "Further company coverage:    ($1 = 6.2116 Chinese yuan renminbi)   (Reporting by Hong Kong and Singapore newsrooms)",
        "date": "03252015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-China telecom equipment and handsets maker ZTE's 2014 net profit up 94 pct "
    },
    {
        "content": "* China Telecom selects Gemalto to deploy mobile NFC transport in China's two largest cities",
        "date": "03242015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-Gemalto says to provide mobile NFC SIMs to China Telecom "
    },
    {
        "content": "* Firm says subscriber mix improving with 119 million 3G/4G users   (Adds estimates  dividend  shares)",
        "date": "03182015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "UPDATE 1-China Telecom's full-year profit misses  VAT hurts "
    },
    {
        "content": "BEIJING  March 18 China Telecom posted revenue of 324.4 billion yuan in 2014  in line with analyst expectations as subscriber figures stabilised at the smallest of the country's three carriers despite mounting competition.",
        "date": "03182015",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "China Telecom posts revenue of 324 bln yuan in 2014  as expected "
    },
    {
        "content": "* says wins largest non-Chinese vendor share in China Telecom's Phase 2 LTE tender",
        "date": "03022015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "BRIEF-Nokia says wins large 4G deal from China Telecom "
    },
    {
        "content": "* 4G users pay more on average than other subscribers   (Adds subscriber numbers  context)",
        "date": "02272015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "UPDATE 1-China issues 4G licences to China Telecom  China Unicom "
    },
    {
        "content": "BEIJING  Feb 27 China has issued licences to operate 4G wireless networks to China Telecom Corp Ltd  and China Unicom Hong Kong Ltd  two of the country's three carriers  the Ministry of Industry and Information Technology said on Friday.",
        "date": "02272015",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "China issues 4G FDD licences to China Telecom  China Unicom "
    },
    {
        "content": "BEIJING Shares of all three Chinese telecommunications carriers rose on Thursday following speculation on social media of consolidation in the sector that would see China Telecom Corp Ltd and China Unicom merge.",
        "date": "02122015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "Merger speculation sends Chinese telecom shares higher "
    },
    {
        "content": "MEXICO CITY  Jan 17 China Telecommunications Corporation  the parent of China's third-largest carrier  is studying a possible investment in Mexico  a company spokesman said on Saturday  a day after Reuters reported that the subsidiary is preparing a possible bid for Mexico's new $10 billion mobile broadband network.",
        "date": "01192015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "CORRECTED-China Telecom parent studying Mexico investment - spokesman "
    },
    {
        "content": "Jan 16 The following bids  mergers  acquisitions and disposals were reported by 2115 GMT on Friday:",
        "date": "01162015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "MEXICO CITY China's third-largest carrier China Telecom is preparing a possible bid for a contract to build and run a new mobile broadband network in Mexico and is seeking local partners to join it in a consortium  three people with knowledge of the matter said.",
        "date": "01162015",
        "name": "China Telecom Corp Ltd",
        "news_type": "normal",
        "symbol": "CHA",
        "title": "Exclusive: China Telecom plans bid to build Mexico broadband network - sources "
    },
    {
        "content": "MEXICO CITY  Jan 17 China's third-largest carrier China Telecom is studying a possible investment in Mexico  a company spokesman said on Saturday  a day after Reuters reported that it is preparing a possible bid for Mexico's new $10 billion mobile broadband network.",
        "date": "01172015",
        "name": "China Telecom Corp Ltd",
        "news_type": "topStory",
        "symbol": "CHA",
        "title": "China Telecom studying Mexico investment - spokesman "
    }
]