[
    {
        "content": "* Appaloosa Lp cuts share stake in Chesapeake Energy Corp to 766 000 shares from 3.6 million shares - sec filing",
        "date": "11142017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Appaloosa Lp cuts share stake in Chesapeake  Bank of America "
    },
    {
        "content": "The U.S. Department of Justice ended a three-year probe of Chesapeake Energy Corp's  royalty payment and land purchase practices without taking action  the natural gas producer said in a securities filing on Thursday.",
        "date": "11022017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "U.S. Justice Department ends probe of Chesapeake mineral royalty practices "
    },
    {
        "content": "Nov 2 The U.S. Department of Justice ended a three-year probe of Chesapeake Energy Corp's royalty payment and land purchase practices without taking action  the natural gas producer said in a securities filing on Thursday.",
        "date": "11022017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "U.S. Justice Dept ends probe of Chesapeake mineral royalty practices "
    },
    {
        "content": "U.S. natural gas producer Chesapeake Energy Corp  on Thursday missed Wall Street's quarterly revenue estimates and     warned of flat-to-modest production growth next year  sending its shares down as much as 8 percent.",
        "date": "11022017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake warns of modest 2018 production growth "
    },
    {
        "content": "Nov 2 U.S. natural gas producer Chesapeake Energy Corp on Thursday missed Wall Street's quarterly revenue estimates and     warned of flat-to-modest production growth next year  sending its shares down as much as 8 percent.",
        "date": "11022017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 3-Chesapeake warns of modest 2018 production growth "
    },
    {
        "content": "* Chesapeake Energy Corporation reports 2017 third quarter financial and operational results",
        "date": "11022017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy Q3 adjusted earnings per share $0.12 "
    },
    {
        "content": "Nov 2 Chesapeake Energy Corp on Thursday posted a smaller loss in the third quarter as it kept a tight lid on costs and benefited from higher oil prices.",
        "date": "11022017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy posts smaller loss as costs fall "
    },
    {
        "content": "* Chesapeake Energy Corp announces final results of cash tender offers for senior notes and senior secured second lien notes Source text for Eikon: Further company coverage:",
        "date": "10262017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy Corp announces final results of cash tender offers "
    },
    {
        "content": "* Chesapeake Energy Corp - co  guarantors issued $300 million 8.00% senior notes due 2025 & $550 million 8.00% senior notes due 2027 - SEC filing‍​‍​",
        "date": "10122017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy says co  guarantors issued $300 mln 8 pct senior notes due 2025 & $550 mln 8 pct senior notes due 2027 "
    },
    {
        "content": "* Chesapeake Energy Corporation announces pricing and upsizing of private placement of $850 000 000 of senior notes",
        "date": "09282017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy announces pricing  upsizing of private placement of $850 mln of senior notes "
    },
    {
        "content": "* Chesapeake energy corporation announces private placement of $750 000 000 of senior notes",
        "date": "09272017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy announces private placement of $750 mln senior notes "
    },
    {
        "content": "Chesapeake Energy Corp said on Tuesday it expects a 15 percent drop in third-quarter production  partly blaming Hurricane Harvey  which forced the company to stop work in the Eagle Ford shale region of Texas.",
        "date": "09262017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake sees 15 percent drop in third-quarter output as Harvey hurts "
    },
    {
        "content": "* Shares down 1.5 pct; energy index also lower as oil falls (Adds analyst estimate and comment  updates shares)",
        "date": "09262017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 2-Chesapeake sees 15 pct drop in Q3 output as Harvey hurts "
    },
    {
        "content": "* Chesapeake Energy Corporation provides 2017 third quarter update",
        "date": "09262017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy Corporation provides 2017 third quarter update "
    },
    {
        "content": "Sept 26 Chesapeake Energy Corp said it expects a 15 percent drop in third-quarter production due to disruptions in weather  asset sales and changes in capital allocation.",
        "date": "09262017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy expects 15 pct drop in Q3 output "
    },
    {
        "content": "* Chesapeake Energy Corporation announces the appointment of Leslie S. Keating to board of directors Source text for Eikon: Further company coverage:",
        "date": "09122017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy appoints of Leslie Keating to board "
    },
    {
        "content": "HOUSTON  Aug 28 Chesapeake Energy Corp said on Monday its production volumes will be restrained until refineries in Houston and the U.S. Gulf Coast come back online after Tropical Storm Harvey.",
        "date": "08282017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy sees volume dip with Houston refineries offline "
    },
    {
        "content": "HOUSTON  Aug 25 Chesapeake Energy Corp said on Friday it has suspended drilling and completion of new wells in the Eagle Ford shale for at least the weekend  and has also evacuated staff  as Hurricane Harvey makes landfall along the Texas coast.",
        "date": "08252017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy idles Eagle Ford operations due to Hurricane Harvey "
    },
    {
        "content": "U.S. natural gas producer Chesapeake Energy Corp beat quarterly profit estimates  but said it planned to cut its rig count and bring fewer wells into production this year.",
        "date": "08032017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake to cut rig count  bring fewer wells to production "
    },
    {
        "content": "* Shares fall as much as 2.5 pct (Adds drilling projections  analyst comment  CEO quote)",
        "date": "08032017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 3-Chesapeake to cut rig count  bring fewer wells to production "
    },
    {
        "content": "* Chesapeake Energy's CEO says \"we expect to exceed our goal of 100 000 barrels of oil per day prior to year-end\" - conf call",
        "date": "08032017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy expects to exceed goal of 100 000 barrels of oil/day prior to yr-end "
    },
    {
        "content": "* Chesapeake energy corporation reports 2017 second quarter financial and operational results",
        "date": "08032017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy Q2 earnings per share $0.47 "
    },
    {
        "content": "Aug 3 U.S. oil and gas producer Chesapeake Energy Corp posted a quarterly profit  compared with a year-ago loss  when it took a charge of $1.07 billion.",
        "date": "08032017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy posts second-quarter profit "
    },
    {
        "content": "* Chesapeake energy says Director Brad Martin reports open market purchase of 20 400 shares of co's common stock at $4.55/share on june 23 - SEC filing Source text for Eikon: (http://bit.ly/2shU2g8) Further company coverage:",
        "date": "06272017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy says director reports open market purchase of shares "
    },
    {
        "content": "* Chesapeake Energy Corp says about 298 BCF of natural gas hedged in 2018 with swaps at an average price of $3.16 - presentation ‍​",
        "date": "06262017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy Corp says about 298 BCF of natural gas hedged in 2018 with swaps at an average price of $3.16 - presentation ‍​ "
    },
    {
        "content": "* Chesapeake Energy Corporation announces final results of cash tender offers for senior notes",
        "date": "06202017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy announces final results of cash tender offers for senior notes "
    },
    {
        "content": "* Chesapeake Energy Corporation announces redemption of 2.500% contingent convertible senior notes due 2037",
        "date": "06222017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy calls for redemption of its outstanding 2.5% contingent convertible senior notes "
    },
    {
        "content": "* Chesapeake Energy Corporation announces redemption of 2.75% contingent convertible senior notes due 2035",
        "date": "06222017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy announces redemption of 2.75% contingent convertible senior notes "
    },
    {
        "content": "* Chesapeake energy - lenders reaffirmed $3.8 billion borrowing base under co's senior revolving credit agreement  dated Dec 15  2014 effective as of June 15 Source text for Eikon: (http://bit.ly/2rOGecL) Further company coverage:",
        "date": "06192017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy's lenders reaffirm $3.8 bln borrowing base "
    },
    {
        "content": "* Chesapeake energy corporation announces early tender results and early settlement date for cash tender offers for senior notes Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06062017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy Corp announces early tender results "
    },
    {
        "content": "* Chesapeake Energy director R. Brad Martin reports open market purchase of 20 000 shares of co's stock on May 26 at $5.26/share - SEC filing",
        "date": "05312017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy Corp director R. Brad Martin buys 20 000 shares of co's stock on May 26 "
    },
    {
        "content": "* Director Thomas Ryan reports purchase of 75 000 shares of co's common shares on May 31 - SEC filing",
        "date": "06012017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake director Thomas Ryan reports purchase of 75 000 shares on May 31 "
    },
    {
        "content": "* Chesapeake energy corporation announces pricing of private placement of $750 000 000 of senior notes",
        "date": "05222017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy Corp announces pricing of private placement of $750 mln of senior notes "
    },
    {
        "content": "* Chesapeake Energy Corporation announces private placement of $750 000 000 of senior notes",
        "date": "05222017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy announces private placement of $750 mln of senior notes "
    },
    {
        "content": "U.S. natural gas producer Chesapeake Energy Corp reported a bigger-than-expected fall in production on Thursday  even as it spent more than what analysts had estimated  sending its shares down as much as 8.4 percent.",
        "date": "05042017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake production falls more than expected  shares down "
    },
    {
        "content": "May 4Chesapeake Energy Corp posted a quarterly profit  compared with a year-ago loss  when the U.S. natural gas producer took charges to write down the value of some oil and gas assets.",
        "date": "05042017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake posts quarterly profit versus year-ago loss "
    },
    {
        "content": "WASHINGTON  April 24 The U.S. Supreme Court on Monday rejected a bid by natural gas company Chesapeake Energy Corp to avoid having to pay $438.7 million to investors in a bonds dispute.",
        "date": "04242017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "U.S. Supreme Court snubs Chesapeake Energy in bonds dispute "
    },
    {
        "content": "* Chesapeake Energy Corporation notifies holders of its 2.5% contingent convertible senior notes due 2037 of their repurchase option",
        "date": "03302017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy notifies holders of its 2.5 pct contingent convertible senior notes due 2037 of their repurchase option "
    },
    {
        "content": "Feb 23 U.S. natural gas producer Chesapeake Energy Corp posted a smaller fourth-quarter loss than a year earlier  when it took huge charges to write down the value of some oil and gas assets.",
        "date": "02232017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy posts smaller quarterly loss "
    },
    {
        "content": "Feb 23 Shares in U.S. natural gas producer Chesapeake Energy Corp fell on Thursday after posting a smaller fourth-quarter loss than a year earlier  when it took huge charges to write down the value of some oil and gas assets.",
        "date": "02232017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 3-Chesapeake Energy posts smaller quarterly loss "
    },
    {
        "content": "* Chesapeake energy corporation reports 2016 full year and fourth quarter financial and operational results",
        "date": "02232017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy reports Q4 adjusted earnings $0.07/share "
    },
    {
        "content": "* Omega Advisors Inc takes share stake of 50 000 shares in Bluebird Bio Inc - SEC filing",
        "date": "02142017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Omega Advisors cuts share stake in Alphabet  Microsoft; dissolves in Chesapeake Energy "
    },
    {
        "content": "* Press release - Covey Park announces acquisition of additional Haynesville assets from Chesapeake Energy for $465 million",
        "date": "02152017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Covey Park Energy LLC buys additional Haynesville assets from Chesapeake Energy "
    },
    {
        "content": "* Chesapeake Energy Corporation provides 2017 guidance and operational update",
        "date": "02142017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy provides 2017 outlook "
    },
    {
        "content": "* Southeastern Asset Management Inc reports a 5.7 percent passive stake in Chesapeake Energy Corp as of Dec 31  2016 - SEC filing",
        "date": "02102017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Southeastern Asset Management reports 5.7 pct stake in Chesapeake Energy "
    },
    {
        "content": "* Chesapeake Energy Corporation reinstates payment of quarterly preferred stock dividends  Source text for Eikon:  Further company coverage:",
        "date": "01202017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy reinstates payment of quarterly preferred stock dividends "
    },
    {
        "content": "* Chesapeake Energy - as of January 19  2017  entered into privately negotiated purchase and exchange agreements - sec filing",
        "date": "01202017",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy says entered into privately negotiated purchase and exchange agreements "
    },
    {
        "content": "Chesapeake Energy Corp   the second largest U.S. producer of natural gas  said on Monday that it would sell a part of its acreage in the Haynesville Shale area for $450 million to a private company  which Reuters sources revealed as Indigo Minerals LLC  a competing natural gas producer.",
        "date": "12052016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake to sell Haynesville asset for $450 million to Indigo Minerals LLC "
    },
    {
        "content": "* Carl Icahn dissolves shared share stake in Chesapeake Energy Corp - SEC filing",
        "date": "11142016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Icahn dissolves shared share stake in Chesapeake Energy "
    },
    {
        "content": "* Omega Advisors dissolves share stake in Netflix - SEC filing",
        "date": "11142016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Omega Advisors dissolves share stake in Netflix  cuts in Facebook - SEC filing "
    },
    {
        "content": "* Chesapeake Energy - received DOJ subpoena and a voluntary document request from SEC seeking information on a certain accounting methodology - sec filing",
        "date": "11032016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy receives DOJ subpoena  voluntary document request from SEC "
    },
    {
        "content": "U.S. natural gas producer Chesapeake Energy Corp  reported a surprise adjusted profit  helped by lower expenses  and said it expects to exit the next two years at higher production rates.",
        "date": "11032016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy expects to exit 2017  2018 with higher output "
    },
    {
        "content": "Nov 3 U.S. natural gas producer Chesapeake Energy Corp reported a surprise adjusted profit  helped by lower expenses  and said it expects to exit the next two years at higher production rates.",
        "date": "11032016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 3-Chesapeake Energy expects to exit 2017  2018 with higher output "
    },
    {
        "content": "Nov 3 U.S. natural gas producer Chesapeake Energy Corp <CHK.N reported a smaller quarterly loss  compared with a year ago  when it wrote down the value of some oil and gas assets by $5.42 billion.",
        "date": "11032016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Natgas producer Chesapeake posts smaller quarterly loss "
    },
    {
        "content": "Oct 21 Wall Street securities analysts revised their ratings and price targets on several U.S.-listed companies  including Alkermes  Benchmark Electronics and  Copa Holdings on Friday.               HIGHLIGHTS             * Chesapeake Energy Corp        : Nomura raises to neutral from reduce        * Latam Airlines        : Santander raises to buy from hold       * Proofpoint Inc         : Piper Jaffray raises target price to $90 from $85; overweight                Following is a sum",
        "date": "10212016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "U.S. RESEARCH ROUNDUP-Alkermes  Chesapeake Energy Corp  Latam Airlines "
    },
    {
        "content": "U.S. natural gas producer Chesapeake Energy Corp closed a private placement of $1.25 billion of debt on Wednesday  shoring up capital for debt repayment 10 months after it said it had no plans to file for bankruptcy.",
        "date": "10052016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake shores up capital with $1.25 billion debt deal "
    },
    {
        "content": "Oct 5 U.S. natural gas producer Chesapeake Energy Corp closed a private placement of $1.25 billion of debt on Wednesday  shoring up capital for debt repayment 10 months after it said it had no plans to file for bankruptcy.",
        "date": "10052016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake shores up capital with $1.25 bln debt deal "
    },
    {
        "content": "Chesapeake Energy Corp  said on Tuesday that two directors  including a representative of activist investor Carl Icahn  resigned on Monday  a week after Icahn more than halved his stake in the natural gas producer.",
        "date": "09272016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Icahn nominee resigns from Chesapeake board; shares tumble "
    },
    {
        "content": "* S&P - Chesapeake Energy Corp. upgraded to 'CCC+' from 'SD'; Outlook negative; Proposed convertible notes rated",
        "date": "09292016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-S&P upgrades Chesapeake Energy Corp. to 'CCC+' from 'SD'; Outlook negative; Proposed convertible notes rated "
    },
    {
        "content": "Sept 27 Chesapeake Energy Corp said on Tuesday that two board directors  including a representative of activist investor Carl Icahn  resigned on Monday  a week after Icahn more than halved his stake in the natural gas producer.",
        "date": "09272016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Two Chesapeake directors  including Icahn representative  resign "
    },
    {
        "content": "Sept 29 Chesapeake Energy Corp said it received a subpoena from the U.S. Department of Justice seeking information on the accounting methodology for the acquisition and classification of oil and gas properties.",
        "date": "09292016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake receives DoJ subpoena on accounting for asset purchase "
    },
    {
        "content": "* Vincent J. Intrieri and John J. Lipinski informed co that they have resigned from board effective as of Sept 26 - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "09272016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Vincent J. Intrieri and John J. Lipinski resign from Chesapeake Energy board "
    },
    {
        "content": "* Says received DoJ subpoena seeking information on  accounting methodology for acquisition  classification of oil and gas properties and related matters- SEC filing",
        "date": "09292016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy says received DoJ subpoena seeking information on accounting methodology - SEC filing "
    },
    {
        "content": "* As of Sept 29  co entered privately negotiated purchase and exchange agreements  co agreed to exchange 6.7 million shares  - SEC filing",
        "date": "09292016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake energy entered privately negotiated purchase and exchange agreements "
    },
    {
        "content": "* Chesapeake Energy Corporation announces private placement of $850 million of convertible senior notes",
        "date": "09292016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy announces private placement of $850 million of convertible senior notes "
    },
    {
        "content": "* Carl Icahn reports 4.55 percent stake in Chesapeake Energy Corp  as of September 19  2016",
        "date": "09192016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Carl Icahn cuts stake in Chesapeake Energy to 4.55 pct  as of Sept. 19 - SEC Filing "
    },
    {
        "content": "NEW YORK  Sept 15 A federal appeals court on Thursday rejected Chesapeake Energy Corp's effort to avoid having to pay $438.7 million  including interest  to investors in a bond dispute.",
        "date": "09152016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy loses appeal in $438.7 mln bond dispute "
    },
    {
        "content": "NEW YORK A federal appeals court on Thursday rejected Chesapeake Energy Corp's effort to avoid having to pay $438.7 million  including interest  to investors in a bond dispute.",
        "date": "09152016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy loses appeal in $438.7 million bond dispute "
    },
    {
        "content": "* Director Archie Dunham reports open market purchase of 1.0 million common shares at average price of $6.67 per share on September 20 - SEC filing  Source text http://bit.ly/2cosH8R Further company coverage:",
        "date": "09212016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake director Archie Dunham reports open market purchase of 1 mln shares "
    },
    {
        "content": "NEW YORK  Sept 15 A federal appeals court on Thursday rejected Chesapeake Energy Corp's effort to avoid having to pay $438.7 million  including interest  to investors in a bond dispute.",
        "date": "09152016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 2-Chesapeake Energy loses appeal in $438.7 mln bond dispute "
    },
    {
        "content": "* Chesapeake Energy Corporation announces increase in size of cash tender offers for contingent convertible senior notes",
        "date": "08262016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy announces increase in size of cash tender offers "
    },
    {
        "content": "* Chesapeake Energy Corp first and second-lien debt ratings placed on creditwatch positive on improved liquidity",
        "date": "08192016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-S&P places Chesapeake Energy first  second-lien debt ratings on creditwatch positive "
    },
    {
        "content": "* Director  Archie Dunham reports open market purchase of 350 000 shares of co's common stock at average price of $6.07 per share on Aug 22  Source: (http://bit.ly/2bzUVxi) Further company coverage:",
        "date": "08232016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake- Director reports open market purchase of 350 000 shares "
    },
    {
        "content": "* Fitch affirms Chesapeake Energy's Idr At 'B'; outlook negative",
        "date": "08182016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Fitch affirms Chesapeake Energy's IDR at 'B-'; outlook negative "
    },
    {
        "content": "* Director Thomas Ryan reports open market purchase of 50 000 shares of co's common stock at average price of $5.60 per share on August 17  Source: (http://bit.ly/2b6xMiH) Further company coverage:",
        "date": "08182016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy- Director reports purchase of 50 000 common shares "
    },
    {
        "content": "* Moody's rates new Chesapeake Energy term loan CAA1; outlook changed to positive",
        "date": "08152016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Moody's rates new Chesapeake Energy term loan CAA1  changes outlook to positive "
    },
    {
        "content": "* Chesapeake Energy Corp downgraded to 'CC' on two tender offerings; outlook negative; new term loan rated 'B-'",
        "date": "08152016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-S&P downgrades Chesapeake Energy Corp to 'CC' on two tender offerings "
    },
    {
        "content": "Chesapeake Energy Corp  the second-largest U.S. natural gas producer  said on Monday that it had arranged a $1 billion 5-year term loan that it would use to buy back senior notes due between 2017 and 2038.",
        "date": "08152016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake arranges $1 billion loan to buy back senior notes "
    },
    {
        "content": "Aug 15 Chesapeake Energy Corp  the second-largest U.S. natural gas producer  said on Monday that it had arranged a $1 billion 5-year term loan that it would use to buy back senior notes due between 2017 and 2038.",
        "date": "08152016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake arranges $1 bln loan to buy back senior notes "
    },
    {
        "content": "* Chesapeake Energy Corporation announces cash tender offers for up to $500 million aggregate purchase price of contingent convertible senior notes",
        "date": "08152016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy Corp announces cash tender offers for up to $500 mln "
    },
    {
        "content": "* Chesapeake Energy Corporation announces arrangement of $1.0 billion term loan facility",
        "date": "08152016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake announces $1 bln term loan facility "
    },
    {
        "content": "* Chesapeake Energy Corporation agrees to exit Barnett shale  asset to be acquired and operated by first reserve  announces renegotiation of mid-contingent gas gathering agreement and provides preliminary 2017 guidance",
        "date": "08102016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake provides preliminary guidance  agrees to exit Barnett shale "
    },
    {
        "content": "Aug 10 Chesapeake Energy Corp said on Wednesday it agreed to sell its interests in the Barnett shale operating area to private equity-backed Saddle Barnett Resources LLC.",
        "date": "08102016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake to sell interests in Barnett shale operating area "
    },
    {
        "content": "* Raises 2016 production forecast about 3 pct   (Adds details on capex  production forecast)",
        "date": "08042016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "UPDATE 2-Chesapeake Energy raises asset sales target for 2016 "
    },
    {
        "content": "* Q2 earnings per share view $-0.10 -- Thomson Reuters I/B/E/S",
        "date": "08042016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy Q2 adjusted loss per share $0.14 excluding items "
    },
    {
        "content": "Debt-laden Chesapeake Energy Corp   the No.2 U.S. natural gas producer  raised its asset sales target and production forecast for the year  keeping its capital budget unchanged.",
        "date": "08042016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy raises asset sales target for 2016 "
    },
    {
        "content": "Aug 4 Chesapeake Energy Corp's quarterly net loss narrowed from a year earlier  when the No.2 U.S. natural gas producer had taken a $5 billion impairment charge.",
        "date": "08042016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy's quarterly loss narrows "
    },
    {
        "content": "June 29 The retirement plan at Chesapeake Energy Corp is being partially terminated after significant employee reductions at the company.",
        "date": "06292016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Layoffs at Chesapeake trigger partial termination of retirement plan "
    },
    {
        "content": "June 29 The retirement plan at Chesapeake Energy Corp  which has suffered heavy losses from big allocations in company stock  is being partially terminated after significant employee reductions at the company.",
        "date": "06292016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 1-Layoffs at Chesapeake trigger partial termination of retirement plan "
    },
    {
        "content": "* Entered into an amendment to employment agreement with Robert D. Lawler  president and chief executive officer",
        "date": "06172016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy extends CEO's term until Dec. 31  2018 "
    },
    {
        "content": "May 23 Chesapeake Energy Corp  the second-largest U.S. natural gas producer  said it had issued or agreed to issue about 5 percent of its outstanding shares in exchange for debt over the past week. (http://bit.ly/1YTaWw7)",
        "date": "05232016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake swaps debt for equity for second time in May "
    },
    {
        "content": "May 23 Chesapeake Energy Corp  the second-largest U.S. natural gas producer  said on Monday it had issued or agreed to issue about 5 percent of its outstanding shares in exchange for debt over the past week  the second such transaction this month.",
        "date": "05232016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 1-Chesapeake swaps debt for equity for second time in May "
    },
    {
        "content": "* Shareholders approved amendment to restated certificate of incorporation to increase authorized shares from 1 billion to 1.5 billion shares    Source text for Eikon:    Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05202016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy says shareholders approved amendment to increase authorized shares to 1.5 bln shares "
    },
    {
        "content": "* Chesapeake Energy Corp. Upgraded to 'CCC' from 'SD' following senior and convertible note exchange; outlook negative  Source (http://bit.ly/23YRKyi) Further company coverage:",
        "date": "05192016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-S&P says Chesapeake Energy Upgraded to 'CCC' from 'SD' "
    },
    {
        "content": "Debt-laden Chesapeake Energy Corp   the second-largest U.S. natural gas producer  said on Thursday it had issued or agreed to issue about 4 percent of its outstanding shares in exchange for debt over the past week.",
        "date": "05122016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake says swapped debt for 4 percent of equity over past week "
    },
    {
        "content": "NEW YORK  May 16 Former SAC executive Gabe Plotkin's Melvin Capital took a new position in streaming video service Netflix Inc  buying 950 000 shares and a call option for 1.45 million shares  according to regulatory filings on Monday. Hoplite Capital also took a new position in Netflix  buying 236 456 shares  while Blue Ridge took a new position  buying 1.4 million shares.",
        "date": "05162016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "HIGHLIGHTS-Top U.S. hedge funds bet on Netflix  Yahoo  consumer stocks "
    },
    {
        "content": "May 12 Debt-laden Chesapeake Energy Corp   the second-largest U.S. natural gas producer  said on Thursday it had issued or agreed to issue about 4 percent of its outstanding shares in exchange for debt over the past week.",
        "date": "05122016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 2-Chesapeake says swapped debt for 4 pct of equity over past week "
    },
    {
        "content": "May 12 Debt-laden Chesapeake Energy Corp   the second-largest U.S. natural gas producer  said on Thursday it had issued or agreed to issue about 4 percent of its outstanding shares in exchange for debt over the past week.",
        "date": "05122016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake says swapped debt for 4 pct of equity over past week "
    },
    {
        "content": "Debt-laden Chesapeake Energy Corp   the second-largest U.S. natural gas producer  said on Thursday it was selling $470 million in assets in Oklahoma to Newfield Exploration Co  as part of a plan to shore up its finances through divestitures.",
        "date": "05052016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake to sell some Oklahoma assets to Newfield for $470 million "
    },
    {
        "content": "* Chesapeake shares rise 13 percent   (Adds details of credit accord)",
        "date": "04112016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "UPDATE 3-Chesapeake surprises by keeping $4 bln borrowing base "
    },
    {
        "content": "* Capital Research Global Investors reports 4.9 percent passive stake in Chesapeake Energy - SEC filing    Source text for Eikon:    Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04082016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Capital Research Global reports 4.9 pct passive stake in Chesapeake Energy "
    },
    {
        "content": "Chesapeake Energy Corp  said its borrowing limit was reaffirmed at $4 billion  at a time when most oil and gas producers are bracing for steep cuts to their credit lines.",
        "date": "04112016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy's borrowing limit maintained at $4 billion "
    },
    {
        "content": "April 11 Chesapeake Energy Corp said its borrowing base was reaffirmed at $4 billion  but the company had to pledge additional assets as collateral.",
        "date": "04112016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy's borrowing base maintained at $4 bln "
    },
    {
        "content": "* Chesapeake Energy Corp says announced it has amended its $4.0 billion secured revolving credit facility agreement maturing in 2019 with its bank Syndicate Group",
        "date": "04112016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake amends $4 bln secured revolving credit facility agreement maturing in 2019 with Syndicate Group "
    },
    {
        "content": "* On March 28  Frederic Poses informed board he will not be standing for re-election at 2016 annual meeting of shareholders  Source text for Eikon: (http://1.usa.gov/1RuAOxm) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04012016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy says Frederic Poses will not stand for re-election "
    },
    {
        "content": "NEW YORK Chesapeake Energy Corp  an oil and gas company struggling in the commodities rout  is considering swapping out some of its existing debt for new 1.5 lien debt  according to CapitalStructure  a provider of news and analysis on the sub-investment grade space  citing sources close to the situation.",
        "date": "03172016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake Energy considering 1.5-lien debt exchange: CapitalStructure "
    },
    {
        "content": "Chesapeake Energy Corp  is considering selling some of its assets in Oklahoma's Stack shale field  Bloomberg reported.",
        "date": "03092016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake mulls sale of assets in Oklahoma shale field: Bloomberg "
    },
    {
        "content": "OKLAHOMA CITY Friends  family and employees of Aubrey McClendon paid their respects on Monday to the U.S. energy entrepreneur  a hometown hero who died last week in a car crash after his indictment on bid-rigging charges.",
        "date": "03072016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake's McClendon honored by thousands in Oklahoma ceremony "
    },
    {
        "content": "March 9 Chesapeake Energy Corp is considering selling some of its assets in Oklahoma's Stack shale field  Bloomberg reported.",
        "date": "03092016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 1-Chesapeake mulls sale of assets in Oklahoma shale field - Bloomberg "
    },
    {
        "content": "March 9 Chesapeake Energy Corp is considering selling some of its assets in Oklahoma's Stack shale field  Bloomberg reported.",
        "date": "03092016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake mulls sale of assets in Oklahoma shale field - Bloomberg "
    },
    {
        "content": "OKLAHOMA CITY Friends  family and employees of Aubrey McClendon gathered at dawn on Saturday at Oklahoma City's riverfront to pay their respects to the U.S. energy entrepreneur who died this week in a car crash  a day after being indicted on bid-rigging charges.",
        "date": "03052016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake's McClendon honored in Oklahoma waterfront ceremony "
    },
    {
        "content": "OKLAHOMA CITY Former Chesapeake Energy Chief Executive Aubrey McClendon  a brash risk-taker who helped transform the U.S. energy industry with shale gas  died when his car slammed into an overpass on Wednesday  one day after being charged with breaking federal antitrust laws  police said. He was 56. | Video ",
        "date": "03032016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Energy pioneer McClendon dies in fiery car crash  a day after indictment "
    },
    {
        "content": "Private equity fund Energy & Minerals Group told investors on Wednesday it will stop entering new deals with Aubrey McClendon  the former chief executive officer of Chesapeake Energy Corp   a day after the U.S. government charged him with breaking antitrust laws.",
        "date": "03022016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Exclusive: Texas fund EMG halts new deals with indicted McClendon "
    },
    {
        "content": "ATLANTA/WASHINGTON Aubrey McClendon  former chief executive officer of Chesapeake Energy Corp  and a legend in the U.S. energy industry  was charged on Tuesday with conspiring to rig bids to buy oil and natural gas leases in Oklahoma  the Justice Department said.",
        "date": "03022016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Former Chesapeake CEO McClendon charged with bid-rigging of land leases "
    },
    {
        "content": "Chesapeake Energy Corp  the second largest U.S. natural gas producer  said it would make a debt payment due in March and that it planned to sell more assets  slash spending in half and renegotiate pipeline contracts as it aims to lower debt and improve liquidity amid collapsing energy prices.",
        "date": "02242016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake aims to cut debt  spending amid oil slump "
    },
    {
        "content": "* Sets 2016 capex of $1.3 bln-$1.8 bln  down 57 pct from 2015",
        "date": "02242016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 3-Chesapeake aims to cut debt  spending amid oil slump "
    },
    {
        "content": "* Chesapeake CEO says expects continued pressure on commodity prices in 2016",
        "date": "02242016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake will look for opportunities to buy back debt at a discount-CEO "
    },
    {
        "content": "Feb 24 U.S. natural gas producer Chesapeake Energy Corp forecast lower capital spending for 2016 and said it would sell more assets worth $500 million-$1 billion.",
        "date": "02242016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake sets lower capex for 2016  to sell more assets "
    },
    {
        "content": "HOUSTON  Feb 25 U.S. shale producer Chesapeake Energy Corp on Thursday said debt downgrades from ratings agencies in December have its counterparties including pipeline companies asking for collateral as the downturn in crude prices lingers.",
        "date": "02252016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake says parties seeking collateral after debt downgrade "
    },
    {
        "content": "Chesapeake Energy  the No. 2 U.S. natural gas producer  said on Monday it had no plans to file for bankruptcy  after sources told Reuters the company had asked its longtime counsel to look at restructuring options.",
        "date": "02082016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake moves to quash bankruptcy fears as shares plunge "
    },
    {
        "content": "Feb 8 Natural gas producer Chesapeake Energy  has tapped existing adviser Kirkland & Ellis to explore restructuring options  people familiar with the matter told Reuters.",
        "date": "02082016",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "CORRECTED-Chesapeake Energy taps restructuring lawyers - sources "
    },
    {
        "content": "Dec 9 The Pennsylvania Attorney General's office on Wednesday said it filed a lawsuit against Chesapeake Energy Corp and its affiliates over claims that the companies underpaid landowners who leased land for fracking.",
        "date": "12102015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Pennsylvania sues Chesapeake over fracking leases with landowners "
    },
    {
        "content": "Chesapeake Energy Corp  cut its 2015 capital budget for the second time this year to cope with low oil and gas prices and swung to a large quarterly net loss as the second largest U.S. producer of natural gas wrote down the value of assets.",
        "date": "11042015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake cuts budget again on weak oil and gas prices "
    },
    {
        "content": "* Shares down 5 percent   (Updates share price  adds details from conference call)",
        "date": "11042015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 3-Chesapeake cuts budget again on weak oil and gas prices "
    },
    {
        "content": "Nov 4 U.S. natural gas producer Chesapeake Energy Corp reported a quarterly loss  compared with a year-ago profit  as it wrote down the value of some oil and gas assets by $5.42 billion.",
        "date": "11042015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy posts Q3 loss on $5.42 bln charge "
    },
    {
        "content": "The federal government has levied a $2.1 million fine against Chesapeake Energy Corporation  saying the oil and gas company failed to update inaccurate production reports used to assess the royalties it pays for drilling on American Indian land.",
        "date": "10212015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake fined $2.1 million over inaccurate royalty reports "
    },
    {
        "content": "HOUSTON  Oct 12 Chesapeake Energy Corp  the second largest U.S. producer of natural gas  on Monday said current director and former Saks Inc Chief Executive Brad Martin has been named non-executive chairman of its board  effective immediately.",
        "date": "10122015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy board member Martin named chairman "
    },
    {
        "content": "HOUSTON Chesapeake Energy Corp said on Tuesday it has cut about 15 percent of its workforce  or 740 jobs  as depressed oil and gas prices force deeper cost cutting at the U.S. No. 2 natural gas producer.",
        "date": "09302015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake cuts 15 percent of workforce on oil slump "
    },
    {
        "content": "HOUSTON  Sept 29 Chesapeake Energy Corp  said on Tuesday it has cut about 15 percent of its workforce  or 740 jobs  as depressed oil and gas prices force deeper cost cutting at the U.S. No. 2 natural gas producer.",
        "date": "09292015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "UPDATE 1-Chesapeake cuts 15 percent of workforce on oil slump "
    },
    {
        "content": "HOUSTON Chesapeake Energy Corp said on Tuesday it has cut about 15 percent of its workforce  citing depressed oil and gas prices.",
        "date": "09292015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake cuts 15 percent of workforce on oil slump "
    },
    {
        "content": "HOUSTON  Sept 29 Chesapeake Energy Corp  said on Tuesday it has cut about 15 percent of its workforce  citing depressed oil and gas prices.",
        "date": "09292015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "REFILE-Chesapeake cuts 15 percent of workforce on oil slump "
    },
    {
        "content": "NEW YORK Billionaire investor activist Carl Icahn ramped up criticism of the U.S. Federal Reserve  warning about the unintended consequences of ultra low interest rates on the economy and financial markets. | Video ",
        "date": "09292015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Icahn urges Fed to get off zero  says 'treacherous path' undertaken "
    },
    {
        "content": "* Chesapeake CEO says the company is prepared to take capital spending lower in 2016 if necessary",
        "date": "09082015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake prepared to take capital spending lower in 2016-CEO "
    },
    {
        "content": "By Svea Herbst-Bayliss  Lawrence Delevingne and Tim McLaughlin",
        "date": "08252015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 1-Hedge funds put brave face on stocks turmoil  some see bargains "
    },
    {
        "content": "By Svea Herbst-Bayliss  Lawrence Delevingne and Tim McLaughlin",
        "date": "08252015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Hedge funds put brave face on stocks turmoil  some see bargains "
    },
    {
        "content": "By Svea Herbst-Bayliss  Lawrence Delevingne and Tim McLaughlin",
        "date": "08252015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "RPT-Hedge funds put brave face on stocks turmoil  some see bargains "
    },
    {
        "content": "Chesapeake Energy Corp  swung to a quarterly loss on Wednesday from a year ago and shares fell as much as 10 percent as worries about hefty debt and spending at the No. 2 U.S. natural gas producer linger amid low prices.",
        "date": "08052015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake Energy has quarterly loss  shares tumble "
    },
    {
        "content": "Aug 5 Chesapeake Energy Corp swung to a quarterly loss on Wednesday from a year ago and shares fell as much as 10 percent as worries about hefty debt and spending at the No. 2 U.S. natural gas producer linger amid low prices.",
        "date": "08052015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 2-Chesapeake Energy has quarterly loss  shares tumble "
    },
    {
        "content": "* Chesapeake energy exec says company curtailing 275 million cubic feet/day gas production in Utica through October",
        "date": "08052015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy CEO says does not see significant recovery in prices "
    },
    {
        "content": "Aug 5 U.S. natural gas producer Chesapeake Energy Corp reported a quarterly loss  compared with a year-earlier profit  as it took a $5 billion charge on some oil and gas assets.",
        "date": "08052015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy posts loss on $5 bln impairment charge "
    },
    {
        "content": "July 21 Chesapeake Energy Corp  the second-largest U.S. natural gas producer  said on Tuesday it will suspend dividend payments starting in the current quarter to save up to $240 million a year.",
        "date": "07212015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "UPDATE 3-Chesapeake Energy suspends dividend payments "
    },
    {
        "content": "Chesapeake Energy Corp  the second-largest U.S. natural gas producer  said on Tuesday it will suspend dividend payments starting in the current quarter to save up to $240 million a year.",
        "date": "07212015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy suspends dividend payments "
    },
    {
        "content": "July 21 Chesapeake Energy Corp  the second-largest U.S. natural gas producer  said on Tuesday it will suspend dividend payments starting in the current quarter to save up to $240 million a year.",
        "date": "07212015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "RPT-UPDATE 2-Chesapeake Energy suspends dividend payments "
    },
    {
        "content": "July 21 Chesapeake Energy Corp  the second-largest U.S. natural gas producer  said on Tuesday it will suspend dividend payments starting in the current quarter to save up to $240 million a year.",
        "date": "07212015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 2-Chesapeake Energy suspends dividend payments "
    },
    {
        "content": "July 21 Chesapeake Energy Corp said on Tuesday it would suspend dividend payments  starting in the current quarter  to save up to $240 million a year.",
        "date": "07212015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy to suspend dividend payments "
    },
    {
        "content": "NEW YORK  July 16 A federal judge on Thursday said Chesapeake Energy Corp must pay an additional $59.1 million to some investors whose bonds it redeemed early  boosting the natural gas company's total payout to $438.7 million.",
        "date": "07162015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy bond payout raised to $438.7 million "
    },
    {
        "content": "NEW YORK A U.S. federal judge on Friday ordered Chesapeake Energy Corp to pay $379.7 million to bond investors  after the natural gas company waited too long to tell them of its plan to redeem their $1.3 billion of bonds six years early.",
        "date": "07102015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake Energy ordered to pay $379.7 million in bond dispute "
    },
    {
        "content": "July 1 FourPoint Energy LLC  a private exploration and production company  said it would buy oil and gas assets from units of Chesapeake Energy Corp for $840 million to increase its footprint in the Western Anadarko basin in Oklahoma.",
        "date": "07012015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "FourPoint Energy to buy oil and gas assets from units of Chesapeake "
    },
    {
        "content": "HOUSTON  May 6 Devon Energy Corp and Chesapeake Energy Corp  said on Wednesday they see an opportunity to produce more natural gas in the Barnett Shale in Texas with a second round of fracking on older wells.",
        "date": "05062015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Devon  Chesapeake see refracking prospects in Barnett wells in Texas "
    },
    {
        "content": "Chesapeake Energy Corp  on Wednesday raised its oil and gas production forecast for the year  even as the second largest U.S. producer of natural gas reported a quarterly loss due to lower commodity prices.",
        "date": "05062015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy posts first-quarter loss  sees more output "
    },
    {
        "content": "* Chesapeake energy cfo says company averaged 54 rigs in q1  plans to drop to 14 rigs in q3",
        "date": "05062015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake Energy sees Q3 rig count of 14 "
    },
    {
        "content": "May 6 Chesapeake Energy Corp on Wednesday raised its oil and gas production forecast for the year even as the second largest U.S. producer of natural gas reported a quarterly loss related to lower commodity prices.",
        "date": "05062015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 1-Chesapeake Energy has loss  sees more output "
    },
    {
        "content": "May 6 Chesapeake Energy Corp reported a quarterly loss compared with a year-ago profit on Wednesday  as lower commodity prices prompted the second largest U.S. producer of natural gas to write down the value of some assets.",
        "date": "05062015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy has quarterly loss as oil price hurts "
    },
    {
        "content": "Energy & Minerals Group  a major investor in new oil and gas ventures launched by former Chesapeake Energy Corp CEO Aubrey McClendon  said on Tuesday it has settled a lawsuit alleging the oil executive stole his former employer's trade secrets.",
        "date": "04142015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "AEP investor settles Chesapeake lawsuit targeting ex: CEO "
    },
    {
        "content": "March 23 Activist investor Carl Icahn raised his stake in Chesapeake Energy Corp to almost 11 percent even as the company continues to cope with low oil and gas prices.",
        "date": "03232015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Icahn raises stake in Chesapeake Energy to 11 pct "
    },
    {
        "content": "HOUSTON/WILLISTON  N.D. With the prospect of another plunge in crude prices  looming after two months of stability  U.S. shale oil producers may face another round of spending cuts to conserve cash and survive the downturn.",
        "date": "03182015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "U.S. shale oil firms brace for more pain as crude resumes slide "
    },
    {
        "content": "HOUSTON  Feb 27 Chesapeake Energy Corp  on Friday said in a regulatory filing it expects to write-down the value of its oil and gas properties in the first quarter  citing low oil and gas prices.",
        "date": "02272015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake Energy sees asset writedowns in Q1-filing "
    },
    {
        "content": "Chesapeake Energy Corp  on Wednesday said it would slash its 2015 spending and rig count in response to low crude oil prices that also pushed its fourth-quarter profit below Wall Street expectations.",
        "date": "02252015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake profit falls short; company to slash spending "
    },
    {
        "content": "Feb 25 Chesapeake Energy Corp on Wednesday said it would slash its 2015 spending and rig count in response to low crude oil prices that also pushed its fourth-quarter profit below Wall Street expectations.",
        "date": "02252015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 2-Chesapeake profit falls short; company to slash spending "
    },
    {
        "content": "* CFO says expects service cost savings of about 10 percent in 2015",
        "date": "02252015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "BRIEF-Chesapeake expects service cost savings of 10 pct in 2015 "
    },
    {
        "content": "Feb 25 Chesapeake Energy Corp on Wednesday said it would slash its 2015 spending in response to low crude oil prices and reported a fourth-quarter profit compared with a year-earlier loss as results were boosted by hedging gains.",
        "date": "02252015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake Energy has quarterly profit  slashing spending "
    },
    {
        "content": "OKLAHOMA CITY Chesapeake Energy Corp filed suit Tuesday alleging its founder and former chief executive  Aubrey K. McClendon  stole confidential company data during his last months on the job in order to launch his new oil and gas empire.",
        "date": "02172015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "topStory",
        "symbol": "CHK",
        "title": "Chesapeake alleges founder McClendon stole \"trade secrets\" to start new firm "
    },
    {
        "content": "OKLAHOMA CITY Chesapeake Energy Corp filed suit Tuesday alleging its founder and former chief executive  Aubrey K. McClendon  stole confidential company data during his last months on the job in order to launch his new oil and gas empire.",
        "date": "02172015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "Chesapeake alleges founder McClendon stole 'trade secrets' to start new firm "
    },
    {
        "content": "OKLAHOMA CITY  Feb 17 Chesapeake Energy Corp filed suit Tuesday alleging its founder and former chief executive  Aubrey K. McClendon  stole confidential company data during his last months on the job in order to launch his new oil and gas empire.",
        "date": "02172015",
        "name": "Chesapeake Energy Corporation",
        "news_type": "normal",
        "symbol": "CHK",
        "title": "UPDATE 2-Chesapeake alleges founder McClendon stole \"trade secrets\" to start new firm "
    }
]