[
    {
        "content": "TEL AVIV/BERLIN  Oct 30 Germany's Continental AG is in advanced talks to buy Israel's Argus Cyber Security  whose technology guards connected cars from hacking  for about $400 million  Israeli media reported on Monday.",
        "date": "10302017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "UPDATE 1-Continental in talks to buy Israeli autos cyber firm Argus -reports "
    },
    {
        "content": "* Check Point Software Technologies reports 2017 third quarter financial results",
        "date": "10312017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "BRIEF-Check point software technologies reports 2017 third quarter financial results "
    },
    {
        "content": "Network and cloud security provider Check Point Software Technologies Ltd  reported a 13.6 percent rise in quarterly profit on growth in demand for mobile security products.",
        "date": "10312017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "Check Point Software profit jumps about 14 percent "
    },
    {
        "content": "Oct 31 Network and cloud security provider Check Point Software Technologies Ltd reported a 13.6 percent rise in quarterly profit on growth in demand for mobile security products.",
        "date": "10312017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "Check Point Software profit jumps about 14 pct "
    },
    {
        "content": "* Check Point Software Technologies announces extension to the share repurchase program",
        "date": "08112017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "BRIEF-Check Point Software Technologies announces extension to the share repurchase program "
    },
    {
        "content": "TEL AVIV Network security provider Check Point Software Technologies  reported a better than expected increase in second-quarter net profit on growing demand for software subscriptions to stop fast-evolving new threats.",
        "date": "07202017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "Check Point second-quarter beats estimates  third-quarter outlook hit by holiday "
    },
    {
        "content": "TEL AVIV  July 20 Network security provider Check Point Software Technologies reported a better than expected increase in second-quarter net profit on growing demand for software subscriptions to stop fast-evolving new threats.",
        "date": "07202017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "UPDATE 1-Check Point Q2 beats estimates  Q3 outlook hit by holiday "
    },
    {
        "content": "* Israel's Check Point Software sees Q3 revenue $430-$465 million  non-GAAP EPS $1.18-$1.28",
        "date": "07202017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "BRIEF-Check Point Software Q3 outlook "
    },
    {
        "content": "* Check Point Software Technologies reports second quarter 2017 financial results",
        "date": "07202017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "BRIEF-Check Point Software Technologies report Q2 gaap earnings per share $1.12 "
    },
    {
        "content": "TEL AVIV  July 20 Network security provider Check Point Software Technologies reported quarterly net profit that beat expectations on growth in demand for mobile security and threat prevention products.",
        "date": "07202017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "Israel's Check Point Q2 profit  revenue up "
    },
    {
        "content": "* Check point software technologies ltd says  shareholders approve all 2017 annual general meeting proposals Source text for Eikon: Further company coverage:",
        "date": "06072017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "BRIEF-Check Point Software says shareholders approve all 2017 annual general meeting proposals "
    },
    {
        "content": "June 6 GERMAN STARTUPS GROUP BERLIN GMBH & CO KGAA:",
        "date": "06062017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "BRIEF-German Startups Group buys software technology for livestream auctions from the insolvency estate of Auctionata AG "
    },
    {
        "content": "A new variant of the WannaCry \"ransomware\" attack surfaced on Monday  according to cyber security firm Check Point Software Technologies Ltd   which it said it had stopped from damaging computers by activating a \"kill switch\" in the software.",
        "date": "05152017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "New 'WannaCry' variant surfaces  stopped from harming computers: Check Point "
    },
    {
        "content": "May 15 A new variant of the WannaCry \"ransomware\" attack surfaced on Monday  according to cyber security firm Check Point Software Technologies Ltd  which it said it had stopped from damaging computers by activating a \"kill switch\" in the software.",
        "date": "05152017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "New 'WannaCry' variant surfaces  stopped from harming computers -Check Point "
    },
    {
        "content": "TEL AVIV  April 27 Network security provider Check Point Software Technologies posted a better than expected rise in first quarter net profit and revenue on growth in demand for mobile and cloud security and products to stop fast-evolving new threats.",
        "date": "04272017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "UPDATE 1-Israel's Check Point Q1 profit  revenue top estimates "
    },
    {
        "content": "* Sees Q2 revenue $440 million-$465 million  non-GAAP EPS $1.17-$1.25",
        "date": "04272017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "BRIEF-Check Point Software Q2 financial outlook "
    },
    {
        "content": "TEL AVIV  April 27 Network security provider Check Point Software Technologies reported quarterly net profit that slightly beat expectations on strong growth in demand for mobile security and threat prevention products.",
        "date": "04272017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "Israel's Check Point Q1 profit  revenue top estimates "
    },
    {
        "content": "* Gil Shwed  CEO of Check Point Software  reports 17.8 percent passive stake in Check Point Software Technologies as of DEC 31  2016 - SEC filing  Source text : (http://bit.ly/2lrOMEC) Further company coverage:",
        "date": "02082017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "BRIEF-CEO Gil Shwed reports 17.8 pct passive stake in Check Point Software Technologies - SEC filing "
    },
    {
        "content": "TEL AVIV Network security firm Check Point Software Technologies forecast better-than-expected profit and revenue in 2017 after posting quarterly results that beat expectations on strong growth in demand for its security products.",
        "date": "01192017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "Check Point Software sees strong 2017 after fourth-quarter tops estimates "
    },
    {
        "content": "TEL AVIV  Jan 19 Network security firm Check Point Software Technologies forecast better-than-expected profit and revenue in 2017 after posting quarterly results that beat expectations on strong growth in demand for its security products.",
        "date": "01192017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "UPDATE 1-Check Point Software sees strong 2017 after Q4 tops estimates "
    },
    {
        "content": "* Sees 2017 revenue $1.85-$1.9 billion  non-GAAP EPS $5.05-$5.25",
        "date": "01192017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "BRIEF-Israel's Check Point Software Q1  2017 outlook "
    },
    {
        "content": "* Check Point Software Technologies reports 2016 fourth quarter and full year financial results",
        "date": "01192017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "BRIEF-Check Point Software says Q4 GAAP earnings per share $1.31 "
    },
    {
        "content": "TEL AVIV  Jan 19 Network security provider Check Point Software Technologies reported quarterly net profit that beat expectations on strong growth in demand for mobile security and threat prevention products and an increase in new customer wins.",
        "date": "01192017",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "Israel's Check Point Software Q4 profit tops estimates "
    },
    {
        "content": "TEL AVIV Network security firm Check Point Software Technologies  forecast strong fourth-quarter growth after its third-quarter profit and revenue beat expectations thanks to increased demand for products that prevent cyber attacks.",
        "date": "10312016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "Check Point Software sees stronger fourth quarter "
    },
    {
        "content": "TEL AVIV  Oct 31 Network security firm Check Point Software Technologies forecast strong fourth-quarter growth after its third-quarter profit and revenue beat expectations thanks to increased demand for products that prevent cyber attacks.",
        "date": "10312016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "UPDATE 1-Check Point Software sees stronger fourth quarter "
    },
    {
        "content": "* Sees Q4 revenue $460 million-$490 million  non-GAAP EPS $1.20-$1.28",
        "date": "10312016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "BRIEF-Check Point Software Q4 outlook "
    },
    {
        "content": "* Check Point Software Technologies reports 2016 third quarter financial results",
        "date": "10312016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "BRIEF-Check Point Software Technologies Q3 gaap earnings per share $0.99 "
    },
    {
        "content": "TEL AVIV  Oct 31 Network security provider Check Point Software Technologies reported quarterly profit that beat expectations as customers increasingly focus on preventing cyber attacks.",
        "date": "10312016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "Israel's Check Point Software Q3 profit tops estimates "
    },
    {
        "content": "TEL AVIV Network security provider Check Point Software Technologies Ltd lowered its 2016 earnings outlook as customers shift  to annual subscriptions as part of a drive to sell more bundles rather than single products  deferring some revenue into next year.",
        "date": "07262016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "Check Point Software trims estimates after strong second quarter "
    },
    {
        "content": "* Sees 9 cent hit to 2016 EPS from shift to subscriptions   (Adds Q3 and updated 2016 estimates)",
        "date": "07262016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "UPDATE 2-Check Point Software trims estimates after strong second quarter "
    },
    {
        "content": "* Sees Q3 revenue $405-$435 million  non-GAAP EPS $1.03-$1.10",
        "date": "07262016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "BRIEF-Israel's Check Point Software Q3 outlook "
    },
    {
        "content": "* Check point software technologies reports 2016 second quarter financial results",
        "date": "07262016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "BRIEF-Check point software technologies Q2 GAAP EPS $0.95 "
    },
    {
        "content": "* Says it plans business alliance with Check Point Software Technologies Ltd  on new products development and sale business which to start from July 1",
        "date": "06242016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "BRIEF-Ahkun plans business alliance with Check Point Software Technologies "
    },
    {
        "content": "* Authorized to continue to repurchase up to $250 million of shares each quarter  up to an aggregate of $1.5 billion",
        "date": "05102016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "BRIEF-Check point software technologies extends share repurchase program "
    },
    {
        "content": "TEL AVIV  April 20 Network security provider Check Point Software Technologies disappointed the market on Wednesday with a second-quarter earnings forecast that fell short of expectations.",
        "date": "04202016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "UPDATE 1-Check Point Software disappoints market with cautious outlook "
    },
    {
        "content": "* Sees Q2 revenue $405-$435 million  non-GAAP EPS $1.02-$1.09",
        "date": "04202016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "BRIEF-Check Point Software Technologies Q2 outlook "
    },
    {
        "content": "TEL AVIV  April 20 Network security provider Check Point Software Technologies reported quarterly profit that beat expectations on strong demand for its advanced threat prevention products.",
        "date": "04202016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "Israel's Check Point Software Q1 profit beats forecast "
    },
    {
        "content": "* Check Point Software Technologies reports 2016 first quarter financial results",
        "date": "04202016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "BRIEF-Check Point Software Technologies Q1 GAAP EPS $0.95 "
    },
    {
        "content": "* Nasdaq-listed shares up 4.3 pct in early trade   (Adds outlook  CEO/CFO comments  share reaction)",
        "date": "01282016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "UPDATE 1-Cyber security demand boosts Israel's Check Point "
    },
    {
        "content": "* Sees 2016 revenue $1.72-$1.79 billion  non-GAAP EPS $4.45-$4.60",
        "date": "01282016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "BRIEF-Check Point Software Q1  2016 outlook "
    },
    {
        "content": "TEL AVIV  Jan 27 Network security provider Check Point Software Technologies reported quarterly profit that beat expectations on strong demand for its advanced threat prevention and mobile security technologies.",
        "date": "01282016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "Israel's Check Point Software Q4 profit beats forecast "
    },
    {
        "content": "TEL AVIV Israel cyber security firm Check Point Software Technologies  is in initial talks to buy smaller provider CyberArk Software   TheMarker financial newspaper reported on Wednesday.",
        "date": "01132016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "Check Point Software in initial talks to buy CyberArk: newspaper "
    },
    {
        "content": "TEL AVIV  Jan 13 Israel cyber security firm Check Point Software Technologies is in initial talks to buy smaller provider CyberArk Software  TheMarker financial newspaper reported on Wednesday.",
        "date": "01132016",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "Check Point Software in initial talks to buy CyberArk -newspaper "
    },
    {
        "content": "TEL AVIV Network security provider Check Point Software Technologies Ltd raised its full-year profit forecast on Monday  reflecting strong demand for its advanced threat prevention and mobile security technologies.",
        "date": "10262015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "Check Point ups forecasts after strong cyber security demand "
    },
    {
        "content": "* Q3 diluted EPS excluding one-offs $1.04 cents vs f'cast 98 cents",
        "date": "10262015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "UPDATE 1-Check Point ups forecasts after strong cyber security demand "
    },
    {
        "content": "* Gaap eps $1.11 view -Thomson Reuters I/B/E/S  Source text for Eikon:  Further company coverage: [ ]",
        "date": "10262015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "BRIEF-Check point software revenue view $1.63 billion  non-gaap eps view $4.04 -thomson reuters i/b/e/s "
    },
    {
        "content": "TEL AVIV  Oct 26 Network security provider Check Point Software Technologies reported quarterly profit that beast expectations on  strong demand for its advanced threat prevention and mobile security technologies.",
        "date": "10262015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "Israel's Check Point Software Q3 profit  sales beat estimates "
    },
    {
        "content": "TEL AVIV Network security provider Check Point Software Technologies  is benefiting from strong global demand for threat-prevention and mobile-security products  it said on Wednesday as it reported better-than-expected quarterly profit.",
        "date": "07222015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "Check Point profit jumps on strong demand for cyber security "
    },
    {
        "content": "* Q2 adjusted earnings per share 99 cents vs 95 cents forecast",
        "date": "07222015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "UPDATE 1-Check Point profit jumps on strong demand for cyber security "
    },
    {
        "content": "* Sees Q3 revenue $392-$410 million  non-GAAP EPS $0.92-$1.02",
        "date": "07222015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "BRIEF-Israel's Check Point Software Q3 outlook "
    },
    {
        "content": "TEL AVIV  July 22 Network security provider Check Point Software Technologies reported quarterly profit that beat expectations on strong demand for its mobile threat prevention technologies.",
        "date": "07222015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "Israel's Check Point Software Q2 profit  sales beat estimates "
    },
    {
        "content": "TEL AVIV Network security provider Check Point Software Technologies  plans to sharpen its focus on threat-prevention and mobile security  it said on Monday after posting better than expected first-quarter profit.",
        "date": "04202015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "Israel's Check Point Software steps up expansion plans "
    },
    {
        "content": "* Nasdaq-listed shares up 5 pct   (Adds second-quarter outlook  CEO quotes  background)",
        "date": "04202015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "UPDATE 2-Israel's Check Point Software steps up expansion plans "
    },
    {
        "content": "April 20 Check Point Software Technologies Ltd  :",
        "date": "04202015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "BRIEF-Check Point Software Q2 outlook "
    },
    {
        "content": "TEL AVIV  April 20 Network security provider Check Point Software Technologies reported quarterly profit that topped expectations on higher sales and said it would accelerate its focus on threat prevention and mobility.",
        "date": "04202015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "Israel's Check Point Software Q1 profit  sales beat estimates "
    },
    {
        "content": "TEL AVIV Internet and network security provider Check Point Software Technologies will buy Israel-based Lacoon Mobile Security for tens of millions of dollars  it said on Thursday.",
        "date": "04022015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "Check Point to buy Israel's Lacoon Mobile Security "
    },
    {
        "content": "April 2 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Thursday:",
        "date": "04022015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "TEL AVIV  April 2 Internet and network security provider Check Point Software Technologies will buy Israel-based Lacoon Mobile Security for tens of millions of dollars  it said on Thursday.",
        "date": "04022015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "UPDATE 1-Check Point to buy Israel's Lacoon Mobile Security "
    },
    {
        "content": "JERUSALEM  March 19 Internet and network security provider Check Point Software Technologies is in talks to buy cyber-security firm Lacoon Mobile Security for $80 million  Israeli newspaper Calcalist reported on its website on Thursday.",
        "date": "03192015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "Check Point in talks to buy Israeli cyber-security firm -newspaper "
    },
    {
        "content": " (This February 18th story has been refiled to clarify Shlomo Kramer did not co-found Hyperwise in the last paragraph)",
        "date": "02192015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "Check Point buys Israeli cyber security firm Hyperwise "
    },
    {
        "content": "TEL AVIV  Feb 18 Internet and network security provider Check Point Software Technologies has bought Israeli start-up Hyperwise  saying it will help it compete in the fast-growing cyber security market.",
        "date": "02192015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "CORRECTED-UPDATE 1-Check Point buys Israeli cyber security firm Hyperwise "
    },
    {
        "content": "TEL AVIV Internet and network security provider Check Point Software Technologies  has bought Israeli start-up Hyperwise  saying it will help it compete in the fast growing cyber security market.",
        "date": "02182015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "Check Point buys Israeli cyber security firm Hyperwise "
    },
    {
        "content": "TEL AVIV  Feb 18 Internet and network security provider Check Point Software Technologies has bought Israeli start-up Hyperwise  saying it will help it compete in the fast growing cyber security market.",
        "date": "02182015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "UPDATE 1-Check Point buys Israeli cyber security firm Hyperwise "
    },
    {
        "content": "* Says transaction not expected to have material effect on financial results",
        "date": "02182015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "BRIEF-Check Point Software buys Israel's Hyperwise "
    },
    {
        "content": "JERUSALEM  Feb 18 Internet and network security provider Check Point Software Technologies plans to buy Israeli cyber-security start-up Hyperwise Security for $80 million  Israeli newspaper Calcalist reported on its website on Wednesday.",
        "date": "02182015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "Check Point to buy Israeli cyber security firm for $80 mln - Calcalist newspaper "
    },
    {
        "content": "TEL AVIV Network security provider Check Point Software Technologies Ltd  forecast net profit for 2015 of less than analysts' expectations  as it increases investment in research and development and sales and marketing.",
        "date": "01292015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "topStory",
        "symbol": "CHKP",
        "title": "Check Point profit outlook below forecast as investments grow "
    },
    {
        "content": "* Sees Q1 revenue $360-$375 million  non-GAAP EPS $0.89-$0.93",
        "date": "01292015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "BRIEF-Check Point Software Q1  2015 outlook "
    },
    {
        "content": "TEL AVIV  Jan 29 Network security provider Check Point Software Technologies reported quarterly profit slightly above expectations on Thursday and said it would expand its share repurchase programme by 50 percent.",
        "date": "01292015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "UPDATE 1-Israel's Check Point Software to expand share repurchases "
    },
    {
        "content": "TEL AVIV  Jan 29 Network security provider Check Point Software Technologies reported quarterly profit that topped expectations and said it would expand its share repurchase programme by 50 percent.",
        "date": "01292015",
        "name": "Check Point Software Technologies Ltd",
        "news_type": "normal",
        "symbol": "CHKP",
        "title": "Israel's Check Point Software Q4 profit beats estimates "
    }
]