[
    {
        "content": "* Says it expects to win China Mobile's bid for about 200 million yuan  ($30.14 million)",
        "date": "11142017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Zhejiang Narada Power Source expects to win China Mobile's bid for about 200 mln yuan "
    },
    {
        "content": "HONG KONG China Mobile Ltd   the country's largest telecom service provider  reported a 4.6 percent rise in nine-month net profit on Friday on fast mobile data growth despite an industry-wide rate cut.",
        "date": "10232017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "China Mobile reports 4.6 percent rise in 9-month net profit "
    },
    {
        "content": "HONG KONG  Oct 19 China Mobile Ltd  the country's largest telecom service provider  reported a 4.6 percent rise in nine-month net profit on Friday on fast mobile data growth despite an industry-wide rate cut.",
        "date": "10232017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "CORRECTED-China Mobile reports 4.6 pct rise in 9-month net profit "
    },
    {
        "content": "* 9-mnth ‍profit attributable to equity shareholders was RMB92.1 billion  up by 4.6%​",
        "date": "10202017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-China Mobile 9-mnth ‍profit attributable up 4.6 pct​ "
    },
    {
        "content": "* Shares of firm jump as much as 5.8 pct after dividend (Recasts  adds share price)",
        "date": "08102017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "UPDATE 2-China Mobile's H1 profit climbs  shares jump after special dividend "
    },
    {
        "content": "* Co and CMCC agreed to renew network assets leasing agreement according to its terms for a term of one year commencing on 1 january 2018",
        "date": "08102017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "BRIEF-China Mobile announces renewal of network assets leasing agreement with CMCC "
    },
    {
        "content": "HONG KONG  Aug 10 China Mobile Ltd  the country's top telecommunications operator  reported on Thursday a 3.5 percent rise in first-half net profit as it added 4G subscribers.",
        "date": "08102017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "China Mobile posts 3.5 pct rise in H1 profit on 4G subscriber gains "
    },
    {
        "content": "July 30 Hengtong Optic-Electric Co Ltd   * Says it won a bid to provide cables from China Mobile  Source text in Chinese:https://goo.gl/wewy44 Further company coverage: (Beijing Headline News) ",
        "date": "07312017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Hengtong Optic-Electric wins bid to provide cables from China Mobile "
    },
    {
        "content": "HONG KONG  June 30 Chinese telecom equipment maker ZTE Corp will double its research spending on fifth-generation mobile network (5G) from this year  the company said  as China steps up the push to build the world's largest 5G network.",
        "date": "06302017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "Chinese telecom firm ZTE to double 5G research spending "
    },
    {
        "content": "* Mobi Development Co wins the bid for China Mobile's 946 000 base station antennae centralized procurement for 2017-2018 Source text for Eikon: Further company coverage:",
        "date": "06232017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Mobi Development Co wins bid for China Mobile's base station antennae centralized procurement "
    },
    {
        "content": "June 23 Guangdong Eastone Century Technology Co Ltd",
        "date": "06232017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "BRIEF-Guangdong Eastone Century Technology wins bid for China Mobile project in Guangdong province "
    },
    {
        "content": "HONG KONG Chinese tech giants Alibaba Group Holdings  and Tencent Holdings  will be among new investors pouring a total of around $10 billion into mobile carrier China Unicom  sources said  part of efforts by Beijing to rejuvenate state behemoths with private cash.",
        "date": "06232017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "Exclusive: China Unicom counts Alibaba  Tencent among investors in drive to raise $10 billion - sources "
    },
    {
        "content": "* says Nokia and China Mobile are deploying millions of home gateways to provide residential customers across 29 different provinces in China with access to fiber-based ultra-broadband applications and intelligent home services",
        "date": "06122017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Nokia signs ultra-broadband access technology deal with China Mobile "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG  May 25 (Fitch) Fitch Ratings has affirmed China Mobile Limited's (CML) Long-Term Foreign-Currency and Local-Currency Issuer Default Ratings (IDRs) at 'A+'. The Outlook is Stable. KEY RATING DRIVERS Dominant Mobile Market Position: The ratings reflect Fitch's expectations that CML would be able to maintain its dominant position in China's mobile market over the medium term due to its significant economies of scale  robust fina",
        "date": "05252017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "Fitch Affirms China Mobile at 'A+'  Stable Outlook "
    },
    {
        "content": "* ENEA AB - CHINA MOBILE  ARM  CAVIUM AND ENEA SIGN AGREEMENT FOR COOPERATION IN CHINA MOBILE OPEN NFV TESTLAB Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "05022017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Enea  China Mobile  ARM and Cavium sign deal for cooperation in China Mobile Open NFV Testlab "
    },
    {
        "content": "HONG KONG  April 20 China Mobile Ltd  the country's largest telecoms network operator  said on Thursday its first-quarter profit was up by 3.7 percent due to demand for its 4G mobile broadband  service.",
        "date": "04202017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "China Mobile reports 3.7 pct rise in Q1 profit  revenue "
    },
    {
        "content": "SINGAPORE  April 21 Top shareholders in Singapore telecoms company M1 Ltd have approached potential buyers China Mobile and global private equity firms  among others  to sell their combined majority stake in the firm  sources familiar with the matter said.",
        "date": "04242017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "RPT-China Mobile  others approached for buying into Singapore telco M1 -sources "
    },
    {
        "content": "SINGAPORE Top shareholders in Singapore telecoms company M1 Ltd  have approached potential buyers China Mobile  and global private equity firms  among others  to sell their combined majority stake in the firm  sources familiar with the matter said.",
        "date": "04212017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "China Mobile  others approached for buying into Singapore telco M1: sources "
    },
    {
        "content": "SINGAPORE  April 21 Top shareholders in Singapore telecoms company M1 Ltd have approached potential buyers China Mobile and global private equity firms  among others  to sell their combined majority stake in the firm  sources familiar with the matter said.",
        "date": "04212017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "China Mobile  others approached for buying into Singapore telco M1 -sources "
    },
    {
        "content": "HONG KONG  April 6 State-owned China Unicom Hong Kong Ltd said its top shareholder China United Network Communications Ltd was reviewing its ownership structure as Beijing puts pressure on telcos to bring in private investors and boost competition.",
        "date": "04062017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "State-owned China Unicom says parent reviewing mixed-ownership structure "
    },
    {
        "content": "* Capex in 2017 to fall to 176 bln yuan from 187.3 bln in 2016   (Adds capital spending plan  analyst's comment on dividend  appointment of new CFO)",
        "date": "03232017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "UPDATE 2-China Mobile's net profit holds up  raises dividend payout "
    },
    {
        "content": "March 23 Hong Kong's benchmark stock index struggled on Thursday as strength in Chinese real estate developers was offset by weakness in some blue chips as their earnings reports disappointed investors.",
        "date": "03232017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "Hong Kong stocks weighed by Tencent  China Mobile as profits disappoint "
    },
    {
        "content": "HONG KONG  March 23 China's largest telecommunications network operator China Mobile Ltd on Thursday reported a 0.2 percent rise in profit for last year  in line with analyst estimates  and said it had raised its dividend payout ratio to 46 percent.",
        "date": "03232017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "China Mobile says profit rose 0.2 pct last year  matching estimates "
    },
    {
        "content": "* Says its Heilongjiang-based unit won bids of China Mobile 2017-2018 transmission pipeline centralized purchasing project",
        "date": "03102017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Hengtong Optic Electric unit wins bid of China Mobile transmission pipeline project "
    },
    {
        "content": "* Company will cancel all handset domestic long-distance and roaming tariffs from 1 october 2017 onwards",
        "date": "03062017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-China Mobile to cancel all handset domestic long-distance and roaming tariffs "
    },
    {
        "content": "* Says it wins bids totalling 182 million yuan  ($26.40 million) for two China Mobile projects",
        "date": "03062017",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "BRIEF-Zhong Fu Tong wins bids totalling 182 mln yuan for China Mobile projects "
    },
    {
        "content": "* voluntary Announcement In Relation To Cooperation With China Mobile",
        "date": "11042016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Fittec International entered cooperation with China Mobile Communication Group Terminal "
    },
    {
        "content": "HONG KONG  Oct 20 China Mobile Ltd  the country's largest telecom service provider  reported a 3.1 percent rise in nine-month net profit on Thursday helped by a growing subscriber base.",
        "date": "10202016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "China Mobile reports 3.1 pct rise in 9-month net profit "
    },
    {
        "content": "* 9-Month operating revenue was rmb542.7 billion  up by 4.3% over same period last year",
        "date": "10202016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "BRIEF-China Mobile says nine month operating revenue was rmb542.7 bln  up by 4.3% "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG  October 12 (Fitch) Fitch Ratings says that the potential  mixed-ownership reform pilot for China Unicom (Hong Kong) Limited (CUHKL) is  unlikely to harm the market positions and credit profiles of China Mobile  Limited (CML  A+/Stable) and China Telecom Corporation Limited (CTCL   A+/Stable). However  the reform could delay or derail any merger between CTCL  and CUHKL  the second- and third-largest Chinese telecommunications ",
        "date": "10132016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "Fitch: Mixed-Ownership Pilot May Derail Chinese Telcos' Mega-Merger "
    },
    {
        "content": "* Reform of state owned enterprises is a priority   (Adds comments from SASAC)",
        "date": "09262016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "UPDATE 2-China launches $52.5 bln fund to restructure state enterprises "
    },
    {
        "content": "* Says awarded over 30 percent share of China Mobile's 2016-2017 new construction of optical network  Source text for Eikon:  Further company coverage:    (Helsinki Newsroom)",
        "date": "08172016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Nokia says won 30 pct of China Mobile's optical network orders 2016-2017 "
    },
    {
        "content": "* ARPU of mobile business at 62 yuan vs 60 yuan year-ago   (Adds ARPU)",
        "date": "08112016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "UPDATE 2-China Mobile H1 profit edges up 5.6 pct on 4G service boost "
    },
    {
        "content": "HONG KONG China's largest telecom service provider  China Mobile Ltd   said its first-half net profit edged up 5.6 percent  its first interim profit rise in three years  as growth from lucrative 4G services helped it fend off stiff competition.",
        "date": "08112016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "China Mobile H1 profit edges up 5.6 percent on 4G service boost "
    },
    {
        "content": "HONG KONG  Aug 11 China's largest telecom service provider  China Mobile Ltd  said its first-half net profit edged up 5.6 percent  its first interim profit rise in three years  as growth from lucrative 4G services helped it fend off stiff competition.",
        "date": "08112016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "China Mobile H1 net profit rises 5.6 pct "
    },
    {
        "content": "HONG KONG  July 12 China Mobile  the world's largest mobile operator by subscribers  is raising up to $59 million by selling its stake in domestic investment bank China International Capital Corp  IFR reported on Tuesday.",
        "date": "07122016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "China Mobile raising up to $59 million from CICC stake sale -IFR "
    },
    {
        "content": "HELSINKI Nokia has signed a 1.36 billion euro ($1.5 bln) one-year framework deal with China Mobile  the Finnish company said on Monday  easing fears that it would lose market share while it merges operations with Alcatel-Lucent.",
        "date": "06132016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "Nokia signs $1.5 billion framework deal with China Mobile "
    },
    {
        "content": "HELSINKI  June 13 Nokia has signed a 1.36 billion euro ($1.5 bln) one-year framework deal with China Mobile  the Finnish company said on Monday  easing fears that it would lose market share while it merges operations with Alcatel-Lucent.",
        "date": "06132016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "Nokia signs $1.5 bln framework deal with China Mobile "
    },
    {
        "content": "* says one-year Yuan 9.927 billion (EUR 1.36 billion) frame agreement  covering all of 2016  signed at Sino-German Economic Forum",
        "date": "06132016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "BRIEF-Nokia  China Mobile sign 1.36 billion euro frame agreement "
    },
    {
        "content": "HONG KONG China Mobile Ltd  the country's largest wireless carrier  said on Wednesday its net profit for the first three months of 2016 edged up by just 0.5 percent  as popular messaging apps continue to eat into revenues at network providers.",
        "date": "04202016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "China Mobile's first-quarter net profit rises 0.5 percent "
    },
    {
        "content": "HONG KONG  April 20 China Mobile Ltd  the country's largest wireless carrier  said on Wednesday its net profit for the first three months of 2016 edged up by just 0.5 percent  as popular messaging apps continue to eat into revenues at network providers.",
        "date": "04202016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "China Mobile's first-quarter net profit rises 0.5 pct "
    },
    {
        "content": "* says Nokia and China Mobile have conducted a trial of Centralized RAN technology within a TD-LTE network in a sports stadium to demonstrate how the combination can meet the high-speed  high-bandwidth demands generated by big sporting and entertainment events  Further company coverage:     (Helsinki Newsroom)",
        "date": "04112016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Nokia  China Mobile conduct sports stadium trial "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG/SEOUL  April 01 (Fitch) Fitch Ratings has affirmed China Mobile  Limited's (CML) Long-Term Foreign-Currency and Local-Currency Issuer Default  Ratings (IDRs) at 'A+' with Stable Outlook. KEY RATING DRIVERS Dominant Mobile Market Position: The ratings reflect Fitch's expectations that  CML would be able to maintain its dominant position in China's mobile market  over the medium term due to its significant economies of scale  ro",
        "date": "04012016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "Fitch Affirms China Mobile at 'A+' with Stable Outlook "
    },
    {
        "content": "* Says it has signed an MOU with the world's largest mobile operator  China Mobile",
        "date": "03212016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Singapore's Starhub signs MOU with China Mobile "
    },
    {
        "content": "* Total mobile subscribers 826 mln at yr-end  including 300 mln 4G",
        "date": "03172016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "UPDATE 1-China Mobile 2015 profit slips as rivals gain ground in 4G services "
    },
    {
        "content": "Further company coverage:    (Reporting by Hong Kong newsroom)",
        "date": "01272016",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Shanghai Pudong Bank in strategic agreement with China Mobile "
    },
    {
        "content": "* Says Nokia Networks and China Mobile have announced framework agreement for mobile communications equipment and services valued at more than one billion USD (930 million euros)",
        "date": "10302015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Nokia signs framework deal with China Mobile "
    },
    {
        "content": "HONG KONG  Oct 20 China Mobile Ltd  the country's largest telecom provider  said on Tuesday its net profit for the first nine months of the year rose 3.4 percent  driven by strong growth of 4G subscribers thanks to its network and aggressive pricing.",
        "date": "10202015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "China Mobile 9-month net profit rises 3.4 pct on strong 4G growth "
    },
    {
        "content": "BEIJING/HONG KONG  Oct 22 China Unicom Hong Kong Ltd's net income for the first nine months fell 23 percent as the company continued to lose lucrative high-speed data customers to rivals such as China Mobile Ltd and China Telecom Corp Ltd.",
        "date": "10222015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "China Unicom 9-month net profit falls 23 pct "
    },
    {
        "content": "* says Nokia Networks signs major TD-LTE-advanced deal with China Mobile  reinforces position as largest non-chinese vendor",
        "date": "10132015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Nokia wins order from China Mobile "
    },
    {
        "content": "* China occasionally rotates state-owned sector chiefs   (Combines three firms' appointments  context)",
        "date": "08242015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "UPDATE 1-China's state-owned telecoms firms shuffle top executives "
    },
    {
        "content": "* Says signs cooperation agreement with China Mobile's media unit Migu",
        "date": "07282015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Lead Eastern Investment signs cooperation agreement with China Mobile's unit "
    },
    {
        "content": "* Its game 'Teddy Floppy Ear: Kayaking' debuts on China Mobile platform  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "07272015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Forever Entertainment's 'Teddy Floppy Ear:Kayaking' debuts on China Mobile "
    },
    {
        "content": "* Alcatel-Lucent and China Mobile Ltd conduct 'live' field trial of a virtualized radio access network",
        "date": "07132015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Alcatel-Lucent and China Mobile announce progress towards 5G network "
    },
    {
        "content": "* Its modified games \"Sparkle 2: Evo\" and \"Teddy Floppy Ear: The Race\" debut on China Mobile platform  Source text for Eikon: and   Further company coverage:    (Gdynia Newsroom)",
        "date": "07092015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Forever Entertainment 2 games debut on China Mobile platform "
    },
    {
        "content": "BEIJING  July 8 China Mobile  the country's largest wireless carrier  is asking top executives and their families to sign letters promising to help in the fight against corruption  the company said on Wednesday  as part of the government's battle against deep-rooted graft.",
        "date": "07082015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "China Mobile says enlisting executives' families in graft fight "
    },
    {
        "content": "* Its modified game 'Violett' debuts on the China Mobile platform",
        "date": "07062015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Forever Entertainment's 'Violett' debuts on China Mobile platform "
    },
    {
        "content": "* Its modified game Frederic 2: Evil Strikes Back debuts on China Mobile platform  Source text for Eikon:",
        "date": "06252015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Forever Entertainment game debuts on China Mobile platform "
    },
    {
        "content": "* Signed comprehensive frame agreements with China Mobile  and China Unicom for transition to cloud-based networks",
        "date": "07022015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Alcatel-Lucent signs frame agreements with China Mobile and China Unicom "
    },
    {
        "content": "* Its game 'Frederic: Resurrection Of Music' debuts on China Mobile platform as of June 10  Source text for Eikon:",
        "date": "06112015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Forever Entertainment game debuts on China Mobile platform "
    },
    {
        "content": "* Its modified game  Millie  debuts on the China Mobile platform as of June 9",
        "date": "06102015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "BRIEF-Forever Entertainment game Millie debuts on China Mobile platform "
    },
    {
        "content": "BEIJING  April 20 China Mobile Ltd  the country's largest wireless carrier  said on Monday its net profit for the first three months of 2015 dropped 5.6 percent  as messaging apps ate into revenues from traditional text and phone calls.",
        "date": "04202015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "China Mobile Q1 net profit drops 5.6 pct as apps take their toll "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG/SYDNEY/SINGAPORE  April 02 (Fitch) Fitch Ratings has affirmed China  Mobile Limited's (CML) Long-Term Foreign-Currency and Local-Currency Issuer  Default Rating (IDR) at 'A+' with Stable Outlook. KEY RATING DRIVERS Dominant Mobile Market Position: The ratings reflect Fitch's expectations that  CML would be able to maintain its dominant position over the medium term due to  its significant economies of scale  robust financial p",
        "date": "04022015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "Fitch Affirms China Mobile at 'A+' with Stable Outlook "
    },
    {
        "content": "* Total subscribers at year-end over 800 mln  including 90 mln 4G   (Adds details  context)",
        "date": "03192015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHL",
        "title": "UPDATE 1-China Mobile 2014 profit down 10.2 pct  beats forecasts "
    },
    {
        "content": "BEIJING  March 19 China Mobile Ltd  said 2014 profit attributable to equity shareholders fell 10.2 percent to 109.3 billion yuan ($17.7 billion) as the country's largest mobile network poured money into its 4G business.",
        "date": "03192015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "China Mobile 2014 profit down 10.2 pct  beats forecasts "
    },
    {
        "content": "* Software  cloud technologies make networks more flexible  efficient",
        "date": "03062015",
        "name": "China Mobile (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHL",
        "title": "Computing  telecoms industries set on collision course "
    }
]