[
    {
        "content": "Six U.S. cable providers said they lost a total of 498 000 subscribers in the third quarter and more than 1.6 million subscribers this year as customers opt for online streaming packages like Netflix Inc and Hulu.",
        "date": "11162017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Factbox: U.S. TV viewers continue cutting the cord in the third quarter "
    },
    {
        "content": "Nov 15 Viacom Inc and Charter Communications Inc said on Wednesday they had agreed to a multi-year renewal of their distribution agreement.",
        "date": "11152017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Viacom  Charter to renew distribution agreement "
    },
    {
        "content": "Nov 15 Viacom Inc and Charter Communications Inc said on Wednesday that they had agreed to a multi-year renewal of their distribution agreement.",
        "date": "11152017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 1-Viacom  Charter to renew distribution agreement "
    },
    {
        "content": "* Viacom and Charter Communications announce renewal of distribution agreement",
        "date": "11152017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "BRIEF-Viacom and charter communications announce renewal of distribution agreement "
    },
    {
        "content": "* Third Point LLC dissolves Class A share stake in Charter Communications Inc - SEC filing",
        "date": "11092017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Third Point takes share stake in Macerich  dissolves share stake in Humana "
    },
    {
        "content": "Oct 26 Charter Communications Inc's revenue rose 4.2 percent for the third quarter  as it signed up more subscribers to its internet services.",
        "date": "10262017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "CORRECTED-Charter Communications' 3rd-qtr revenue rises 4.2 pct "
    },
    {
        "content": "* Q3 revenue $10.5 billion versus I/B/E/S view $10.48 billion",
        "date": "10262017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "BRIEF-Charter qtrly earnings per share $0.19‍​ "
    },
    {
        "content": "* Charter closes $1.5 billion senior unsecured notes Source text for Eikon: Further company coverage:",
        "date": "10172017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter Communications closes $1.5 bln senior unsecured notes "
    },
    {
        "content": "Viacom Inc  and Charter Communications Inc   agreed on a short-term extension of their renewal deadline  a source familiar with the matter said  as the companies aim to avoid the immediate blackout of Viacom networks. | Video ",
        "date": "10162017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Viacom  Charter agree to extend renewal deadline: source "
    },
    {
        "content": "Oct 16 Viacom Inc and Charter Communications Inc  agreed on a short-term extension of their renewal deadline  a source familiar with the matter said  as the companies aim to avoid the immediate blackout of Viacom networks.",
        "date": "10162017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Viacom  Charter agree to extend renewal deadline - source "
    },
    {
        "content": "Viacom Inc  and Charter Communications Inc  have agreed to a distribution deal that puts eight of Viacom's most popular networks in Charter's cheapest U.S. cable bundle  a source told Reuters on Wednesday.",
        "date": "10182017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Viacom  Charter deal to include eight networks in basic package: source "
    },
    {
        "content": "Oct 18 Viacom Inc and Charter Communications Inc have agreed to a distribution deal that puts eight of Viacom's most popular networks in Charter's cheapest U.S. cable bundle  a source told Reuters on Wednesday.",
        "date": "10182017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 2-Viacom  Charter deal to include eight networks in basic package -source "
    },
    {
        "content": "Oct 18 Viacom Inc and Charter Communications have agreed to a deal whereby eight of Viacom's networks  including five of its flagship networks  will be in the least expensive  package of Charter's Spectrum cable service  a source told Reuters on Wednesday.",
        "date": "10182017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Viacom  Charter agree to deal to include 8 networks in basic package- source "
    },
    {
        "content": "Oct 17 Viacom Inc and cable operator Spectrum have agreed on a multi-year programming deal that keeps Nickelodeon  Comedy Central and Viacom's 21 other networks in 16.6 million households  the companies said on Tuesday.",
        "date": "10182017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Viacom and Charter's Spectrum reach programming deal "
    },
    {
        "content": "* Says Viacom and Charter have reached network carriage agreement in principle",
        "date": "10182017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "BRIEF-Viacom says co and Charter reached network carriage agreement in principle "
    },
    {
        "content": "Oct 15 Viacom Inc and cable operator Spectrum continued talks  Sunday night as the 7 pm ET (2300 GMT) deadline on their programming agreement passed  a source familiar with the situation told Reuters.",
        "date": "10152017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Viacom  Spectrum continue talks past 7 pm deadline-source "
    },
    {
        "content": "Oct 11 Viacom Inc  the owner of MTV  Comedy Central and Nickelodeon  said on Wednesday it was unable to come to a distribution deal with Charter Communications as part of its ongoing negotiations with the cable television distributor.",
        "date": "10112017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Viacom says unable to reach distribution deal with Charter "
    },
    {
        "content": "* Charter Communications Inc - ‍its units intend to offer​ senior unsecured notes due 2023 and senior unsecured notes due 2028",
        "date": "10102017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter offers $1.5 bln senior unsecured notes "
    },
    {
        "content": "Oct 12 Viacom Inc  parent of networks including MTV and Nickelodeon  launched TV ads this week urging its viewers to call customer service at cable company Spectrum ahead of a deadline that may result in a costly blackout for 16.6 million customers.",
        "date": "10122017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Viacom launches TV ads in dispute with Charter "
    },
    {
        "content": "Viacom Inc  said on Wednesday that Charter Communications  subscribers may lose access to its channels such as MTV  Comedy Central and Nickelodeonon as the expiration looms for a distribution deal between the companies.",
        "date": "10122017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Viacom warns of disruption as negotiations with Charter stall "
    },
    {
        "content": "Oct 11 Viacom Inc said on Wednesday that Charter Communications subscribers may lose access to its channels such as MTV  Comedy Central and Nickelodeonon as the expiration looms for a distribution deal between the companies.",
        "date": "10122017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 1-Viacom warns of disruption as negotiations with Charter stall "
    },
    {
        "content": "* Charter to build new 500 000 square foot headquarters in Stamford  CT Source text for Eikon: Further company coverage:",
        "date": "10032017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter to build new 500 000 square foot headquarters in Stamford  CT "
    },
    {
        "content": "* Charter Communications Inc - ‍announced that its subsidiaries intend to offer senior secured notes due March 2028  senior secured notes due 2047​",
        "date": "09112017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter offers senior secured notes "
    },
    {
        "content": "* Third Point LLC cuts share stake in Charter Communications Inc by 37.5 percent to 500 000 Class A shares - SEC filing",
        "date": "08112017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Third Point cuts share stake in Charter Communications  Sherwin-Williams "
    },
    {
        "content": "Aug 9 Netherlands-based telecom conglomerate Altice NV and its U.S. cable unit are in the early stages of working on an offer to buy Charter Communications Inc   sources told Reuters on Wednesday  in a move that would build more scale in the United States.",
        "date": "08092017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "UPDATE 4-Altice weighing takeover offer for Charter -sources "
    },
    {
        "content": "Aug 9 French telecom giant Altice NV and its U.S. cable unit are working on an offer to buy Charter Communications Inc but are yet to submit a proposal  CNBC reported  citing people close to the situation.",
        "date": "08092017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "France's Altice weighing takeover offer for Charter -CNBC "
    },
    {
        "content": "* Altice weighing bid for Charter Communications- CNBC  citing sources Source http://cnb.cx/2vlGFyB",
        "date": "08092017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "BRIEF-Altice weighing bid for Charter Communications- CNBC  citing sources "
    },
    {
        "content": "* Interested in investing in ride-hailing apps Uber and Lyft - Son",
        "date": "08072017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 2-Japan's SoftBank turns in strong Q1  mulls Uber investment "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - A takeover of Charter Communications would be a deal too far even for Patrick Drahi. The billionaire’s Altice and its U.S. arm are working on a bid for the $180 billion cable group  according to reports. The hefty price tag and Charter shareholder John Malone’s probable unwillingness to take stock with poor voting rights may scupper that.",
        "date": "08102017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Charter bid would be a deal too far even for Drahi "
    },
    {
        "content": "* Charter communications - notes will bear interest at a rate of 5.000% per annum and will be issued at a price of 100.0% of aggregate principal amount.",
        "date": "08042017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter prices $1.5 billion senior unsecured notes "
    },
    {
        "content": "NEW YORK  Aug 4 Viacom Inc could gain a leg up in negotiations with distributors and ward off declines in U.S. ad revenue and sales by finding a merger partner  analysts said on Friday.",
        "date": "08042017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 2-Viacom's weak forecast shows need for merger -analysts "
    },
    {
        "content": "* Subsidiaries intend to offer $1.0 billion in aggregate principal amount of senior unsecured notes due 2028​",
        "date": "08032017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter Communications offers $1 bln senior unsecured notes "
    },
    {
        "content": "FRANKFURT  Aug 3 Any merger that Deutsche Telekom may enter into in the United States must deliver real value in terms of synergies  its finance chief said when asked why it was proving so difficult to strike a deal with Sprint or another party.",
        "date": "08032017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Deutsche Telekom says any U.S. merger has to create real value "
    },
    {
        "content": "Charter Communications Inc's shares surged to a record high on Monday after a source said Japan's SoftBank Group Corp was considering an acquisition offer  even as Charter shot down the possibility of it being the acquirer in any merger with SoftBank's U.S. wireless carrier  Sprint Corp.",
        "date": "08012017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Charter surges as Japan's SoftBank considers bid "
    },
    {
        "content": "NEW YORK  Aug 1 Sprint Corp shares jumped 11 percent on Tuesday after its chief executive said an announcement on merger talks should come in the \"near future\" and the company reported a quarterly profit for the first time in three years.",
        "date": "08012017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 5-Sprint hints at deal prospects  shares surge "
    },
    {
        "content": "July 31 Charter Communications Inc's shares surged to a record high on Monday after a source said Japan's SoftBank Group Corp was considering an acquisition offer  even as Charter shot down the possibility of it being the acquirer in any merger with SoftBank's U.S. wireless carrier  Sprint Corp.",
        "date": "08012017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 3-Charter surges as Japan's SoftBank considers bid "
    },
    {
        "content": "* Sprint Corp has proposed a merger with Charter Communications Inc - source",
        "date": "07292017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Sprint Corp has proposed a merger with Charter Communications - source "
    },
    {
        "content": "July 28 U.S. wireless carrier Sprint Corp has proposed a merger with cable provider Charter Communications Inc in a deal that would create a new publicly traded company  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "07282017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Sprint proposes merger with Charter Communications - WSJ "
    },
    {
        "content": "* \"Complex\" proposal calls for creation of new publicly traded entity that would combine Sprint  Charter and be controlled by Softbank Group Corp - WSJ  citing sources Source text: http://on.wsj.com/2haKUcL",
        "date": "07292017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "BRIEF-Sprint proposes merger with Charter Communications - WSJ "
    },
    {
        "content": "July 31 U.S. cable operator Charter Communications Inc's shares shot up nearly 14 percent on Monday after the company said it was not interested in buying wireless carrier Sprint Corp.",
        "date": "07312017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "CORRECTED-Charter surges after company says not interested in Sprint "
    },
    {
        "content": "* Q2 revenue $10.4 billion versus i/b/e/s view $10.39 billion",
        "date": "07272017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter qtrly earnings per share $0.52 "
    },
    {
        "content": "U.S. cable operator Charter Communications Inc said on Sunday it was not interested in acquiring U.S. wireless carrier Sprint Corp  leaving the latter's majority owner  SoftBank Group Corp  pondering how to orchestrate a merger.",
        "date": "07312017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter Communications says 'no interest' in buying Sprint "
    },
    {
        "content": "July 30 U.S. cable operator Charter Communications Inc said on Sunday it was not interested in acquiring U.S. wireless carrier Sprint Corp  leaving the latter's majority owner  SoftBank Group Corp  pondering how to orchestrate a merger.",
        "date": "07312017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 2-Charter Communications says 'no interest' in buying Sprint "
    },
    {
        "content": "* 605 establishes strategic data partnership with Charter Communications",
        "date": "07252017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-605 establishes strategic data partnership with Charter Communications "
    },
    {
        "content": "July 30 Charter Communications Inc is not interested in Sprint Corp's proposal to be acquired by Charter  a company spokesman said.",
        "date": "07312017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter Communications says \"no interest\" in buying Sprint "
    },
    {
        "content": "* CSG Systems International - on July 17  CSG entered into new consolidated CSG master subscriber management system agreement with charter - SEC filing",
        "date": "07192017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-CSG Systems entered into management system agreement with charter "
    },
    {
        "content": "NEW YORK  July 14 Sprint Corp said on Friday that it was launching new leasing options aimed at price-sensitive customers who want to upgrade their phones more often  the carrier’s latest effort to lure subscribers in an oversaturated market for wireless service.",
        "date": "07142017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Sprint launches new leasing options for cost-conscious consumers "
    },
    {
        "content": "July 6 Dish Network Corp Chief Executive Charlie Ergen and Amazon.com Inc head Jeff Bezos have discussed a partnership to enter the wireless business  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "07062017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Dish  Amazon chiefs discuss wireless partnership - WSJ "
    },
    {
        "content": "NEW YORK  June 29 Cable provider Charter Communications Inc said on Thursday that it was testing a new streaming service for consumers who want a cheaper alternative to a traditional cable television package.",
        "date": "06292017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter testing new streaming service for non-cable subscribers "
    },
    {
        "content": "NEW YORK  June 29 Cable provider Charter Communications Inc said on Thursday that it was testing a new streaming service for consumers who want a cheaper alternative to a traditional cable television package.",
        "date": "06292017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 1-Charter testing new streaming service for non-cable subscribers "
    },
    {
        "content": "U.S. wireless carrier Sprint Corp is in talks with Charter Communications Inc and Comcast Corp about a partnership to boost the two U.S. cable companies' wireless offerings  according to sources familiar with the matter. | Video ",
        "date": "06272017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Charter  Comcast explore wireless partnership with Sprint: sources "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  June 27 (Fitch) Fitch Ratings has assigned a 'BBB-' rating to Charter Communications Operating  LLC's (CCO) proposed issuance of $1.5 billion of senior secured notes. CCO is an indirect  wholly owned subsidiary of Charter Communications  Inc. (Charter). CCO's Issuer Default Rating (IDR) is currently 'BB+' with a Stable Outlook. The company is expected to use net proceeds to pay related fees and expenses and for general corpora",
        "date": "06272017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Fitch Rates Charter's Sr. Secured Notes 'BBB-'; Outlook Stable "
    },
    {
        "content": "* Charter Communications Inc - subsidiaries intend to offer senior secured notes due February 2028 and senior secured notes due 2047",
        "date": "06272017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "BRIEF-Charter offers senior secured notes "
    },
    {
        "content": "June 26 U.S. wireless carrier Sprint Corp is in talks with Charter Communications Inc and Comcast Corp about a partnership to boost the two U.S. cable companies' wireless offerings  according to sources familiar with the matter.",
        "date": "06272017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 1-Charter  Comcast explore wireless partnership with Sprint-sources "
    },
    {
        "content": "June 26 Sprint Corp is in exclusive talks with Charter Communications Inc and Comcast Corp to explore a deal that could boost the cable companies' wireless service  The Wall Street Journal reported  citing people familiar with the matter.",
        "date": "06272017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "REFILE-Sprint in exclusive talks with Charter  Comcast on wireless deal -WSJ "
    },
    {
        "content": "* Charter Communications Inc - subsidiaries intend to offer $1.5 billion in aggregate principal amount of senior unsecured notes due February 2028",
        "date": "06212017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter offers $1.5 bln senior unsecured notes "
    },
    {
        "content": "NEW YORK  June 1 T-Mobile US Inc has built a reputation as a scrappy underdog by offering cell service with no contracts and cheap prices.",
        "date": "06012017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "RPT-T-Mobile’s expanded network has rivals - and suitors - taking notice "
    },
    {
        "content": "* Agreement with Charter Communications to expand integration of Charter's television data into Comscore's TV measurement service​",
        "date": "05312017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Comscore expands partnership with Charter Communications "
    },
    {
        "content": "NEW YORK  June 1 T-Mobile US Inc has built a reputation as a scrappy underdog by offering cell service with no contracts and cheap prices.",
        "date": "06012017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "T-Mobile’s expanded network has rivals - and suitors - taking notice "
    },
    {
        "content": "* Tiger Global Management LLC takes share stake of 605 000 shares in American Tower Corp",
        "date": "05152017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Tiger Global Management LLC cuts share stake in Charter Communications  Priceline Group "
    },
    {
        "content": "May 8 Comcast Corp and Charter Communications Inc announced a wireless partnership on Monday as they prepare to enter the highly competitive and oversaturated market for mobile service in the United States.",
        "date": "05082017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Comcast  Charter announce wireless partnership "
    },
    {
        "content": "May 8 Comcast Corp and Charter Communications Inc on Monday announced a wireless partnership  as the cable providers seek to add more services in a bid to reduce customer churn.",
        "date": "05082017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 2-Comcast  Charter announce wireless partnership "
    },
    {
        "content": "* Comcast and Charter to explore operational efficiencies to speed entry into the wireless market",
        "date": "05082017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "BRIEF-Comcast and Charter to explore operational efficiencies to speed entry into the wireless market "
    },
    {
        "content": "* Q1 revenue $10.2 billion versus i/b/e/s view $10.26 billion",
        "date": "05022017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter qtrly EPS $0.57 "
    },
    {
        "content": "NEW YORK  April 26 Charter Communications Inc will develop and produce original programming with AMC Networks Inc  which is known for the show \"The Walking Dead \" to differentiate its content offerings  the cable company said on Wednesday.",
        "date": "04262017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter  AMC team up to produce original programming "
    },
    {
        "content": "* Charter Communications -partnership with AMC Networks to develop and co-produce original programming  with exclusive co-content for co' spectrum platform",
        "date": "04262017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "BRIEF-Charter Communications partners with AMC Networks to develop  co-produce original programming "
    },
    {
        "content": "NEW YORK  April 6 Comcast Corp said on Thursday it is launching a new wireless service with an unlimited data plan  making it the first major U.S. cable provider to enter into the highly competitive wireless market  as it faces pressure in its core business.",
        "date": "04062017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Comcast goes into U.S. wireless business with unlimited data plans "
    },
    {
        "content": "WASHINGTON  April 3 The U.S. Federal Communications Commission is reversing a requirement imposed under the Obama administration that Charter Communications Inc extend broadband service to 1 million households already served by a competitor  under an order to be made public on Monday.",
        "date": "04032017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "UPDATE 4-U.S. FCC limits order on Charter extending broadband service "
    },
    {
        "content": "WASHINGTON  April 3 The U.S. Federal Communications Commission voted to reverse a requirement imposed under the Obama administration that Charter Communications Inc extend broadband service to 1 million households that currently have service  a source briefed on the matter said. The decision was a win for a group representing smaller cable companies that petitioned to overturn the \"overbuild\" requirement. As a condition of approval for its acquisition of two cable companies  Charter ",
        "date": "04032017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "U.S. FCC reverses Charter Communications 'overbuild' requirement "
    },
    {
        "content": "* Charter offers $1.5 billion of senior unsecured notes and senior secured notes",
        "date": "03302017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter Communications offers $1.5 bln of senior notes "
    },
    {
        "content": "WASHINGTON  March 24 U.S. President Donald Trump on Friday touted Charter Communications Inc's decision to invest $25 billion in the United States and a plan the company announced before he was elected to hire 20 000 workers over four years.",
        "date": "03242017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "UPDATE 2-Trump touts Charter hiring that was in works for two years "
    },
    {
        "content": "March 24 Highlights of the day for U.S. President Donald Trump's administration on Friday:",
        "date": "03242017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "HIGHLIGHTS-The Trump presidency on March 24 at 5:31 p.m. EDT/2131 GMT "
    },
    {
        "content": "* Ceo thomas rutledge's 2016 total compensation was $98.5 million versus $16.4 million in 2015 - sec filing",
        "date": "03162017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter Communications CEO Thomas Rutledge's 2016 compensation $98.5 mln vs $16.4 mln in 2015 "
    },
    {
        "content": "* Charter Communications Inc - Units intend to offer $1.0 billion in aggregate principal amount of senior unsecured notes due 2027",
        "date": "03092017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter offers $1 billion senior unsecured notes "
    },
    {
        "content": "* Charter Communications Inc says during q4 of 2016  charter's residential customer relationships grew by 250 000  versus 359 000 in prior year period",
        "date": "02162017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter Communications Q4 earnings per share $1.67 "
    },
    {
        "content": "NEW YORK  Feb 1 New York filed a lawsuit on Wednesday accusing Charter Communications Inc of short-changing customers who were promised faster internet speeds than it could deliver.",
        "date": "02012017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "UPDATE 1-New York sues Charter  alleges Time Warner fraud on internet speeds "
    },
    {
        "content": "NEW YORK  Feb 1 New York Attorney General Eric Schneiderman filed a lawsuit on Wednesday that accuses Charter Communications Inc's Spectrum cable unit of short-changing customers on internet speeds.",
        "date": "02012017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "New York attorney general sues Charter over internet speeds "
    },
    {
        "content": "* New York sues Charter Communications  Spectrum Management Holding Co (formerly known as Time Warner Cable) over internet service -- court filing",
        "date": "02012017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "BRIEF-New York AG sues Charter Communications over internet speeds "
    },
    {
        "content": "* Statement from Univision Communications Inc. Regarding Charter Communications  Inc.",
        "date": "02012017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "BRIEF-Univision says co and Charter Communications could not reach an agreement "
    },
    {
        "content": "NEW YORK  Jan 27 (IFR) - Holders of Verizon Communications debt are pushing the company to amend terms on an exchange offer for nearly US$30bn of debt following reports that it could buy cable operator Charter Communications.",
        "date": "01272017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Verizon bondholders want more in debt exchange after M&A rumors "
    },
    {
        "content": "Verizon Communications Inc\tis interested in exploring a combination with U.S. cable company Charter Communication Inc as part of a long list of acquisition targets  but no proposal has been made for a tie-up between the two companies  sources told Reuters on Thursday. | Video ",
        "date": "01262017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Speculation builds on a Verizon-Charter tie-up  no offer made "
    },
    {
        "content": "Jan 27 The following bids  mergers  acquisitions and disposals were reported by 1030 GMT on Friday:",
        "date": "01272017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Jan 26 Verizon Communications Inc    is interested in exploring a combination with U.S. cable company Charter Communication Inc  as part of a long list of acquisition targets  but no proposal has been made for a tie-up between the two companies  sources told Reuters on Thursday.",
        "date": "01262017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 4-Speculation builds on a Verizon-Charter tie-up  no offer made "
    },
    {
        "content": "Jan 26 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Thursday:",
        "date": "01262017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "NEW YORK  Jan 26 Verizon Communications Inc   the No. 1 U.S. wireless carrier  has not proposed an acquisition to Charter Communications Inc  according to sources.",
        "date": "01262017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Verizon has not proposed an acquisition to Charter-sources "
    },
    {
        "content": "Jan 26 Verizon Communications Inc is exploring a combination with cable company Charter Communications Inc  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "01262017",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Verizon exploring deal with cable company Charter - WSJ "
    },
    {
        "content": "* Charter Communications Inc -Have priced $1.0 billion in amount of senior unsecured notes due 2027  notes will bear interest at a rate of 5.125 percent per annum",
        "date": "01182017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter prices $1 billion senior unsecured notes "
    },
    {
        "content": "* Charter Communications Inc - co  units  intend to offer $1.0 billion in aggregate principal amount of senior unsecured notes due 2027",
        "date": "01172017",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter offers $1 billion senior unsecured notes "
    },
    {
        "content": "* Third Point LLC dissolves share stake in Activision Blizzard Inc",
        "date": "11102016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Third Point ups stake in Alphabet & Facebook  cuts in Charter "
    },
    {
        "content": "* Q3 earnings per share view $0.63 -- Thomson Reuters I/B/E/S",
        "date": "11032016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter Communications says adds 33 000 residential voice customers in Q3 "
    },
    {
        "content": "Comcast Corp  the largest U.S. cable company  will pay a $2.3 million fine to resolve a federal investigation into allegations the company wrongfully charged cable TV customers for services and equipment they never authorized.",
        "date": "10112016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Comcast will pay $2.3 million to settle U.S. billing probe "
    },
    {
        "content": "* Charter Communications  which recently bought Time Warner Cable  says expects new pricing and packaging to be fully implemented by spring of 2017 - Goldman Sachs Conf  Further company coverage:",
        "date": "09212016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter Communications says new pricing and packaging to be fully implemented by spring of 2017 - Goldman Sachs Conf "
    },
    {
        "content": "* Charter names Adam Weinstein svp of programming acquisition  Source text for Eikon:  Further company coverage:",
        "date": "09132016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter names Adam Weinstein svp of programming acquisition "
    },
    {
        "content": "* Residential video customers decreased by 152 000 in Q2 of 2016  versus a decrease of 170 000 in year-ago period",
        "date": "08092016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter Communications qtrly earnings per share $0.99 "
    },
    {
        "content": "* Charter announces intention to delist Time Warner Cable  LLC sterling pound notes from the NYSE",
        "date": "07052016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter Communications to delist Time Warner Cable  LLC sterling pound notes from NYSE "
    },
    {
        "content": "*  Newhouse Broadcasting Corp reports 13.0 percent stake in Charter Communications Inc as of May 17 - SEC filingSource text for Eikon: Further company coverage:     (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05272016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Newhouse Broadcasting reports 13 pct stake in Charter Communications "
    },
    {
        "content": "* Tiger Global Management cuts share stake in Amazon.com Inc to 1 million shares from 3.2 million shares - SEC Filing",
        "date": "05162016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Tiger Global Management cuts share stake in Amazon  ups in Charter Communications "
    },
    {
        "content": "WASHINGTON  May 18 Charter Communications Inc  said Wednesday it has completed its acquisition of Time Warner Cable Inc and Bright House Networks LLC  creating the second-largest U.S. broadband provider and third-largest pay TV provider.",
        "date": "05182016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter Communications completes purchase of Time Warner Cable "
    },
    {
        "content": "* Charter CEO says plans to integrate OTT with traditional television so its a seamless viewing experience for the customer - CNBC  Source text for Eikon:  Further company coverage:    (Reporting by Bhanu Pratap)",
        "date": "05182016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "BRIEF-Charter CEO says plans to integrate OTT with traditional television "
    },
    {
        "content": "* Charter Communications  Time Warner Cable and Bright House Networks complete transactions",
        "date": "05182016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "BRIEF-Charter Communications  Time Warner Cable and Bright House Networks complete transactions "
    },
    {
        "content": "NEW YORK Charter Communications Inc said on Thursday its proposal to buy Time Warner Cable Inc was approved by the California Public Utilities Commission  overcoming the last hurdle to complete the deal.",
        "date": "05122016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "California approves Charter-TWC deal "
    },
    {
        "content": "NEW YORK  May 12 Charter Communications Inc  said on Thursday its proposal to buy Time Warner Cable Inc was approved by the California Public Utilities Commission  overcoming the last hurdle to complete the deal.",
        "date": "05122016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 1-California approves Charter-TWC deal "
    },
    {
        "content": "WASHINGTON The U.S. Federal Communications Commission confirmed on Friday that it had voted to approve Charter Communications Inc's acquisitions of Time Warner Cable Inc and Bright House Networks.",
        "date": "05062016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "U.S. FCC confirms approval of Charter  Time Warner Cable merger "
    },
    {
        "content": "WASHINGTON The U.S. Federal Communications Commission confirmed on Friday that it had voted to approve Charter Communications Inc's acquisitions of Time Warner Cable Inc and Bright House Networks.",
        "date": "05062016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "FCC confirms approval of Charter  Time Warner Cable merger "
    },
    {
        "content": "A majority of the five-member U.S. Federal Communications Commission has voted to approve Charter Communications Inc's acquisitions of Time Warner Cable Inc and Bright House Networks  two sources briefed on the matter said on Thursday.",
        "date": "05052016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "FCC backs Charter purchase of Time Warner Cable  Bright House - sources "
    },
    {
        "content": "WASHINGTON A majority of the five-member U.S. Federal Communications Commission has voted to approve Charter Communications Inc's  acquisitions of Time Warner Cable Inc  and Bright House Networks  two sources briefed on the matter said on Thursday.",
        "date": "05052016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "FCC backs Charter purchase of Time Warner Cable  Bright House: sources "
    },
    {
        "content": "* Q1 revenues of $2.5 billion grew 7.1 pct as compared to prior-year period",
        "date": "04282016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter Communications posts Q1 loss per share $1.68 "
    },
    {
        "content": "U.S. cable company Charter Communications Inc  which is in the process of buying Time Warner Cable Inc  reported lower-than-expected quarterly revenue  hurt by weakness in its video business.",
        "date": "04282016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter Communications posts lower-than-expected first-quarter revenue "
    },
    {
        "content": "April 28 U.S. cable company Charter Communications Inc  which is in the process of buying Time Warner Cable Inc  reported lower-than-expected quarterly revenue  hurt by weakness in its video business.",
        "date": "04282016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter Communications posts lower-than-expected Q1 revenue "
    },
    {
        "content": "WASHINGTON The U.S. Justice Department on Monday gave antitrust approval to Charter Communications Inc's  proposed purchase of Time Warner Cable Inc and Bright House networks  which would create the second-largest U.S. broadband provider and third-largest video provider.",
        "date": "04252016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "U.S. approves Charter's Time Warner Cable buy with conditions "
    },
    {
        "content": "WASHINGTON  April 25 The U.S. Justice Department on Monday gave antitrust approval to Charter Communications Inc's proposed purchase of Time Warner Cable Inc  and Bright House networks  which would create the second-largest U.S. broadband provider and third-largest video provider.",
        "date": "04252016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 3-U.S. approves Charter's Time Warner Cable buy with conditions "
    },
    {
        "content": "WASHINGTON  April 25 The U.S. Justice Department approved Charter Communications Inc's proposed purchase of Time Warner Cable Inc and Bright House networks on Monday.",
        "date": "04252016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Justice Dept approves Charter's acquisition of Time Warner Cable with conditions "
    },
    {
        "content": "* Notes will bear interest rate of 5.500% per annum and will be issued at price of 100.375% of aggregate principal amount  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom)",
        "date": "04152016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter prices $300 million senior unsecured notes "
    },
    {
        "content": "WASHINGTON A California administrative law judge recommended approving Charter Communications Inc's  proposed acquisition of Time Warner Cable  and Bright House Networks with some significant conditions  according to a decision made public late on Tuesday.",
        "date": "04122016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "California judge backs Charter-Time Warner Cable deal  with conditions "
    },
    {
        "content": "WASHINGTON  April 12 A California Public Utilities Commission (CPUC) administrative law judge recommended approving Charter Communications Inc proposed acquisition of Time Warner Cable and Bright House Networks with conditions  according to a decision made public late on Tuesday.",
        "date": "04122016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Calif. administrative law judge recommends approval of Charter-Time Warner tie-up "
    },
    {
        "content": "* New notes will bear interest at rate of 5.5% per annum and will be issued at price of 100.0% of aggregate principal amount  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04082016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter prices $1.2 bln senior unsecured notes "
    },
    {
        "content": "* Intend to offer $1.0 billion in aggregate principal amount of senior unsecured notes due 2026",
        "date": "04072016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "BRIEF-Charter offers $1.0 billion senior unsecured notes "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  April 01 (Fitch) Fitch Ratings has maintained the 'BB-' Issuer Default  Ratings (IDR) assigned to CCO Holdings  LLC (CCOH) and Charter Communications  Operating  LLC (CCO) on Rating Watch Positive. Fitch has also affirmed the  specific issue ratings assigned to CCO Safari II  LLC (CCO Safari II) and CCO  Safari III  LLC (CCO Safari III). A complete list of rating actions follows at  the end of this release. Approximately $35.9",
        "date": "04012016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Fitch Maintains Charter Communication's 'BB-' IDR on Watch Positive "
    },
    {
        "content": "The U.S. Federal Communications Commission is not expected to make a decision this week on Charter Communications Inc's  planned acquisition of Time Warner Cable Inc   sources briefed on the matter said on Wednesday.",
        "date": "03232016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "FCC not expected to act this week on Charter-TWC merger: sources "
    },
    {
        "content": "The U.S. Federal Communications Commission is not expected to make a decision this week on Charter Communications Inc's planned acquisition of Time Warner Cable Inc  sources briefed on the matter said on Wednesday.",
        "date": "03232016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "FCC not expected to act this week on Charter-TWC merger -sources "
    },
    {
        "content": "March 23 The U.S. Federal Communications Commission is not expected to make a decision this week on Charter Communications Inc's planned acquisition of Time Warner Cable Inc  sources briefed on the matter said on Wednesday.",
        "date": "03232016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 3-FCC not expected to act this week on Charter-TWC merger -sources "
    },
    {
        "content": "March 23 The U.S. Federal Communications Commission is not expected to act this week on Charter Communications Inc's planned acquisition of Time Warner Cable Inc  sources briefed on the matter said on Wednesday.",
        "date": "03232016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "FCC not expected to act this week on Charter-Time Warner merger -sources "
    },
    {
        "content": "WASHINGTON/NEW YORK March 18 The U.S. Federal Communications Commission said on Friday that it had received 104 applications to take part in an auction of valuable low-frequency airwaves relinquished by TV broadcasters      including many wireless companies who want to use the airwaves to build new networks or improve existing coverage.",
        "date": "03182016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 2-U.S. FCC says it receives 104 bids to participate in spectrum auction "
    },
    {
        "content": "U.S. Federal Communications Commission Chairman Tom Wheeler is likely to circulate a draft order approving Charter Communications Inc's  $56 billion deal to buy Time Warner Cable Inc   the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "03162016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "FCC likely to circulate draft order approving Charter-Time Warner Cable merger: WSJ "
    },
    {
        "content": "March 15 U.S. Federal Communications Commission Chairman Tom Wheeler is likely to circulate a draft order approving Charter Communications Inc's $56 billion deal to buy Time Warner Cable Inc  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "03162016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "FCC likely to circulate draft order approving Charter-Time Warner Cable merger - WSJ "
    },
    {
        "content": "Five Democratic U.S. senators  including presidential candidate Bernie Sanders  told the Justice Department and Federal Communications Commission on Thursday that they had \"significant concerns\" about Charter Communications Inc's  planned acquisition of Time Warner Cable Inc  and Bright House Networks.",
        "date": "02252016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Democratic senators raise concerns about Charter-Time Warner Cable tie-up "
    },
    {
        "content": "Feb 25 Five Democratic U.S. senators  including presidential candidate Bernie Sanders  told the Justice Department and Federal Communications Commission on Thursday that they had \"significant concerns\" about Charter Communications Inc's planned acquisition of Time Warner Cable Inc and Bright House Networks.",
        "date": "02252016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 1-Democratic senators raise concerns about Charter-Time Warner Cable tie-up "
    },
    {
        "content": "Feb 25 Five Democratic U.S. senators including presidential candidate Bernie Sanders told the Justice Department and Federal Communications Commission Thursday that they have \"significant concerns\" about Charter Communications  planned acquisition of Time Warner Cable and Bright House Networks.",
        "date": "02252016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Democratic senators raise serious concerns about Charter Time Warner tie-up "
    },
    {
        "content": "Feb 4 Charter Communications Inc's  quarterly net loss more than doubled due to costs related to its pending $55 billion acquisition of Time Warner Cable Inc .",
        "date": "02042016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter Communications' loss soars on higher costs "
    },
    {
        "content": "Time Warner Cable Inc  which is being bought by Charter Communications Inc  reported better-than-expected profit and revenue for the fourth quarter as it added more residential video customers.",
        "date": "01282016",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Time Warner Cable's revenue  profit beat estimates "
    },
    {
        "content": "Jan 28 Time Warner Cable Inc  which is being bought by Charter Communications Inc  reported a 4.9 percent rise in revenue as it added more residential video customers.",
        "date": "01282016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Time Warner Cable revenue rises 4.9 percent "
    },
    {
        "content": "Jan 5 The U.S. Federal Communications Commission said it is delaying its informal deadline by 15 days to review the proposed $56 billion merger of cable rivals Charter Communications Inc and Time Warner Cable Inc.",
        "date": "01052016",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "U.S. FCC delays Charter-Time Warner Cable merger review by two weeks "
    },
    {
        "content": "Dish Network Corp  said the proposed merger of Charter Communications and Time Warner Cable was not in the public interest  in a reply filed with the Federal Communications Commission.",
        "date": "11132015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Dish tells FCC: Charter-TWC merger 'not in public interest' "
    },
    {
        "content": "Nov 12 Dish Network Corp said the proposed Charter/Time Warner Cable merger was not in public interest  in a reply it filed with the Federal Communications Commission (FCC).",
        "date": "11132015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Dish tells U.S. FCC: Charter-TWC merger 'not in public interest' "
    },
    {
        "content": "Nov 12 Dish Network Corp said the proposed merger of Charter Communications and Time Warner Cable was not in the public interest  in a reply filed with the Federal Communications Commission.",
        "date": "11132015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 2-Dish tells U.S. FCC: Charter-TWC merger 'not in public interest' "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 05 (Fitch) Fitch Ratings has assigned a 'BB' rating on  Positive Watch to CCOH Safari  LLC's (CCOH Safari) multi-tranche issuance of  benchmark sized senior unsecured notes. CCO Holdings  LLC (CCOH) will assume the  notes upon the completion of Charter Communications  Inc.'s (Charter) merger  with Time Warner Cable  Inc. (TWC) and acquisition of Bright House Networks  (Bright House).  CCOH and Charter Communications O",
        "date": "11052015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Fitch Rates Charter's New Sr. Notes 'BB' on Positive Watch "
    },
    {
        "content": "Charter Communications Inc  said its acquisition of Time Warner Cable Inc   which is awaiting clearance from U.S. regulators  is now expected to close in the first quarter of 2016  and not by the end of 2015 as planned.",
        "date": "10292015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Time Warner Cable  Charter expect deal closing in first quarter 2016  not 2015 "
    },
    {
        "content": "* Time Warner Cable shares up 2 pct   (Adds analysts' comments  updates share prices)",
        "date": "10292015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 4-Time Warner Cable  Charter expect deal closing in Q1 2016  not 2015 "
    },
    {
        "content": "Dish Network Corp said on Tuesday it filed a petition asking the Federal Communications Commission (FCC) to deny the proposed merger of Charter Communications Inc and Time Warner Cable  citing substantial harm to competitors and consumers.",
        "date": "10142015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Dish Networks petitions FCC to deny Time Warner-Charter merger "
    },
    {
        "content": "Oct 13 Dish Network Corp said on Tuesday it filed a petition asking the Federal Communications Commission (FCC) to deny the proposed merger of Charter Communications Inc and Time Warner Cable  citing substantial harm to competitors and consumers.",
        "date": "10142015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 1-Dish Networks petitions FCC to deny Time Warner-Charter merger "
    },
    {
        "content": "Oct 13 Dish Network Corp said on Tuesday it filed a petition asking the Federal Communications Commission (FCC) to deny the proposed merger of Charter Communications Inc and Time Warner Cable  citing substantial harm to competitors and consumers.",
        "date": "10142015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "CORRECTED-Dish Networks petitions FCC to deny Time Warner-Charter merger "
    },
    {
        "content": "Time Warner Cable Inc's shareholders approved the company's $56 billion takeover by Charter Communications Inc  according to preliminary votes at a special shareholder meeting.",
        "date": "09212015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Time Warner Cable shareholders approve deal with Charter "
    },
    {
        "content": "Sept 21 Time Warner Cable Inc's  shareholders approved the company's $56 billion takeover by Charter Communications Inc  according to preliminary votes at a special shareholder meeting.",
        "date": "09212015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 1-Time Warner Cable shareholders approve deal with Charter "
    },
    {
        "content": "Sept 21 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "09212015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Sept 21 Time Warner Cable Inc's  shareholders approved the company's $56 billion takeover by Charter Communications Inc  according to preliminary votes at a special shareholder meeting.",
        "date": "09212015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "CORRECTED-Time Warner Cable shareholders approve deal with Charter "
    },
    {
        "content": "NEW YORK  Sept 3 Big issuers of US leveraged loans including cable company Charter Communications Inc  and chipmaker Avago Technologies will test the US leveraged loan market by launching jumbo deals after the Labor Day holiday  but could benefit from a flight to quality after global equity market turmoil.",
        "date": "09032015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "TRLPC: Stronger US credits to benefit from flight to quality "
    },
    {
        "content": "Warren Buffett's Berkshire Hathaway Inc  on Friday said it boosted its stake in cable TV operator Charter Communications Corp   and signaled it may have another large investment planned after agreeing to buy Precision Castparts Corp  in its largest-ever purchase.",
        "date": "08152015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Berkshire Hathaway hints at new purchase  ups Charter stake "
    },
    {
        "content": "Warren Buffett's Berkshire Hathaway Inc  on Friday said it boosted its stake in cable TV operator Charter Communications Corp  and signaled it may have another large investment planned after agreeing to buy Precision Castparts Corp in its largest-ever purchase.",
        "date": "08142015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Buffett's Berkshire Hathaway hints at new purchase  ups Charter stake "
    },
    {
        "content": "Aug 14 Warren Buffett's Berkshire Hathaway Inc  on Friday said it boosted its stake in cable TV operator Charter Communications Corp  and signaled it may have another large investment planned after agreeing to buy Precision Castparts Corp in its largest-ever purchase.",
        "date": "08142015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 1-Buffett's Berkshire Hathaway hints at new purchase  ups Charter stake "
    },
    {
        "content": "* Shares rise 2.6 pct   (Adds details  analyst comments; updates shares)",
        "date": "08042015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "UPDATE 2-Charter Communications revenue beats as it adds more Internet users "
    },
    {
        "content": "Aug 4 Charter Communications Inc  reported a surprise quarterly loss  hurt by weakness in its video business.",
        "date": "08042015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "REFILE-Charter Communications' loss widens "
    },
    {
        "content": "Time Warner Cable Inc  said on Thursday it was working towards closing the deal with Charter Communications  by the end of the year.",
        "date": "07302015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Time Warner Cable targets closing Charter deal by year end "
    },
    {
        "content": "* Q2 shr $1.54 vs est. $1.81   (Adds analyst comment  conference call details  shares)",
        "date": "07302015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 2-Time Warner Cable targets closing Charter deal by year end "
    },
    {
        "content": "NEW YORK  July 10 (IFR) - US cable giant Charter Communications could hit the high-yield market next week with another bond offering to help finance its US$56bn takeover of Time Warner Cable  two sources with knowledge of the situation told IFR on Friday.",
        "date": "07102015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Charter could bring high-yield bonds next week: sources "
    },
    {
        "content": "(UPDATES with launch)     By Davide Scigliuzzo     NEW YORK  July 9 (IFR) - US cable giant Charter Communications finally made its way to the high-grade bond market on Thursday  launching a US$15.5bn bond to help fund its US$56bn takeover of Time Warner Cable.     The split-rated trade had amassed more than US$40bn of orders at the time it was launched  allowing Charter to tighten pricing on all six tranches.     Goldman Sachs was global coordinator on the deal - rated Ba1/BBB-/BBB- by Moody'",
        "date": "07092015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "UPDATE 4-Charter launches US$15.5bn M&A bond for Time Warner "
    },
    {
        "content": "NEW YORK  July 8 (IFR) - Charter Communications could hit the high-grade market Thursday with a much-anticipated multi-billion dollar M&A bond for Time Warner Cable if conditions are stable  two buyside sources said.",
        "date": "07082015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Charter close to pulling trigger on M&A bond: sources "
    },
    {
        "content": "NEW YORK  July 9 (IFR) - US cable giant Charter Communications launched a US$15.5bn six-part bond issue on Thursday that will help fund its US$56bn acquisition of larger rival Time Warner Cable.",
        "date": "07092015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter Communications launches US$15.5bn six-part bond "
    },
    {
        "content": "NEW YORK  July 9 (IFR) - Order books on Charter Communications' six-part bond sale are approaching US$40bn  two sources with knowledge of the situation told IFR on Thursday.",
        "date": "07092015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter Communications order books approaching $40bn - sources "
    },
    {
        "content": "NEW YORK  July 9 (IFR) - Charter Communications announced a new six-part benchmark US dollar bond deal for pricing on Thursday that will help fund its US$56bn acquisition of Time Warner Cable.",
        "date": "07092015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter Communications announces six-part USD bond "
    },
    {
        "content": "June 26 Charter Communications Inc  formally argued for regulatory approval for its Time Warner Cable Inc and Bright House Networks deals  saying consumers would benefit as Internet services would become cheaper and faster.",
        "date": "06262015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter lists consumer benefits to win merger approval "
    },
    {
        "content": "NEW YORK/LONDON  June 29 Mergers and acquisitions (M&A) worldwide in the second quarter of 2015 almost matched the record set in the second quarter of 2007  according to preliminary Thomson Reuters data  as big companies turned to deals to boost their market share.",
        "date": "06292015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "DEALS-Second-quarter M&A close to record amid mega deals "
    },
    {
        "content": "WASHINGTON  June 5 New U.S. net neutrality regulations have not affected how Charter Communications Inc  invests in building its telecoms networks  Chief Executive Tom Rutledge told Federal Communications Commission Chairman Tom Wheeler this week.",
        "date": "06052015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter tells FCC net neutrality has not affected its investments "
    },
    {
        "content": "NEW YORK  June 4 Huge takeovers by companies including cable operator Charter Communications Inc and chipmaker Avago Technologies promise to propel merger and acquisition loan volume from strong to certifiably robust as deals were announced at a record-breaking pace in May.",
        "date": "06042015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "TRLPC: Record M&A fuels investment grade loan issuance "
    },
    {
        "content": "Time Warner Cable Inc  said Chief Financial Officer Arthur Minson would step down effective immediately  less than a week after Charter Communications Inc  agreed to buy the company for $56 billion.",
        "date": "06012015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Time Warner Cable CFO Arthur Minson leaves to join startup "
    },
    {
        "content": "June 1 Time Warner Cable Inc said Chief Financial Officer Arthur Minson would step down effective immediately  less than a week after Charter Communications Inc  agreed to buy the company for $56 billion.",
        "date": "06012015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 1-Time Warner Cable CFO Arthur Minson leaves to join startup "
    },
    {
        "content": "June 1 Time Warner Cable Inc said Chief Financial Officer Arthur Minson would step down effective immediately  less than a week after Charter Communications Inc  agreed to buy the company for $56 billion.",
        "date": "06012015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Time Warner Cable CFO Arthur Minson to leave "
    },
    {
        "content": "NEW YORK  May 27 Charter Communications Inc  executives are exploring whether to launch an online video service as part of its combination with larger rival Time Warner Cable Inc  in what would be an unprecedented move in the cable industry.",
        "date": "05282015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "RPT-Charter-Time Warner Cable deal could spawn an online video service "
    },
    {
        "content": "NEW YORK  May 27 Charter Communications Inc  executives are exploring whether to launch an online video service as part of its combination with larger rival Time Warner Cable Inc  in what would be an unprecedented move in the cable industry.",
        "date": "05272015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Charter-Time Warner Cable deal could spawn an online video service "
    },
    {
        "content": "NEW YORK  May 27 (IFR) - Charter Communications said in an SEC filing on Wednesday that secured debt to be issued to finance its planned merger with Time Warner Cable would be rated investment-grade by two out of the three main rating agencies.",
        "date": "05272015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter expects IG rating for secured debt funding TWC bid "
    },
    {
        "content": "WASHINGTON  May 26 Time Warner Cable  entering into talks to be acquired by  Charter Communications Inc just a month after regulators killed a proposed takeover by Comcast Corp's  was determined not to get burned a second time.",
        "date": "05272015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "RPT-Charter's Time Warner Cable bid faces $2 billion regulatory question "
    },
    {
        "content": "Time Warner Cable Inc is nearing an agreement to be acquired by smaller peer Charter Communications Inc for about $55 billion  combining the second and third largest U.S. cable operators  people familiar with the matter said on Monday.",
        "date": "05252015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Charter Communications nears $55 billion deal for Time Warner Cable - sources "
    },
    {
        "content": "May 25 Time Warner Cable Inc is nearing an agreement to be acquired by smaller peer Charter Communications Inc for about $55 billion  combining the second and third largest U.S. cable operators  people familiar with the matter said on Monday.",
        "date": "05252015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 4-Charter Communications nears $55 bln deal for Time Warner Cable - sources "
    },
    {
        "content": "WASHINGTON  May 26 Time Warner Cable  entering into talks to be acquired by  Charter Communications Inc just a month after regulators killed a proposed takeover by Comcast Corp's  was determined not to get burned a second time.",
        "date": "05262015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Charter's Time Warner Cable bid faces $2 billion regulatory question "
    },
    {
        "content": "May 25 Charter Communications Inc is near an agreement to acquire Time Warner Cable Inc for $195 per share in cash and stock  a person familiar with the matter said on Monday.",
        "date": "05252015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter nears deal for Time Warner Cable at $195/shr -sources "
    },
    {
        "content": "* Time Warner Cable's shares up 7.1 pct  Charter up 2.7 pct   (Adds commentary about likelihood of regulatory approval starting in paragraph 8)",
        "date": "05262015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 7-Charter's $56 bln Time Warner Cable deal to face U.S. scrutiny "
    },
    {
        "content": "Charter Communications  is in talks with Time Warner Cable  about a bid that is likely to be well above the $170 per share expected by some analysts  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "05222015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Charter in talks with Time Warner Cable over bid likely above $170 per share: WSJ "
    },
    {
        "content": "May 21 U.S. Federal Communications Commission Chairman Tom Wheeler reached out to the chief executives of Time Warner Cable Inc and Charter Communications Inc  to convey that the agency is not against any and all cable deals  the Wall Street Journal reported.",
        "date": "05212015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "UPDATE 1-FCC chairman reached out to Time Warner Cable  Charter CEOs -WSJ "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  May 26 (Fitch) CCO Holding LLC's (CCOH) and Charter Communications  Operating  LLC's (CCO) 'BB-' Issuer Default Ratings (IDRs) remain on Rating  Watch Positive following the announcement of the merger agreement today by  Charter Communications  Inc. (Charter) and Time Warner Cable  Inc. (TWC)   according to Fitch Ratings. Fitch placed CCOH and CCO's 'BB-' IDRs on Rating Watch Positive following the  April 2015 announcement of ",
        "date": "05262015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Fitch: Charter Remains on Positive Watch on Time Warner Cable Merger "
    },
    {
        "content": "May 21 Charter Communications is in talks with Time Warner Cable about a bid that is likely to be well above the $170 per share expected by some analysts  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "05222015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 1-Charter in talks with Time Warner Cable over bid likely above $170 per shr -WSJ "
    },
    {
        "content": "May 21 Federal Communications Commission Chairman Tom Wheeler reached out to the chief executives of Time Warner Cable Inc and Charter Communications Inc  to convey that the agency is not against cable deals  the Wall Street Journal reported.",
        "date": "05212015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "FCC chairman reached out to Time Warner Cable  Charter CEOs - WSJ "
    },
    {
        "content": "May 26 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "05262015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "PARIS  May 26 Patrick Drahi  the billionaire owner of deal-hungry European telecoms group Altice  will not let missing out on Time Warner Cable dissuade him from further expansion in the United States  people familiar with the situation said.",
        "date": "05262015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Altice's ambitions for U.S. undimmed after Time Warner Cable setback "
    },
    {
        "content": "* Indexes gains for month fall below 2 pct   (Adds details  changes comment  updates prices)",
        "date": "05262015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "US STOCKS-U.S. stocks fall the most in three weeks as dollar soars "
    },
    {
        "content": "May 18 John Malone-backed Charter Communications Inc and peer Bright House Networks' parent Advance Newhouse have extended their \"good faith\" negotiating period for the planned $10.4 billion buyout of Bright House by 30 days  the companies said on Monday.",
        "date": "05192015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "REFILE-UPDATE 2-Charter  Bright House Networks extend merger talks "
    },
    {
        "content": "May 21 Charter Communications is in talks with Time Warner Cable about a bid that is likely to be well above $170 per share expected by some analysts  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "05222015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter in talks with TWC over bid likely well above $170 per shr -WSJ "
    },
    {
        "content": "A potential bid by French telecom group Altice SA to buy U.S. cable company Time Warner Cable Inc would pass regulatory hurdles more easily than an offer pondered by cable rival Charter Communications Inc   according to analysts and experts.",
        "date": "05212015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Easier regulatory review seen for Altice vs Charter in TWC deal "
    },
    {
        "content": "* Indexes down: Dow 0.6 pct  S&P 0.5 pct  Nasdaq 0.4 pct   (Updates to open)",
        "date": "05262015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "US STOCKS-Wall St opens lower as stronger dollar weighs "
    },
    {
        "content": "John Malone-backed Charter Communications Inc and peer Bright House Networks' parent Advance Newhouse have extended their \"good faith\" negotiating period for the planned $10.4 billion buyout of Bright House by 30 days  the companies said on Monday.",
        "date": "05192015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter  Bright House Networks extend merger talks "
    },
    {
        "content": "* Futures down: Dow 41 pts  S&P 7 pts  Nasdaq 14.25 pts   (Adds details  comments  updates prices)",
        "date": "05262015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "US STOCKS-Wall St set to open lower as dollar rises "
    },
    {
        "content": "May 26 Charter Communications Inc said it would buy Time Warner Cable Inc in a cash-and-stock deal that values the larger rival at $78.7 billion  to compete with No. 1 U.S. cable services provider Comcast Corp.",
        "date": "05262015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter to buy Time Warner Cable in a $78.7 bln deal "
    },
    {
        "content": "May 18 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Monday:",
        "date": "05182015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "May 18 Cable operator Charter Communications Inc's planned buyout of Bright House Networks is on track  the companies said  defying expectations that the deal would fall through after the collapse of the Comcast-Time Warner Cable merger.",
        "date": "05182015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter  Bright House Networks say merger on track "
    },
    {
        "content": "May 18 John Malone-backed Charter Communications Inc's  planned $10.4 billion buyout of peer Bright House Networks would be completed as planned  Charter and Bright House parent Advance Newhouse said on Monday.",
        "date": "05182015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 1-Charter  Bright House Networks say merger on track "
    },
    {
        "content": "Bright House Networks  the sixth largest U.S. cable operator  is preparing to abandon a $10.4 billion deal to be acquired by larger peer Charter Communications Inc   according to people familiar with the matter.",
        "date": "05072015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Exclusive: Bright House Networks plans to drop merger with Charter - sources "
    },
    {
        "content": "Top executives close to Charter Communications Inc  have reached out to management at Time Warner Cable Inc  to discuss a possible merger of the cable operators  the Wall Street Journal reported on Sunday.",
        "date": "05032015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Executives close to Charter reach out to Time Warner Cable on merger: WSJ "
    },
    {
        "content": "Cable company Charter Communications Inc  reported a bigger quarterly loss  hurt by costs from a failed deal between Comcast Corp  and Time Warner Cable Inc  that involved assets it was planning to buy.",
        "date": "05012015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Charter loss widens on costs from Comcast-Time Warner Cable deal "
    },
    {
        "content": "April 28 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "04282015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "May 3 Top executives close to Charter Communications Inc have reached out to management at Time Warner Cable Inc to discuss a possible merger of the cable operators  the Wall Street Journal reported on Sunday.",
        "date": "05032015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Execs close to Charter reach out to Time Warner Cable on merger-WSJ "
    },
    {
        "content": "May 1 Cable company Charter Communications Inc  reported a bigger quarterly loss  hurt by costs from a failed deal between Comcast Corp and Time Warner Cable Inc that involved assets it was planning to buy.",
        "date": "05012015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 2-Charter loss widens on costs from Comcast-Time Warner Cable deal "
    },
    {
        "content": "* Says it is considering video streaming services   Further company coverage:    (Reporting By Jennifer Saba)",
        "date": "05012015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "BRIEF-Charter says it is considering video streaming services "
    },
    {
        "content": "May 1 Charter Communications Inc  reported a 7.3 percent rise in first-quarter revenue  helped by strength in its internet and video businesses  but its net loss increased.",
        "date": "05012015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter Communications revenue rises 7.3 pct "
    },
    {
        "content": "Time Warner Cable Inc and Charter Communications Inc separately held acquisition talks with Bright House Networks  the Wall Street Journal reported  citing sources.",
        "date": "04302015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Time Warner Cable  Charter held deal talks with Bright House: WSJ "
    },
    {
        "content": "* Senator Franken: Collapse would be \"huge victory\" for consumers   (Recasts with new sourcing; adds quote from advocacy group  background)",
        "date": "04232015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 3-Comcast looking to drop Time Warner Cable merger -source "
    },
    {
        "content": "April 30 Time Warner Cable Inc and Charter Communications Inc separately held acquisition talks with Bright House Networks  the Wall Street Journal reported  citing sources.",
        "date": "04302015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Time Warner Cable  Charter held deal talks with Bright House - WSJ "
    },
    {
        "content": "Dow component Chevron Corp  the second-largest U.S. oil producer  is expected to report a drop in first-quarter profit as commodity prices slump.",
        "date": "04302015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "What to Watch in the Day Ahead - Friday  May 1 "
    },
    {
        "content": "Thomson Reuters April 23  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04232015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "* Indexes ends up: Dow 0.12 pct  S&P 0.23 pct  Nasdaq 0.71 pct   (Updates to close)",
        "date": "04242015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "US STOCKS-Tech triumvirate propels Nasdaq  S&P to record highs "
    },
    {
        "content": "April 24 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "04242015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Charter Communications Inc representatives have reached out to Time Warner Cable to begin discussions on a potential merger  a person familiar with the matter said on Friday.",
        "date": "04242015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter seeks talks with Time Warner Cable: source "
    },
    {
        "content": "April 24 Charter Communications Inc  representatives have reached out to Time Warner Cable to begin discussions on a potential merger  a person familiar with the matter said on Friday.",
        "date": "04242015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 2-Charter seeks talks with Time Warner Cable -source "
    },
    {
        "content": "* Amazon shares touch life high after revenue beats estimates",
        "date": "04242015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "US STOCKS-Nasdaq hits 15-year high  propelled by tech triumvirate "
    },
    {
        "content": "April 24 Charter Communications Inc's  advisers are in early talks to buy Time Warner Cable Inc   Bloomberg reported  citing people familiar with the matter. (http://bloom.bg/1DkSPm0)",
        "date": "04242015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter advisers in talks with Time Warner Cable - Bloomberg "
    },
    {
        "content": "* DOJ  FCC say merger would have given Comcast unfair advantage",
        "date": "04242015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 4-Comcast drops Time Warner Cable bid after antitrust pressure "
    },
    {
        "content": "Thomson Reuters April 24  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04242015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "NEW YORK/WASHINGTON Comcast Corp's  board was meeting late on Thursday to finalize plans to abandon its proposed $45 billion merger with  Time Warner Cable Inc   according to a person directly familiar with the matter.",
        "date": "04242015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Comcast plans to drop Time Warner Cable merger -source "
    },
    {
        "content": "* Dow down 1.1 pct  S&P 500 down 0.9 pct  Nasdaq down 0.9 pct   (Updates close with latest volume  details on healthcare sector)",
        "date": "03312015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "US STOCKS-Wall St drops but S&P  Nasdaq register quarterly gains "
    },
    {
        "content": "* Dow down 1.1 pct  S&P 500 down 0.9 pct  Nasdaq down 0.9 pct   (Updates to close)",
        "date": "03312015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "US STOCKS-Wall St retreats but S&P  Nasdaq post quarterly gains "
    },
    {
        "content": "March 31 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Tuesday:",
        "date": "03312015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "John Malone-backed Charter Communications Inc said it would buy Bright House Networks in a $10.4 billion deal as it expands its cable network after losing out to Comcast Corp in a fight for Time Warner Cable Inc. | Video ",
        "date": "03312015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter beefs up cable muscle with Bright House deal "
    },
    {
        "content": "* Charter shares touch record high   (Adds analyst quote  updates shares)",
        "date": "03312015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "UPDATE 3-Charter beefs up cable muscle with Bright House deal "
    },
    {
        "content": "* Dow  S&P 500 and Nasdaq all fall 0.4 pct   (Updates to market open  adds analyst comment)",
        "date": "03312015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "US STOCKS-Wall St dips after rally; indexes set for quarterly gain "
    },
    {
        "content": "March 31 Cable television operator Charter Communications Inc said it would buy privately held Bright House Networks in a cash-and-stock deal valued at $10.4 billion to expand in Florida.",
        "date": "03312015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "CORRECTED-UPDATE 1-Charter Communications to buy Bright House in $10.4 bln deal "
    },
    {
        "content": "* Futures down: Dow 88 pts  S&P 10.5 pts  Nasdaq 20 pts   (Updates prices)",
        "date": "03312015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "US STOCKS-Futures point to lower open but quarterly rise "
    },
    {
        "content": "March 12 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "03122015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Charter Communications is in talks to buy privately held cable company Bright House Networks LLC  according to a source familiar with the matter.",
        "date": "03122015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter Comms in talks to buy Bright House Networks: source "
    },
    {
        "content": "March 12 Charter Communications is in talks to buy privately held cable company Bright House Networks LLC  according to a source familiar with the matter.",
        "date": "03122015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "Charter Comms in talks to buy Bright House Networks -source "
    },
    {
        "content": "March 12 Charter Communications Inc   Source text for Eikon:  Further company coverage:    (Reporting By Franklin Paul)",
        "date": "03122015",
        "name": "Charter Communications Inc",
        "news_type": "normal",
        "symbol": "CHTR",
        "title": "BRIEF-Charter in talks to buy Newhouse's Bright House Networks - Bloomberg "
    },
    {
        "content": "Feb 14 Comcast Corp said on Friday that a California Public Utilities Commission Administrative (CPUC) law judge recommended  to approve its pending $45 billion merger with Time Warner Cable and related transactions with Charter Communications.",
        "date": "02142015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "California Public Utilities Commission recommends to approve Comcast merger "
    },
    {
        "content": "LONDON British startup lender Charter Savings Bank was cleared on Wednesday to start taking deposits as authorities try to encourage the formation of new banks to take on the dominant \"big four\".",
        "date": "01072015",
        "name": "Charter Communications Inc",
        "news_type": "topStory",
        "symbol": "CHTR",
        "title": "Charter Savings to become third new UK bank since rule change "
    }
]