[
    {
        "content": "HONG KONG  Oct 27 China Unicom Hong Kong Ltd said its net profit for the first nine months of the year more than doubled  helped by business reform and cost savings  but it reiterated that its earnings would come under pressure in the fourth quarter.",
        "date": "10272017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "China Unicom's 9-month profit doubles  but warns of tough Q4 "
    },
    {
        "content": "* Unicom group to transfer 1.90 billion shares in Unicom A share company to China Structural Reform Fund Corporation Ltd",
        "date": "11012017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong Ltd ‍updates on mixed ownership reform plan​ "
    },
    {
        "content": "* Controlling shareholder states application for non-public issuance of Unicom A share been approved by CSRC​ Source text for Eikon: Further company coverage:",
        "date": "10112017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong updates on mixed ownership reform plan "
    },
    {
        "content": "* For Aug  aggregate number of mobile billing subscribers 273.043 million",
        "date": "09192017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong announces operational statistics for August "
    },
    {
        "content": "* Says it wins bid for China Unicom project worth 106.6 million yuan  ($16.33 million)",
        "date": "09062017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-Nanjing Putian Telecommunications wins bid for China Unicom project worth 106.6 mln yuan "
    },
    {
        "content": "SHANGHAI  Aug 31 As Chinese policy makers extend their economic reforms  state-owned enterprises (SOEs) have taken pole position in the nation's stock market this year  gaining rapid strength at the expense of private firms.",
        "date": "08312017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "Betting on China stocks? Investors in state firms have edge "
    },
    {
        "content": "* ANNOUNCES PARTNERSHIP AGREEMENT WITH CHINA UNICOM Source text for Eikon: Further company coverage:  (Gdynia Newsroom)",
        "date": "08292017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-KPN announces partnership agreement with China Unicom "
    },
    {
        "content": "SHANGHAI  Aug 24 China stocks fell the most in nearly two weeks on Thursday  as  China Unicom tumbled after rallying earlier in the week as excitement over state enterprise reforms cooled.",
        "date": "08242017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "China stocks fall the most in 2 weeks  China Unicom tumbles "
    },
    {
        "content": "SHANGHAI  Aug 24 China share indexes barely moved on Thursday morning  as profit-taking in China Unicom Network Communications Ltd cooled excitement about state enterprise reforms  though raw material stocks rebounded  aided by a weaker dollar.",
        "date": "08242017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "China stocks flat as China Unicom slumps; Hong Kong follows Asian markets up "
    },
    {
        "content": "SHANGHAI  Aug 25 China's securities regulator said that company ownership reform plans must strictly abide by existing regulations  hinting there will be no repeat of the special treatment given to China Unicom in its $11.7 billion restructuring.",
        "date": "08252017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "China regulator hints at no more special treatment after Unicom deal "
    },
    {
        "content": "HONG KONG Telecoms group China Unicom's $11.7 billion ownership-reforms plan  billed as a model case for revitalizing Chinese state firms with private capital  remained under a cloud on Friday  with confusion about fundraising details persisting.",
        "date": "08182017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "China Unicom's $12 billion ownership-reforms plan mired in confusion "
    },
    {
        "content": "* Company and Unicom Bvi  a controlling shareholder of company  entered into share subscription agreement",
        "date": "08222017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong enters share subscription agreement with controlling shareholder Unicom Bvi "
    },
    {
        "content": "HONG KONG China Unicom's $11.7 billion ownership reform plan does not violate rules  the nation's securities regulator said  helping shares in the telecom group's units surge as they resumed trade on Monday after speculation that the deal was under scrutiny.",
        "date": "08212017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "China regulator says Unicom's reform plan does not violate rules; shares surge "
    },
    {
        "content": "* Baidu  JD.com  Tencent among investors to get board seats-sources (Adds Unicom comments  sources on CRRC investment  board seats  comment from analyst)",
        "date": "08182017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "UPDATE 5-China Unicom's $12 bln ownership-reforms plan mired in confusion "
    },
    {
        "content": "SHANGHAI  Aug 22 China stocks ended higher as a unit of China Unicom surged by the daily limit for a second day  and as financial and materials firms also experienced strong gains.",
        "date": "08222017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "China shares higher on continued Unicom surge "
    },
    {
        "content": "HONG KONG KuangChi Science Ltd said its parent has invested 4 billion yuan ($600.3 million) in a 1.88 percent stake in China United Network Communications Ltd  becoming one of its strategic investors under a mixed ownership reform plan.",
        "date": "08222017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "KuangChi says parent invests $600 million for 1.88 percent of Unicom "
    },
    {
        "content": "HONG KONG  Aug 22 KuangChi Science Ltd said its parent has invested 4 billion yuan ($600.3 million) in a 1.88 percent stake in China United Network Communications Ltd   becoming one of its strategic investors under a mixed ownership reform plan.",
        "date": "08222017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "KuangChi says parent invests $600 mln for 1.88 pct of Unicom "
    },
    {
        "content": "* Shares in Shanghai and Hong Kong units surge as trade resumes",
        "date": "08212017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "UPDATE 2-China regulator says Unicom's reform plan does not violate rules; shares surge "
    },
    {
        "content": "* Announcement in relation to mixed ownership reform and resumption of trading",
        "date": "08202017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom updates on mixed ownership reform; applies for trading resumption "
    },
    {
        "content": "HONG KONG China Unicom's two main units said on Thursday their shares would remain suspended until further notice  amid uncertainty over details of a $11.7 billion fundraising that is expected to be a model case for revamping state firms with private capital.",
        "date": "08172017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "China Unicom shares still halted amid confusion over $12 bln fundraising "
    },
    {
        "content": "* Applied to Stock Exchange Of Hong Kong Ltd for resumption of trading in shares with effect from 9:00 a.m. on 17 august 2017 Source text (http://bit.ly/2i5mfXv) Further company coverage: (bangalore.newsroom@thomsonreuters.com)",
        "date": "08162017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong applies for resumption of trading in shares with effect from 17 Aug "
    },
    {
        "content": "SHANGHAI  Aug 21 Hong Kong shares finished higher on Monday  supported by strong performance in energy and telecoms firms after China Unicom's ownership reform plan was given the green light by China's securities regulator.",
        "date": "08212017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "China Unicom  energy firms boost Hong Kong shares "
    },
    {
        "content": "HONG KONG  Aug 21 China United Network Communications Ltd  the Shanghai-listed unit of telecoms group China Unicom  said it plans to raise 61.73 billion yuan ($9.25 billion) in a private placement.",
        "date": "08212017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "CORRECTED-China Unicom Shanghai unit says to raise $11.7 bln "
    },
    {
        "content": "Aug 21 Guangdong Eastone Century Technology Co Ltd",
        "date": "08202017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "BRIEF-Guangdong Eastone Century Technology's shares to resume trade on Aug 21 "
    },
    {
        "content": "HONG KONG China Unicom's two main units said their shares would remain suspended until further notice  one day after the group announced it was raising $11.7 billion from investors including Alibaba Group and Tencent Holdings.",
        "date": "08172017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "China Unicom shares still halted  deal notice taken off Shanghai bourse website "
    },
    {
        "content": "HONG KONG  Aug 17 Shares in telecoms group China Unicom's Shanghai and Hong Kong listed units would remain suspended  even a day after the group announced raising of $11.7 billion from about a dozen investors including Alibaba Group and Tencent Holdings.",
        "date": "08172017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "China Unicom share trading to remain suspended after deal announcement "
    },
    {
        "content": "HONG KONG Telecoms group China Unicom is raising $11.7 billion from about a dozen investors including tech giants Alibaba Group  and Tencent Holdings   as part of Beijing's push for state-owned enterprises to be revitalized with private capital.",
        "date": "08162017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "State-owned China Unicom to raise $12 billion from Alibaba  Tencent  others "
    },
    {
        "content": "* Says its shares to resume trade on Aug 21 after board approves plan related to China Unicom",
        "date": "08202017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "BRIEF-Wangsu's shares to resume trade after board approves plan related to China Unicom "
    },
    {
        "content": "* Says its shares to resume trade on Aug 21 after China Unicom clarifies mixed ownership plan",
        "date": "08202017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "BRIEF-Yonyou Network's shares to resume trade after China Unicom clarifies mixed ownership plan "
    },
    {
        "content": "* Says share trade to halt from Aug 17 pending clarification related to China Unicom's mixed-ownership reform plan",
        "date": "08172017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "BRIEF-Yonyou Network Technology's share trade to halt pending announcement "
    },
    {
        "content": "* Shanghai unit to raise the funds from Alibaba  Tencent  Baidu",
        "date": "08162017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "UPDATE 4-State-owned China Unicom to raise $12 bln from Alibaba  Tencent  others "
    },
    {
        "content": "* Says mixed-ownership reform proposal approved by the national development and reform commission",
        "date": "08162017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom agrees to raise 78 bln yuan in private investment "
    },
    {
        "content": "Aug 17 Guangdong Eastone Century Technology Co Ltd",
        "date": "08172017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "BRIEF-Guangdong Eastone Century Technology's share trade to halt pending announcement "
    },
    {
        "content": "HONG KONG  Aug 16 State-owned China Unicom Hong Kong Ltd reported on Wednesday a 70 percent jump in first-half profit  as expected   thanks to lower costs and said it planned to accelerate the turnaround of its broadband business.",
        "date": "08162017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "China Unicom HK posts 70 pct jump in H1 profit on lower costs "
    },
    {
        "content": "* July aggregate number of mobile billing subscribers 270.717 million",
        "date": "08162017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong posts operational statistics for July "
    },
    {
        "content": "* Recently obtained approval from National Development And Reform Commission regarding its mixed-ownership reform pilot-run plan",
        "date": "08092017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong updates on progress of matters relating to mixed ownership reform "
    },
    {
        "content": "* Profit attributable to equity shareholders of company for 1H2017 is expected to be about RMB 2.4 billion  up by about 68.9 pct yoy",
        "date": "08112017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong expects HY profit attributable to rise by about 68.9% "
    },
    {
        "content": "* Trading in shares of China Unicom  will remain halted until further notice Source text for Eikon: Further company coverage:",
        "date": "08172017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong shares on trading halt "
    },
    {
        "content": "Aug 16 Trading in shares of China Unicom Hong Kong Ltd was suspended on Wednesday  the stock exchange said.",
        "date": "08162017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "Trading in China Unicom shares suspended - HKEx "
    },
    {
        "content": "* trading in shares of company on stock exchange of hong kong limited will be halted with effect from 9 a.m. On 16 august 2017 Source text for Eikon: Further company coverage:",
        "date": "08162017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong says trading in shares will be halted "
    },
    {
        "content": "HONG KONG Baidu Inc and JD.com will join other big Chinese technology firms to jointly invest about $12 billion in the Shanghai-listed unit of China Unicom  the weakest of three big state-owned telecoms firms  two people with direct knowledge of the matter said.",
        "date": "07212017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "Exclusive: Baidu  JD.com to join others investing $12 billion in state-owned China Unicom - sources "
    },
    {
        "content": "* Unicom Group recently obtained approval from National Development And Reform Commission regarding its mixed-ownership reform pilot-run plan",
        "date": "07242017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong clarifies on media coverage regarding its mixed ownership reform plan "
    },
    {
        "content": "BEIJING Telecommunications operator China United Network Communications  said on Sunday it is still in talks with potential strategic investors and has not yet signed any binding agreements.",
        "date": "07232017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "China Unicom says talks with strategic investors ongoing  no agreements signed "
    },
    {
        "content": "BEIJING  July 23 Telecommunications operator China United Network Communications said on Sunday it is still in talks with potential strategic investors and has not yet signed any binding agreements.",
        "date": "07232017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "UPDATE 1-China Unicom says talks with strategic investors ongoing  no agreements signed "
    },
    {
        "content": "* Net addition of mobile billing subscribers 1.091 million for June",
        "date": "07192017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom reports operational statistics for June "
    },
    {
        "content": "* Says co won two bids from China Unicom  to provide ordinary fiber optic cables and ribbon cables",
        "date": "06222017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-Hengtong Optic-electric wins China Unicom' bids to provide cables "
    },
    {
        "content": "* April net addition of mobile billing subscribers 1.039 million",
        "date": "05192017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong announces April data "
    },
    {
        "content": "SHANGHAI  April 22 Air China Ltd has received the green light from Beijing to push ahead with mixed-ownership reform of its air freight logistics business  the firm said late on Friday  signalling a potential shake-up of China's cargo carrier market.",
        "date": "04222017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "Air China says Beijing green-lights ownership reforms of cargo business "
    },
    {
        "content": "HONG KONG State-owned China Unicom Hong Kong Ltd  said on Friday first-quarter profit surged 79 percent as it focused on its 4G mobile broadband service  while its fixed-line segment maintained steady growth.",
        "date": "04212017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "China Unicom profit jumps 79 percent on 4G  fixed-line businesses "
    },
    {
        "content": "HONG KONG  April 21 State-owned China Unicom Hong Kong Ltd said on Friday first-quarter profit surged 79 percent as it focused on its 4G mobile broadband service  while its fixed-line segment maintained steady growth.",
        "date": "04212017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "China Unicom profit jumps 79 pct on 4G  fixed-line businesses "
    },
    {
        "content": "* Qtrly profit attributable to equity shareholders of company amounted to RMB 862 million  up by 79.3% year-on-year",
        "date": "04212017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong says Q1 net profit up by 79.3 pct "
    },
    {
        "content": "FRANKFURT  April 19 German automotive supplier Continental AG and a unit of China Unicom have agreed to set up a joint venture in China to offer intelligent transport systems  such as vehicle data services and connected vehicle software.",
        "date": "04192017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "Continental AG  China Unicom set up transport systems venture "
    },
    {
        "content": "HONG KONG  April 6 State-owned China Unicom Hong Kong Ltd said its top shareholder China United Network Communications Ltd was reviewing its ownership structure as Beijing puts pressure on telcos to bring in private investors and boost competition.",
        "date": "04062017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "State-owned China Unicom says parent reviewing mixed-ownership structure "
    },
    {
        "content": "* Contemplation of significant matters by ultimate parent company and resumption of trading",
        "date": "04052017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong updates on contemplation of matters relating to mixed ownership reform "
    },
    {
        "content": "* Trading in shares of co and debt securities on stock exchange of Hong Kong ltd will be halted with effect from 9 a.m. On 5 April 2017",
        "date": "04052017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong seeks trading halt "
    },
    {
        "content": "March 14 Shenzhen Topway Video Communication Co Ltd :",
        "date": "03142017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-Shenzhen Topway Video Communication signs cooperation agreement with China Unicom Shenzhen branch "
    },
    {
        "content": "* Chairman says govt's determination for reform is strong   (Adds chairman quotes from press conference)",
        "date": "03152017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "UPDATE 2-China Unicom posts lower annual profit  tough 2017 looms "
    },
    {
        "content": "HONG KONG  March 15 Chinese state-owned telecommunications network operator China Unicom Hong Kong Ltd  said on Wednesday net profit fell 94 percent last year  as expected  due to a rise in operating and marketing costs.",
        "date": "03152017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "China Unicom 2016 profit plunges 94 pct  in line with company estimate "
    },
    {
        "content": "* FY mobile billing subscriber average revenue per user (ARPU) RMB46.4",
        "date": "03152017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong posts 94 pct drop in full-year net profit "
    },
    {
        "content": "* Feb aggregate number of mobile billing subscribers 265.624 million",
        "date": "03152017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong announces Feb operational statistics "
    },
    {
        "content": "* Will substantially reduce internet private line access tariff for small and medium enterprises  reduce international long-distance call tariff",
        "date": "03062017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong updates on tariff reduction "
    },
    {
        "content": "* Jan aggregate number of mobile billing subscribers 265.088 million",
        "date": "02202017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong says Jan aggregate number of mobile billing subscribers 265.088 million "
    },
    {
        "content": "* profit attributable to the equity shareholders of the company in 2016 is expected to be down by about 94%",
        "date": "01252017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong issues profit warning "
    },
    {
        "content": "* dec aggregate number of mobile billing subscribers 263.822 million",
        "date": "01192017",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong announces Dec operational statistics "
    },
    {
        "content": "* on 25 november 2016  cucl and unicom group entered into 2016 comprehensive services agreement",
        "date": "11252016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom enters into comprehensive services agreement "
    },
    {
        "content": "* Oct aggregate number of fixed-line broadband subscribers 75.472 million",
        "date": "11182016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong announces October operational numbers "
    },
    {
        "content": "HONG KONG China Unicom Hong Kong Ltd   the country's second largest telecom operator  posted a 80.6 percent fall in net profit in the first nine months partly due to high marketing expenses as it tries to capture more subscribers.",
        "date": "10212016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "China Unicom nine-month net profit plunges 81 percent "
    },
    {
        "content": "HONG KONG  Oct 21 China Unicom Hong Kong Ltd   the country's second largest telecom operator  posted a 80.6 percent fall in net profit in the first nine months partly due to high marketing expenses as it tries to capture more subscribers.",
        "date": "10212016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "China Unicom 9-month net profit plunges 81 pct "
    },
    {
        "content": "* 9-Mnth revenue RMB207.14 billion versus RMB211.91 billion  Source text for Eikon:  Further company coverage:",
        "date": "10212016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong 9-mnth net profit drops to RMB1.59 bln "
    },
    {
        "content": "* sept aggregate number of mobile billing subscribers 262.074 million",
        "date": "10212016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom announces Sept operational statistics "
    },
    {
        "content": "HONG KONG  Oct 18 China Unicom Hong Kong Ltd  said on Tuesday it expected profit for the nine months to September to slide more than 80 percent  weighed down by higher selling and marketing expenses.",
        "date": "10182016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "China Unicom says 9-month profit to plunge 80 pct "
    },
    {
        "content": "* For september alone  net addition of 4g subscribers is expected to reach approximately 6.05 million",
        "date": "10182016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom Hong Kong 9-mnth sept ended profit is expected to be approximately RMB 1.6 bln "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG  October 12 (Fitch) Fitch Ratings says that the potential  mixed-ownership reform pilot for China Unicom (Hong Kong) Limited (CUHKL) is  unlikely to harm the market positions and credit profiles of China Mobile  Limited (CML  A+/Stable) and China Telecom Corporation Limited (CTCL   A+/Stable). However  the reform could delay or derail any merger between CTCL  and CUHKL  the second- and third-largest Chinese telecommunications ",
        "date": "10132016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "Fitch: Mixed-Ownership Pilot May Derail Chinese Telcos' Mega-Merger "
    },
    {
        "content": "HONG KONG  Oct 18 China Unicom Hong Kong Ltd  said it expected to report on Friday an 80 percent slide in its profit for the nine months through September  due partly to higher selling and marketing expenses.",
        "date": "10192016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "UPDATE 1-China Unicom says 9-month profit to plunge 80 pct "
    },
    {
        "content": "* says Nokia is expanding its partnership with China Unicom for the high-end core router CR-B for three continuous years",
        "date": "09272016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-Nokia expands router deal with China Unicom "
    },
    {
        "content": "* Says China Unicom expands partnership with Nokia for high capacity metro core routers to cover 10 provinces  Source text for Eikon:  Further company coverage:",
        "date": "09272016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom expands partnership with Nokia for high capacity metro core routers "
    },
    {
        "content": "* Says it signs framework agreement with China Unicom's Guangzhou branch to set up cloud computing base in Guangzhou",
        "date": "09192016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-Guangdong Highsun plans to set up cloud computing base with China unicom's Guangzhou branch "
    },
    {
        "content": "HONG KONG  Aug 17 China Unicom Hong Kong Ltd's  first-half net profit plunged 80 percent to a 16-year low  as China's second-largest telecom service provider racked up heavy expenses to market its fourth-generation (4G) network.",
        "date": "08172016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "UPDATE 1-China Unicom H1 profit skids to 16-year low on hefty 4G expenses "
    },
    {
        "content": "HONG KONG  Aug 17 China Unicom Hong Kong Ltd  said on Wednesday its first-half net income profit plunged 80 percent  as China's second-largest telecom service provider racked up heavy expenses to market its fourth-generation (4G) network.",
        "date": "08172016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "China Unicom H1 net profit skids 80 pct to 16-year low "
    },
    {
        "content": "* Says it signs strategic cooperation agreement with China Unicom Guangdong branch  to cooperate on hospital information system projects and other internet plus medical business",
        "date": "07292016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-Kangmei Pharmaceutical signs cooperation agreement with China Unicom "
    },
    {
        "content": "* Says controlling shareholder  China United Network Communications Group Co Ltd  plans to invest about 20 billion yuan ($2.99 billion) in a strategic agreement with the People's Government of Anhui province",
        "date": "07252016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China United Network Communications' controlling shareholder signs agreement on internet-related infrastructure in Anhui "
    },
    {
        "content": "* Says has sold 361 794 559 shares  worth approximately 322 million euros  in China Unicom   Source text for Eikon:  Further company coverage:    (Reporting by Madrid newsroom)",
        "date": "07102016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-Telefonica says has sold around 322 mln euros of shares in China Unicom "
    },
    {
        "content": "HONG KONG Spanish telecoms giant Telefonica SA  has raised about $364 million by selling some of its shares in China Unicom (Hong Kong) Ltd   China's No. 2 telecommunications service provider  sources with direct knowledge of the deal told IFR.",
        "date": "07092016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "Telefonica raises $364 million from China Unicom share sale: sources "
    },
    {
        "content": "HONG KONG  July 9 Spanish telecoms giant Telefonica SA has raised about $364 million by selling some of its shares in China Unicom (Hong Kong) Ltd  China's No. 2 telecommunications service provider  sources with direct knowledge of the deal told IFR.",
        "date": "07092016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "UPDATE 1-Telefonica raises $364 mln from China Unicom share sale -sources "
    },
    {
        "content": "HONG KONG  July 9 Spanish telecoms giant Telefonica SA has launched an up to $367 million stake sale in China Unicom (Hong Kong) Ltd  China's second-largest telecommunications service provider  according to a term sheet seen by IFR on Saturday.",
        "date": "07092016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "Telefonica launches up to $367 mln stake sale in China Unicom - term sheet "
    },
    {
        "content": "* Ericsson says it and China Unicom have signed a memorandum of understanding (mou) to collaborate on network architecture  5G  cloud and the internet of things  Link to source text: http://www.ericsson.com/news/2011372 Further company coverage:",
        "date": "05112016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-Ericsson says inks MOU with China Unicom "
    },
    {
        "content": "SINGAPORE  March 31 Global funds are cautiously venturing back into Chinese equities after prices collapsed to 4-1/2-year lows in February  taking advantage of cheaper valuations to buy stocks they believe will benefit from China's shift to a consumption-led economy.",
        "date": "03312016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "Global funds tiptoe from share slump into China's \"new economy\" firms "
    },
    {
        "content": "HONG KONG  March 16 China Unicom Hong Kong Ltd  on Wednesday said net profit fell last year for the first time since 2010  as China's second-largest telecommunications service provider played catch-up in deploying its fourth-generation (4G) network.",
        "date": "03162016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "China Unicom annual profit falls for first time since 2010 "
    },
    {
        "content": "* Says signs strategic cooperation agreement with China Unicom's cloud computing unit",
        "date": "03072016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-Global Infotech signs strategic agreement with China Unicom's cloud computing unit "
    },
    {
        "content": "* Says signs strategic cooperation agreement with China Telecom",
        "date": "01132016",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-China Unicom  China Telecom sign strategic agreement "
    },
    {
        "content": "BEIJING/HONG KONG  Oct 22 China Unicom Hong Kong Ltd's net income for the first nine months fell 23 percent as the company continued to lose lucrative high-speed data customers to rivals such as China Mobile Ltd and China Telecom Corp Ltd.",
        "date": "10222015",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "China Unicom 9-month net profit falls 23 pct "
    },
    {
        "content": "SHANGHAI  Oct 12 China shares jumped over 3 percent on Monday to their highest level in seven weeks after the central bank took fresh steps to inject liquidity into the struggling economy and said the stock market's correction \"is almost over\".",
        "date": "10122015",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "China stocks jump after PBOC says correction \"almost over\"  HK extends rebound "
    },
    {
        "content": "* Says China Unicom and Telefonica sign a global agreement to exchange data center capabilities driving enhanced value for multinational clients",
        "date": "09282015",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-Telefonica and China Unicom agree to exchange data center capabilities "
    },
    {
        "content": "* China occasionally rotates state-owned sector chiefs   (Combines three firms' appointments  context)",
        "date": "08242015",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "UPDATE 1-China's state-owned telecoms firms shuffle top executives "
    },
    {
        "content": "* Signed comprehensive frame agreements with China Mobile  and China Unicom for transition to cloud-based networks",
        "date": "07022015",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-Alcatel-Lucent signs frame agreements with China Mobile and China Unicom "
    },
    {
        "content": "* Says signs agreement with China Unicom's Beijing unit on data centre project worth 316.7-405.6 million yuan  ($51.01-65.32 million)",
        "date": "05042015",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-Beijing Sinnet Tech  China Unicom's unit sign deal on data centre project "
    },
    {
        "content": "BEIJING  April 23 China Unicom Hong Kong Ltd  said on Thursday first-quarter net income fell more than 4 percent from a year earlier as the country's recently enforced value-added tax exacerbated the telecom carrier's declining business.",
        "date": "04232015",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "UPDATE 1-China Unicom Q1 net profit falls over 4 pct "
    },
    {
        "content": "* China Unicom has selected net insight solution for sports video contribution",
        "date": "04092015",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "BRIEF-Net Insight wins order from China Unicom "
    },
    {
        "content": "BEIJING  March 20 A glitch in the broadband infrastructure of China Unicom Hong Kong Ltd caused a brief but widespread Internet outage in mainland China on Friday  the company said.",
        "date": "03202015",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "China Unicom network glitch causes 20-minute Internet outage "
    },
    {
        "content": "* 4G users pay more on average than other subscribers   (Adds subscriber numbers  context)",
        "date": "02272015",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "UPDATE 1-China issues 4G licences to China Telecom  China Unicom "
    },
    {
        "content": "BEIJING  Feb 27 China has issued licences to operate 4G wireless networks to China Telecom Corp Ltd  and China Unicom Hong Kong Ltd  two of the country's three carriers  the Ministry of Industry and Information Technology said on Friday.",
        "date": "02272015",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "China issues 4G FDD licences to China Telecom  China Unicom "
    },
    {
        "content": "BEIJING/HONG KONG  March 3 China Unicom Hong Kong Ltd  said net income fell 26 percent in its fourth quarter  as the carrier faced stiff competition for telecom subscribers from its two main rivals and lagged in providing internet-based messaging services.",
        "date": "03032015",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "UPDATE 2-China Unicom warns of fall in user growth as Q4 profit falls 26 pct "
    },
    {
        "content": "BEIJING Shares of all three Chinese telecommunications carriers rose on Thursday following speculation on social media of consolidation in the sector that would see China Telecom Corp Ltd and China Unicom merge.",
        "date": "02122015",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "Merger speculation sends Chinese telecom shares higher "
    },
    {
        "content": "BEIJING China's anti-corruption watchdog has stepped up inspections of state-run conglomerates  focusing on strategic firms  as Beijing prepares to implement its most ambitious reform of government industry in nearly two decades.",
        "date": "01182015",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "topStory",
        "symbol": "CHU",
        "title": "China's graft-busters target state-owned firms ahead of reform "
    },
    {
        "content": "BEIJING  Jan 16 China will prosecute for graft a former senior executive at its second-largest telecom carrier China Unicom  the anti-corruption agency of the ruling Communist Party said on Friday.",
        "date": "01162015",
        "name": "China Unicom (Hong Kong) Ltd",
        "news_type": "normal",
        "symbol": "CHU",
        "title": "China to prosecute former Unicom official in graft crackdown "
    }
]