[
    {
        "content": "Cigna Corp on Thursday said low member medical costs  particularly related to hospitalizations and prescription drugs  drove better-than-expected third-quarter profits and would continue in 2018.",
        "date": "11022017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Cigna tops profit estimates on low member medical costs "
    },
    {
        "content": "Nov 2 Cigna Corp on Thursday said low member medical costs  particularly related to hospitalizations and prescription drugs  drove better-than-expected third-quarter profits and would continue in 2018.",
        "date": "11022017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 3-Cigna tops profit estimates on low member medical costs "
    },
    {
        "content": "NEW YORK  Nov 2 Health insurer Cigna Corp will grow 2018 profit by 7 percent to 9 percent from 2017  in line with its long-term targets  Chief Executive David Cordani said on Thursday during a conference call with analysts.",
        "date": "11022017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna expects to grow 2018 profit by 7 to 9 percent "
    },
    {
        "content": "* Cigna reports strong third quarter 2017 results  raises outlook",
        "date": "11022017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna reports Q3 earnings of $2.21/shr "
    },
    {
        "content": "Nov 2 Health insurer Cigna Corp reported a 23 percent rise in quarterly profit  helped by higher enrollment.",
        "date": "11022017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Health insurer Cigna's quarterly profit rises 23 pct "
    },
    {
        "content": "Oct 4 Amid a growing U.S. opioid addiction  health insurer Cigna Corp will stop covering OxyContin  the opioid painkiller sold by Purdue Pharma LP  as of Jan. 1 and will instead cover an equivalent with a formulation less vulnerable to abuse  the company said on Wednesday.",
        "date": "10042017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna to end OxyContin painkiller coverage  signs contract for alternative "
    },
    {
        "content": "Sept 28 * India's Cigna TTK Health Insurance Says Gets Insurance Regulator Nod For Increasing Cigna Corp's stake in JV to 49 percent from 26 percent Source text for Eikon: [Cigna TTK Health Insurance received approval on September 26  2017 from the IRDAI for increase of Cigna’s stake from 26% to 49% in the joint venture. Cigna TTK Health Insurance is a joint venture between U.S. based global health service leader  Cigna Corporation (NYSE:CI)  and Indian conglomerate TTK Group] Furthe",
        "date": "09282017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-India's Cigna TTK Health Insurance says gets regulator nod for raising Cigna Corp stake in JV "
    },
    {
        "content": "* Rennova Health's Labs win appeal in the Eleventh Circuit Court Of Appeals in CIGNA suit",
        "date": "09252017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Rennova Health's Labs win appeal in the Eleventh Circuit Court Of Appeals in CIGNA suit "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  September 05 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to 10- and 30-year senior unsecured notes issued by Cigna Corporation (Cigna). The new notes will be used to fund a tender offer of seven series of outstanding senior notes as well as prefund debt maturing in early 2018. The ratings are equivalent to Fitch's ratings on Cigna's currently outstanding senior notes. KEY RATING DRIVERS Cigna is issuing up to $1.6 billio",
        "date": "09052017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Fitch Rates Cigna Corporations Debt Issue 'BBB+' "
    },
    {
        "content": "* Cigna announces tender offers for up to $1 billion in aggregate principal amount of certain series of its outstanding senior notes",
        "date": "09052017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna announces tender offers for up to $1 bln in aggregate principal amount of certain series of its outstanding senior notes "
    },
    {
        "content": "* Cigna Corp files preliminary prospectus supplement for potential senior notes offering; size not disclosed - SEC filing‍​ Source text: (http://bit.ly/2xMd5TK) Further company coverage:",
        "date": "09052017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna files preliminary prospectus supplement for potential senior notes offering "
    },
    {
        "content": "* Cigna Corp says to reaffirm projected FY 2017 consolidated adjusted income from operations  which remains in range of $2.50 - $2.58 billion - SEC Filing Source text: [http://bit.ly/2vktqRS] Further company coverage:",
        "date": "08282017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Cigna says to reaffirm projected FY 2017 consolidated adjusted income from operations  which remains in range of $2.50 - $2.58 bln - SEC Filing "
    },
    {
        "content": "* Cigna Corp files for potential mixed shelf  size not disclosed - sec filing‍​ Source text: (http://bit.ly/2v4TkHT) Further company coverage:",
        "date": "08042017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Cigna files for potential mixed shelf "
    },
    {
        "content": "Cigna Corp  reported a higher-than-expected second-quarter profit on Friday due to a decline in medical costs  underscoring an industrywide trend reported by rival health insurers including Aetna Inc  and Anthem Inc .",
        "date": "08042017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna says costs drop but keeps eye on Obamacare spending "
    },
    {
        "content": "Aug 4 Cigna Corp reported a higher-than-expected second-quarter profit on Friday due to a decline in medical costs  underscoring an industrywide trend reported by rival health insurers including Aetna Inc and Anthem Inc.",
        "date": "08042017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 4-Cigna says costs drop but keeps eye on Obamacare spending "
    },
    {
        "content": "Aug 4 Health insurer Cigna Corp reported a 59 percent rise in quarterly profit  helped by a rise in membership and cost control.",
        "date": "08042017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Health insurer Cigna posts 59 pct rise in quarterly profit "
    },
    {
        "content": "* Interpace diagnostics group inc - cigna agreed to cover interpace's thygenx test for cigna members nationwide  with coverage effective immediately Source text for Eikon: Further company coverage:",
        "date": "07272017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Interpace Diagnostics says Cigna agreed to cover co's ThyGenx test for Cigna members "
    },
    {
        "content": "NEW YORK  June 21 U.S. healthcare insurer Cigna Corp said on Wednesday it will continue to offer individual coverage under Obamacare for now while rival Anthem Inc announced it was shrinking its participation  amid uncertainty over the fate of the government-subsidized program.",
        "date": "06212017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna stays in Obamacare for now; Anthem reduces participation "
    },
    {
        "content": "NEW YORK  June 21 Cigna Corp Chief Executive David Cordani told investors on Wednesday that the company has $7 billion to $14 billion in capital that it could use in 2017 for mergers and acquisitions in several areas  including Medicare Advantage for older people.",
        "date": "06212017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna's 2017 growth may include Medicare Advantage acquisitions "
    },
    {
        "content": "NEW YORK  June 21 Cigna Corp Chief Executive David Cordani told investors on Wednesday that the company has $7 billion to $14 billion in capital it could use in 2017 for mergers and acquisitions in several areas  including Medicare Advantage for older people.",
        "date": "06212017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 2-Cigna's 2017 growth may include Medicare Advantage acquisitions "
    },
    {
        "content": "* Cigna CEO says the company would like to be in the individual Obamacare health insurance market in 2018  but has not made final decision",
        "date": "06212017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna CEO says still deciding about Obamacare individual business "
    },
    {
        "content": "NEW YORK Cigna Corp   which was prevented from selling new Medicare Advantage health insurance for 18 months  said on Friday the U.S. government was allowing new enrollments starting July 1 after program deficiencies were corrected.",
        "date": "06162017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Cigna Medicare business restored after U.S. lifts sanctions "
    },
    {
        "content": "* Cigna Corp says it received notification from the Centers for Medicare & Medicaid Services that marketing and enrollment sanctions imposed by CMS on Jan 21  have been lifted",
        "date": "06162017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna says CMS lifts marketing and enrollment sanctions imposed in Jan "
    },
    {
        "content": "* Omada Health says raised $50 million in fundraising round led by Cigna Corp",
        "date": "06142017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Omada Health announces fundraising of $50 mln "
    },
    {
        "content": "* Cigna - Expect to reaffirm projected FY2017 consolidated adjusted income from operations of $2.41 billion-$2.53 billion in meetings with investors  analysts- SEC filing Source text for Eikon: Further company coverage:",
        "date": "05262017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Cigna expects to reaffirm projected FY2017 consolidated adj. income from operations of $2.41-$2.53 bln "
    },
    {
        "content": "NEW YORK  May 25 Cigna Corp  which recently won court approval to break off its failed deal with Anthem Inc  on Thursday said it would give its more than 40 000 employees five Cigna shares each and expand its paid leave  as it embarks on its next phase of growth.",
        "date": "05252017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem battle behind it  Cigna gives stock to 40 000 workers "
    },
    {
        "content": "* Soros Fund Management dissolves share stake in Acuity Brands Inc - SEC filing",
        "date": "05152017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Soros Fund Management dissolves share stake in Cigna Corp "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 12 (Fitch) Fitch Ratings has affirmed the 'A+' (Strong) Insurer Financial Strength (IFS) ratings of certain Cigna Corporation (Cigna) subsidiaries as well as Cigna's senior unsecured notes at 'BBB+'. The ratings were removed from Negative Watch and assigned a Stable Outlook. Today's action follows the announced termination of Anthem  Inc.'s (Anthem) merger agreement with Cigna. Cigna's ratings had been on Negative Watch sin",
        "date": "05122017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Fitch Affirms Cigna's Ratings and Removes Rating Watch "
    },
    {
        "content": "WILMINGTON  Del./WASHINGTON Health insurer Anthem Inc asked a Delaware judge on Monday to give it more time to try to win approval for a merger with rival Cigna Corp  which is seeking to end the deal and collect a $1.85 billion break-up fee.",
        "date": "05092017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem argues for 60 days to save merger with balky Cigna "
    },
    {
        "content": "* Anthem comments on decision of the Delaware Court of Chancery on acquisition of Cigna; terminates merger agreement",
        "date": "05122017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Anthem says Cigna is not entitled to termination fee "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 12 (Fitch) Fitch's ratings of Anthem Inc. (ANTM) will remain on Rating Watch Negative following the company's announcement today that it has delivered to Cigna Corp. (CI) a notice terminating the merger agreement between the two companies. Today's announcement from ANTM follows a Delaware judge's ruling yesterday denying the company's request for a 60-day extension of a restraining order enjoining CI from terminating its me",
        "date": "05122017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Fitch: Anthem Remains on Negative Watch Following Termination of Merger Agreement with Cigna "
    },
    {
        "content": "NEW YORK Anthem Inc  on Friday called off a $54 billion deal to buy Cigna Corp   one day after the second-largest U.S. health insurer lost a Delaware business court ruling that could have kept alive the chances of a combination.",
        "date": "05122017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem deal with Cigna finally off  but break-up fee fight goes on "
    },
    {
        "content": "NEW YORK  May 12 Anthem Inc on Friday called off a $54 billion deal to buy Cigna Corp  one day after the second-largest U.S. health insurer lost a Delaware business court ruling that could have kept alive the chances of a combination.",
        "date": "05122017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 2-Anthem deal with Cigna finally off  but break-up fee fight goes on "
    },
    {
        "content": "May 12 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "05122017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Cigna Corporation announces termination of Anthem transaction",
        "date": "05122017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna Corporation announces termination of Anthem transaction "
    },
    {
        "content": "NEW YORK  May 12 Anthem Inc said on Friday it notified Cigna Corp that the $54 billion merger deal was off after it lost a Delaware business court ruling on Thursday and also said it would not pay Cigna the $1.85 billion merger break-up fee.",
        "date": "05122017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem tells Cigna the deal is off  refuses to pay break-up fee "
    },
    {
        "content": "WILMINGTON  Del. A judge effectively killed off any practical chance of Anthem Inc  merging with Cigna Corp  on Thursday as he declined to order Cigna not to terminate the deal.",
        "date": "05112017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Delaware judge denies Anthem injunction  effectively ending Cigna merger "
    },
    {
        "content": "WILMINGTON  Del.  May 11 A judge effectively killed off any practical chance of Anthem Inc merging with Cigna Corp on Thursday as he declined to order Cigna not to terminate the deal.",
        "date": "05112017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 1-Delaware judge denies Anthem injunction  effectively ending Cigna merger "
    },
    {
        "content": "WILMINGTON  Del./WASHINGTON  May 8 Health insurer Anthem Inc asked a Delaware judge on Monday to give it more time to try to win approval for a merger with rival Cigna Corp  which is seeking to end the deal and collect a $1.85 billion break-up fee.",
        "date": "05082017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem argues for 60 days to save merger with balky Cigna "
    },
    {
        "content": "WILMINGTON  Delaware  May 11 A Delaware judge refused to grant health insurer Anthem Inc a preliminary injunction on Thursday  handing a victory to smaller rival Cigna Corp which has sought to terminate their $54 billion proposed merger.",
        "date": "05112017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Delaware judge denies Anthem injunction request in fight with rival Cigna "
    },
    {
        "content": "Health insurer Cigna Corp   which is trying to ditch a takeover bid by Anthem Inc   said on Friday that first-quarter profit rose and it added hundreds of thousands of new members in its Obamacare individual business.",
        "date": "05052017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Cigna boosts first-quarter profit as Anthem deal heads to U.S. high court "
    },
    {
        "content": "* Anthem files Supreme Court petition on Cigna (Adds quotes from Supreme Court petition  antitrust expert)",
        "date": "05052017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 4-Cigna boosts 1st-qtr profit as Anthem deal heads to U.S. high court "
    },
    {
        "content": "Health insurer Cigna Corp  which is trying to ditch a takeover bid by Anthem Inc  said on Friday that first-quarter profit rose and it added hundreds of thousands of new members in its Obamacare individual business.",
        "date": "05052017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna boosts 1st-qtr profit as Anthem deal heads to U.S. top court "
    },
    {
        "content": "NEW YORK  May 5 Cigna Corp. CEO David Cordani said on Friday that its growth in 2017 Obamacare customers that boosted individual members to 353 000 was expected and that the new customer medical costs were in line with the company's expectations.",
        "date": "05052017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna CEO says 2017 Obamacare individual member costs in line "
    },
    {
        "content": "* Cigna reports strong first quarter 2017 results  raises outlook",
        "date": "05052017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna reports Q1 EPS $2.30 "
    },
    {
        "content": "May 5 Health insurer Cigna Corp reported a 15 percent rise in quarterly profit  helped by customer growth in its commercial business.",
        "date": "05052017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Health insurer Cigna posts 15 pct rise in quarterly profit "
    },
    {
        "content": "WASHINGTON  April 28 A U.S. appeals court dealt health insurer Anthem Inc's bid to merge with rival Cigna a likely death blow on Friday when it upheld a lower court's decision stopping the deal.",
        "date": "04282017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "U.S. appeals court blocks Anthem bid to merge with rival Cigna "
    },
    {
        "content": "WASHINGTON  April 28 A U.S. appeals court on Friday blocked health insurer Anthem Inc's bid to merge with Cigna  upholding a lower court's decision that the $54 billion deal should not be allowed because it would lead to higher prices for healthcare.",
        "date": "04282017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 3-U.S. appeals court blocks Anthem bid to merge with rival Cigna "
    },
    {
        "content": "WASHINGTON  April 28 A U.S. appeals court on Friday blocked health insurer Anthem Inc's bid to merge with Cigna  upholding a lower court's decision that the $54 billion deal should not be allowed because it would lead to higher prices for healthcare.",
        "date": "04282017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "CORRECTED-UPDATE 2-U.S. appeals court blocks Anthem bid to merge with rival Cigna "
    },
    {
        "content": "* Anthem responds to U.S. Court of appeals decision on acquisition of Cigna",
        "date": "04282017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Anthem responds to U.S. Court of appeals decision on acquisition of Cigna "
    },
    {
        "content": "* Cigna corp -as previously disclosed  on february 8   u.s. District court for district of columbia enjoined proposed merger between cigna and anthem",
        "date": "04282017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna says US Appeals Court upholds permanent injunction against proposed merger between Anthem  Cigna "
    },
    {
        "content": "WASHINGTON  April 20 Health insurer Anthem Inc denied a report on Thursday that it was in negotiations with the Justice Department in an effort to save its merger with smaller rival Cigna Corp.",
        "date": "04202017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem denies report of talks with Justice Dept regarding merger "
    },
    {
        "content": "April 6 As the epidemic of opioid abuse continues to take its toll on the U.S. healthcare system  health insurer Cigna Corp on Thursday reported a nearly 12 percent drop prescription opioid use among its customers in the past twelve months.",
        "date": "04062017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna reports 12 pct cut in opioid use among U.S. customers "
    },
    {
        "content": "As the epidemic of opioid abuse continues to take its toll on the U.S. healthcare system  health insurer Cigna Corp on Thursday reported a nearly 12 percent drop prescription opioid use among its customers in the past twelve months.",
        "date": "04062017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna reports 12 percent cut in opioid use among U.S. customers "
    },
    {
        "content": "When Irish real estate developer Garrett Kelleher agreed to put up about $3 million to back Cayman Islands litigation to enforce Liberian judgments against the insurer Cigna  he thought the worst possible outcome was that he’d lose his money.",
        "date": "03212017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Litigation funder in Cigna case: ‘Never in my wildest dreams did I imagine this would happen’ "
    },
    {
        "content": "On Friday  U.S. District Judge Paul Diamond of Philadelphia issued a bench warrant for the arrest of Martin Kenney  a lawyer based in the Virgin Islands  and Garrett Kelleher  an Irish real estate developer. The two are facing prosecution for criminal contempt of court after failing to appear before Judge Diamond at a hearing in December to determine their liability to the insurer Cigna.",
        "date": "03212017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Arrest warrant issued for litigation financier  foreign lawyer in $180 million case v. Cigna "
    },
    {
        "content": "* Ceo david cordani's fy 2016 total compensation $15.3 million versus $17.3 million in fy 2015 - sec filing",
        "date": "03172017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Cigna CEO David Cordani's FY 2016 total compensation $15.3 mln vs $17.3 mln in FY 2015 "
    },
    {
        "content": "WASHINGTON  March 1 Connecticut said on Wednesday it had no plans to drop its opposition to health insurer Anthem Inc's proposed purchase of rival Cigna Corp  even if the U.S. Justice Department decides to settle with the companies.",
        "date": "03012017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Connecticut says will not drop opposition to Anthem/Cigna deal "
    },
    {
        "content": "NEW YORK  Feb 24 The Blue Cross Blue Shield Association  which represents insurers in every state  said on Friday that it would attend a meeting between the health insurance industry and President Donald Trump on Monday.",
        "date": "02242017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BCBS  Cigna among insurer groups to meet with Trump on Monday "
    },
    {
        "content": "NEW YORK  Feb 24 The Blue Cross Blue Shield Association  which represents insurers in every state  Cigna Corp and Humana Inc said on Friday they would attend a meeting between the health insurance industry and President Donald Trump on Monday.",
        "date": "02242017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 1-BCBS  Cigna among insurer groups to meet with Trump on Monday "
    },
    {
        "content": "* Sets FY cash dividend of $0.04per share  Source text for Eikon:  Further company coverage:",
        "date": "02222017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Cigna sets full year cash dividend of $0.04 per share "
    },
    {
        "content": "* Cigna names four proven and tenured leaders to executive team",
        "date": "02232017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Eric Palmer to succeed Tom McCarthy as Cigna CFO "
    },
    {
        "content": "Feb 23 Cigna Corp said Chief Financial Officer Thomas McCarthy will retire this summer  a week after the health insurer's $54 billion deal to be acquired by Anthem Inc was blocked by the U.S. Justice Department.",
        "date": "02232017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna CFO Thomas McCarthy to retire "
    },
    {
        "content": "* CO AND HEALTHCARE PARTNERS FORM ALLIANCE TO DELIVER HEALTH PLANS IN LOS ANGELES",
        "date": "02212017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-CIGNA AND HEALTHCARE PARTNERS FORM ALLIANCE TO DELIVER HEALTH PLANS IN LOS ANGELES "
    },
    {
        "content": "* Cigna Corp - reaffirms projected full year 2017 consolidated adjusted income from operations  which remains in range of $2.35 billion to $2.48 billion",
        "date": "02232017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna Corp reaffirms projected FY 2017 consolidated adjusted income from operations "
    },
    {
        "content": "NEW YORK  Feb 17 (IFR) - Banks advising healthcare insurance companies Anthem and Cigna on their mega-merger could be in for a longer than expected assignment as the two health insurance companies square off in court  suing and counter-suing each other over the proposed combination.",
        "date": "02172017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Banks drawn in as Cigna and Anthem square off "
    },
    {
        "content": "* Soros Fund Management takes share stake in facebook inc of 353 686 shares",
        "date": "02142017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Soros Fund Management takes in Facebook  ups in T Mobile and Alphabet "
    },
    {
        "content": "Feb 14 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Tuesday:",
        "date": "02142017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "WASHINGTON  Feb 14 Health insurer Anthem Inc  said on Tuesday that Cigna Corp could not unilaterally terminate an agreement between the two companies to merge.",
        "date": "02142017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Health insurer Anthem says Cigna cannot terminate merger agreement "
    },
    {
        "content": "* Says notified Anthem that it has terminated agreement and plan of merger by and among co  Anthem and a direct wholly owned subsidiary of Anthem",
        "date": "02142017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna Corp terminates merger agreement with Anthem Inc "
    },
    {
        "content": "Anthem Inc on Wednesday won a temporary restraining order that blocks smaller rival Cigna Corp from officially terminating their proposed $54 billion merger  a transaction already rejected by U.S. antitrust regulators. | Video ",
        "date": "02152017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem sues Cigna to block termination of merger "
    },
    {
        "content": "Feb 15 Anthem Inc on Wednesday won a temporary restraining order that blocks smaller rival Cigna Corp  from officially terminating their proposed $54 billion merger  a transaction already rejected by U.S. antitrust regulators.",
        "date": "02152017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 4-Anthem sues Cigna to block termination of merger "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 15 (Fitch) Anthem Inc. (ANTM) and Cigna Corp. (CI) remain on  Rating Watch Negative following the companies' recent filing of lawsuits against  each other in a Delaware Court  according to Fitch Ratings. The lawsuits relate  to a merger agreement the companies entered into in July 2015  and both seek  damages.  On Feb. 14  2017  CI notified ANTM that it had terminated the companies' merger  agreement and had filed suit",
        "date": "02152017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Fitch: Anthem & Cigna Remain on Negative Watch Following Lawsuit Filings "
    },
    {
        "content": "A federal judge on Wednesday ruled against U.S. health insurer Anthem Inc's  proposed $54 billion merger with smaller rival Cigna Corp   derailing an unprecedented effort to consolidate the country's health insurance industry. | Video ",
        "date": "02092017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "U.S. court blocks Anthem-Cigna merger  dealing blow to consolidation "
    },
    {
        "content": "* Intends to \"defend against Anthem litigation and pursue its own action against Anthem for damages that anthem has caused Cigna\"  Source text (http://bit.ly/2lQqnI3) Further company coverage:",
        "date": "02152017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna Corp says will defend against Anthem litigation "
    },
    {
        "content": "Feb 9 Although judges shot down Anthem Inc's  $54 billion acquisition of Cigna Corp and Aetna Inc's $35 billion takeover of Humana Inc on anti-trust grounds  the rulings left scope for a possible combination of Cigna and Humana  industry insiders said.",
        "date": "02092017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "RPT-DEALTALK-Cigna  Humana could still combine despite anti-trust rulings -analysts "
    },
    {
        "content": "Feb 15 Anthem Inc said on Wednesday it has filed a lawsuit seeking a temporary restraining order to enjoin Cigna Corp from terminating its $54 billion deal.",
        "date": "02152017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem sues Cigna to block deal termination "
    },
    {
        "content": "Although judges shot down Anthem Inc's  $54 billion acquisition of Cigna Corp  and Aetna Inc's  $35 billion takeover of Humana Inc  on anti-trust grounds  the rulings left scope for a possible combination of Cigna and Humana  industry insiders said.",
        "date": "02092017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna  Humana could still combine despite anti-trust rulings: analysts "
    },
    {
        "content": "Feb 9 Although judges shot down Anthem Inc's  $54 billion acquisition of Cigna Corp and Aetna Inc's $35 billion takeover of Humana Inc on anti-trust grounds  the rulings left scope for a possible combination of Cigna and Humana  industry insiders said.",
        "date": "02092017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "DEALTALK-Cigna  Humana could still combine despite anti-trust rulings -analysts "
    },
    {
        "content": "A federal judge on Wednesday ruled against U.S. health insurer Anthem Inc's proposed $54 billion merger with smaller rival Cigna Corp  derailing an unprecedented effort to consolidate the country's health insurance industry.",
        "date": "02092017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "US court blocks Anthem-Cigna merger  dealing blow to consolidation "
    },
    {
        "content": "* Anthem files suit against Cigna seeking a temporary restraining order to enjoin Cigna from terminating the merger agreement  specific performance compelling Cigna to comply with the merger agreement and damages",
        "date": "02152017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Anthem files suit against Cigna seeking temporary restraining order to enjoin Cigna from terminating merger agreement "
    },
    {
        "content": "* Anthem responds to u.s. District court's decision on acquisition of cigna",
        "date": "02092017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Anthem responds to U.S. District Court's decision on acquisition of Cigna "
    },
    {
        "content": "Feb 8 A federal judge on Wednesday ruled against U.S. health insurer Anthem Inc's proposed $54 billion merger with smaller rival Cigna Corp  derailing an unprecedented effort to consolidate the country's health insurance industry.",
        "date": "02092017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 6-US court blocks Anthem-Cigna merger  dealing blow to consolidation "
    },
    {
        "content": "* Cigna comments on district court decision to enjoin the proposed transaction with Anthem",
        "date": "02092017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna comments on district court decision to enjoin the proposed transaction with Anthem "
    },
    {
        "content": "Feb 8 A federal judge on Wednesday ruled against U.S. health insurer Anthem Inc's proposed $54 billion merger with smaller rival Cigna Corp  derailing an unprecedented effort to consolidate the country's health insurance industry.",
        "date": "02092017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "CORRECTED-UPDATE 3-U.S. court blocks Anthem-Cigna deal  dealing blow to consolidation "
    },
    {
        "content": "Feb 8 A U.S. federal judge on Wednesday ruled against health insurer Anthem Inc's proposed $54 billion merger with smaller rival Cigna Corp  a deal that would have created the largest U.S. health insurer by membership.    (Reporting by Akankshita Mukhopadhyay in Bengaluru; Editing by Bernard Orr)",
        "date": "02092017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "U.S. court blocks Anthem-Cigna deal "
    },
    {
        "content": "* Anthem CEO says expects ACA-compliant individual plans to be break even to slightly profitable in 2017",
        "date": "02012017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Anthem CEO says hopeful will hear soon from judge on Cigna "
    },
    {
        "content": "* Cigna - made no determination with respect to Anthem's notice seeking to extend termination date  including whether Cigna will seek to terminate merger agreement",
        "date": "02012017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna says has made no determination about Anthem merger extension "
    },
    {
        "content": "Health insurer Cigna Corp on Thursday added to growing public pressure on Republican lawmakers and the Trump administration to stabilize the Obamacare individual market or risk insurers pulling out.",
        "date": "02022017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna adds to insurers' pressure on lawmakers for Obamacare fixes "
    },
    {
        "content": "Feb 1 - Anthem Inc  which is fighting a U.S. government lawsuit to block its deal to buy Cigna Corp  said quarterly revenue rose 7.6 percent  helped by higher premiums and an increase in memberships.",
        "date": "02012017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "U.S. health insurer Anthem's quarterly revenue rises 7.6 pct "
    },
    {
        "content": "Feb 2 Health insurer Cigna Corp on Thursday added to growing public pressure on Republican lawmakers and the Trump administration to stabilize the Obamacare individual market or risk insurers pulling out.",
        "date": "02022017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 3-Cigna adds to insurers' pressure on lawmakers for Obamacare fixes "
    },
    {
        "content": "* Cigna - HeartWell LLP have launched program to improve quality and cost of care for people diagnosed with chronic coronary artery disease",
        "date": "01252017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Cigna  HeartWell collaborate to improve quality and cost for treatment of coronary artery disease "
    },
    {
        "content": "* Cigna CEO says individual Obamacare business loss has been manageable and will be smaller in 2017 but still a loss   Further company coverage:    (Reporting By Caroline Humer)",
        "date": "02022017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna CEO says individual Obamacare business loss has been manageable "
    },
    {
        "content": "* A.G. Schneiderman announces settlement with Cigna that eliminates policies which barred coverage for testing of psychiatric conditions",
        "date": "01232017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-A.G. Schneiderman announces settlement with Cigna over psychiatric testing "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 24 (Fitch) This is a correction of a release issued Jan. 18   2017. It removes a debt issue ($78 million 6.37% senior notes due 2021) included  in the prior version that is not rated by Fitch. Fitch Ratings has maintained the Rating Watch Negative on Cigna Corporation's  (Cigna) 'A-' Issuer Default Rating (IDR)  'BBB+' senior unsecured notes and the  'A+' Insurer Financial Strength (IFS) ratings of certain subsidiaries.",
        "date": "01242017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Correction: Fitch Maintains Cigna's Ratings on Watch Negative "
    },
    {
        "content": "NEW YORK  Feb 2 Cigna Corp will decide on its participation in the 2018 Obamacare individual market during the next few months  looking at what regulations are put in place to stabilize a market Chief Executive Officer David Cordani described as \"fragile at best.\"",
        "date": "02022017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna CEO will assess role in 2018 Obamacare individual plans "
    },
    {
        "content": "Feb 2 Health insurer Cigna Corp  which is waiting for a ruling on the U.S. government's lawsuit to block its acquisition by Anthem Inc  reported a 3 percent rise in quarterly operating revenue on Thursday  as it added new members.",
        "date": "02022017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Health insurer Cigna's operating revenue rises 3 pct "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 18 (Fitch) Fitch Ratings has maintained the Rating Watch  Negative on Cigna Corporation's (Cigna) 'A-' Issuer Default Rating (IDR)  'BBB+'  senior unsecured notes and the 'A+' Insurer Financial Strength (IFS) ratings of  certain subsidiaries.  Today's action follows the completion of a periodic review of Cigna's ratings   which have been on a Negative Watch since July 24  2015 following the  announcement of a definitive",
        "date": "01182017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Fitch Maintains Cigna's Ratings on Watch Negative "
    },
    {
        "content": "A federal judge is expected to block a proposed deal between health insurer Anthem Inc  and Cigna Corp  as soon as Thursday  the New York Post reported  citing sources.",
        "date": "01192017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Judge to block mega-merger of Anthem and Cigna: NY Post "
    },
    {
        "content": "Jan 19 A federal judge is expected to block a proposed deal between health insurer Anthem Inc and Cigna Corp as soon as Thursday  the New York Post reported  citing sources.",
        "date": "01192017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Judge to block mega-merger of Anthem and Cigna - NY Post "
    },
    {
        "content": "NEW YORK  Jan 19 Anthem Inc on Thursday said it extended the deadline for its acquisition of Cigna Corp  by three months as it awaits a federal court ruling on the U.S. government's lawsuit to block the deal.",
        "date": "01192017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem extends Cigna deal closing date ahead of court ruling "
    },
    {
        "content": "* Says following issuance of court's opinion related to antitrust lawsuit  Cigna intends to evaluate its options in accordance with its merger agreement with Anthem",
        "date": "01192017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna intends to evaluate its options regarding its merger agreement with Anthem "
    },
    {
        "content": "* Anthem Inc says it elected to extend the 'termination date' for its pending merger with Cigna through and including April 30  2017",
        "date": "01192017",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Anthem says it elected to extend the 'termination date' for its pending merger with Cigna "
    },
    {
        "content": "Drugstore chain CVS Health Corp  has cut the price of a generic version of Impax Laboratories Inc's  emergency allergy injection  a device similar to Mylan NV's  controversial EpiPen.",
        "date": "01122017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "CVS slashes price of Impax's EpiPen rival "
    },
    {
        "content": "* Cigna and Scripps Health form alliance to deliver innovative health plans in San Diego",
        "date": "01112017",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Cigna says co and Scripps Health enter alliance to deliver health plans in San Diego "
    },
    {
        "content": "* Expect to reaffirm projected full year 2016 consolidated adjusted income from operations  which remains in range of $2.025 billion to $2.095 billion  Source text: (http://bit.ly/2gyyGWo) Further company coverage:",
        "date": "11282016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Cigna expects to reaffirm FY16 consolidated adjusted income from operations "
    },
    {
        "content": "WASHINGTON Anthem Inc and the U.S. Justice Department dug in their heels on Monday in court over whether the lower prices the health insurer expects to negotiate after buying smaller rival Cigna Corp are an efficiency that benefits customers or an antitrust violation.",
        "date": "11222016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem argues Fortune 500 will not suffer from Cigna deal "
    },
    {
        "content": "WASHINGTON  Nov 21 Anthem Inc and the U.S. Justice Department dug in their heels on Monday in court over whether the lower prices the health insurer expects to negotiate after buying smaller rival Cigna Corp are an efficiency that benefits customers or an antitrust violation.",
        "date": "11212016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "UPDATE 3-Anthem argues Fortune 500 will not suffer from Cigna deal "
    },
    {
        "content": "WASHINGTON  Nov 21 Anthem Inc and the U.S. Justice Department dug in their heels on Monday in court over whether the lower prices the health insurer expects to negotiate after buying smaller rival Cigna Corp are an efficiency that benefits customers or an antitrust violation.",
        "date": "11212016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem argues that Fortune 500 won't suffer from Cigna deal "
    },
    {
        "content": "Health insurer Cigna Corp  said on Thursday it would not expand its individual Obamacare plans into more states next year  joining an industry pullback from the struggling business.",
        "date": "11032016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Health insurer Cigna won't expand Obamacare to more states "
    },
    {
        "content": "Nov 3 Health insurer Cigna Corp said on Thursday it would not expand its individual Obamacare plans into more states next year  joining an industry pullback from the struggling business.",
        "date": "11032016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 3-Health insurer Cigna won't expand Obamacare to more states "
    },
    {
        "content": "* Projected adjusted income from operations per share is now estimated to be in range of $7.80 to $8.05 in 2016",
        "date": "11032016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna Q3 adjusted operating earnings per share $1.94 "
    },
    {
        "content": "Nov 3 U.S. health insurer Cigna Corp  reported a 5.2 percent rise in quarterly revenue as it added more members to its commercial business.",
        "date": "11032016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "U.S. health insurer Cigna's revenue rises 5.2 pct "
    },
    {
        "content": "Oct 21 Health insurer Cigna Corp has discontinued its policy of requiring doctors to seek authorization before treating opioid addicts  as part of a fight against an epidemic of opioid abuse  New York Attorney General Eric Schneiderman said on Friday.",
        "date": "10212016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna ends preauthorization requirement to treat opioid addiction "
    },
    {
        "content": "Oct 21 Health insurer Cigna Corp has discontinued its policy of requiring doctors to seek authorization before treating opioid addicts  as part of a fight against an epidemic of opioid abuse  New York Attorney General Eric Schneiderman said on Friday.",
        "date": "10212016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 2-Cigna ends preauthorization requirement to treat opioid addiction "
    },
    {
        "content": "* Cigna Corp - new plans  called Cigna connect  will take effect on January 1  2017  Source text for Eikon:  Further company coverage:",
        "date": "10192016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Cigna to offer individual and family plans in Chicago area "
    },
    {
        "content": "Oct 21 New York Attorney General Eric Schneiderman:",
        "date": "10212016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-NY A.G. settles with Cigna to stop pre-authorization for Opioid addiction treatment "
    },
    {
        "content": "* Cigna telehealth connection expands access and choice to millions  including adding access to behavioral health consults",
        "date": "09272016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Cigna telehealth connection expands access  choice to millions "
    },
    {
        "content": "* Anthem and Cigna have accused one another of merger breach - Bloomberg  Source text - (http://bloom.bg/2cR9knM) Further company coverage:    (Bengaluru Newsroom)",
        "date": "09212016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Anthem and Cigna have accused one another of merger breach - Bloomberg "
    },
    {
        "content": "* Cigna revises policy  will cover 3D mammography for breast cancer screening",
        "date": "08232016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Cigna revises policy  will cover 3D mammography for breast cancer screening "
    },
    {
        "content": "NEW YORK  Aug 17 Aetna Inc warned in July that it would exit much of the individual Obamacare health insurance market if the government challenged its deal to buy rival Humana Inc  according to a letter it sent to the U.S. Department of Justice.",
        "date": "08172016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 2-Aetna warned it would cut Obamacare if Humana deal was blocked "
    },
    {
        "content": "NEW YORK  Aug 17 Aetna Inc's CEO said in a letter to the U.S. Department of Justice during the review of its deal to buy rival Humana Inc that the insurer would exit much of the individual Obamacare insurance market if the agency challenged the merger.",
        "date": "08172016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Aetna CEO warned it would cut Obamacare if Humana deal was blocked "
    },
    {
        "content": "WASHINGTON The judge overseeing the U.S. Justice Department's bid to stop health insurer Anthem from merging with competitor Cigna said on Friday her goal was to have a ruling by the end of January  later than the Dec. 30 date sought by Anthem.",
        "date": "08122016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "U.S. judge in Anthem merger trial sets trial for Nov. 21  plans ruling by late Jan. 2017 "
    },
    {
        "content": "WASHINGTON The judge overseeing the U.S. Justice Department's bid to stop health insurer Anthem  from merging with competitor Cigna  said on Friday her goal was to have a ruling by the end of January  later than the Dec. 30 date sought by Anthem.",
        "date": "08122016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "U.S. judge in Anthem merger trial sets trial for November 21  plans ruling by late January 2017 "
    },
    {
        "content": "WASHINGTON  Aug 12 The judge overseeing the U.S. Justice Department's bid to stop health insurer Anthem  from merging with competitor Cigna said on Friday her goal was to have a ruling by the end of January  later than the Dec. 30 date sought by Anthem.",
        "date": "08122016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 1-U.S. judge in Anthem merger trial sets trial for Nov. 21  plans ruling by late Jan. 2017 "
    },
    {
        "content": "The judge overseeing the U.S. Justice Department's bid to stop big health insurer Anthem from merging with competitor Cigna said on Friday her goal was to have a ruling by the end of January  later than the Dec. 30 sought by Anthem.",
        "date": "08122016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Judge in Anthem merger trial plans ruling by late January "
    },
    {
        "content": "WASHINGTON  Aug 12 The judge overseeing the U.S. Justice Department's bid to stop big health insurer Anthem  from merging with competitor Cigna said on Friday her goal was to have a ruling by the end of January  later than the Dec. 30 sought by Anthem.",
        "date": "08122016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "U.S. judge in Anthem merger trial plans ruling by late January "
    },
    {
        "content": "* Shares recoup early losses   (Adds President comment  details  background  updates shares)",
        "date": "08052016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 2-Cognizant's forecast weak as Brexit weighs on clients "
    },
    {
        "content": "July 28 Moody's Confirms Anthem's And Cigna's Ratings Following Doj Lawsuit",
        "date": "07272016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Moody's confirms Anthem's and Cigna's ratings following DOJ lawsuit "
    },
    {
        "content": "Health insurer Cigna Corp  reported a lower-than-expected quarterly profit due to losses in its group disability and life business  and said it would look at acquisition targets if its proposed takeover by Anthem Inc  did not materialize.",
        "date": "07292016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Health insurer Cigna to look for M&A targets if Anthem deal fails "
    },
    {
        "content": "July 27 Anthem Inc's quarterly revenue rose about 7.2 percent as the No.2 U.S. health insurer added more members in its government business  which sells Medicaid and Medicare plans.",
        "date": "07272016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "U.S. health insurer Anthem's quarterly revenue rises 7.2 pct "
    },
    {
        "content": "* Shares fall as much as 6.4 pct   (Adds conference call comments; updates shares)",
        "date": "07292016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 3-Health insurer Cigna to look for M&A targets if Anthem deal fails "
    },
    {
        "content": "* Cigna reports second quarter 2016 results  solid performance in global health care offset by pressure in group disability and life",
        "date": "07292016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna reports Q2 adjusted operating earnings per share of $1.98 "
    },
    {
        "content": "July 29 Health insurer Cigna Corp's  quarterly revenue rose nearly 5 percent as it added new members to government-backed health plans.",
        "date": "07292016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Health insurer Cigna's revenue rises nearly 5 pct "
    },
    {
        "content": "* Shares fall as much as 15 pct   (Adds CEO comments  share move)",
        "date": "07262016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 2-Centene says it does not have network for Aetna's assets "
    },
    {
        "content": "NEW YORK U.S. antitrust officials on Thursday moved to block an unprecedented consolidation of the national health insurance market  filing a lawsuit against Anthem Inc's  proposed purchase of Cigna Corp  and Aetna Inc's  planned acquisition of Humana Inc . | Video ",
        "date": "07222016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "U.S. moves to block massive health insurer deals led by Anthem  Aetna "
    },
    {
        "content": "* Comments on DOJ position regarding proposed deal with Anthem; Cinga currently evaluating its options consistent with obligations under agreement",
        "date": "07212016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Cigna comments on DOJ position regarding proposed deal with Anthem "
    },
    {
        "content": "NEW YORK Health insurer Aetna Inc   whose $33 billion purchase of Humana Inc  has been spurned by the U.S. government  faces a tough but not impossible legal battle to try to reinstate the deal.",
        "date": "07222016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Aetna  Humana map legal strategy to salvage merger "
    },
    {
        "content": "US Justice Department files lawsuit against Anthem  Cigna In D.C. District Court - court filing   (Reporting By Caroline Humer)",
        "date": "07212016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Us Justice Department files lawsuit against Anthem  Cigna in D.C. District court - court filing "
    },
    {
        "content": "NEW YORK  July 21 U.S. antitrust officials on Thursday moved to block an unprecedented consolidation of the national health insurance market  filing a lawsuit against Anthem Inc's proposed purchase of Cigna Corp and Aetna Inc's planned acquisition of Humana Inc.",
        "date": "07222016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 7-U.S. moves to block massive health insurer deals led by Anthem  Aetna "
    },
    {
        "content": "NEW YORK  July 21 U.S. antitrust regulators will announce on Thursday plans to file lawsuits to block two separate health insurance mergers  Anthem Inc.'s  purchase of Cigna Corp. and Aetna Inc.'s  acquisition of Humana Inc.  according to a source familiar with the matter.",
        "date": "07212016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "U.S. regulators to block Anthem-Cigna  Aetna-Humana deals Thursday-source "
    },
    {
        "content": "* Anthem says not in talks with Cigna Corp to end merger - StreetInsider  citing Bloomberg  Source text : (http://bit.ly/2914pNH)   (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06282016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Anthem says not in talks with Cigna Corp to end merger - StreetInsider  citing Bloomberg "
    },
    {
        "content": "WASHINGTON  June 22 Seven Democratic senators urged the U.S. Justice Department on Wednesday to block two mergers of major health insurance companies  saying that the proposed deals would mean higher premiums and lower-quality healthcare for consumers.",
        "date": "06222016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Democratic senators ask U.S. Justice Dept to block insurance megamergers "
    },
    {
        "content": "* Fitch: Anthem block of Cigna buy wouldn't likely hurt ratings",
        "date": "06202016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Fitch: Anthem block of Cigna Buy wouldn't likely hurt ratings "
    },
    {
        "content": "WASHINGTON Seven Democratic senators urged the U.S. Justice Department on Wednesday to block two mergers of major health insurance companies  saying that the proposed deals would mean higher premiums and lower-quality healthcare for consumers.",
        "date": "06222016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Democratic senators ask Justice Department to block insurance megamergers "
    },
    {
        "content": "U.S. antitrust regulators are concerned about health insurer Anthem Inc's  proposed acquisition of Cigna Corp  and not sure the companies can offer enough concessions to maintain competition in the industry  the Wall Street Journal reported on Sunday.",
        "date": "06202016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Antitrust regulators worry about proposed Cigna-Anthem merger: WSJ "
    },
    {
        "content": "June 19 U.S. antitrust regulators are concerned about health insurer Anthem Inc's proposed acquisition of Cigna Corp and not sure the companies can offer enough concessions to maintain competition in the industry  the Wall Street Journal reported on Sunday.",
        "date": "06202016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Antitrust regulators worry about proposed Cigna-Anthem merger -WSJ "
    },
    {
        "content": "NEW YORK  June 16 The state of California's Insurance Commissioner Dave Jones said on Thursday that he would recommend to the U.S. Department of Justice that it block health insurer Anthem Inc's acquisition of Cigna Corp  because he believes it will raise prices in the state.",
        "date": "06162016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "California's insurance head says Anthem-Cigna deal anti-competitive "
    },
    {
        "content": "June 16 California's insurance commissioner on Thursday urged the U.S. Department of Justice to block health insurer Anthem Inc's acquisition of Cigna Corp  saying he is concerned it will raise premiums in the state.",
        "date": "06162016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "CORRECTED-UPDATE 2-California insurance commissioner urges U.S. to block Anthem-Cigna deal "
    },
    {
        "content": "California's insurance commissioner on Thursday urged the U.S. Department of Justice to block health insurer Anthem Inc's  acquisition of Cigna Corp   saying he is concerned it will raise premiums in the state.",
        "date": "06172016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "California insurance commissioner urges U.S. to block Anthem-Cigna deal "
    },
    {
        "content": "* Cigna Global Health Benefits appoints Neil Irwin as head of global distribution  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06102016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Cigna Global Health Benefits appoints Neil Irwin as head of global distribution "
    },
    {
        "content": "Health insurer Cigna has been ordered to pay a Houston-area hospital more than $13 million by a judge who found it underpaid the hospital  which is not in its provider network  for years.",
        "date": "06022016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Cigna ordered to pay $13 mln in case over out-of-network claims "
    },
    {
        "content": "* Negative watch status reflects fitch's expectation that anthem's post-acquisition financial leverage metrics will be meaningfully higher  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05272016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Fitch maintains Cigna on rating watch negative "
    },
    {
        "content": "* Received final order from Indiana Department Of Insurance Commissioner  approving acquisition of Cigna healthcare of Indiana",
        "date": "05262016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Anthem gets approval for Cigna deal from Indiana Department of Insurance "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 27 (Fitch) Fitch Ratings has maintained the Rating Watch Negative  for Cigna Corporation's (Cigna) 'A-' Issuer Default Rating (IDR)  'BBB+' senior  unsecured notes  and the 'A+' Insurer Financial Strength (IFS) ratings of  certain subsidiaries.  Today's action follows the completion of a periodic review of Cigna's ratings.  Fitch had placed Cigna's ratings on Negative Watch on July 24  2015 following  the announcement of a ",
        "date": "05272016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Fitch Maintains Cigna on Rating Watch Negative "
    },
    {
        "content": "* Cigna issues positive coverage decision for nanostring's prosigna\u007f breast cancer assay  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05262016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Nanostring says Cigna issues positive coverage decision for co's Prosigna breast cancer assay "
    },
    {
        "content": "* To reaffirm projected full year 2016 consolidated adjusted income from operations per share  which remains in range of $8.95 to $9.35  Source text for Eikon: [ID:(http://1.usa.gov/1TBKQua )] Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05262016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna to reaffirm projected FY 2016 consolidated adjusted EPS from operations "
    },
    {
        "content": "WASHINGTON Quarrels have broken out behind the scenes of Anthem Inc's  proposed acquisition of Cigna Corp   as the health insurers seek regulatory approval for their landmark deal  the Wall Street Journal reported on Sunday.",
        "date": "05222016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Anthem  Cigna merger squabbles could delay antitrust approval: WSJ "
    },
    {
        "content": "WASHINGTON  May 22 Quarrels have broken out behind the scenes of Anthem Inc's proposed acquisition of Cigna Corp  as the health insurers seek regulatory approval for their landmark deal  the Wall Street Journal reported on Sunday.",
        "date": "05222016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 1-Anthem  Cigna merger squabbles could delay antitrust approval -WSJ "
    },
    {
        "content": "WASHINGTON  May 22 Quarrels have broken out behind the scenes of Anthem Inc's proposed acquisition of Cigna Corp  as the health insurers seek regulatory approval for their landmark deal  the Wall Street Journal reported on Sunday.",
        "date": "05222016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem  Cigna merger squabbles could delay antitrust approval - WSJ "
    },
    {
        "content": "NEW YORK Anthem Inc  Chief Executive Officer Joseph Swedish said on Tuesday the health insurer was pushing for approval from antitrust regulators reviewing its $51 billion acquisition of Cigna Corp  and expects to hear a decision in July.",
        "date": "05242016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem CEO expects U.S. regulatory decision in July "
    },
    {
        "content": "NEW YORK  May 19 Health insurer Cigna Corp  plans to cut its customers' prescriptions for opioid treatments by 25 percent over the next three years  putting its weight behind a U.S. government battle against addictive painkillers.",
        "date": "05192016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna plans to cut opioid use among U.S. customers by 25 pct "
    },
    {
        "content": "NEW YORK  May 24 Anthem Inc Chief Executive Officer Joseph Swedish said on Tuesday the health insurer was pushing for approval from antitrust regulators reviewing its $51 billion acquisition of Cigna Corp and expects to hear a decision in July.",
        "date": "05242016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 2-Anthem CEO expects U.S. regulatory decision in July "
    },
    {
        "content": "NEW YORK  May 24 Anthem Inc Chief Executive Officer Joseph Swedish on Tuesday said that the antitrust process with Cigna Corp is moving forward as expected - including on the national level - and that tensions with the smaller insurer about the review are in the past.",
        "date": "05242016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem CEO says Cigna deal moving forward with antitrust review "
    },
    {
        "content": "NEW YORK  May 11 Cigna Corp signed deals that will pay the makers of Repatha and Praluent  two powerful but pricey cholesterol lowering treatments  based on how well their customers respond to the medicines  the health insurer said on Wednesday.",
        "date": "05112016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna makes deals with Amgen  Sanofi for pricey cholesterol drugs "
    },
    {
        "content": "NEW YORK  May 11 Cigna Corp signed deals that will pay the makers of two potent but pricey cholesterol-lowering treatments based on how well their customers respond to the medications  the health insurer said on Wednesday.",
        "date": "05112016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 3-Cigna makes deals with Amgen  Sanofi for pricey cholesterol drugs "
    },
    {
        "content": "* Regeneron head of commercial operations Robert Terifay  in interview  says drugmaker has signed deals with other payers  in addition to Cigna  to assess value of its Praluent cholesterol drug",
        "date": "05112016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Regeneron says in deals with other payers to assess Praluent value "
    },
    {
        "content": "* Says has entered into new value-based contracts with both amgen and sanofi/regeneron for PCSK9 inhibitors for commercial business  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05112016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna enters into new contracts with Amgen and Sanofi/Regeneron "
    },
    {
        "content": "NEW YORK Health insurer Cigna Corp   which announced plans to be bought by larger Anthem Inc  10 months ago  on Friday said the deal may close in 2017 rather than 2016 due to the complexity of the regulatory process  according to a filing with the Securities and Exchange Commission.",
        "date": "05062016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna says Anthem deal could close in 2017; Anthem sticks to 2016 "
    },
    {
        "content": "U.S. health insurer Cigna Corp   which is being bought by larger rival Anthem Inc   reported a better-than-expected quarterly profit as more customers signed up for its Medicare Advantage business  boosting premiums.",
        "date": "05062016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Health insurer Cigna reports better-than-expected profit "
    },
    {
        "content": "* Cigna reports strong first quarter 2016 results  raises outlook",
        "date": "05062016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna Q1 adjusted operating earnings per share $2.32 "
    },
    {
        "content": "April 27 Health insurer Anthem Inc  which is in the process of buying smaller rival Cigna Corp   reported a near 6.5 percent rise in quarterly revenue  as it added more members to its Medicaid plans.",
        "date": "04272016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Health insurer Anthem reports higher revenue on Medicaid enrollments "
    },
    {
        "content": "NEW YORK  April 19 UnitedHealth Group Inc's  decision to exit most of its Obamacare health insurance exchanges next year means rivals will need to raise prices further to prop up an unprofitable business  healthcare analysts and policy experts said on Tuesday.",
        "date": "04192016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UnitedHealth's Obamacare exit adds pricing pressure on rivals "
    },
    {
        "content": "* Ceo David Cordani's fy 2015 total compensation $17.3 million versus $14.5 million in fy 2014 - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "03182016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "BRIEF-Cigna announces CEO 2015 total compensation "
    },
    {
        "content": "March 1 The American Hospital Association warned U.S. antitrust regulators that Anthem Inc's proposed acquisition of Cigna Corp will hurt other health insurers' ability to compete with Blue Cross Blue Shield plans  leading to higher premiums for consumers.",
        "date": "03012016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "U.S. hospital group warns of Blue Cross dominance if Anthem buys Cigna "
    },
    {
        "content": "NEW YORK  Feb 8 U.S.-based health insurer Cigna Corp and Novartis AG have agreed on a performance-based price for the Swiss drugmaker's new heart drug  Entresto  Cigna said on Monday.",
        "date": "02082016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Insurer Cigna and Novartis set heart-drug price based on health outcome "
    },
    {
        "content": "NEW YORK U.S.-based health insurers Cigna Corp and Aetna Inc have struck deals with Novartis AG for a performance-based price for the Swiss drugmaker's new heart drug  Entresto  the companies said on Monday.",
        "date": "02092016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Novartis sets heart-drug price with two insurers based on health outcome "
    },
    {
        "content": "NEW YORK  Feb 8 U.S.-based health insurers Cigna Corp and Aetna Inc have struck deals with Novartis AG for a performance-based price for the Swiss drugmaker's new heart drug  Entresto  the companies said on Monday.",
        "date": "02092016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "CORRECTED-UPDATE 1-Novartis sets heart-drug price with two insurers based on health outcome "
    },
    {
        "content": "NEW YORK  Feb 8 U.S.-based health insurer Cigna Corp and Novartis AG have agreed on a performance-based price for the Swiss drugmaker's new heart drug  Entresto  Cigna said on Monday.",
        "date": "02092016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "CORRECTED-Insurer Cigna and Novartis set heart-drug price based on health outcome "
    },
    {
        "content": "Health insurer Cigna Corp  reported a better-than-expected  quarterly profit  helped by strength in its government plans and favorable medical costs in its employer business.",
        "date": "02042016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Health insurer Cigna reports better-than-expected profit "
    },
    {
        "content": "Feb 4 Health insurer Cigna Corp reported a better-than-expected  quarterly profit  helped by strength in its government plans and favorable medical costs in its employer business.",
        "date": "02042016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 2-Health insurer Cigna reports better-than-expected profit "
    },
    {
        "content": "Feb 4 Health insurer Cigna Corp  which is being bought by larger rival Anthem Inc  reported a 6.7 percent rise in quarterly revenue  helped by membership growth in its government plans.",
        "date": "02042016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Health insurer Cigna's quarterly revenue rises 6.7 pct "
    },
    {
        "content": "The U.S. government has suspended new enrollment in Cigna Corp's Medicare Advantage health insurance and prescription drug plans  saying Cigna had \"widespread and systemic failures\" that prevented patients from accessing medical services.    The government said Cigna did not handle complaints and grievances properly from patients who had been denied coverage for health benefits or drugs  according to a Jan. 21 letter from its regulator  the Centers for Medicare and Medicaid.",
        "date": "01222016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "U.S. government suspends enrollment in Cigna Medicare Advantage  drug plans "
    },
    {
        "content": "Jan 22 The U.S. government has suspended new enrollment in Cigna Corp's Medicare Advantage health insurance and prescription drug plans  saying Cigna had \"widespread and systemic failures\" that prevented patients from accessing medical services.",
        "date": "01222016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 2-U.S. govt suspends enrollment in Cigna Medicare Advantage  drug plans "
    },
    {
        "content": "NEW YORK  Jan 22 Health insurer Cigna Corp  said on Friday that the government health agency had imposed sanctions that would force it to suspend new enrollment in its Medicare Advantage health plans for seniors as well as its standalone Medicare drug plans.",
        "date": "01222016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna says Medicare Advantage and drug plan enrollment suspended "
    },
    {
        "content": "Jan 12 Anthem Inc could save $3 billion annually on drug costs from a re-pricing provision in its current contract with pharmacy benefits manager Express Scripts Holding Co  the health insurer's chief executive officer said Tuesday.",
        "date": "01132016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 1-Anthem targets $3 billion in drug cost savings with Express Scripts "
    },
    {
        "content": "Jan 12 Anthem Inc could save $3 billion annually on drug costs from a re-pricing provision in its current contract with pharmacy benefits manager Express Scripts Holding Co  the health insurer's chief executive officer said Tuesday.",
        "date": "01132016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem targets $3 billion in drug cost savings with Express Scripts "
    },
    {
        "content": "Jan 12 ANTHEM INC CEO JOSEPH SWEDISH SAYS CONTINUES TO EXPECT CIGNA ACQUISITION TO CLOSE IN SECOND HALF OF 2016 ANTHEM SAYS CONTINUES TO WORK WITH REGULATORS TO FINALIZE ACQUISITION ANTHEM SAYS CIGNA DEAL WILL ENHANCE AFFORDABILITY  CHOICE FOR MEMBERS ANTHEM SAYS EXPECTS COST SAVINGS FROM REPRICING PROVISION IN PHARMACEUTICAL SERVICES CONTRACT   (Reporting by Susan Kelly in Chicago)",
        "date": "01122016",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Anthem CEO expects Cigna acquisition to close in second half "
    },
    {
        "content": "Health insurer Anthem Inc  which is buying rival Cigna Corp  said it expected its adjusted net income to rise to over $10.80 per share in 2016 from $10.16 estimated for 2015.",
        "date": "01122016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Health insurer Anthem expects higher profit for 2016 "
    },
    {
        "content": "Jan 12 Health insurer Anthem Inc  which is buying rival Cigna Corp  said it expected its adjusted net income to rise to over $10.80 per share in 2016 from $10.16 estimated for 2015.",
        "date": "01122016",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 1-Health insurer Anthem expects higher profit for 2016 "
    },
    {
        "content": "STOCKHOLM/WASHINGTON General Electric on Monday walked away from a $3.3 billion agreement to sell its appliances business to Sweden's Electrolux  terminating the deal after months of opposition from U.S. antitrust regulators. | Video ",
        "date": "12072015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "GE calls off Electrolux appliance deal amid U.S. antitrust fight "
    },
    {
        "content": "* Electrolux shares fall as much as 15 percent   (Adds Breakingviews link  updates share prices)",
        "date": "12072015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 5-GE calls off Electrolux appliance deal amid U.S. antitrust fight "
    },
    {
        "content": "The U.S. Federal Trade Commission said it has filed a complaint aimed at stopping Staples Inc   the nation's largest office supply store  from buying its top rival  Office Depot Inc .",
        "date": "12072015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "U.S. files complaint to stop Staples from buying Office Depot "
    },
    {
        "content": "Health insurer Cigna Corp  reported a better-than-expected quarterly profit  helped by higher enrollments in its government plans and favorable medical costs.",
        "date": "11062015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Health insurer Cigna reports better-than-expected profit "
    },
    {
        "content": "* Says reduction in individual customers could hurt 2016 rev   (Adds background)",
        "date": "11062015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 2-Health insurer Cigna reports better-than-expected profit "
    },
    {
        "content": "Nov 6 Health insurer Cigna Corp reported a 7.2 percent rise in quarterly revenue  helped by strong performance in its commercial business.",
        "date": "11062015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Health insurer Cigna's Q3 revenue rises 7.2 pct "
    },
    {
        "content": "(Corrects construction spending forecast in paragraph 36 and name of Cigna Corp in paragraph 6; also re-orders blurbs)       WEEK AHEAD  Domestic U.S. economic indicators could dominate markets as all are watching for signs of strength that could clear the way for the Federal Reserve's first rate cut in years - or weakness that could move that rate hike off the table for 2015.  Equities could drift in response to earnings reports - with some big names including CVS and Chevron reporting early",
        "date": "10302015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "CORRECTED-What to Watch in the Week Ahead and on Monday  Nov 2 "
    },
    {
        "content": "NEW YORK Anthem Inc  Chief Executive Officer Joseph Swedish said on Wednesday that he expects its planned acquisition of Cigna to close in the second half of 2016 as anticipated.",
        "date": "10282015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Anthem CEO expects Cigna acquisition to close second half of 2016 "
    },
    {
        "content": "Oct 28 Health insurer Anthem Inc said on Wednesday that its Obamacare insurance business is being hampered by lower-than-anticipated enrollment due to fewer applicants than expected and cheaper premium rates at competitors.",
        "date": "10282015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 2-Anthem shares falls as Obamacare business hampers profit "
    },
    {
        "content": "NEW YORK  Oct 28 Anthem Inc Chief Executive Officer Joseph Swedish said on Wednesday that he expects its planned acquisition of Cigna to close in the second half of 2016 as anticipated.",
        "date": "10282015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem CEO expects Cigna acquisition to close 2nd half of 2016 "
    },
    {
        "content": "Oct 9 Health insurer Cigna Corp on Friday agreed to drop its requirement that patients with HIV/AIDS get some of their medications exclusively through its mail-order pharmacy  settling a consumer lawsuit.",
        "date": "10092015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna drops mail-order requirement for HIV drugs in settlement "
    },
    {
        "content": "NEW YORK Health insurer Anthem's planned $47 billion takeover of rival Cigna will not hurt consumers but increase choice and affordability  Cigna CEO David Cordani said  defending the merger against widespread criticism that it will harm competition.",
        "date": "09172015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Cigna CEO defends Anthem deal  says consumer will still have choice "
    },
    {
        "content": "NEW YORK  Aug 6 U.S. hospitals urged antitrust regulators this week to consider whether health insurer Anthem Inc's  planned acquisition of rival Cigna Corp  would boost healthcare costs.",
        "date": "08062015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "U.S. hospitals urge DOJ antitrust probe of Anthem-Cigna deal "
    },
    {
        "content": "* Shares rise as much as 9.6 pct   (Adds details from conference call; updates shares)",
        "date": "08052015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 2-Health insurer WellCare raises forecast  looks to buy assets "
    },
    {
        "content": "Aetna Inc Chief Executive Mark Bertolini said on Tuesday the company is talking to federal and state officials on its $37 billion acquisition of Humana Inc  and that there is enough insurance competition for it to receive approval.",
        "date": "08042015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Aetna CEO says antitrust process underway in Humana deal "
    },
    {
        "content": "NEW YORK  Aug 6 U.S. hospitals urged antitrust regulators this week to consider whether health insurer Anthem Inc's  planned acquisition of rival Cigna Corp  would boost healthcare costs.",
        "date": "08062015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 1-U.S. hospitals urge DOJ antitrust probe of Anthem-Cigna deal "
    },
    {
        "content": "NEW YORK  Aug 4 Aetna Inc Chief Executive Mark Bertolini said on Tuesday the company is talking to federal and state officials on its $37 billion acquisition of Humana Inc and that there is enough insurance competition for it to receive approval.",
        "date": "08042015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 1-Aetna CEO says antitrust process underway in Humana deal "
    },
    {
        "content": "July 30 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "07302015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Health insurer Cigna Corp  which agreed last week to be bought by Anthem Inc for $47 billion  said on Thursday that medical services use was low in the second quarter  helping to keep costs in check and beat Wall Street profit estimates.",
        "date": "07302015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Health insurer Cigna says second-quarter medical costs stay low; profit beats "
    },
    {
        "content": "July 30 Health insurer Cigna Corp  which agreed last week to be bought by Anthem Inc for $47 billion  said on Thursday that medical services use was low in the second quarter  helping to keep costs in check and beat Wall Street profit estimates.",
        "date": "07302015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "CORRECTED-UPDATE 3-Health insurer Cigna says 2nd-qtr medical costs stay low; profit beats "
    },
    {
        "content": "NEW YORK  July 30 Cigna Corp CEO David Cordani said on Thursday that the company has begun conversations with regulators  including state regulators and antitrust regulators  about its $47 billion agreement to be purchased by Anthem Inc..",
        "date": "07302015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna CEO says has begun talks with regulators about Anthem deal "
    },
    {
        "content": "July 29 Health insurer Anthem Inc  which plans to buy rival Cigna Corp for $47 billion  on Wednesday said medical costs  particularly in its Medicaid and Medicare businesses  were at the low end of expectations and helped boost second-quarter profit.",
        "date": "07292015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "UPDATE 4-Anthem profit beats as medical costs stay at low end of estimates "
    },
    {
        "content": "July 30 Health insurer Cigna Corp  which agreed to be bought by Anthem Inc for $47 billion this month  reported a 2.6 percent rise in quarterly profit as it added more members in its commercial and government businesses.",
        "date": "07302015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Health insurer Cigna's profit rises as it adds more members "
    },
    {
        "content": "NEW YORK  July 27 Allergan plc CEO Brent Saunders is ready to put the $36 billion his company will net from the sale of its generics business to Teva Pharmaceutical Industries Ltd to work  possibly with another large  \"transformational\" merger.",
        "date": "07272015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 1-Allergan CEO  fresh off one deal  sets sights on others "
    },
    {
        "content": "July 24 Anthem Inc's decision to buy Cigna Corp  forming the largest U.S. health insurer by membership  will likely speed consolidation across the healthcare industry  from hospitals to drugmakers.",
        "date": "07242015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "U.S. health insurer mergers to speed industry deals -experts "
    },
    {
        "content": "Anthem Inc said on Friday it would buy Cigna Corp for about $54.2 billion  creating the largest U.S. health insurer by membership and accelerating the industry's consolidation from five national players to three.",
        "date": "07242015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem to buy Cigna  creating biggest U.S. health insurer "
    },
    {
        "content": "U.S. health insurer Anthem Inc is close to finalizing negotiations to acquire peer Cigna Inc and could announce a roughly $48 billion deal as early as this week  two people familiar with the matter said on Wednesday. | Video ",
        "date": "07232015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Anthem set to announce deal for Cigna this week: sources "
    },
    {
        "content": "Health insurer Anthem Inc is close to finalizing negotiations to acquire peer Cigna Inc and could announce a roughly $48 billion deal as early as this week  according to a person familiar with the matter.",
        "date": "07222015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Anthem set to announce deal for Cigna this week -source "
    },
    {
        "content": "Anthem Inc's decision to buy Cigna Corp  forming the largest U.S. health insurer by membership  will likely speed consolidation across the healthcare industry  from hospitals to drugmakers.",
        "date": "07242015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "U.S. health insurer mergers to speed industry deals: experts "
    },
    {
        "content": "July 22 U.S. health insurer Anthem Inc  is close to finalizing negotiations to acquire peer Cigna Inc  and could announce a roughly $48 billion deal as early as this week  two people familiar with the matter said on Wednesday.",
        "date": "07232015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 4-Anthem set to announce deal for Cigna this week -sources "
    },
    {
        "content": "July 22 Health insurer Anthem Inc is close to finalizing negotiations to acquire peer Cigna Inc  and could announce a roughly $48 billion deal as early as this week  according to a person familiar with the matter.",
        "date": "07222015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "RPT-UPDATE 2-Anthem set to announce deal for Cigna this week -source "
    },
    {
        "content": "Health insurer Anthem Inc is close to finalizing negotiations to acquire peer Cigna Inc and could announce a roughly $48 billion deal as early as this week  according to a person familiar with the matter.",
        "date": "07222015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem set to announce deal for Cigna this week: source "
    },
    {
        "content": "July 22 Health insurer Anthem Inc is close to finalizing negotiations to acquire peer Cigna Inc  and could announce a roughly $48 billion deal as early as this week  according to a person familiar with the matter.",
        "date": "07222015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 2-Anthem set to announce deal for Cigna this week -source "
    },
    {
        "content": "* Combined company would be No. 1 insurer  cover 53 mln members",
        "date": "07242015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 5-Anthem to buy Cigna  creating biggest U.S. health insurer "
    },
    {
        "content": "July 24 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "07242015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "July 16 UnitedHealth Group Inc  the largest U.S. health insurer  on Thursday forecast higher profit and said medical costs were under control  pushing off any discussion about its role in a frenzy of insurer consolidation.",
        "date": "07162015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 3-UnitedHealth serves up second quarter growth  but no deal "
    },
    {
        "content": "NEW YORK (IFR) - U.S. health insurer Anthem said on Friday that Bank of America  Credit Suisse and UBS have committed to a $27 billion bridge to back its $54.2 billion acquisition of rival Cigna Corp  according to RLPC.",
        "date": "07242015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem locks in bank financing for Cigna purchase "
    },
    {
        "content": "July 16 UnitedHealth Group Inc  the largest U.S. health insurer  reported a quarterly profit that jumped 12.6 percent as revenue increased in its Optum business and enrollments increased.",
        "date": "07162015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UnitedHealth's profit rises on higher enrollments  Optum business "
    },
    {
        "content": "NEW YORK  July 24 (IFR) - U.S. health insurer Anthem said on Friday that Bank of America  Credit Suisse and UBS have committed to a $27 billion bridge to back its $54.2 billion acquisition of rival Cigna Corp  according to RLPC.",
        "date": "07242015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 2-Anthem locks in bank financing for Cigna purchase "
    },
    {
        "content": "NEW YORK  July 24 (IFR) - US health insurer Anthem said on Friday it had locked in committed financing from Bank of America  Credit Suisse and UBS to pay for its acquisition of rival Cigna Corp in a deal valued at US$54.2bn.",
        "date": "07242015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "CORRECTED-Anthem locks in bank financing for Cigna purchase "
    },
    {
        "content": "Health insurers Anthem Inc  and Cigna Corp  were moving ahead to sign a merger deal as Cigna backed down on its differences over governance issues  CNBC tweeted  citing sources.",
        "date": "07092015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Anthem  Cigna progressing toward deal: CNBC "
    },
    {
        "content": "July 9 Health insurers Anthem Inc and Cigna Corp were moving ahead to sign a merger deal as Cigna backed down on its differences over governance issues  CNBC tweeted  citing sources.",
        "date": "07092015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 1-Anthem  Cigna progressing towards deal - CNBC "
    },
    {
        "content": "July 9 Health insurers Anthem Inc and Cigna Corp were moving ahead to sign a merger deal as Cigna backed down over governance issues  CNBC tweeted  citing sources.",
        "date": "07092015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem  Cigna progressing towards deal - CNBC "
    },
    {
        "content": "NEW YORK  July 3 Aetna Inc's $37 billion deal to buy smaller health insurer Humana Inc will face rigorous scrutiny from U.S. regulators  which antitrust experts said could also make other large-scale mergers in the sector more difficult.",
        "date": "07032015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "UPDATE 1-Aetna's Humana deal to bring scrutiny on other insurer tie-ups -experts "
    },
    {
        "content": "U.S. health insurer Cigna Corp  has had its first meetings with competitor Anthem Inc  after it rebuffed Anthem's $47 billion merger proposal last month  a person familiar with the matter said on Thursday.",
        "date": "07022015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Anthem  Cigna in new round of talks: source "
    },
    {
        "content": "NEW YORK/LONDON  June 29 Mergers and acquisitions (M&A) worldwide in the second quarter of 2015 almost matched the record set in the second quarter of 2007  according to preliminary Thomson Reuters data  as big companies turned to deals to boost their market share.",
        "date": "06292015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "DEALS-Second-quarter M&A close to record amid mega deals "
    },
    {
        "content": "July 2 U.S. health insurer Cigna Corp has had its first meetings with competitor Anthem Inc after it rebuffed Anthem's $47 billion merger proposal last month  a person familiar with the matter said on Thursday.",
        "date": "07022015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem  Cigna in new round of talks -source "
    },
    {
        "content": "NEW YORK U.S. health insurer Anthem Inc  said on Saturday it had offered $47 billion in cash and stock for smaller rival Cigna Corp   signaling a pick-up in the industry's long-awaited consolidation.",
        "date": "06202015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Anthem offers $47 billion for Cigna as insurers race for a deal "
    },
    {
        "content": "Health insurer Cigna Corp  rebuffed Anthem Inc's  $47 billion merger proposal on Sunday  saying it was \"deeply disappointed\" with Anthem's recent actions and the offer was not in the best interest of shareholders.",
        "date": "06212015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Cigna rebuffs Anthem's 'deeply disappointing' proposal "
    },
    {
        "content": "NEW YORK  June 20 U.S. health insurer Anthem Inc  said on Saturday it had offered $47 billion in cash and stock for smaller rival Cigna Corp  signaling a pick-up in the industry's long-awaited consolidation.",
        "date": "06202015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 4-Anthem offers $47 bln for Cigna as insurers race for a deal "
    },
    {
        "content": "June 21 Health insurer Cigna Corp  rebuffed Anthem Inc's $47 billion merger proposal on Sunday  saying it was \"deeply disappointed\" with Anthem's recent actions and the offer was not in the best interest of shareholders.",
        "date": "06212015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 1-Cigna rebuffs Anthem's \"deeply disappointing\" proposal "
    },
    {
        "content": "June 21 Cigna Corp said on Sunday that Anthem Inc's \"highly conditional  non-binding proposal\" is inadequate and that it is not in the best interest of Cigna shareholders.",
        "date": "06212015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna calls Anthem's offer \"inadequate\" "
    },
    {
        "content": "* Says Anthem proposal inadequate and not in best interests of Cigna shareholders",
        "date": "06212015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "BRIEF-Cigna says Anthem proposal inadequate and not in best interests of Cigna shareholders "
    },
    {
        "content": "NEW YORK/WASHINGTON  June 22 U.S. health insurer Anthem Inc on Monday dismissed concerns that buying smaller competitor Cigna Corp would be considered anti-competitive  even as antitrust experts said the combination would earn regulatory scrutiny.",
        "date": "06222015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem confident  but experts see antitrust hurdles to Cigna deal "
    },
    {
        "content": "NEW YORK  June 20 U.S. health insurer Anthem Inc  said on Saturday it had offered $184 per share in cash and stock for smaller rival Cigna Corp but a deal was being held up in part over what role Cigna's CEO would have in a merged company.",
        "date": "06202015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem offers $184 per share for Cigna  CEO role holds up deal "
    },
    {
        "content": "NEW YORK/WASHINGTON  June 22 U.S. health insurer Anthem Inc on Monday dismissed concerns that buying smaller competitor Cigna Corp would be considered anti-competitive  even as antitrust experts said the combination would earn regulatory scrutiny.",
        "date": "06222015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 2-Anthem confident  but experts see antitrust hurdles to Cigna deal "
    },
    {
        "content": "Health insurer Cigna Corp  rebuffed a takeover offer from larger rival Anthem Inc   as the U.S. managed care sector gears up for a round of consolidation  the Wall Street Journal reported on Monday.",
        "date": "06152015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Cigna rebuffs takeover approach by Anthem: WSJ "
    },
    {
        "content": "* Cigna shares touch record high of $162.16   (Adds Breakingviews link)",
        "date": "06152015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 4-Cigna rebuffs takeover approach by Anthem - WSJ "
    },
    {
        "content": "NEW YORK  June 22 Anthem Inc CEO Joseph Swedish said on Monday that the company has looked closely at how antitrust authorities would view an acquisition of Cigna Corp  and does not see any \"substantive\" issues.",
        "date": "06222015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem CEO does not see substantive antitrust issues with Cigna deal "
    },
    {
        "content": "* Indexes up: Dow 0.69 pct  S&P 0.7 pct  Nasdaq 0.7 pct   (Updates to open)",
        "date": "06222015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "US STOCKS-Wall Street opens higher on Greek deal hopes "
    },
    {
        "content": "June 15 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "06152015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Cigna touches record high after Anthem takeover offer report",
        "date": "06152015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "US STOCKS-U.S. stocks lower amid Greek debt worries "
    },
    {
        "content": "NEW YORK  June 22 U.S. health insurer Anthem Inc  on Monday said it is committed to buying Cigna Corp   saying it had found $2 billion in cost synergies within two years  after the smaller rival publicly rejected the deal.",
        "date": "06222015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Anthem says committed to Cigna deal  sees $2 bln in synergies "
    },
    {
        "content": "* Futures up: Dow 109 pts  S&P 14 pts  Nasdaq 71 pts   (Adds details  comment  updates prices)",
        "date": "06222015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "US STOCKS-Wall Street set to open higher on Greek hopes "
    },
    {
        "content": "June 15 Health insurer Cigna Corp has rebuffed a takeover offer from Anthem Inc  CNBC tweeted  citing Dow Jones.",
        "date": "06152015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "CORRECTED-Cigna rebuffs takeover approach by Anthem - CNBC  citing Dow Jones "
    },
    {
        "content": "April 30 Cigna Corp said on Thursday that medical services use did not change among customers in its Medicare Advantage health plans for elderly people and the disabled  a contrast to comments from competitor Humana Inc.",
        "date": "04302015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "UPDATE 2-Cigna sees no change in medical use in 1st qtr  unlike Humana "
    },
    {
        "content": "NEW YORK  April 30 Cigna Corp did not experience \"any significant change\" in the use of medical services during the first quarter  CFO Thomas McCarthy said during a conference call with investors.",
        "date": "04302015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna CFO says medical use trends unchanged during first quarter "
    },
    {
        "content": "Cigna Corp  reported a better-than-expected quarterly profit  helped by an increase in premiums and fees in the health insurer's commercial business  which added more members.",
        "date": "04302015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna profit beats estimate as it adds more customers "
    },
    {
        "content": "Cigna Corp has been hit with a lawsuit claiming that the health insurer discriminates against people with HIV/AIDS by forcing them to get some of their medications exclusively from its own mail-order pharmacy as part of a scheme to boost profits.",
        "date": "04302015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna sued over mail-order HIV drug program "
    },
    {
        "content": "April 30 U.S. health insurer Cigna Corp  reported an 11.4 percent rise in quarterly revenue  due to an increase in premiums and fees driven by customer additions in its commercial and government businesses.",
        "date": "04302015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna Q1 revenue rises due to customer additions "
    },
    {
        "content": "NEW YORK  April 13 Medical researchers call it the \"Angelina Effect \" the surge in demand for genetic testing attributable to movie star Angelina Jolie's public crusade for more aggressive detection of hereditary breast and ovarian cancer.",
        "date": "04132015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "RPT - INSIGHT-Aetna  Cigna balk as Angelina effect spurs genetic cancer testing "
    },
    {
        "content": " (This version of the April 12 story corrects reference to Dr. Daly's role in publishing recommendations for genetic testing in paragraph 18) | Video ",
        "date": "04142015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Aetna  Cigna balk as Angelina effect spurs genetic cancer testing "
    },
    {
        "content": "NEW YORK  April 12 Medical researchers call it the \"Angelina Effect \" the surge in demand for genetic testing attributable to movie star Angelina Jolie's public crusade for more aggressive detection of hereditary breast and ovarian cancer.",
        "date": "04142015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "CORRECTED-INSIGHT-Aetna  Cigna balk as Angelina effect spurs genetic cancer testing "
    },
    {
        "content": "NEW YORK  April 12 Medical researchers call it the \"Angelina Effect \" the surge in demand for genetic testing attributable to movie star Angelina Jolie's public crusade for more aggressive detection of hereditary breast and ovarian cancer.",
        "date": "04122015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "INSIGHT-Aetna  Cigna balk as Angelina effect spurs genetic cancer testing "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 11 (Fitch) Fitch Ratings has assigned a 'BBB+' rating to Cigna  Corp's (Cigna) planned issue of up to $900 million senior unsecured notes due  2025. The rating is equivalent to Fitch's ratings on Cigna's currently  outstanding senior notes. Cigna is expected to use issuance proceeds to redeem all outstanding $600  million 2.75% notes due in 2016 and $251 million 8.5% notes due in 2019 with any  remaining proceeds being us",
        "date": "03112015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Fitch Rates Cigna's Senior Debt Issue 'BBB+' "
    },
    {
        "content": "Feb 5    Cigna Corp  which sells individual plans on the Obamacare exchanges created under the national healthcare reform law  said on Thursday that the medical costs and profitability of customers has improved.",
        "date": "02052015",
        "name": "Cigna Corporation",
        "news_type": "topStory",
        "symbol": "CI",
        "title": "Cigna says medical cost ratios of individual plans improved "
    },
    {
        "content": "Health insurer Cigna Corp  reported a better-than-expected quarterly adjusted profit from operations  driven by increased premium revenue and improved management of medical costs.",
        "date": "02052015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna fourth-quarter profit beats Street on higher premium revenue "
    },
    {
        "content": "* Medical care ratio for main unit improves to 81.6 pct from 82.1",
        "date": "02052015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "UPDATE 2-Cigna 4th-qtr profit beats Street on higher premium revenue "
    },
    {
        "content": "Feb 5 Health insurer Cigna Corp reported a 29 percent rise in fourth-quarter profit  driven by increased premium revenue and effective medical cost management.",
        "date": "02052015",
        "name": "Cigna Corporation",
        "news_type": "normal",
        "symbol": "CI",
        "title": "Cigna 4th-qtr profit rises 29 pct due to higher premium revenue "
    }
]