[
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 27 (Fitch) Fitch Ratings expects to assign a 'BB+' rating to Bancolombia's upcoming U.S. dollar subordinated notes. The notes (for an amount to be determined) will pay a fixed interest to be set at the time of the issuance. The notes will mature on 2027  and interest payments will be made semi-annually until maturity. The final rating is contingent on receipt of final documents conforming materially to the preliminar",
        "date": "09272017",
        "name": "BanColombia SA",
        "news_type": "topStory",
        "symbol": "CIB",
        "title": "Fitch Expects to Rate Bancolombia's Subordinated Notes 'BB+' "
    },
    {
        "content": "* Said on Monday Bancolombia and other related entities sold 50 percent of shares in circulation in Tuya to Almacenes Exito for 79.04 billion Colombian pesos ($26.30 million)",
        "date": "11012016",
        "name": "BanColombia SA",
        "news_type": "topStory",
        "symbol": "CIB",
        "title": "BRIEF-Bancolombia sells 50 pct in Tuya to Almacenes Exito "
    },
    {
        "content": "* Said on Monday Bancolombia will merge with its unit Leasing Bancolombia SA Compania de Financiamiento",
        "date": "06212016",
        "name": "BanColombia SA",
        "news_type": "topStory",
        "symbol": "CIB",
        "title": "BRIEF-Bancolombia to merge with its leasing unit "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK/BOGOTA  October 30 (Fitch) On Sept. 11  2015  Bancolombia announced an  agreement to acquire an additional 20% stake in Banco Agromercantil de Guatemala  (BAM) which would bring the bank's share of BAM's equity to 60%. Once the  transaction is approved by regulators in both countries and closed  Bancolombia  would gain control of BAM and consolidate it as a new subsidiary. This  transaction  expected to cost up to USD180 millio",
        "date": "10302015",
        "name": "BanColombia SA",
        "news_type": "topStory",
        "symbol": "CIB",
        "title": "Fitch: BAM Acquisition Should Have No Impact on Bancolombia's Creditworthiness "
    },
    {
        "content": "BOGOTA Bancolombia  Colombia's largest bank by assets  is ready to finance up to $5 billion in infrastructure projects in the Andean country  bank president Carlos Raul Yepes said on Monday.",
        "date": "05252015",
        "name": "BanColombia SA",
        "news_type": "topStory",
        "symbol": "CIB",
        "title": "Bancolombia ready to finance up to $5 billion in infrastructure "
    },
    {
        "content": "BOGOTA  Feb 18 Bancolombia raised its net profits to 1.88 trillion pesos ($778 million) in 2014  a 24 percent jump compared with the year before  on an increase in interest earnings and commissions  Colombia's largest bank by assets said in a statement.",
        "date": "02182015",
        "name": "BanColombia SA",
        "news_type": "topStory",
        "symbol": "CIB",
        "title": "Bancolombia net profit up 24 pct in 2014  flat in Q4 "
    }
]