[
    {
        "content": "* Colony NorthStar Inc qtrly ‍core FFO $0.33 per basic share​",
        "date": "11092017",
        "name": "Colony NorthStar Inc",
        "news_type": "topStory",
        "symbol": "CLNS",
        "title": "BRIEF-Colony NorthStar reports qtrly ‍FFO $0.08 per basic share​ "
    },
    {
        "content": "TEL AVIV Israel's Harel Insurance and Finance Group and U.S. real estate investment trust Colony NorthStar acquired an office building in downtown Los Angeles for $460 million.",
        "date": "10302017",
        "name": "Colony NorthStar Inc",
        "news_type": "topStory",
        "symbol": "CLNS",
        "title": "Israel's Harel  Colony NorthStar buy LA building for $460 million "
    },
    {
        "content": "TEL AVIV  Oct 30 Israel's Harel Insurance and Finance Group and U.S. real estate investment trust Colony NorthStar acquired an office building in downtown Los Angeles for $460 million.",
        "date": "10302017",
        "name": "Colony NorthStar Inc",
        "news_type": "normal",
        "symbol": "CLNS",
        "title": "Israel's Harel  Colony NorthStar buy LA building for $460 mln "
    },
    {
        "content": "Colony Capital  the private equity arm of real estate investment trust Colony NorthStar Inc   is facing hurdles in its talks to buy The Weistein Company because the company is seeking higher bidders  the Wall Street Journal reported  citing people close to the discussions.",
        "date": "10262017",
        "name": "Colony NorthStar Inc",
        "news_type": "topStory",
        "symbol": "CLNS",
        "title": "Colony Capital's bid to acquire Weinstein Co hits snag: WSJ "
    },
    {
        "content": "Oct 25 Colony Capital  the private equity arm of real estate investment trust Colony NorthStar Inc  is facing hurdles in its talks to buy The Weistein Company because the company is seeking higher bidders  the Wall Street Journal reported  citing people close to the discussions.",
        "date": "10262017",
        "name": "Colony NorthStar Inc",
        "news_type": "normal",
        "symbol": "CLNS",
        "title": "Colony Capital's bid to acquire Weinstein Co hits snag -WSJ "
    },
    {
        "content": "* Colony NorthStar Inc announces redemption of 8.875% Series C Cumulative Redeemable Perpetual Preferred Stock Source text for Eikon: Further company coverage:",
        "date": "09132017",
        "name": "Colony NorthStar Inc",
        "news_type": "topStory",
        "symbol": "CLNS",
        "title": "BRIEF-Colony NorthStar announces redemption of 8.875% Series C Preferred Shares "
    },
    {
        "content": "* Colony NorthStar Inc announces partial redemption of 8.25 pct series B cumulative redeemable perpetual preferred stock",
        "date": "09132017",
        "name": "Colony NorthStar Inc",
        "news_type": "normal",
        "symbol": "CLNS",
        "title": "BRIEF-Colony NorthStar announces partial redemption of 8.25 pct series B cumulative redeemable perpetual preferred stock "
    },
    {
        "content": "* Colony Northstar announces pricing of $275 million of 7.125% Series J cumulative redeemable perpetual preferred stock offering",
        "date": "09132017",
        "name": "Colony NorthStar Inc",
        "news_type": "normal",
        "symbol": "CLNS",
        "title": "BRIEF-Colony Northstar announces pricing of $275 million of 7.1 pct Series J cumulative redeemable perpetual preferred stock offering "
    },
    {
        "content": "* Colony NorthStar- ‍commenced offering of shares of series J cumulative redeemable perpetual preferred stock with liquidation preference of $25.00/share​",
        "date": "09132017",
        "name": "Colony NorthStar Inc",
        "news_type": "normal",
        "symbol": "CLNS",
        "title": "BRIEF-Colony NorthStar announces preferred stock offering "
    },
    {
        "content": "NEW YORK Insurance broker Aon Plc  said on Friday it would buy real estate investment management firm The Townsend Group from Colony NorthStar Inc  for $475 million  helping expand its property investment management portfolio.",
        "date": "09012017",
        "name": "Colony NorthStar Inc",
        "news_type": "topStory",
        "symbol": "CLNS",
        "title": "Aon to buy real estate investment firm Townsend from Colony NorthStar "
    },
    {
        "content": "NEW YORK  Sept 1 Insurance broker Aon Plc said on Friday it would buy real estate investment management firm The Townsend Group from Colony NorthStar Inc for $475 million  helping expand its property investment management portfolio.",
        "date": "09012017",
        "name": "Colony NorthStar Inc",
        "news_type": "normal",
        "symbol": "CLNS",
        "title": "UPDATE 1-Aon to buy real estate investment firm Townsend from Colony NorthStar "
    },
    {
        "content": "* Colony NorthStar announces agreement to sell the Townsend Group to Aon",
        "date": "09012017",
        "name": "Colony NorthStar Inc",
        "news_type": "normal",
        "symbol": "CLNS",
        "title": "BRIEF-Colony NorthStar announces agreement to sell the Townsend Group to Aon "
    },
    {
        "content": "* Colony Northstar - related to deal termination under specified circumstances  Northstar I may pay termination fee of either about $21.7 million or abt $43.4 million to Northstar II  CLNS OP​ Source text for Eikon: (http://bit.ly/2wV92GD) Further company coverage:",
        "date": "08282017",
        "name": "Colony NorthStar Inc",
        "news_type": "topStory",
        "symbol": "CLNS",
        "title": "BRIEF-Colony Northstar provides termination fee details - SEC filing "
    },
    {
        "content": "Sept 1 The following bids  mergers  acquisitions and disposals were reported by 2015 GMT on Friday:",
        "date": "09012017",
        "name": "Colony NorthStar Inc",
        "news_type": "normal",
        "symbol": "CLNS",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Colony Northstar  Northstar Real Estate Income Trust and Northstar Real Estate Income II announce creation of Colony Northstar Credit Real Estate Inc​",
        "date": "08282017",
        "name": "Colony NorthStar Inc",
        "news_type": "normal",
        "symbol": "CLNS",
        "title": "BRIEF-Colony Northstar announces creation of Colony Northstar Credit Real Estate "
    },
    {
        "content": "NEW YORK  Sept 1 Insurance broker Aon Plc will buy real estate investment management firm The Townsend Group from Colony NorthStar Inc for $475 million to expand its property investment management portfolio  people familiar with the matter said on Friday.",
        "date": "09012017",
        "name": "Colony NorthStar Inc",
        "news_type": "normal",
        "symbol": "CLNS",
        "title": "Aon to buy real estate investment firm Townsend from Colony NorthStar -sources "
    },
    {
        "content": "* Announces pricing of $300 million of 7.15 pct preferred stock offering",
        "date": "05242017",
        "name": "Colony NorthStar Inc",
        "news_type": "topStory",
        "symbol": "CLNS",
        "title": "BRIEF-Colony Northstar prices 12 mln shares of 7.15 pct series I cumulative redeemable perpetual preferred stock "
    },
    {
        "content": "* Commenced public offering of shares of series I cumulative redeemable perpetual preferred stock with a liquidation preference of $25.00/share Source text for Eikon: Further company coverage:",
        "date": "05242017",
        "name": "Colony NorthStar Inc",
        "news_type": "normal",
        "symbol": "CLNS",
        "title": "BRIEF-Colony Northstar Inc announces preferred stock offering "
    },
    {
        "content": "* Colony Northstar announces first quarter 2017 financial results",
        "date": "05092017",
        "name": "Colony NorthStar Inc",
        "news_type": "topStory",
        "symbol": "CLNS",
        "title": "BRIEF-Colony Northstar Q1 FFO per share $0.17 "
    },
    {
        "content": "BEVERLY HILLS  Calif.  May 2 Ultra-wealthy private equity managers lamented their reputation as 'lousy' corporate profiteers at a plush Beverly Hills hotel on Tuesday  arguing their value to society was greater than the public realized.",
        "date": "05022017",
        "name": "Colony NorthStar Inc",
        "news_type": "normal",
        "symbol": "CLNS",
        "title": "Super-rich private equity stars rue 'lousy' reputation  say they are misunderstood "
    },
    {
        "content": "* Colony Northstar Inc - CEO Albert Tylis' total compensation for 2016 was $14.2 million versus $13.5 million in 2015 - SEC filing",
        "date": "03292017",
        "name": "Colony NorthStar Inc",
        "news_type": "topStory",
        "symbol": "CLNS",
        "title": "BRIEF-Colony Northstar CEO Albert Tylis' total compensation for 2016 $14.2 mln "
    },
    {
        "content": "* Situs selected as loan servicer  facility and security agent to loan portfolio acquired by Colony Northstar Inc  in Ireland",
        "date": "02162017",
        "name": "Colony NorthStar Inc",
        "news_type": "topStory",
        "symbol": "CLNS",
        "title": "BRIEF-Situs to provide loan servicing for loan portfolio acquired by Colony Northstar "
    }
]