[
    {
        "content": "* BRI-CHEM CLOSES EXTENSION AND INCREASE OF ITS SENIOR BANKING FACILITY AND REFINANCING OF ITS SUBORDINATED DEBT",
        "date": "11072017",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "BRIEF-BRI-CHEM AGREES WITH CIBC TO INCREASE ABL FACILITY TO $35 MILLION "
    },
    {
        "content": "* President's Choice Bank -announced a mutual agreement to end its 20-year relationship with CIBC​ Source text for Eikon: Further company coverage:",
        "date": "08162017",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "BRIEF-President's Choice Bank announced mutual agreement to end 20-yr relationship with CIBC​ "
    },
    {
        "content": "TORONTO  June 23 Canadian Imperial Bank of Commerce has completed the $5 billion acquisition of Chicago-based PrivateBancorp  which will help it diversify from its domestic market  it said on Friday.",
        "date": "06232017",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "UPDATE 1-Canada's CIBC completes $5 billion PrivateBancorp buy "
    },
    {
        "content": "* Shareholder vote scheduled for May 12 (Adds details on offer)",
        "date": "05042017",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "UPDATE 3-CIBC sweetens offer for PrivateBancorp with more cash "
    },
    {
        "content": "TORONTO  March 30 Canadian Imperial Bank of Commerce said on Thursday it had raised its takeover offer for PrivateBancorp Inc by 20 percent to about $4.9 billion  after some of the Chicago-based lender's shareholders opposed an initial bid.",
        "date": "03302017",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "UPDATE 5-CIBC raises offer for PrivateBancorp to $4.9 billion "
    },
    {
        "content": "* Amendment to agreement and plan of merger with Canadian Imperial Bank of Commerce (CIBC) revises amount of termination fee to be $198 million - SEC filing",
        "date": "03302017",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "CORRECTED-BRIEF-PrivateBancorp says termination fee in CIBC deal revised to $198 mln "
    },
    {
        "content": "* Privatebancorp Inc - stockholders will receive  upon completion of proposed merger with CIBC  US$24.20 in cash and 0.4176 of a CIBC common share",
        "date": "03302017",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "BRIEF-CIBC  Privatebancorp announce revised merger agreement "
    },
    {
        "content": "* Canadian Imperial Bank Of Commerce - dividend of $1.27 per share for quarter ending April 30  2017  an increase of three cents from previous quarter  Source text for Eikon:  Further company coverage:",
        "date": "02232017",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "BRIEF-CIBC increases dividends to C$1.27 per share "
    },
    {
        "content": "* Q1 earnings per share view c$2.59 -- Thomson Reuters I/B/E/S  Source text for Eikon:  Further company coverage:",
        "date": "02232017",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "BRIEF-CIBC Q1 earnings per share c$3.50 "
    },
    {
        "content": "* CIBC shares down 3 percent  Private Bancorp up 22 percent   (New throughout  adds comments from CEO  analyst  shareholders)",
        "date": "06292016",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "UPDATE 3-Canada's CIBC to pay $3.8 bln for PrivateBancorp  expand in U.S. "
    },
    {
        "content": "* CIBC Mellon says president and ceo  thomas monahan   has decided to retire",
        "date": "05202016",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "BRIEF-CIBC Mellon says president and CEO Thomas Monahan to retire "
    },
    {
        "content": "NAIROBI  Oct 28 Fraudulent withdrawals and other illegal transactions at Imperial Bank amounted to more than 34 billion shillings ($335 million) over a period of 13 years  the bank's receiver said in a lawsuit filed at court.",
        "date": "10282015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "Kenya's Imperial Bank lost $335 mln in fraudulent deals - court papers "
    },
    {
        "content": "TORONTO  Nov 2 The Canadian Imperial Bank of Commerce said on Monday it saw no merit in a lawsuit filed against it by a special purpose vehicle controlled by U.S. private equity firm Cerberus Capital Management.",
        "date": "11022015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "CIBC says Cerberus lawsuit against it lacks merit "
    },
    {
        "content": "NAIROBI  Oct 27 The receiver for Kenya's privately owned Imperial Bank (IBL) found substantial fraud but the bank is still viable and shareholders are considering a proposal to inject capital  the central bank said on Tuesday.",
        "date": "10272015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "UPDATE 1-Fraud found at Kenya's Imperial Bank but still viable - central bank "
    },
    {
        "content": "NEW YORK  Oct 27 Digital Currency Group  a holding firm focused on investing and developing businesses that deal in bitcoin and other cryptocurrencies  has raised funding from some of the biggest  U.S. financial names  founder and chief executive officer Barry Silbert said on Tuesday.",
        "date": "10272015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "Bitcoin firm raises funding from Bain  New York Life  MasterCard "
    },
    {
        "content": "NAIROBI  Oct 27 The receiver for Kenya's privately owned Imperial Bank found \"fraudulent activities of substantial magnitude\" but the bank is still viable and shareholders are considering a proposal to inject capital  the central bank said in a statement on Tuesday.",
        "date": "10272015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "Fraud found at Imperial Bank but still viable -central bank "
    },
    {
        "content": "NAIROBI  Oct 13 Kenya's market regulator  the Capital Markets Authority (CMA)   suspended the listing and trading of Imperial Bank's corporate bond after the lender was put into receivership  the regulators said on Tuesday.",
        "date": "10132015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "Kenya suspends listing and trading of Imperial Bank's bond "
    },
    {
        "content": "* Central bank sees no \"systemic concern\"   (Adds comments by c.bank governor)",
        "date": "10142015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "UPDATE 1-Kenya c.bank will offer \"adequate liquidity\" after Imperial Bank case "
    },
    {
        "content": "NAIROBI  Oct 14 Kenya's central bank on Wednesday said it was ready to provide \"adequate liquidity\" to the country's banking system after a mid-sized lender was put into receivership a day earlier.",
        "date": "10142015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "Kenya central bank will offer \"adequate liquidity\" after Imperial Bank case "
    },
    {
        "content": "TORONTO  Sept 15 Canadian Imperial Bank of Commerce has made two key executive changes within its wholesale banking business as Canada's fifth biggest bank further consolidates under Chief Executive Victor Dodig.",
        "date": "09152015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "UPDATE 1-CIBC makes executive changes in wholesale banking team "
    },
    {
        "content": "TORONTO  Sept 15 Canadian Imperial Bank of Commerce has made two key executive changes within its wholesale banking business as Canada's fifth biggest bank further consolidates under Chief Executive Victor Dodig.",
        "date": "09152015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "CIBC makes executive changes in wholesale banking team "
    },
    {
        "content": "TORONTO  Aug 27 Canadian Imperial Bank of Commerce reported a higher third-quarter profit that topped market estimates on Thursday  helped by growth in its retail and wealth management businesses  and raised its quarterly dividend.",
        "date": "08272015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "UPDATE 1-CIBC third-quarter profit tops estimates  dividend raised "
    },
    {
        "content": "TORONTO  Aug 27 Canadian Imperial Bank of Commerce reported a higher third-quarter profit that topped market estimates on Thursday  helped by growth in its retail and wealth management businesses.",
        "date": "08272015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "CIBC profit tops estimates  dividend raised "
    },
    {
        "content": "China's CITIC Group Corporation is in negotiations to acquire Russell Investments from London Stock Exchange Group Plc  in what is expected to be a roughly $1.8 billion deal  according to people familiar with the matter.",
        "date": "07092015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "CITIC in the lead to buy Russell Investments: sources "
    },
    {
        "content": "* Reports C$25 mln in impaired energy loans   (Adds background on banking stocks; updates share price)",
        "date": "05282015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "UPDATE 3-CIBC reports better-than-expected profit  raises dividend "
    },
    {
        "content": "May 28 Canadian Imperial Bank of Commerce's  quarterly profit more than tripled  boosted by a buoyant Canadian capital market and after a charge in its Caribbean unit a year ago.",
        "date": "05282015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "CIBC's profit triples "
    },
    {
        "content": "Calgary  April 23 Canadian Imperial Bank of Commerce lost an advisory vote on its executive compensation structure on Thursday  in the face of blowback from investors over mega payments to two retired executives.",
        "date": "04232015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "CIBC loses advisory vote on executive compensation at AGM "
    },
    {
        "content": "CALGARY Canadian Imperial Bank of Commerce  is in talks with several U.S. companies on a potential $2 billion wealth-management and private-banking acquisition  its top executive said in an interview.",
        "date": "04232015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "CIBC says it in talks on potential $2 billion U.S. acquisition "
    },
    {
        "content": "TORONTO  April 17 Two of Canada's largest pension funds  shareholders of Canadian Imperial Bank of Commerce  said on Friday they will demonstrate their unhappiness with CIBC's executive pay structure at the lender's annual meeting next week.",
        "date": "04172015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "Two top Canada pension funds to oppose CIBC's executive pay plan "
    },
    {
        "content": "TORONTO  Feb 26 Canada's main stock index rose slightly on Thursday as advances in Toronto Dominion Bank  and Canadian Imperial Bank of Commerce helped offset a drop in the energy sector.",
        "date": "02262015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "CANADA STOCKS-TSX edges higher as TD  CIBC shares overcome energy decline "
    },
    {
        "content": "TORONTO  Feb 26 Canada's main stock index rose slightly on Thursday as advances in Toronto Dominion Bank  and Canadian Imperial Bank of Commerce helped offset a drop in the energy sector.",
        "date": "02262015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "CANADA STOCKS-TSX ends higher as TD  CIBC offset energy fall "
    },
    {
        "content": "TORONTO  Feb 26 Canada's main stock index reached its highest in a week on Thursday as gains in Toronto Dominion Bank and Canadian Imperial Bank of Commerce   following quarterly reports from the two lenders  overcame weakness in the energy sector.",
        "date": "02262015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "CANADA STOCKS-TSX hits one-week high as TD  CIBC climb on results "
    },
    {
        "content": "TORONTO  Feb 26 Canadian Imperial Bank of Commerce  the country's No 5 lender  reported better-than-expected first-quarter earnings on Thursday  helped by strong growth in its wholesale banking business  and unexpectedly raised its dividend.",
        "date": "02262015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "UPDATE 2-Canadian lender CIBC profit beats estimates  eyes U.S. deals "
    },
    {
        "content": "TORONTO  Feb 26 Canada's main stock index opened higher on Thursday as gains in Toronto Dominion Bank and Canadian Imperial Bank of Commerce helped offset weakness in the energy sector.",
        "date": "02262015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "CANADA STOCKS-TSX opens higher as TD  CIBC rise after results "
    },
    {
        "content": "* CIBC CEO says interested in U.S. private banking and asset management acquisitions  but will have to meet strict valuation criteria  Source for Eikon: https://www.cibc.com/ca/investor-relations/quarterly-results.html Further company coverage:    (Reporting By Jeffrey Hodgson)",
        "date": "02262015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "BRIEF-CIBC CEO says interested in U.S. private banking  asset management acquisitions "
    },
    {
        "content": "Feb 26 Canadian Imperial Bank of Commerce  reported better-than-expected first-quarter earnings on Thursday  helped by strong profit growth at its wholesale banking business.",
        "date": "02262015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "Canadian lender CIBC's profit beats estimates "
    },
    {
        "content": "Feb 5 Royal Bank of Canada (RBC) and Canadian Imperial Bank of Commerce (CIBC)  two of Canada's biggest banks  looked at buying U.S. lender Boston Private Bank & Trust Co  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "02062015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "CORRECTED-Canada's RBC  CIBC looked at buying Boston Private Bank - WSJ "
    },
    {
        "content": "Royal Bank of Canada (RBC)  and Canadian Imperial Bank of Commerce (CIBC)   two of Canada's biggest banks  looked at buying U.S. lender Boston Private Bank & Trust Co  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "02052015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "Canada's RBC  CIBC looked at buying Boston Private Bank:  WSJ "
    },
    {
        "content": "Feb 5 Royal Bank of Canada (RBC) and Canadian Imperial Bank of Commerce (CIBC)  two of Canada's biggest banks  looked at buying U.S. lender Boston Private Bank & Trust Co  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "02052015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "normal",
        "symbol": "CM",
        "title": "Canada's RBC  CIBC looked at buying Boston Private Bank - WSJ "
    },
    {
        "content": "TORONTO  Jan 29 Canadian Imperial Bank of Commerce is trimming its workforce as part of a realignment of its resources to help boost efficiency  the country's fifth-biggest lender said on Thursday.",
        "date": "01302015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "CIBC latest Canadian lender to cut jobs  seeks to boost efficiency "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 23 (Fitch) Fitch Ratings has affirmed Canadian Imperial Bank  of Commerce's (CIBC) long- and short-term Issuer Default Ratings (IDRs) at 'AA-'  and 'F1+' respectively.  The Rating Outlook is Stable.  This rating action follows a periodic review of the Canadian Banking sector.   Fitch will publish the main findings of this review in a report 'Canadian Banks:   Nearing a Tipping Point' available at www.fitchratings.com. ",
        "date": "01232015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "Fitch Affirms Canadian Imperial Bank of Commerce's Ratings at 'AA-/F1+'; Outlook Stable "
    },
    {
        "content": "Borrower                Canadian Imperial Bank of Commerce (CIBC)",
        "date": "01212015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "New Issue- CIBC prices 1.0 bln euro 2020 bond "
    },
    {
        "content": "Borrower                Canadian Imperial Bank of Commerce CM Corp",
        "date": "01072015",
        "name": "Canadian Imperial Bank of Commerce",
        "news_type": "topStory",
        "symbol": "CM",
        "title": "New Issue- CIBC prices 500 mln stg 2018 FRN "
    }
]