[
    {
        "content": "* Says recently entered confidential settlement with Comcast  resulting in termination of litigation with Comcast described in co's filings‍​ Source text: (http://bit.ly/2zQJryd) Further company coverage:",
        "date": "11172017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Players Network enters confidential settlement with Comcast "
    },
    {
        "content": "Comcast Corp and Verizon Communications Inc have both expressed interest in acquiring a significant part of Rupert Murdoch's Twenty-First Century Fox Inc's assets  two people familiar with the situation told Reuters on Thursday.",
        "date": "11172017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast  Verizon approached Twenty-First Century Fox to buy some assets: sources "
    },
    {
        "content": "Nov 16 Comcast Corp and Verizon Communications Inc have both expressed interest in acquiring a significant part of Rupert Murdoch's Twenty-First Century Fox Inc's assets  two people familiar with the situation told Reuters on Thursday.",
        "date": "11172017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 4-Comcast  Verizon approached Twenty-First Century Fox to buy some assets -sources "
    },
    {
        "content": "* Comcast and Sony partner to bring xfinity TV partner app to sony smart TVs",
        "date": "11142017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast and Sony partner to bring xfinity TV partner app to Sony smart TVs "
    },
    {
        "content": "Nov 16 Comcast Corp has approached Twenty-First Century Fox Inc and expressed interest in buying some major assets  CNBC reported on Thursday  citing sources.",
        "date": "11162017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "REFILE-Comcast approaches Twenty-First Century Fox for buying some assets - CNBC "
    },
    {
        "content": "* Comcast is interested in same set of assets that Disney approached Fox about - CNBC  citing sources‍​ Source text: http://cnb.cx/2zO4KQW Further company coverage:",
        "date": "11162017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast interested in same set of assets that Disney approached Fox about - CNBC "
    },
    {
        "content": "* Comcast has approached 21st Century Fox to express acquisition interest- CNBC  citing DJ‍​",
        "date": "11162017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast has approached Twenty-First Century Fox to express acquisition interest- CNBC  citing DJ‍​ "
    },
    {
        "content": "Mattel Inc has rebuffed Hasbro Inc's latest takeover approach  people familiar with the matter said on Wednesday  casting uncertainty over the potential combination of the world's two largest toy companies.",
        "date": "11162017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Exclusive: Mattel snubs Hasbro's latest acquisition approach - sources "
    },
    {
        "content": "* Nielsen and Comcast agree to incorporate set-top box viewing data into local TV measurement Source text for Eikon: Further company coverage:",
        "date": "11092017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Nielsen and Comcast agree to incorporate set-top box viewing data into local TV measurement "
    },
    {
        "content": "Nov 6 Rupert Murdoch's Twenty-First Century Fox has held talks to sell most of its film and television assets to Walt Disney Co  which would gain new programming and expand its international reach  CNBC reported on Monday.",
        "date": "11062017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 5-Fox held talks to sell most of company to Disney -CNBC "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Comcast is earning its peacock feathers. The $170 billion U.S. media firm was early and careful expanding beyond cable. Two examples are its purchase of NBC Universal - originally with its peacock logo - and a recently launched wireless phone service. Comcast stock has trounced the shares of Verizon Communications and AT&T. The company led by Brian Roberts has even pulled away from Walt Disney's market value this year.",
        "date": "10262017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Breakingviews - Comcast earns its peacock feathers "
    },
    {
        "content": "NEW YORK Comcast Corp  reported slightly lower-than-expected quarterly revenue on Thursday and said it lost video subscribers  while analysts raised questions about growth prospects for the No. 1 U.S. cable operator's internet business.",
        "date": "10262017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast quarterly revenue misses estimates "
    },
    {
        "content": "NEW YORK  Oct 26 Comcast Corp reported slightly lower-than-expected quarterly revenue on Thursday and said it lost video subscribers  while analysts raised questions about growth prospects for the No. 1 U.S. cable operator's internet business.",
        "date": "10262017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 3-Comcast quarterly revenue misses estimates "
    },
    {
        "content": "Charter Communications Inc's  shares sank on Thursday after it lost twice as many pay TV subscribers as expected  in the face of competition from Netflix and Hulu.",
        "date": "10262017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Charter bleeds pay TV customers as Netflix  Hulu come knocking "
    },
    {
        "content": "* Comcast Corp - Qtrly earnings per share $0.55; Qtrly adjusted. earnings per share $0.52; Qtrly revenue $20.98 billion versus $21.32 billion",
        "date": "10262017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast Corp reports Q3 adjusted earnings of $0.52 per share "
    },
    {
        "content": "NEW YORK  Oct 26 Comcast Corp reported quarterly profit that topped Wall Street estimates on Thursday as the No. 1 U.S. cable operator said it added broadband and home security customers even though it lost video subscribers.",
        "date": "10262017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast quarterly profit tops estimates as broadband subscribers grow "
    },
    {
        "content": "* Madison Reed - announced it closed a $25 million series financing round led by Comcast Ventures​ Source text for Eikon: Further company coverage: (Bangalore.newsroom@thomsonreuters.com)",
        "date": "10202017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Madison Reed - announced it closed a $25 million series financing round led by Comcast Ventures​ "
    },
    {
        "content": "* Comcast and NBCUniversal Media announce early tender results for exchange offer",
        "date": "10182017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast and NBCUniversal announce early tender results for exchange offer "
    },
    {
        "content": "* Comcast and NBCUniversal Media announce debt exchange offer",
        "date": "10032017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast and NBCUniversal Media announce debt exchange offer "
    },
    {
        "content": "* Comcast Corp - Co  ‍LG Electronics USA partner to provide Xfinity customers access to their Xfinity TV subscription on LG TVs beginning in 2018​ Source text for Eikon: Further company coverage:",
        "date": "09252017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast  ‍LG Electronics partner to provide customers Xfinity access on LG TVs "
    },
    {
        "content": "* Comcast Corp - ‍comcast and Google announce nationwide launch of YouTube on xFinity X1​ Source text for Eikon: Further company coverage:",
        "date": "09122017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast Corp says co and Google announce nationwide launch of YouTube on Xfinity X1​ "
    },
    {
        "content": "NEW YORK Comcast Corp  the largest U.S. cable provider  on Wednesday launched a new business application and platform with faster connections in its push to boost sales to commercial customers as more consumers drop traditional cable services.",
        "date": "09132017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast to launch new platform in push for business customers "
    },
    {
        "content": "NEW YORK  Sept 13 Comcast Corp  the largest U.S. cable provider  on Wednesday launched a new business application and platform with faster connections in its push to boost sales to commercial customers as more consumers drop traditional cable services.",
        "date": "09132017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "CORRECTED-Comcast to launch new platform in push for business customers "
    },
    {
        "content": "Shares of Walt Disney Co  and Comcast Corp  tumbled on Thursday after Disney warned of stagnant earnings and No. 1 cable operator Comcast forecast more subscriber losses. | Video ",
        "date": "09082017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Disney  Comcast shares fall on disappointing forecasts "
    },
    {
        "content": "* Comcast and CBS Sports Digital partner to launch fantasy football experience on xfinity x1 Source text for Eikon: Further company coverage:",
        "date": "09072017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast and CBS Sports Digital partner to launch fantasy football experience on Xfinity X1 "
    },
    {
        "content": "Sept 7 Shares of Walt Disney Co and Comcast Corp tumbled on Thursday after Disney warned of stagnant earnings and No. 1 cable operator Comcast forecast more subscriber losses.",
        "date": "09072017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 3-Disney   Comcast shares fall on disappointing forecasts "
    },
    {
        "content": "* Dow down 0.2 pct  S&P down 0.05 pct  Nasdaq up 0.05 pct (Updates to late afternoon)",
        "date": "09072017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "US STOCKS-Wall St slips as media stocks  Hurricane Irma weigh "
    },
    {
        "content": "* Comcast expects to lose 100 000 to 150 000 video subscribers in quarter due to competition  storms - official",
        "date": "09072017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast expects to lose 100 000 to 150 000 video subscribers in quarter due to competition  storms - official "
    },
    {
        "content": "NEW YORK Comcast Corp may be best known as a cable company  but it is banking on remote-controlled door locks and cameras as well as other \"smart-home\" offerings to accelerate its growing home security business.",
        "date": "08292017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast builds out 'smart home' strategy as cable shrinks "
    },
    {
        "content": "NEW YORK  Aug 29 Comcast Corp may be best known as a cable company  but it is banking on remote-controlled door locks and cameras as well as other \"smart-home\" offerings to accelerate its growing home security business.",
        "date": "08292017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "RPT-Comcast builds out \"smart home\" strategy as cable shrinks "
    },
    {
        "content": "NEW YORK  Aug 29 Comcast Corp may be best known as a cable company  but it is banking on remote-controlled door locks and cameras as well as other \"smart-home\" offerings to accelerate its growing home security business.",
        "date": "08292017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast builds out \"smart home\" strategy as cable shrinks "
    },
    {
        "content": "* Tiger global management ups share stake in Comcast Corp by 39.4 percent to 7.3 million class A shares - SEC Filing",
        "date": "08142017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Tiger Global Management ups share stake in Comcast Corp by 39.4 pct to 7.3 mln class A shares "
    },
    {
        "content": "* FX networks partners with Comcast to launch a new television service on September 5th",
        "date": "08072017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast partners with FX Networks to launch new television service "
    },
    {
        "content": "Five of the largest U.S. pay-TV providers posted subscriber losses during the second quarter as younger viewers increasingly cut the cord and moved to \"skinny bundles \" or cheaper packages with select channels  and Internet streaming services like Netflix or Hulu.",
        "date": "07282017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Factbox: More subscribers abandon pay-TV in the second quarter "
    },
    {
        "content": "July 25 Walt Disney Co's ABC News launched a partnership on Tuesday with ATTN:  a video news site focused on younger audiences  to co-produce videos for social media including Facebook Inc's Instagram and for Twitter Inc.",
        "date": "07252017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-ABC News to target millennials with social video partnership "
    },
    {
        "content": "July 25 Walt Disney Co's ABC News on Tuesday launched a partnership with millennial-focused video news site ATTN: to co-produce videos for social media including Facebook Inc's Instagram and for Twitter Inc.",
        "date": "07252017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "ABC News to target millennials with social video partnership "
    },
    {
        "content": "NEW YORK  July 27 Comcast Corp on Thursday reported quarterly results that topped analysts' estimates on higher revenue in its filmed entertainment and theme parks businesses  even as the No. 1 U.S. cable operator lost more video subscribers.",
        "date": "07272017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Comcast 2nd-qtr results top estimates on film  theme parks growth "
    },
    {
        "content": "* Q2 revenue $21.2 billion versus I/B/E/S view $20.86 billion",
        "date": "07272017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast reports Q2 earnings per share $0.52 "
    },
    {
        "content": "NEW YORK  July 27 Comcast Corp's quarterly results topped Wall Street analysts' estimates on higher revenue in its filmed entertainment and theme parks businesses  even as the No. 1 U.S. cable operator lost video subscribers.",
        "date": "07272017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast results top estimates on film  theme parks growth "
    },
    {
        "content": "* Sets quarterly dividend of $0.1575 per share Source text for Eikon: Further company coverage:",
        "date": "07272017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast sets quarterly dividend of $0.1575 per share "
    },
    {
        "content": "NEW YORK  July 14 Sprint Corp said on Friday that it was launching new leasing options aimed at price-sensitive customers who want to upgrade their phones more often  the carrier’s latest effort to lure subscribers in an oversaturated market for wireless service.",
        "date": "07142017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Sprint launches new leasing options for cost-conscious consumers "
    },
    {
        "content": "July 6 Dish Network Corp Chief Executive Charlie Ergen and Amazon.com Inc head Jeff Bezos have discussed a partnership to enter the wireless business  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "07062017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Dish  Amazon chiefs discuss wireless partnership - WSJ "
    },
    {
        "content": "U.S. wireless carrier Sprint Corp is in talks with Charter Communications Inc and Comcast Corp about a partnership to boost the two U.S. cable companies' wireless offerings  according to sources familiar with the matter. | Video ",
        "date": "06272017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Charter  Comcast explore wireless partnership with Sprint: sources "
    },
    {
        "content": "June 27 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "06272017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "PRESS DIGEST- Wall Street Journal - June 27 "
    },
    {
        "content": "June 26 U.S. wireless carrier Sprint Corp is in talks with Charter Communications Inc and Comcast Corp about a partnership to boost the two U.S. cable companies' wireless offerings  according to sources familiar with the matter.",
        "date": "06272017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Charter  Comcast explore wireless partnership with Sprint-sources "
    },
    {
        "content": "* Co and AMC announced new upgrade option available initially to Xfinity TV customers offering an on demand premium expression of network Source text for Eikon: Further company coverage:",
        "date": "06292017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast corp and AMC announces new upgrade option available initially to Xfinity TV customers "
    },
    {
        "content": "June 26 Sprint Corp is in exclusive talks with Charter Communications Inc and Comcast Corp to explore a deal that could boost the cable companies' wireless service  The Wall Street Journal reported  citing people familiar with the matter.",
        "date": "06272017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "REFILE-Sprint in exclusive talks with Charter  Comcast on wireless deal -WSJ "
    },
    {
        "content": "LOS ANGELES  June 29 AMC Networks Inc on Thursday will release a $5-a-month subscription option designed for pay TV customers who want commercial-free versions of shows such as hit zombie drama \"The Walking Dead \" company officials said.",
        "date": "06292017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "AMC offers ad-free subscription for Comcast TV customers "
    },
    {
        "content": "BRUSSELS EU antitrust regulators will investigate whether Nike   Comcast's  Universal Studios and Hello Kitty owner Sanrio  illegally block some cross-border sales or ban certain online retailers from selling their products.",
        "date": "06142017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Nike  Sanrio  Universal Studios face EU probe over online sales "
    },
    {
        "content": "* Follows on heels of probe into consumer electronics makers (Adds Nike comment  no immediate response from Universal Studios and Sanrio)",
        "date": "06142017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 3-Nike  Sanrio  Universal Studios face EU probe over online sales "
    },
    {
        "content": "* Says ‍on June 12  received recommendation of administrative law judge ('ALJ') of International Trade Commission​",
        "date": "06132017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Tivo receives recommendation of administrative law judge of International Trade Commission​ "
    },
    {
        "content": "BRUSSELS  June 14 EU antitrust regulators opened an investigation on Wednesday into U.S. footwear maker Nike   Comcast's Universal Studios and Hello Kitty owner Sanrio to see if the companies are illegally blocking online sales in the bloc.",
        "date": "06142017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "EU to investigate Nike  Sanrio  Universal Studios over licensing practices "
    },
    {
        "content": "* Comcast - Shareholder proposal to prepare annual report on lobbying activities was not approved at shareholder meeting - SEC filing Source text: (http://bit.ly/2rs6tFR) Further company coverage:",
        "date": "06132017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast's shareholders reject proposal to prepare annual report on lobbying activities "
    },
    {
        "content": "* Comcast Corporation announces preliminary results of 2017 Annual Meeting of Shareholders",
        "date": "06082017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast says shareholders elected all nominees to Board at 2017 Annual Meeting "
    },
    {
        "content": "* Plume Design Inc says existing investors also participated in Plume's financing round  bringing total equity funding in co to over $63 million",
        "date": "06062017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Plume Design says it has secured $37.5 million funding "
    },
    {
        "content": "* Tivo - on may 26  co received final initial determination by administrative law judge in co's U.S. ITC case versus various respondents  including Comcast",
        "date": "05302017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-TiVo  on May 26  received final initial determination by administrative law judge in co's U.S. ITC case vs various respondents  including Comcast "
    },
    {
        "content": "* Comcast increases internet speeds for California customers at no additional cost",
        "date": "05222017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast increases internet speeds for California customers "
    },
    {
        "content": "NEW YORK  May 18 T-Mobile US Inc would benefit from greater scale in the industry if it were to combine with rival Sprint Corp   the chief financial officer of the No. 3 wireless carrier said at a conference on Thursday.",
        "date": "05182017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "T-Mobile sees benefits in merger with Sprint -CFO "
    },
    {
        "content": "* Cuts share stake in Alibaba to 4.75 million ADRs from 5.3 million ADRs - SEC filing",
        "date": "05152017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Tiger Global Management cuts share stake in Alibaba  doubles share stake in Comcast "
    },
    {
        "content": "* Comcast names John Keller regional vice president for the Twin Cities region Source text for Eikon: Further company coverage:",
        "date": "05152017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast names John Keller regional vice president for the Twin Cities region "
    },
    {
        "content": "* Sets quarterly dividend of $0.1575 per share Source text for Eikon: Further company coverage:",
        "date": "05102017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast sets quarterly dividend of $0.1575 per share "
    },
    {
        "content": "May 8 Comcast Corp and Charter Communications Inc announced a wireless partnership on Monday as they prepare to enter the highly competitive and oversaturated market for mobile service in the United States.",
        "date": "05082017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast  Charter announce wireless partnership "
    },
    {
        "content": "May 8 Comcast Corp and Charter Communications Inc on Monday announced a wireless partnership  as the cable providers seek to add more services in a bid to reduce customer churn.",
        "date": "05082017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-Comcast  Charter announce wireless partnership "
    },
    {
        "content": "* Comcast and Charter to explore operational efficiencies to speed entry into the wireless market",
        "date": "05082017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast and Charter to explore operational efficiencies to speed entry into the wireless market "
    },
    {
        "content": "NEW YORK  May 8 Comcast Corp launched a new cloud-based service on Monday that allows users to control and monitor their Wi-Fi usage as the largest cable provider in the U.S. looks for ways to boost consumer loyalty in its broadband business.",
        "date": "05082017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast launches new WiFi service as connected devices grow "
    },
    {
        "content": "Comcast Corp and Charter Communications Inc will announce a wireless partnership on Monday  according to a source familiar with the matter  as the cable providers prepare to enter a highly competitive and oversaturated market for mobile service in the United States.",
        "date": "05082017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast  Charter to announce wireless partnership on Monday: source "
    },
    {
        "content": "May 7 Comcast Corp and Charter Communications Inc will announce a wireless partnership on Monday  according to a source familiar with the matter  as the cable providers prepare to enter a highly competitive and oversaturated market for mobile service in the United States.",
        "date": "05082017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 3-Comcast  Charter to announce wireless partnership on Monday -source "
    },
    {
        "content": "May 7 Comcast Corp and Charter Communications Inc may announce a wireless partnership shortly  according to a report from the Wall Street Journal on Sunday.",
        "date": "05082017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast and Charter to announce wireless partnership shortly -WSJ "
    },
    {
        "content": "* Comcast Corporation statement on the spectrum it sold and purchased in the FCC’s broadcast incentive auction",
        "date": "04272017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast statement on the spectrum it sold and purchased in the FCC’s broadcast incentive auction "
    },
    {
        "content": "NEW YORK Comcast Corp's  quarterly profit topped estimates on strong growth in cable and internet subscribers and hits such as \"Fifty Shades Darker\" and \"Get Out\" boosted movie revenue  the No. 1 U.S. cable operator said on Thursday.",
        "date": "04272017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast profit tops views on subscriber growth  movie hits "
    },
    {
        "content": "NEW YORK  April 27 Comcast Corp's quarterly profit topped estimates on strong growth in cable and internet subscribers and hits such as \"Fifty Shades Darker\" and \"Get Out\" boosted movie revenue  the No. 1 U.S. cable operator said on Thursday.",
        "date": "04272017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 4-Comcast profit tops views on subscriber growth  movie hits "
    },
    {
        "content": "* Q1 revenue from nbcuniversal $7.87 billion versus $6.86 billion",
        "date": "04272017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast Q1 EPS $0.53 "
    },
    {
        "content": "NEW YORK  April 27 Comcast Corp quarterly profit topped estimates as the No. 1 U.S. cable operator added video subscribers  and movies such as \"Fifty Shades Darker\" and \"Get Out\" drove an increase in filmed entertainment revenue.",
        "date": "04272017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast profit tops estimates on video subscribers  film success "
    },
    {
        "content": "April 20 Verizon Communications Inc on Thursday reported its first-ever quarterly loss of subscribers  even as it offered an unlimited data plan  raising questions on whether the No. 1 U.S. wireless carrier may need a larger acquisition than Yahoo to diversify its business.",
        "date": "04202017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 4-Verizon profit  revenue miss Wall Street view as subscribers dash "
    },
    {
        "content": "NEW YORK  April 13 The U.S. Federal Communications Commission said on Thursday that T-Mobile US Inc   Comcast Corp  Dish Network Corp and U.S. Cellular Corp were among the largest buyers of spectrum in an $19.8 billion broadcast airwaves auction.",
        "date": "04132017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "REFILE-T-Mobile  Comcast  Dish acquire spectrum in airwaves auction -FCC "
    },
    {
        "content": "NEW YORK  April 13 T-Mobile US Inc bid $8 billion and Dish Network Corp $6.2 billion to win the bulk of broadcast airwaves spectrum for sale in a government auction  the U.S. Federal Communications Commission said on Thursday.",
        "date": "04132017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 3-T-Mobile  Dish bid combined $14 bln in U.S. airwaves auction -FCC "
    },
    {
        "content": "* Comcast said to plan online rival to Netflix using hit NBC shows- Bloomberg  citing sources Source text : https://bloom.bg/2oZOtT5 Further company coverage:",
        "date": "04102017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast planning online rival to Netflix using hit NBC shows- Bloomberg "
    },
    {
        "content": "* Largest winner in U.S. wireless spectrum auction with $8 billion bid; Comcast bid $1.7 billion; Verizon did not bid - FCC",
        "date": "04132017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-T-Mobile largest winner in US wireless spectrum auction-FCC "
    },
    {
        "content": "NEW YORK The U.S. Federal Communications Commission may announce the winners of the government's $19.8 billion spectrum auction as early as Thursday  industry officials told Reuters.",
        "date": "04132017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "FCC could announce spectrum results as early as Thursday: industry "
    },
    {
        "content": "NEW YORK Comcast Corp  on Thursday unveiled a wireless service with an unlimited data plan  making it the first major U.S. cable provider to enter the highly competitive wireless market. | Video ",
        "date": "04072017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast enters U.S. wireless business with unlimited data plans "
    },
    {
        "content": "NEW YORK  April 6 Comcast Corp on Thursday unveiled a wireless service with an unlimited data plan  making it the first major U.S. cable provider to enter the highly competitive wireless market.",
        "date": "04062017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "UPDATE 3-Comcast enters U.S. wireless business with unlimited data plans "
    },
    {
        "content": "NEW YORK  April 13 The U.S. Federal Communications Commission may announce the winners of the government's $19.8 billion spectrum auction as early as Thursday  industry officials told Reuters.",
        "date": "04132017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "FCC could announce spectrum results as early as Thursday -industry "
    },
    {
        "content": "NEW YORK  April 6 Comcast Corp said on Thursday it is launching a new wireless service with an unlimited data plan  making it the first major U.S. cable provider to enter into the highly competitive wireless market  as it faces pressure in its core business.",
        "date": "04062017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast goes into U.S. wireless business with unlimited data plans "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 03 (Fitch) Fitch Ratings has affirmed the 'A-' Issuer Default Ratings (IDRs) assigned to Comcast Corporation (Comcast) and the wholly owned subsidiaries included in its cross-guaranty structure.  Fitch has also affirmed the 'A-' IDR assigned to NBCUniversal Enterprise  Inc. (NBCUniversal Enterprise) and to NBCUniversal Media  LLC (NBCUniversal).  The Rating Outlook on all of these ratings is Stable.  As of Dec. 31  2016  ",
        "date": "04032017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Fitch Affirms Comcast's IDR at 'A-'; Outlook Stable "
    },
    {
        "content": "WASHINGTON Comcast Corp  Verizon Communications Inc and AT&T Inc said Friday they would not sell customers’ individual internet browsing information  days after the U.S. Congress approved legislation reversing Obama administration era internet privacy rules.",
        "date": "03312017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Major internet providers say will not sell customer browsing histories "
    },
    {
        "content": "March 29 Comcast Corp’s NBCUniversal is pacing ahead in the amount of advertising inventory it has sold for next February’s Winter Olympics compared with the same time four years ago  NBC Sports executives said on Wednesday.",
        "date": "03292017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "NBCUniversal slightly ahead of Sochi for 2018 Winter Olympics ad sales "
    },
    {
        "content": "March 28 The decision by the U.S. Congress to repeal rules that limit how internet service providers can use customer data has generated renewed interest in an old internet technology: virtual private networks  or VPNs.",
        "date": "03292017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Vote to repeal U.S. broadband privacy rules sparks interest in VPNs "
    },
    {
        "content": "March 28 The vote by the U.S. Congress to repeal rules that limit how internet service providers can use customer data has generated renewed interest in an old internet technology: virtual private networks  or VPNs.",
        "date": "03292017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "RPT-UPDATE 1-Vote to repeal U.S. broadband privacy rules sparks interest in VPNs "
    },
    {
        "content": "WASHINGTON The U.S. House voted on Tuesday 215-205 to repeal regulations requiring internet service providers to do more to protect customers' privacy than websites like Alphabet Inc's Google or Facebook Inc. | Video ",
        "date": "03292017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Congress sends White House repeal of broadband privacy rules "
    },
    {
        "content": "March 28 The vote by the U.S. Congress to repeal rules that limit how internet service providers can use customer data has generated renewed interest in an old internet technology: virtual private networks  or VPNs.",
        "date": "03292017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Vote to repeal U.S. broadband privacy rules sparks interest in VPNs "
    },
    {
        "content": " (This March 27 story corrects second paragraph to make clear ESPN is not an add-on option but part of regular offerings)",
        "date": "03282017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast to expand streaming service amid cord-cutting trend "
    },
    {
        "content": "WASHINGTON The White House said on Tuesday that the Trump administration strongly supports a bill to repeal regulations requiring internet service providers to do more to protect customers' privacy than websites like Alphabet Inc's Google or Facebook Inc.",
        "date": "03282017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "White House backs repeal of broadband privacy rules "
    },
    {
        "content": "NEW YORK  March 27 Comcast Corp is planning to rebrand and expand a streaming video option for broadband subscribers who do not want to pay for a traditional cable package  sources told Reuters on Monday.",
        "date": "03282017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "CORRECTED-Comcast to expand streaming service amid cord-cutting trend "
    },
    {
        "content": "WASHINGTON  March 23 The U.S. Senate on Thursday voted 50 to 48 to repeal regulations requiring internet service providers to do more to protect customers' privacy than websites like Alphabet Inc's Google or Facebook Inc.",
        "date": "03232017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "U.S. Senate votes to overturn Obama broadband privacy rules "
    },
    {
        "content": "* Comcast increases internet speeds for many Kansas City area customers at no additional cost  Source text for Eikon:  Further company coverage:",
        "date": "03202017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast increases internet speeds for many Kansas city area customers "
    },
    {
        "content": "* Comcast corporation announces leadership transition at comcast cable",
        "date": "03202017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast Corp says Dave Watson to become CEO of Comcast Cable "
    },
    {
        "content": "* Promoted Kathy Zachem to executive vice president  regulatory and state legislative affairs  Source text for Eikon: Further company coverage:",
        "date": "03152017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast promotes Kathy Zachem to executive vice president "
    },
    {
        "content": "* Bunker Labs and Comcast NBCuniversal extend partnership to help grow military-led startups   Further company coverage:",
        "date": "03102017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Bunker Labs  Comcast NBCuniversal extend partnership "
    },
    {
        "content": "March 9 Conde Nast is joining with Comcast Corp's NBCUniversal and Vox Media to package their digital inventory for sale to advertisers  the companies announced Thursday.",
        "date": "03092017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Conde Nast to package its digital ad inventory with NBCUniversal and Vox Media "
    },
    {
        "content": "* Crius energy trust- crius energy  llc  comcast entered into 5-year strategic deal to jointly offer integrated energy platform to service providers in u.s.  Source text for Eikon:  Further company coverage:",
        "date": "03062017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Crius Energy says entered into 5-year strategic deal with Comcast to jointly offer integrated energy platform to service providers in U.S. "
    },
    {
        "content": "* Comcast's NBC Universal invested in Snap during IPO-CNBC  citing source",
        "date": "03032017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast's NBC Universal invested in Snap during IPO- CNBC  citing source "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - With Harry Potter's help  Comcast can conjure up growth in sleepy Japan. The biggest U.S. cable operator is paying 255 billion yen ($2.3 billion) to buy out Goldman Sachs and other partners in Universal Studios Japan. The Osaka theme park's success  thanks partly to the boy wizard  highlights a part of the economy where domestic consumption growth is no illusion.",
        "date": "03012017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Harry Potter conjures Japanese growth for Comcast "
    },
    {
        "content": "NEW YORK  March 1 U.S. regulators on Wednesday blocked some Obama administration rules on the eve of implementation  regulations that would have subjected broadband providers to stricter scrutiny than web sites face to protect customers' private data.",
        "date": "03012017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-U.S. FCC blocks stricter broadband privacy rules from taking effect "
    },
    {
        "content": "NEW YORK The U.S. Federal Communications Commission on Wednesday blocked some Obama administration rules approved last year that would have subjected broadband providers to stricter scrutiny than websites  a victory for internet providers such as AT&T Inc  Comcast Corp and Verizon Communications Inc .",
        "date": "03012017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-U.S. FCC blocks stricter broadband privacy rules from taking effect "
    },
    {
        "content": "NEW YORK  March 1 The U.S. Federal Communications Commission on Wednesday blocked some Obama administration rules approved last year that would have subjected broadband providers to stricter scrutiny than websites  a victory for internet providers such as AT&T Inc   Comcast Corp and Verizon Communications Inc  .",
        "date": "03012017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "U.S. FCC blocks stricter broadband privacy rules from taking effect "
    },
    {
        "content": "* Comcast Corp and Google says deal that will launch YouTube App on Xfinity X1 across country later this year  Source text for Eikon: Further company coverage:",
        "date": "02272017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast to launch YouTube on Xfinity X1 "
    },
    {
        "content": "* Asuka nakahara was appointed to board  effective February 24  2017",
        "date": "02232017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast Asuka Nakahara was appointed to Comcast board "
    },
    {
        "content": "Comcast Corp  said on Tuesday it would buy the 49 percent it does not already own in Universal Studios Japan (USJ) for 254.8 billion yen ($2.27 billion) as the No. 1 U.S. cable operator seeks to expand its Asian theme parks business.",
        "date": "02282017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast to buy remaining 49 percent stake in Universal Studios Japan "
    },
    {
        "content": "Feb 28 Comcast Corp said on Tuesday it would buy the 49 percent it does not already own in Universal Studios Japan (USJ) for 254.8 billion yen ($2.27 billion) as the No. 1 U.S. cable operator seeks to expand its Asian theme parks business.",
        "date": "02282017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Comcast to buy remaining 49 pct stake in Universal Studios Japan "
    },
    {
        "content": "Feb 28 U.S. cable and media company Comcast Corp  said on Tuesday it would buy the 49 percent it does not already own in Universal Studios Japan (USJ) in a deal valued at 254.8 billion yen ($2.27 billion).",
        "date": "02282017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast to buy remaining 49 pct stake in Universal Studios Japan "
    },
    {
        "content": "* Comcast NBCUniversal to acquire remaining 49 pct stake in Universal Studios Japan",
        "date": "02282017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast NBCUniversal to buy remaining 49 pct stake in Universal Studios Japan "
    },
    {
        "content": "* Comcast promotes Daniel C. Murdock to Senior Vice President  Chief Accounting Officer  and Controller",
        "date": "02152017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast names Daniel Murdock Chief Accounting Officer "
    },
    {
        "content": "NBCUniversal  the U.S. media conglomerate owned by Comcast Corp   is in the final stage of talks to buy a 25 percent stake in European broadcaster Euronews  a source close to the Euronews management told Reuters on Wednesday.",
        "date": "02152017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast's NBC in talks to buy 25 percent stake in Euronews: source "
    },
    {
        "content": "* NBCU to buy Euronews stake through reserved shares sale-source",
        "date": "02152017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-Comcast's NBC in talks to buy 25 pct stake in Euronews -source "
    },
    {
        "content": "WASHINGTON  Feb 10 The U.S. Securities and Exchange Commission said on Friday it had filed civil securities fraud charges against five Chinese citizens for alleged insider trading ahead of the April 2016 acquisition of DreamWorks Animation SKG Inc by Comcast Corp.",
        "date": "02102017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "U.S. regulator charges China citizens over Comcast-Dreamworks trades "
    },
    {
        "content": "WASHINGTON  Feb 3 The U.S. Federal Communications Commission said on Friday it was closing inquiries into sponsored data programs and TV services offered by AT&T Inc  Verizon Communications Inc  Comcast Corp   T-Mobile USA Inc undertaken during the Obama administration without taking any action.",
        "date": "02032017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "U.S. FCC closes 'sponsored data' inquiries "
    },
    {
        "content": "Comcast Corp  on Thursday reported quarterly profit and revenue that topped estimates as the No. 1 U.S. cable operator posted higher sales from its NBCUniversal cable channels and broadcast networks.",
        "date": "01262017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast profit  subscriber additions top estimates; stock up "
    },
    {
        "content": "* Effective Jan. 25  board adopted amendments to amended and restated by-laws  primarily to implement proxy access - SEC filing",
        "date": "01272017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast says board adopted amendments to amended and restated by-laws effective Jan. 25 "
    },
    {
        "content": "Jan 26 Comcast Corp on Thursday reported quarterly profit and revenue that topped estimates as the No. 1 U.S. cable operator posted higher sales from its NBCUniversal cable channels and broadcast networks.",
        "date": "01262017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Comcast profit  subscriber additions top estimates; stock up "
    },
    {
        "content": "* Q4 revenue for Comcast Cable Communications $12.84 billion versus $12 billion",
        "date": "01262017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast reports Q4 earnings $0.95 per share "
    },
    {
        "content": "* Q4 earnings per share view $0.87 -- Thomson Reuters I/B/E/S",
        "date": "01262017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast increases share repurchase authorization to $12 bln "
    },
    {
        "content": "NEW YORK  Jan 26 Comcast Corp  said its quarterly profit and revenue topped estimates as the nation's largest cable operator reported higher sales from its NBCUniversal cable channels and broadcast networks.",
        "date": "01262017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast's quarterly profit tops estimates as NBCUniversal revenues rise "
    },
    {
        "content": "WASHINGTON  Jan 20 Outgoing U.S. Federal Communications Commission Chairman Tom Wheeler warned Republicans against dismantling the Obama administration's landmark \"net neutrality\" protections that bar internet service providers from slowing consumer access to web content.",
        "date": "01202017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Outgoing FCC chair warns against overturning net neutrality "
    },
    {
        "content": "Jan 18 Comcast Corp's NBCUniversal is shutting down its Esquire Network cable channel  one month after it was dropped by DirecTV  and will re-launch it this spring as a digital-only brand  the company said on Wednesday.",
        "date": "01182017",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "NBCU shutting cable's Esquire Network  re-launching as digital "
    },
    {
        "content": "Comcast Corp's  MSNBC unit said on Thursday that Fox News veteran Greta Van Susteren had joined the company and will host a new program called \"For the Record\".",
        "date": "01052017",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Fox News anchor Greta Van Susteren joins MSNBC "
    },
    {
        "content": "Comcast Corp's NBC Universal said it has partnered with the International Olympic Committee and the United States Olympic Committee to launch an Olympic TV channel in the United States.",
        "date": "12152016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "NBC teams up with Olympic committees to launch U.S. TV channel "
    },
    {
        "content": "Fandango Media LLC  an online movie ticketing platform owned by Comcast Corp   said on Thursday it would buy Peru-based Cinepapaya to expand in Latin America.",
        "date": "12012016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast's Fandango Media to buy Peru's online movie ticketer Cinepapaya "
    },
    {
        "content": "NEW YORK  Nov 21 U.S. President-elect Donald Trump's choice of experts to focus on new policies at the Federal Communications Commission signals a regime that will have a \"lighter\" touch on regulation and be more likely to favor large mergers in telecoms industries  analysts said.",
        "date": "11222016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Trump picks regulation opponents to lead FCC transition "
    },
    {
        "content": "* Soros Fund Management dissolves share stake in Delta Air Lines Inc",
        "date": "11142016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Soros Fund Management dissolves stake in Delta Air Lines  Comcast  Time Warner "
    },
    {
        "content": "* Tiger Global Management takes share stake of 2.6 million class A shares in Comcast Corp - SEC filing",
        "date": "11142016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Tiger Global Management takes share stake in Alibaba  Comcast - SEC filing "
    },
    {
        "content": "PARIS/NEW YORK NBCUniversal  the U.S. media conglomerate owned by Comcast Corp   said on Thursday it was in talks to buy a stake in European broadcaster Euronews.",
        "date": "11102016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast's NBC News in talks with Euronews on potential investment "
    },
    {
        "content": "PARIS/NEW YORK  Nov 10 NBCUniversal  the U.S. media conglomerate owned by Comcast Corp  said on Thursday it was in talks to buy a stake in European broadcaster Euronews.",
        "date": "11102016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-Comcast's NBC News in talks with Euronews on potential investment "
    },
    {
        "content": "Nov 10 Comcast Corp's NBC News is in discussions with Euronews about a potential investment and a partnership  an NBC spokesman told Reuters on Thursday.   (Reporting By Jessica Toonkel; Editing by Bill Rigby)",
        "date": "11102016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast's NBC News in talks with Euronews about potential investment "
    },
    {
        "content": "Nov 7 Comcast Corp's NBCUniversal will begin selling ads for Apple Inc's News app next year in an exclusive deal  the companies announced on Monday.",
        "date": "11072016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "NBCUniversal in deal to sell ads for Apple News "
    },
    {
        "content": "* Comcast to launch Netflix on X1 to millions of customers nationwide",
        "date": "11042016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast to launch Netflix on X1 to millions of customers nationwide "
    },
    {
        "content": "Nov 3 CBS Corp  owner of the most-watched U.S. television network  reported results that exceeded Wall Street expectations and said it was still in the early stages of exploring a merger with Viacom Inc  a deal favored by its controlling shareholders.",
        "date": "11032016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 3-CBS results top Street  Viacom merger exploration at early stage "
    },
    {
        "content": "* Comcast announces gigabit internet service coming to California  Source text for Eikon:  Further company coverage:",
        "date": "11012016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast reports gigabit internet service coming to California "
    },
    {
        "content": "NEW YORK  Nov 1 Video website Hulu on Tuesday announced deals to add programming from Twenty-first Century Fox  and Walt Disney Co to a streaming TV service that it plans to offer in early 2017.",
        "date": "11012016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Hulu signs deals with Disney  Fox for new streaming TV service "
    },
    {
        "content": "* Dow up 0.09 pct  S&P down 0.02 pct  Nasdaq down 0.35 pct   (Updates to mid-afternoon  changes byline)",
        "date": "10272016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "US STOCKS-Stocks flat as earnings roll in  Comcast drags Nasdaq "
    },
    {
        "content": "* Oil rises on draw of crude  OPEC comments   (Adds U.S. market open; changes dateline to New York)",
        "date": "10272016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "GLOBAL MARKETS-British data prompts global bond selloff; U.S. stocks flat "
    },
    {
        "content": "NEW YORK  Oct 25 T-Mobile US Inc is the likeliest acquisition target as media companies seek a wireless partner following AT&T Inc's proposed $85.4 billion takeover of Time Warner Inc  analysts said.",
        "date": "10252016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "T-Mobile seen as top target following AT&T-Time Warner deal "
    },
    {
        "content": "Oct 24 AT&T Inc's plan to buy Time Warner Inc for $85.4 billion in the biggest global acquisition of the year will bring the second-largest U.S. bridge loan financing ever to a market hungry for mergers and acquisitions loans.",
        "date": "10242016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "TIMEWARNER-M&A/AT&T-LOANS-Market welcomes AT&T's $40 bln Time Warner loan "
    },
    {
        "content": "NEW YORK Comcast Corp  on Wednesday posted higher third-quarter revenue and profit  benefiting from its NBCUniversal unit's broadcast of the Rio Olympics and the addition of new video customers.",
        "date": "10262016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast posts higher revenue  helped by Rio Olympics "
    },
    {
        "content": "* AT&T CEO Randall Stephenson on CNBC - Time Warner-At&T deal does not take competitors out",
        "date": "10242016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-AT&T CEO Stephenson - Time Warner-At&T deal does not take competitors out - CNBC "
    },
    {
        "content": "NEW YORK  Oct 26 Comcast Corp on Wednesday posted higher third-quarter revenue and profit  benefiting from its NBCUniversal unit's broadcast of the Rio Olympics and the addition of new video customers.",
        "date": "10262016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-Comcast posts higher revenue  helped by Rio Olympics "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Comcast is schooling AT&T on media M&A. The $155 billion cable giant now gets more than a third of its revenue from NBC Universal  a deal it concluded in early 2013. The regulatory and political climate was more accommodating and Chief Executive Brian Roberts' strategy sound. AT&T's $85 billion bid for Time Warner  by contrast  is a dog's breakfast.",
        "date": "10262016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast schools AT&T on media M&A "
    },
    {
        "content": "NEW YORK  Oct 26 Cable and entertainment company Comcast Corp posted higher third-quarter revenue on Wednesday  fueled by video customer additions and sustained growth in its high-speed internet and business services divisions.",
        "date": "10262016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast posts higher third-quarter revenue  adds video customers "
    },
    {
        "content": "* \u007f\u007fQ3 revenue for NBCUniversal increased 28.3 percent to $9.18 billion",
        "date": "10262016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast reports Q3 earnings per share $0.92 "
    },
    {
        "content": "Oct 19 Alphabet Inc's Google has reached an agreement with CBS Corp to carry the network on its planned web TV service and is in advanced talks with 21st Century Fox  Walt Disney Co and Viacom Inc  to distribute their channels  people with knowledge of the talks told Reuters on Wednesday.",
        "date": "10202016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 3-Google signs CBS  in talks with others on web TV -sources "
    },
    {
        "content": "WASHINGTON  Oct 11 Comcast Corp  the largest U.S. cable company  will pay a $2.3 million fine to resolve a federal investigation into whether the company wrongfully charged cable TV customers for services and equipment they never authorized.",
        "date": "10112016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast will pay $2.3 million to settle U.S. billing probe "
    },
    {
        "content": "* Semtech and Comcast sign agreement to deploy trial Lorawan network in the United States",
        "date": "10052016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Semtech and Comcast sign deal to deploy trial network in US "
    },
    {
        "content": "* Comcast Corp reports 6.6 pct passive stake in Harmonic Inc  as of September 26  2016      Source text - http://bit.ly/2doiklf Further company coverage:",
        "date": "09292016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast reports 6.6 pct passive stake in Harmonic "
    },
    {
        "content": "* Harmonic Inc says  has entered into a warrant agreement with Comcast Corporation",
        "date": "09272016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Harmonic enters into a warrant agreement with Comcast "
    },
    {
        "content": "* Comcast Corporation to acquire Ed Snider's stake in Comcast Spectacor",
        "date": "09222016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast Corp to buy Ed Snider's 24 pct stake in Comcast Spectacor "
    },
    {
        "content": "Sept 20 Cable company Comcast Corp  said it would launch a wireless service in the United States in mid-2017  ending speculation over its entry into the fiercely competitive market.",
        "date": "09202016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast to enter wireless market in mid-2017 "
    },
    {
        "content": "NBC Universal  a unit of Comcast Corp  said the company booked more than $250 million in profit from the Rio Olympics coverage  helped by strong advertising sales.",
        "date": "09142016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast's NBCU books $250 million in profit from Rio Olympics coverage "
    },
    {
        "content": "Sept 14 NBC Universal  a unit of Comcast Corp   said the company booked more than $250 million in profit from the Rio Olympics coverage  helped by strong advertising sales.",
        "date": "09142016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast's NBCU books $250 mln in profit from Rio Olympics coverage "
    },
    {
        "content": "WASHINGTON  Sept 7 The top U.S. communications regulator plans on Thursday to unveil a revised plan to allow about 100 million pay TV subscribers to replace expensive set-top boxes with less-costly apps that provide access to television and video programs  two people briefed on the plan said.",
        "date": "09072016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "U.S. FCC chief to unveil revised plan to eliminate cable boxes "
    },
    {
        "content": "* NBCUniversal Media Llc Says On September 7  2016 Co and comcast corp amended and restated matching revolving credit notes  -Sec filing",
        "date": "09122016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-NBCUniversal Media says co and Comcast corp amended  restated matching revolving credit notes on Sept 7  2016 "
    },
    {
        "content": "Aug 22 A federal appeals court on Monday said Comcast Corp's Golf Channel need not repay $5.9 million it had received from convicted swindler Allen Stanford in exchange for services aimed at furthering his multibillion-dollar Ponzi scheme.",
        "date": "08222016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast's Golf Channel beats appeal over Allen Stanford fraud "
    },
    {
        "content": "RIO DE JANEIRO NBC  a unit of Comcast Corp  has sold $1.2 billion in advertising for the Summer Olympics in Rio de Janeiro  the network said on the eve of a rare Games where some of the most high-profile contests will air live in prime time for U.S. audiences.",
        "date": "08042016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "NBC has sold $1.2 billion in Olympics advertising "
    },
    {
        "content": "RIO DE JANEIRO Aug 4 NBC  a unit of Comcast Corp   has sold $1.2 billion in advertising for the Summer Olympics in Rio de Janeiro  the network said on the eve of a rare Games where some of the most high-profile contests will air live in prime time for U.S. audiences.",
        "date": "08042016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-NBC has sold $1.2 billion in Olympics advertising "
    },
    {
        "content": "* Sinclair Broadcast Group enters into retransmission consent agreement with Comcast",
        "date": "08032016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Sinclair Broadcast Group enters retransmission consent agreement with Comcast "
    },
    {
        "content": "Time Warner Inc  disclosed a 10 percent stake in video streaming site Hulu on Wednesday  setting its sights on the web TV market  and it raised its 2016 forecast on expectations of sustained growth in its traditional media business. | Video ",
        "date": "08032016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Time Warner takes stake in Hulu  lifts profit forecast "
    },
    {
        "content": "Aug 3 Time Warner Inc disclosed a 10 percent stake in video streaming site Hulu on Wednesday  setting its sights on the web TV market  and it raised its 2016 forecast on expectations of sustained growth in its traditional media business.",
        "date": "08032016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 5-Time Warner takes stake in Hulu  lifts profit forecast "
    },
    {
        "content": "* Comcast Corp files for potential mixed shelf offering - SEC filing  Source text: http://bit.ly/2a2L8ii Further company coverage:    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "07282016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast Corp files for potential mixed shelf offering "
    },
    {
        "content": "* Comcast Corp has been in \"test and learn mode\" as it plans to offer wireless service in the near future: Comcast executives",
        "date": "07272016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-\"Over-the-top economics are unproven to us:\" Comcast CEO Brian Roberts "
    },
    {
        "content": "* Comcast CEO Brian Roberts says not looking for acquisitions in wireless market - CNBC    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "07272016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast CEO Brian Roberts says not looking for acquisitions in wireless market - CNBC "
    },
    {
        "content": "* Sets quarterly dividend of $0.275 per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07272016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast sets quarterly dividend of $0.275/shr "
    },
    {
        "content": "* Says Q2 NBCUniversal reported revenue $7.10 billion versus $7.23 billion",
        "date": "07272016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast Corp reports Q2 earnings per share $0.83 "
    },
    {
        "content": "NEW YORK  July 21 Comcast Corp  the No. 1 U.S. cable company  said on Thursday it will introduce prepaid TV and internet services to attract customers whose credit ratings do not quality them for postpaid services.",
        "date": "07212016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast to offer prepaid TV and internet service "
    },
    {
        "content": "* Comcast announces plans to roll out Xfinity prepaid services",
        "date": "07212016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast announces plans to roll out Xfinity prepaid services "
    },
    {
        "content": "* Comcast adds new video camera and voice controls to smart home platform",
        "date": "07062016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast adds new video camera and voice controls to smart home platform "
    },
    {
        "content": "July 5 Comcast Corp's pay television subscribers will be able to stream movies and TV shows from Netflix Inc through the cable operator's X1 set-top box later this year  the companies said on Tuesday.",
        "date": "07052016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Netflix coming to Comcast's X1 boxes later this year "
    },
    {
        "content": "July 5 Comcast Corp  the owner of the NBC TV network  has reached an agreement with Netflix Inc  to stream Netflix content through its X1 set-top box  the companies said.",
        "date": "07052016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast to add Netflix content on its X1 set-top box "
    },
    {
        "content": "* Comcast and Netflix have reached an agreement to incorporate Netflix into X1",
        "date": "07052016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast and Netflix reach agreement to incorporate Netflix into X1 "
    },
    {
        "content": "WILMINGTON  Del. Jeffrey Katzenberg  DreamWorks Animation SKG Inc's chief executive  has been hit with a proposed class action lawsuit over what a minority shareholder called an \"extraordinarily valuable\" side deal he struck as part of the $3.8 billion sale of the studio to Comcast Corp .",
        "date": "06282016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Katzenberg sued over 'side deal' to Comcast-DreamWorks merger "
    },
    {
        "content": "* Comcast Business announces more than $9 mln investment to expand high-performance gigabit ethernet network in Virginia",
        "date": "06222016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast Business announces more than $9 mln investment to expand high-performance gigabit ethernet network in Virginia "
    },
    {
        "content": "* Signed an agreement to acquire Austin  Texas-based company Icontrol Networks Inc",
        "date": "06232016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast signed an agreement to acquire Icontrol Networks "
    },
    {
        "content": "June 17 Satellite TV operator Dish Network Corp  blacked out the National Football League-owned sports channels  NFL Network and NFL RedZone  the first time the league has been dropped by a TV services provider  the NFL said.",
        "date": "06172016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Dish drops NFL Network  NFL RedZone amid fee dispute "
    },
    {
        "content": "* Comcast NBCUniversal donates $1m to OneOrlando fund for victims of the pulse nightclub shooting in Orlando - CNBC",
        "date": "06162016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast NBCUniversal donates $1m to OneOrlando fund for victims of the pulse nightclub shooting in Orlando - CNBC "
    },
    {
        "content": "WASHINGTON A U.S. appeals court upheld the Obama administration's landmark rules barring internet service providers from obstructing or slowing down consumer access to web content on Tuesday  dealing a blow to big cable and mobile phone companies.",
        "date": "06142016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "U.S. court backs landmark Obama internet equal-access rules "
    },
    {
        "content": "* FCC head hails a \"victory for consumers and innovators\"   (Adds details of ruling  White House  Hillary Clinton reaction  quote from dissenting judge  impact on consumers)",
        "date": "06142016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 4-U.S. court backs landmark Obama internet equal-access rules "
    },
    {
        "content": "* Xfinity Brand partners with esports company ESL and pro gaming organization  Evil Geniuses",
        "date": "06022016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast announces Xfinity brand sponsorships with ESL "
    },
    {
        "content": "* On May 26  2016 Comcast Corporation entered into a credit agreement",
        "date": "05312016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast enters into credit agreement for $7 bln credit facility "
    },
    {
        "content": "WASHINGTON  May 18 Charter Communications Inc  said Wednesday it has completed its acquisition of Time Warner Cable Inc and Bright House Networks LLC  creating the second-largest U.S. broadband provider and third-largest pay TV provider.",
        "date": "05182016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Charter Communications completes purchase of Time Warner Cable "
    },
    {
        "content": "BOSTON Comcast Corp's NBCUniversal unit will air live over 6 000 hours of competition on TVs and mobile devices from the Rio Olympic Games and offer viewers up-to-the-minute technology to search and personalize content  Chief Executive Officer Brian Roberts said on Monday.",
        "date": "05162016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast to air over 6 000 hours of Olympics 2016 content "
    },
    {
        "content": "BOSTON  May 16 Comcast Corp's  NBCUniversal unit will air live over 6 000 hours of competition on TVs and mobile devices from the Rio Olympic Games and offer viewers up-to-the-minute technology to search and personalize content  Chief Executive Officer Brian Roberts said on Monday.",
        "date": "05162016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-Comcast to air over 6 000 hours of Olympics 2016 content "
    },
    {
        "content": "* Declared a quarterly dividend of $0.275 a share on company's common stock  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05112016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast declares quarterly dividend of $0.275/share "
    },
    {
        "content": "WASHINGTON The U.S. Federal Communications Commission confirmed on Friday that it had voted to approve Charter Communications Inc's acquisitions of Time Warner Cable Inc and Bright House Networks.",
        "date": "05062016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "FCC confirms approval of Charter  Time Warner Cable merger "
    },
    {
        "content": "WASHINGTON A majority of the five-member U.S. Federal Communications Commission has voted to approve Charter Communications Inc's  acquisitions of Time Warner Cable Inc  and Bright House Networks  two sources briefed on the matter said on Thursday.",
        "date": "05052016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "FCC backs Charter purchase of Time Warner Cable  Bright House: sources "
    },
    {
        "content": "* Stingray expands distribution agreement with Comcast  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05022016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Stingray expands distribution agreement with Comcast "
    },
    {
        "content": "* Fitch: Comcast's ratings unaffected by Dreamworks acquisition  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "04282016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Fitch: Comcast's ratings unaffected by Dreamworks acquisition "
    },
    {
        "content": "* Says there is a $200 million reverse break up fee related to receiving antitrust approval for Dreamworks deal - Sec filing",
        "date": "04282016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast says $200 mln reverse break up fee for antitrust approval for dreamworks deal "
    },
    {
        "content": "* NBCUniversal says Dreamworks Animation has an equity value of about $3.8 billion",
        "date": "04282016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-NBCUniversal announces Dreamworks Animation acquisition "
    },
    {
        "content": "April 28 Comcast Corp  the owner of NBCUniversal  said on Thursday it would buy DreamWorks Animation SKG Inc for $3.8 billion in cash.",
        "date": "04282016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast to buy DreamWorks Animation for $3.8 billion "
    },
    {
        "content": "NEW YORK Comcast Corp reported better-than-expected results on Wednesday  reaping the rewards of its biggest first-quarter jump in pay-TV customers in nine years and as its business service  high-speed Internet and entertainment units grew. | Video ",
        "date": "04272016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast beats estimates  gains video subscribers "
    },
    {
        "content": "NEW YORK  April 27 Comcast Corp  reported better-than-expected results on Wednesday  reaping the rewards of its biggest first-quarter jump in pay-TV customers in nine years and as its business service  high-speed Internet and entertainment units grew.",
        "date": "04272016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-Comcast beats estimates  gains video subscribers "
    },
    {
        "content": "* Dreamworks CEO Katzenberg to leave if Comcast deal is completed- CNBC  citing DJ",
        "date": "04272016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Dreamworks CEO Katzenberg to leave if Comcast deal is completed- CNBC  citing DJ "
    },
    {
        "content": "* Indexes down: Dow 0.13 pct  S&P 0.06 pct  Nasdaq 0.58 pct   (Updates more)",
        "date": "04272016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "US STOCKS-Apple drags Nasdaq lower; S&P  Dow little changed "
    },
    {
        "content": "* Apple falls 8 pct after revenue falls first time in 13 years",
        "date": "04272016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "US STOCKS-Wall St set to open lower as Apple weighs; Fed awaited "
    },
    {
        "content": "* Q1 reported revenue $18.79 billion versus $17.85 billion last year",
        "date": "04272016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast reports Q1 earnings per share $0.87 "
    },
    {
        "content": "April 27 U.S. stock index futures were lower on Wednesday after Apple's first revenue decline in 13 years stirred investor concerns ahead of a policy decision by the Federal Reserve.",
        "date": "04272016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "US STOCKS-Futures dragged down by tech earnings; Fed eyed "
    },
    {
        "content": "* Comcast and Roku bring Xfinity TV Partner app to Roku TVs and Roku streaming players",
        "date": "04202016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast cable service to soon be accessible on Roku devices "
    },
    {
        "content": "April 26 Comcast Corp  the largest U.S. cable operator  is in talks to buy Hollywood studio owner DreamWorks Animation SKG Inc for more than $3 billion  The Wall street Journal reported  citing sources.",
        "date": "04272016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast in talks to buy DreamWorks Animation for more than $3 bln - WSJ "
    },
    {
        "content": "WASHINGTON  April 15 The Obama administration on Friday weighed into the debate over allowing consumers to switch pricey cable television boxes for less expensive devices  urging an agency to set an example for other parts of government to boost competition.",
        "date": "04152016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Obama urges agency to open competition in cable TV boxes "
    },
    {
        "content": "* CEO Brian L. Roberts' FY 2015 total compensation was $36.2  million versus $33 million in FY 2014 - SEC Filing",
        "date": "04082016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast CEO's 2015 total compensation was $36.2 mln vs $33 mln in 2014 "
    },
    {
        "content": "SAN FRANCISCO  April 7 Verizon Communications Inc is ready to make a bid for Yahoo's web business  and hopes to make a merger more successful by also making an offer for a stake in Yahoo's Japan subsidiary  Bloomberg reported on Thursday  citing a source familiar with the matter.",
        "date": "04072016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-Verizon plans bid for Yahoo and its Yahoo Japan stake -Bloomberg "
    },
    {
        "content": "The U.S. Justice Department will file a lawsuit as soon as this week to stop oilfield services provider Halliburton Co from acquiring smaller rival Baker Hughes Inc  a source familiar with the matter said on Tuesday.",
        "date": "04052016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "U.S. Justice Dept will sue to stop Halliburton  Baker Hughes merger: source "
    },
    {
        "content": "April 5 The U.S. Justice Department will file a lawsuit as soon as this week to stop oilfield services provider Halliburton Co from acquiring smaller rival Baker Hughes Inc  a source familiar with the matter said on Tuesday.",
        "date": "04052016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 3-U.S. Justice Dept will sue to stop Halliburton  Baker Hughes merger - source "
    },
    {
        "content": "WASHINGTON/NEW YORK  March 29 The U.S. Federal Communications Commission on Tuesday kicked off an auction of low-frequency spectrum relinquished by television  broadcasters to wireless companies and other bidders that are seeking new airwaves to build and improve wireless networks.",
        "date": "03292016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "U.S. FCC begins first phase of airwaves auction "
    },
    {
        "content": "March 29 NBC  a unit of Comcast Corp  said it had sold $1 billion in national ad sales for the Summer Olympics in Rio de Janeiro  as the network prepares to broadcast a rare Games where some of the most high-profile contests will air live in prime time for U.S. audiences.",
        "date": "03292016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "NBC sells $1 billion in ads for Rio Olympics "
    },
    {
        "content": "* Plans to offer additional notes in existing series of 2.75% notes due 2023 and 3.15% notes due 2026 in an underwritten public offering  Source text for Eikon: (http://1.usa.gov/1pH8P38) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "03222016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast says it plans to offer additional notes in an underwritten public offering "
    },
    {
        "content": "NEW YORK  March 20 A quiet decision by private equity firm Blackstone Group LP to recently sell three TV stations may foreshadow uncertain returns for some selling TV airwaves and lower wireless demand in the U.S. government's upcoming spectrum auction  industry watchers say.",
        "date": "03202016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Blackstone makes quiet sale ahead of FCC airwaves auction "
    },
    {
        "content": "WASHINGTON/NEW YORK March 18 The U.S. Federal Communications Commission said on Friday that it had received 104 applications to take part in an auction of valuable low-frequency airwaves relinquished by TV broadcasters      including many wireless companies who want to use the airwaves to build new networks or improve existing coverage.",
        "date": "03182016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-U.S. FCC says it receives 104 bids to participate in spectrum auction "
    },
    {
        "content": "March 15 Dish Network Corp said it is suing Comcast Corp's NBCUniversal for breach of contract and expects to file for arbitration to block NBC from blacking out its channels such as CNBC and Bravo.",
        "date": "03152016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Dish sues NBC over breach of contract "
    },
    {
        "content": "March 8 Twenty-First Century Fox Inc 's YES Network is looking to hit a home run with one of its most valuable assets in a fight with cable provider Comcast Corp: the New York Yankees.",
        "date": "03092016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "YES network taps New York Yankees in campaign against Comcast "
    },
    {
        "content": "NEW YORK  Feb 19 Verizon Communications Inc   which launched its pay TV plan \"Fios Custom TV\" last year to let viewers choose bundles of channels they want to watch  has redesigned the offering.",
        "date": "02232016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "REFILE-UPDATE 2-Verizon redesigns its Fios Custom TV offering "
    },
    {
        "content": "SHANGHAI  Feb 17 Chinese film company Perfect World Pictures Co Ltd will invest $250 million into a slate of Universal Pictures movies  extending the tie-ups between China and Hollywood  as the world's second largest economy sees its box office soar.",
        "date": "02172016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "China's Perfect World to fund Universal movies in $250 million deal "
    },
    {
        "content": "NEW YORK Comcast Corp posted better-than-expected fourth-quarter revenue and added the most video customers in any quarter in eight years  even as viewers gravitate toward online offerings. | Video ",
        "date": "02032016",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast revenues beat Street; records big boost in video customers "
    },
    {
        "content": "NEW YORK  Feb 3 Comcast Corp posted better-than-expected fourth-quarter revenue and added the most video customers in any quarter in eight years  even as viewers gravitate toward online offerings.",
        "date": "02032016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 4-Comcast revs beat Street; records big boost in video customers "
    },
    {
        "content": "NEW YORK  Feb 3 Comcast Corp posted better-than-expected fourth-quarter revenue on Wednesday  driven by growth in its media and entertainment unit NBCUniversal in addition to its high-speed Internet and business services divisions.",
        "date": "02032016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast revenue beats Street as NBCUniversal  Internet units grow "
    },
    {
        "content": "Jan 5 The U.S. Federal Communications Commission said it is delaying its informal deadline by 15 days to review the proposed $56 billion merger of cable rivals Charter Communications Inc and Time Warner Cable Inc.",
        "date": "01052016",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "U.S. FCC delays Charter-Time Warner Cable merger review by two weeks "
    },
    {
        "content": "The host of the Miss Universe pageant mistakenly announced the wrong winner on Sunday  who then had to give up the crown and hand it over to a 26-year-old actress and model from the Philippines.",
        "date": "12212015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Miss Universe host announces wrong winner before Miss Philippines crowned "
    },
    {
        "content": "Dec 20 The host of the Miss Universe pageant mistakenly announced the wrong winner on Sunday  who then had to give up the crown and hand it over to a 26-year-old actress and model from the Philippines.",
        "date": "12212015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 3-Miss Universe host announces wrong winner before Miss Philippines crowned "
    },
    {
        "content": "WASHINGTON  Dec 17 The Federal Communications Commission said on Thursday it asked major Internet providers to answer questions on policies aimed at offering consumers free data by using preferred services and whether they violate the government's net neutrality rules.",
        "date": "12172015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "UPDATE 3-FCC wants details on AT&T  Comcast  T-Mobile data plans "
    },
    {
        "content": "WASHINGTON  Dec 17 The Federal Communications Commission said on Thursday it has asked major Internet providers to discuss innovative data policies in the wake of the government's net neutrality rules.",
        "date": "12172015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "FCC wants details on AT&T  Comcast  T-Mobile data plans "
    },
    {
        "content": "Three men were arrested on Monday for engaging in a wide-ranging hacking and spamming scheme that targeted personal information of 60 million people including Comcast customers  U.S. prosecutors announced Tuesday.",
        "date": "12152015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "U.S. arrests three men over hacking scheme targeting 60 million people "
    },
    {
        "content": "Three men were arrested on Monday for engaging in a wide-ranging hacking and spamming scheme that targeted personal information of 60 million people including Comcast customers  U.S. prosecutors announced Tuesday.",
        "date": "12152015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "U.S. arrests three men over hacking scheme targeting 60 mln people "
    },
    {
        "content": "Dec 15 Three men were arrested on Monday for engaging in a wide-ranging hacking and spamming scheme that targeted personal information of 60 million people including Comcast customers  U.S. prosecutors announced Tuesday.",
        "date": "12152015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "U.S. arrests 3 men over hacking scheme targeting 60 mln people "
    },
    {
        "content": "The U.S. Federal Trade Commission said it has filed a complaint aimed at stopping Staples Inc   the nation's largest office supply store  from buying its top rival  Office Depot Inc .",
        "date": "12072015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "U.S. files complaint to stop Staples from buying Office Depot "
    },
    {
        "content": "The U.S. Department of Justice is investigating whether Comcast Corp  the biggest U.S. cable TV provider  is hindering competition in cable advertising sales  a source told Reuters.",
        "date": "11242015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "U.S. probing Comcast's role in 'spot' cable ad sales market "
    },
    {
        "content": "Nov 24 The U.S. Department of Justice is investigating whether Comcast Corp  the biggest U.S. cable TV provider  is hindering competition in cable advertising sales  a source told Reuters.",
        "date": "11242015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-U.S. probing Comcast's role in 'spot' cable ad sales market "
    },
    {
        "content": "Nov 24 The U.S. Department of Justice is investigating whether cable company Comcast Corp is hindering competition in cable advertising sales  the Wall Street Journal reported  citing a document reviewed by the newspaper.",
        "date": "11242015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "U.S. DoJ probing Comcast's role in \"spot\" cable ad sales market-WSJ "
    },
    {
        "content": "Nov 18 Former Comcast Corp chief financial officer Michael Angelakis hired two executives for his new investment company  according to people familiar with the matter.",
        "date": "11182015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "MOVES-Two executives join new investment firm backed by Comcast -sources "
    },
    {
        "content": "CARACAS  Nov 13 It reads like a typical Latin American soap opera: two relatives of Venezuela's president were caught in their Haitian hotel and whisked to the United States to face cocaine charges.",
        "date": "11132015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Banned 'narco' soap overtaken by Venezuela's real-life scandal "
    },
    {
        "content": "Dish Network Corp said the proposed merger of Charter Communications and Time Warner Cable was not in the public interest  in a reply filed with the Federal Communications Commission.",
        "date": "11132015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Dish tells U.S. FCC: Charter-TWC merger 'not in public interest' "
    },
    {
        "content": "Nov 12 Dish Network Corp said the proposed merger of Charter Communications and Time Warner Cable was not in the public interest  in a reply filed with the Federal Communications Commission.",
        "date": "11132015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-Dish tells U.S. FCC: Charter-TWC merger 'not in public interest' "
    },
    {
        "content": "SAN FRANCISCO  Nov 10 Ride service Uber is attempting a new legal maneuver to learn more about an Internet address that it thinks could help identify the individual who improperly accessed an Uber database last year  according to court filings on Tuesday.",
        "date": "11112015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Uber tries new legal tactic to identify hacker behind data breach "
    },
    {
        "content": "During the next U.S. Republican presidential debate on Tuesday  Fox Business Network aims to keep the candidates talking about economic issues and avoid the criticism leveled at rival CNBC that it failed to keep the focus on substance.",
        "date": "11062015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Fox Business plan for U.S. Republican debate: stick to money issues "
    },
    {
        "content": "Nov 3 Morgan Stanley's Americas M&A chief Bob Eatroff is leaving the bank for a corporate development role at Comcast Corporation  the second departure this fall of a senior dealmaker at the bank.",
        "date": "11032015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Morgan Stanley Americas M&A head Eatroff departs for Comcast "
    },
    {
        "content": "NEW YORK  Oct 27 Comcast Corp  the cable and entertainment company  posted in-line third-quarter results on Tuesday  helped by its NBCUniversal's box-office hit \"Minions\" and growth in its high-speed Internet and business services divisions.",
        "date": "10272015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast posts in-line results  helped by 'Minions ' Internet unit growth "
    },
    {
        "content": "NEW YORK  Oct 26 Dish Network Corp will begin experimenting with automated ad sales  moving away from the pay-TV industry's years-old way of selling ads through phone calls  paperwork and in-person deal-making.",
        "date": "10262015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Dish to test automated TV ad sales "
    },
    {
        "content": "Oct 13 Dish Network Corp said on Tuesday it filed a petition asking the Federal Communications Commission (FCC) to deny the proposed merger of Charter Communications Inc and Time Warner Cable  citing substantial harm to competitors and consumers.",
        "date": "10142015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Dish Networks petitions FCC to deny Time Warner-Charter merger "
    },
    {
        "content": "Oct 13 Dish Network Corp said on Tuesday it filed a petition asking the Federal Communications Commission (FCC) to deny the proposed merger of Charter Communications Inc and Time Warner Cable  citing substantial harm to competitors and consumers.",
        "date": "10142015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "CORRECTED-Dish Networks petitions FCC to deny Time Warner-Charter merger "
    },
    {
        "content": "Amazon.com Inc is considering the creation of a live online TV service and has reached out to networks such as CBS Corp and Comcast's NBCUniversal to express interest in carrying their channels  Bloomberg reported.",
        "date": "10072015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Amazon considering online TV service: Bloomberg "
    },
    {
        "content": "Oct 7 Amazon.com Inc is considering the creation of a live online TV service and has reached out to networks such as CBS Corp and Comcast's  NBCUniversal to express interest in carrying their channels  Bloomberg reported.",
        "date": "10072015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-Amazon considering online TV service - Bloomberg "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  September 29 (Fitch) Fitch Ratings has affirmed the 'A-' Issuer Default  Ratings (IDRs) assigned to Comcast Corporation (Comcast) and its wholly owned  subsidiaries included in Comcast's cross-guaranty structure. Fitch has also  affirmed the 'A-' IDR assigned to NBCUniversal Enterprise  Inc. (NBCUniversal  Enterprise) and to NBCUniversal Media  LLC. (NBCUniversal) The Rating Outlook on  all of these ratings is Stable. Approxima",
        "date": "09292015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Fitch Affirms Comcast's IDR at 'A-'; Outlook Stable "
    },
    {
        "content": "OSAKA U.S. cable company Comcast Corp said on Monday it has agreed to acquire a majority stake in Osaka-based Universal Studios Japan for $1.5 billion  part of an acceleration of its  global theme park strategy.",
        "date": "09282015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast buys majority stake in Universal Studios Japan for $1.5 billion "
    },
    {
        "content": "OSAKA  Sept 28 Comcast Corp said it will buy a majority stake in Universal Studios Japan for $1.5 billion  its biggest investment outside the United States and part of an aggressive expansion of its theme park business globally.",
        "date": "09282015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "CORRECTED-UPDATE 3-Comcast buys majority stake in Universal Studios Japan for $1.5 bln "
    },
    {
        "content": "OSAKA  Sept 28 U.S. cable company Comcast Corp  said on Monday it has agreed to buy a 51 percent stake in Osaka-based theme park operator USJ Co for $1.5 billion.",
        "date": "09282015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast says to buy 51 pct of Universal Studios Japan for $1.5 bln "
    },
    {
        "content": "Sept 21 Time Warner Cable Inc's  shareholders approved the company's $56 billion takeover by Charter Communications Inc  according to preliminary votes at a special shareholder meeting.",
        "date": "09212015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "CORRECTED-Time Warner Cable shareholders approve deal with Charter "
    },
    {
        "content": "Sept 17 Comcast Corp has reached a $33 million settlement with California over allegations that the cable company posted personal details of customers online  state Attorney General Kamala Harris said in a statement on Thursday.",
        "date": "09172015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast reaches $33 mln settlement with California over privacy violations "
    },
    {
        "content": "Comcast Corp has reached a $33 million settlement with California over allegations that the cable company posted personal details of customers online  state Attorney General Kamala Harris said in a statement on Thursday.",
        "date": "09172015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast reaches $33 million settlement with California over privacy violations "
    },
    {
        "content": "NEW YORK  Sept 16 Comcast Corp has set up a new business services division to sell broadband  Wi-Fi  ethernet and other services to large companies in the Fortune 1000 list  hoping to attract new revenue  the U.S. cable and Internet provider said on Wednesday.",
        "date": "09162015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast creates new enterprise services unit to target big businesses "
    },
    {
        "content": "NEW YORK \"Terminator\" star Arnold Schwarzenegger will be the new host of NBC's reality TV show \"The Celebrity Apprentice \" the network said on Monday  replacing Donald Trump who quit the show to run for U.S. president. | Video ",
        "date": "09142015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Schwarzenegger to replace Trump as host of 'The Celebrity Apprentice' "
    },
    {
        "content": "The owners of Universal Studios Japan  including Goldman Sachs Group Inc   are in talks to sell a stake in the theme park to Comcast Corp's  NBCUniversal  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "09152015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Universal Studios Japan in talks to sell stake to Comcast: WSJ "
    },
    {
        "content": "Sept 15 The owners of Universal Studios Japan  including Goldman Sachs Group Inc  are in talks to sell a stake in the theme park to Comcast Corp's  NBCUniversal  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "09152015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Universal Studios Japan in talks to sell stake to Comcast - WSJ "
    },
    {
        "content": "Sept 15 The owners of Universal Studios Japan  including Goldman Sachs Group Inc  are in talks to sell a stake in the theme park to Comcast Corp's  NBCUniversal  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "09152015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Universal Studios Japan in talks to sell stake to Comcast - WSJ "
    },
    {
        "content": "LOS ANGELES  Sept 11 Nana and Pop Pop seem like the perfect grandparents. They bake cookies  go for long walks and volunteer at a local psychiatric hospital. But after the sun goes down  things get weird in M. Night Shyamalan's latest horror movie  \"The Visit.\"",
        "date": "09112015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Shyamalan creeps into micro-budget horror with 'The Visit' "
    },
    {
        "content": "Comcast Corp's NBCUniversal said on Tuesday it had invested $200 million in online publisher BuzzFeed  the latest move by the media conglomerate to tap into a younger audience.",
        "date": "08182015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "NBCUniversal invests $200 million in BuzzFeed "
    },
    {
        "content": "Aug 18 Comcast Corp's NBCUniversal said on Tuesday it had invested $200 million in online publisher BuzzFeed  the latest move by the media conglomerate to tap into a younger audience.",
        "date": "08182015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-NBCUniversal invests $200 mln in BuzzFeed "
    },
    {
        "content": "Aug 18 Comcast Corp's NBCUniversal said on Tuesday it had invested $200 million in online publisher BuzzFeed and that the companies would also consider \"strategic partnerships\" in the coming months.",
        "date": "08182015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "NBCUniversal invests $200 mln in BuzzFeed "
    },
    {
        "content": "* NBCUniversal says it has agreed to make a $200 million equity investment in Vox Media - company statement  Source text for Eikon:  Further company coverage:    (Reporting by Lisa Richwine)",
        "date": "08122015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast's NBCUniversal invests $200 million in Vox Media "
    },
    {
        "content": "NEW YORK  July 31 Dish Network Corp  said on Friday that Comcast Corp's broadcast television network NBC is not airing ads promoting its Sling TV video streaming service in some markets.",
        "date": "07312015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast's NBC blocks Sling TV ads  Dish says "
    },
    {
        "content": "LOS ANGELES Comcast Corp's  NBCUniversal film and television unit is close to making an investment in online publisher BuzzFeed and is in talks to raise its stake in Vox Media  a person with knowledge of both sets of discussions said on Thursday.",
        "date": "07302015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "NBCUniversal close to investing in BuzzFeed: source "
    },
    {
        "content": "LOS ANGELES  July 30 Comcast Corp's  NBCUniversal film and television unit is close to making an investment in online publisher BuzzFeed and is in talks to raise its stake in Vox Media  a person with knowledge of both sets of discussions said on Thursday.",
        "date": "07302015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-NBCUniversal close to investing in BuzzFeed - source "
    },
    {
        "content": "LOS ANGELES  July 23 After taking the summer box office by storm with more than $1.5 billion globally  the \"Jurassic World\" dinosaurs will be getting a sequel slated for June 22  2018  Comcast Corp's Universal Pictures said Thursday.",
        "date": "07232015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Universal Pictures' 'Jurassic World' sequel set for June 2018 "
    },
    {
        "content": "NEW YORK  July 23 Comcast Corp  the largest U.S. cable operator  posted in-line second-quarter results  as its high-speed Internet and NBC Universal businesses grew amid a drop in pay-TV subscriber departures.",
        "date": "07232015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast posts in-line results as Internet  NBC Universal units grow "
    },
    {
        "content": "* Q2 earnings per share $0.84; Q2 revenue $18.74 billion versus $16.84 billion last year",
        "date": "07232015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast reports Q2 earnings per share of $0.84 "
    },
    {
        "content": "July 16 Rovi Corp  a digital entertainment guides provider  said it will appeal a California court decision to invalidate five of its patents and the order that Netflix did not infringe the patents.",
        "date": "07162015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Rovi to appeal court order favoring Netflix in patent case "
    },
    {
        "content": "July 12 Cable company Comcast Corp  said it is beta testing a new cable streaming service called Stream  which will broadcast live TV from HBO and about a dozen other networks for $15 per month.",
        "date": "07132015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast to offer streaming services for $15 a month "
    },
    {
        "content": "July 10 McDonald's Corp is standing by its latest Happy Meal toy  denying that its Minions are the foul-mouthed playthings that some of its fast-food customers say they are.",
        "date": "07102015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Dear customers: That Minion isn't cursing. Sincerely  McDonald's "
    },
    {
        "content": "NEW YORK  June 18 Television newsman Brian Williams  who was suspended for fabricating a story about being on board a helicopter when it was attacked in Iraq  has been dropped as anchor of the top-rated NBC \"Nightly News\" program  the network said on Thursday.",
        "date": "06182015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-Brian Williams dropped from NBC's 'Nightly News ' will join MSNBC "
    },
    {
        "content": "June 18 NBC said news anchor Brian Williams  suspended for fabricating a story about being on board a helicopter when it was attacked in Iraq  will not be returning as anchor of the top-rated \"Nightly News\" program.",
        "date": "06182015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Brian Williams not returning to NBC's \"Nightly News\"; to join MSNBC "
    },
    {
        "content": "June 18 NBC news anchor Brian Williams  suspended for fabricating a story about him coming under fire while being aboard a helicopter in Iraq  has broken his silence in an interview with Matt Lauer  CNN Money reported.",
        "date": "06182015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Suspended NBC anchor Brian Williams to break silence in Matt Lauer interview - CNN Money "
    },
    {
        "content": "Comcast Corp founder and prominent cable industry executive Ralph Roberts died on Thursday at the age of 95  the company said.",
        "date": "06192015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast founder  cable industry leader Ralph Roberts dies at 95 "
    },
    {
        "content": "June 19 Comcast Corp founder and prominent cable industry executive Ralph Roberts died on Thursday at the age of 95  the company said.",
        "date": "06192015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 3-Comcast founder  cable industry leader Ralph Roberts dies at 95 "
    },
    {
        "content": "June 19 Comcast Corp founder Ralph Roberts died on Thursday at the age of 95  the company said.",
        "date": "06192015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast founder Ralph Roberts dies at 95 "
    },
    {
        "content": "Source text - http://cnb.cx/1dObemg Further company coverage:",
        "date": "06192015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast founder Ralph Roberts dies at 95 - CNBC "
    },
    {
        "content": "NEW YORK/FRANKFURT  June 17 U.S. cable company Comcast Corp is not interested in buying wireless carrier T-Mobile US  a person familiar with the situation said on Wednesday.",
        "date": "06172015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Comcast not interested in buying T-Mobile -source "
    },
    {
        "content": "FRANKFURT Deutsche Telekom is in talks with U.S. cable company Comcast about a potential sale of T-Mobile US  German Manager Magazin reported on Wednesday  citing sources. | Video ",
        "date": "06172015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Deutsche Telekom talks to Comcast about T-Mobile US sale: Manager Magazin "
    },
    {
        "content": "June 17 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Wednesday:",
        "date": "06172015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "FRANKFURT  June 17 Deutsche Telekom  is in talks with U.S. cable company Comcast about a potential sale of T-Mobile US  German Manager Magazin reported on Wednesday  citing sources.",
        "date": "06172015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Deutsche Telekom talks to Comcast about T-Mobile US sale -Manager Magazin "
    },
    {
        "content": "Time Warner Cable Inc  said Chief Financial Officer Arthur Minson would step down effective immediately  less than a week after Charter Communications Inc  agreed to buy the company for $56 billion.",
        "date": "06012015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Time Warner Cable CFO Arthur Minson leaves to join startup "
    },
    {
        "content": "WASHINGTON  May 26 Time Warner Cable  entering into talks to be acquired by  Charter Communications Inc just a month after regulators killed a proposed takeover by Comcast Corp's  was determined not to get burned a second time.",
        "date": "05262015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Charter's Time Warner Cable bid faces $2 billion regulatory question "
    },
    {
        "content": "LOS ANGELES  May 26 Vox Media is acquiring Revere Digital  the company that owns technology news website Re/code  according to a post on the Re/code website on Tuesday.",
        "date": "05262015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Vox Media acquiring tech news website Re/code "
    },
    {
        "content": "BRUSSELS  May 27 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "05272015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "EU mergers and takeovers (May 27) "
    },
    {
        "content": "May 26 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "05262015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "LOS ANGELES Vox Media  owner of The Verge and other websites  is acquiring Revere Digital  the company that owns technology news website Re/code  according to a post on the Re/code website on Tuesday.",
        "date": "05272015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Vox Media acquiring tech news website Re/code "
    },
    {
        "content": "May 26 Charter Communications Inc said it would buy Time Warner Cable Inc in a cash-and-stock deal that values the larger rival at $78.7 billion  to compete with No. 1 U.S. cable services provider Comcast Corp.",
        "date": "05262015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Charter to buy Time Warner Cable in a $78.7 bln deal "
    },
    {
        "content": "LOS ANGELES  May 26 Vox Media  owner of The Verge and other websites  is acquiring Revere Digital  the company that owns technology news website Re/code  according to a post on the Re/code website on Tuesday.",
        "date": "05272015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-Vox Media acquiring tech news website Re/code "
    },
    {
        "content": "WASHINGTON  May 26 Time Warner Cable  entering into talks to be acquired by  Charter Communications Inc just a month after regulators killed a proposed takeover by Comcast Corp's  was determined not to get burned a second time.",
        "date": "05272015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "RPT-Charter's Time Warner Cable bid faces $2 billion regulatory question "
    },
    {
        "content": "May 18 Cable operator Charter Communications Inc's planned buyout of Bright House Networks is on track  the companies said  defying expectations that the deal would fall through after the collapse of the Comcast-Time Warner Cable merger.",
        "date": "05182015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Charter  Bright House Networks say merger on track "
    },
    {
        "content": "Comcast Corp  on Monday named Carlyle Group LP  Co-President Michael Cavanagh as chief financial officer  bringing on a prominent dealmaker after its failed attempt to acquire Time Warner Cable Inc .",
        "date": "05112015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast names Carlyle Group's Michael Cavanagh as CFO "
    },
    {
        "content": "May 11 Comcast Corp on Monday named Carlyle Group LP Co-President Michael Cavanagh as chief financial officer  bringing on a prominent dealmaker after its failed attempt to acquire Time Warner Cable Inc.",
        "date": "05112015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-Comcast names Carlyle Group's Michael Cavanagh as CFO "
    },
    {
        "content": "Bright House Networks  the sixth largest U.S. cable operator  is preparing to abandon a $10.4 billion deal to be acquired by larger peer Charter Communications Inc   according to people familiar with the matter.",
        "date": "05072015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Exclusive: Bright House Networks plans to drop merger with Charter - sources "
    },
    {
        "content": "Shares of Cablevision Systems Corp  jumped as much as 8 percent after Chief Executive James Dolan said he would be interested in a \"deal\" with Time Warner Cable Inc   Comcast Corp  and other cable operators.",
        "date": "05062015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Cablevision shares jump after CEO says interested in 'deal' "
    },
    {
        "content": "May 11 Comcast Corp named Michael Cavanagh chief financial officer  succeeding Michael Angelakis.",
        "date": "05112015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast names Michael Cavanagh CFO "
    },
    {
        "content": "May 6 Shares of Cablevision Systems Corp  jumped as much as 8 percent after Chief Executive James Dolan said he would be interested in a \"deal\" with Time Warner Cable Inc  Comcast Corp and other cable operators.",
        "date": "05062015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Cablevision shares jump after CEO says interested in \"deal\" "
    },
    {
        "content": "CHICAGO A new feature on Comcast Corp's pay television service will let parents activate a child-friendly zone that provides access only to age-appropriate shows and movies  the company said on Tuesday.",
        "date": "05052015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast adds kids  voice control features to TV service "
    },
    {
        "content": "CHICAGO  May 5 A new feature on Comcast Corp's  pay television service will let parents activate a child-friendly zone that provides access only to age-appropriate shows and movies  the company said on Tuesday.",
        "date": "05052015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Comcast adds kids  voice control features to TV service "
    },
    {
        "content": "NEW YORK  May 4 Comcast Corp  the largest U.S. cable operator  posted better-than-expected first-quarter profit  driven by strong growth in its high-speed internet and business services.",
        "date": "05042015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast profit beats estimates on internet  enterprise growth "
    },
    {
        "content": "WASHINGTON  May 5 Netflix Inc has urged the U.S. Federal Communications Commission to reject the pending $48 billion merger of AT&T Inc and DirecTV unless its concerns about the deal are addressed.",
        "date": "05052015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-Netflix asks U.S. FCC to reject AT&T-DirecTV merger unless changes made "
    },
    {
        "content": "Cable company Charter Communications Inc  reported a bigger quarterly loss  hurt by costs from a failed deal between Comcast Corp  and Time Warner Cable Inc  that involved assets it was planning to buy.",
        "date": "05012015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Charter loss widens on costs from Comcast-Time Warner Cable deal "
    },
    {
        "content": "NEW YORK  May 4 Comcast Corp  the largest U.S. cable operator  posted better-than-expected first-quarter profit  driven by strong growth in its high-speed Internet and business services.",
        "date": "05042015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Comcast profit beats estimates on internet  enterprise growth "
    },
    {
        "content": "CHICAGO  May 5 A new feature on Comcast Corp's  pay television service will let parents activate a child-friendly zone that provides access only to age-appropriate shows and movies  the company said on Tuesday.",
        "date": "05052015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast adds child-friendly feature to TV service "
    },
    {
        "content": "May 1 Cable company Charter Communications Inc  reported a bigger quarterly loss  hurt by costs from a failed deal between Comcast Corp and Time Warner Cable Inc that involved assets it was planning to buy.",
        "date": "05012015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-Charter loss widens on costs from Comcast-Time Warner Cable deal "
    },
    {
        "content": "* CEO declines to answer questions about M&A on conference call",
        "date": "04302015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "UPDATE 3-Deal questions loom as Time Warner Cable reports subscriber uptick "
    },
    {
        "content": "April 28 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "04282015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "NEW YORK/WASHINGTON Comcast Corp's  board was meeting late on Thursday to finalize plans to abandon its proposed $45 billion merger with  Time Warner Cable Inc   according to a person directly familiar with the matter.",
        "date": "04232015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast looking to drop Time Warner Cable merger -source "
    },
    {
        "content": "Comcast Corp abandoned its $45 billion offer for Time Warner Cable Inc on Friday after U.S. regulators raised concerns that the deal would give Comcast an unfair advantage in the cable TV and Internet-based services market. | Video ",
        "date": "04242015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast drops Time Warner Cable bid after antitrust pressure "
    },
    {
        "content": "NEW YORK/WASHINGTON Comcast Corp's board was meeting late on Thursday to finalize plans to abandon its proposed $45 billion merger with  Time Warner Cable Inc  according to a person directly familiar with the matter. | Video ",
        "date": "04232015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast looking to drop Time Warner Cable merger: source "
    },
    {
        "content": "* Senator Franken: Collapse would be \"huge victory\" for consumers   (Recasts with new sourcing; adds quote from advocacy group  background)",
        "date": "04232015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 3-Comcast looking to drop Time Warner Cable merger -source "
    },
    {
        "content": "April 23 Comcast Corp's board was meeting late on Thursday to finalize plans to abandon its $45 billion merger agreement with  Time Warner Cable Inc  according to a person directly familiar with the matter.",
        "date": "04232015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast's board meets to drop Time Warner Cable bid -source "
    },
    {
        "content": "WASHINGTON  April 24 Comcast Corp's  failed bid to buy Time Warner Cable Inc is the latest muscle flex by U.S. antitrust enforcers and will likely deter chief executives from pursuing aggressive transactions as a way to spend excess cash.",
        "date": "04242015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Collapse of Comcast cable deal may chasten Wall Street  for a while "
    },
    {
        "content": "April 23 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "04232015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "April 24 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "04242015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "April 23 The following are the top stories on the New York Times business pages. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "04232015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "PRESS DIGEST- New York Times business news - April 23 "
    },
    {
        "content": "* Amazon shares touch life high after revenue beats estimates",
        "date": "04242015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "US STOCKS-Nasdaq hits 15-year high  propelled by tech triumvirate "
    },
    {
        "content": "WASHINGTON The U.S. Federal Communications Commission's staff has recommended that the agency designate Comcast Corp's proposed $45 billion acquisition of Time Warner Cable Inc for a hearing  the Wall Street Journal reported on Wednesday  calling it a significant setback for the deal.",
        "date": "04232015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "FCC staff recommends hearing for proposed Comcast-Time Warner Cable merger - WSJ "
    },
    {
        "content": "April 20 The following bids  mergers  acquisitions and disposals were reported by 1030 GMT on Monday:",
        "date": "04202015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* DOJ  FCC say merger would have given Comcast unfair advantage",
        "date": "04242015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 4-Comcast drops Time Warner Cable bid after antitrust pressure "
    },
    {
        "content": "WASHINGTON  April 22 The U.S. Federal Communications Commission's staff has recommended that the agency designate Comcast Corp's proposed $45 billion acquisition of Time Warner Cable Inc for a hearing  the Wall Street Journal reported on Wednesday  calling it a significant setback for the deal.",
        "date": "04232015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-U.S. FCC staff recommends hearing for proposed Comcast-Time Warner Cable merger -WSJ "
    },
    {
        "content": "* Amazon shares touch life high after revenue beats estimates",
        "date": "04242015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "US STOCKS-Wall St opens up  Nasdaq set to extend record "
    },
    {
        "content": "Representatives of Comcast Corp  and Time Warner Cable Inc  are preparing to meet U.S. Department of Justice officials to discuss competition concerns raised by the planned $45 billion merger of the two cable giants  the Wall Street Journal reported on Saturday.",
        "date": "04192015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast  Time Warner Cable to meet DoJ officials over merger: WSJ "
    },
    {
        "content": "WASHINGTON  April 21 U.S. Federal Communications Commission officials studying the proposed merger of Comcast Corp and Time Warner Cable Inc are scheduled to brief FCC commissioners' staff on their review on Wednesday  according to two sources familiar with the plan.",
        "date": "04212015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "UPDATE 1-U.S. FCC staff to be briefed on Comcast-TWC merger review Wednesday "
    },
    {
        "content": "April 17 Staff attorneys at the Justice Department's antitrust division are nearing a recommendation to block the proposed $45 billion merger of Comcast Corp  and Time Warner Cable Inc  Bloomberg reported on Friday  citing people familiar with the matter.",
        "date": "04172015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "UPDATE 2-Justice Dept. staff may oppose Comcast-Time Warner Cable deal-Bloomberg "
    },
    {
        "content": "Comcast Corp and Time Warner Cable Inc  said on Friday they had abandoned their proposed $45 billion merger after U.S. regulators said the deal would give Comcast an unfair advantage in the Internet-based services market.",
        "date": "04242015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast abandons $45 billion Time Warner Cable merger "
    },
    {
        "content": "April 18 Representatives of Comcast Corp  and Time Warner Cable Inc are preparing to meet U.S. Department of Justice officials to discuss competition concerns raised by the planned $45 billion merger of the two cable giants  the Wall Street Journal reported on Saturday.",
        "date": "04192015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Comcast  Time Warner Cable to meet U.S. Justice Dept officials over merger-WSJ "
    },
    {
        "content": "April 18 Representatives of Comcast Corp  and Time Warner Cable Inc are preparing to meet officials from the U.S. Department of Justice for talks on the planned merger of the two cable giants  the Wall Street Journal reported on Saturday.",
        "date": "04192015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast  Time Warner Cable to meet U.S. Justice Dept officials over merger-WSJ "
    },
    {
        "content": "WASHINGTON  April 21 Six U.S. senators on Tuesday asked the Federal Communications Commission and Justice Department to reject the $45 billion merger of the country's largest cable providers  Comcast Corp and Time Warner Cable Inc.",
        "date": "04212015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Six U.S. senators call for rejection of Comcast-TWC merger "
    },
    {
        "content": "April 17 Time Warner Cable said on Friday it has been working productively with the U.S. Department of Justice and the Federal Communications Commission and believes there is no basis for the DOJ to block the Comcast Corp  deal.   (Reporting by Jennifer Saba in New York; Editing by Chris Reese)",
        "date": "04172015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Time Warner Cable says no basis for DOJ to block Comcast deal "
    },
    {
        "content": "* Comcast shares up after it calls off Time Warner Cable merger",
        "date": "04242015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "US STOCKS-Wall St to open up on tech earnings  Nasdaq to extend record "
    },
    {
        "content": "WASHINGTON Six U.S. senators on Tuesday asked the Federal Communications Commission and Justice Department to reject the proposed $45 billion merger of the country's largest cable providers  Comcast Corp and Time Warner Cable Inc.",
        "date": "04212015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Six senators call for rejection of Comcast-TWC merger "
    },
    {
        "content": "* CEO Brian Roberts says the deal wasn't going to happen according to the government- CNBC   Further company coverage:    (Reporting By Jennifer Saba)",
        "date": "04242015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "BRIEF-Comcast CEO Brian Roberts says the deal wasn't going to happen according to the government- CNBC "
    },
    {
        "content": "WASHINGTON  April 21 Six U.S. senators on Tuesday asked the Federal Communications Commission and Justice Department to reject the proposed $45 billion merger of the country's largest cable providers  Comcast Corp and Time Warner Cable Inc.",
        "date": "04212015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Six U.S. senators call for rejection of Comcast-TWC merger "
    },
    {
        "content": "April 21 Hints that U.S. regulators could veto Comcast Corp's proposed $45 billion takeover of Time Warner Cable Inc have investment bankers worried about whether they will get paid  with smaller advisory firms particularly on edge.",
        "date": "04212015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Boutique banks to suffer most if Comcast-Time Warner Cable deal vetoed "
    },
    {
        "content": "NEW YORK  April 14 AT&T Inc and three cable and wireless trade groups filed separate lawsuits on Tuesday challenging the U.S. Federal Communications Commission over its new web traffic regulations.",
        "date": "04142015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 3-AT&T  trade groups mount court challenge to FCC Internet rules "
    },
    {
        "content": "NEW YORK AT&T Inc  and three cable and wireless trade groups filed separate lawsuits on Tuesday challenging the U.S. Federal Communications Commission over its new web traffic regulations.",
        "date": "04142015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "AT&T  trade groups mount court challenge to FCC Internet rules "
    },
    {
        "content": "NEW YORK Cable and wireless trade groups filed separate lawsuits on Tuesday challenging the U.S. Federal Communications Commission over its new web traffic regulations.",
        "date": "04142015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Trade groups mount legal challenges to FCC's new Internet rules "
    },
    {
        "content": "April 21 Hints that U.S. regulators could veto Comcast Corp's proposed $45 billion takeover of Time Warner Cable Inc have investment bankers worried about whether they will get paid  with smaller advisory firms particularly on edge.",
        "date": "04212015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "RPT-Boutique banks to suffer most if Comcast-Time Warner Cable deal vetoed "
    },
    {
        "content": "Comcast Corp  Chief Financial Officer Michael Angelakis will leave his position to head a new investment arm with up to $4.1 billion to invest in growth-oriented companies  Comcast said on Tuesday.",
        "date": "03312015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast to form $4 billion investment arm with CFO at helm "
    },
    {
        "content": "March 25 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "03252015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "March 31 Comcast Corp Chief Financial Officer Michael Angelakis will leave his position to head a new investment arm with up to $4.1 billion to invest in growth-oriented companies  Comcast said on Tuesday.",
        "date": "03312015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 3-Comcast to form $4 bln investment arm with CFO at helm "
    },
    {
        "content": "March 31 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "03312015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "John Malone-backed Charter Communications Inc said it would buy Bright House Networks in a $10.4 billion deal as it expands its cable network after losing out to Comcast Corp in a fight for Time Warner Cable Inc. | Video ",
        "date": "03312015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Charter beefs up cable muscle with Bright House deal "
    },
    {
        "content": "* Charter shares touch record high   (Adds analyst quote  updates shares)",
        "date": "03312015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 3-Charter beefs up cable muscle with Bright House deal "
    },
    {
        "content": "March 31 Cable television operator Charter Communications Inc said it would buy privately held Bright House Networks in a cash-and-stock deal valued at $10.4 billion to expand in Florida.",
        "date": "03312015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "CORRECTED-UPDATE 1-Charter Communications to buy Bright House in $10.4 bln deal "
    },
    {
        "content": "March 31 Comcast Corp  the largest U.S. cable operator  said it would form a new company with its chief financial officer  Michael Angelakis  to invest in and focus on operating growth-oriented companies both in the United States and international markets.",
        "date": "03312015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast to form new company with CFO Michael Angelakis "
    },
    {
        "content": "WASHINGTON AT&T Inc's proposed acquisition of satellite television company DirecTV is getting a smooth ride from U.S. regulators and industry rivals  who instead are directing their firepower at a merger deal between the nation's two biggest cable operators. | Video ",
        "date": "03172015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "AT&T-DirecTV merger escapes heat as all eyes on Comcast "
    },
    {
        "content": "AUSTIN  Tx. As his likely rivals spent the weekend shaking hands in New Hampshire  potential Republican candidate Rand Paul flew to Texas to court the software developers and entrepreneurs who are likely to play a central role in the 2016 election.",
        "date": "03172015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Rand Paul woos donors and hackers at tech conference "
    },
    {
        "content": "AUSTIN  Tx.  March 16 As his likely rivals spent the weekend shaking hands in New Hampshire  potential Republican candidate Rand Paul flew to Texas to court the software developers and entrepreneurs who are likely to play a central role in the 2016 election.",
        "date": "03162015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Rand Paul woos donors and hackers at tech conference "
    },
    {
        "content": "WASHINGTON  March 13 The U.S. Federal Communications Commission on Friday paused its informal 180-day countdown to deciding the fate of two mergers - Comcast Corp's  with Time Warner Cable Inc and AT&T Inc's  with DirecTV.",
        "date": "03132015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "U.S. FCC pauses clock on Comcast-TWC  AT&T-DirecTV merger reviews "
    },
    {
        "content": "Feb 24 Comcast Corp said on Tuesday it was \"optimistic\" that it would close its $45 billion deal to buy Time Warner Cable Inc in early 2015.",
        "date": "02242015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast expects to close to Time Warner Cable deal in early 2015 "
    },
    {
        "content": "Feb 24 Comcast Corp  the largest U.S. cable operator  posted higher fourth-quarter revenue as it added new video and high-speed internet customers.",
        "date": "02242015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast revenue rises as it adds video  internet customers "
    },
    {
        "content": "Comcast Corp and Time Warner Cable Inc have been sued for $20 billion for allegedly discriminating against African American-owned media and employing advocates such as the NAACP and the Rev. Al Sharpton to advance their bias.",
        "date": "02232015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast  Time Warner Cable hit with $20 billion racial bias lawsuit "
    },
    {
        "content": "Feb 24 Comcast Corp  the largest U.S. cable operator  posted fourth-quarter revenue that marginally beat estimates as the company added new video and high-speed internet customers.",
        "date": "02242015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-Comcast revenue rises as it adds video  internet customers "
    },
    {
        "content": "Feb 23 Comcast Corp and Time Warner Cable Inc have been sued for $20 billion for allegedly discriminating against African American-owned media and employing advocates such as the NAACP and the Rev. Al Sharpton to advance their bias.",
        "date": "02232015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast  Time Warner Cable hit with $20 bln racial bias lawsuit "
    },
    {
        "content": "Feb 14 Comcast Corp said on Friday that a California Public Utilities Commission Administrative (CPUC) law judge recommended  to approve its pending $45 billion merger with Time Warner Cable and related transactions with Charter Communications.",
        "date": "02142015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "California Public Utilities Commission recommends to approve Comcast merger "
    },
    {
        "content": "WASHINGTON  Feb 17 A fight between an upstart Spanish language TV network and Comcast Corp has provided more ammunition for critics who fear Comcast would gain too much market power if its buyout of Time Warner Cable Inc  goes ahead  antitrust attorneys said.",
        "date": "02172015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Comcast fight with upstart Spanish station is grist for merger foes "
    },
    {
        "content": "A U.S. appeals court has revived a bid by Applebee's employees in New York to pursue a wage-and-hour suit as a class action  the latest decision to find that a recent Supreme Court ruling that added a hurdle to class certification had been applied too broadly.",
        "date": "02112015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast ruling doesn't bar class action bid: 2nd Circuit "
    },
    {
        "content": "Comcast Corp  the largest U.S. cable operator  has been ordered to pay nearly $28 million in damages after a federal jury in Delaware found it infringed two fiber optics patents owned by Sprint Corp.",
        "date": "02062015",
        "name": "Comcast Corporation",
        "news_type": "topStory",
        "symbol": "CMCSA",
        "title": "Comcast to pay $27.6 mln for infringing two Sprint patents "
    },
    {
        "content": "WASHINGTON  Feb 4 The top U.S. communications regulator on Wednesday proposed to tighten regulations on Internet service providers by treating them more like public utilities  an approach endorsed by President Barack Obama.",
        "date": "02042015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 2-U.S. FCC chief seeks tighter regulation of Internet providers "
    },
    {
        "content": "A U.S. judge has rejected portions of Twenty-First Century Fox Inc's lawsuit seeking to stop Dish Network Corp from selling devices that let viewers skip over commercials when playing back shows.",
        "date": "01212015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "Fox loses U.S. copyright claims over Dish ad-skipper "
    },
    {
        "content": "WASHINGTON  Jan 9 Some 20 state attorneys general have joined the federal antitrust investigation of competing bids by Dollar General Corp and Dollar Tree Inc  to buy Family Dollar Stores  Inc  a development that potentially complicates the companies' efforts to win U.S. approval for a deal.",
        "date": "01092015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "UPDATE 1-20 states join U.S. antitrust probe of Family Dollar merger "
    },
    {
        "content": "WASHINGTON  Jan 9 Some 20 state attorneys general have joined the federal antitrust investigation of competing bids by Dollar General Corp and Dollar Tree Inc  to buy Family Dollar Stores  Inc  a development that potentially complicates the companies' efforts to win U.S. approval for a deal.",
        "date": "01092015",
        "name": "Comcast Corporation",
        "news_type": "normal",
        "symbol": "CMCSA",
        "title": "20 states join U.S. antitrust probe of Family Dollar merger "
    }
]