[
    {
        "content": "LONDON  March 10 ICE's sterling-denominated cocoa futures contract faces a challenge from two euro-based contenders this month  but the odds look stacked in favour of the established market.",
        "date": "03102015",
        "name": "CME Group Inc",
        "news_type": "topStory",
        "symbol": "CME",
        "title": "Sterling-based cocoa contract seen enduring euro denominated upstarts "
    },
    {
        "content": "March 9 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "03092015",
        "name": "CME Group Inc",
        "news_type": "topStory",
        "symbol": "CME",
        "title": "MOVES- BNY Mellon  Citizens Financial  LPL  U.S. Bank  UBS "
    },
    {
        "content": "March 9 CME Group Inc  operator of the world's largest futures market  said it appointed Christopher Fix as managing director and head of Asia Pacific.",
        "date": "03092015",
        "name": "CME Group Inc",
        "news_type": "normal",
        "symbol": "CME",
        "title": "MOVES-CME Group appoints Christopher Fix head of Asia Pacific "
    },
    {
        "content": "NEW YORK  March 4 The CME Group Inc will launch a physically delivered crude oil storage futures contract in the U.S. Gulf Coast at the end of March that traders say may be timely given record levels of stockpiles nationwide.",
        "date": "03042015",
        "name": "CME Group Inc",
        "news_type": "topStory",
        "symbol": "CME",
        "title": "REFILE-UPDATE 1-CME Group to launch new physical crude storage contract "
    },
    {
        "content": "Feb 4 Most open-outcry futures trading pits in Chicago and New York will close by July 2 due to almost all trading having moved to electronic platforms  the CME Group Inc  said on Wednesday.",
        "date": "02042015",
        "name": "CME Group Inc",
        "news_type": "normal",
        "symbol": "CME",
        "title": "CME Group to close Chicago  New York open-outcry futures trading pits "
    },
    {
        "content": "CHICAGO  Jan 30 GFI Group Inc  shareholders on Friday rejected a proposed takeover by CME Group Inc  forcing the companies to terminate a merger agreement  according to the companies.",
        "date": "01302015",
        "name": "CME Group Inc",
        "news_type": "normal",
        "symbol": "CME",
        "title": "GFI Group shareholders reject proposed CME Group takeover "
    },
    {
        "content": "CHICAGO  Jan 30 GFI Group Inc  shareholders on Friday voted down a proposed takeover by CME Group Inc  the companies said  opening the door for a hostile bid from rival BGC Partners.",
        "date": "01302015",
        "name": "CME Group Inc",
        "news_type": "normal",
        "symbol": "CME",
        "title": "UPDATE 1-GFI Group shareholders reject proposed CME Group takeover "
    },
    {
        "content": "* CME Group to also launch cash-settled dollar cocoa contract",
        "date": "01272015",
        "name": "CME Group Inc",
        "news_type": "topStory",
        "symbol": "CME",
        "title": "UPDATE 2-CME Group to launch euro-denominated cocoa contract "
    },
    {
        "content": "LONDON  Jan 27 The world's largest futures market operator  CME Group Inc. has launched six European natural gas cleared futures contracts which will be listed on its CME Europe exchange from February 2.",
        "date": "01272015",
        "name": "CME Group Inc",
        "news_type": "normal",
        "symbol": "CME",
        "title": "CME Group launches six European natural gas contracts "
    },
    {
        "content": "CHICAGO  Jan 23 CME Group Inc on Friday fined a unit owned by JPMorgan Chase & Co $210 000 and an affiliate of Credit Suisse $175 000 for various trading violations.",
        "date": "01232015",
        "name": "CME Group Inc",
        "news_type": "normal",
        "symbol": "CME",
        "title": "CME Group fines Credit Suisse  JPM units for trading violations "
    }
]