[
    {
        "content": "BOSTON  Oct 25 Activist investor William Ackman on Wednesday said he believes directors and investors in Chipotle Mexican Grill Inc are disappointed in the chain's recent performance  on a day its shares hit their lowest since 2013.",
        "date": "10262017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Ackman: All directors  shareholders 'disappointed' by Chipotle slide "
    },
    {
        "content": "Oct 24 Chipotle Mexican Grill Inc will open fewer restaurants to get \"fundamentals right\" and posted disappointing quarterly sales and earnings on Tuesday  as the company struggles to recover from a bruising string of food safety lapses.",
        "date": "10242017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "UPDATE 3-Chipotle shares fall as store openings scaled back  profit disappoints "
    },
    {
        "content": "Chipotle Mexican Grill Inc's  shares slumped to their lowest in nearly five years after disappointing results on Tuesday suggested that the burrito chain's recovery from a food-safety scandal would take much longer than expected. | Video ",
        "date": "10252017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle recovery seen dragging on  shares plunge "
    },
    {
        "content": "* Chipotle - ‍board announced authorized repurchases of common stock with total purchase price of $100 million  exclusive of commissions - sec filing",
        "date": "10242017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle ‍board announces repurchase of common stock "
    },
    {
        "content": "NEW YORK  Oct 25 Short-sellers who had targeted Chipotle Mexican Grill Inc logged a nearly quarter billion dollar paper profit on Wednesday  a day after the burrito chain reported weaker-than-expected sales that sent its shares into a swoon.",
        "date": "10252017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Short-sellers taste profits as Chipotle shares plunge "
    },
    {
        "content": "* Chipotle third quarter diluted EPS increased 155 pct on 8.8 pct revenue growth",
        "date": "10242017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle reports Q3 earnings per share $0.69 "
    },
    {
        "content": "Oct 24 Chipotle Mexican Grill Inc reported a smaller-than-expected rise in sales at established restaurants  hurt by mixed reviews of its new queso side dish and a Norovirus outbreak that forced the brief closure of a Virginia restaurant in July.",
        "date": "10242017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle's same-store sales misses estimates "
    },
    {
        "content": "NEW YORK  Oct 25 Short-sellers who had targeted Chipotle Mexican Grill Inc logged a nearly quarter billion dollar paper profit on Wednesday  a day after the burrito chain reported weaker-than-expected sales that sent its shares into a swoon.",
        "date": "10252017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 1-Short-sellers taste profits as Chipotle shares plunge "
    },
    {
        "content": "Oct 25 Chipotle Mexican Grill Inc's shares slumped to their lowest in nearly five years after disappointing results on Tuesday suggested that the burrito chain's recovery from a food-safety scandal would take much longer than expected.",
        "date": "10252017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 1-Chipotle recovery seen dragging on  shares plunge "
    },
    {
        "content": "* Futures down: Dow 8 pts  S&P 3 pts  Nasdaq 9.75 pts (Adds details and comment  updates price)",
        "date": "10252017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "US STOCKS-Tepid earnings to pressure Wall St at open "
    },
    {
        "content": "Oct 25 Chipotle Mexican Grill Inc's shares were set to open at a near five-year low  a day after the burrito chain reported disappointing results  indicating that investors would have to wait much longer than expected for sales and profit to recover.",
        "date": "10252017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle recovery seen dragging on  shares sink "
    },
    {
        "content": "Chipotle Mexican Grill Inc  will open fewer restaurants to get \"fundamentals right\" and posted disappointing quarterly sales and earnings on Tuesday  as the company struggles to recover from a bruising string of food safety lapses. | Video ",
        "date": "10252017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle shares fall as store openings scaled back  profit disappoints "
    },
    {
        "content": "Oct 13 Facebook Inc on Friday launched a service through which its U.S. users can order food for take-away or delivery directly through its app or website.",
        "date": "10132017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Facebook launches U.S. food order and delivery service "
    },
    {
        "content": "A federal appeals court on Wednesday upheld the dismissal of a lawsuit in Florida accusing Chipotle Mexican Grill Inc of falsely advertising that it had eliminated genetically modified organisms (GMOs) from its menu.",
        "date": "10042017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle wins appeal in lawsuit over GMO advertising "
    },
    {
        "content": "* Chef Richard Blais to lead Tasty Made burger concept for Chipotle Source text for Eikon: Further company coverage:",
        "date": "09262017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "BRIEF-Chef Richard Blais to lead Tasty Made burger concept for Chipotle "
    },
    {
        "content": "LOS ANGELES  Sept 22 Chipotle Mexican Grill Inc's new \"queso\" cheese sauce is going over better on Wall Street than on Twitter  where one person called it a \"crime against cheese.\"",
        "date": "09222017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Wall Street lukewarm on Chipotle's new 'queso' amid customer scorn "
    },
    {
        "content": "SAN FRANCISCO Shares of Chipotle Mexican Grill  sank more than 3 percent on Monday as customers on social media turned up their noses at the burrito seller's new \"queso\" cheese topping.",
        "date": "09182017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle slides as customers turn up noses at cheese dip "
    },
    {
        "content": "SAN FRANCISCO  Sept 18 Shares of Chipotle Mexican Grill sank more than 3 percent on Monday as customers on social media turned up their noses at the burrito seller's new \"queso\" cheese topping.",
        "date": "09182017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 1-Chipotle slides as customers turn up noses at cheese dip "
    },
    {
        "content": "SAN FRANCISCO  Sept 18 Shares of Chipotle Mexican Grill sank 3 percent on Monday as customers on social media turned up their noses at the burrito seller's new \"queso\" cheese topping.",
        "date": "09182017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle slides as customers turn up nose at cheese dip "
    },
    {
        "content": "* ‍Reopened its doors to first-ever Chipotle restaurant in Denver following a renovation​ Source text for Eikon: Further company coverage:",
        "date": "09072017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle Mexican Grill ‍reopens its doors to Chipotle restaurant in Denver after renovation​ "
    },
    {
        "content": "A former Chipotle Mexican Grill Inc employee has told a federal judge in New Jersey that the company's \"brazen\" bid to hold her in contempt of an order blocking an Obama administration overtime pay rule should not hold up her proposed wage-and-hour class action.",
        "date": "08232017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Judge asked to reject Chipotle's bid to stay overtime pay case "
    },
    {
        "content": "LOS ANGELES  Aug 10 Chipotle Mexican Grill Inc on Thursday said it has closed the Dallas restaurant where a diner shot video of rodents crawling on the restaurant floor that was widely shared on the internet three weeks ago.",
        "date": "08102017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle closes Dallas restaurant seen in viral rodent video "
    },
    {
        "content": "Chipotle Mexican Grill Inc says a former employee and her lawyers should be held in contempt for claiming that a Texas judge's order blocking an Obama administration rule to extend mandatory overtime pay to millions of workers did not prevent private plaintiffs from suing under it.",
        "date": "08022017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle seeks contempt order over Obama OT pay rule claims "
    },
    {
        "content": "NEW YORK  July 31 More well-publicized incidents at Chipotle Mexican Grill Inc restaurants have pushed the shares down 26 percent over the last three months  but the burrito chain is facing a more subtle threat that could weigh on the stock: it is losing favor with growth fund managers and yet remains too expensive to attract value-oriented funds in their place.",
        "date": "07312017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Lack of value fund interest could be another bad omen for Chipotle "
    },
    {
        "content": "* Chipotle second quarter diluted EPS increased 167 pct on comparable restaurant sales increase of 8.1 pct and revenue growth of 17.1 pct",
        "date": "07252017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle posts Q2 earnings per share $2.32 "
    },
    {
        "content": "LOS ANGELES  July 25 Chipotle Mexican Grill Inc's profit more than doubled in the latest second quarter  sending shares of the burrito seller up more than 2 percent in after-hours trading on Tuesday.",
        "date": "07252017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle profit doubles  shares rise "
    },
    {
        "content": "By Daniel Wiessner Chipotle Mexican Grill Inc has rejected a former employee's claim in a proposed class action that an Obama administration rule to extend mandatory overtime pay to more than 4 million workers is in effect  even though it has been blocked by a federal judge.",
        "date": "07272017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle responds to lawsuit claiming Obama OT rule in effect "
    },
    {
        "content": "Billionaire investor William Ackman is buying a large stake in Automatic Data Processing Inc   two people familiar with the matter said on Thursday  a move that sent the U.S. payroll company's stock up 16.5 percent to a record high.",
        "date": "07272017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Ackman's Pershing Square bets on ADP  sends stock to record high "
    },
    {
        "content": "LOS ANGELES Shares of Chipotle Mexican Grill Inc  lost more ground on Monday  after analysts cut stock price targets and raised doubts about whether the burrito chain can raise menu prices to offset higher costs.",
        "date": "07242017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Analysts cut Chipotle stock target  question menu price hikes "
    },
    {
        "content": "July 26 Chipotle Mexican Grill Inc said U.S. federal prosecutors served a subpoena  seeking information related to a suspected norovirus outbreak at a restaurant in Sterling  Virginia that it briefly closed last week.",
        "date": "07262017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle served another subpoena after latest food scare "
    },
    {
        "content": "July 27 Billionaire investor William Ackman is buying a large stake in Automatic Data Processing Inc  two people familiar with the matter said on Thursday  a move that sent the U.S. payroll company's stock up 16.5 percent to a record high.",
        "date": "07272017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Ackman's Pershing Square bets on ADP  sends stock to record high "
    },
    {
        "content": "LOS ANGELES  July 24 Shares of Chipotle Mexican Grill Inc lost more ground on Monday  after analysts cut stock price targets and raised doubts about whether the burrito chain can raise menu prices to offset higher costs.",
        "date": "07242017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Analysts cut Chipotle stock target  question menu price hikes "
    },
    {
        "content": "LOS ANGELES Chipotle Mexican Grill Inc  is retraining kitchen crews on food safety and enforcing a zero-tolerance policy for employees refusing to abide by new rules  after identifying a sick employee as the cause of a Norovirus outbreak that forced it to briefly close a restaurant in Virginia last week.",
        "date": "07262017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle links sick worker to latest Norovirus outbreak "
    },
    {
        "content": "LOS ANGELES  July 25 Chipotle Mexican Grill Inc is retraining kitchen crews on food safety and enforcing a zero-tolerance policy for employees refusing to abide by new rules  after identifying a sick employee as the cause of a Norovirus outbreak that forced it to briefly close a restaurant in Virginia last week.",
        "date": "07262017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 3-Chipotle links sick worker to latest Norovirus outbreak "
    },
    {
        "content": "BOSTON Chipotle Mexican Grill Inc  shares fell to a four-year low on Thursday after testing confirmed Norovirus in a customer who ate at one of the chain's Virginia restaurants and a video of rodents crawling on the floor of a Dallas shop went viral.",
        "date": "07202017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle shares fall on Norovirus  rodent incidents "
    },
    {
        "content": "Chipotle Mexican Grill Inc  closed a restaurant in Virginia because of a suspected norovirus outbreak among some diners that sent its shares lower on Tuesday as the chain works to bounce back from past food-safety lapses.",
        "date": "07182017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle shuts Virginia restaurant on norovirus worries  shares fall "
    },
    {
        "content": "BOSTON  July 20 Chipotle Mexican Grill Inc shares fell to a four-year low on Thursday after testing confirmed Norovirus in a customer who ate at one of the chain's Virginia restaurants and a video of rodents crawling on the floor of a Dallas shop went viral.",
        "date": "07202017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 3-Chipotle shares fall on Norovirus  rodent incidents "
    },
    {
        "content": "July 18 Chipotle Mexican Grill Inc closed a restaurant in Virginia because of a suspected norovirus outbreak among some diners that sent its shares lower on Tuesday as the chain works to bounce back from past food-safety lapses.",
        "date": "07182017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Chipotle shuts Virginia restaurant on norovirus worries  shares fall "
    },
    {
        "content": "July 18 Chipotle Mexican Grill Inc closed a restaurant in Virginia due to a suspected norovirus outbreak among some diners  sending shares down more than 6 percent on Tuesday.",
        "date": "07182017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle shuts Virginia restaurant due to customer illness  shares fall "
    },
    {
        "content": "BOSTON Testing has confirmed Norovirus in a customer who ate at the Virginia Chipotle Mexican Grill Inc restaurant that was briefly closed earlier this week following multiple reports of diners falling ill  a county health department official said on Thursday.",
        "date": "07202017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle Virginia customer tested positive for Norovirus -official "
    },
    {
        "content": "BOSTON  July 20 Testing has confirmed norovirus in a customer who ate at the Virginia Chipotle Mexican Grill Inc restaurant that was briefly closed earlier this week following multiple reports of diners falling ill  a county health department official told Reuters on Thursday.",
        "date": "07202017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle Virginia customer tested positive for norovirus -official "
    },
    {
        "content": "Chipotle Mexican Grill Inc on Wednesday was hit with a proposed class action lawsuit claiming the company - and every other private employer in the U.S. - must comply with a rule extending overtime pay to millions of workers  even though it was blocked by a federal judge.",
        "date": "06072017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "In Chipotle lawsuit  worker says overtime pay rule alive and well "
    },
    {
        "content": "May 26 Hackers used malware to steal customer payment data from most of Chipotle Mexican Grill Inc's restaurants over a span of three weeks  the company said on Friday  adding to woes at the chain whose sales had just started recovering from a string of food safety lapses in 2015.",
        "date": "05272017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "UPDATE 4-Chipotle says hackers hit most restaurants in data breach "
    },
    {
        "content": "Hackers used malware to steal customer payment data from most of Chipotle Mexican Grill Inc's  restaurants over a span of three weeks  the company said on Friday  adding to woes at the chain whose sales had just started recovering from a string of food safety lapses in 2015. | Video ",
        "date": "05302017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle says hackers hit most restaurants in data breach "
    },
    {
        "content": "May 26 Chipotle Mexican Grill Inc said on Friday hackers used malware to access customers' card data  including its number  expiration date and internal verification codes  from payment systems at some of its restaurants between March 24 and April 18.",
        "date": "05262017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle probe finds hackers stole payment card info in data breach "
    },
    {
        "content": "* Chipotle Mexican Grill reports findings from investigation of payment card security incident",
        "date": "05262017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle reports findings from investigation of payment card security incident "
    },
    {
        "content": "LAS VEGAS  May 18 Billionaire investor William Ackman  who invested with casual dining company Chipotle Mexican Grill Inc last year  said on Thursday that the company's Chief Executive Officer Steve Ells is \"outstanding.\"",
        "date": "05192017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Ackman calls Chipotle CEO Ells 'outstanding' "
    },
    {
        "content": "* Boatwright comes to Chipotle from Arby's Restaurant Group Source text for Eikon: Further company coverage:",
        "date": "05112017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle names Scott Boatwright chief restaurant officer "
    },
    {
        "content": "BOSTON  May 10 Billionaire investor William Ackman is making money on one of his new investment ideas  but he declined on Wednesday to identify the portfolio company  which has gained 30 percent since he first bought it.",
        "date": "05102017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Ackman has a winner that is up 30 percent but will not name names "
    },
    {
        "content": "LOS ANGELES Chipotle Mexican Grill Inc  on Tuesday reported a sharp rise in sales at its restaurants as it recovers from food safety lapses that drove away customers but disclosing a data breach erased some of the stock's after-hours rally.",
        "date": "04252017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle data breach clouds recovery from food safety woes "
    },
    {
        "content": "LOS ANGELES  April 25 Chipotle Mexican Grill Inc on Tuesday reported a sharp rise in sales at its restaurants as it recovers from food safety lapses that drove away customers but disclosing a data breach erased some of the stock's after-hours rally.",
        "date": "04252017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Chipotle data breach clouds recovery from food safety woes "
    },
    {
        "content": "* Chipotle Mexican Grill Inc announces first quarter 2017 results",
        "date": "04252017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle Mexican Grill reports Q1 earnings per share $1.60 "
    },
    {
        "content": "LOS ANGELES  April 25 Chipotle Mexican Grill Inc reported better-than-expected first-quarter sales at established restaurants  sending shares in the beleaguered burrito seller almost 6 percent higher in after-hours trading on Tuesday.",
        "date": "04252017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle restaurant sales soar  shares follow "
    },
    {
        "content": "* No added colors  flavors or preservatives in ingredients used to prepare food; applies to all Chipotle restaurants in U.S.",
        "date": "03282017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle Mexican Grill says no added colors or preservatives used to prepare food "
    },
    {
        "content": "Chipotle Mexican Grill Inc  said on Thursday it would strengthen its lead director position in an agreement with a group of shareholders who are withdrawing their proposal to split the chief executive and chairman roles.",
        "date": "03302017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle shareholders pull vote to split CEO  chairman jobs "
    },
    {
        "content": "March 30 Chipotle Mexican Grill Inc said on Thursday it would strengthen its lead director position in an agreement with a group of shareholders who are withdrawing their proposal to split the chief executive and chairman roles.",
        "date": "03302017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Chipotle shareholders pull vote to split CEO  chairman jobs "
    },
    {
        "content": "* Chipotle Mexican Grill - entered into agreements with Steve Ells  CEO  Jack Hartung  CFO Mark Crumpacker  to modify terms of performance share awards",
        "date": "03302017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle Mexican Grill enter agreements with CEO and CFO to modify terms of performance share awards "
    },
    {
        "content": "* CEO Steve Ells' FY 2016 total compensation was $15.7 million versus $13.8 million in fy 2015 - SEC Filing",
        "date": "03302017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle Mexican Grill CEO Steve Ells' FY 2016 total compensation was $15.7 mln - SEC Filing "
    },
    {
        "content": "March 30 The burrito chain Chipotle Mexican Grill Inc said on Thursday its shareholders agreed to withdraw a proposal to split the chief executive and chairman roles.",
        "date": "03302017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle says shareholders drop bid to split CEO  chairman roles "
    },
    {
        "content": "Chipotle Mexican Grill Inc  which has been under pressure from activist shareholder Bill Ackman  on Friday said four of its 12 directors would not stand for re-election at the burrito chain's upcoming shareholder meeting.",
        "date": "03172017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle says a third of directors will not seek re-election "
    },
    {
        "content": "March 17 Chipotle Mexican Grill Inc  which has been under pressure from activist shareholder Bill Ackman  on Friday said four of its 12 directors would not stand for re-election at the burrito chain's upcoming shareholder meeting.",
        "date": "03172017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 4-Chipotle says a third of directors will not seek re-election "
    },
    {
        "content": "Chipotle Mexican Grill Inc   which has been under pressure from activist shareholder Bill Ackman  on Friday said four of its 12 directors would not stand for re-election at the burrito chain's upcoming shareholder meeting.",
        "date": "03172017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle says one-third of directors will not run again "
    },
    {
        "content": "NEW YORK  March 8 Chipotle Mexican Grill Inc  on Wednesday won the dismissal of a lawsuit claiming it defrauded shareholders about its ability to protect customers from at least seven norovirus  E.coli and salmonella outbreaks that erupted in 2015.",
        "date": "03082017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle lawsuit over food safety  outbreaks is dismissed "
    },
    {
        "content": "* Chipotle Mexican Grill Inc files for potential offering of 2.9 million shares by selling stockholders - SEC filing",
        "date": "03032017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle Mexican Grill files for potential offering of 2.9 mln shares "
    },
    {
        "content": "* Pershing Square Capital Management LP raises sole share stake in Chipotle Mexican Grill Inc to 2.9 million shares from 554 213 shares",
        "date": "02142017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "BRIEF-Pershing Square Capital Management raises sole share stake in Chipotle "
    },
    {
        "content": "* Pershing Square Capital Management - On Feb 3  2017  Chipotle Mexican Grill entered registration rights agreement with Pershing Square - SEC Filing",
        "date": "02072017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "BRIEF-Pershing Square Capital Management says Chipotle Mexican Grill entered registration rights agreement with company - SEC Filing "
    },
    {
        "content": "Chipotle Mexican Grill Inc  could fall as much as 35 percent in the next year  Barron's reported on Sunday.",
        "date": "02062017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle stock could fall as much as 35 percent over next year: Barron's "
    },
    {
        "content": "Chipotle Mexican Grill Inc's  sales rose for the first time in five quarters as the burrito chain's efforts to bring back diners after a series of food safety lapses start to pay off.",
        "date": "02022017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Burrito chain Chipotle's sales rise for first time in five quarters "
    },
    {
        "content": "Feb 2 Chipotle Mexican Grill Inc's sales rose for the first time in five quarters as the burrito chain's efforts to bring back diners after a series of food safety lapses start to pay off.",
        "date": "02022017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Burrito chain Chipotle's sales rise for first time in 5 quarters "
    },
    {
        "content": "* Chipotle Mexican Grill  Inc. announces fourth quarter and full year 2016 results",
        "date": "02022017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle Mexican Grill Q4 earnings per share $0.55 "
    },
    {
        "content": "Feb 2 Chipotle Mexican Grill Inc's  quarterly profit fell 76.5 percent  hurt by minimum wage increases  higher spending on advertising  promotions and a spike in costs for avocados  the main ingredient in guacamole.",
        "date": "02022017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Burrito chain Chipotle's profit falls 76.5 pct "
    },
    {
        "content": "* Chipotle names new agency partners for advertising  media services",
        "date": "01192017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle names new agency partners for advertising  media services "
    },
    {
        "content": "Chipotle Mexican Grill  on Tuesday reported a jump in December sales at established restaurants  suggesting the worst may be over for the burrito chain that has struggled to recover from a string of food safety lapses.",
        "date": "01102017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle restaurant sales jump in December  stock follows "
    },
    {
        "content": "Jan 10 Chipotle Mexican Grill on Tuesday reported a jump in December sales at established restaurants  suggesting the worst may be over for the burrito chain that has struggled to recover from a string of food safety lapses.",
        "date": "01102017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 3-Chipotle restaurant sales jump in December  stock follows "
    },
    {
        "content": "Jan 10 Chipotle Mexican Grill Inc said sales at established restaurants likely fell 4.8 percent in the fourth quarter and that costs came in higher than it had previously anticipated.",
        "date": "01102017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle Mexican estimates 4.8 pct drop in 4th-qtr comparable sales "
    },
    {
        "content": "* Chipotle Mexican Grill Inc sees Q4 comparable restaurant sales decrease of 4.8%",
        "date": "01102017",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle Mexican Grill Inc sees Q4 comparable restaurant sales decrease of 4.8 pct "
    },
    {
        "content": "Chipotle Mexican Grill Inc   under pressure from activist investor Bill Ackman  named four new board members on Friday  paving the way for a reunion of sorts between its chief executive and a former top executive at McDonald's  which once owned the burrito chain.",
        "date": "12162016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Pushed by investor Ackman  Chipotle adds four new directors "
    },
    {
        "content": "BOSTON/LOS ANGELES Union-affiliated adviser CtW Investment Group on Tuesday stepped up pressure on Chipotle Mexican Grill Inc  by urging billionaire investor William Ackman to play a hand in recruiting new directors to the restaurant company's board.",
        "date": "12132016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle shareholder urges Ackman to recruit new board members "
    },
    {
        "content": "Chipotle Mexican Grill Inc said founder Steve Ells will retake the helm as sole chief executive officer after co-CEO Monty Moran stepped down on Monday amid intense pressure to turn around the burrito chain which has struggled to recover from a string of food safety lapses that have damaged its sales and reputation.",
        "date": "12122016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle founder Ells takes over as sole CEO at burrito chain "
    },
    {
        "content": "LOS ANGELES Chipotle Mexican Grill Inc   amid activist pressure to revamp its board and revive sales following last year's string of food safety lapses  will \"shortly\" announce a new slate of directors  founder and co-chief executive Steve Ells said on Tuesday.",
        "date": "12062016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle says new director slate due 'shortly ' recovery lags "
    },
    {
        "content": "* Takes sole shared stake of 554 213 shares in Chipotle Mexican Grill - SEC filing",
        "date": "11142016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "BRIEF-Pershing Square takes sole shared stake in Chipotle "
    },
    {
        "content": "Nov 10 Billionaire investor William Ackman on Thursday said he has had an \"extremely constructive relationship\" with Chipotle Mexican Grill Inc since buying a large stake in the beleaguered company.",
        "date": "11102016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Activist Ackman calls Chipotle relationship 'extremely constructive' "
    },
    {
        "content": "Nov 10 Billionaire investor William Ackman on Thursday said he has had an \"extremely constructive relationship\" with Chipotle Mexican Grill Inc since buying a large stake in the beleaguered burrito seller.",
        "date": "11102016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Activist Ackman calls Chipotle relationship 'extremely constructive' "
    },
    {
        "content": "BOSTON/LOS ANGELESBillionaire investor William Ackman and Chipotle Mexican Grill  have signed an agreement to engage in confidential discussions  a source familiar with the matter said  in a sign that the activist may be able to force change at the burrito chain without a costly and drawn-out proxy contest.",
        "date": "11042016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Exclusive: Chipotle  Ackman talks intensify with confidentiality agreement "
    },
    {
        "content": "BOSTON/LOS ANGELES Two union-affiliated shareholders in Chipotle Mexican Grill on Tuesday said they would propose replacing the company's chairman  Steve Ells  who founded Chipotle  with an independent director  piling on pressure after well-known activist Bill Ackman took a large stake in the company.",
        "date": "11022016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle investors propose ousting founder as chairman "
    },
    {
        "content": "BOSTON  Nov 1 Amalgamated Bank and CtW Investment Group  which works with union-sponsored pension funds  are calling on Chipotle to replace its current board chairman  Steve Ells  with an independent director to help the burrito chain to rehabilitate its brand.",
        "date": "11012016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle shareholders demand independent board chair "
    },
    {
        "content": "BOSTON/LOS ANGELES  Nov 1 Two union-affiliated shareholders in Chipotle Mexican Grill on Tuesday said they would propose replacing the company's chairman  Steve Ells  who founded Chipotle  with an independent director  piling on pressure after well-known activist Bill Ackman took a large stake in the company.",
        "date": "11022016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 3-Chipotle investors propose ousting founder as chairman  "
    },
    {
        "content": "BOSTON/LOS ANGELES Chipotle Mexican Grill Inc has turned to high-profile investment bankers and lawyers to help defend against activist investor William Ackman  according to two people familiar with the matter on Thursday.",
        "date": "10282016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Exclusive: Chipotle builds team to defend against activist investor Ackman - sources "
    },
    {
        "content": "BOSTON/LOS ANGELES Chipotle Mexican Grill Inc  has turned to high-profile investment bankers and lawyers to help defend against activist investor William Ackman  according to two people familiar with the matter on Thursday.",
        "date": "10282016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle builds team to defend against activist investor Ackman -sources "
    },
    {
        "content": "* Chipotle Mexican Grill says it plans to reduce restaurant level operating costs and general and administrative costs as a percent of revenue in 2017  Source text for Eikon: (http://bit.ly/2dVL5oK) Further company coverage:",
        "date": "10262016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle Mexican Grill plans to reduce costs as a percent of revenue in 2017 "
    },
    {
        "content": "Oct 25 Chipotle Mexican Grill Inc on Tuesday said it expects sales at established restaurants to grow in the \"high single digit\" percentages next year  which would end a long string of declines following food safety lapses last year.",
        "date": "10252016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle quarterly restaurant sales down more than expected "
    },
    {
        "content": "Oct 25 Chipotle Mexican Grill Inc on Tuesday reported a bigger-than-expected drop in quarterly sales at established restaurants as it fights to recover from a string of food safety lapses late last year.",
        "date": "10252016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Chipotle quarterly restaurant sales down more than expected "
    },
    {
        "content": "* Chipotle Mexican Grill  Inc. announces third quarter 2016 results",
        "date": "10252016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle Mexican Grill qtrly comparable restaurant transactions fell 15.2 pct "
    },
    {
        "content": "BOSTON  Sept 30 Fidelity's Contrafund  the largest mutual fund investor in Chipotle Mexican Grill Inc   cut its stake in the struggling burrito chain by 19 percent in August  Fidelity disclosed on Friday.",
        "date": "09302016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Fidelity Contrafund continues to slash stake in struggling Chipotle "
    },
    {
        "content": "BOSTON  Sept 30 Fidelity's Contrafund  the largest mutual fund investor in Chipotle Mexican Grill Inc   cut its stake in the struggling burrito chain by 19 percent in August  Fidelity disclosed on Friday.",
        "date": "09302016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 1-Fidelity Contrafund continues to slash stake in struggling Chipotle "
    },
    {
        "content": "* Says slater most recently served as managing director of costa coffee in U.K. and Ireland",
        "date": "09192016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle Mexican Grill names Jim Slater as managing director in Europe "
    },
    {
        "content": "* Announced to hire 5 000 new employees  topping its 2015 goal of 4 000.  Source text for Eikon:  Further company coverage:",
        "date": "09142016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle to hire 5 000 employees on second-annual National Career Day "
    },
    {
        "content": "CHICAGO A U.S. congresswoman urged the Labor Department on Monday to investigate Chipotle Mexican Grill for possible wage theft  another potential hurdle for the burrito chain as it seeks to rebound from food-safety problems last year.",
        "date": "09122016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "U.S. congresswoman urges Labor Department to probe Chipotle over wage theft allegations "
    },
    {
        "content": "CHICAGO  Sept 12 A U.S. congresswoman urged the Labor Department on Monday to investigate Chipotle Mexican Grill  for possible wage theft  another potential hurdle for the burrito chain as it seeks to rebound from food-safety problems last year.",
        "date": "09122016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "U.S. congresswoman urges Labor Dept to probe Chipotle over wage theft allegations "
    },
    {
        "content": "BOSTON  Sept 6 Billionaire investor William Ackman said in a filing on Tuesday that his firm now owns 9.9 percent of the outstanding shares in Chipotle Mexican Grill Inc .",
        "date": "09062016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Ackman's Pershing Square takes new position in Chipotle "
    },
    {
        "content": "CHICAGO  Sept 8 Chipotle Mexican Grill  has agreed to financial settlements with more than 100 customers who fell ill after eating at its restaurants last year  lawyers for the consumers said  as it attempts to move on from a string of food-safety problems.",
        "date": "09082016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle settles sick customers' claims  avoiding court battles "
    },
    {
        "content": "CHICAGO  Sept 7 Chipotle Mexican Grill Inc  held its first call with activist investor William Ackman on Wednesday and anticipates meeting with him soon  after he acquired 9.9 percent of the burrito chain  a company spokesman said.",
        "date": "09072016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle says it plans to meet with Ackman soon "
    },
    {
        "content": "* Indexes: Dow down 0.1 pct  S&P down 0.02 pct  Nasdaq up 0.2 pct   (Updates to close)",
        "date": "09072016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "US STOCKS-Wall Street ends flat as investors assess U.S. rates outlook "
    },
    {
        "content": "SAN FRANCISCO Apple Inc  unveiled an iPhone 7 with high-resolution cameras and no headphone jack at its annual launch event Wednesday  though the biggest surprise was the debut of a three-decade-old Nintendo game franchise  Super Mario Bros  on the smartphone. | Video ",
        "date": "09082016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Apple unveils iPhone 7 but some still waiting for iPhone 8 "
    },
    {
        "content": "CHICAGO Consumer opinions of Chipotle Mexican Grill have slid in recent weeks on food safety concerns  pollster YouGov BrandIndex said on Wednesday  a move that hurts the burrito chain's efforts to recover from a string of foodborne illnesses last year.",
        "date": "09082016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle brand view slips among consumers: poll "
    },
    {
        "content": "Activist investor William Ackman  wielding a stake of nearly 10 percent in Chipotle Mexican Grill Inc   is likely to push for board changes and a franchising model  analysts said  as the fast-casual Mexican food chain struggles to win back customers.",
        "date": "09072016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Ackman may push Chipotle for board changes  franchising: analysts "
    },
    {
        "content": "CHICAGO  Sept 7 Consumer opinions of Chipotle Mexican Grill have slid in recent weeks on food safety concerns  pollster YouGov BrandIndex said on Wednesday  a move that hurts the burrito chain's efforts to recover from a string of foodborne illnesses last year.",
        "date": "09082016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle brand view slips among consumers -poll "
    },
    {
        "content": "BOSTON Activist investor William Ackman's hedge fund took a 9.9 percent stake in fast-casual Mexican food chain Chipotle Mexican Grill Inc   buying in after the once high-flying company was battered by food-safety issues.",
        "date": "09072016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Ackman buys into Chipotle  to talk to management; shares jump "
    },
    {
        "content": "BOSTON  Sept 6 Activist investor William Ackman's hedge fund took a 9.9 percent stake in fast-casual Mexican food chain Chipotle Mexican Grill Inc  buying in after the once high-flying company was battered by food-safety issues.",
        "date": "09072016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 5-Ackman buys into Chipotle  to talk to management; shares jump "
    },
    {
        "content": "BOSTON Activist investor William Ackman is hungry to repair Chipotle Mexican Grill  after taking a stake in the burrito chain and could begin by shaking up a long-serving board and possibly replacing the two co-chief executives  analysts and investors said. | Video ",
        "date": "09082016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Ackman expected to shake up Chipotle leadership  restore burrito brand "
    },
    {
        "content": "BOSTON  Sept 7 Activist investor William Ackman is hungry to repair Chipotle Mexican Grill after taking a stake in the burrito chain and could begin by shaking up a long-serving board and possibly replacing the two co-chief executives  analysts and investors said.",
        "date": "09082016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 3-Ackman expected to shake up Chipotle leadership  restore burrito brand "
    },
    {
        "content": "* Says its new customer frequency program  chiptopia  expected to result in increases in free food giveaways during Q3 & Q4 of 2016  Source: (http://bit.ly/29RvxOG ) Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "07222016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle to increase free food giveaways in Q3 Q4 2016 new program  chiptopia "
    },
    {
        "content": "Chipotle Mexican Grill Inc  reported a bigger-than-expected drop in quarterly comparable sales as food giveaways and enhanced safety measures failed to bring back diners shaken by a string of food-borne illnesses last year.",
        "date": "07212016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle sales miss as food freebies fail to lure diners "
    },
    {
        "content": "* On conf call- 30 percent of all transactions participating in Chiptopia",
        "date": "07212016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle Mexican Co-CEO- Still very early to draw conclusions on sustainability of July trends "
    },
    {
        "content": "July 21 Chipotle Mexican Grill Inc  reported a bigger-than-expected drop in quarterly comparable restaurant sales as demand continued to be hurt by a spate of food-borne illnesses linked to its outlets.",
        "date": "07212016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "REFILE-Chipotle comparable sales fall more than expected "
    },
    {
        "content": "* For 2016  management expects an effective full year tax rate of approximately 38.6%",
        "date": "07212016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle Mexican Grill Q2 earnings per share $0.87 "
    },
    {
        "content": "A top Chipotle Mexican Grill Inc executive surrendered to New York police on Tuesday and was arraigned on charges of possession of cocaine  authorities said.",
        "date": "07052016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle executive surrenders after being charged with cocaine possession "
    },
    {
        "content": "July 5 A top Chipotle Mexican Grill Inc  executive surrendered to New York police on Tuesday and was arraigned on charges of possession of cocaine  authorities said.",
        "date": "07052016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 1-Chipotle exec surrenders after being charged with cocaine possession "
    },
    {
        "content": "July 5 A top Chipotle Mexican Grill Inc  executive surrendered to New York police on Tuesday and was arraigned on charges of possession of cocaine  authorities said.",
        "date": "07052016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle exec surrenders after being charged with cocaine possession "
    },
    {
        "content": "* Announced that it is adding Chorizo  a spicy chicken and pork sausage  as a new menu item in select cities beginning today",
        "date": "06292016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle Mexican Grill adds Chorizo as a new menu item "
    },
    {
        "content": "LOS ANGELES Chipotle Mexican Grill Inc  shares took a hit on Thursday after best-selling author Eric Van Lustbader revived concerns about food safety at the burrito chain by tweeting that his editor fell ill after eating at one of its Manhattan restaurants. | Video ",
        "date": "07072016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Best-selling author's tweet revives food safety concerns at Chipotle "
    },
    {
        "content": "June 27 Burrito chain Chipotle Mexican Grill Inc  said it will launch a limited-period loyalty program  betting on a strategy it had previously shunned  to lure back customers after a string of food safety lapses last year.",
        "date": "06272016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle launches rewards program to bring back customers "
    },
    {
        "content": "LOS ANGELES  July 7 Chipotle Mexican Grill Inc  shares took a hit on Thursday after best-selling author Eric Van Lustbader revived concerns about food safety at the burrito chain by tweeting that his editor fell ill after eating at one of its Manhattan restaurants.",
        "date": "07072016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Best-selling author's tweet revives food safety concerns at Chipotle "
    },
    {
        "content": "SAN FRANCISCO Shares of Chipotle Mexican Grill  appear expensive as Wall Street awaits fresh data on the burrito chain's struggle to recover from a string of food-borne illness outbreaks.",
        "date": "06092016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle shares at pricey multiples as Wall Street eyes May sales "
    },
    {
        "content": "BOSTON  May 31 The Fidelity Contrafund  cut its stake in Chipotle Mexican Grill Inc by 21 percent in April as the gourmet burrito chain continues to deal with fallout from last year's E.coli outbreak.",
        "date": "05312016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Fidelity Contrafund cuts Chipotle stake by 21 percent "
    },
    {
        "content": "BOSTON  May 31 The Fidelity Contrafund  cut its stake in Chipotle Mexican Grill Inc by 21 percent in April as the burrito chain continued to deal with fallout from last year's E.coli outbreak.",
        "date": "05312016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 1-Fidelity Contrafund cuts Chipotle stake by 21 percent "
    },
    {
        "content": "CHICAGO The U.S. Centers for Disease Control and Prevention has pushed back against complaints from Chipotle Mexican Grill that the health agency misinformed the public with its reporting of certain E. coli cases linked to the burrito chain.",
        "date": "05062016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "CDC defends reporting of E. coli outbreaks linked to Chipotle "
    },
    {
        "content": "LOS ANGELES Chipotle Mexican Grill Inc's  shareholders approved a proposal on Wednesday to give investors more power to shake up the burrito chain's board after a string of food safety-related outbreaks undermined confidence in its directors.",
        "date": "05112016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle shareholders vote for more power to pick board "
    },
    {
        "content": "LOS ANGELES  May 11 Chipotle Mexican Grill Inc's  shareholders approved a proposal on Wednesday to give investors more power to shake up the burrito chain's board after a string of food safety-related outbreaks undermined confidence in its directors.",
        "date": "05112016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 3-Chipotle shareholders vote for more power to pick board "
    },
    {
        "content": "* Shareholders approved elimination of provision limiting ability to call special meeting of shareholders to only board or chairman",
        "date": "05112016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle shareholders approve elimination of provision limiting ability to call special meeting of shareholders to only board or chairman "
    },
    {
        "content": "LOS ANGELES  May 11 Chipotle Mexican Grill  investors approve shareholder proxy access proposal Proposal gets nearly 60 percent support-sources   (Reporting by Lisa Baertlein in Los Angeles)",
        "date": "05112016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle investors approve shareholder proxy access proposal "
    },
    {
        "content": "LOS ANGELES  May 10 Chipotle Mexican Grill Inc's  board members will be in the hot seat at the burrito chain's annual meeting on Wednesday  as shareholders fight to shake up the board after a string of food safety failures last year.",
        "date": "05112016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "REFILE-Chipotle annual meeting could be 'referendum' on board - activist "
    },
    {
        "content": "Chipotle Mexican Grill  has retained two leading food safety experts - including a critic of the burrito chain's early response to disease outbreaks last year - as it redoubles its efforts to guard against health scares.",
        "date": "05112016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Exclusive: Chipotle hires former critic to help improve food safety "
    },
    {
        "content": "LOS ANGELES In its struggle to win back customers after last year's food safety issues  Chipotle Mexican Grill Inc is embracing  strategies it once rejected.",
        "date": "04282016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle's E. coli outbreak brings chain down to earth "
    },
    {
        "content": "LOS ANGELES Chipotle Mexican Grill Inc reported its first ever quarterly loss  after food giveaways failed to lure back large numbers of paying customers turned off by a string of food safety lapses last year.",
        "date": "04262016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle freebies fail to overcome food safety fears; shares fall "
    },
    {
        "content": "SAN FRANCISCO  April 25 Wall Street expects little from Chipotle Mexican Grill Inc's first-quarter results late on Tuesday as the burrito chain struggles to recover from a string of food-borne illness outbreaks. But its loss might be rival Panera Bread Co's gain.",
        "date": "04252016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle's troubles might help Panera as both serve up reports "
    },
    {
        "content": "LOS ANGELES  April 26 Chipotle Mexican Grill Inc  reported its first ever quarterly loss  after food giveaways failed to lure back large numbers of paying customers turned off by a string of food safety lapses last year.",
        "date": "04262016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 4-Chipotle freebies fail to overcome food safety fears; shares fall "
    },
    {
        "content": "LOS ANGELES  April 26 Chipotle Mexican Grill Inc  on Tuesday reported its first quarterly loss in its history as a public company as the burrito chain worked to win back customers after a string of foodborne illness incidents last year.",
        "date": "04262016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle reports first quarterly loss in history "
    },
    {
        "content": "* To protest outside Sacramento Chipotle to protest Chipotle's purchase of produce from Taylor Farms  Source text for Eikon:  Further company coverage:",
        "date": "04142016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "BRIEF-Teamsters to protest outside Sacramento Chipotle "
    },
    {
        "content": "Chipotle Mexican Grill Inc  shareholder CtW Investment Group on Wednesday urged investors not to re-elect two long-time board members  saying the chain's recent food safety crisis shows the company needs a board that is more independent and also more diverse in race and gender.",
        "date": "04132016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle investor seeks board shakeup for more diversity "
    },
    {
        "content": "April 13 Chipotle Mexican Grill Inc  shareholder CtW Investment Group on Wednesday urged investors not to re-elect two long-time board members  saying the chain's recent food safety crisis shows the company needs a board that is more independent and also more diverse in race and gender.",
        "date": "04132016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 3-Chipotle investor seeks board shakeup for more diversity "
    },
    {
        "content": "April 13 Chipotle Mexican Grill Inc  shareholder CtW Investor Group has urged the burrito chain's shareholders not to reelect two board members.",
        "date": "04132016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle investor advises against reelecting 2 board members "
    },
    {
        "content": "Chipotle Mexican Grill Inc has sought a trademark for the name \"Better Burger\"  suggesting that the burrito chain is looking to open a new restaurant format for hamburgers.",
        "date": "03302016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle 'Better Burger' trademark filing hints at new chain launch "
    },
    {
        "content": "March 30 Chipotle Mexican Grill Inc has sought a trademark for the name \"Better Burger\"  suggesting that the burrito chain is looking to open a new restaurant format for hamburgers.",
        "date": "03302016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 1-Chipotle \"Better Burger\" trademark filing hints at new chain launch "
    },
    {
        "content": "March 30 Chipotle Mexican Grill Inc has sought a trademark for the name \"Better Burger\"  suggesting that the burrito chain is looking to open a new restaurant format for hamburgers.",
        "date": "03302016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle \"Better Burger\" trademark filing hints at new chain launch "
    },
    {
        "content": "* Chipotle Mexican Grill confirmed on Wednesday that it filed a trademark application for \"better burger\" - CNBC    )",
        "date": "03302016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle trademarking 'better burger' for new food chain - CNBC "
    },
    {
        "content": "March 16 Chipotle Mexican Grill Inc has recovered about one-third of sales lost to a string of food safety lapses last year  and more free offers may be forthcoming as part of its turnaround strategy  executives said at a conference on Wednesday.",
        "date": "03162016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle mulls more food giveaways as customers slowly return "
    },
    {
        "content": "Chipotle Mexican Grill Inc's  turnaround timeline appeared to lengthen on Tuesday after the burrito seller reported a steeper-than-expected slide in February sales at established restaurants and warned that it will post its first quarterly loss as a public company.",
        "date": "03152016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle sales worse than expected in Feb  first-quarter loss seen "
    },
    {
        "content": "March 16 Chipotle Mexican Grill Inc  could give away roughly 9 million burritos as it fights to win back customers following several food safety mishaps that have dented its sales.",
        "date": "03162016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 1-Chipotle mulls more food giveaways as customers slowly return "
    },
    {
        "content": "March 15 Chipotle Mexican Grill Inc's  turnaround timeline appeared to lengthen on Tuesday after the burrito seller reported a steeper-than-expected slide in February sales at established restaurants and warned that it will post its first quarterly loss as a public company.",
        "date": "03152016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 3-Chipotle sales worse than expected in Feb  Q1 loss seen "
    },
    {
        "content": "LOS ANGELES  March 15 Cesar Trejo broke his Chipotle habit after the chain's string of food safety lapses last year. This week  a free food offer lured him back  along with the urging of three friends who had returned without getting sick.",
        "date": "03152016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 1-Free burritos lure Chipotle loyalists  but will sales follow? "
    },
    {
        "content": "March 15 Chipotle Mexican Grill Inc said sales at established restaurants fell 26.1 percent in February.",
        "date": "03152016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle says comparable sales fell 26.1 pct in Feb "
    },
    {
        "content": "WASHINGTON - U.S. Federal Reserve officials are likely to hold rates steady as they balance continued concerns about a weak global economy against new signs of inflation and firming financial markets.  (USA-FED (WRAPUP 1  PIX)  expect at 0500 GMT/1 AM ET Wednesday)  by Howard Schneider  350 words)",
        "date": "03152016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Reuters Business News Schedule at 1830 GMT/2:30 PM ET "
    },
    {
        "content": "* Has recovered about one-third of sales lost following food safety scares-executive",
        "date": "03162016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "BRIEF-Chipotle has recovered about on-third of lost sales-executive "
    },
    {
        "content": "LOS ANGELES Cesar Trejo broke his Chipotle habit after the chain's string of food safety lapses last year. This week  a free food offer lured him back  along with the urging of three friends who had returned without getting sick.",
        "date": "03162016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Free burritos lure Chipotle loyalists  but will sales follow? "
    },
    {
        "content": "March 15 Chipotle Mexican Grill Inc is contemplating stepping back from some food-safety changes it had pushed for a month ago after a series of disease outbreaks  the WSJ reported  citing people familiar with the matter.",
        "date": "03162016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle mulls stepping back from some food-safety changes - WSJ "
    },
    {
        "content": "LOS ANGELES  March 15 Cesar Trejo broke his Chipotle habit after the chain's string of food safety lapses last year. This week  a free food offer lured him back  along with the urging of three friends who had returned without getting sick.",
        "date": "03152016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Free burritos lure Chipotle loyalists  but will sales follow? "
    },
    {
        "content": "March 11 Chipotle Mexican Grill Inc's  co-chief executive officers' total compensation more than halved in 2015  a year when the one-time Wall Street darling lost flavor following a series of food-borne illnesses linked to its restaurants.",
        "date": "03112016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle co-CEOs 2015 compensation halved amid food-safety scare "
    },
    {
        "content": "BILLERICA  Mass./LOS ANGELES Chipotle Mexican Grill Inc received praise for its handling of potential norovirus infections at a Boston-area restaurant  as sick employees stayed home and the burrito chain quickly cleaned the restaurant. | Video ",
        "date": "03102016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Cleanup of Massachusetts Chipotle complete after norovirus scare "
    },
    {
        "content": "BILLERICA  Mass./LOS ANGELES  March 9 Chipotle Mexican Grill Inc received praise for its handling of potential norovirus infections at a Boston-area restaurant  as sick employees stayed home and the burrito chain quickly cleaned the restaurant.",
        "date": "03102016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 4-Cleanup of Massachusetts Chipotle complete after norovirus scare "
    },
    {
        "content": "March 9 Shares of Chipotle Mexican Grill Inc  fell more than 6 percent in morning trading on Wednesday  a day after the popular burrito chain operator said it would temporarily shut a Massachusetts restaurant after four employees fell sick.",
        "date": "03092016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "CORRECTED-UPDATE 1-Chipotle's shares drop after latest food safety incident "
    },
    {
        "content": "March 9 Shares of Chipotle Mexican Grill Inc  fell almost 6 percent in morning trading on Wednesday  a day after the popular burrito chain operator said it would temporarily shut a Massachusetts restaurant after four employees fell sick.",
        "date": "03092016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "CORRECTED-Chipotle's shares drop after latest food safety incident "
    },
    {
        "content": "Chipotle Mexican Grill Inc  which is trying to recover from a series of food-borne illness outbreaks  temporarily shut a Massachusetts restaurant after four employees fell sick.",
        "date": "03092016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle Massachusetts outlet shut after workers fall ill "
    },
    {
        "content": "Chipotle Mexican Grill closed all of its U.S. restaurants during prime lunchtime hours on Monday to hold staff meetings on food safety guidelines  sparking offers from rivals eager to poach customers of the burrito chain as it recovers from several food-borne outbreaks. | Video ",
        "date": "02082016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle shuts U.S. stores for food safety meeting  rivals pounce "
    },
    {
        "content": "Feb 8 Chipotle Mexican Grill closed all of its U.S. restaurants during prime lunchtime hours on Monday to hold staff meetings on food safety guidelines  sparking offers from rivals eager to poach customers of the burrito chain as it recovers from several food-borne outbreaks.",
        "date": "02082016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 3-Chipotle shuts U.S. stores for food safety meeting  rivals pounce "
    },
    {
        "content": "Feb 8 Chipotle Mexican Grill shut its stores for four hours on Monday to hold a nationwide staff meeting  where Chief Executive Steve Ells apologized for E.coli and norovirus outbreaks and laid out the company's recently developed food safety program.",
        "date": "02082016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Chipotle stores shut nationwide for staff food safety meeting "
    },
    {
        "content": "Feb 8 Chipotle Mexican Grill stores will be closed for four hours on Monday for a nation-wide meeting for its restaurant employees on food safety  after several outbreaks of food-borne illnesses linked to the chain.",
        "date": "02082016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle stores to be shut for four hours for food safety meeting "
    },
    {
        "content": "Chipotle Mexican Grill Inc's  plans to spend heavily on marketing and food safety after a spate of E.coli and norovirus outbreaks will help the burrito chain regain its popularity  analysts said  but it's anyone's guess when sales will recover. | Video ",
        "date": "02032016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle's sales outlook uncertain as it recovers from E.coli "
    },
    {
        "content": "Feb 2 Chipotle Mexican Grill Inc  reported its first fall in quarterly sales at established restaurants since it went public as the burrito chain operator lost customers after several incidents of food-borne illnesses at its outlets.",
        "date": "02022016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle's quarterly same-restaurant sales fall 14.6 pct "
    },
    {
        "content": "Feb 2 Chipotle Mexican Grill Inc said a federal criminal probe linked to a food-safety incident at a California restaurant has widened into a national investigation  sending its shares down 7 percent in extended trading on Tuesday.",
        "date": "02032016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle says California probe widens into national investigation "
    },
    {
        "content": "SAN FRANCISCO Chipotle Mexican Grill's  stock climbed on Tuesday for a second consecutive day  ahead of the restaurant chain's fourth-quarter report  on bets that the fallout from recent outbreaks of food-borne illness has been fully priced in.",
        "date": "02022016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle stock up ahead of quarterly report "
    },
    {
        "content": "* Chipotle sees break-even on per-share basis in current qtr   (Adds CEO  analyst comment)",
        "date": "02032016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 5-Chipotle says California probe widens into national investigation "
    },
    {
        "content": "* CDC says not identified ingredient responsible for outbreak",
        "date": "02012016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Chipotle-linked E.coli outbreaks appear to be over - CDC "
    },
    {
        "content": "Two E.coli outbreaks linked to Chipotle Mexican Grill Inc  that affected more than 50 people across 14 states appear to be over  the U.S. Centers for Disease Control and Prevention (CDC) said on Monday. | Video ",
        "date": "02012016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle-linked E.coli outbreaks appear to be over: CDC "
    },
    {
        "content": "Feb 1 The U.S. Centers for Disease Control and Prevention (CDC) said on Monday it had concluded that two E.coli outbreaks related to Chipotle Mexican Grill Inc appeared to be over.",
        "date": "02012016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "CDC says E.coli outbreaks related to Chipotle appear to be over "
    },
    {
        "content": "The E. coli outbreak that affected dozens of Chipotle Mexican Grill customers in nine states last year is expected to be declared over as soon as Monday  the Wall Street Journal reported  citing people familiar with the government's investigation. | Video ",
        "date": "02012016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "CDC expected to declare end to Chipotle's E.coli outbreak as soon as Monday: WSJ "
    },
    {
        "content": "Feb 1 The E. coli outbreak that affected dozens of Chipotle Mexican Grill customers in nine states last year is expected to be declared over as soon as Monday  the Wall Street Journal reported  citing people familiar with the government's investigation.",
        "date": "02012016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "CDC expected to declare end to Chipotle's E.coli outbreak as soon as Monday -WSJ "
    },
    {
        "content": "BOSTON Fidelity's Contrafund  the biggest mutual fund investor in Chipotle Mexican Grill Inc  said it had held onto its entire stake during the fourth quarter even as an outbreak of food-borne illness in the restaurant chain pummeled its shares.",
        "date": "01202016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Big Chipotle investor held steady during stock's fourth-quarter plunge "
    },
    {
        "content": "BOSTON  Jan 20 Fidelity's Contrafund  the biggest mutual fund investor in Chipotle Mexican Grill Inc   said it had held onto its entire stake during the fourth quarter even as an outbreak of food-borne illness in the restaurant chain pummeled its shares.",
        "date": "01202016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 1-Big Chipotle investor held steady during stock's 4th-quarter plunge "
    },
    {
        "content": "BOSTON  Jan 20 Fidelity's Contrafund  the biggest mutual fund investor in Chipotle Mexican Grill Inc   held steady in the company during the fourth quarter  even as an outbreak of food-borne illness in the restaurant chain pummeled its shares.",
        "date": "01202016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Big Chipotle investor held steady during stock's 4th-quarter plunge "
    },
    {
        "content": "Jan 15 Popular burrito chain Chipotle Mexican Grill Inc will close its restaurants for a few hours next month to hold a meeting on food safety with employees  company executives said.",
        "date": "01152016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle to shut outlets next month for food safety meeting "
    },
    {
        "content": "LOS ANGELES/SAN FRANCISCO Chipotle Mexican Grill Inc executives on Wednesday said they are confident that steps they are taking to tighten food safety at the popular burrito chain will prevent future food poisoning outbreaks.",
        "date": "01132016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle 'confident' it can stop outbreaks  shares rise "
    },
    {
        "content": "WASHINGTON The U.S. Justice Department's consumer protection unit is looking into a norovirus outbreak at a Chipotle restaurant in California  in a sign that a recent probe launched by federal prosecutors in California is getting attention at Washington headquarters.",
        "date": "01092016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle outbreak eyed by Justice Dept. consumer unit "
    },
    {
        "content": "WASHINGTON The U.S. Justice Department's consumer protection unit is looking into a norovirus outbreak at a Chipotle restaurant in California  in a sign that a recent probe launched by federal prosecutors in California is getting attention at Washington headquarters.",
        "date": "01082016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle outbreak eyed by Justice Dept consumer unit "
    },
    {
        "content": "CHICAGO Chipotle Mexican Grill  under scrutiny for months over outbreaks of foodborne illness linked to its restaurants across several U.S. states  was sued on Friday for allegedly misleading investors about its food safety controls.",
        "date": "01082016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle sued for misleading investors over food safety "
    },
    {
        "content": "WASHINGTON/CHICAGO Chipotle Mexican Grill Inc   under scrutiny for months over outbreaks of foodborne illness across several U.S. states  said on Wednesday it was served with a subpoena in a federal criminal probe linked to norovirus cases in California last year.",
        "date": "01072016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle hit with U.S. subpoena over California norovirus outbreak "
    },
    {
        "content": "WASHINGTON  Jan 8 The U.S. Justice Department's consumer protection unit is looking into a norovirus outbreak at a Chipotle restaurant in California  in a sign that a recent probe launched by federal prosecutors in California is getting attention at Washington headquarters.",
        "date": "01082016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 1-Chipotle outbreak eyed by Justice Dept consumer unit "
    },
    {
        "content": "* Says norovirus contamination in California being probed     * Estimates 14.6 pct fall in 4th-qtr same-store sales     * Announces $300 million share buyback   (Adds details on investigation  datelines  additional byline)     By Sarah N. Lynch and Tom Polansek     WASHINGTON/CHICAGO  Jan 6 Chipotle Mexican Grill Inc  under scrutiny for months over outbreaks of foodborne illness across several U.S. states  said on Wednesday it was served with a subpoena in a federal criminal probe li",
        "date": "01072016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 5-Chipotle hit with U.S. subpoena over California norovirus outbreak "
    },
    {
        "content": "Chipotle Mexican Grill Inc   under scrutiny for months over outbreaks of foodborne illness across several U.S. states  said on Wednesday it was served with a subpoena in a federal criminal probe linked to a norovirus case in California last year.",
        "date": "01062016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle hit with federal subpoena over California norovirus outbreak "
    },
    {
        "content": "CHICAGO  Jan 8 Chipotle Mexican Grill  under scrutiny for months over outbreaks of foodborne illness linked to its restaurants across several U.S. states  was sued on Friday for allegedly misleading investors about its food safety controls.",
        "date": "01082016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "REFILE-UPDATE 1-Chipotle sued for misleading investors over food safety "
    },
    {
        "content": "CHICAGO  Jan 8 Chipotle Mexican Grill  under scrutiny for months over outbreaks of foodborne illness linked to its restaurants across several U.S. states  was sued on Friday for allegedly misleading investors about its food safety controls.",
        "date": "01082016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle faces U.S. civil lawsuit over statements on food safety "
    },
    {
        "content": "* Announces $300 million share buyback   (Adds details on investigation  California lawsuit)",
        "date": "01062016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 4-Chipotle hit with federal subpoena over California norovirus outbreak "
    },
    {
        "content": "Jan 6 Chipotle Mexican Grill Inc said it was served with a subpoena from a federal court in relation to a criminal investigation into a norovirus incident that occurred at its restaurant in Simi Valley  California in August.",
        "date": "01062016",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle receives subpoena in relation to norovirus incident "
    },
    {
        "content": "Dec 28 Chipotle Mexican Grill Inc said it reopened its Boston restaurant  which was linked to a norovirus outbreak that sickened more than 130 people earlier this month.",
        "date": "12282015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle reopens Boston restaurant linked to norovirus outbreak "
    },
    {
        "content": "CHICAGO  Dec 24 Chipotle Mexican Grill  said on Thursday it may never pinpoint what caused an E. coli outbreak last month linked to two restaurants in Kansas and Oklahoma  extending a mystery over dozens of illnesses tied to the burrito chain.",
        "date": "12242015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle's latest E. coli cases may remain unsolved mystery "
    },
    {
        "content": "Federal authorities are investigating a new E.coli strain linked to Chipotle Mexican Grill Inc  piling more pressure on the popular burrito chain already grappling with an outbreak that has affected about 50 people in nine states.",
        "date": "12212015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "CDC investigating new E.coli strain linked to Chipotle "
    },
    {
        "content": "* Chipotle shares touch 17-month low in regular trading   (Adds details  background; updates shares)",
        "date": "12212015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-CDC investigating new E.coli strain linked to Chipotle "
    },
    {
        "content": "CHICAGO Nearly a quarter of Americans who have heard of recent E. coli outbreaks at Chipotle Mexican Grill said they are eating less often at its restaurants  a new Reuters/Ipsos poll showed on Tuesday  while social media sentiment towards the chain hit a low.",
        "date": "12222015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Americans aware of Chipotle outbreak eat there less often: poll "
    },
    {
        "content": "CHICAGO  Dec 22 Nearly a quarter of Americans who have heard of recent E. coli outbreaks at Chipotle Mexican Grill said they are eating less often at its restaurants  a new Reuters/Ipsos poll showed on Tuesday  while social media sentiment towards the chain hit a low.",
        "date": "12222015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Americans aware of Chipotle outbreak eat there less often-Reuters/Ipsos poll "
    },
    {
        "content": "An outbreak of E. coli linked to rotisserie chicken salad sold by warehouse club operator Costco Wholesale Corp appears to be over  the U.S. Centers for Disease Control (CDC) said on Tuesday.",
        "date": "12222015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Costco E. coli outbreak appears to be over: CDC "
    },
    {
        "content": "Dec 22 An outbreak of E. coli linked to rotisserie chicken salad sold by warehouse club operator Costco Wholesale Corp appears to be over  the U.S. Centers for Disease Control (CDC) said on Tuesday.",
        "date": "12222015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Costco E. coli outbreak appears to be over - CDC "
    },
    {
        "content": "Dec 9 At least 80 students in Boston have been sickened by norovirus linked to a Chipotle restaurant  the Boston Public Health Commission (BPHC) said on Wednesday  indicating that the outbreak may not be related to a spate of E. coli infections in several states.",
        "date": "12092015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "UPDATE 3-Norovirus confirmed in Boston students who ate at Chipotle "
    },
    {
        "content": "Dec 10 Chipotle Mexican Grill Inc shares jumped more than 5 percent on Thursday after its founder promised strict new food-safety practices to prevent illnesses  but hours later one of its Seattle restaurants was shut down for repeated violations.",
        "date": "12102015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "UPDATE 6-Chipotle shares jump as CEO apologizes over illnesses  vows change "
    },
    {
        "content": "Health officials shut down a Chipotle Mexican Grill Inc restaurant in Seattle on Thursday after finding \"repeated food safety violations \" according to a statement from the Seattle & King County public health department.",
        "date": "12102015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Officials close Chipotle in Seattle for food safety violations "
    },
    {
        "content": "Eighty Boston College students fell ill after eating at a Chipotle Mexican Grill  restaurant this past weekend  and early test results point to the highly contagious norovirus as the culprit  public health investigators said on Tuesday.",
        "date": "12082015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Norovirus suspected at Chipotle visited by 80 sick Boston College students "
    },
    {
        "content": "Shares of Chipotle Mexican Grill Inc jumped more than 5 percent on Thursday after its founder apologized to patrons who fell ill after eating at the company's restaurants and pledged that strict new food-safety practices would prevent future outbreaks.",
        "date": "12102015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle shares jump as CEO apologizes over illnesses  vows change "
    },
    {
        "content": "WASHINGTON  Dec 10 Chipotle founder and co-Chief Executive Officer Steve Ells on Thursday apologized to patrons who fell ill after eating at the company's restaurants  pledging that sweeping new food safety practices will prevent such outbreaks in the future.",
        "date": "12102015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle CEO apologizes over illnesses  pledges to be 'safest place to eat' "
    },
    {
        "content": "Eighty Boston College students fell ill after eating at a Chipotle Mexican Grill restaurant this past weekend  and early test results point to the highly contagious norovirus as the culprit  public health investigators said on Tuesday.",
        "date": "12082015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle says Boston illnesses likely due to norovirus  not E. coli "
    },
    {
        "content": "* Boston College said 80 students got sick after Chipotle visits",
        "date": "12082015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 5-Norovirus suspected at Chipotle visited by 80 sick Boston College students "
    },
    {
        "content": "Dec 8 A U.S. federal agency has yet to identify the source of an E. coli outbreak that sickened at least 19 people in seven states who may have been infected after eating rotisserie chicken salad sold at Costco Wholesale Corp.",
        "date": "12082015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "U.S. FDA still searching for source of E. coli outbreak at Costco "
    },
    {
        "content": "LOS ANGELES Thirty Boston College students got sick after eating at Chipotle Mexican Grill  over the weekend  a school spokesman said  sending company shares down 6 percent in extended trading on Monday on fears of more food poisoning problems at the burrito chain.",
        "date": "12082015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle shares take fresh hit after Boston College students fall ill "
    },
    {
        "content": "LOS ANGELES  Dec 7 Thirty Boston College students got sick after eating at Chipotle Mexican Grill  over the weekend  a school spokesman said  sending company shares down 6 percent in extended trading on Monday on fears of more food poisoning problems at the burrito chain.",
        "date": "12082015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 3-Chipotle shares take fresh hit after Boston College students fall ill "
    },
    {
        "content": "LOS ANGELES A widening U.S. E. coli outbreak has slammed sales at Chipotle Mexican Grill Inc  the company said on Friday  hours after federal authorities reported that people in nine states have now contracted food poisoning.",
        "date": "12042015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle sales battered by widening E. coli outbreak "
    },
    {
        "content": "LOS ANGELES  Dec 4 A widening U.S. E. coli outbreak has slammed sales at Chipotle Mexican Grill Inc   the company said on Friday  hours after federal authorities reported that people in nine states have now contracted food poisoning.",
        "date": "12042015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 4-Chipotle sales battered by widening E. coli outbreak "
    },
    {
        "content": "LOS ANGELES  Dec 4 The E. coli outbreak linked to Chipotle Mexican Grill Inc has expanded to nine states  with 47 of the 52 people affected having reported eating at the popular burrito chain.",
        "date": "12042015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle E. coli outbreak broadens to 9 states  shares drop "
    },
    {
        "content": "LOS ANGELES  Nov 20 More than 40 people have fallen ill with E. coli food poisoning after eating at Chipotle Mexican Grill restaurants in six different states  federal health officials said on Friday  sending shares of the burrito chain to an 18-month low.",
        "date": "11202015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "UPDATE 3-Chipotle E. coli outbreak reaches six states  shares tumble "
    },
    {
        "content": "LOS ANGELES The U.S. Centers for Disease Control and Prevention (CDC) said on Friday that three additional states reported E. coli infections from the same strain as the Chipotle Mexican Grill  outbreak  sending shares in the chain down more than 12 percent.",
        "date": "11202015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle E. coli outbreak reaches six states  shares tumble "
    },
    {
        "content": "Chipotle Mexican Grill Inc said it would reopen all 43 restaurants in Seattle and Portland after health officials found no evidence of E. coli bacteria at those outlets.",
        "date": "11102015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle to reopen 43 restaurants after E. coli all-clear "
    },
    {
        "content": "* Shares rise 2.4 pct on Tuesday   (Adds details  background; updates shares)",
        "date": "11102015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Chipotle to reopen 43 restaurants after E. coli all-clear "
    },
    {
        "content": "SEATTLE Chipotle Mexican Grill Inc could reopen locations in Washington state and Oregon as soon as Wednesday after a batch of tests found no E. coli bacteria in food samples  health officials said on Monday.",
        "date": "11102015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle eateries in U.S. Northwest could re-open after outbreak "
    },
    {
        "content": "LOS ANGELES Chipotle Mexican Grill Inc's  food poisoning outbreak in Washington state and Oregon threatens to scare diners away from the popular burrito chain and has become fodder for one of its most vocal critics.",
        "date": "11052015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle's E. coli outbreak threatens sales  emboldens critics "
    },
    {
        "content": "SEATTLE  Nov 9 Chipotle Mexican Grill Inc  could reopen locations in Washington state and Oregon as soon as Wednesday after a batch of tests found no E. coli bacteria in food samples  health officials said on Monday.",
        "date": "11102015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 3-Chipotle eateries in U.S. Northwest could re-open after outbreak "
    },
    {
        "content": "LOS ANGELES Chipotle Mexican Grill Inc  is now linked to 35 confirmed E. coli food poisoning cases in Oregon and Washington  state officials said on Tuesday. | Video ",
        "date": "11032015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle now linked to 35 confirmed E. coli cases "
    },
    {
        "content": "LOS ANGELES  Nov 3 Chipotle Mexican Grill Inc  is now linked to 35 confirmed E. coli food poisoning cases in Oregon and Washington  state officials said on Tuesday.",
        "date": "11032015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Chipotle now linked to 35 confirmed E. coli cases "
    },
    {
        "content": "LOS ANGELES Chipotle Mexican Grill Inc's shares touched their lowest level since July after the popular burrito chain said it closed 43 restaurants in the states of Washington and Oregon amid an investigation into an E. coli food poisoning outbreak.",
        "date": "11022015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Food safety scare knocks Chipotle shares to four-month low "
    },
    {
        "content": "Nov 1 Chipotle Mexican Grill Inc said on Sunday it had closed all its restaurants in two West Coast markets due to a reported outbreak of E. coli bacteria that is being investigated by the company and health authorities.",
        "date": "11012015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle shuts Seattle  Portland stores after E. coli outbreak "
    },
    {
        "content": "Nov 3 A customer has sued Chipotle Mexican Grill Inc  saying that she was infected with E. coli as a result of a meal at the casual chain restaurant  which has closed 43 restaurants in Washington and Oregon amid a food poisoning outbreak.",
        "date": "11032015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Customer in Washington State sues Chipotle amid E. coli outbreak "
    },
    {
        "content": "LOS ANGELES  Nov 4 Chipotle Mexican Grill Inc's  food poisoning outbreak in Washington state and Oregon threatens to scare diners away from the popular burrito chain and has become fodder for one of its most vocal critics.",
        "date": "11042015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle's E. coli outbreak threatens sales  emboldens critics "
    },
    {
        "content": "LOS ANGELES  Nov 2 Chipotle Mexican Grill Inc's  shares touched their lowest level since July after the popular burrito chain said it closed 43 restaurants in the states of Washington and Oregon amid an investigation into an E. coli food poisoning outbreak.",
        "date": "11022015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 1-Food safety scare knocks Chipotle shares to four-month low "
    },
    {
        "content": "NEW YORK/LOS ANGELES  Nov 1 Chipotle Mexican Grill Inc said on Sunday it had closed all its restaurants in two West Coast markets due to a reported outbreak of E. coli bacteria that is being investigated by the company and health authorities.",
        "date": "11012015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 3-Chipotle shuts Seattle  Portland stores after E. coli outbreak "
    },
    {
        "content": "LOS ANGELES  Nov 4 Chipotle Mexican Grill Inc's  food poisoning outbreak in Washington state and Oregon threatens to scare diners away from the popular burrito chain and has become fodder for one of its most vocal critics.",
        "date": "11042015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Chipotle's E. coli outbreak threatens sales  emboldens critics "
    },
    {
        "content": "LOS ANGELES  Nov 2 Chipotle Mexican Grill Inc's  shares touched their lowest level since July after the popular burrito chain said it closed 43 restaurants in Seattle and Portland  Oregon  amid an investigation into an E. coli food poisoning outbreak.",
        "date": "11022015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Food safety scare sends Chipotle shares to four-month low "
    },
    {
        "content": "LOS ANGELES The number of confirmed E. Coli food poisoning cases linked to Chipotle Mexican Grill Inc  in Oregon and Washington state rose to 35 on Tuesday  as the company announced steps to improve food safety. | Video ",
        "date": "11042015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle now linked to 35 confirmed E. coli cases "
    },
    {
        "content": "LOS ANGELES  Nov 3 The number of confirmed E. Coli food poisoning cases linked to Chipotle Mexican Grill Inc  in Oregon and Washington state rose to 35 on Tuesday  as the company announced steps to improve food safety.",
        "date": "11042015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 3-Chipotle now linked to 35 confirmed E. coli cases "
    },
    {
        "content": "Chipotle Mexican Grill Inc  on Tuesday posted disappointing third-quarter profits and said growth would cool further in 2016  sending shares in the popular burrito chain down more than 7 percent in extended trading.",
        "date": "10202015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle growth cooling trend seen lasting into 2016 "
    },
    {
        "content": "Oct 20 Chipotle Mexican Grill Inc's  sales growth at established restaurants further cooled in the third quarter  sending the company's shares down 6.4 percent in extended trading on Tuesday.",
        "date": "10202015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle shares fall as growth continues to cool "
    },
    {
        "content": "Sept 28 Chipotle Mexican Grill Inc is closing the book on its carnitas crisis of 2015.",
        "date": "09282015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle says U.S. pork supply problem coming to an end "
    },
    {
        "content": "Sept 15 Yum Brands Inc's <YUM.N > Taco Bell chain next week will debut a new restaurant concept that dumps the drive-thru and brings on the booze as it seeks to appeal to hip  young city dwellers and fend off popular rival Chipotle Mexican Grill Inc.",
        "date": "09152015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Taco Bell joins fast-food booze bandwagon with new U.S. eateries "
    },
    {
        "content": "LOS ANGELES  Sept 3 Chipotle Mexican Grill Inc   known for its indulgent burritos  is battling a \"Chubby Chipotle\" ad campaign from the food industry group whose \"Nanny\" ads helped sink New York City's ban on super-sized sugary drinks.",
        "date": "09032015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle critic turns up heat with 'Chubby Chipotle' ad "
    },
    {
        "content": "Aug 31 Chipotle Mexican Grill Inc's new GMO-free menu claims have lured diners and boosted the burrito chain's stock price  but it has some consumers crying foul.",
        "date": "08312015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle sued over GMO-free menu claims "
    },
    {
        "content": "BOSTON  Aug 25 Popular consumer brands Discovery Communications  Chipotle Mexican Grill and CVS Health Corp pay their chief executive officers more than a thousand times what they pay their typical worker  giving them the biggest internal pay gaps among S&P 500 companies  according to a study released on Tuesday.",
        "date": "08252015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Three big US consumer companies have highest CEO pay gaps -study "
    },
    {
        "content": "Aug 5 U.S. burger chain Wendy's Co  reported a fall in sales for the seventh straight quarter  due to fewer company-owned stores and fierce competition from fast-casual dining chains such as Chipotle Mexican Grill Inc .",
        "date": "08052015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "CORRECTED-Burger chain Wendy's sales fall for 7th straight quarter "
    },
    {
        "content": "Chipotle Mexican Grill Inc  on Tuesday said its quarterly profit beat estimates  but the burrito chain reported lower than expected sales at its established restaurants  initially sending its shares down in extended trading.",
        "date": "07212015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle profit beats estimates but same-store sales fall short "
    },
    {
        "content": "July 21 Chipotle Mexican Grill Inc on Tuesday said its quarterly profit beat estimates  but the burrito chain reported lower than expected sales at its established restaurants  initially sending its shares down in extended trading.",
        "date": "07212015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Chipotle profit beats estimates but same-store sales fall short "
    },
    {
        "content": "July 21 Burrito chain Chipotle Mexican Grill Inc  reported lower-than-expected quarterly revenue as the removal of pork products from some of its restaurants hurt sales for the second straight quarter.",
        "date": "07212015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle reports lower-than-expected quarterly sales "
    },
    {
        "content": "NEW YORK Shares of Chipotle Mexican Grill Inc  have lost some of their luster recently and unless growth revives at the company  the stock could see a 15 percent to 20 percent plunge  the July 6 edition of Barron's said.",
        "date": "07052015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle shares could plunge unless growth revives: Barron's "
    },
    {
        "content": "Chipotle Mexican Grill Inc on Monday said the 46 ingredients used in its roughly 1 800 restaurants were now free of genetically modified organisms  becoming the first major U.S. restaurant chain to make that switch. | Video ",
        "date": "04272015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle goes GMO-free in first for fast-food sector "
    },
    {
        "content": "U.S. stocks ended stronger on Wednesday as Visa's potential expansion into China and talk of a turnaround at McDonald's helped investors look beyond a mixed bag of quarterly earnings.",
        "date": "04222015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Stocks end stronger as investors look beyond mixed earnings "
    },
    {
        "content": "* Indexes down: Dow 0.2 pct  S&P 0.1 pct  Nasdaq 0.3 pct   (Updates to open)",
        "date": "04222015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "US STOCKS-Wall St slips on mixed bag of earnings "
    },
    {
        "content": "Chipotle Mexican Grill Inc expects the removal of pork from one-third of its restaurants to hurt sales this year  the burrito chain said  after reporting the slowest same-restaurant sales growth in five quarters.",
        "date": "04212015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle says removal of pork items to hurt 2015 sales "
    },
    {
        "content": "April 21 Chipotle Mexican Grill Inc  expects the removal of pork from one-third of its restaurants to hurt sales this year  the burrito chain said  after reporting the slowest same-restaurant sales growth in five quarters.",
        "date": "04212015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Chipotle says removal of pork items to hurt 2015 sales "
    },
    {
        "content": "* Yahoo  Chipotle down after the bell following quarterly reports",
        "date": "04212015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "US STOCKS-Earnings cloud drags down Dow; Nasdaq gains on biotech M&A "
    },
    {
        "content": "April 21 Chipotle Mexican Grill Inc  reported lower-than-expected quarterly sales  hurt by the removal of pork products from some of its restaurants as well as price increases.",
        "date": "04212015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle reports lower-than-expected quarterly sales "
    },
    {
        "content": "* Dow off 0.45 pct  S&P down 0.1 pct  Nasdaq up 0.48 pct   (Updates to afternoon)",
        "date": "04212015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "US STOCKS-Wall St mixed as doubts about earnings offset biotech M&A bid "
    },
    {
        "content": "* Dow off 0.33 pct  S&P down 0.05 pct  Nasdaq up 0.47 pct   (Updates to early afternoon)",
        "date": "04212015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "US STOCKS-Wall St mixed as lackluster earnings offset biotech M&A bid "
    },
    {
        "content": "* Dow off 0.4 pct  S&P down 0.15 pct  Nasdaq up 0.4 pct   (Updates to midday  adds comment  updates prices)",
        "date": "04212015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "US STOCKS-Wall St mixed as earnings offset merger news "
    },
    {
        "content": "* Dow components Verizon  DuPont and United Tech beat estimates",
        "date": "04212015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "US STOCKS-Wall St set to rise as results beat low expectations "
    },
    {
        "content": "March  9 McDonald's Corp on Monday vowed to remake itself as a \"modern  progressive burger company\" after aggressive competition from Chipotle Mexican Grill Inc  Chick-fil-A and myriad \"better burger\" chains bit into U.S. restaurant sales last month.",
        "date": "03092015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "UPDATE 2-McDonald's vows 'modern' makeover amid U.S. sales struggle "
    },
    {
        "content": "Feb 8 Chipotle Mexican Grill Inc's  Twitter account was hacked overnight for about two hours  during which a series of offensive tweets were posted to the account  the company said on Sunday.",
        "date": "02082015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle apologizes after Twitter feed hacked overnight "
    },
    {
        "content": "Chipotle Mexican Grill Inc  on Tuesday reported sales growth at established restaurants slowed in the fourth quarter and slightly missed Wall Street's estimate  sending shares down more than 6 percent in after-hours trade.",
        "date": "02042015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle restaurant sales growth slows  shares fall "
    },
    {
        "content": "Chipotle Mexican Grill Inc  on Tuesday reported sales growth at established restaurants slowed in the fourth quarter and slightly missed Wall Street's estimate  sending shares down more than 6 percent in after-hours trade.",
        "date": "02032015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle restaurant sales growth slows  shares fall "
    },
    {
        "content": "Feb 3 Chipotle Mexican Grill Inc on Tuesday reported sales growth at established restaurants slowed in the fourth quarter and slightly missed Wall Street's estimate  sending shares down more than 6 percent in after-hours trade.",
        "date": "02032015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Chipotle restaurant sales growth slows  shares fall "
    },
    {
        "content": "Chipotle Mexican Grill Inc  on Tuesday reported that the  growth of sales at established restaurants decelerated from prior quarters and slightly missed Wall Street's estimate  sending shares down more than 6 percent in after-hours trade.",
        "date": "02032015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle restaurant sales growth decelerated  shares fall "
    },
    {
        "content": "LOS ANGELES  Feb 3 Chipotle Mexican Grill Inc  is weighing whether to raise prices on steak and barbacoa after its last price increase did not offset higher beef costs  the burrito chain's chief financial officer said on Tuesday.",
        "date": "02032015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle considering targeted price increase on beef this year "
    },
    {
        "content": "Jan 29 Growth-hungry investors are lining up for shares of burger chain Shake Shack  which plans to price its initial public offering after the U.S. stock market closes on Thursday.",
        "date": "01292015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Shake Shack IPO is hot but can it match Chipotle? "
    },
    {
        "content": "Chipotle Mexican Grill Inc's decision to suspend purchases from a pork producer that ran afoul of its animal welfare rules could bolster its reputation with diners but threatens sales and profits this quarter.",
        "date": "01142015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "topStory",
        "symbol": "CMG",
        "title": "Chipotle's pork plight could hurt first-quarter results "
    },
    {
        "content": "Jan 14 Chipotle Mexican Grill Inc's  decision to suspend purchases from a pork producer that ran afoul of its animal welfare rules could bolster its reputation with diners but threatens sales and profits this quarter.",
        "date": "01142015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "UPDATE 2-Chipotle's pork plight could hurt 1st qtr results "
    },
    {
        "content": "Jan 13 Chipotle Mexican Grill Inc said it would suspend pork sales at about a third of its U.S. restaurants  following a routine audit that revealed one of its suppliers was not complying with its animal-welfare standards.",
        "date": "01142015",
        "name": "Chipotle Mexican Grill Inc",
        "news_type": "normal",
        "symbol": "CMG",
        "title": "Chipotle suspends pork sales at a third of its U.S. restaurants "
    }
]