[
    {
        "content": "Oct 31 Truck engine manufacturer Cummins Inc posted better-than-expected quarterly profits and revenues on Tuesday  driven by strong demand for new trucks and construction but shares fell nearly 3 percent as investors reacted to lower margins.",
        "date": "10312017",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "Cummins shares fall on weaker margins despite profit beat "
    },
    {
        "content": "* Q3 earnings per share view $2.46 -- Thomson Reuters I/B/E/S",
        "date": "10312017",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "BRIEF-Cummins Q3 earnings per share $2.71 "
    },
    {
        "content": "* It is acquiring assets of Brammo Inc  which designs and develops battery packs for mobile and stationary applications​ Source text for Eikon: Further company coverage:",
        "date": "10162017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-Cummins buys battery pack developer Brammo Inc "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 16 (Fitch) Fitch Ratings has affirmed the Long-Term Issuer Default Ratings (IDRs) of Allison Transmission Holdings  Inc. (ALSN) and its Allison Transmission  Inc. (ATI) subsidiary at 'BB'. Fitch has also affirmed ATI's secured revolving credit facility and secured B-3 term loan ratings at 'BB+'/'RR1' and ATI's senior unsecured notes rating at 'BB'/'RR4'. Fitch's ratings apply to a $550 million secured revolving credit f",
        "date": "10162017",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "Fitch Affirms Allison Transmission's IDR at 'BB'; Outlook Stable "
    },
    {
        "content": "* Cummins announces proposal to implement unilateral shareholder by-law amendment power",
        "date": "10132017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-Cummins announces proposal to implement unilateral shareholder by-law amendment power "
    },
    {
        "content": "* GILLIG and Cummins announce electrified power partnership at APTA",
        "date": "10092017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-GILLIG and Cummins announce electrified power partnership at APTA "
    },
    {
        "content": "* Cummins and Achates Power to develop advanced combat vehicle engine to improve protection and performance of U.S. Armed forces",
        "date": "09282017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-Cummins and Achates Power to develop advanced combat vehicle engine "
    },
    {
        "content": "* Cummins Inc - On September 5  Cummins Inc entered into a 364-day credit agreement - SEC filing",
        "date": "09062017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-Cummins Inc enters 364-day credit agreement "
    },
    {
        "content": "* ‍Cummins has entered into a virtual power purchase agreement with edp renewables North America to expand a wind farm in Northern Indiana​ Source text for Eikon: Further company coverage:",
        "date": "08162017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-Cummins enters virtual power purchase agreement with EDP Renewables North America​ "
    },
    {
        "content": "* ‍Has acquired power equipment assets  primarily mobile rental generator sets  from Cummins Inc​",
        "date": "08222017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-United Rentals expands power & HVAC fleet with acquisition of portable power assets "
    },
    {
        "content": "Cummins Inc's  shares fell as much as 8.3 percent after the U.S. engine maker's profit missed Wall Street estimates  partly due to higher costs.",
        "date": "08012017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "Cummins' profit misses on higher costs  shares fall "
    },
    {
        "content": "* Says continues to invest in new product lines and targeted capacity expansions - sec filing",
        "date": "08012017",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "BRIEF-Cummins plans to spend between $500 mln-$530 mln in 2017 on capital expenditures "
    },
    {
        "content": "* Maintains EBIT of 11.75-12.5 pct of sales (Adds details from conference call)",
        "date": "08012017",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "UPDATE 3-Cummins' profit misses on higher costs  shares fall "
    },
    {
        "content": "* Cummins expects 2017 engine revenue to rise 10-12 percent versus an increase of 2-6 percent  previously; sees ebit margins of 10.50-11.50 percent of sales versus 10.25-11.25 percent previously",
        "date": "08012017",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "BRIEF-Cummins intends to provide fully electrified power train - Conf call "
    },
    {
        "content": "Aug 1 Engine maker Cummins Inc reported a 4.4 percent rise in quarterly profit on Tuesday  helped by higher sales across its businesses.",
        "date": "08012017",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "Cummins profit rises 4.4 percent "
    },
    {
        "content": "* Cummins says will be unifying its brand strategy across its power systems business segment",
        "date": "07252017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-Cummins will be unifying its brand strategy across its power systems business segment "
    },
    {
        "content": "* Cummins inc - approved an increase in company's quarterly cash dividend on common stock from $1.025 per share to $1.08 per share Source text for Eikon: Further company coverage:",
        "date": "07112017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-Cummins Inc increases quarterly cash dividend on common stock from $1.025 per share to $1.08 per share "
    },
    {
        "content": "June 14 Engine maker Cummins Inc plans to start production of electric powertrains for transit buses in cities around the world in 2019  executives said on a conference call on Wednesday.",
        "date": "06142017",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "Cummins to make electric powertrains for city buses in 2019 "
    },
    {
        "content": "WASHINGTON Contracts to buy previously owned U.S. homes fell for a second straight month in April amid a supply squeeze  but the housing market recovery remains supported by a strong labor market.",
        "date": "05312017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "U.S. pending home sales fall; housing market recovery intact "
    },
    {
        "content": "WASHINGTON  May 31 Contracts to buy previously owned U.S. homes fell for a second straight month in April amid a supply squeeze  but the housing market recovery remains supported by a strong labor market.",
        "date": "05312017",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "WRAPUP 1-U.S. pending home sales fall; housing market recovery intact "
    },
    {
        "content": "* Sets quarterly cash dividend of $1.025per share Source text for Eikon: Further company coverage:",
        "date": "05092017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-Cummins sets quarterly cash dividend of $1.025 per share "
    },
    {
        "content": "Engine maker Cummins Inc  on Tuesday raised its 2017 forecasts for revenue and earnings before interest and tax  on stronger-than-expected demand from the construction industry in China.",
        "date": "05022017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "Cummins raises 2017 forecasts on strong China construction demand "
    },
    {
        "content": "* Q1 sales $4.59 bln vs est $4.15 bln (Adds details from conference call)",
        "date": "05022017",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "UPDATE 3-Cummins raises 2017 forecasts on strong China construction demand "
    },
    {
        "content": "* Says demand for construction equipment doubled from a year ago in China in response to stronger infrastructure investment",
        "date": "05022017",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "BRIEF-Cummins says could acquire some subsystems technologies as electrified powertrain evolves - Conf Call "
    },
    {
        "content": "* Cummins announces first quarter results; raises outlook for 2017",
        "date": "05022017",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "BRIEF-Cummins Q1 EPS $2.36 "
    },
    {
        "content": "May 2 Engine maker Cummins Inc reported a 23.4 percent rise in quarterly profit  helped by higher sales across its businesses.",
        "date": "05022017",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "Cummins profit jumps 23.4 pct "
    },
    {
        "content": "* Eaton and cummins Inc announce joint venture for automated transmissions for heavy- and medium-duty commercial vehicles",
        "date": "04102017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-Eaton  Cummins announce joint venture "
    },
    {
        "content": "WASHINGTON Contracts to buy previously owned U.S. homes jumped to a 10-month high in February  pointing to robust demand for housing ahead of the busy spring selling season.",
        "date": "03292017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "U.S. pending home sales surge to ten-month high ahead of spring "
    },
    {
        "content": "WASHINGTON  March 29 Contracts to buy previously owned U.S. homes jumped to a 10-month high in February  pointing to robust demand for housing ahead of the busy spring selling season.",
        "date": "03292017",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "WRAPUP 2-U.S. pending home sales surge to 10-month high ahead of spring "
    },
    {
        "content": "* Cummins Inc - has increased its facility water goal to a 50 percent intensity reduction by 2020 from a baseline of 2010  Source text for Eikon: Further company coverage:",
        "date": "03212017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-Cummins Inc says has increased its facility water goal to a 50 percent intensity reduction by 2020 from a baseline of 2010 "
    },
    {
        "content": "* Cummins Inc - CEO Thomas Linebarger's total compensation in 2016 was $13.4 million versus $12.3 million in 2015 - SEC filing  Source text for Eikon: (http://bit.ly/2nz00YV) Further company coverage:",
        "date": "03172017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-Cummins Inc's CEO Thomas Linebarger's total compensation in 2016 was $13.4 million "
    },
    {
        "content": "CHICAGO Cummins Inc  reported a sharply higher fourth-quarter net profit on Thursday  but revenue fell  and the engine maker said difficult market conditions could hurt 2017 results.",
        "date": "02092017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "Cummins profit doubles as cost-cutting offsets lower revenue "
    },
    {
        "content": "CHICAGO  Feb 9 Cummins Inc reported a sharply higher fourth-quarter net profit on Thursday  but revenue fell  and the engine maker said difficult market conditions could hurt 2017 results.",
        "date": "02092017",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "UPDATE 1-Cummins profit doubles as cost-cutting offsets lower revenue "
    },
    {
        "content": "CHICAGO  Feb 9 Engine maker Cummins Inc  on Thursday reported a higher quarterly net profit  as cost cuts offset the effects of lower North American commercial truck production and weak global demand for industrial engines and power generation equipment.",
        "date": "02092017",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "Cummins quarterly profit doubles on cost-cutting initiatives "
    },
    {
        "content": "* Konica Minolta and Pioneer are concluding talks to merge their OLED lighting businesses under a 50-50 joint venture - Nikkei",
        "date": "01302017",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-Konica Minolta and Pioneer set to merge OLED lighting ops - Nikkei "
    },
    {
        "content": "Cummins Inc   a U.S. manufacturer of engines for large trucks  is preparing to explore the sale of a business that makes filters and coolants  potentially valuing it at more than $1.5 billion  according to people familiar with the matter.",
        "date": "12012016",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "Exclusive: Cummins to explore sale of its filtration business - sources "
    },
    {
        "content": "WASHINGTON  Nov 14 Fiat Chrysler Automobiles NV  and Cummins Inc said on Monday they will fight a class-action lawsuit filed against the companies accusing them of cheating on diesel emissions tests.",
        "date": "11142016",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "Fiat Chrysler  Cummins reject diesel cheating suit "
    },
    {
        "content": "* FCA US has received notice of the filing against FCA US and Cummins Inc. of a complaint by certain Dodge Ram Truck owners regarding the emissions performance of some Ram trucks",
        "date": "11142016",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "BRIEF-Fiat Chrysler says will contest lawsuit by Dodge Ram owners on emissions "
    },
    {
        "content": "CHICAGO  Nov 1 Engine maker Cummins Inc  on Tuesday reported a lower quarterly profit due to weak heavy-duty truck production in North America and poor global demand for power generation equipment  and said its full-year margin on earnings before income tax would be affected by a third quarter charge.",
        "date": "11012016",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "UPDATE 2-Cummins 3rd-qtr profit down on weak truck production "
    },
    {
        "content": "CHICAGO Engine maker Cummins Inc  on Tuesday reported a lower quarterly profit as revenue was hit by weak heavy-duty truck production in North America and poor global demand for power generation equipment.",
        "date": "11012016",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "Cummins third-quarter profit drops on weak truck production "
    },
    {
        "content": "* Cummins inc says full year 2016 ebit expected to be 11.3 percent of sales  compared to prior guidance of 11.6 to 12.2 percent",
        "date": "11012016",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "BRIEF-Cummins Q3 EPS $1.72 "
    },
    {
        "content": "CHICAGO  Nov 1 Engine maker Cummins Inc  on Monday reported a lower quarterly net profit as revenue declined in all its businesses  lead by a 12 percent drop in its engines unit due to weak heavy-duty truck production in North America.",
        "date": "11012016",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "Weak truck production hits Cummins quarterly profit "
    },
    {
        "content": "* Co's subsidiary entered into JV agreement with CMI Africa Holding BV (Cummins BV)",
        "date": "09162016",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-Car And General(Kenya) says unit enters into JV with CMI Africa Holding BV "
    },
    {
        "content": "* Algeco scotsman names diarmuid cummins chief executive officer  Source text for Eikon:  Further company coverage:",
        "date": "09092016",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-Algeco Scotsman names Diarmuid Cummins CEO "
    },
    {
        "content": "* Q2 earnings per share view $2.16 -- Thomson Reuters I/B/E/S",
        "date": "08022016",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-Cummins Q2 earnings per share $2.40 "
    },
    {
        "content": "June 28 Volkswagen AG's $15.3 billion settlement of allegations that it cheated on diesel engine pollution tests promises a substantial boost for federal and state efforts to expand electric vehicle sales  and could also help producers of commercial trucks and buses and other heavy equipment.",
        "date": "06282016",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "Volkswagen diesel deal could be a win for many companies "
    },
    {
        "content": "WASHINGTON  May 26 Contracts to buy previously owned U.S. homes surged far more than expected in April to the highest level in more than a decade  another sign the economy has gained steam during the second quarter.",
        "date": "05262016",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "U.S. pending home sales jump to highest level since early 2006 "
    },
    {
        "content": "* Q1 earnings per share view $1.78 -- Thomson Reuters I/B/E/S",
        "date": "05032016",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-Cummins posts Q1 earnings per share $1.87 "
    },
    {
        "content": "* Announces planned termination of as CEO and Bill Cummins as CFO  effective immediately",
        "date": "05022016",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "BRIEF-Petromanas announces departure of CEO and CFO "
    },
    {
        "content": "CHICAGO  Feb 4 Diesel engine maker Cummins Inc  on Thursday posted a lower quarterly profit as global economic weakness continued to hurt revenue and restructuring costs ate into its profits.",
        "date": "02042016",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "Cummins quarterly profit tumbles as global economic weakness hurts sales "
    },
    {
        "content": "DETROIT - Nov 20 The head of Daimler AG's  commercial truck operation told Reuters Friday the company will invest $375 million at a complex near Detroit to build diesel engines for medium duty trucks  expanding a strategy of building and selling trucks  engines  transmissions and axles as a package.",
        "date": "11202015",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "UPDATE 1-Daimler to invest $375 mln to build diesel engines "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 11 (Fitch) Fitch Ratings believes Cummins Inc.'s (CMI)  financial flexibility mitigates concerns about possible debt funded  acquisitions  although there is an increased risk that such transactions could  occur. CMI stated during a meeting with investors yesterday that it could allow  leverage to increase in the event of material acquisitions  including an  increase in debt/EBITDA to a range of 1.5x-2.0x  or possibly h",
        "date": "11112015",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "Fitch: Cummins' Financial Flexibility Mitigates Increased Risk of Debt Funded Acquisitions "
    },
    {
        "content": "CHICAGO Diesel engine maker Cummins Inc  on Tuesday posted a lower-than-expected quarterly profit and said it would lay off up to 2 000 people as global economic weakness continued to weigh on its international sales.",
        "date": "10272015",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "Cummins to cut jobs as weak global economy hurts sales "
    },
    {
        "content": "CHICAGO  Oct 27 Diesel engine maker Cummins Inc  on Tuesday posted a lower-than-expected quarterly profit and said it would lay off up to 2 000 people as global economic weakness continued to weigh on its international sales.",
        "date": "10272015",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "UPDATE 2-Cummins to cut jobs as weak global economy hurts sales "
    },
    {
        "content": "CHICAGO  Oct 27 Diesel engine maker Cummins Inc  on Tuesday posted a lower quarterly net profit and said that it would lay off up to 2 000 people as global economic weakness continued to weigh on its international sales.",
        "date": "10272015",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "REFILE-Cummins quarterly profit falls  company announces job cuts "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 02 (Fitch) Fitch Ratings has affirmed Cummins  Inc.'s (CMI)  Issuer Default Rating (IDR) and long-term debt ratings at 'A'. The Rating  Outlook is Stable. A full list of rating actions follows at the end of this  release. KEY RATING DRIVERS The ratings incorporate CMI's strong operating profile including competitive  positions in its engine and power generation markets  strong technological  capabilities  and global dis",
        "date": "10022015",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "Fitch Affirms Cummins at 'A'; Outlook Stable "
    },
    {
        "content": "Shares of Cummins Inc  rose almost 4 percent after the diesel engine maker reported a rise in quarterly revenue  boosted by distributor acquisitions in North America and stronger demand in truck and bus markets.",
        "date": "07282015",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "Diesel engine maker Cummins' quarterly profit  revenue rise "
    },
    {
        "content": "July 28 Shares of Cummins Inc rose almost 4 percent after the diesel engine maker reported a rise in quarterly revenue  boosted by distributor acquisitions in North America and stronger demand in truck and bus markets.",
        "date": "07282015",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "UPDATE 1-Diesel engine maker Cummins' quarterly profit  revenue rise "
    },
    {
        "content": "July 28 Diesel engine maker Cummins Inc  reported a 4 percent rise in quarterly revenue  boosted by distributor acquisitions in North America and stronger demand in truck and bus markets.",
        "date": "07282015",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "Diesel engine maker Cummins 2nd-qtr profit  revenue rise "
    },
    {
        "content": "July 28 Diesel engines maker Cummins Inc  reported a 4 percent rise in quarterly revenue  helped by higher demand in North America.",
        "date": "07282015",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "Diesel engine maker Cummins' revenue rises on N America demand "
    },
    {
        "content": "Diesel engine maker Cummins Inc  cut its full-year revenue forecast  citing weak demand in international markets and a strong dollar  sending its shares down about 3.6 percent in premarket trade on Thursday.",
        "date": "02052015",
        "name": "Cummins Inc",
        "news_type": "topStory",
        "symbol": "CMI",
        "title": "Cummins cuts forecast due to weak overseas demand  strong dollar "
    },
    {
        "content": "Feb 5 Diesel engine maker Cummins Inc  cut its full-year revenue forecast  citing weak demand in international markets and a strong dollar  sending its shares down about 3.6 percent in premarket trade on Thursday.",
        "date": "02052015",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "UPDATE 1-Cummins cuts forecast due to weak overseas demand  strong dollar "
    },
    {
        "content": "Feb 5 Cummins Inc  a maker of diesel engines  reported an 11 percent rise in quarterly revenue  helped by strong demand from  North America.",
        "date": "02052015",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "Diesel engine maker Cummins reports 11 pct rise in revenue "
    },
    {
        "content": "WASHINGTON  Jan 23 Cummins Inc Chief Executive Officer Tom Linebarger said on Friday the company is still growing its market share in China but is prepared for lower infrastructure spending in the country.",
        "date": "01232015",
        "name": "Cummins Inc",
        "news_type": "normal",
        "symbol": "CMI",
        "title": "Cummins CEO says still growing market share in China "
    }
]