[
    {
        "content": "* Centene Corp says ‍announced \"enhanced\" organizational structure and appointments of several executives  effective November 16​",
        "date": "11162017",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene Corp ‍announced appointments of several executives "
    },
    {
        "content": "NEW YORK  Nov 9 Consumer sign-ups for Obamacare individual insurance plans were more than 600 000 during the first week of enrollment for 2018  a U.S. health agency said on Thursday  a positive sign for insurers who take part in the healthcare program that Republicans are trying to undo.",
        "date": "11092017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 1-Consumers sign up for Obamacare 2018 individual plans despite uncertainty "
    },
    {
        "content": "Oct 27 U.S. pharmacy operator CVS Health Corp's move to buy health insurer Aetna Inc could shore-up CVS' vulnerable pharmacy business and spur another round of dealmaking in an industry fearing Amazon's arrival  analysts said.",
        "date": "10272017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 1-CVS deal for Aetna could help retailer face Amazon entry - analysts "
    },
    {
        "content": "Oct 27 U.S. pharmacy operator CVS Health Corp's move to buy health insurer Aetna Inc will broaden their reach in the industry and could spark another round of dealmaking in a sector dreading Amazon's arrival  analysts said.",
        "date": "10272017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "CVS-Aetna deal gets Wall Street thumbs up amid Amazon entry fears "
    },
    {
        "content": "Centene Corp said on Tuesday that White House moves to cut Obamacare subsidies would knock 7-12 cents per share off the health insurer's fourth-quarter earnings  sending its shares as much as 8 percent lower.",
        "date": "10242017",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "Centene warns on Obamacare subsidy cuts  shares dive "
    },
    {
        "content": "* Shares slump 8 pct (Adds analyst comment  updates share move)",
        "date": "10242017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 4-Centene warns on Obamacare subsidy cuts  shares dive "
    },
    {
        "content": "* Centene says in October 2017  civil investigative demand was issued to co's unit  Health Net Federal Services by U.S. Department of Justice - SEC filing",
        "date": "10242017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "BRIEF-Centene says civil investigative demand was issued to co's unit  Health Net Federal Services by U.S. DoJ in Oct "
    },
    {
        "content": "Oct 24 Health insurer Centene Corp reported a nearly 40 percent rise in quarterly profit as it added more members.",
        "date": "10242017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "CORRECTED-Health insurer Centene's quarterly profit rises nearly 40 pct "
    },
    {
        "content": "* Centene corporation reports 2017 third quarter results & updates 2017 guidance",
        "date": "10242017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "BRIEF-Centene reports Q3 earnings per share $1.16 "
    },
    {
        "content": "* Centene ‍comments on updated Medicare Star quality ratings for 2018 rating year published by Centers for Medicare and Medicaid Services​",
        "date": "10112017",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene ‍comments on updated Medicare Star quality ratings for 2018 ​ "
    },
    {
        "content": "* Centene announces early termination of Hart-Scott-Rodino waiting period in connection with planned acquisition of Fidelis care",
        "date": "10022017",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene announces early termination of Hart-Scott-Rodino waiting period in connection with planned acquisition of Fidelis Care "
    },
    {
        "content": "* Coordinated Care  unit of Centene Corporation  says received national health plan accreditation from national committee for quality assurance​ Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "09192017",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene Corp's unit says received national health plan accreditation "
    },
    {
        "content": "* Centene-In event asset purchase deal terminated  terminating party to pay termination fee $5 million; regarding co's deal with Fidelis - SEC filing‍​ Source text: (http://bit.ly/2f4fgO3) Further company coverage:",
        "date": "09122017",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene-In event asset purchase deal terminated  terminating party to pay termination fee of $5 million​ "
    },
    {
        "content": "Health insurer Centene Corp  said it would buy privately held Fidelis Care for $3.75 billion to enter New York  the second largest managed care state by membership in the United States.",
        "date": "09122017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "Centene to buy Fidelis Care for $3.75 billion to enter New York "
    },
    {
        "content": "Sept 12 Health insurer Centene Corp said it would buy privately held Fidelis Care for $3.75 billion to enter New York  the second largest managed care state by membership in the United States.",
        "date": "09122017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 1-Centene to buy Fidelis Care for $3.75 bln to enter New York "
    },
    {
        "content": "* Centene Corporation to enter New York through transaction with Fidelis Care",
        "date": "09122017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "BRIEF-Centene to enter New York through transaction with Fidelis Care "
    },
    {
        "content": "Sept 12 Health insurer Centene Corp said on Tuesday it would buy New York-focused  privately held Fidelis Care for $3.75 billion.",
        "date": "09122017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "Health insurer Centene to buy Fidelis Care for $3.75 bln "
    },
    {
        "content": "Centene Corp  one of the largest players in the Obamacare individual insurance market  said it would offer Obamacare plans in Nevada in 2018.",
        "date": "08152017",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "Centene to sell Obamacare plans in Nevada next year "
    },
    {
        "content": "Aug 15 Centene Corp  one of the largest players in the Obamacare individual insurance market  said it would offer Obamacare plans in Nevada in 2018.",
        "date": "08152017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 1-Centene to sell Obamacare plans in Nevada next year "
    },
    {
        "content": "Aug 15 Centene Corp  one of the largest players in the Obamacare individual insurance market  will offer Obamacare plans in 14 rural counties of Nevada in 2018  the Nevada Independent reported  citing people familiar with the matter. (http://bit.ly/2w76jKR)",
        "date": "08152017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "Centene to sell Obamacare plans in Nevada next year - report "
    },
    {
        "content": "Centene Corp's  quarterly profit and revenue topped estimates and the health insurer raised its full-year profit forecast as it benefits from a strong Obamacare business  in sharp contrast to other struggling large-cap insurers.",
        "date": "07252017",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "Strong Obamacare business boosts Centene's quarterly results "
    },
    {
        "content": "* Shares rise as much as 4.2 pct (Adds conference call comments  details; updates shares)",
        "date": "07252017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 3-Strong Obamacare business boosts Centene's quarterly results "
    },
    {
        "content": "* Centene corporation reports 2017 second quarter results & raises 2017 guidance",
        "date": "07252017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "BRIEF-Centene Corp reports Q2 adjusted earnings per share $1.59 "
    },
    {
        "content": "July 25 Health insurer Centene Corp reported a 49.4 percent increase in quarterly profit on Tuesday  driven by higher enrollments in its Medicaid plans for low-income families.",
        "date": "07252017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "Health insurer Centene's quarterly profit jumps 49.4 pct "
    },
    {
        "content": "NEW YORK  June 30 Centene Corp  one of the largest providers of individual insurance created by Obamacare  said on Friday it would sell plans in 2018 in its home state of Missouri  a market where some individual customers were facing no insurance option next year.",
        "date": "06302017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "Centene to fill individual insurance gaps in Missouri "
    },
    {
        "content": "* Centene corp - plans to launch its health insurance marketplace product  ambetter  in missouri for 2018 Source text for Eikon: Further company coverage:",
        "date": "06302017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "BRIEF-Centene plans to launch health insurance marketplace product in Missouri for 2018 "
    },
    {
        "content": "* Centene's Mississippi subsidiary selected for MississippiCAN contract",
        "date": "06202017",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene's Mississippi subsidiary selected for MississippiCAN contract "
    },
    {
        "content": "June 13 Centene Corp  one of the largest players in the Obamacare individual insurance market  is expanding into three new states  despite uncertainty over the future of the legislation under President Donald Trump's administration.",
        "date": "06132017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "Centene to expand Obamacare insurance to 3 new states in 2018 "
    },
    {
        "content": "Centene Corp  one of the largest players in the Obamacare individual insurance market  said on Tuesday it would expand into three new states in 2018  despite uncertainty over the future of the legislation under President Donald Trump's administration.",
        "date": "06132017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "Centene to expand Obamacare insurance to three new states in 2018 "
    },
    {
        "content": "June 13 Centene Corp  one of the largest players in the Obamacare individual insurance market  said on Tuesday it would expand into three new states in 2018  despite uncertainty over the future of the legislation under President Donald Trump's administration.",
        "date": "06132017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 1-Centene to expand Obamacare insurance to 3 new states in 2018 "
    },
    {
        "content": "* Centene Corp says  expanding its offerings in 2018 health insurance marketplace  or exchange",
        "date": "06132017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "BRIEF-Centene says will expand its offerings in 2018 health insurance marketplace "
    },
    {
        "content": "May 16 The U.S. Justice Department for the second time in a month sued UnitedHealth Group Inc on Tuesday  accusing the nation's largest health insurer of obtaining over $1 billion from Medicare to which it was not entitled.",
        "date": "05172017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "U.S. sues UnitedHealth again for mischarging Medicare Advantage "
    },
    {
        "content": "* Centene Corp - Centurion Of Florida been chosen to provide correctional healthcare services for florida department of corrections in South Florida Source text for Eikon: Further company coverage:",
        "date": "05112017",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene says Centurion to provide correctional healthcare services in South Florida "
    },
    {
        "content": "* Files for potential mixed shelf offering; size not disclosed - SEC filing Source text for Eikon: [http://bit.ly/2qGsf8T] Further company coverage:",
        "date": "05032017",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene Corp files for potential mixed shelf offering "
    },
    {
        "content": "* Centene corp - at 2017 annual meeting of stockholders held on april 25  stockholders approved amendment to 2012 stock incentive plan - sec filing",
        "date": "04272017",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene Corp says stockholders approved amendment to 2012 stock incentive plan "
    },
    {
        "content": "Health insurer Centene Corp reported better-than-expected quarterly revenue and profit  helped by its Health Net acquisition and growth in its Obamacare individual business.",
        "date": "04252017",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "Health insurer Centene's quarterly profit  revenue beat Street "
    },
    {
        "content": "* 12.15 mln members as of March. 31  up 5 pct from yr ago (Adds details  analyst comment)",
        "date": "04252017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 2-Health insurer Centene's quarterly profit  revenue beat Street "
    },
    {
        "content": "April 25 Centene Corp reported better-than-expected quarterly revenue and profit as the health insurer benefited from its Health Net acquisition.",
        "date": "04252017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 1-Health insurer Centene's quarterly profit  revenue beat Street "
    },
    {
        "content": "* Centene Corporation reports 2017 first quarter results & updates 2017 guidance",
        "date": "04252017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "BRIEF-Centene Corporation says Q1 earnings per share $0.79 "
    },
    {
        "content": "April 25 Health insurer Centene Corp reported a 69 percent rise in quarterly revenue  helped by its Health Net acquisition and higher enrollments.",
        "date": "04252017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "Health insurer Centene's quarterly revenue jumps 69 pct "
    },
    {
        "content": "* CEO Michael Neidorff's total 2016 compensation was $22 million versus $20.8 million in 2015  - SEC filing  Source text for Eikon: Further company coverage:",
        "date": "03102017",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene CEO Neidorff's total 2016 compensation $22 mln "
    },
    {
        "content": "Centene Corp  reported quarterly revenue and profit ahead of analysts' estimates  helped by growth in its Obamacare individual business and as the health insurer's efforts to turn around recently acquired Health Net paid off.",
        "date": "02072017",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "Health insurer Centene's revenue  profit beat Street "
    },
    {
        "content": "* Shares rise as much as 8.25 pct   (Adds conference call comments  updates shares)",
        "date": "02072017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 3-Health insurer Centene's revenue  profit beat Street "
    },
    {
        "content": "* Centene corporation reports 2016 fourth quarter and full year results",
        "date": "02072017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "BRIEF-Centene Corp Q4 EPS $1.45 "
    },
    {
        "content": "Feb 7 Health insurer Centene Corp  reported an 89 percent rise in quarterly revenue on Tuesday  helped primarily by the acquisition of Health Net and increased memberships.",
        "date": "02072017",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "Health insurer Centene's quarterly revenue nearly doubles "
    },
    {
        "content": "* Gao decision upholds tricare west region contract award to centene subsidiary",
        "date": "11142016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene says GAO decision upholds TRICARE west region contract award to co's unit "
    },
    {
        "content": "* Four-year agreement  with possibility of two one-year extensions  is expected to commence on July 1  2017",
        "date": "11072016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene announces new Medicaid contract in Nevada "
    },
    {
        "content": "* unit  Kentucky Spirit Health Plan  has settled all lawsuits and complaints associated with its contract with Commonwealth Of Kentucky",
        "date": "11042016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene reaches settlement with Commonwealth of Kentucky "
    },
    {
        "content": "* Centene - On November 3  2016 company's unit entered into a settlement agreement with respect to contract termination with Commonwealth of Kentucky - SEC filing",
        "date": "11042016",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "BRIEF-Centene's unit enters into settlement agreement with respect to contract termination with Commonwealth of Kentucky "
    },
    {
        "content": "* Centene Corp - issued $1.2 billion principal amount of company's 4.75% senior notes due 2025 - SEC filing",
        "date": "11092016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene issues $1.2 bln principal amount of its 4.75% senior notes "
    },
    {
        "content": "* priced $1.2 billion aggregate principal amount of its 4.75% senior notes due 2025   Source text for Eikon:  Further company coverage:",
        "date": "10262016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene Corporation announces pricing of notes "
    },
    {
        "content": "* Centene Corp says commenced an offering of approximately $1 billion aggregate principal amount of senior notes due 2025",
        "date": "10262016",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "BRIEF-Centene Corporation announces offering of notes "
    },
    {
        "content": "Health insurer Centene Corp  said it expects performance in its recently acquired Health Net business to improve by next year  as price increases and market exits begin to pay off.",
        "date": "10252016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "Centene expects recent steps to bolster Health Net ops "
    },
    {
        "content": "* Shares rise as much as 6 pct to $66.80   (Adds details; updates shares)",
        "date": "10252016",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 2-Centene expects recent steps to bolster Health Net ops "
    },
    {
        "content": "* Q3 revenue $10.8 billion versus i/b/e/s view $10.96 billion",
        "date": "10252016",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "BRIEF-Centene Q3 adjusted EPS $1.11 "
    },
    {
        "content": "Oct 25 Health insurer Centene Corp  reported a 56 percent jump in quarterly profit  driven by its Health Net acquisition and higher enrolments in its Medicaid plans for low-income families.",
        "date": "10252016",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "Health insurer Centene's quarterly profit surges 56 pct "
    },
    {
        "content": "* Says plan design changes will become effective January 1  2017",
        "date": "10032016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene submits final filing for 2017 benefit plan design "
    },
    {
        "content": "* Says it estimates that its 2017 Ambetter offerings in Arizona will provide incremental revenue of over $500 million",
        "date": "09152016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene expands marketplace offering in Arizona "
    },
    {
        "content": "* Centene corp says Pennsylvania subsidiary awarded statewide community healthchoices managed care agreement",
        "date": "08302016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene Corp says subsidiary awarded contract "
    },
    {
        "content": "* Centene's subsidiary  health net  announces settlement regarding employee severance agreements",
        "date": "08162016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Health Net announces settlement regarding employee severance agreements "
    },
    {
        "content": "WASHINGTON  Aug 16 For the second time in less than a week  U.S. securities regulators on Tuesday filed civil charges against a company for inserting language into its severance agreements that prevents outgoing employees from reaping the benefits of government whistleblower awards.",
        "date": "08162016",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 3-U.S. SEC cracks down on severance agreements that deter whistleblowing "
    },
    {
        "content": "Centene Corp's chief executive said the mid-cap health insurer did not have the network for the Medicare Advantage assets Aetna Inc or other large managed care companies are looking to sell as part of the industry-wide consolidation.",
        "date": "07262016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "Centene says it does not have network for Aetna's assets "
    },
    {
        "content": "* Shares fall as much as 15 pct   (Adds CEO comments  share move)",
        "date": "07262016",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 2-Centene says it does not have network for Aetna's assets "
    },
    {
        "content": "July 26 Health insurer Centene Corp said its quarterly revenue nearly doubled  helped by the acquisition of rival Health Net.",
        "date": "07262016",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "Health insurer Centene's 2nd-qtr revenue nearly doubles "
    },
    {
        "content": "* June 30  2016 managed care membership of 11.4 million  an increase of 6.8 million members  or 148% compared to Q2 of 2015.",
        "date": "07262016",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "BRIEF-Centene Q2 adjusted earnings per share $1.29 "
    },
    {
        "content": "WellCare Health Plans Inc  and Centene Corp  have made competing offers for the Medicare Advantage insurance plans  that Aetna Inc  looks to shed in seeking clearance for its acquisition of Humana Inc   people familiar with the matter said. | Video ",
        "date": "07112016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "Exclusive: WellCare  Centene make offers for Aetna assets - sources "
    },
    {
        "content": "* Centene Corp says priced $500 million aggregate principal amount of its 4.75 pct senior notes due 2022",
        "date": "06092016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene Corporation announces pricing of notes "
    },
    {
        "content": "* Commenced an offering of approximately $500 million aggregate principal amount of 4.75% senior notes",
        "date": "06092016",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "BRIEF-Centene Corp announces offering of notes "
    },
    {
        "content": "* Contract is expected to commence in 2017 and does not impact Centene's previously announced 2016 financial guidance",
        "date": "05252016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene awarded contract for Maryland physicians care plan operations "
    },
    {
        "content": "* Centene Corporation appoints Christopher Isaak as corporate controller and chief accounting officer  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04282016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene Corp appoints Christopher Isaak as chief accounting officer "
    },
    {
        "content": "U.S. health insurer Centene Corp  reported a better-than-expected quarterly profit  helped by lower medical costs in certain patient populations and the acquisition of rival Health Net.",
        "date": "04262016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "Health insurer Centene's profit beats as medical costs fall "
    },
    {
        "content": "* Cuts 2016 adjusted profit forecast to $4.00-$4.35/share   (Adds details)",
        "date": "04262016",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 2-Health insurer Centene's profit beats as medical costs fall "
    },
    {
        "content": "April 26 Health insurer Centene Corp  reported a near 36 percent rise in quarterly revenue  helped by higher enrollments in its Medicaid plans and the acquisition of rival Health Net.",
        "date": "04262016",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "CORRECTED-Health insurer Centene's Q1 revenue rises 36 pct "
    },
    {
        "content": "* Health benefits ratio of 88.7 pct for Q1 of 2016  compared to 89.8 pct in Q1 of 2015",
        "date": "04262016",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "BRIEF-Centene Corp reports Q1 loss $0.13/shr "
    },
    {
        "content": "* Receipt of approval of Centene's planned merger with Health Net from California Department of insurance",
        "date": "03232016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene  Health Net get CDI regulatory approval "
    },
    {
        "content": "* Expect to close deal shortly after receipt of approval from California Department Of Insurance  Source text for Eikon:  Further company coverage:     (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "03222016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene and Health Net receive DMHC regulatory approval "
    },
    {
        "content": "* Entered into a new credit agreement providing for a $1 billion unsecured multi-currency revolving credit facility",
        "date": "03242016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "BRIEF-Centene entered into credit agreement providing for $1 bln credit facility "
    },
    {
        "content": "* Appointment of Vicki Escarra  a director of Health Net to board  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "03242016",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "BRIEF-Centene Corp increased size of board to 10 directors "
    },
    {
        "content": "Insurer Health Net Inc  which is being bought by rival Centene Corp  said it lost members in its individual business that sells plans under Obamacare  echoing thoughts of larger rivals in the sector.",
        "date": "02252016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "Health Net says quarterly membership in Obamacare plans declined "
    },
    {
        "content": "Feb 25 Insurer Health Net Inc  which is being bought by rival Centene Corp  said it lost members in its individual business that sells plans under Obamacare  echoing thoughts of larger rivals in the sector.",
        "date": "02252016",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "CORRECTED-Health Net says quarterly membership in Obamacare plans declined "
    },
    {
        "content": "Health insurer Centene Corp said on Monday it is missing six hard drives containing the personal and health information of about 950 000 people.",
        "date": "01262016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "Health insurer Centene missing data drives with client information "
    },
    {
        "content": "Jan 25 Health insurer Centene Corp said on Monday it is missing six hard drives containing the personal and health information of about 950 000 people.",
        "date": "01262016",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 1-Health insurer Centene missing data drives with client information "
    },
    {
        "content": "Jan 25 Health insurer Centene Corp said on Monday it is missing six hard drives that contain personal and health information of about 950 000 people.",
        "date": "01252016",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "Health insurer Centene missing data drives with client information "
    },
    {
        "content": "Health insurer Centene Corp reported a better-than-expected quarterly profit and said it would consider buying the Medicare Advantage plans its rivals are likely to divest during the current phase of consolidation in the managed care industry.",
        "date": "07282015",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "Centene considers snapping up Medicare Advantage plans from rivals "
    },
    {
        "content": "* Total revenue up 37 pct to $5.51 bln vs est $5.53 bln   (Adds details from conference call)",
        "date": "07282015",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 2-Centene considers snapping up Medicare Advantage plans from rivals "
    },
    {
        "content": "July 28 Health insurer Centene Corp  reported a 79.6 percent jump in quarterly profit as it added 1.3 million members.",
        "date": "07282015",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "Health insurer Centene's profit jumps 79.6 pct "
    },
    {
        "content": "U.S. health insurer Centene Corp will buy smaller rival Health Net Inc for $6.3 billion  underscoring the healthcare industry's rush to bulk up to negotiate better prices with suppliers and hospitals  and attract new customers. | Video ",
        "date": "07022015",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "Health insurer Centene adds muscle with $6.3 billion Health Net deal "
    },
    {
        "content": "* Deal to create leader in government health insurance programs",
        "date": "07022015",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 3-Health insurer Centene adds muscle with $6.3 bln Health Net deal "
    },
    {
        "content": "July 2 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Thursday:",
        "date": "07022015",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "July 2 U.S. stock index futures rose slightly on Thursday ahead of a critical job report that could feed into the U.S. Federal Reserve's decision on when to increase interest rates.",
        "date": "07022015",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "US STOCKS-U.S. futures rise ahead of jobs data "
    },
    {
        "content": "July 2 U.S. health insurer Centene Corp  said it would buy Health Net Inc for $6.3 billion in cash and stock to bolster its position as a manager of government health insurance programs.",
        "date": "07022015",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "Health insurer Centene to buy Health Net for $6.3 bln "
    },
    {
        "content": "Thomson Reuters July 2  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                ** ",
        "date": "07022015",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "Thomson Reuters April 28  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04282015",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "Aetna Inc   the third largest U.S. health insurer  raised its 2015 profit forecast after negotiating a price cut from Gilead Sciences Inc  on hepatitis C treatments for this year.",
        "date": "02032015",
        "name": "Centene Corporation",
        "news_type": "topStory",
        "symbol": "CNC",
        "title": "Health insurer Aetna raises 2015 profit forecast "
    },
    {
        "content": "Health insurer Centene Corp  reported a better-than-expected quarterly profit as it added more Medicaid members  and assured investors of \"stable medical costs\" in 2015.",
        "date": "02032015",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "Health insurer Centene's profit beats as membership rises "
    },
    {
        "content": "* Shares rise as much as 4 pct to record high   (Adds conference call details  analyst's comments  share movement)",
        "date": "02032015",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "UPDATE 2-Health insurer Centene's profit beats as membership rises "
    },
    {
        "content": "Feb 3 Health insurer Centene Corp's  quarterly profit more than doubled as it added more Medicaid members under Obamacare.",
        "date": "02032015",
        "name": "Centene Corporation",
        "news_type": "normal",
        "symbol": "CNC",
        "title": "Health insurer Centene's profit doubles as membership rises "
    }
]