[
    {
        "content": "* Announces pricing of its $500 million 3.850% notes due 2027",
        "date": "11092017",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "BRIEF-CNH Industrial Announces pricing of $500 mln 3.850% notes "
    },
    {
        "content": "* CNH Industrial N.V. announces notes offering Source text for Eikon: Further company coverage:",
        "date": "11092017",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "BRIEF-CNH Industrial N.V. announces notes offering "
    },
    {
        "content": "Oct 31 CNH Industrial CEO Richard Tobin tells analysts in a post-results call:",
        "date": "10312017",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "BRIEF-CNH Industrial CEO says premature to consider idea of spin-offs "
    },
    {
        "content": "(The following statement was released by the rating agency) BARCELONA/LONDON  October 30 (Fitch) Fitch Ratings has assigned CNH Industrial N.V. (CNHI) a senior unsecured rating of 'BBB-'.  Fitch has also rated the Euro medium-term note (EMTN) programme for CNH Industrial Finance Europe S.A. and USD600 million bond issued by CNHI at 'BBB-'. The dollar bond is listed on the New York Stock Exchange and the EMTN programme on the Irish Stock Exchange. The EUR10 billion programme only benefits from th",
        "date": "10302017",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "Fitch Assigns Senior Unsecured Rating to CNH Industrial N.V. of 'BBB-' "
    },
    {
        "content": "MILAN  Oct 31 Trucks and tractor maker CNH Industrial on Tuesday raised its full-year sales and earnings guidance after reporting a 41 percent rise in quarterly operating profit for industrial activities  sending its shares up more than 2 percent.",
        "date": "10312017",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "CNH Industrial raises sales  profit guidance after upbeat Q3 "
    },
    {
        "content": "(The following statement was released by the rating agency) BARCELONA/LONDON  October 24 (Fitch) Fitch Ratings has assigned CNH Industrial N.V. (CNHI) and published US-based CNH Industrial Capital LLC's (CNHI Capital) Long-Term Issuer Default Ratings (IDR) of 'BBB-' Fitch has also published CNH Industrial Capital's Short-Term IDR of 'F3'. The Rating Outlook is Stable. A complete list of ratings is available at the end of this commentary. The ratings of CNHI reflect its strong business profile  i",
        "date": "10242017",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "Fitch Rates CNH Industrial 'BBB-'; Publishes CNH Industrial Capital's Rating "
    },
    {
        "content": "* CNH Industrial and Trimble announce data sharing connectivity Source text for Eikon: Further company coverage:",
        "date": "07252017",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "BRIEF-CNH Industrial  Trimble announce data sharing connectivity "
    },
    {
        "content": "* CNH Industrial NV - net industrial debt was $2.1 billion at march 31  2017",
        "date": "04272017",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "BRIEF-CNH Industrial qtrly adjusted earnings per share $0.04 "
    },
    {
        "content": "* Q1 operating profit of industrial activities $219 million  up 23 percent year-on-year  with an operating margin of 4.1 percent",
        "date": "04272017",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "BRIEF-CNH Industrial Q1 industrial activities op. profit up 23 pct "
    },
    {
        "content": "* CNH Industrial NV - unit case New Holland Industrial redeeming all of outstanding $636.1 million aggregate principal amount of 7⅞% senior notes due 2017",
        "date": "04272017",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "BRIEF-CNH Industrial to redeem its 7⅞ pct senior notes due 2017 "
    },
    {
        "content": "* CNH Industrial NV- subsidiary has priced $500 million in aggregate principal amount of 4.375 pct notes due 2022  issued at par Source text for Eikon: Further company coverage:",
        "date": "04052017",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "BRIEF-CNH Industrial unit priced $500 mln in aggregate principal amount of 4.375 pct notes due 2022  issued at par "
    },
    {
        "content": "* Co's unit plans to offer new notes  subject to market conditions Source text for Eikon: Further company coverage:",
        "date": "04052017",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "BRIEF-CNH Industrial announces subsidiary notes offering "
    },
    {
        "content": "* Has completed sale of 1.17 percent of shares in CNH Industrial at a price of 9.05 euros per share",
        "date": "03162017",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "BRIEF-Fiat Chrysler completes sale of 1.17 pct in CNH Industrial "
    },
    {
        "content": "* to launch placement of CNH Industrial shares equal to a 1.17 percent stake in the trucks and tractor maker via an accelerated bookbuilding to certain institutional investors",
        "date": "03162017",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "BRIEF-Fiat Chrysler launches placement of 1.17 pct stake in CNH Industrial "
    },
    {
        "content": "* In Q4 of 2016  consolidated revenues were $6 998 million  down 2.0% compared to Q4 of 2015",
        "date": "01312017",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "BRIEF-CNH Industrial NV Q4 adjusted diluted EPS $0.14 "
    },
    {
        "content": "NEW YORK  Jan 25 New York prosecutors have dropped charges that Lapo Elkann  grandson of late Fiat patriarch Gianni Agnelli  falsely reported he was kidnapped in November in an effort to get ransom money.",
        "date": "01252017",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "UPDATE 3-New York prosecutor drops charges against Fiat heir Lapo Elkann "
    },
    {
        "content": "NEW YORK New York prosecutors have dropped charges that Lapo Elkann  grandson of late Fiat patriarch Gianni Agnelli  falsely reported he was kidnapped in November in an effort to get ransom money.",
        "date": "01252017",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "New York prosecutor drops charges against Fiat heir Lapo Elkann "
    },
    {
        "content": "MILAN Trucks and tractor maker CNH Industrial   on Monday confirmed its full-year guidance after reporting a lower-than-expected third-quarter operating profit for its industrial activities but slightly higher margins.",
        "date": "10312016",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "CNH Industrial sticks to guidance after third-quarter profit miss "
    },
    {
        "content": "MILAN  Oct 31 Trucks and tractor maker CNH Industrial  on Monday confirmed its full-year guidance after reporting a lower-than-expected third-quarter operating profit for its industrial activities but slightly higher margins.",
        "date": "10312016",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "CNH Industrial sticks to guidance after Q3 profit miss "
    },
    {
        "content": "Oct 13 Deere & Co said its proposal to buy Precision Planting  an agricultural equipment and technology company  will increase consumer choice and directly benefit growers  in a response filed on Wednesday to the U.S. Department of Justice's lawsuit to block the acquisition.",
        "date": "10132016",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "Deere responds to U.S. Justice Dept move to block acquisition "
    },
    {
        "content": "* Does not see recent strong performance in agriculture machinery unit continuing in Q3 given scheduled shutdown",
        "date": "07262016",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "BRIEF-CNH Industrial sees farming machinery market flat next yr "
    },
    {
        "content": "MILAN Truck and tractor maker CNH Industrial  on Tuesday reported a better-than-expected 13 percent rise in second-quarter operating profit for its industrial activities  helped by improving profitability in its farming machinery unit.",
        "date": "07262016",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "CNH Industrial second-quarter results top expectations  shares rise "
    },
    {
        "content": "MILAN  July 26 Truck and tractor maker CNH Industrial on Tuesday reported a better-than-expected 13 percent rise in second-quarter operating profit for its industrial activities  helped by improving profitability in its farming machinery unit.",
        "date": "07262016",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "CNH Industrial Q2 results top expectations  shares rise "
    },
    {
        "content": "July 25 Italy's Agnelli family holding company Exor says:",
        "date": "07252016",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "BRIEF-Italy's Exor to fold into new Dutch holding company "
    },
    {
        "content": "* CNH Industrial has awarded a two year contract to Kuehne + Nagel for managing its agricultural and commercial vehicle spare parts supply chain requirements in Shanghai  China  Source text: http://bit.ly/1sBPFgG Further company coverage:    (Gdynia Newsroom)",
        "date": "05192016",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "BRIEF-Kuehne und Nagel to manage new Logistics Centre for CNH Industrial "
    },
    {
        "content": "April 15 CNH Industrial Chairman Sergio Marchionne tells shareholders:",
        "date": "04152016",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "BRIEF-CNH Industrial prepared to act to grow scale  portfolio - chairman "
    },
    {
        "content": "April 15 CNH Industrial Chairman Sergio Marchionne tells a shareholder meeting in Amsterdam:",
        "date": "04152016",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "BRIEF-CNH Industrial chairman says farming machinery sector remains challenging "
    },
    {
        "content": "MILAN  March 25 Truck and tractor maker CNH Industrial said it was booking a $500 million charge in relation to a European Commission cartel investigation that could lead to heavy fines for some of the world's biggest truckmakers.",
        "date": "03252016",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "CNH takes $500 mln charge over EU cartel probe "
    },
    {
        "content": "* Unit has priced $500 million in aggregate principal amount of 4.875% notes due 2021  issued at an issue price of 99.447%",
        "date": "03142016",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "BRIEF-CNH industrial NV's unit prices $500 mln aggregate principal amount of notes "
    },
    {
        "content": "March 14 CNH Industrial NV Chairman Sergio Marchionne says:",
        "date": "03142016",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "BRIEF-CNH Industrial bond issue seen at $500-750 mln - chairman "
    },
    {
        "content": "MILAN  Jan 29 Truck and tractor maker CNH Industrial reported a better-than-expected fourth-quarter profit and margins for its industrial activities despite a drop in sales  helped by better pricing and cost cuts.",
        "date": "01292016",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "CNH Industrial Q4 beats expectations on better pricing  cost cuts "
    },
    {
        "content": "MILAN  Oct 29 Truck and tractor maker CNH Industrial cut its full-year sales goal after reporting a larger-than-expected 53 percent drop in third-quarter profit for its industrial activities  hit by continued weak demand for farming machinery.",
        "date": "10292015",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "UPDATE 1-CNH Industrial cuts 2015 sales goal after drop in Q3 profit "
    },
    {
        "content": "MILAN  Oct 29 Truck and tractor maker CNH Industrial cut its full-year sales goal after reporting a higher-than-expected 53 percent drop in third-quarter profit for its industrial activities  hit by lower demand for farming machinery.",
        "date": "10292015",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "CNH Industrial cuts FY sales goal after 53 pct drop in Q3 profit "
    },
    {
        "content": "MILAN  July 29 Tractor and truck maker CNH Industrial has cut its full-year operating margin goal after reporting a 41 percent drop in second-quarter profit for its industrial activities  hit by lower demand for farming machinery.",
        "date": "07292015",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "CNH Industrial cuts 2015 operating profit guidance "
    },
    {
        "content": "MILAN  April 30 Tractor and truck maker CNH Industrial  is interested in acquisitions in the agricultural machinery sector as valuations of companies it could buy are becoming more reasonable  Chief Executive Richard Tobin said on Thursday.",
        "date": "04302015",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "CNH Industrial interested in acquisitions in farming sector -CEO "
    },
    {
        "content": "MILAN  April 30 Tractor and truck maker CNH Industrial  on Thursday reported a 46 percent drop in first-quarter operating profit for its industrial activities  hit by lower demand for agricultural machinery.",
        "date": "04302015",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "REFILE-CNH Industrial Q1 profit falls on lower farming sales "
    },
    {
        "content": "MILAN  Jan 29 Tractor and trucks maker CNH Industrial  will not consider any divestitures to strengthen its balance sheet  Chief Executive Richard Tobin said on Thursday.",
        "date": "01292015",
        "name": "CNH Industrial NV",
        "news_type": "topStory",
        "symbol": "CNHI",
        "title": "CNH Industrial will not seek divestments to boost balance sheet -CEO "
    },
    {
        "content": "* Shares down 1.9 pct vs 0.2 pct drop in Milan bourse   (Adds details  shares)",
        "date": "01292015",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "UPDATE 1-CNH Industrial earnings hit by weak farm equipment demand "
    },
    {
        "content": "MILAN  Jan 29 Tractor and trucks maker CNH Industrial  on Thursday reported a drop in fourth-quarter operating profit as improved results at its construction equipment unit were more than offset by weak demand for agricultural machinery.",
        "date": "01292015",
        "name": "CNH Industrial NV",
        "news_type": "normal",
        "symbol": "CNHI",
        "title": "CNH Industrial misses FY guidance after weak Q4 "
    }
]