[
    {
        "content": "WINNIPEG  Manitoba/MONTREAL  Nov 17 Canadian National Railway Co plans to extend a major hiring spree into next year as Canada's biggest freight railroad scrambles to handle surging shipments and fill vacancies  a company official said on Friday.",
        "date": "11172017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "UPDATE 2-Canada's CN Rail on hiring spree as shipments surge "
    },
    {
        "content": "WINNIPEG  Manitoba/MONTREAL  Nov 17 Canadian National Railway Co plans to extend its biggest hiring blitz in three years into 2018  as it scrambles to catch up with surging shipments and fill vacancies  a vice-president with Canada's biggest freight railroad said on Friday.",
        "date": "11172017",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "Canada's CN Rail hiring thousands as shipments surge "
    },
    {
        "content": "* Canadian National Railway  Norfolk Southern Corp announce a new joint interline service",
        "date": "10272017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "BRIEF-Canadian National Railway  Norfolk Southern say new joint interline service reducing transit times "
    },
    {
        "content": "TORONTO  Oct 25 Canada's main stock index was down shortly after the open as Canadian National Railway fell more than 2.5 percent  and Roots Corp opened 8 percent below its IPO price.",
        "date": "10252017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "CANADA STOCKS-TSX slides at open as CN Rail  Roots fall "
    },
    {
        "content": "Canadian National Railway Co   on Tuesday reported a quarterly profit that missed estimates  as the railroad operator incurred higher costs.",
        "date": "10242017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "CN Railway third-quarter profit misses on higher costs "
    },
    {
        "content": "TORONTO  Oct 22 A Canadian National Railway Co train derailed on Sunday afternoon in the western province of Alberta  spilling a small amount of crude and prompting the temporary evacuation of 46 homes as a precautionary measure  local authorities said.",
        "date": "10232017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "CN train derails in Alberta  releases small amount of crude "
    },
    {
        "content": "Oct 24 Canadian National Railway Co on Tuesday reported a quarterly profit that missed estimates  as the railroad operator incurred higher costs.",
        "date": "10242017",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "UPDATE 1-CN Railway 3rd-qtr profit misses on higher costs "
    },
    {
        "content": "* Canadian National Railway Co - ‍bid permits CN to purchase  for cancellation  up to 31 million common shares​",
        "date": "10242017",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "BRIEF-Canadian National Railway says ‍bid permits CN to purchase  for cancellation  up to 31 mln common shares​ "
    },
    {
        "content": "Oct 24 Canadian National Railway Co on Tuesday reported a 6.9 percent rise in quarterly revenue as the railroad operator moved higher volumes of metals and minerals.",
        "date": "10242017",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "CN Railway 3rd-qtr revenue rises nearly 7 pct "
    },
    {
        "content": "CONAKRY  Sept 19 Guinean bauxite miner CBG's operations were halted again on Tuesday by protests in the town of Kamsar having restarted a day earlier  a company official and a source at the state agency for mining infrastructure said.",
        "date": "09192017",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "Guinean bauxite miner CBG operations halted by protests "
    },
    {
        "content": "Sept 13 Canadian railroad operators remained hopeful that grain volumes for the rest of the year would not be impacted by dry  hot weather that affected wheat and canola crop production in the country's western farm belt.",
        "date": "09132017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "CP  CN Rail remain optimistic on grain volume despite dry weather "
    },
    {
        "content": "* Says ‍announced a public debt offering of C$500 million 3.6% notes due 2047​ Source text for Eikon: Further company coverage:",
        "date": "07272017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "BRIEF-Canadian National Railway Co announces C$500 mln debt offering "
    },
    {
        "content": "* CN reports Q2-2017 net income of C$1 031 million  or C$1.36 per diluted share",
        "date": "07252017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "BRIEF-CN reports Q2 earnings per share C$1.36 "
    },
    {
        "content": "(The following statement was released by the rating agency) PARIS  May 31 (Fitch) Fitch Ratings has affirmed Credit du Nord's (CN) Long-Term Issuer Default Rating (IDR) at 'A'  Short-Term IDR at 'F1'  Support Rating at '1' and Viability Rating (VR) at 'bbb+'. The Outlook on the Long-Term IDR is Stable. A full list of rating actions is at the end of this rating action commentary. KEY RATING DRIVERS IDRS  SUPPORT RATING AND SENIOR DEBT CN's IDRs and senior debt ratings are aligned with the parent ",
        "date": "05312017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "Fitch Affirms Credit du Nord at 'A'; Outlook Stable "
    },
    {
        "content": "* Teamsters canada -  tcrc withdrew strike notice after canadian national railway withdrew notice to unilaterally impose changes to collective agreement",
        "date": "05292017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "BRIEF-Teamsters  CN reach tentative agreement "
    },
    {
        "content": "MONTREAL/OTTAWA  May 29 Canadian National Railway Co on Monday said it had reached a tentative agreement with a union representing 3 000 conductors  ahead of a looming strike deadline at Canada's largest railroad.",
        "date": "05292017",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "UPDATE 4-Deal reached to avert strike at Canadian Rail "
    },
    {
        "content": "TORONTO  May 28 A union representing Canadian National Railway Co conductors said it plans to strike on Tuesday morning after the railroad announced new work rules in the midst of negotiations to replace a contract that expired last year.",
        "date": "05282017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "CN Rail union says plans strike for Tuesday as contract talks falter "
    },
    {
        "content": "* Cn and tcrc-cty reach tentative agreement on new labour contract for conductors in canada",
        "date": "05292017",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "BRIEF-CN and TCRC-CTY reach tentative agreement on new labour contract for conductors in Canada "
    },
    {
        "content": "OTTAWA  May 16 The Canadian government said on Tuesday it planned to maintain a revenue cap on western grain that Canadian National Railway Co and Canadian Pacific Railway Ltd haul for export  a move farmers praised.",
        "date": "05162017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "UPDATE 4-Canada to keep revenue cap on rail grain shipments  farmers glad "
    },
    {
        "content": "* Says to purchase its common shares under a specific share repurchase program",
        "date": "04262017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "BRIEF-CN to purchase its common shares under a specific shr repurchase program "
    },
    {
        "content": "MONTREAL Canadian National Railway Co  on Monday reported an 8 percent increase in quarterly revenue as the railroad moved record volumes  boosted by grain  frac sand and coal.",
        "date": "04242017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "CN Rail's revenue rises 8 pct on higher freight volumes "
    },
    {
        "content": "* Announces ratification of new 5-year collective labour agreement by international brotherhood of electrical workers system council 11",
        "date": "04262017",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "BRIEF-Canadian National-announces ratification of new 5-yr collective labour agreement by International Brotherhood of Electrical Workers system council 11 "
    },
    {
        "content": "MONTREAL April 24 Canadian National Railway Co on Monday reported an 8 percent increase in quarterly revenue as the railroad moved record volumes  boosted by grain  frac sand and coal.",
        "date": "04242017",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "UPDATE 2-CN Rail's revenue rises 8 pct on higher freight volumes "
    },
    {
        "content": "* CN reports Q1-2017 net income of C$884 million  or C$1.16 per diluted share",
        "date": "04242017",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "BRIEF-CN reports Q1 earnings per share of C$1.16 "
    },
    {
        "content": "* CN  Duluth Cargo Connect to establish first intermodal container terminal in twin ports",
        "date": "03272017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "BRIEF-CN  Duluth Cargo Connect to establish first intermodal container terminal in twin ports "
    },
    {
        "content": "* Broken wheel led to Jan 2016 derailment of Canadian National Railway Company freight train near Webster  Ontario",
        "date": "03292017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "BRIEF-Transportation Safety Board Of Canada says broken wheel led to Jan 2016 derailment of Canadian National Railway freight train "
    },
    {
        "content": "* TFI International - co  Canadian National Railway announced a renewed collaboration to grow domestic intermodal business in markets across Canada  Source text for Eikon:  Further company coverage:",
        "date": "03232017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "BRIEF-TFI International and Canadian National Railway report renewed collaboration "
    },
    {
        "content": "* CN reaches tentative labour agreement with IBEW union representing signals and communications employees in Canada",
        "date": "03202017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "BRIEF-CN reaches tentative labour agreement with IBEW union "
    },
    {
        "content": "* CN to purchase its common shares under a specific share repurchase program",
        "date": "03222017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "BRIEF-Canadian National Railway to purchase its common shares under specific share repurchase program "
    },
    {
        "content": "* Canadian National Railway - will repurchase common shares under a specific share repurchase program",
        "date": "03102017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "BRIEF-Canadian National Railway will repurchase common shares "
    },
    {
        "content": "* Cn to purchase its common shares under a specific share repurchase program",
        "date": "03032017",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "BRIEF-CN announces share repurchase program "
    },
    {
        "content": "* On july 28  co  canadian national railway co agreed to settle a lawsuit commenced by canadian national railway against co",
        "date": "08032016",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "BRIEF-Canadian Pacific says co  Canadian National Railway agree to settle a lawsuit "
    },
    {
        "content": "* Canadian National Railway Co says purchases will form part of normal course issuer bid for up to 33 million shares  announced on Oct. 27  2015",
        "date": "07292016",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "BRIEF-CN to purchase its common shares under specific share repurchase programs "
    },
    {
        "content": "TORONTO Canadian National Railway Co  reported better-than-expected second-quarter earnings on Monday even as a decline in shipments cut into revenue  but said it expects volumes to improve in the months ahead.",
        "date": "07252016",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "CN Rail earnings dip but top expectations as shipments fall "
    },
    {
        "content": "TORONTO  July 25 Canadian National Railway Co  reported better-than-expected second-quarter earnings on Monday even as a decline in shipments cut into revenue  but said it expects volumes to improve in the months ahead.",
        "date": "07252016",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "UPDATE 2-CN Rail earnings dip but top expectations as shipments fall "
    },
    {
        "content": "* Qtrly carloadings declined 12 per cent and revenue ton-miles declined 11 per cent",
        "date": "07252016",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "BRIEF-Canadian National posts Q2 earnings C$1.10/shr "
    },
    {
        "content": "* Declares third-quarter 2016 dividend; quarterly dividend of thirty-seven-and-one-half cents per common share will be paid  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "07252016",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "BRIEF-Canadian National Railway declares Q3 2016 dividend of C$0.375 "
    },
    {
        "content": "MONTREAL  June 27 Canadian National Railway Co  said on Monday its incoming chief executive  Luc Jobin  would take the helm of the country's largest railroad on July 1 as part of a management shuffle.",
        "date": "06272016",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "CN Rail announces July 1 executive shuffle "
    },
    {
        "content": "* CN appoints Mike Cory as chief operating officer and Ghislain Houle as chief financial officer",
        "date": "06272016",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "BRIEF-Canadian National Railway appoints Ghislain Houle as CFO "
    },
    {
        "content": "Canadian National Railway Co Chief Executive Claude Mongeau  who returned to work in January after a six-month sick leave  will step down at the end of this month due to the effects of his disease.",
        "date": "06072016",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "CN Rail chief executive Claude Mongeau resigns "
    },
    {
        "content": "(The following statement was released by the rating agency) PARIS  June 07 (Fitch) Fitch Ratings has affirmed Credit du Nord's (CN)  Long-Term Issuer Default Rating (IDR) at 'A'  Short-Term IDR at 'F1'  Support  Rating at '1' and Viability Rating (VR) at 'bbb+'. The Outlook on the Long-Term  IDR is Stable. A full list of rating actions is available at the end of this  rating actions commentary. KEY RATING DRIVERS  IDRS  SUPPORT RATING AND SENIOR DEBT CN's IDRs and senior debt ratings are aligned",
        "date": "06072016",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "Fitch Affirms Credit du Nord at 'A'; Outlook Stable "
    },
    {
        "content": "June 7 Canadian National Railway Co   Chief Executive Claude Mongeau  who returned to work in January after a six-month sick leave  will step down at the end of this month due to the effects of his disease.",
        "date": "06072016",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "UPDATE 2-CN Rail chief executive Claude Mongeau resigns "
    },
    {
        "content": "June 7 Canadian National Railway Co   said Chief Executive Claude Mongeau  who returned to work in January after a six-month sick leave  will step down at the end of this month.",
        "date": "06072016",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "CN Railway CEO Claude Mongeau to step down "
    },
    {
        "content": "Canadian National Railway Co  lowered its full-year earnings forecast  citing weaker-than-expected freight demand in some markets and a strengthening Canadian dollar.",
        "date": "04252016",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "CN Rail lowers profit forecast as weak freight volumes weigh "
    },
    {
        "content": "April 25 Canadian National Railway Co  lowered its full-year earnings forecast  citing weaker-than-expected freight demand in some markets and a strengthening Canadian dollar.",
        "date": "04252016",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "UPDATE 2-CN Rail lowers profit forecast as weak freight volumes weigh "
    },
    {
        "content": "April 25 Canadian National Railway Co  reported a 12.5 percent rise in quarterly profit  helped by lower costs.",
        "date": "04252016",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "Canadian National Railway's quarterly profit rises 12.5 pct "
    },
    {
        "content": "* 2016 portion will involve spending C$28 million on a series of initiatives  Source text for Eikon:  Further company coverage:",
        "date": "03222016",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "BRIEF-Canadian National Railway launch of third year of Safety Innovation Program "
    },
    {
        "content": "* To will enter into agreement with third party to repurchase shares subject to a maximum of 11.2 million common shares",
        "date": "03162016",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "BRIEF-CN to purchase common shares under a specific share repurchase program "
    },
    {
        "content": "Jan 26 Canadian National Railway Co's  quarterly profit rose 11.5 percent  helped by lower costs.",
        "date": "01262016",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "Canadian National Railway's quarterly profit rises 11.5 pct "
    },
    {
        "content": "Jan 26 Canadian National Railway Co  reported a better-than-expected fourth quarter profit and raised its 2016 quarterly dividend by 20 percent as costs fell on lower fuel expenses.",
        "date": "01272016",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "CORRECTED-UPDATE 2-Canadian National Railway profit beats Street view as costs fall "
    },
    {
        "content": "MONTREAL  Dec 3 Canadian National Railway Co's  volumes slowed \"meaningfully\" during November amid weaker demand for metals  coal and grain  a company vice president said on Thursday.",
        "date": "12032015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "CORRECTED-Canadian National carloads decline in November "
    },
    {
        "content": "Nov 17 Canadian National Railway Co  said on Tuesday that President and Chief Executive Claude Mongeau  who has been off the job since August after the discovery of a rare type of tumor  is expected to return to work in the new year.",
        "date": "11172015",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "CN Rail CEO expected to return to work in new year "
    },
    {
        "content": "Oct 27 Canadian National Railway Co on Tuesday reported an 18 percent rise in quarterly profit  as higher freight rates helped lift revenue despite lower volumes.",
        "date": "10272015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "UPDATE 2-CN Railway profit up 18 pct as high rates offset weaker volume "
    },
    {
        "content": "TORONTO  Aug 12 Canadian National Railway Co  said on Wednesday that its President and Chief Executive Claude Mongeau will be taking some time away from work to treat a rare type of tumor.",
        "date": "08122015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "UPDATE 1-CN Rail CEO to take time away from company to treat throat tumor "
    },
    {
        "content": "TORONTO  July 20 Canadian National Railway Co  reported stronger than expected second-quarter earnings and said it continues to expect double-digit growth in earnings per share for the full year on Monday  even as shipment volume slipped.",
        "date": "07202015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "UPDATE 2-CN Rail sticks with earnings forecast  despite tough market "
    },
    {
        "content": "TORONTO  July 18 A Canadian National Railway Co  train derailed on Saturday  halting passenger rail service on major routes between Toronto and Ottawa  as well as Toronto and Montreal  Via Rail said.",
        "date": "07182015",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "Canadian National derailment halts rail service on major route "
    },
    {
        "content": "(The following statement was released by the rating agency) PARIS/LONDON  June 23 (Fitch) Fitch Ratings has affirmed Credit du Nord's (CN)  Long-term Issuer Default Rating (IDR) at 'A'  Short-term IDR at 'F1'  Support  Rating at '1' and Viability Rating (VR) at 'bbb+'. The Outlook on the Long-term  IDR is Stable. A full list of rating actions is available at the end of this  rating actions commentary. KEY RATING DRIVERS  IDRS  SUPPORT RATING AND SENIOR DEBT CN's IDRs and senior debt ratings are ",
        "date": "06232015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "Fitch Credit du Nord at 'A'; Outlook Stable "
    },
    {
        "content": "TORONTO  April 20 Canadian National Railway Co  posted higher first-quarter earnings on Monday  topping analysts' expectations  and said it would boost capital spending to improve safety as volume rises.",
        "date": "04202015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "UPDATE 2-CN Rail 1st-qtr profit rises  to boost capital spending "
    },
    {
        "content": "A slew of Dow 30 companies report results in the week: Chemicals conglomerate DuPont  industrial conglomerate United Technologies Corp  property and casualty insurer Travelers Companies Inc and wireless carrier Verizon Communications Inc on Tuesday; McDonald's Corp  AT&T Inc  Boeing Co and Coca-Cola Co on Wednesday; and diversified manufacturer 3M Co  Procter & Gamble and Microsoft Corp on Thursday. While DuPont is expected to report lower first-quarter results  Travelers Companies Inc's first-q",
        "date": "04172015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "UPDATE 1-What to Watch in the Week Ahead and on Monday  April 20 "
    },
    {
        "content": "TORONTO  April 16 Canadian National Railway Co   hit by a recent string of derailments  will spend C$500 million ($412 million) to upgrade its feeder network in Western Canada to improve safety and boost capacity  the railway said on Thursday.",
        "date": "04162015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "UPDATE 2-CN Rail  beset by derailments  to upgrade Western Canada network "
    },
    {
        "content": "TORONTO  April 16 Canadian National Railway Co   which has seen a string of derailments recently  will spend C$500 million to upgrade its feeder network in Western Canada to improve safety  the railway said on Thursday.",
        "date": "04162015",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "CORRECTED-UPDATE 1-CN Rail  beset by derailments  to upgrade western Canada network "
    },
    {
        "content": "TORONTO  March 25 Regulator Transport Canada has issued a notice to Canadian National Railway Co  requesting a plan to ensure safety along the Ruel subdivision  where three trains derailed in fewer than 30 days in February and March  the railway said on Wednesday.",
        "date": "03252015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "Canadian regulator seeks CN Rail safety plan after derailments "
    },
    {
        "content": "TORONTO Canadian National Railway's safety record deteriorated sharply in 2014  reversing years of improvements  as accidents in Canada blamed on poor track conditions hit their highest level in more than five years  a Reuters analysis has found.",
        "date": "03232015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "Exclusive: CN Rail derailment numbers soared before recent crashes "
    },
    {
        "content": "TORONTO  March 7 A Canadian National Railway Co  train carrying crude oil derailed near the northern Ontario community of Gogama  with multiple cars on fire and some leaking oil into a waterway  the company said on Saturday.",
        "date": "03072015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "UPDATE 4-Canadian Nat'l crude train derails in Ontario  on fire  leaking "
    },
    {
        "content": "March 12 Thirteen cars on a Canadian National Railway Co train went off the tracks in rural Manitoba on Wednesday night and spilled some petroleum product on the ground in the company's third derailment in a week.",
        "date": "03122015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "UPDATE 2-CN Rail says some oil product spills in Manitoba derailment "
    },
    {
        "content": "March 12 Canadian National Railway Co  said Thursday 13 train cars carrying refinery cracking stock derailed Wednesday night in rural Manitoba  and one car spilled some \"product.\"",
        "date": "03122015",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "CN says some refinery product spilled in Manitoba train car derailment "
    },
    {
        "content": "TORONTO/GATINEAU  Quebec  Feb 23 Canada's biggest railway reached a last-minute tentative agreement with one of its unions on Monday  averting a lockout that threatened to delay imports from Asia and compound a U.S. West Coast port logjam.",
        "date": "02242015",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "REFILE-UPDATE 5-CN Rail reaches tentative deal with union  averting lockout "
    },
    {
        "content": "TORONTO  Feb 23 A looming lockout at Canada's biggest railway threatens to delay imports from Asia and may compound a U.S. West Coast port logjam unless last-ditch contract talks succeed on Monday.",
        "date": "02232015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "RPT-UPDATE 3-Canada retailers  ports fear impact as CN Rail lockout nears "
    },
    {
        "content": "TORONTO  Feb 21 Canadian National Railway Co  on Saturday again urged Unifor  the union representing 4 800 of its mechanical  clerical and intermodal staff  to agree to binding arbitration and renewed its threat to lock out those workers on Monday.",
        "date": "02212015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "UPDATE 1-CN Railway urges union to agree to arbitration as lockout looms "
    },
    {
        "content": "TORONTO  Feb 20 Canadian National Railway Co  said on Friday that barring a settlement by this weekend with Unifor  a union that represents 4 800 of its mechanical  clerical and intermodal staff  it plans to begin to lock out employees on Monday.",
        "date": "02202015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "UPDATE 1-CN Rail threatens to lock out union in bid to force deal "
    },
    {
        "content": "TORONTO  Feb 23 Canadian National Railway Co  and the union representing 4 800 of its mechanical  clerical and trucking staff will resume contract talks on Monday  just hours before a deadline set by Canada's No. 1 railway to lock out the workers.",
        "date": "02232015",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "CN Railway  union resume contract talks as lockout deadline nears "
    },
    {
        "content": "TORONTO  Feb 20 Canadian National Railway Co  said on Friday that barring a settlement by this weekend with Unifor  a union that represents 4 800 of its mechanical  clerical and intermodal staff  it plans to begin to lock out employees on Monday.",
        "date": "02212015",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "UPDATE 2-CN Rail threatens to lock out union in bid to force deal "
    },
    {
        "content": "CALGARY  Alberta  Feb 17 Canadian National Railway Co said on Tuesday it has nearly completed repairs on a stretch of its mainline track in northern Ontario after a crude train derailed on the weekend  spilling oil and causing several of the cars to burn.",
        "date": "02172015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "UPDATE 2-CN Rail northern Ontario derailment clean by late Tuesday "
    },
    {
        "content": "CALGARY  Alberta  Feb 17 Canadian National Railway Co is still cleaning up spilled oil and removing damaged rail cars after a weekend derailment on its line at a remote site about 80 kilometers (50 miles) south of Timmins  Ontario.",
        "date": "02172015",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "CN Rail says still cleaning up Northern Ontario derailment "
    },
    {
        "content": "TORONTO  Feb 18 Protracted contract talks between Canadian National Railway Co and the union that represents 4 800 of its mechanical  clerical and intermodal staff are at an impasse  and the union says it is considering a strike vote.",
        "date": "02182015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "UPDATE 1-CN Rail-Unifor contract talks at impasse  strike vote likely "
    },
    {
        "content": "TORONTO  Feb 18 Protracted contract talks between Canadian National Railway Co and the union that represents 4 800 of its mechanical  clerical and intermodal staff are at an impasse and the union says it is considering a strike vote.",
        "date": "02182015",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "Canadian rail contract talks at impasse  strike vote possible -union "
    },
    {
        "content": "CALGARY  Alberta  Feb 18 Canadian National Railway Co said on Wednesday its shipping customers should expect delays as traffic on its mainline returns to normal after a weekend derailment of a train carrying crude oil.",
        "date": "02182015",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "UPDATE 1-CN Rail warns shippers of delays as derailment cleared "
    },
    {
        "content": "CALGARY  Alberta  Feb 18 Canadian National Railway Co said on Wednesday its shipping customers should expect delays as traffic on its mainline returns to normal after a weekend derailment of a train carrying crude oil.",
        "date": "02182015",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "CN Rail says shippers should expect delays as derailment cleared "
    },
    {
        "content": "TORONTO  Jan 27 Canadian National Railway Co  reported better-than-expected fourth-quarter earnings on Tuesday and boosted its dividend  but lagged its main Canadian rival when it came to a key efficiency measure.",
        "date": "01282015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "UPDATE 2-CN Rail earnings beat  but lag CP on efficiency "
    },
    {
        "content": "TORONTO  Jan 27 Canadian National Railway Co  earnings rose in the fourth quarter  topping expectations on a boost from higher volumes and more efficient operations  the company said on Tuesday  and it boosted its dividend.",
        "date": "01272015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "UPDATE 1-Canadian National Railway earnings beat  raises dividend "
    },
    {
        "content": "TORONTO  Jan 27 Canadian National Railway Co  reported a rise in fourth-quarter earnings on Tuesday and boosted its quarterly dividend.",
        "date": "01272015",
        "name": "Canadian National Railway Company",
        "news_type": "normal",
        "symbol": "CNI",
        "title": "CN Rail earnings up  raises dividend "
    },
    {
        "content": "Jan 21 Nine cars on a westbound freight train went off the track in downtown Winnipeg  Manitoba  during rush hour on Wednesday  but there were no injuries and no leaks  a spokesman for Canadian National Railway Co said.",
        "date": "01222015",
        "name": "Canadian National Railway Company",
        "news_type": "topStory",
        "symbol": "CNI",
        "title": "UPDATE 1-Freight train derails in downtown Winnipeg  no injuries "
    }
]