[
    {
        "content": "* Q3 earnings per share view $0.39 -- Thomson Reuters I/B/E/S",
        "date": "10252017",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "BRIEF-CNO Financial Group reports Q3 earnings per share $0.59 "
    },
    {
        "content": "* CNO Financial Group amends and extends revolving credit facility",
        "date": "10162017",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "BRIEF-CNO Financial Group amends and extends revolving credit facility "
    },
    {
        "content": "* CNO Financial Group names Adam Auvil vice president of investor relations Source text for Eikon: Further company coverage:",
        "date": "09192017",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "BRIEF-CNO Financial Group names Adam Auvil vice president of investor relations "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 15 (Fitch) Fitch Ratings has affirmed the 'BBB-' Issuer Default Rating (IDR) and the Insurer Financial Strength (IFS) ratings for CNO's core insurance subsidiaries at 'BBB+'. The Rating Outlook is Stable. A full list of rating actions follows at the end of this release. KEY RATING DRIVERS The affirmation of CNO's ratings reflects the company's good operating performance and business profile  strong investment profile  st",
        "date": "08152017",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "Fitch Affirms CNO Financial's IFS Ratings at 'BBB+'; Outlook Stable "
    },
    {
        "content": "* CNO Financial Group Inc says board elected Gary Bhojwani as a director  effective immediately  increasing size of board to 10 members - SEC filing Source text: (http://bit.ly/2rq0yRR) Further company coverage:",
        "date": "05172017",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "BRIEF-CNO Financial Group elects Gary Bhojwani as a director - SEC filing "
    },
    {
        "content": "* Ed Bonach to retire as CEO of CNO Financial group; Gary Bhojwani named CEO successor and to CNO board of directors",
        "date": "05162017",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "BRIEF-CNO Financial Group appoints Gary Bhojwani as CEO "
    },
    {
        "content": "* Says board of directors has approved an additional $300 million to repurchase company's outstanding common stock Source text for Eikon: Further company coverage:",
        "date": "05102017",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "BRIEF-CNO Financial Group increases quarterly dividend by 13 pct "
    },
    {
        "content": "* Q1 earnings per share view $0.30  revenue view $1.01 billion -- Thomson Reuters I/B/E/S Source text for Eikon: Further company coverage:",
        "date": "04262017",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "BRIEF-CNO Financial Group Q1 operating earnings per share $0.34 "
    },
    {
        "content": "* CNO financial group reports fourth quarter and full year 2016 results",
        "date": "02072017",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "BRIEF-CNO Financial reports Q4 earnings per share $1.34 "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 12 (Fitch) Fitch Ratings has removed CNO Financial Group Inc.'s  ratings (CNO) from Rating Watch Negative  and affirmed the 'BBB-' Issuer Default  Rating (IDR) and the Insurer Financial Strength (IFS) ratings for CNO's core  insurance subsidiaries at 'BBB+'. The Rating Outlook is Stable. A full list of  rating actions follows at the end of this release. Today's rating actions follow the company's announcement that it ha",
        "date": "01122017",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "Fitch Removes CNO's Ratings From Rating Watch Negative; Affirms IDR at 'BBB-' "
    },
    {
        "content": "* Cno financial group provides update on closed block long-term care business",
        "date": "01122017",
        "name": "CNO Financial Group Inc",
        "news_type": "normal",
        "symbol": "CNO",
        "title": "BRIEF-CNO Financial Group provides update on closed block long-term care business "
    },
    {
        "content": "* CNO Financial Group Inc qtrly total revenue $1.01 billion versus $904.5 million",
        "date": "11012016",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "BRIEF-CNO Financial Group Q3 earnings per share $0.11 "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  September 30 (Fitch) Fitch Ratings is maintaining the ratings of CNO  Financial Group Inc. (CNO) on Rating Watch Negative  following the company's  announcement yesterday that it is recapturing its closed-block long-term care  business that was reinsured by Beechwood Re Ltd. (Beechwood) since late 2013   and taking an associated charge estimated to be $55 million. A summary of all  rating actions follows at the end of this rele",
        "date": "09302016",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "Fitch Maintains CNO Financial Group on Rating Watch Negative "
    },
    {
        "content": "NEW YORK  Sept 29 CNO Financial Group Inc  on Thursday said that two of its subsidiaries were terminating agreements with reinsurer Beechwood Re  after regulators in two states said that many assets managed by Beechwood were not compliant with insurance company guidelines because of exposure to troubled hedge fund manager Platinum Partners.",
        "date": "09302016",
        "name": "CNO Financial Group Inc",
        "news_type": "normal",
        "symbol": "CNO",
        "title": "CNO units cut agreements with Beechwood due to Platinum exposure "
    },
    {
        "content": "* CNO Financial Group announces termination of long-term care reinsurance agreements with Beechwood RE and recapture of assets  liabilities and policyholder administration",
        "date": "09292016",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "BRIEF-CNO financial says termination of long-term care reinsurance agreements with Beechwood RE "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 03 (Fitch) Fitch Ratings has placed the ratings of CNO Financial  Group Inc. (CNO) on Rating Watch Negative. The rating action follows recent  reports of links between Beechwood Re Ltd. (Beechwood)  a reinsurer of CNO  Financial Group  Inc.'s (CNO) closed block long-term care business  and Platinum  Partners  a hedge fund that is currently under investigation by federal  authorities and is reportedly in the process of li",
        "date": "08032016",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "Fitch Places CNO Financial Group on Rating Watch Negative "
    },
    {
        "content": "* Continue to expect medicare supplement benefit ratio to be in range of 70 percent to 73 percent during remainder of 2016",
        "date": "07262016",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "BRIEF-CNO Financial Group reports Q2 2016 results "
    },
    {
        "content": "* CNO Financial Group names Jeff Kircher vice president  corporate finance and treasurer  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07272016",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "BRIEF-CNO Financial names Jeff Kircher vice president  corporate finance and treasurer "
    },
    {
        "content": "* CNO Financial group announces increase to quarterly dividend and results of annual shareholders meeting",
        "date": "05042016",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "BRIEF-CNO Financial Group sets qtrly cash dividend of $0.08/share "
    },
    {
        "content": "* Maintaining 2016 share repurchase guidance range of $275-$375 million  Source text for Eikon: [(http://1.usa.gov/1SMFkXg )] Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04282016",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "BRIEF-CNO Financial Group sees 2016 EBIT guidance of $0-6 million "
    },
    {
        "content": "* Q1 earnings per share view $0.32 -- Thomson Reuters I/B/E/S",
        "date": "04272016",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "BRIEF-CNO Financial Group Q1 earnings per share $0.25 "
    },
    {
        "content": "* CNO Financial Group announces strategic investment in Tennenbaum Capital Partners",
        "date": "04182016",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "BRIEF-CNO Financial Group announces strategic investment in Tennenbaum Capital Partners "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 11 (Fitch) Fitch Ratings has assigned a 'BB+(EXP)' rating to CNO  Financial Group Inc.'s (CNO) planned issuance of new senior unsecured notes.  At  the same time  Fitch has upgraded the Insurer Financial Strength (IFS) ratings  for CNO's core insurance subsidiaries to 'BBB+' from 'BBB'. The Rating Outlook  is Positive for all ratings. A full list of rating actions follows at the end of  this release.  KEY RATING DRIVERS The",
        "date": "05112015",
        "name": "CNO Financial Group Inc",
        "news_type": "topStory",
        "symbol": "CNO",
        "title": "Fitch Expects to Rate CNO Financial's Sr Debt 'BB+'; Upgrades IFS Rtgs to BBB+; Outlook Positive "
    }
]