[
    {
        "content": "Nov 7 Canadian Natural Resources Ltd on Tuesday forecast a 17 percent rise in 2018 production  although it lowered its capital budget for the year.",
        "date": "11072017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "UPDATE 1-Canadian Natural sees 17 pct rise in 2018 production "
    },
    {
        "content": "* ‍In 2018  targets overall production between 1 090 000 and 1 170 000 boe/d​",
        "date": "11072017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural Resources targets overall production between 1.09 mln and 1.17 mln boe/d ‍in 2018​ "
    },
    {
        "content": "* Says Horizon oil sands project will return to full volumes by mid-December following turnaround",
        "date": "11022017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural's Horizon project back to full capacity mid-Dec "
    },
    {
        "content": "Nov 7 Canadian Natural Resources Ltd on Tuesday forecast a 17 percent rise in 2018 production  although it lowered its capital budget for the year.",
        "date": "11072017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Canadian Natural Resources sees 17 pct rise in 2018 production "
    },
    {
        "content": "Canadian Natural Resources Ltd  on Thursday reported a third-quarter profit  rebounding from a year-ago loss  helped by higher production and average realized prices for crude oil and natural gas liquids (NGL).",
        "date": "11022017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Canadian Natural Resources posts profit on higher production  prices "
    },
    {
        "content": "Nov 2 Canadian Natural Resources Ltd on Thursday reported a third-quarter profit  rebounding from a year-ago loss  helped by higher production and average realized prices for crude oil and natural gas liquids (NGL).",
        "date": "11022017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "UPDATE 1-Canadian Natural Resources posts profit on higher production  prices "
    },
    {
        "content": "* Canadian natural resources limited announces 2017 third quarter results",
        "date": "11022017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural Resources Qtrly FFO per share $1.37 "
    },
    {
        "content": "Nov 2 Canadian Natural Resources Ltd  Canada's largest independent petroleum producer  on Thursday reported a third-quarter profit  helped by higher production and average realized prices.",
        "date": "11022017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Canadian Natural Resources posts quarterly profit "
    },
    {
        "content": "CALGARY  Alberta Canadian synthetic crude prices strengthened on Monday  the first day of the monthly trade cycle  on market talk that a turnaround at Canadian Natural Resources Ltd's  Horizon project may go on for longer than expected.",
        "date": "10022017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "Synthetic climbs on concerns about reduced supply "
    },
    {
        "content": "CALGARY  Alberta  Oct 3 Canadian Natural Resources Ltd will know in the next couple of weeks whether there will be any changes to the original 45 days of planned maintenance at its Horizon oil sands project  a spokeswoman said on Tuesday.",
        "date": "10032017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "UPDATE 1-Canadian Natural assessing duration of oil sands turnaround "
    },
    {
        "content": "CALGARY  Alberta  Oct 3 Canadian Natural Resources Ltd will know in the next couple of weeks whether there will be any changes to the original 45 days of planned maintenance at its Horizon oil sands project  a spokeswoman said on Tuesday.",
        "date": "10032017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Canadian Natural assessing duration of ongoing oil sands turnaround "
    },
    {
        "content": "TORONTO/CALGARY Canadian Natural Resources Ltd  is in advanced talks to buy Cenovus Energy Inc's  heavy oil project in Pelican Lake in northeastern Alberta  for about C$1 billion ($807 million)  according to a source familiar with the situation.",
        "date": "09022017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "Canadian Natural in advanced talks for Cenovus Pelican Lake asset: source "
    },
    {
        "content": "Canadian Natural Resources Ltd  said on Tuesday it has agreed to buy Cenovus Energy Inc's  Pelican Lake heavy oil operations in Alberta for C$975 million ($787 million)  the company's second acquisition this year.",
        "date": "09052017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "Canadian Natural buys Cenovus Pelican Lake assets for C$975 million "
    },
    {
        "content": "Sept 5 Canadian Natural Resources Ltd said on Tuesday it has agreed to buy Cenovus Energy Inc's Pelican Lake heavy oil operations in Alberta for C$975 million ($787 million)  the company's second acquisition this year.",
        "date": "09052017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "UPDATE 2-Canadian Natural buys Cenovus Pelican Lake assets for C$975 million "
    },
    {
        "content": "Sept 1 Canadian Natural Resources Ltd is nearing a deal to buy Cenovus Energy Inc's heavy oil project in Pelican Lake  Alberta  for about C$1 billion ($807 million)  Bloomberg reported on Friday.",
        "date": "09012017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "Canadian Natural nears deal for Cenovus's Pelican Lake asset -Bloomberg "
    },
    {
        "content": "TORONTO  Sept 5 Canada's main stock index lost ground on Tuesday in a broad retreat led by financial stocks as bond yields fell  while gold miners gained and energy stocks perked up with a surge in oil prices and news of a deal in Alberta's oil patch.",
        "date": "09052017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "CANADA STOCKS-TSX falls as financials lead retreat "
    },
    {
        "content": "* Canadian Natural Resources - ‍entered agreement to acquire assets in Greater Pelican Lake region and other miscellaneous assets in Northern Alberta​",
        "date": "09052017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural Resources announces Pelican Lake and other asset acquisition "
    },
    {
        "content": "TORONTO/CALGARY  Aug 4 Cenovus Energy Inc has received separate bids from Canadian Natural Resources Ltd  ARC Financial Corp and  others for a heavy oil project in Pelican Lake  Alberta  according to people familiar with the matter who told Reuters the project was valued at as much as C$1 billion ($796 million).",
        "date": "08042017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Canadian Natural among bidders for Cenovus' Pelican Lake: sources "
    },
    {
        "content": "CALGARY  Alberta  Aug 3 Canadian Natural Resources Ltd posted a higher quarterly profit that topped estimates on Thursday  and cut 2017 capital expenditure by about C$180 million after deferring spending at one of its major oil sands projects.",
        "date": "08032017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "UPDATE 2-Canadian Natural Resources profit tops estimates; cuts capex "
    },
    {
        "content": "* Says 2018 capital spending expected to be between C$4.3 billion and C$4.7 billion",
        "date": "08032017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural expects 2018 capital budget to be C$4.3 bln-C$4.7 bln "
    },
    {
        "content": "TORONTO  Aug 3 Canada's main stock index ticked higher early on Thursday  helped by gains in its heavyweight energy sector led by Canadian Natural Resources Ltd after it reported better-than-expected quarterly profit and plans to cut capital spending.",
        "date": "08032017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "CANADA STOCKS-TSX ticks higher  Canadian Natural jumps "
    },
    {
        "content": "* Canadian Natural Resources limited announces 2017 second quarter results",
        "date": "08032017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural Resources reports Q2 eanings per share of $0.93‍​ "
    },
    {
        "content": "Aug 3 Canadian Natural Resources Ltd reported a quarterly profit on Thursday compared with a year-ago loss  as the oil and natural gas producer benefited from higher oil prices and production rise.",
        "date": "08032017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Canadian Natural Resources posts Q2 profit from year-ago loss "
    },
    {
        "content": "* Canadian natural resources limited announces filing of preliminary medium term notes shelf prospectus",
        "date": "07212017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural Resources announces filing of preliminary medium term notes shelf prospectus "
    },
    {
        "content": "* Canadian Natural Resources Ltd files for offering of up to 97.56 million shares of co's common stock - sec filing",
        "date": "07202017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural Resources files for secondary offering of up to 97.56 mln common shares "
    },
    {
        "content": "* Canadian Natural Resources Ltd files for debt shelf of up to $3.0 billion - sec filing Source text : http://bit.ly/2tumr8e Further company coverage:",
        "date": "07202017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural Resources files for debt shelf of up to $3 bln "
    },
    {
        "content": "CALGARY  Alberta  June 21 Cenovus Energy Inc's efforts to sell C$5 billion ($3.8 billion) of energy assets  already facing a rocky road because weak oil prices are depressing the appetite for deals  has become complicated by the surprise departure of its chief executive officer  fund managers said.",
        "date": "06222017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "CORRECTED-Canada's Cenovus facing tough market for critical asset sales "
    },
    {
        "content": "* Royal Dutch Shell Plc reports 8 pct stake in Canadian Natural Resources Ltd as of May 31  2017 - SEC filing Source text: (http://bit.ly/2r9C0fy) Further company coverage:",
        "date": "06082017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "BRIEF-Royal Dutch Shell reports 8 pct stake in Canadian Natural Resources as of May 31 "
    },
    {
        "content": "* Canadian Natural Resources Limited prices C$1.8 billion in 3  9.5 and 30 year medium-term notes",
        "date": "05242017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural Resources prices C$1.8 bln in 3  9.5 and 30 year medium-term notes "
    },
    {
        "content": "    May 24 Britain's FTSE 100 index is seen opening up 6 points at 7 491 on Wednesday  according to financial bookmakers.     * Soldiers will be deployed to key sites in Britain to boost security as the country raised its terror threat to the highest level of \"critical\" following a suicide attack in Manchester that killed 22 people  including children.      * GLENCORE: U.S. grains trader Bunge Ltd said on Tuesday it was not in talks with Swiss mining and commodities group Glencore Pl",
        "date": "05242017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "UK Stocks-Factors to watch on May 24 "
    },
    {
        "content": "CALGARY  Alberta Canadian Natural Resources Ltd   the country's largest independent petroleum producer  said on Thursday it continues to evaluate any assets for sale within its core areas of operation in western Canada.",
        "date": "05042017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "Canadian Natural posts first-quarter profit  evaluating acquisitions "
    },
    {
        "content": "CALGARY  Alberta  May 4 Canadian Natural Resources Ltd  the country's largest independent petroleum producer  said on Thursday it continues to evaluate any assets for sale within its core areas of operation in western Canada.",
        "date": "05042017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "UPDATE 2-Canadian Natural posts Q1 profit  evaluating acquisitions "
    },
    {
        "content": "* Says will evaluate all assets for sale within its core area Source text for Eikon: Further company coverage: (Reporting By Nia Williams)",
        "date": "05042017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural still eyeing any assets for sale in core area "
    },
    {
        "content": "* Canadian Natural Resources Limited announces 2017 first quarter results Source text for Eikon: Further company coverage:",
        "date": "05042017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural Resources announces Q1 results "
    },
    {
        "content": "* Canadian Natural Resources Limited announces 2017 first quarter results",
        "date": "05042017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural Resources Qtrly earnings per share $0.22 "
    },
    {
        "content": "May 4 Canadian Natural Resources Ltd  Canada's largest independent petroleum producer  reported a quarterly profit compared with a year-ago loss  helped by an uptick in crude prices.",
        "date": "05042017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "CORRECTED-Canadian Natural Resources reports profit vs year-ago loss "
    },
    {
        "content": "TORONTO/NEW YORK  April 13 Chevron Corp  the second-largest U.S.-based oil producer  is exploring the sale of its 20 percent stake in Canada's Athabasca Oil Sands project  which could fetch about $2.5 billion  according to people familiar with the situation.",
        "date": "04132017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "UPDATE 2-Chevron exploring sale of Canada oil sands stake worth about $2.5 bln -sources "
    },
    {
        "content": "TORONTO  April 6 Canadian mergers and acquisitions got off to their strongest start in 17 years in 2017 as cross-border deal activity picked up pace  with JPMorgan   Goldman Sachs and RBC taking the top three spots in the advisory rankings.",
        "date": "04062017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "JPMorgan  Goldman Sachs top Canadian M&A rankings as activity rises "
    },
    {
        "content": "TORONTO  March 9 Canada's main stock index edged higher on Thursday as Canadian Natural Resources led a rebound in energy shares after sharp losses the day before  and the materials group gained ground.",
        "date": "03092017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "CANADA STOCKS-TSX rises as Canadian Natural Resources leads energy bounce "
    },
    {
        "content": "* Royal dutch shell: divests oil sands for net consideration of $7.25 billion",
        "date": "03092017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "BRIEF-Shell divests oil sands for net consideration of $7.25 bln "
    },
    {
        "content": "CALGARY  Alberta Canadian Natural Resources Ltd is likely interested in shipping natural gas under TransCanada's new flat toll for its Mainline system  but it has not made a firm decision  Canadian Natural's chief executive officer said.",
        "date": "03022017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "Canadian Natural says it is likely open to TransCanada natgas shipping "
    },
    {
        "content": "March 2 Canadian Natural Resources Ltd   Canada's largest independent petroleum producer  on Thursday reported a quarterly profit that blew past analysts' expectations  driven by higher realized prices from North America and low costs.",
        "date": "03022017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "UPDATE 2-Canadian Natural Resources' profit beats estimates "
    },
    {
        "content": "CALGARY  Alberta  March 2 Canadian Natural Resources Ltd is likely interested in shipping natural gas under TransCanada's new flat toll for its Mainline system  but the producer has not yet made a firm decision  Canadian Natural's chief executive said in an interview with Reuters on Thursday.",
        "date": "03022017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Canadian Natural likely interested in shipping natgas with TransCanada "
    },
    {
        "content": "March 2  Canadian Natural Resources Ltd   Canada's largest independent petroleum producer  said on Thursday its fourth-quarter profit rose more than fourfold  helped higher sales volumes and realized prices from North America.",
        "date": "03022017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Canadian Natural Resources' profit jumps on higher sales volume  prices "
    },
    {
        "content": "* Canadian natural resources limited announces 2016 fourth quarter and year end results",
        "date": "03022017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural Resources qtrly FFO per share $1.50 "
    },
    {
        "content": "* Canadian Natural Resources Limited announces 2016 year end reserves",
        "date": "02142017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural Resources announces 2016 year end reserves "
    },
    {
        "content": "ABIDJAN  Feb 15 Workers at Canadian Natural Resources' (CNR) Baobab and Espoir oil and gas fields in Ivory Coast on Wednesday ended a strike over employment conditions launched last week  the head of their union said.",
        "date": "02152017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "UPDATE 1-Workers end strike at CNR's Ivory Coast operations "
    },
    {
        "content": "ABIDJAN  Feb 15 Workers at Canadian Natural Resources' (CNR) Baobab and Espoir oil and gas fields in Ivory Coast on Wednesday ended a strike over employment conditions launched last week  the head of their union said.",
        "date": "02152017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Workers end strike at CNR's Ivory Coast oil and gas fields -union "
    },
    {
        "content": "ABIDJAN  Feb 11 Workers have extended a strike indefinitely at Canadian Natural Resources' (CNR)  Baobab and Espoir oil and gas fields in Ivory Coast  the SISPOO oil workers union said on Saturday.",
        "date": "02112017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "Workers extend strike at CNR's Ivory Coast oil and gas fields "
    },
    {
        "content": "ABIDJAN  Feb 8 Workers at Canadian Natural Resources' (CNR) Baobab and Espoir oil and gas fields in Ivory Coast launched a 72-hour strike early on Wednesday over employment conditions  the head of their union said.",
        "date": "02082017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "UPDATE 2-Workers launch strike at CNR's Ivory Coast fields "
    },
    {
        "content": "ABIDJAN  Feb 8 Workers at Canadian Natural Resources' (CNR) Baobab and Espoir oil and gas fields in Ivory Coast launched a 72-hour strike early on Wednesday over employment conditions  the head of their union said.",
        "date": "02082017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Workers launch 72-hour strike at CNR's Ivory Coast operations - union "
    },
    {
        "content": "* December 2016 production averaging approximately 184 000 bbl/d of synthetic crude oil for horizon oil sands",
        "date": "02022017",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural Resources Q4 avg production of about 178 000 bbl/d "
    },
    {
        "content": "CALGARY  Alberta  Nov 3 Pipeline company TransCanada Corp and shippers on the Canadian gas mainline system are closer to reaching an agreement on a new toll structure  the chief executives of Canada's two biggest natural gas producers said on Thursday.",
        "date": "11032016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "TransCanada gas toll talks making progress -CNRL  Encana "
    },
    {
        "content": "CALGARY  Alberta Canadian Natural Resources Ltd  is reinitiating its Kirby North thermal project  the company said on Thursday  becoming the first oil sands producer to re-sanction a deferred major project since the global oil price slump began in 2014.",
        "date": "11032016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Canadian Natural restarts deferred oil sands project "
    },
    {
        "content": "CALGARY  Alberta  Nov 3 Canadian Natural Resources Ltd is reinitiating its Kirby North thermal project  the company said on Thursday  becoming the first oil sands producer to re-sanction a deferred major project since the global oil price slump began in 2014.",
        "date": "11032016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "UPDATE 3-Canadian Natural restarts deferred oil sands project "
    },
    {
        "content": "* Says will start drilling in the North Sea again in 2017 as tax structure has changed",
        "date": "11032016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "BRIEF-CNRL says Kirby North project will cost C$100 mln less than first expected "
    },
    {
        "content": "* Forecasts annual 2016 production levels to average between 514 000 and 563 000 bbl/d of crude oil and NGLS",
        "date": "11032016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural Resources Q3 loss per share $0.29 "
    },
    {
        "content": "Nov 3 Canadian Natural Resources Ltd  Canada's largest independent petroleum producer  reported a bigger quarterly loss due to lower prices.",
        "date": "11032016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Canadian Natural Resources posts bigger Q3 loss "
    },
    {
        "content": "* Canadian natural resources limited prices C$1.0 billion in 5.5 year notes",
        "date": "08092016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural Resources prices C$1 bln in 5.5 year notes "
    },
    {
        "content": "Oil and natural gas producer Canadian Natural Resources Ltd   reported a smaller quarterly loss on Thursday as lower expenses helped offset a slump in crude prices.",
        "date": "08042016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "Canadian Natural posts smaller loss  says Horizon plan on track "
    },
    {
        "content": "Aug 4 Oil and natural gas producer Canadian Natural Resources Ltd  reported a smaller quarterly loss on Thursday as lower expenses helped offset a slump in crude prices.",
        "date": "08042016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "UPDATE 3-Canadian Natural posts smaller loss  says Horizon plan on track "
    },
    {
        "content": "* Canadian natural resources limited announces 2016 second quarter results",
        "date": "08042016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural Resources Q2 loss per share $0.31 "
    },
    {
        "content": "Aug 4 Oil and natural gas producer Canadian Natural Resources Ltd  reported a smaller quarterly loss on Thursday  as lower expenses helped offset a slump in crude prices.",
        "date": "08042016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Canadian Natural Resources reports smaller quarterly loss "
    },
    {
        "content": "Canadian Natural Resources Ltd has quietly bought up about 12 000 natural gas wells across Alberta over the last two years  a Reuters analysis of regulatory data shows  becoming the country's largest natural gas producer as rivals sold assets or held steady in a tough market.",
        "date": "07182016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "Exclusive: CNRL sneaks up to top Canadian natgas spot with shopping spree "
    },
    {
        "content": "June 15 Oil producer Canadian Natural Resources Ltd sharply raised its cash-flow forecast for the year as it gains from a rally in crude oil prices.",
        "date": "06152016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "Canadian Natural sharply raises cash flow forecast for 2016 "
    },
    {
        "content": "Canadian Natural Resources Ltd   said its oil sands operations were stable after some outages due to the massive wildfire raging in the country's energy heartland.",
        "date": "05052016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "Canadian Natural says it has seen some outages as wildfire rages "
    },
    {
        "content": "* Canadian Natural Resources Limited announces 2016 first quarter results",
        "date": "05052016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "BRIEF-Canadian Natural Resources Q1 loss per share C$0.10 "
    },
    {
        "content": "CALGARY  Alberta  March 21 The Alberta Energy Regulator said on Monday it is implementing additional requirements at Canadian Natural Resources Ltd's  Primrose oil sands project after concluding excessive steaming caused a 6 648-barrel bitumen emulsion leak in 2013.",
        "date": "03212016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "UPDATE 2-Alberta regulator sets steam restriction at CNRL oil sands project "
    },
    {
        "content": "CALGARY  Alberta  March 21 The Alberta Energy Regulator said on Monday it is implementing additional requirements at Canadian Natural Resources Ltd's  Primrose oil sands project after concluding excessive steaming caused a 6 648 barrel bitumen seep in 2013.",
        "date": "03212016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Regulator sets permanent steam restriction at CNRL project "
    },
    {
        "content": "* President says no plans for job losses   (Adds president's comments on jobs  capex)",
        "date": "03032016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "UPDATE 3-Canadian Natural Resources targets more spending cuts "
    },
    {
        "content": "CALGARY  March 3 Canadian Natural Resources  played down the prospects of a ramp up in takeover activity in the sector this year  saying the gap between buyers and sellers' expectations remains an impediment.",
        "date": "03032016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Canadian Natural Resources not expecting ramp up in M&A activity "
    },
    {
        "content": "March 3 Canadian Natural Resources Ltd   reported an 89 percent fall in quarterly profit  hurt by weak oil and gas prices.",
        "date": "03032016",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Canadian Natural Resources posts 89 pct drop in quarterly profit "
    },
    {
        "content": "CALGARY  Alberta Canadian Natural Resources Ltd   made further cuts to its 2015 capital expenditure on Thursday and estimated a much lower 2016 spending budget  as oil prices show no signs of recovery.",
        "date": "11052015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "Canadian Natural Resources cuts budget again  posts third-quarter loss "
    },
    {
        "content": "* Lowers 2015 production forecast before royalties   (Adds CEO comments)",
        "date": "11052015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "UPDATE 3-Canadian Natural Resources cuts budget again  posts Q3 loss "
    },
    {
        "content": "Nov 5 Canadian Natural Resources Ltd   reported a quarterly loss  compared with a year-ago profit  hurt by weak oil and gas prices.",
        "date": "11052015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Canadian Natural Resources posts Q3 loss "
    },
    {
        "content": "CALGARY  Alberta  Sept 9 Canadian Natural Resources Ltd  the country's largest independent oil producer  is cutting salaries by up to 10 percent for all its staff in Calgary  Alberta  and Aberdeen  Scotland  the company said on Wednesday.",
        "date": "09092015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "UPDATE 1-CNRL cuts Calgary  Aberdeen staff salaries; cites low oil prices "
    },
    {
        "content": "CALGARY  Alberta  Sept 9 Canadian Natural Resources Ltd  the country's largest independent oil producer  is cutting salaries by up to 10 percent for all its staff in Calgary  Alberta  and Aberdeen  Scotland  the company said on Wednesday.",
        "date": "09092015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "CNRL cuts salaries by up to 10 pct for all Calgary and Aberdeen staff "
    },
    {
        "content": "CALGARY  Alberta  Aug 6 Canadian Natural Resources Ltd  the country's largest independent petroleum producer  swung to a loss in the second quarter as low global oil prices continued to bite and the Canadian province of Alberta raised its corporate tax rate.",
        "date": "08062015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "UPDATE 2-CNRL swings to quarterly loss  cuts spending again "
    },
    {
        "content": "Aug 6 Canadian Natural Resources Ltd  the country's largest independent petroleum producer  reported a better-than-expected adjusted earnings as the company's production expenses fell.",
        "date": "08062015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Canadian Natural Resources adj profit beats as expenses fall "
    },
    {
        "content": "CALGARY  Alberta  June 17 Canadian Natural Resources Ltd  the country's No. 1 independent oil producer  warned on Wednesday about the risks of adjusting Alberta's oil and gas royalties regime and said the province needed to remain competitive.",
        "date": "06172015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "UPDATE 1-CNRL says risks associated with adjusting Alberta's royalty regime "
    },
    {
        "content": "CALGARY  Alberta  June 17 Planned maintenance at Canadian Natural Resources Ltd's 125 000-barrel-per-day Horizon oil sands project has been completed and synthetic crude production resumed on Monday  the company said on Wednesday.",
        "date": "06172015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "CNRL Horizon project ramping up this week after maintenance completed "
    },
    {
        "content": "CALGARY  Alberta  June 17 Canadian Natural Resources Ltd's second-quarter production will be reduced by approximately 7 500 barrel per day as a result of wildfires in Alberta that shut in output at the Primrose and Kirby South projects  the company said on Wednesday.",
        "date": "06172015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "CNRL says Q2 production cut by 7 500 bpd as a result of wildfires "
    },
    {
        "content": "CALGARY  Alberta  June 17 The risk of getting adjustments to Alberta's oil and gas royalty regime wrong is high  Canadian Natural Resources Ltd President Steve Laut said on Wednesday  adding that Alberta needs to remain competitive with other Canadian provinces.",
        "date": "06172015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "CNRL says risks associated with adjusting Alberta's royalty regime "
    },
    {
        "content": " ",
        "date": "06082015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "UPDATE 1-CNRL says fire-affected output in Alberta oil sands to return this week "
    },
    {
        "content": "CALGARY  Alberta  June 11 Canadian Natural Resources Ltd  the country's No.1 independent oil producer  said output at its Primrose and Kirby South oil sands projects has returned to normal levels after wildfires in northeastern Alberta late last month cut production.",
        "date": "06112015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "CNRL says fire-threatened oil sands projects back at full output "
    },
    {
        "content": "CALGARY  Alberta  June 4 Production at two of Canada's major oil sands operations remained suspended on Thursday as wildfires continue to rage in northern Alberta.",
        "date": "06042015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "CNRL  Cenovus wait to resume oil production lost to wildfires "
    },
    {
        "content": "CALGARY  Alberta  June 1 Firefighters made progress tackling wildfires in the key oil-producing region of northern Alberta on Monday that shut in 10 percent of total oil sands production and workers are beginning to return to assess the damage.",
        "date": "06012015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "UPDATE 1-CNRL inspecting evacuated oil sands site  fires still burn "
    },
    {
        "content": "CALGARY  Alberta  June 2 Canadian Natural Resources Ltd said on Tuesday its staff are making safety checks on equipment abandoned for more than a week at its Primrose and Kirby South oil sands projects in northeastern Alberta after they were evacuated when wildfires drew too close to the facilities.",
        "date": "06022015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "CNRL says production at evacuated oil sands sites yet to resume "
    },
    {
        "content": "CALGARY  Alberta  June 3 Canadian Natural Resources Ltd said on Wednesday it is ramping up production at its 30 000 barrel per day Kirby South oil sands project in northern Alberta as the wildfire threat in the region eases.",
        "date": "06032015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "CNRL says ramping up oil sands output as Alberta wildfires ease "
    },
    {
        "content": "CALGARY  Alberta  June 1 Canadian Natural Resources Ltd said on Monday it has been allowed access to its Primrose oil sands operations that have been shut for more than a week after a northern Alberta forest fire forced the company to suspend operations and evacuate its employees.",
        "date": "06012015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "CNRL says team inspecting oil sands project threatened by fire "
    },
    {
        "content": "CALGARY  Alberta  June 1 Firefighters made progress battling wildfires in northern Alberta on Monday that have shut in 10 percent of total oil sands production  and workers began returning to some sites to assess damage.",
        "date": "06022015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "UPDATE 2-CNRL  Cenovus return to oil sands sites  fires still burn "
    },
    {
        "content": "CALGARY  Alberta  May 27 Canadian Natural Resources Ltd  one of the biggest producers in the Alberta oil sands  said on Wednesday it is delaying setting out detailed spending plans due to uncertainty about the energy policies of Alberta's new left-leaning government.",
        "date": "05272015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "UPDATE 1-CNRL says uncertainty over new Alberta gov't delays its plans "
    },
    {
        "content": "CALGARY  Alberta  May 25 Canadian Natural Resources Ltd has cut production at its Kirby South oil sands project to 12 000 barrels per day from 30 000 bpd due to a wildfire raging in northeastern Alberta  a company spokeswoman said on Monday.",
        "date": "05252015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "CNRL cuts Kirby South oil sands production due to Alberta fire "
    },
    {
        "content": "CALGARY  Alberta  May 27 Canadian Natural Resources Ltd is delaying setting out detailed future spending plans due to uncertainty about the energy policies of Alberta's New Democratic Party government  the company said on Wednesday.",
        "date": "05272015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "CNRL says spending plans delayed by Alberta govt uncertainty "
    },
    {
        "content": "CALGARY  Alberta  May 7 Canadian Natural Resources Ltd  the country's largest oil producer  said on Thursday it expects Alberta's newly elected left-wing government will be a good partner for the energy industry  but warned that increased corporate taxes and royalties would cause businesses to flee the province.",
        "date": "05072015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "UPDATE 1-Canadian Natural says will work with new Alberta government "
    },
    {
        "content": "CALGARY  Alberta  May 7 Canadian Natural Resources Ltd  the country's largest independent oil and gas producer  said on Thursday it swung to a loss in the first quarter due to sharply lower oil prices even as production rose by nearly a third.",
        "date": "05072015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Canadian Natural swings to loss on lower oil prices "
    },
    {
        "content": "TORONTO  March 5 Canada's main stock index rose in a broad but shallow rally on Thursday  led by a 5 percent jump in shares of Canadian Natural Resources Ltd after the major oil and gas producer surprised investors with strong quarterly results.",
        "date": "03052015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "CANADA STOCKS-TSX ekes out gain as ECB rally fades; energy earnings help "
    },
    {
        "content": "TORONTO  March 5 Canada's main stock index rose on Thursday  in a broad but shallow rally led by a jump in shares of Canadian Natural Resources Ltd after the major oil and gas producer surprised investors with strong quarterly results.",
        "date": "03052015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "CANADA STOCKS-TSX ends higher; Canadian Natural Resources shines "
    },
    {
        "content": "CALGARY  Alberta  March 5 Canadian Natural Resources Ltd  the country's No. 2 oil and gas producer  said on Thursday it expects to spin off its Western Canada royalty lands this year as it reported unexpectedly strong fourth-quarter results and boosted its dividend.",
        "date": "03052015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "UPDATE 2-Canadian Natural keeps 2015 spin-off plan as 4th-qtr profit jumps "
    },
    {
        "content": "TORONTO  March 5 Canada's main stock exchange rose broadly on Thursday  led by healthy gains among bank shares and forecast-beating results from Canadian Natural Resources Ltd   the country's No. 2 oil and gas producer.",
        "date": "03052015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "CANADA STOCKS-TSX higher as banks and resource stocks lead; earnings lift "
    },
    {
        "content": "Jan 12 Canadian Natural Resources Ltd  the country's largest independent oil producer  said on Monday it would defer the first phase of its 40 000-barrel-per-day Kirby North thermal project in northern Alberta until crude prices stabilize.",
        "date": "01122015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "topStory",
        "symbol": "CNQ",
        "title": "UPDATE 1-Canadian Natural Resources defers oil sands thermal project "
    },
    {
        "content": "Jan 12 Canadian Natural Resources Ltd  the country's largest independent oil producer  cut its 2015 capital expenditure and production forecast as global oil prices continue to slump.",
        "date": "01122015",
        "name": "Canadian Natural Resources Limited",
        "news_type": "normal",
        "symbol": "CNQ",
        "title": "Canadian Natural Resources cuts 2015 capex forecast by 28 pct "
    }
]