[
    {
        "content": "WASHINGTON  Nov 13 A bipartisan group of U.S. senators said on Monday they had reached a tentative deal to cut the number of banks labelled systemically risky  in a major step forward for efforts to roll back regulations enacted following the 2008 financial crisis.",
        "date": "11132017",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "UPDATE 2-U.S. Senate reaches deal to cut number of systemically important banks "
    },
    {
        "content": "* Capital One-deal allowing Capital One customers who use Intuit's suite of services to securely import financial data without sharing login credentials​ Source text for Eikon: Further company coverage:",
        "date": "10312017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One and Intuit announce data sharing agreement "
    },
    {
        "content": "Capital One Financial  will stop issuing mortgage and home equity loans and cut some 1 100 jobs amid rising interest rates that have pushed away borrowers and slowed loan growth at many U.S. regional banks.",
        "date": "11082017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Capital One exits mortgage loans business  cuts 1 100 jobs "
    },
    {
        "content": "Nov 8 Capital One Financial will stop issuing mortgage and home equity loans and cut some 1 100 jobs amid rising interest rates that have pushed away borrowers and slowed loan growth at many U.S. regional banks.",
        "date": "11082017",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "CORRECTED-Capital One exits mortgage loans business  cuts 1 100 jobs "
    },
    {
        "content": "* Capital One Financial- Sept domestic credit card net charge-offs rate 4.39 percent versus 4.75 percent in August",
        "date": "10242017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One Financial reports Sept. domestic credit card net charge-offs rate 4.39 percent "
    },
    {
        "content": "* Capital One reports third quarter 2017 net income of $1.1 billion  or $2.14 per share",
        "date": "10242017",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "BRIEF-Capital One reports Q3 earnings $2.14/shr "
    },
    {
        "content": "* Walter Investment Management Corp - ‍on October 1  unit of co entered into a clean-up call agreement with Capital One  National Association​",
        "date": "10132017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Walter Investment Management says entered into a clean-up call agreement with Capital One  National Association​ "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 03 (Fitch) Fitch Ratings has today affirmed Capital One Financial's (COF) Long-Term Issuer Default Rating (LT IDR) and Viability Rating (VR) at 'A-/a-'. The Outlook remains Stable. At the same time  Fitch affirmed COF's Short-Term IDR at 'F2'. A full list of rating actions follows at the end of this release. The rating action follows a periodic review of the large regional banking group  which includes BB&T Corporation ",
        "date": "10032017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Fitch Affirms Capital One at 'A-/F2'; Outlook Stable "
    },
    {
        "content": "* Capital One Financial Corp - August domestic credit card net charge-offs rate 4.75 pct versus 4.79 pct in july",
        "date": "09152017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One Financial Corp - August domestic credit card net charge-offs rate 4.75 pct versus 4.79 pct in July "
    },
    {
        "content": "* Capital One Financial Corp - 30+ day performing delinquencies rate for auto 5.76 percent at July end versus 5.40 percent at June end",
        "date": "08152017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One Financial July auto net charge-offs rate 1.8 pct vs 1.74 pct in June "
    },
    {
        "content": "NEW YORK  June 27 Riskified  an e-commerce fraud prevention startup  has raised $33 million in new funding from investors including Capital One Financial Corp and Groupe Arnault  which controls French luxury goods conglomerate LVMH  it said on Tuesday.",
        "date": "06272017",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "Capital One  Groupe Arnault back e-commerce fraud preventer Riskified "
    },
    {
        "content": "* Capital One's CCAR capital plan receives conditional non-objection from the federal reserve",
        "date": "06282017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One's CCAR capital plan receives conditional non-objection from the Federal Reserve "
    },
    {
        "content": "WASHINGTON/NEW YORK  June 28 The Federal Reserve has approved plans from the 34 largest U.S. banks to use extra capital for stock buybacks  dividends and other purposes beyond a cushion against possible catastrophe.",
        "date": "06282017",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "Fed gives big U.S. banks a green light for buyback  dividend plans "
    },
    {
        "content": "* Capital One Financial Corp - May domestic credit card net charge-offs rate 5.23 percent versus 5.33 percent in April",
        "date": "06152017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One Financial's May domestic credit card net charge-offs rate 5.23 pct "
    },
    {
        "content": "* Capital One Financial Corp - April domestic credit card net charge-offs rate  5.33 percent versus 5.44 percent in March",
        "date": "05152017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One says April auto net charge-offs rate 1.93 pct vs 1.16 pct in March "
    },
    {
        "content": "* Capital One Financial Corp - announced a quarterly dividend of $0.40 per share payable May 25  2017 Source text for Eikon: Further company coverage:",
        "date": "05042017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One announces quarterly dividend of $0.40/shr "
    },
    {
        "content": "* Capital One reports first quarter 2017 net income of $810 million  or $1.54 per share",
        "date": "04252017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One reports Q1 earnings per share $1.54 "
    },
    {
        "content": "* March domestic credit card net-charge off rate 5.44 percent versus. 5.09 percent in Feb",
        "date": "04172017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One's March domestic credit card net-charge off rate 5.44 pct "
    },
    {
        "content": "* Synovus to resell credit-card portfolio to Capital One - source (Adds stock movement in extended trade)",
        "date": "03302017",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "UPDATE 3-Synovus to buy Cabela's financial unit - source "
    },
    {
        "content": "* Capital One Financial - former CFO Stephen S. Crawford's fy 2016 total compensation was $8.2 million versus $8.8 million",
        "date": "03212017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One Financial CEO Richard Fairbank's 2016 total compensation was $16.9 mln "
    },
    {
        "content": "* Capital One Financial Corp - Feb domestic credit card net-charge off rate  5.09 percent versus. 4.91 percent in January",
        "date": "03152017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One Financial says Feb domestic credit card net-charge off rate 5.09 pct "
    },
    {
        "content": "NEW YORK  March 10 Capital One Financial Corp  has developed a \"chatbot\" named Eno  an automated program that can communicate with the bank's customers via text message to give them information on their accounts and help them make credit card payments from their smartphone.",
        "date": "03102017",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "Capital One launches Eno  gender-neutral virtual assistant "
    },
    {
        "content": "* Capital One Financial says Jan auto net charge-off rate was 2.14 percent versus 2.11 percent in Dec",
        "date": "02152017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One Financial says Jan auto net charge-off rate was 2.14 pct "
    },
    {
        "content": "* Capital One reports fourth quarter 2016 net income of $791 million  or $1.45 per share",
        "date": "01242017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One reports Q4 EPS $1.45 "
    },
    {
        "content": "* December domestic card net charge-off rate  4.89 pct   versus. 4.78 pct in November",
        "date": "01172017",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One Financial reports December domestic card net charge-off rate 4.89 pct "
    },
    {
        "content": "* Capital One Financial Corp - Ryan Schneider will be leaving his role as president  card  of Capital One Financial Corporation",
        "date": "11252016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One Financial Corp says Ryan Schneider will be leaving his role as President "
    },
    {
        "content": "* Oct 30+ day delinquency rate for domestic card 3.91 percent versus. 3.68 percent at Sept-end",
        "date": "11152016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One Financial reports Oct domestic card net charge-off rate "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 26 (Fitch) Capital One Financial Corporation's (COF) third  quarter 2016 (3Q16) earnings were good and showed evidence of continued growth  in the company's domestic credit card business and auto loan business  according  to Fitch Ratings. COF's overall return on average assets (ROAA) was 1.18% in 3Q16  up from 1.13%  in the sequential quarter  but down 1.43% in the year-ago quarter. The  year-over-year decline is prima",
        "date": "10262016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Fitch: Loan Growth Evident in Capital One's 3Q16 Earnings "
    },
    {
        "content": "* Excluding adjusting items  Q3 2016 net income of $2.03 per share",
        "date": "10252016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One Financial posts Q3 adj. earnings $2.03/share "
    },
    {
        "content": "Capital One Financial Corp's board members do not have to face a lawsuit by a shareholder who accused them of failing to properly oversee the bank's compliance with federal anti-money-laundering laws  a Delaware judge has ruled.",
        "date": "10192016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Judge tosses lawsuit over Capital One's money-laundering controls "
    },
    {
        "content": "* Entered into a 10-year program agreement to become exclusive issuing partner of co-branded credit cards to cabela's customers",
        "date": "10032016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital one financial to be exclusive long-term card issuing partner with Leading Outdoor Retailer Cabela's "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 04 (Fitch) Fitch Ratings has affirmed Capital One Financial  Corporation's (COF) ratings at 'A-/F1'. The Rating Outlook is Stable. The  affirmation and Stable Outlook are driven by COF's continued solid earnings  performance  still good credit performance  and satisfactory capital ratios for  its business model.  The rating action follows a periodic review of the large regional banking group   which includes BB&T Corpor",
        "date": "10042016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Fitch Affirms Capital One Financial at 'A-/F1'; Outlook Stable "
    },
    {
        "content": "* July domestic card net charge-off rate 3.81 percent versus. 3.93 percent in June",
        "date": "08152016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One Financial July domestic card net charge-off rate 3.81 pct "
    },
    {
        "content": "* Capital One Financial Corp files for potential subordinated notes for undisclosed sum - SEC filing  Source: (http://bit.ly/2aFx3Eo) Further company coverage:",
        "date": "07252016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One files for potential subordinated notes "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 22 (Fitch) Capital One Financial Corporation's (COF) second  quarter 2016 (2Q16) earnings were down 7% sequentially due to higher  provisioning in the company's domestic credit card portfolio and higher  operating costs  according to Fitch Ratings. COF's overall return on average assets (ROAA) was a still good 1.13% in 2Q16  relative to 1.23% in the sequential quarter and 1.11% in the year-ago quarter.   Fitch notes that t",
        "date": "07222016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Fitch: Credit Card Provisions Impact Capital One's 2Q16 Earnings "
    },
    {
        "content": "* June domestic credit card net charge-offs rate 3.93 percent versus 3.99 percent in May",
        "date": "07152016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One Financial June domestic credit card net charge-offs rate 3.93 pct "
    },
    {
        "content": "* Capital One's CCAR capital plan receives no objection from the Federal Reserve",
        "date": "06292016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One receives no objection from Fed  to repurchase $2.5 bln "
    },
    {
        "content": "* May domestic credit card delinquency rate 3.01 percent - SEC filing",
        "date": "06152016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One Financial May net charge-off rate 3.99 pct "
    },
    {
        "content": "* Says April international card 30 plus day performing delinquency rate 3.22%",
        "date": "05162016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One Financial April international net charge-off 3.43 pct "
    },
    {
        "content": "* Announced a quarterly dividend of $0.40 per share payable may 26  2016 to stockholders of record as of may 16  2016  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05052016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "BRIEF-Capital One Financial announces quarterly dividend "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 28 (Fitch) Capital One Financial Corporation's (COF) first  quarter 2016 (1Q16) earnings were down due to higher provisioning across its  platform  but particularly within the company's energy loan portfolio  according  to Fitch Ratings. COF's overall return on average assets (ROAA) was a still good 1.23% in 1Q16  relative to 1.12% in the sequential quarter and 1.47% in the year-ago quarter.   Fitch notes that the 1Q16 RO",
        "date": "04282016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Fitch: Energy Provisioning Weighs on Capital One's 1Q16 Earnings "
    },
    {
        "content": "A former Capital One Financial Corp analyst was ordered by a federal court in Philadelphia to pay $13.5 million in sanctions for insider trading  the U.S. Securities and Exchange Commission said on Friday.",
        "date": "02262016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Former analyst for Capital One must pay $13.5 million for insider trading: SEC "
    },
    {
        "content": "A former Capital One Financial Corp  analyst was ordered by a federal court in Philadelphia to pay $13.5 million in sanctions for insider trading  the U.S. Securities and Exchange Commission said on Friday.",
        "date": "02262016",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "Former analyst for Capital One must pay $13.5 mln for insider trading -SEC "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 28 (Fitch) Capital One's Financial Corporation's (COF) fourth  quarter 2015 (4Q15) earnings were down due to higher provisioning and some  higher marketing expenses.  The company's overall return on average assets (ROAA) was 1.12% in 4Q15  still a  good result relative to peers but down from 1.43% in the sequential quarter and  1.28% in the year-ago quarter. Similarly  the company's return on average equity (ROE) was 7.",
        "date": "01282016",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Fitch: Capital One's 4Q15 Earnings Down on Higher Provisioning "
    },
    {
        "content": "PHILADELPHIA A former Capital One Financial Corp  analyst was found liable on Wednesday on civil charges that he engaged in insider trading by using non-public sales data from the credit card issuer to buy and sell stocks.",
        "date": "01142016",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "U.S. jury finds ex-Capital One analyst liable in insider trading case "
    },
    {
        "content": "PHILADELPHIA A former Capital One Financial Corp  analyst was found liable on Wednesday on civil charges that he engaged in insider trading by using non-public sales data from the credit card issuer to buy and sell stocks.",
        "date": "01132016",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "U.S. jury finds ex-Capital One analyst liable in insider trading case "
    },
    {
        "content": "PHILADELPHIA  Jan 13 A former Capital One Financial Corp analyst was found liable on Wednesday on civil charges that he engaged in insider trading by using non-public sales data from the credit card issuer to buy and sell stocks.",
        "date": "01142016",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "UPDATE 3-U.S. jury finds ex-Capital One analyst liable in insider trading case "
    },
    {
        "content": "PHILADELPHIA  Jan 13 A former Capital One Financial Corp analyst was found liable on Wednesday on civil charges that he engaged in insider trading by using non-public sales data from the credit card issuer to buy and sell stocks.",
        "date": "01132016",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "UPDATE 2-U.S. jury finds ex-Capital One analyst liable in insider trading case "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 23 (Fitch) Capital One Financial Corporation's (COF) third  quarter 2015 (3Q15) earnings were relatively good as the company delivered a  1.43% return on average assets (ROAA)  up from the sequential quarter which was  impacted by a large restructuring charge  but down 8 basis points from the  year-ago quarter. Similarly  return on average equity (ROAE) was 9.54% for 3Q15  up from 7.30%  sequentially  but down from 10.1",
        "date": "10232015",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Fitch: Good  Relatively Clean Quarter for Capital One "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 05 (Fitch) Fitch Ratings has affirmed Capital One Financial  Corporation's (COF) ratings at 'A-/F1'. The Rating Outlook remains Stable. The rating action follows a periodic review of the large regional banking group   which includes BB&T Corporation (BBT)  Capital One Finance Corporation (COF)   Comerica Incorporated (CMA)  Fifth Third Bancorp (FITB)  Huntington Bancshares  Inc. (HBAN)  Keycorp (KEY)  M&T Bank Corporat",
        "date": "10052015",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Fitch Affirms Capital One Financial Corp's LT IDR at 'A-' Following Large Regional Bank Review "
    },
    {
        "content": "Patent licensor Intellectual Ventures' infringement lawsuits against the banking industry continue to run into trouble as the company's last two patents in a case against Capital One Financial Corp were knocked out by a federal judge on Friday.",
        "date": "09082015",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Intellectual Ventures patents used to sue Capital One wiped out "
    },
    {
        "content": "A U.S. appeals court on Friday upheld the cancellation of a patent used to sue Capital One Financial Corp in yet another victory for the bank over companies that have accused it of infringement.",
        "date": "09082015",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "Capital One wins yet another patent infringement case "
    },
    {
        "content": "The increasingly aggressive litigation strategy of Intellectual Ventures  one of the world's biggest patent owners  took another hit on Wednesday as a U.S. court canceled two of its patents in a dispute with Capital One Financial Corp.",
        "date": "09032015",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Capital One wins again against Intellectual Ventures patents "
    },
    {
        "content": "General Electric Co  said it would sell its U.S. healthcare finance unit to credit card lender Capital One Financial Corp  for about $9 billion as it winds down its finance arm and returns to its industrial roots.",
        "date": "08112015",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "GE to sell healthcare finance business to Capital One for $9 billion "
    },
    {
        "content": "* GE has now announced finance asset sales of $78 bln   (Adds details  background  shares)",
        "date": "08112015",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "UPDATE 2-GE to sell healthcare finance business to Capital One for $9 bln "
    },
    {
        "content": "Aug 11 General Electric Co said it would sell its U.S. healthcare finance unit and $8.5 billion of healthcare-related loans to Capital One Financial Corp  for about $9 billion.",
        "date": "08112015",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "GE to sell healthcare lending business to Capital One "
    },
    {
        "content": "Credit card lender Capital One Financial Corp  is in exclusive talks to acquire General Electric Co's  U.S. healthcare finance unit  in a deal likely to top $10 billion  according to people familiar with the matter.",
        "date": "08062015",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Exclusive: Capital One nears deal to acquire GE health finance unit - sources "
    },
    {
        "content": "Capital One Financial Corp  and Apollo Global Management  have bid for General Electric Co's  health-care finance unit  which could fetch more than $11 billion  Bloomberg reported.",
        "date": "06262015",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Capital One  Apollo among bidders for GE health-care lender: Bloomberg "
    },
    {
        "content": "June 25 Capital One Financial Corp and Apollo Global Management have bid for General Electric Co's health-care finance unit  which could fetch more than $11 billion  Bloomberg reported.",
        "date": "06262015",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "Capital One  Apollo among bidders for GE health-care lender -Bloomberg "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 24 (Fitch) Capital One Financial Corporation's (COF) first  quarter 2015 (1Q15) earnings of $1.12 billion were good  in Fitch Ratings's  view. These results equated to a 1.47% return on average assets (ROAA) in 1Q15   stronger than the 1.28% ROAA in the sequential quarter  but slightly lower than  the 1.53% ROAA in the year-ago quarter. Fitch notes that COF's earnings performance this quarter puts it near the top of  its ",
        "date": "04242015",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Fitch: Steady 1Q15 Earnings For Capital One "
    },
    {
        "content": "NEW YORK American Express Co violated U.S. antitrust law by prohibiting merchants from steering consumers to use lower-cost credit cards  a federal judge ruled on Thursday  in the company's second major setback this month.",
        "date": "02192015",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "American Express card rules violated U.S. antitrust law - judge "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 23 (Fitch) Capital One Financial's (COF) fourth quarter  earnings were satisfactory  according to Fitch Ratings. The company's return on  average assets (ROA) clocked in at 1.27%  lower than the sequential quarter  but  an improvement relative to the year-ago quarter. Similarly the company's return  on average equity (ROE) was 8.61%  down from 10.12% in the sequential quarter   but up from 8.27% in the year-ago quarter.",
        "date": "01232015",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Fitch: Good Credit Card Loan Growth in Capital One's 4Q'14 Earnings "
    },
    {
        "content": "Capital One Financial Corp   one of the largest credit card issuers in the United States  reported a quarterly profit that narrowly missed Wall Street's estimates as the company set aside more money to cover bad loans.",
        "date": "01222015",
        "name": "Capital One Financial Corporation",
        "news_type": "topStory",
        "symbol": "COF",
        "title": "Capital One profit misses estimates due to higher loan reserves "
    },
    {
        "content": "Jan 22 Capital One Financial Corp  one of the largest credit card issuers in the United States  reported a quarterly profit that narrowly missed Wall Street's estimates as the company set aside more money to cover bad loans.",
        "date": "01222015",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "UPDATE 1-Capital One profit misses estimates due to higher loan reserves "
    },
    {
        "content": "Jan 22 Credit card issuer Capital One Financial Corp reported a 16.6 percent rise in quarterly profit as the company's net interest income rose.",
        "date": "01222015",
        "name": "Capital One Financial Corporation",
        "news_type": "normal",
        "symbol": "COF",
        "title": "Capital One quarterly profit rises 16.6 pct "
    }
]