[
    {
        "content": "DUBAI Dubai airline Emirates [EMIRA.UL] joined forces with Mercedes-Benz and motoring journalist Jeremy Clarkson to launch its new first-class suites on Sunday  inspired by the styling of luxury car interiors.",
        "date": "11122017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Emirates partners with Mercedes  Jeremy Clarkson for new first class "
    },
    {
        "content": "* Sets quarterly dividend of $0.33 per share Source text for Eikon: Further company coverage:",
        "date": "10312017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "BRIEF-Rockwell Collins sets quarterly dividend of $0.33 per share "
    },
    {
        "content": "Oct 10 Honeywell International Inc is expected to unveil a corporate makeover on Tuesday that ties its growth more strongly to aerospace technology - the opposite of what activist investor Third Point Capital has urged since April.",
        "date": "10102017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Honeywell puts more of its chips on aerospace "
    },
    {
        "content": "* DTN acquires Wilkens Weather Technologies from Rockwell Collins",
        "date": "09292017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "BRIEF-DTN acquires Wilkens Weather Technologies from Rockwell Collins​ "
    },
    {
        "content": "NEW YORK  Sept 29 A burst of loans to highly indebted companies to cut borrowing costs and acquire corporate targets while interest rates remain low boosted US syndicated lending by 24% to an all-time high for any nine-month period  charting a course toward a record issuance year.",
        "date": "09292017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "LPC: Low rates  improving economy ignite US syndicated lending "
    },
    {
        "content": "* Deal could face regulatory scrutiny - analyst (Adds Aerojet share price; M&A data)",
        "date": "09182017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "UPDATE 4-Northrop Grumman to buy missile maker Orbital for $7.8 bln "
    },
    {
        "content": "NEW YORK U.S. defense contractor Northrop Grumman Corp  is poised to announce a purchase of missile and rocket maker Orbital ATK Inc  as soon as Monday  a person familiar with the transaction said on Sunday.",
        "date": "09182017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Northrop Grumman nears deal to purchase Orbital ATK: source "
    },
    {
        "content": "NEW YORK  Sept 17 U.S. defense contractor Northrop Grumman Corp is poised to announce a purchase of missile and rocket maker Orbital ATK Inc as soon as Monday  a person familiar with the transaction said on Sunday.",
        "date": "09182017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "UPDATE 3-Northrop Grumman nears deal to purchase Orbital ATK -source "
    },
    {
        "content": "Sept 14 Aerospace supplier United Technologies Corp said on Thursday it was working to resolve the issues that led to delays in supplying its Pratt & Whitney engines to European planemaker Airbus SE.",
        "date": "09142017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "United Tech says working to resolve engine delays to Airbus "
    },
    {
        "content": "* United Technologies says if merger agreement terminated under specified circumstances  Rockwell Collins to pay co termination fee of $695 million Source text: (http://bit.ly/2eLNIN9) Further company coverage:",
        "date": "09062017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "BRIEF-United Technologies says if merger agreement terminated under specified circumstances  Rockwell Collins to pay co termination fee of $695 million "
    },
    {
        "content": "Sept 4 Jet-engine maker United Technologies Corp has agreed to buy aircraft parts manufacturer Rockwell Collins Inc for $30 billion  the companies said.",
        "date": "09042017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "REFILE-United Tech to buy Rockwell Collins for $30 bln in stock and cash "
    },
    {
        "content": "NEW YORK  Sept 5 Boeing Co said on Tuesday it would look closely at United Technologies Corp's $23 billion acquisition of Rockwell Collins Inc  breaking its month-long silence on a deal.",
        "date": "09052017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "UPDATE 1-Boeing raises concern about $23 bln United Tech-Rockwell deal "
    },
    {
        "content": "NEW YORK  Sept 6 United Technologies Corp launched a US$6.5bn loan on Wednesday to support the aerospace and industrial company’s US$23bn purchase of avionics supplier Rockwell Collins Inc  the largest merger ever in the aerospace sector  sources said.",
        "date": "09062017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "LPC: United Tech launches US$6.5bn loan for Rockwell Collins buy "
    },
    {
        "content": "* United Technologies to buy Rockwell Collins for $23 billion  United Technologies will pay $140 share in cash and stock- WSJ  citing sources Source text : http://on.wsj.com/2vGxeNB",
        "date": "09042017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "BRIEF-United Technologies to buy Rockwell Collins for $23 bln- WSJ "
    },
    {
        "content": "NEW YORK  Sept 5 Boeing Co said on Tuesday it would look closely at United Technologies Corp's $23 billion acquisition of Rockwell Collins Inc  breaking its month-long silence on a deal.",
        "date": "09052017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Boeing raises concern about $23 bln United Tech-Rockwell deal "
    },
    {
        "content": "PARIS  Sept 6 Airbus said on Wednesday it had delivered eight A320neo-family jets in August and 76 so far this year  highlighting uncertainty over its 2017 delivery schedule after delays in receiving engines from its U.S. supplier.",
        "date": "09062017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Airbus posts modest August deliveries  highlighting engine delays "
    },
    {
        "content": "NEW YORK Boeing Co said on Tuesday it would look closely at United Technologies Corp's $23 billion acquisition of Rockwell Collins Inc  breaking its month-long silence on a deal.",
        "date": "09062017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Boeing raises concern about $23 billion United Tech-Rockwell deal "
    },
    {
        "content": "* United Technologies CEO Greg Hayes on CNBC says anti-trust risk is very low on deal with Rockwell Collins",
        "date": "09052017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "BRIEF-United Technologies CEO Greg Hayes on CNBC says anti-trust risk is very low on deal with Rockwell Collins "
    },
    {
        "content": "Aerospace supplier United Technologies Corp  has struck a $30 billion agreement to buy avionics and interiors maker Rockwell Collins Inc   the companies said on Monday  in a deal that bulks up UTC's power with plane makers by creating one of the world's largest makers of civilian and defense aircraft components. | Video ",
        "date": "09062017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "United Tech to buy Rockwell Collins for $30 billion "
    },
    {
        "content": "* United Tech down after its $30 bln deal to buy Rockwell Collins",
        "date": "09052017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "US STOCKS-Wall St opens lower on North Korea tensions "
    },
    {
        "content": "* United Tech down after its $30 bln deal to buy Rockwell Collins",
        "date": "09052017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "US STOCKS-Wall St set to open lower as N. Korea tensions rise "
    },
    {
        "content": "PARIS/NEW YORK  Aug 30 Airbus has urged supplier United Technologies Corp to stay focused on fixing industrial problems that have delayed new aircraft deliveries even if it presses ahead with plans to buy avionics and seats maker Rockwell Collins Inc.",
        "date": "08302017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "UPDATE 1-Airbus hopes M&A talk does not distract United Tech from operations "
    },
    {
        "content": "PARIS/NEW YORK  Aug 30 Airbus has urged supplier United Technologies Corp to stay focused on fixing industrial problems that have delayed new aircraft deliveries even if it presses ahead with plans to buy avionics and seats maker Rockwell Collins Inc.",
        "date": "08312017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "RPT-UPDATE 1-Airbus hopes M&A talk does not distract United Tech from operations "
    },
    {
        "content": "Aug 29 The following bids  mergers  acquisitions and disposals were reported by 2030 GMT on Tuesday:",
        "date": "08292017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "NEW YORK  Sept 5 Aerospace and industrial company United Technologies Corp said on Tuesday it is not planning quick divestments of businesses after it agreed to acquire avionics supplier Rockwell Collins Inc in a $23 billion deal.",
        "date": "09052017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "United Tech sees limited divestment; needs cash flow to reduce debt "
    },
    {
        "content": "* United Technologies to acquire Rockwell Collins for $30 billion",
        "date": "09052017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "CORRECTED-BRIEF-United Technologies to acquire Rockwell Collins for $30 bln (Sep. 4) "
    },
    {
        "content": "Aug 30 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "08302017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "PARIS  Aug 30 Airbus has urged United Technologies to stay focused on fixing industrial problems that have delayed aircraft deliveries even if it presses ahead with reported plans to buy avionics supplier Rockwell Collins",
        "date": "08302017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Airbus says hopes M&A talk will not distract United Tech from operational priorities "
    },
    {
        "content": "United Technologies Corp   owner of jet-engine maker Pratt & Whitney  has made progress in its talks to acquire aircraft component manufacturer Rockwell Collins Inc  as it seeks to bulk up its aerospace business  a person familiar with the matter said on Tuesday.",
        "date": "08292017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "United Tech makes progress in Rockwell Collins talks: source "
    },
    {
        "content": "Aug 29 United Technologies Corp  owner of jet-engine maker Pratt & Whitney  has made progress in its talks to acquire aircraft component manufacturer Rockwell Collins Inc as it seeks to bulk up its aerospace business  a person familiar with the matter said on Tuesday.",
        "date": "08292017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "UPDATE 1-United Tech makes progress in Rockwell Collins talks -source "
    },
    {
        "content": "NEW YORK Aerospace and industrial company United Technologies Corp  said on Tuesday it would be suspended share buybacks for three to four years as a result of acquiring avionics supplier Rockwell Collins   to allow it to reduce debt.",
        "date": "09052017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "United Tech to suspend share buybacks for three-four years to cut debt "
    },
    {
        "content": "Aug 29 United Technologies Corp  which makes Pratt and Whitney engines and Otis Elevators  is nearing a deal to buy aircraft component maker Rockwell Collins Inc for more than $20 billion  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "08292017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "United Tech nears deal to buy Rockwell Collins -WSJ "
    },
    {
        "content": "NEW YORK  Sept 5 Aerospace and industrial company United Technologies Corp said on Tuesday it would be suspended share buybacks for three to four years as a result of acquiring avionics supplier Rockwell Collins  to allow it to reduce debt.",
        "date": "09052017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "United Tech to suspend share buybacks for 3-4 years to cut debt "
    },
    {
        "content": "* United Tech. nears deal to buy Rockwell Collins  discuss price of $140 per share or less - CNBC  citing DJ Further company coverage:",
        "date": "08292017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "BRIEF-United Technologies nears deal to buy Rockwell Collins - CNBC  citing DJ "
    },
    {
        "content": "* Dow off 0.04 pct  S&P down 0.1 pct  Nasdaq up 0.15 pct (Updates to open)",
        "date": "08072017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "US STOCKS-Dow hits record high again; Nasdaq slightly higher "
    },
    {
        "content": "United Technologies Corp   the U.S. maker of Otis Elevators and Carrier air conditioners  has submitted an offer to acquire aircraft component manufacturer Rockwell Collins Inc   a person familiar with the matter said on Friday.",
        "date": "08042017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "United Technologies in bid to acquire Rockwell Collins: source "
    },
    {
        "content": "Aug 4 United Technologies Corp  the U.S. maker of Otis Elevators and Carrier air conditioners  has submitted an offer to acquire aircraft component manufacturer Rockwell Collins Inc  a person familiar with the matter said on Friday.",
        "date": "08042017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "UPDATE 1-United Technologies in bid to acquire Rockwell Collins -source "
    },
    {
        "content": "Aug 4 United Technologies Corp has submitted an offer to acquire aircraft component maker Rockwell Collins Inc  a person familiar with the matter said on Friday.",
        "date": "08042017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "United Technologies in bid to acquire Rockwell Collins -source "
    },
    {
        "content": "* United Technologies weighs deal for Rockwell Collins - Bloomberg  citing sources",
        "date": "08042017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "BRIEF-United Technologies weighs deal for Rockwell Collins - Bloomberg "
    },
    {
        "content": "Aircraft components maker Rockwell Collins Inc  on Friday posted adjusted earnings that beat expectations  sending its shares up sharply after its first results including recently acquired aircraft interiors maker B/E Aerospace.",
        "date": "07282017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "Rockwell Collins shares jump as results beat forecast "
    },
    {
        "content": "July 28 Aircraft components maker Rockwell Collins Inc on Friday posted adjusted earnings that beat expectations  sending its shares up sharply after its first results including recently acquired aircraft interiors maker B/E Aerospace.",
        "date": "07282017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "UPDATE 2-Rockwell Collins shares jump as results beat forecast "
    },
    {
        "content": "* Q3 earnings per share view $1.58 -- Thomson Reuters I/B/E/S",
        "date": "07282017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "BRIEF-Rockwell Collins reports third quarter financial results "
    },
    {
        "content": "July 28 Aircraft components maker Rockwell Collins Inc reported a 57 percent rise in quarterly revenue as it gained from the acquisition of aircraft interiors maker B/E Aerospace.",
        "date": "07282017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Rockwell Collins revenue jumps 57 pct "
    },
    {
        "content": "* Rockwell Collins increases share repurchase authorization by $200 million",
        "date": "07072017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "BRIEF-Rockwell Collins increases share repurchase authorization by $200 mln "
    },
    {
        "content": "Rockwell Collins Inc's  second-quarter revenue beat analysts' estimates and the aircraft components maker raised its full-year revenue forecast to reflect the impact of its recently closed acquisition of aircraft interiors maker B/E Aerospace.",
        "date": "04212017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "Rockwell Collins lifts FY sales outlook to reflect B/E Aerospace deal "
    },
    {
        "content": "BRUSSELS  April 18 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "04182017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "EU mergers and takeovers (April 18) "
    },
    {
        "content": "April 21 Rockwell Collins Inc's second-quarter revenue beat analysts' estimates and the aircraft components maker raised its full-year revenue forecast to reflect the impact of its recently closed acquisition of aircraft interiors maker B/E Aerospace.",
        "date": "04212017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "UPDATE 3-Rockwell Collins lifts FY sales outlook to reflect B/E Aerospace deal "
    },
    {
        "content": "April 21 Aircraft component maker Rockwell Collins Inc raised its fiscal-year revenue forecast but gave a lower-than-expected profit outlook as it incorporated the acquisition of aircraft interiors maker B/E Aerospace into its results.",
        "date": "04212017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "CORRECTED-UPDATE 2-Rockwell Collins raises fiscal-year revenue forecast "
    },
    {
        "content": "* Rockwell Collins reports second quarter financial results and provides updated fiscal year 2017 financial guidance",
        "date": "04212017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "BRIEF-Rockwell Collins Q2 EPS $1.27 from continuing operations "
    },
    {
        "content": "April 21 Aircraft component maker Rockwell Collins Inc reported a 2.4 percent rise in quarterly revenue  helped by higher sales in its government systems and information management services units.",
        "date": "04212017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "REFILE-Rockwell Collins revenue rises 2.4 pct "
    },
    {
        "content": "SEATTLE  April 13 Rockwell Collins Inc will try to sell more aircraft seats and interiors directly to plane makers  rather than airlines  now that it has acquired interiors maker B/E Aerospace  Rockwell Chief Executive Kelly Ortberg said on Thursday.",
        "date": "04132017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Rockwell Collins aims to sell more seats directly to Boeing  Airbus "
    },
    {
        "content": "BRUSSELS  April 10 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "04102017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "EU mergers and takeovers (April 10) "
    },
    {
        "content": "BRUSSELS  April 7 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "04072017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "EU mergers and takeovers (April 7) "
    },
    {
        "content": "BRUSSELS EU antitrust regulators are set to approve without conditions U.S. aircraft component maker Rockwell Collins' $6.4 billion bid for aircraft interior maker B/E Aerospace  two people familiar with the matter said on Wednesday.",
        "date": "04052017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "EU set to clear $6.4 bln Rockwell  B/E Aerospace deal - sources "
    },
    {
        "content": "RIO DE JANEIRO U.S. aviation electronics maker Rockwell Collins Inc  and Brazil's Embraer SA  will assess each other's remote sensing and border control technology for possible joint sales  a senior executive for the Brazilian planemaker told Reuters.",
        "date": "04042017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "Exclusive: Embraer  Rockwell Collins eye shared remote sensing portfolio "
    },
    {
        "content": "BRUSSELS U.S. aircraft component maker Rockwell Collins  is set to gain unconditional EU approval for its $6.4 billion bid for aircraft interior maker B/E Aerospace   two people familiar with the matter said on Wednesday.",
        "date": "04052017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Exclusive: Rockwell to win EU approval for B/E Aero takeover - sources "
    },
    {
        "content": "RIO DE JANEIRO U.S. aviation electronics maker Rockwell Collins Inc  and Brazilian planemaker Embraer SA  agreed on Tuesday to work on integrating their remote sensing  targeting and communications portfolios for joint defense sales.",
        "date": "04042017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Embraer  Rockwell Collins to combine products for defense sales "
    },
    {
        "content": "RIO DE JANEIRO  April 4 U.S. aviation electronics maker Rockwell Collins Inc and Brazilian planemaker Embraer SA agreed on Tuesday to work on integrating their remote sensing  targeting and communications portfolios for joint defense sales.",
        "date": "04042017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "UPDATE 1-Embraer  Rockwell Collins to combine products for defense sales "
    },
    {
        "content": "BRUSSELS  April 4 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "04042017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "REFILE-EU mergers and takeovers (April 4) "
    },
    {
        "content": "SAO PAULO  April 4 The partnership between Brazilian planemaker Embraer and U.S. aviation electronics maker Rockwell Collins could eventually lead to the joint development of a new product  the head of Embraer's defense division Jackson Schneider said on Tuesday.",
        "date": "04042017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Embraer says partnership with Rockwell could lead to joint product "
    },
    {
        "content": "* Rockwell Collins announces pricing of senior notes offering",
        "date": "03292017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "BRIEF-Rockwell Collins announces pricing of senior notes offering "
    },
    {
        "content": "* Files for potential mixed shelf offering; size not disclosed  Source text : http://bit.ly/2mwY4hU Further company coverage:",
        "date": "03162017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "BRIEF-Rockwell Collins files for potential mixed shelf offering; size not disclosed "
    },
    {
        "content": "* Rockwell Collins' shareowners vote strongly in favor of B/E Aerospace acquisition",
        "date": "03092017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "BRIEF-Rockwell Collins' shareowners vote in favor of B/E Aerospace acquisition "
    },
    {
        "content": "* B/E Aerospace stockholders approve merger with Rockwell Collins",
        "date": "03092017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "BRIEF-B/E Aerospace stockholders approve merger with Rockwell Collins "
    },
    {
        "content": "* Starboard Value LP takes 1.1 million share stake in Rockwell Collins - SEC filing",
        "date": "02142017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "BRIEF-Starboard Value takes 1.1 mln share stake in Rockwell Collins "
    },
    {
        "content": "* B/E Aerospace reports 2016 financial results; comments on pending Rockwell Collins / B/E Aerospace merger",
        "date": "02102017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "BRIEF-B/E Aerospace posts Q4 EPS of $0.60 "
    },
    {
        "content": "BRUSSELS  Feb 6 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02062017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "EU mergers and takeovers (Feb 6) "
    },
    {
        "content": "SEATTLE  Jan 20 Aviation electronics maker Rockwell Collins Inc reported a 10 percent rise in quarterly profit on Friday  but costs from its acquisition of seat maker B/E Aerospace caused the figure to miss analysts estimates.",
        "date": "01202017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "Rockwell Collins profit up  but acquisition costs weigh "
    },
    {
        "content": "PARIS Recent production problems at Zodiac Aerospace  partially influenced the French seatmaker’s decision to agree to be taken over by aero engines group Safran   a leading Zodiac shareholder said.",
        "date": "01202017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Production problems were a factor in Zodiac agreeing to takeover-shareholder "
    },
    {
        "content": "* Safran shareholders to get special dividend of 5.5 euros/shr",
        "date": "01192017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "UPDATE 4-Six years after snub  France's Safran bags seatmaker Zodiac "
    },
    {
        "content": "PARIS  Jan 19 France's Safran said on Thursday it had launched an agreed cash offer worth 29.47 euros per share for aircraft seats manufacturer Zodiac Aerospace  to create the world's third largest aerospace supplier.",
        "date": "01192017",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "France's Safran launches offer for Zodiac Aerospace "
    },
    {
        "content": "* Rockwell Collins -on January 4  2017 board of directors approved an increase in the size of the board of directors from nine to eleven  Source text for Eikon:  Further company coverage:",
        "date": "01102017",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "BRIEF-Rockwell Collins increases size of board "
    },
    {
        "content": "Activist investor Starboard Value LP has acquired a stake in aircraft component maker Rockwell Collins Inc  and is questioning its $6.4 billion purchase of B/E Aerospace Inc   a person familiar with the matter said on Wednesday.",
        "date": "11302016",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "Starboard questions Rockwell Collins' B/E Aerospace deal: source "
    },
    {
        "content": "* B/E Aerospace - merger provides Rockwell Collins may be required to pay co termination fee of $300 million if deal is terminated under certain circumstances",
        "date": "10262016",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "BRIEF-B/E Aerospace - Rockwell Collins to pay termination fee of $300 mln if deal falls apart "
    },
    {
        "content": "NEW YORK Aircraft electronics supplier Rockwell Collins  said on Monday its $6.4 billion acquisition of interiors maker B/E Aerospace Inc  will boost sales and spur new products  helping offset sluggish demand for equipment in new business and commercial jets.",
        "date": "10242016",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "Rockwell sees big sales gains from $6.4 billion B/E Aero deal "
    },
    {
        "content": "NEW YORK  Oct 24 Aircraft electronics supplier Rockwell Collins said on Monday its $6.4 billion acquisition of interiors maker B/E Aerospace Inc will boost sales and spur new products  helping offset sluggish demand for equipment in new business and commercial jets.",
        "date": "10242016",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "UPDATE 2-Rockwell sees big sales gains from $6.4 bln B/E Aero deal "
    },
    {
        "content": "NEW YORK  Oct 24 Aircraft electronics supplier Rockwell Collins said on Monday its acquisition of B/E Aerospace Inc will triple its product content on new-generation widebody jetliners such as the Boeing 787 and Airbus A350.",
        "date": "10242016",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Rockwell sees widebody sales content tripling with B/E Aero deal "
    },
    {
        "content": "After two years of looking to expand  aircraft component maker Rockwell Collins Inc has struck a deal to buy aircraft interior maker B/E Aerospace Inc for $62 a share in cash and stock  the companies said on Sunday.",
        "date": "10232016",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "Rockwell broadens its reach with $6.4 billion purchase of B/E Aerospace "
    },
    {
        "content": "Oct 23 After two years of looking to expand  aircraft component maker Rockwell Collins Inc has struck a deal to buy aircraft interior maker B/E Aerospace Inc  for $62 a share in cash and stock  the companies said on Sunday.",
        "date": "10242016",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "RPT-UPDATE 3-Rockwell broadens its reach with $6.4 bln purchase of B/E Aerospace "
    },
    {
        "content": "Oct 23 After two years of looking to expand  aircraft component maker Rockwell Collins Inc has struck a deal to buy aircraft interior maker B/E Aerospace Inc  for $62 a share in cash and stock  the companies said on Sunday.",
        "date": "10232016",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "UPDATE 3-Rockwell broadens its reach with $6.4 bln purchase of B/E Aerospace "
    },
    {
        "content": "LONDON  Oct 24 European shares rose on Monday  buoyed by Zodiac Aerospace and by media firms  which benefited from readacross from merger moves in the United States.",
        "date": "10242016",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "European shares rise  boosted by U.S. merger moves "
    },
    {
        "content": "Oct 23 Aircraft component maker Rockwell Collins Inc has struck a deal to buy aircraft interior maker B/E Aerospace Inc for $62 per share in cash and stock  the companies said.",
        "date": "10232016",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Rockwell Collins buys B/E Aerospace for $62 per share "
    },
    {
        "content": "* Boeing selected co to provide touchscreen flight displays for all five flight deck displays on new Boeing 777X  Source text for Eikon:  Further company coverage:",
        "date": "09212016",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "BRIEF-Boeing selects Rockwell Collins to provide touchscreen displays for 777X "
    },
    {
        "content": "* Sets quarterly dividend of $0.33per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "08022016",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "BRIEF-Rockwell Collins sets quarterly dividend of $0.33per share "
    },
    {
        "content": "NEW YORK  July 27 Boeing Co reported a smaller-than-expected second-quarter loss on Wednesday  cushioned by strong performances in its jetliner and defense businesses.",
        "date": "07272016",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "UPDATE 4-Boeing posts lower-than-expected 2nd-qtr loss  stock gains "
    },
    {
        "content": "* FY 2016 revenue view $5.33 billion -- Thomson Reuters I/B/E/S",
        "date": "07252016",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "BRIEF-Rockwell Collins Q3 EPS $1.63 from cont ops "
    },
    {
        "content": "* Jeff Standerski named Senior Vice President  People and Inclusion",
        "date": "04252016",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "BRIEF-Rockwell Collins announces senior leadership appointments "
    },
    {
        "content": "* Q2 earnings per share view $1.28 -- Thomson Reuters I/B/E/S",
        "date": "04212016",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "BRIEF-Rockwell Collins Q2 EPS $1.30 from continuing operations "
    },
    {
        "content": "WASHINGTON  March 7 The U.S. Air Force on Monday named Pratt & Whitney as the engine maker for the new Northrop Grumman Corp long-range strike bomber  and defended the plane's \"cost plus incentive fee\" contract that has been challenged by U.S. lawmakers.",
        "date": "03072016",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "UPDATE 1-U.S. Air Force says Pratt to build engines for new bomber "
    },
    {
        "content": "WASHINGTON  Feb 26 General Dynamics  Rockwell Collins and Harris Corp were awarded a contract for more than $12 billion for manpack radios  the Pentagon said on Friday.",
        "date": "02262016",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "General Dynamics  Rockwell Collins  Harris Corp awarded $12 bln Pentagon contract "
    },
    {
        "content": "Rockwell Collins Inc  reported a 12.7 percent rise in quarterly profit as surging aircraft production boosted demand for the company's aviation electronic systems.",
        "date": "07242015",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "Rockwell Collins profit rises on aircraft demand surge "
    },
    {
        "content": "July 24 Rockwell Collins Inc reported a 12.7 percent rise in quarterly profit as surging aircraft production boosted demand for the company's aviation electronic systems.",
        "date": "07242015",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "UPDATE 1-Rockwell Collins profit rises on aircraft demand surge "
    },
    {
        "content": "July 24 Rockwell Collins Inc  a maker of avionics and aircraft systems  reported a 12.7 percent rise in quarterly profit and narrowed its forecast for full-year earnings.",
        "date": "07242015",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Rockwell Collins narrows full-year earnings forecast "
    },
    {
        "content": "COLORADO SPRINGS  Col.  April 13 AgustaWestland  the helicopter unit of Italy's Finmeccanica SpA  Bristow Group  Doss Aviation and Rockwell Collins Inc  on Monday proposed a new service-based system for training U.S. military pilots using AgustaWestland's AW119 single-engine helicopter.",
        "date": "04132015",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Firms propose service-based helicopter training for U.S. military "
    },
    {
        "content": "NEW YORK Sharply falling oil prices are providing a windfall for global airlines by cutting their massive fuel bills  but a weaker euro will temper the benefits for European carriers and limit their ability to spend on aircraft upgrades  the head of Rockwell Collins  said on Friday.",
        "date": "01232015",
        "name": "Rockwell Collins Inc",
        "news_type": "topStory",
        "symbol": "COL",
        "title": "Rockwell sees euro tempering airline fuel savings; seeks acquisitions "
    },
    {
        "content": "Jan 23 Rockwell Collins Inc on Friday reported a 26 percent increase in quarterly profit as sales rose 16 percent  and lifted its forecast for 2015.",
        "date": "01232015",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "Rockwell Collins profit up 26 percent; lifts forecast for 2015 "
    },
    {
        "content": "Jan 23 Rockwell Collins Inc on Friday reported a 26 percent increase in quarterly profit as sales rose 16 percent  and lifted its forecast for 2015.",
        "date": "01232015",
        "name": "Rockwell Collins Inc",
        "news_type": "normal",
        "symbol": "COL",
        "title": "UPDATE 1-Rockwell Collins profit up 26 percent; lifts forecast for 2015 "
    }
]