[
    {
        "content": "CALGARY  Nov 15 Canadian oil producer Cenovus Energy inc has put a package of mainly non-core Deep Basin gas assets for sale  its new CEO Alex Pourbaix said in his first media briefing on Wednesday.",
        "date": "11152017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Canada's Cenovus has put some non-core deep basin assets for sale -new CEO "
    },
    {
        "content": "* Cenovus reaches agreement to sell interest in Weyburn asset for $940 million",
        "date": "11132017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-Cenovus to sell interest in Weyburn asset for $940 mln "
    },
    {
        "content": "* Australia Barrow Island  Cooper Basin reach close to $70/bbl",
        "date": "11072017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Oil at $70/barrel already a reality for some as Asian premium bites "
    },
    {
        "content": "NEW YORK ConocoPhillips  said on Wednesday it will boost oil and natural gas output for the rest of the decade but vowed it would do so only when it was financially prudent and that it would strictly adhere to shareholder returns.",
        "date": "11082017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips vows financial discipline as it aims to boost output "
    },
    {
        "content": "NEW YORK  Nov 8 ConocoPhillips said on Wednesday it will boost oil and natural gas output for the rest of the decade but vowed it would do so only when it was financially prudent and that it would strictly adhere to shareholder returns.",
        "date": "11082017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 4-ConocoPhillips vows financial discipline as it aims to boost output "
    },
    {
        "content": "* Says will invest $1.2 billion in shale operations annually for rest of decade",
        "date": "11082017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips plan to double free cash flow in next three years "
    },
    {
        "content": "* ConocoPhillips analyst and investor meeting to outline 2018-2020 operating plan; creating value with disciplined  returns-focused strategy",
        "date": "11082017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips targets ‍debt reduction to $15 bln in 2019​ "
    },
    {
        "content": "NEW YORK  Nov 8 ConocoPhillips  the largest U.S. independent oil and natural gas producer  said on Wednesday it would spend $5.5 billion annually for the rest of the decade on capital projects as long as oil prices stay above $50 per barrel.",
        "date": "11082017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips aims to spend $5.5 bln/year for rest of decade "
    },
    {
        "content": "* Eyeing output of up to 120 000 barrels per day (Adds CEO  analysts' comments)",
        "date": "11012017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 2-Australia's Oil Search buys into promising Alaska oil find "
    },
    {
        "content": "Cenovus Energy Inc's   third-quarter adjusted profit beat Wall Street estimates on Thursday  as it benefited from the purchase of ConocoPhillips'  Canadian oil-sands assets that more than doubled production.",
        "date": "11022017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Cenovus' profit beats Street view  production more than doubles "
    },
    {
        "content": "Nov 2 Cenovus Energy Inc's third-quarter adjusted profit beat Wall Street estimates on Thursday  as it benefited from the purchase of ConocoPhillips' Canadian oil-sands assets that more than doubled production.",
        "date": "11022017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 2-Cenovus' profit beats Street view  production more than doubles "
    },
    {
        "content": "HOUSTON ConocoPhillips   the largest U.S. independent oil producer  reported a better-than-expected quarterly profit on Thursday  helped by rising crude prices  although it slashed its capital budget by 10 percent to further cut costs.",
        "date": "10262017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips' profit beats estimates  but budget cut 10 percent "
    },
    {
        "content": "HOUSTON  Oct 26 ConocoPhillips  the largest U.S. independent oil producer  reported a better-than-expected quarterly profit on Thursday  helped by rising crude prices  although it slashed its capital budget by 10 percent to further cut costs.",
        "date": "10262017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 3-ConocoPhillips' profit beats estimates  but budget cut 10 pct "
    },
    {
        "content": "* Says committed to returns-focused strategy regardless of commodity price improvement",
        "date": "10262017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips says committed to returns-focused strategy regardless of oil price "
    },
    {
        "content": "* ConocoPhillips reports third-quarter 2017 results; lowers capital guidance and delivers on strategic and operational targets; strong momentum going into November analyst and investor meeting",
        "date": "10262017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips says Q3 earnings per share $0.34 "
    },
    {
        "content": "HOUSTON  Oct 26 ConocoPhillips  the largest U.S. independent oil producer  said on Thursday it swung to a third-quarter profit helped by rising crude prices and cost cuts.",
        "date": "10262017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips swings to quarterly profit as oil prices rise "
    },
    {
        "content": "* For other news from Reuters Global Commodities Summit  click on http://www.reuters.com/summit/COMMODITIES17",
        "date": "10122017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "REUTERS SUMMIT-Indonesia's drive to reduce oil imports a boon for producers - GSS Energy "
    },
    {
        "content": "LONDON  Oct 9 Total  Eni and Statoil are seeking buyers for their stake in the Teesside oil terminal in northern England  which receives crude from the Norwegian Ekofisk fields  part of the global Brent benchmark  banking sources said.",
        "date": "10092017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Total  Eni  Statoil seek buyers for N. Sea Teesside terminal -sources "
    },
    {
        "content": "* Conocophillips files for a potential mixed shelf; size not disclosed - SEC filing‍​ Source text : (http://bit.ly/2hQOtWr) Further company coverage:",
        "date": "10062017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-Conocophillips files for a potential mixed shelf  size not disclosed - SEC filing‍​ "
    },
    {
        "content": "* Sets quarterly dividend of $0.265 per share Source text for Eikon: Further company coverage:",
        "date": "10062017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips sets quarterly dividend of $0.265/share "
    },
    {
        "content": "HOUSTON  Oct 6 ConocoPhillips said on Friday it is evacuating non-essential personnel from its Magnolia oil platform in the central Gulf of Mexico ahead of Tropical Storm Nate.",
        "date": "10062017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips withdraws workers from Gulf oil platform due to Nate "
    },
    {
        "content": "* ConocoPhillips appoints Caroline Maury Devine to its Board of Directors; announces Richard Auchinleck’s intent not to stand for re-election in 2018 Source text for Eikon: Further company coverage:",
        "date": "10062017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips appoints Caroline Maury Devine to its Board "
    },
    {
        "content": "MANILA/BEIJING  Sept 21 China's aggressive environmental protection campaign has tightened supplies of graphite electrodes used in steelmaking  boosting the fortunes of big producers like Fangda Carbon as mills search far and wide for a material now in short supply.",
        "date": "09212017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "The graphite fix: Inside China's newest commodity addiction "
    },
    {
        "content": "HOUSTON  Sept 7 ConocoPhillips is still shut out of its global headquarters nearly two weeks after Tropical Storm Harvey slammed into Houston  so Chief Executive Ryan Lance and thousands of employees are running the world's largest independent oil and natural gas producer remotely.",
        "date": "09072017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "For ConocoPhillips  Harvey a test of remote operations "
    },
    {
        "content": "Sept 5 Canadian Natural Resources Ltd said on Tuesday it has agreed to buy Cenovus Energy Inc's Pelican Lake heavy oil operations in Alberta for C$975 million ($787 million)  the company's second acquisition this year.",
        "date": "09052017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 2-Canadian Natural buys Cenovus Pelican Lake assets for C$975 million "
    },
    {
        "content": "OSLO Norway's government plans to make taxpayers rather than oil companies pay special U.N. fees for any offshore production from remote Arctic regions  according to letters sent to oil firms and seen by Reuters.",
        "date": "09052017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Exclusive: Norway plans tax breaks for remotest Arctic oilfields - letters "
    },
    {
        "content": "* Govt wants to expand Arctic oil exploration (Recasts  adds analysts  detail  background)",
        "date": "08292017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 2-Norway's Arctic oil ambitions suffer setback as most promising well yields none "
    },
    {
        "content": "HOUSTON  Aug 25 ConocoPhillips said on Friday it has suspended all operations and shut-in production in the Eagle Ford shale region of Texas due to Hurricane Harvey.",
        "date": "08252017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips halts Eagle Ford production due to Harvey "
    },
    {
        "content": "HOUSTON  Aug 24 ConocoPhillips said on Thursday it is suspending drilling in the Eagle Ford shale oil region of Texas and idling five rigs there ahead of Hurricane Harvey.",
        "date": "08242017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips idling Eagle Ford rigs ahead of Hurricane Harvey "
    },
    {
        "content": "OSLO  Aug 17 ConocoPhillips has won permission to prepare for the removal of the first permanent oil platform built off Norway more than 40 years ago  the country's industry regulator said on Thursday.",
        "date": "08172017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Conoco to start dismantling historical Norwegian oil platform "
    },
    {
        "content": "* Soros Fund Management dissolves share stake in Tesla Inc - SEC filing",
        "date": "08142017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-Soros Fund Management dissolves share stake in Tesla  Pfizer  ConocoPhillips "
    },
    {
        "content": "* ConocoPhillips completes sale of San Juan basin assets to Hilcorp Source text for Eikon: Further company coverage:",
        "date": "08072017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips completes sale of San Juan basin assets to Hilcorp "
    },
    {
        "content": "TORONTO/CALGARY  Aug 4 Cenovus Energy Inc has received separate bids from Canadian Natural Resources Ltd  ARC Financial Corp and  others for a heavy oil project in Pelican Lake  Alberta  according to people familiar with the matter who told Reuters the project was valued at as much as C$1 billion ($796 million).",
        "date": "08042017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Canadian Natural among bidders for Cenovus' Pelican Lake: sources "
    },
    {
        "content": "HOUSTON ConocoPhillips  cut its 2017 capital spending by 4 percent on Thursday  the latest U.S. oil and natural gas producer to do so in reaction to depressed crude prices.",
        "date": "07272017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips trims capex after posting quarterly loss "
    },
    {
        "content": "HOUSTON  July 27 ConocoPhillips cut its 2017 capital spending by 4 percent on Thursday  the latest U.S. oil and natural gas producer to do so in reaction to depressed crude prices.",
        "date": "07272017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 3-ConocoPhillips trims capex after posting quarterly loss "
    },
    {
        "content": "* Chief Executive Ferguson says will announce sale agreement for Suffield and Pelican Lake assets in third quarter",
        "date": "07272017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-Cenovus says asset divestiture could exceed C$5 billion "
    },
    {
        "content": "TORONTO  July 27 Canada's main stock index gained on Thursday as major gold miner Barrick Gold Corp and a string of other companies reported better-than-expected earnings and oil producer Cenovus Energy Inc turned a profit.",
        "date": "07272017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "CANADA STOCKS-TSX rises as Barrick earnings soar  Cenovus turns profit "
    },
    {
        "content": "July 27 Stock futures pointed to a slightly higher opening for Canada's main stock index on Thursday as commodity prices rose on dovish signals from the U.S. Federal Reserve.",
        "date": "07272017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "CANADA STOCKS-Futures edge higher as commodity prices rise "
    },
    {
        "content": "* ConocoPhillips reports Q2 2017 results and significant progress on strategic  financial and operational priorities",
        "date": "07272017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips lowers 2017 capex guidance to $4.8 billion "
    },
    {
        "content": "July 27 Oil producer Cenovus Energy Inc reported a profit in the second quarter  compared to a year-ago loss  helped by its recent purchase of ConocoPhillips' Canadian oil-sands assets.",
        "date": "07272017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Canada's Cenovus Energy posts profit in 2nd qtr "
    },
    {
        "content": "LAGOS  July 17 Shares in Nigerian oil company Oando fell close to a one-month low on Monday on news that regulators were investigating the firm's shareholding structure following its $1.65 billion acquisition of ConocoPhillips' Nigerian business.",
        "date": "07172017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "UPDATE 1-Oando's share price drops 10 pct on news of regulatory investigation "
    },
    {
        "content": "* ConocoPhillips announces quarterly dividend Source text for Eikon: Further company coverage:",
        "date": "07122017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips sets quarterly dividend of $0.265 per share "
    },
    {
        "content": "TORONTO  July 12 Canadian oil and gas producer Cenovus Energy Inc has hired investment banks to sell the Weyburn and Palliser oil assets  which it hopes would fetch as much as C$2.5 billion ($2 billion)  according to people familiar with the situation.",
        "date": "07122017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Cenovus expects up to C$2.5 bln from Weyburn  Palliser sales -sources "
    },
    {
        "content": "* ConocoPhillips appoints Ms. Sharmila Mulligan to its board of directors",
        "date": "07122017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips appoints Sharmila Mulligan to its board "
    },
    {
        "content": "* Rift raises concern about energy supplies (Adds background on LNG)",
        "date": "07042017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "WRAPUP 4-Qatar shows mettle  offers compromise as Gulf states prepare meeting "
    },
    {
        "content": "TORONTO  July 6 Canadian mergers and acquisitions rose about 13 percent to      C$120.5 billion ($93.2 billion) in the first half of 2017  driven by big-ticket energy deals and robust cross-border activity  according to Thomson Reuters data released on Thursday.",
        "date": "07062017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "JPMorgan tops Canadian M&A activity in energy-driven first half "
    },
    {
        "content": "* Rift raises concern about energy supplies (Adds further Qatari Foreign Minister)",
        "date": "07042017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "WRAPUP 3-Qatar shows mettle  offers compromise as Gulf states prepare meeting "
    },
    {
        "content": "DUBAI The West's three biggest energy corporations are lobbying Qatar to take part in a huge expansion of its gas production  handing Doha an unintended but timely boost in its bitter dispute with Gulf Arab neighbors.",
        "date": "07062017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Factbox: Oil majors' investments in countries involved in Qatar row "
    },
    {
        "content": "* Rift raises concern about energy supplies (Adds Qatari Foreign Minister  Saudi Ambassador)",
        "date": "07042017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "WRAPUP 2-Qatar shows mettle  offers compromise as Gulf states prepare meeting "
    },
    {
        "content": "July 4 Qatar announced on Tuesday it planned to raise liquefied natural gas (LNG) capacity by 30 percent in an apparent show of strength in its dispute with Gulf neighbours who have imposed political and economic sanctions on Doha.",
        "date": "07042017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "RPT-WRAPUP 1-Qatar raises gas capacity amid Gulf dispute "
    },
    {
        "content": "July 4 Qatar announced on Tuesday it planned to raise liquefied natural gas (LNG) capacity by 30 percent in an apparent show of strength in its dispute with Gulf neighbours who have imposed political and economic sanctions on Doha.",
        "date": "07042017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "WRAPUP 1-Qatar raises gas capacity amid Gulf dispute "
    },
    {
        "content": "June 29 ConocoPhillips said on Thursday it would sell its assets in the Barnett shale field in Texas to Miller Thomson & Partners LLC for about $305 million.",
        "date": "06292017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips to sell Barnett assets for $305 million "
    },
    {
        "content": "June 29 ConocoPhillips said it would sell its assets in the Barnett shale field in Texas to Miller Thomson & Partners LLC for about $305 million  as part of the largest U.S. independent oil producer's efforts to reduce exposure to natural gas.",
        "date": "06292017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 1-ConocoPhillips to sell Barnett assets for $305 mln "
    },
    {
        "content": "* Conocophillips-As result of barnet assets sale  to recognize non-cash impairment of about $0.6 billion pre-tax  about $0.4 billion after tax  in q2-sec filing Source text for Eikon: (http://bit.ly/2spK2kM) Further company coverage:",
        "date": "06292017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips to recognize non-cash impairment of about $0.4 billion after tax in Q2 "
    },
    {
        "content": "* Permian Basin Royalty Trust -  declared cash distribution to holders of its units of beneficial interest of $0.041151 per unit  payable on july 17  2017",
        "date": "06202017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-Permian Basin Royalty Trust declares cash distribution to holders of its units "
    },
    {
        "content": "CALGARY  Alberta  June 20 Cenovus Energy Inc will seek on Tuesday to convince investors of the value of an unpopular acquisition this year amid continuing skepticism from shareholders.",
        "date": "06202017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Cenovus to face investors amid rift after share decline "
    },
    {
        "content": "June 8 ConocoPhillips said on Thursday that production and exports of liquefied natural gas from an investment project in Qatar have not been affected by growing Middle East diplomatic tensions.",
        "date": "06082017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips says Qatar LNG project not affected by Arab tension "
    },
    {
        "content": "* ConocoPhillips says revised its second-quarter production guidance to 1 365 to 1 405 thousand barrels of oil equivalent per day - SEC filing Source text for Eikon: (http://bit.ly/2qWYx3n) Further company coverage:",
        "date": "05182017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips revises Q2 production guidance "
    },
    {
        "content": "* Says completed acquisition of ConocoPhillips western Canadian assets Further company coverage: (Reporting by Ethan Lou)",
        "date": "05172017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-Cenovus says completed purchase of ConocoPhillips Canada assets "
    },
    {
        "content": "* Conocophillips announces quarterly dividend Source text for Eikon: Further company coverage:",
        "date": "05052017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-Conocophillips sets quarterly dividend of $0.265 per share "
    },
    {
        "content": "MELBOURNE  May 5 BHP Billiton is facing pressure from two activist shareholders over its $20 billion splurge on U.S. shale oil and gas fields  but may resist calls to dump the business just as oil prices are sliding.",
        "date": "05052017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BHP Billiton under pressure to sell shale  even as oil prices fall "
    },
    {
        "content": "CALGARY  Alberta ConocoPhillips  will lay off 300 Canadian workers after selling most local assets to domestic crude producer Cenovus Energy Inc   the Houston-based company said on Thursday.",
        "date": "05042017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips to lay off 300 in Canada oil sands pullback "
    },
    {
        "content": "CALGARY  Alberta  May 4 ConocoPhillips will lay off 300 Canadian workers after selling most local assets to domestic crude producer Cenovus Energy Inc  the Houston-based company said on Thursday.",
        "date": "05042017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 2-ConocoPhillips to lay off 300 in Canada oil sands pullback "
    },
    {
        "content": "* ConocoPhillips provides update to first-quarter 2017 results based on subsequent partner disclosures and information",
        "date": "05042017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips says revised Q1 earnings to $0.6 bln  or $0.47 per share "
    },
    {
        "content": "CALGARY  Alberta  May 4 ConocoPhillips will lay off 300 Canadian workers  mostly in the country's oil capital of Calgary  after selling most of its local assets to local producer Cenovus Energy Inc  the Houston-based company said on Thursday.",
        "date": "05042017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips to lay off 300 in Canada after Cenovus deal "
    },
    {
        "content": "HOUSTON ConocoPhillips reported a surprise quarterly loss on Tuesday as operating costs came in higher than expected  sending its shares lower in afternoon trading.",
        "date": "05032017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips posts surprise loss on higher-than-expected costs "
    },
    {
        "content": "MELBOURNE  April 27 Australia's conservative government unveiled a radical plan on Thursday to restrict exports of liquefied natural gas (LNG) at times when domestic shortages push up local prices  aiming to ease soaring energy costs for local manufacturers.",
        "date": "04272017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 2-Australia plans LNG export limits to help ease local price pain "
    },
    {
        "content": "DALLAS (Reuters Breakingviews) - ConocoPhillips is stuck in a rut. Only asset sales kept the company’s earnings out of the red in the first three months of the year. The cash from such deals will help Conoco cut its high debt load  but Chief Executive Ryan Lance is still pushing ahead with buybacks and has started increasing the dividend rather than boosting investing. Such methods to buoy the stock have a limited lifespan.",
        "date": "05022017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips is wasting its oil crisis "
    },
    {
        "content": "* Shares down as much as 2.4 percent (New throughout  adds details from conference call; updates stock price  adds  byline and HOUSTON dateline)",
        "date": "05022017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 3-ConocoPhillips posts surprise loss on higher-than-expected costs "
    },
    {
        "content": "CALGARY  Alberta  April 26 Cenovus Energy Inc won about 87 percent of shareholders' votes for its board of director slate on Wednesday  below previous near-unanimous approvals  as some voters protested the company's C$17 billion ($12.6 billion) purchase of ConocoPhillips assets.",
        "date": "04262017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "UPDATE 3-Cenovus faces investor displeasure after ConocoPhillips deal "
    },
    {
        "content": "May 2 ConocoPhillips reported a quarterly profit on Tuesday  compared with a year-earlier loss  helped by a gain on its sale of oil sands and western Canadian natural gas assets to Cenovus Energy Inc.",
        "date": "05022017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "CORRECTED-UPDATE 1-ConocoPhillips posts profit on asset sale gain "
    },
    {
        "content": "* Says in Q3 will have more information on Suffield and Pelican Lake asset sales",
        "date": "04262017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-Cenovus says 'not worried' about recent complaint to regulator "
    },
    {
        "content": "* Conocophillips reports first-quarter 2017 results; on track to deliver 2017 operating plan and accelerate value proposition",
        "date": "05022017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips Q1 loss per share $0.02 excluding items "
    },
    {
        "content": "May 2 ConocoPhillips reported a quarterly profit on Tuesday  compared with a year-earlier loss  helped by a gain on its sale of oil sands and western Canadian natural gas assets to Cenovus Energy Inc.",
        "date": "05022017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips posts profit vs year-ago loss on asset sale gain "
    },
    {
        "content": "CALGARY  Alberta  April 23 Canada's Cenovus Energy Inc has said it may sell parts of the Deep Basin natural gas assets it recently bought from Houston-based ConocoPhillips  Royal Bank of Canada (RBC) analysts wrote in a research note on Sunday.",
        "date": "04232017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Cenovus may sell parts of acquired natgas assets -analysts "
    },
    {
        "content": "CALGARY  Alberta/TORONTO  April 24 As Cenovus Energy Inc prepares to release first-quarter earnings this week  investors are looking for answers about a recent C$17 billion ($12.6 billion) acquisition that wiped out about a fifth of its market value.",
        "date": "04242017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "PREVIEW-Cenovus earnings overshadowed by unpopular ConocoPhillips deal "
    },
    {
        "content": "April 25 A Cenovus Energy Inc shareholder has asked a Canadian regulator to halt the company's recent C$17 billion ($12.6 billion) purchase of some ConocoPhillips assets  saying the new stock issued to help fund the deal has diluted the value of Cenovus shares.",
        "date": "04252017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Cenovus shareholder seeks to halt purchase of ConocoPhillips assets "
    },
    {
        "content": "April 24 Stock futures pointed to a higher opening for Canada's main stock index on Monday as oil prices rose driven by expectations that OPEC will extend output cuts till the end of 2017.",
        "date": "04242017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "CANADA STOCKS-TSX futures gain as oil prices rise "
    },
    {
        "content": "TORONTO  April 25 A Cenovus Energy Inc shareholder has asked a Canadian regulator to halt the company's recent C$17 billion ($12.6 billion) purchase of some ConocoPhillips assets  saying the new stock issued to help fund the deal has diluted the value of Cenovus shares.",
        "date": "04252017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 1-Cenovus shareholder seeks to halt purchase of ConocoPhillips assets "
    },
    {
        "content": "HOUSTON  April 20 ConocoPhillips has beaten its 2017 asset sales target less than four months into the year  after shedding $30.8 billion worth of energy assets in six years.",
        "date": "04202017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "RPT-ConocoPhillips takes slow  steady route in race for oil profits "
    },
    {
        "content": "CALGARY  Alberta/TORONTO As Cenovus Energy Inc prepares to release first-quarter earnings this week  investors are looking for answers about a recent C$17 billion ($12.6 billion) acquisition that wiped out about a fifth of its market value.",
        "date": "04252017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Cenovus earnings overshadowed by unpopular ConocoPhillips deal "
    },
    {
        "content": "HOUSTON  April 20 ConocoPhillips has beaten its 2017 asset sales target less than four months into the year  after shedding $30.8 billion worth of energy assets in six years.",
        "date": "04202017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips takes slow  steady route in race for oil profits "
    },
    {
        "content": "April 13 ConocoPhillips  the largest U.S. independent oil producer  said on Thursday it would sell natural gas-heavy assets in San Juan basin to privately held Hilcorp Energy Co for about $3 billion.",
        "date": "04132017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "UPDATE 1-ConocoPhillips sells San Juan basin assets for $3 bln "
    },
    {
        "content": "* Hilcorp affiliate to acquire San Juan Basin assets from ConocoPhillips",
        "date": "04132017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-Hilcorp affiliate to acquire San Juan Basin assets from ConocoPhillips "
    },
    {
        "content": "April 13 ConocoPhillips said on Thursday it would sell natural gas-heavy assets in San Juan basin  spanning New Mexico and Southwestern Colorado  to an affiliate of privately held Hilcorp Energy Co for about $3 billion.",
        "date": "04132017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips sells San Juan basin assets for $3 bln "
    },
    {
        "content": "TORONTO  April 11 Cenovus Energy Inc will do more hedging after its acquisition of ConocoPhillips assets  the Canadian company's Chief Executive Brian Ferguson said on Tuesday as he mounted a charm offensive on investors who balked at the deal.",
        "date": "04112017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "UPDATE 2-Cenovus CEO seeks backing as bold bet and market jitters test his legacy "
    },
    {
        "content": "* Conocophillips announces agreement to sell San Juan basin assets",
        "date": "04132017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-Conocophillips announces agreement to sell San Juan basin assets "
    },
    {
        "content": "TORONTO  April 11 Cenovus Energy Inc has 75 percent of financing in place for its C$17.7 billion ($13.3 billion) acquisition of ConocoPhillips' oil and gas assets  Cenovus Chief Executive Brian Ferguson said on Tuesday.",
        "date": "04112017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Cenovus CEO says investors understand 'strategic rationale' for deal "
    },
    {
        "content": "* north atlantic drilling announces contract awards for the West Wlara and the West Linus",
        "date": "04112017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-Seadrill: North Atlantic drilling wins ConocoPhillips contract "
    },
    {
        "content": "CHIBA  April 4 Exports of liquefied natural gas (LNG) from the United States will slow as domestic gas demand there grows and available supply there is used up  said ConocoPhillips CEO Ryan Lance at a gas industry conference on Tuesday in Chiba  Japan.",
        "date": "04042017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "U.S. LNG exports will slow as domestic gas demand grows -ConocoPhillips CEO "
    },
    {
        "content": "* Cenovus Energy Inc - Offering is part of co's previously announced financing plan to fund purchase of assets in Western Canada from ConocoPhillips",
        "date": "04042017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-Cenovus prices $2.9 billion offering of senior notes "
    },
    {
        "content": "CALGARY  Alberta/NEW YORK Two oil sands producers in northern Alberta have cut production at their facilities due to a shortage of synthetic crude  market sources said on Thursday  causing Canadian and U.S. crude prices to surge to multi-year highs.",
        "date": "04062017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Nexen joins ConocoPhillips in cutting oil sands output: sources "
    },
    {
        "content": "CALGARY  Alberta  April 6 ConocoPhillips has cut output from its Surmont oil sands project by about 40 percent because of shortages of synthetic crude in northern Alberta following a fire and shutdown at the Syncrude plant  two market sources said on Thursday.",
        "date": "04062017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips cuts Surmont oil sands output by around 40 pct - sources "
    },
    {
        "content": "CALGARY  Alberta Cenovus Energy shares had their biggest one-day percentage fall ever on Thursday as investors balked at the company's C$17.7 billion ($13.3 billion) cash and stock deal to buy oil sands and natural gas assets from ConocoPhillips.",
        "date": "03312017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Cenovus shares slump on $13 billion deal to buy Conoco's assets "
    },
    {
        "content": "* CEO Ryan Lance's 2016 total compensation was $19.2 million versus $21.3 million in 2015 - SEC filing",
        "date": "04032017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-Conocophillips CEO Ryan Lance's 2016 total compensation was $19.2 mln "
    },
    {
        "content": "* ConocoPhillips announces sale of Foster Creek Christina Lake partnership interest and Western Canada deep basin gas assets to Cenovus for $13.3 billion; significant transaction accelerates value proposition",
        "date": "03292017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips to sell Foster Creek Christina Lake Partnership interest  Western Canada Deep Basin Gas assets to Cenovus for $13.3 bln "
    },
    {
        "content": "CALGARY  Alberta  March 30 Cenovus Energy shares had their biggest one-day percentage fall ever on Thursday as investors balked at the company's C$17.7 billion ($13.3 billion) cash and stock deal to buy oil sands and natural gas assets from ConocoPhillips.",
        "date": "03302017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "UPDATE 4-Cenovus shares slump on $13 bln deal to buy Conoco's assets "
    },
    {
        "content": "* Cenovus announces $3.0 billion bought-deal offering of common shares",
        "date": "03292017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-Cenovus announces $3 bln bought-deal offering of common shares "
    },
    {
        "content": "* Cenovus Energy Inc - agreed to acquire ConocoPhillips' 50% interest in FCCL partnership",
        "date": "03292017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-Cenovus to buy ConocoPhillips' 50 pct interest in FCCL partnership for $17.7 bln "
    },
    {
        "content": "March 29 Canada's Cenovus Energy Inc said it would buy ConocoPhillips' 50 percent stake in an oilsands venture owned by the two companies  and some oil and gas assets held by the U.S. company in Alberta and British Columbia for $17.7 billion.",
        "date": "03292017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Cenovus to buy oil and gas assets from ConocoPhillips for $17.7 bln "
    },
    {
        "content": "TORONTO  March 30 Canada's main stock index pulled back from a one-month high on Thursday as deal-related news pressured shares of Cenovus Energy Inc and Canadian Imperial Bank of Commerce.",
        "date": "03302017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "CANADA STOCKS-TSX falls as deal news pressures Cenovus  CIBC "
    },
    {
        "content": "CALGARY  Alberta  March 30 Cenovus Energy shares tumbled more than 11 percent on Thursday after the Canadian company agreed to buy oil sands and natural gas assets from ConocoPhillips for C$17.7 billion ($13.32 billion). Cenovus shares were last trading at C$15.44 on the Toronto Stock Exchange  down 11.5 percent on the day. ($1 = 1.3289 Canadian dollars) (Reporting by Nia Williams)",
        "date": "03302017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "CORRECTED-Cenovus shares slump after C$17.7 billion ConocoPhillips deal "
    },
    {
        "content": "* Canada energy minister  pressed on Cenovus-Conocophillips deal  says \"these are market decisions\"",
        "date": "03302017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-Canada energy minister says Cenovus-Conocophillips deal is a market decision "
    },
    {
        "content": "BOSTON  March 23 President Donald Trump’s White House has said his plans to slash environmental regulations will trigger a new energy boom and help the United States drill its way to independence from foreign oil.",
        "date": "03282017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "REFILE-INSIGHT-As Trump targets energy rules  oil companies downplay their impact "
    },
    {
        "content": "CALGARY  Alberta ConocoPhillips  on Wednesday agreed to sell oil sands and western Canadian natural gas assets to Cenovus Energy Inc  for C$17.7 billion ($13.3 billion)  making it the latest international oil major to pull back from a region where high costs and low crude prices have made it hard for large companies to make an acceptable return.",
        "date": "03302017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips sells oil and gas assets to Cenovus for $13.3 billion "
    },
    {
        "content": "NEW YORK  March 21 A New York energy investor was sentenced to five years and 10 months in prison on Tuesday after he pleaded guilty to engaging in a years-long scheme to avoid more than $45 million in income and other taxes.",
        "date": "03212017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "N.Y. energy investor gets 5 years  10 months for $45 mln tax scheme "
    },
    {
        "content": "CALGARY  Alberta ConocoPhillips has revised down over a billion barrels of oil sands reserves because of low global crude prices  a company filing showed on Tuesday  the latest sign that some of Canada's vast hydrocarbon potential may be left untapped.",
        "date": "02222017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips revises down over one billion barrels of oil sands reserves "
    },
    {
        "content": "CALGARY  Alberta  Feb 21 ConocoPhillips has revised down over a billion barrels of oil sands reserves because of low global crude prices  a company filing showed on Tuesday  the latest sign that some of Canada's vast hydrocarbon potential may be left untapped.",
        "date": "02222017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 2-ConocoPhillips revises down over 1 bln bbls of oil sands reserves "
    },
    {
        "content": "CALGARY  Alberta  Feb 21 ConocoPhillips Corp  has revised down over a billion barrels of oil sands reserves because of low global crude prices  a company filing showed on Tuesday  the latest sign that some of Canada's vast hydrocarbon potential may be left untapped.",
        "date": "02212017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips revises down over 1 bln bbls of oil sands reserves "
    },
    {
        "content": "TORONTO/CALGARY ConocoPhillips  has decided to sell several of its Canadian conventional natural gas assets in a deal that could fetch as much as $2 billion as the biggest U.S. independent oil producer pulls back further from Canada  people familiar with the matter told Reuters.",
        "date": "02162017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Exclusive: ConocoPhillips puts Canadian natgas assets on the block - sources "
    },
    {
        "content": "A World Bank panel has ordered Ecuador to pay $380 million in damages to a subsidiary of U.S.-based ConocoPhillips for unlawfully expropriating the company's oil investments.",
        "date": "02082017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Ecuador ordered to pay ConocoPhillips $380 million in damages "
    },
    {
        "content": "Feb 8 A World Bank panel has ordered Ecuador to pay $380 million in damages to a subsidiary of U.S.-based ConocoPhillips for unlawfully expropriating the company's oil investments.",
        "date": "02082017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Ecuador ordered to pay ConocoPhillips $380 mln in damages "
    },
    {
        "content": "* ConocoPhillips says wholly owned unit  Burlington Resources Inc  received arbitration award of $380 million from International Arbitration Tribunal",
        "date": "02082017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips says wholly owned unit  Burlington Resources Inc  received arbitration award of $380 million from International Arbitration Tribunal "
    },
    {
        "content": "ConocoPhillips   the largest U.S. independent oil producer  reported a smaller-than-expected quarterly loss on Thursday  helped by higher crude prices and lower costs.",
        "date": "02022017",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips loss smaller than expected on higher oil price "
    },
    {
        "content": "Feb 2 ConocoPhillips  the largest U.S. independent oil producer  reported a smaller-than-expected quarterly loss on Thursday  helped by higher crude prices and lower costs.",
        "date": "02022017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 2-ConocoPhillips loss smaller than expected on higher oil price "
    },
    {
        "content": "* Conocophillips reports fourth-quarter and full-year 2016 results; on track to deliver 2017 operating plan and strategic priorities",
        "date": "02022017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-Conocophillips Q4 adjusted net loss of $0.26 per share "
    },
    {
        "content": "Jan 31 ConocoPhillips  the largest U.S. independent oil producer  raised its quarterly dividend by 6 percent to 26.5 cents per share.",
        "date": "01312017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "U.S. oil producer ConocoPhillips raises quarterly dividend "
    },
    {
        "content": "Feb 2 ConocoPhillips  the largest U.S. independent oil producer  posted a much smaller quarterly loss from a year earlier  when it recorded a $2.7 billion charge.",
        "date": "02022017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips reports smaller quarterly loss "
    },
    {
        "content": "* Conocophillips announces 6 percent increase in quarterly dividend",
        "date": "01312017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-Conocophillips says increases quarterly dividend by 6 pct to $0.265per share "
    },
    {
        "content": "* Graphic on oil and gas M&A in 2016 - http://tmsnrt.rs/2jv9If6",
        "date": "01192017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Big Oil back on the acquisition trail as outlook brightens "
    },
    {
        "content": "SYDNEY Woodside Petroleum Chief Executive Peter Coleman said there's little need for more mergers and acquisitions by Australia's biggest independent oil and gas producer as it works on developing a handful of new projects at home and abroad.",
        "date": "01192017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Woodside CEO sees no need for M&A  plenty of growth in pipeline "
    },
    {
        "content": "SYDNEY  Jan 19 Woodside Petroleum Chief Executive Peter Coleman said there's little need for more mergers and acquisitions by Australia's biggest independent oil and gas producer as it works on developing a handful of new projects at home and abroad.",
        "date": "01192017",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 2-Woodside CEO sees no need for M&A  plenty of growth in pipeline "
    },
    {
        "content": "OSLO  Nov 25 Norway's oil and energy ministry has approved a hike in the 2016 oil output quota of the North Sea Troll field to 46.5 million barrels from 41.7 million  giving it the highest output level since 2009  document obtained by Reuters showed on Friday.",
        "date": "11252016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Norway approves hike in Troll's 2016 oil output quota-letter "
    },
    {
        "content": "Nov 16 Norway state oil firm Petoro's CEO  Grethe Moen  told an industry conference in Stavanger  Norway  on Wednesday:",
        "date": "11162016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-Norway's Petoro expects concept for Troll phase 3 development in 2017 "
    },
    {
        "content": "Nov 10 ConocoPhillips  the largest U.S. independent oil producer  will sell up to $8 billion in natural gas assets and trim its capital budget by 4 percent next year to provide funds to bolster operations  executives said on Thursday.",
        "date": "11102016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "RPT-UPDATE 4-ConocoPhillips aims to sell up to $8 billion in gas assets "
    },
    {
        "content": "ConocoPhillips   the largest U.S. independent oil producer  will sell up to $8 billion in natural gas assets and trim its capital budget by 4 percent next year to provide funds to bolster operations  executives said on Thursday.",
        "date": "11102016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips aims to sell up to $8 billion in gas assets "
    },
    {
        "content": "Nov 10 ConocoPhillips  the largest U.S. independent oil producer  will sell up to $8 billion in natural gas assets and trim its capital budget by 4 percent next year to provide funds to bolster operations  executives said on Thursday.",
        "date": "11102016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 4-ConocoPhillips aims to sell up to $8 billion in gas assets "
    },
    {
        "content": "ConocoPhillips   the largest U.S. independent oil producer  said it was looking to raise $5 billion to $8 billion from the sale of assets  particularly natural gas-producing operations in North America.",
        "date": "11102016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips to raise $5 billion - $8 billion from asset sales "
    },
    {
        "content": "* ConocoPhillips - Announcing $3 billion share repurchase program",
        "date": "11102016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips announces $3 bln share repurchase program "
    },
    {
        "content": "Nov 10 ConocoPhillips  the largest U.S. independent oil producer  said it was looking to raise $5 billion to $8 billion from the sale of assets  particularly natural gas-producing operations in North America.",
        "date": "11102016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips to raise $5 bln-$8 bln from asset sales "
    },
    {
        "content": "MELBOURNE ConocoPhillips  operator of the Australia Pacific liquefied natural gas (APLNG) plant  said it expects the project to reach its full capacity of 9 million tonnes a year in the June quarter of 2017.",
        "date": "10272016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips sees APLNG hitting full tilt in second quarter of 2017 "
    },
    {
        "content": "MELBOURNE  Oct 28 ConocoPhillips  operator of the Australia Pacific liquefied natural gas (APLNG) plant  said it expects the project to reach its full capacity of 9 million tonnes a year in the June quarter of 2017.",
        "date": "10272016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips sees APLNG hitting full tilt in Q2 2017 "
    },
    {
        "content": "ConocoPhillips  reported a smaller-than-expected quarterly loss  helped by lower expenses  and cut its capital budget forecast for the year.",
        "date": "10272016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips posts smaller loss  cuts 2016 capex forecast "
    },
    {
        "content": "Oct 27 ConocoPhillips reported a smaller-than-expected quarterly loss  helped by lower expenses  and cut its capital budget forecast for the year.",
        "date": "10272016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 1-ConocoPhillips posts smaller loss  cuts 2016 capex forecast "
    },
    {
        "content": "* Conocophillips reports third-quarter 2016 results; strong operational momentum and improved 2016 outlook",
        "date": "10272016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-Conocophillips Q3 loss per share $0.84 "
    },
    {
        "content": "Oct 27 U.S. oil producer ConocoPhillips  reported a smaller quarterly loss as it cut production and operating expenses.",
        "date": "10272016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips posts smaller Q3 loss on cost  production cuts "
    },
    {
        "content": "WASHINGTON  Oct 7 (IFR) - The fate of a debt swap from PDVSA was thrown in doubt on Friday after the Venezuelan oil company extended the deadline for the transaction and ConocoPhillips sued over the use of Citgo shares as collateral.",
        "date": "10072016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "PDVSA bonds drop on lawsuit  exchange "
    },
    {
        "content": "* Sets quarterly dividend of $0.25 per share  Source text for Eikon:  Further company coverage:",
        "date": "10062016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-Conocophillips sets quarterly dividend of $0.25 per share "
    },
    {
        "content": "Oct 7 Subsidiaries of U.S. oil company ConocoPhillips has sued Venezuelan state oil company PDVSA in a Delaware court  according to a court filing  accusing it of fraudulent operations involving its U.S. subsidiary Citgo.",
        "date": "10072016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips sues Venezuela's PDVSA  calls bond swap 'fraudulent' "
    },
    {
        "content": "Oct 7 Subsidiaries of U.S. oil company ConocoPhillips have sued Venezuelan state oil company PDVSA in Delaware  according to a court filing  accusing it of fraudulent operations involving its U.S. subsidiary Citgo.",
        "date": "10072016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 3-ConocoPhillips sues Venezuela's PDVSA  calls bond swap 'fraudulent' "
    },
    {
        "content": "Sept 22 ConocoPhillips' Alaskan unit and the State of Alaska have entered into a memorandum of understanding to form a joint venture to market liquefied natural gas from Alaska to global markets.",
        "date": "09222016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips  Alaska to form JV for LNG marketing "
    },
    {
        "content": "JAKARTA Indonesia's PT Medco Energi Tbk said on Monday it had agreed to acquire ConocoPhillips' entire 40 percent interest in an oil and gas production sharing block that the U.S. firm operates in the Natuna Sea.",
        "date": "09192016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Indonesia's Medco agrees to acquire ConocoPhillips' 40 percent stake in Natuna block "
    },
    {
        "content": "JAKARTA  Sept 19 Indonesia's PT Medco Energi Tbk  said on Monday it had agreed to acquire ConocoPhillips' entire 40 percent interest in an oil and gas production sharing block that the U.S. firm operates in the Natuna Sea.",
        "date": "09192016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Indonesia's Medco agrees to acquire ConocoPhillips' 40 pct stake in Natuna block "
    },
    {
        "content": "JAKARTA Indonesia's PT Medco Energi Tbk  is close to acquiring ConocoPhillips'  entire 40 percent interest in an oil and gas production sharing block that the U.S. firm operates in the Natuna Sea  three people familiar with the matter said.",
        "date": "09162016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Indonesia's Medco close to buying Conoco's stake in Natuna oil  gas block: sources "
    },
    {
        "content": "JAKARTA  Sept 16 Indonesia's PT Medco Energi Tbk  is close to acquiring ConocoPhillips' entire 40 percent interest in an oil and gas production sharing block that the U.S. firm operates in the Natuna Sea  three people familiar with the matter said.",
        "date": "09162016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Indonesia's Medco close to buying Conoco's stake in Natuna oil  gas block -sources "
    },
    {
        "content": "* On September 2  received notice of a termination for convenience from ConocoPhillips regarding Rowan Gorilla Vi",
        "date": "09072016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-Rowan companies reduces FY 2016 capex guidance to $140 mln-$150 mln "
    },
    {
        "content": "Aug 29 The CEOs of Shell and ConocoPhillips made the following comments to the ONS oil conference in Stavanger  Norway  on Monday:",
        "date": "08292016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-Shell CEO sees oil demand up by 1-1.5 mln barrels/day per year "
    },
    {
        "content": "* Conocophillips ceo says believes oil market oversupply will extend into 2017",
        "date": "08292016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips CEO says oil market oversupply to extend into 2017 "
    },
    {
        "content": "MELBOURNE  Aug 23 ConocoPhillips' plan to sell its stake in an oil find off Senegal to Woodside Petroleum hit a speed-bump on Tuesday as a junior partner attempted to buy time to pre-empt the deal at the same time it announced an increase in the size of the field.",
        "date": "08232016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips hits snag in Senegal deepwater stake sale to Woodside "
    },
    {
        "content": "MELBOURNE  Aug 23 ConocoPhillips' plan to sell its stake in an oil find off Senegal to Woodside Petroleum hit a speed-bump on Tuesday as a junior partner attempted to buy time to pre-empt the deal at the same time it announced an increase in the size of the field.",
        "date": "08232016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 1-ConocoPhillips hits snag in Senegal deepwater stake sale to Woodside "
    },
    {
        "content": "* Chief Executive Ryan Lance says flat production is not a goal  but wants to at least maintain existing output",
        "date": "07282016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips Q2 2016 earnings conference call "
    },
    {
        "content": "* Early termination agreement for the deepwater unit Maersk Valiant has been signed by Maersk Drilling  ConocoPhillips and Marathon Oil with effect from mid-September 2016",
        "date": "07282016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips  Marathon Oil cancel contract for deepwater drill unit Maersk Valiant "
    },
    {
        "content": "U.S. oil producer ConocoPhillips reported a bigger-than-expected quarterly loss and cut its 2016 budget for the third time this year amid a crude oil slump that has lasted for two years.",
        "date": "07282016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips cuts 2016 budget again amid oil slump "
    },
    {
        "content": "July 28 U.S. oil producer ConocoPhillips  reported a bigger-than-expected quarterly loss and cut its 2016 budget for the third time this year amid a crude oil slump that has lasted for two years.",
        "date": "07282016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 1-ConocoPhillips cuts 2016 budget again amid oil slump "
    },
    {
        "content": "* Increasing its full-year 2016 production guidance to 1 540 to 1 570 mboed  reflecting strong year-to-date performance",
        "date": "07282016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips reports Q2 loss per share $0.86 "
    },
    {
        "content": "July 28 U.S. oil producer ConocoPhillips  reported a bigger quarterly loss as crude prices stayed low  and the company further lowered its capital budget.",
        "date": "07282016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Oil company ConocoPhillips reports bigger quarterly loss "
    },
    {
        "content": "* ConocoPhillips says it's planning to shed another 1 000 jobs  about 6 percent of its global workforce - Fuelfix  Source text  - (http://bit.ly/29X0Et7) Further company coverage:    (Bengaluru Newsroom)",
        "date": "07212016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips says planning to shed another 1 000 jobs  about 6 pct of global workforce - Fuelfix "
    },
    {
        "content": "HOUSTON  July 18 British oil company BP Plc  has chartered a foreign-flagged vessel to transport Alaskan crude  the company said on Monday  the latest sign that producers of Alaskan North Slope  or ANS  crude are eyeing new markets.",
        "date": "07182016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 2-BP charters foreign-flagged vessel to transport ANS crude "
    },
    {
        "content": "* Announces intended sale of exploration blocks offshore senegal",
        "date": "07132016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-Conocophillips to sell its 35 percent interest in three exploration blocks offshore Senegal "
    },
    {
        "content": "MELBOURNE  July 14 Australia's Woodside Petroleum has agreed to buy ConocoPhillips'  deepwater stakes off Senegal  including one of the world's most promising recent oil finds  for $350 million.",
        "date": "07132016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "CORRECTED-Woodside to buy ConocoPhillips' Senegal holdings for $350 mln "
    },
    {
        "content": "* Sets quarterly dividend of $0.25 per share  Source text for Eikon:  Further company coverage:",
        "date": "07132016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips sets quarterly dividend of $0.25/shr "
    },
    {
        "content": "NEW YORK  June 27 A New York energy investor pleaded guilty on Monday to charges that he engaged in a years-long scheme to avoid paying more than $45 million in income and other taxes stemming in part from his sale of an oil company.",
        "date": "06272016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "New York energy investor pleads guilty to $45 million tax scheme "
    },
    {
        "content": "A ConocoPhillips  pipeline has leaked nearly 2 400 barrels of condensate  an ultra-light form of oil  within an endangered caribou and grizzly bear range in west-central Alberta  the company said on Tuesday.",
        "date": "06142016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips pipe spills light oil near Alberta caribou range "
    },
    {
        "content": "June 14 A ConocoPhillips pipeline has leaked nearly 2 400 barrels of condensate  an ultra-light form of oil  within an endangered caribou and grizzly bear range in west-central Alberta  the company said on Tuesday.",
        "date": "06142016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 2-ConocoPhillips pipe spills light oil near Alberta caribou range "
    },
    {
        "content": "June 14 The Alberta Energy Regulator asked ConocoPhillips's Canada arm to immediately contain a condensate leak caused by a pipeline failure near Grande Cache  Alberta.",
        "date": "06142016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Alberta regulator asks ConocoPhillips to contain condensate leak "
    },
    {
        "content": "CALGARY  Alberta  June 15 ConocoPhillips  said on Wednesday that 73 percent of wells at its Surmont oil sands project in northern Alberta are back in production or injecting steam  with no unexpected complications or issues affecting the effort.",
        "date": "06152016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "CORRECTED-ConocoPhillips says 73 percent of wells at Surmont project online "
    },
    {
        "content": "SANTIAGO  June 13 Chilean state oil company ENAP  has signed a deal with ConocoPhillips to explore and eventually exploit gas deposits in the nation's remote southern Magallanes region  a source familiar with the agreement confirmed on Monday.",
        "date": "06132016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips  ENAP to explore for gas in southern Chile "
    },
    {
        "content": "CALGARY  Alberta  June 15 ConocoPhillips  said on Wednesday that 73 percent of wells at its Surmont oil sands project in northern Alberta are back in production or injecting steam  with no unexpected complications or issues affecting the effort.",
        "date": "06152016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 1-ConocoPhillips says 73 percent of wells at Surmont project online "
    },
    {
        "content": "CALGARY  Alberta ConocoPhillips  has 25 percent of wells activated at its 60 000 barrels per day Surmont oil sands project  which had been shut down as a precaution due to a massive wildfire in northern Alberta  a company executive said on Tuesday.",
        "date": "06082016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips has 25 percent of Surmont wells running after wildfire "
    },
    {
        "content": "CALGARY  Alberta  June 7 ConocoPhillips  has restarted production at its Surmont oil sands project  which had been shut down as a precaution due to a massive wildfire in northern Alberta  Conoco said in a statement on Tuesday.",
        "date": "06072016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips restarts production at Surmont oil sands project "
    },
    {
        "content": "NEW YORK  May 23 A New York energy investor has been indicted for engaging in a multiyear scheme to evade paying over $45 million in taxes in connection with the sale of an oil company and the purchase of paintings by European artists  U.S. prosecutors said on Monday.",
        "date": "05232016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "New York energy investor indicted for $45 million tax scheme "
    },
    {
        "content": "HOUSTON  May 10 ConocoPhillips has looked at using derivatives to lock in oil prices in a volatile market  including so-called floors to guard against any new price drops  but Chief Executive Ryan Lance said on Tuesday the company is too big to hedge all of its output.",
        "date": "05102016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Conoco CEO looks at hedging options but says market limited "
    },
    {
        "content": "* ConocoPhillips downgraded to 'A-' from 'A'  outlook negative; short-term and unsecured debt ratings also lowered",
        "date": "04292016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-S&P downgrades ConocoPhillips to 'A-' from 'A'; outlook negative "
    },
    {
        "content": "* Chief Executive Ryan Lance says expects decline rate to 'moderate' over next few years",
        "date": "04282016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips says no set oil price at which would add rigs "
    },
    {
        "content": "ConocoPhillips  the largest U.S. independent oil company  on Thursday reported a quarterly loss after a year-earlier profit and slashed its 2016 budget for the second time this year  its latest response to the slump in crude prices.",
        "date": "04282016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips swings to loss and slashes budget  again "
    },
    {
        "content": "April 28 ConocoPhillips  the largest U.S. independent oil company  on Thursday reported a quarterly loss after a year-earlier profit and slashed its 2016 budget for the second time this year  its latest response to the slump in crude prices.",
        "date": "04282016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 2-ConocoPhillips swings to loss and slashes budget  again "
    },
    {
        "content": "April 28 ConocoPhillips  the largest U.S. independent oil company  reported a quarterly loss  compared with a year-earlier profit  and further lowered its 2016 budget as the slump in crude prices sapped profitability.",
        "date": "04282016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips posts quarterly loss  cuts 2016 budget again "
    },
    {
        "content": "By David Randall     NEW YORK  April 18 After several false starts over the last two years  U.S. fund managers are betting that energy stocks have finally hit bottom.      Firms including T. Rowe Price  Fidelity  and American Funds have been adding shares of exploration and production companies that they say have the most to gain from oil prices stabilizing. The price of oil fell from $115 a barrel to $27.88 between June 2014 and January of this year  yet is up more than 50 percent s",
        "date": "04182016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Fund managers  convinced oil bottom is here  buy up energy stocks "
    },
    {
        "content": "* Says ceo r.m. Lance's fy 2015 total compensation $21.3 million versus $27.6 million in fy 2014 - sec filing",
        "date": "03282016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-Conocophillips CEO Lance's 2015 total compensation was $21.3 mln "
    },
    {
        "content": "* On March 18  2016  ConocoPhillips  entered into a term loan agreement",
        "date": "03212016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips enters into term loan agreement of $1.6 bln "
    },
    {
        "content": "LAUNCESTON  Australia  Feb 10 - When the going gets tough  the tough ask for tax relief. If you are looking for a sign that the end game of the commodity downturn is getting closer  witness the clamour for more support from Australia's embattled resources sector.",
        "date": "02112016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "CORRECTED-RPT-COLUMN-Australia's tough miners want government help; shouldn't get it: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  Feb 10 - When the going gets tough  the tough ask for tax relief. If you are looking for a sign that the end game of the commodity downturn is getting closer  witness the clamour for more support from Australia's embattled resources sector.",
        "date": "02112016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "CORRECTED-COLUMN-Australia's tough miners want government help; shouldn't get it: Russell "
    },
    {
        "content": "Feb 9 The U.S. Department of Energy approved ConocoPhillips' application to export about 40 billion cubic feet of natural gas from its Kenai liquefied natural gas export terminal in Alaska over the next two years starting Feb. 19.",
        "date": "02102016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "U.S. approves ConocoPhillips LNG exports from Alaska "
    },
    {
        "content": "* Says \u007fcontract value depends on how much maintenance and modifications work is undertaken over next five years and could range between nok 1 billion and nok 3 billion in that period",
        "date": "02012016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-Aker Solutions wins two NOK 1-3 BLN MMO contracts from ConocoPhillips "
    },
    {
        "content": "ConocoPhillips  slashed its quarterly dividend for the first time in at least 25 years and further lowered its capital budget for 2016 as a relentless fall in crude oil prices took its toll on the largest U.S. independent oil company.",
        "date": "02042016",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Conoco cuts dividend for first time in 25 years on crude crash "
    },
    {
        "content": "* ConocoPhillips exec says the company would look to put more rigs back to work in lower 48 in 2017",
        "date": "02042016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-Conoco is not comfortable relying heavily on debt financing to fund cash shortfalls-CFO "
    },
    {
        "content": "* Shares fall 4 pct in morning trading   (Adds details on first dividend cut in 25 years)",
        "date": "02042016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 3-Conoco cuts dividend for first time in 25 years on crude crash "
    },
    {
        "content": "Feb 4 ConocoPhillips reported a much bigger quarterly loss  hurt by impairment charges  and slashed its dividend as the  relentless fall in crude oil prices takes a toll on the largest U.S. independent oil and gas company.",
        "date": "02042016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips posts bigger loss  slashes dividend "
    },
    {
        "content": "LAUNCESTON  Australia  Jan 18 - In contrast to the carnage in crude oil markets  liquefied natural gas (LNG) prices in Asia have enjoyed relative stability for the past three months  but it's unlikely the calm will persist much longer.",
        "date": "01182016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "COLUMN-LNG looks poised to follow crude oil's plunge: Russell "
    },
    {
        "content": "Jan 4 Oil explorer Cairn Energy Plc said it successfully flow-tested an appraisal well situated around 100 kilometres off the coast of Senegal.",
        "date": "01042016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Cairn Energy successfully flow-tests Senegal appraisal well "
    },
    {
        "content": "** London-listed oil explorer Cairn Energy up c.6 pct & top Stoxx small market gainer after oil explorer successfully flow-tests appraisal well off the coast of Senegal",
        "date": "01042016",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BUZZ-Cairn Energy: top gainer on positive Senegal appraisal "
    },
    {
        "content": "CIREBON  Indonesia  Dec 19 Indonesia's upstream oil and gas regulator said state energy firm Pertamina is interested in buying the stakes in the South Natuna Sea Block B that ConocoPhillips and Chevron plan to sell  its spokesman said on Saturday.",
        "date": "12202015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "REFILE-Indonesia Pertamina shows interests in buying shares in Natuna oil and gas block - regulator spokesmman "
    },
    {
        "content": "CIREBON  Indonesia  Dec 19 Indonesia's upstream oil and gas regulator said state energy firm Pertamina is interested in buying the stakes in the South Natuna Sea Block B that ConocoPhillips and Chevron plans to sell  its spokesman said on Saturday.",
        "date": "12192015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Indonesia Pertamina in buying shares in Natuna oil and gas block - regulator spokesmman "
    },
    {
        "content": "U.S. oil and natural gas producer ConocoPhillips has sold its 50 percent stake in a joint venture with Russian state oil company Rosneft  a ConocoPhillips spokesman said.",
        "date": "12222015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips sells stake in JV with Rosneft  exits Russia "
    },
    {
        "content": "Dec 22 U.S. oil and natural gas producer ConocoPhillips has sold its 50 percent stake in a joint venture with Russian state oil company Rosneft  a ConocoPhillips spokesman said.",
        "date": "12222015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 1-ConocoPhillips sells stake in JV with Rosneft  exits Russia "
    },
    {
        "content": "Dec 22 U.S. oil and natural gas producer ConocoPhillips sold its stake in a joint venture with Russian state oil company Rosneft  exiting the country after more than 25 years  the Financial Times reported.",
        "date": "12222015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips sells stake in JV with Rosneft  exits Russia-FT "
    },
    {
        "content": "JAKARTA U.S.-listed energy giants ConocoPhillips  and Chevron Corp  plan to sell their interests in a key oil and gas block in Indonesia and the government has received written requests for the same  an energy ministry official said.",
        "date": "12112015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips  Chevron seek to sell stakes in Indonesia oil and gas block "
    },
    {
        "content": "JAKARTA  Dec 11 U.S.-listed energy giants ConocoPhillips and Chevron Corp plan to sell their interests in a key oil and gas block in Indonesia and the government has received written requests for the same  an energy ministry official said.",
        "date": "12112015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 1-ConocoPhillips  Chevron seek to sell stakes in Indonesia oil and gas block "
    },
    {
        "content": "ConocoPhillips   the largest U.S. independent oil company  plans to reduce capital spending by 25 percent next year and sell more non-core assets as it looks to shore up its finances amid a prolonged slump in oil prices.",
        "date": "12102015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips to lower spending  sell assets amid oil slump "
    },
    {
        "content": "JAKARTA  Dec 11 Indonesia has received written requests from U.S.-listed energy giants ConocoPhillips  and Chevron Corp to sell their interests in the South Natuna Sea Block B oil and gas block  an energy ministry official said on Friday.",
        "date": "12112015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips  Chevron seek to sell stakes in Indonesia oil and gas block -energy ministry official "
    },
    {
        "content": "* Sees 2016 opex of $7.7 bln vs expected $8.2 bln in 2015   (Adds Breakingviews link)",
        "date": "12102015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 3-ConocoPhillips to lower spending  sell assets amid oil slump "
    },
    {
        "content": "Dec 10 ConocoPhillips  the largest U.S. independent oil company  said on Thursday it expects its 2016 capital expenditure to be 25 percent lower than this year's estimated budget  as it responds to a slump in oil prices.",
        "date": "12102015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips expects 25 pct lower capital spending in 2016 "
    },
    {
        "content": "DOHA  Dec 7 ConocoPhillips Chief Executive Officer Ryan Lance expects crude prices to recover in 2016 as investment in new oil output facilities falter  he told reporters in Qatar's capital Doha on Monday.",
        "date": "12072015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips CEO says expects crude oil market to rebalance in 2016 "
    },
    {
        "content": "* \u007fwood Group secures new ConocoPhillips contract in Timor-Leste and Australia\u007f  Source text for Eikon:  Further company coverage:",
        "date": "12082015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "BRIEF-John Wood secures new ConocoPhillips contract "
    },
    {
        "content": "BOGOTA  Dec 3 Two oil companies operating in Colombia will expand their exploration contracts to non-traditional oil deposits  the government said on Thursday  as the South American country looked to increase its reserves.",
        "date": "12032015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips  CNE Oil and Gas expand Colombian exploration contracts "
    },
    {
        "content": "BEIJING  Oct 30 A Chinese court has ordered ConocoPhillips to pay compensation to nearly two dozen aquaculture farmers who said their livelihoods were hurt by oil spills off China's northeastern coast in 2011.",
        "date": "10302015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Chinese court orders ConocoPhillips to pay $266 000 over 2011 oil spills "
    },
    {
        "content": "Oct 29 ConocoPhillips reported a third-quarter loss on Thursday  and the largest U.S. independent oil company lowered its 2015 spending target in response to the lingering slump in crude prices.",
        "date": "10292015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "UPDATE 3-Conoco posts quarterly loss  cuts 2015 spending target "
    },
    {
        "content": "* Conocophillips executive says the company's strategic intent is to exit deepwater exploration  Source text for Eikon:  Further company coverage:    (Reporting by Anna Driver)",
        "date": "10292015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-Conoco's strategic intent is to exit deepwater exploration-exec "
    },
    {
        "content": "Oct 29 ConocoPhillips  the largest U.S. independent oil company  reported a quarterly loss  compared with a year-earlier profit  as the slump in crude prices sapped profitability.",
        "date": "10292015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips posts quarterly loss as crude prices crash "
    },
    {
        "content": "BOSTON  Oct 22 The head of U.S. oil company ConocoPhillips on Thursday renewed a call for the Obama administration to lift a ban on crude exports to help revive the struggling domestic energy industry  saying the move was \"number one on my wish list.\"",
        "date": "10222015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Conoco CEO: Lifting U.S. oil export ban 'No. 1 on my wish list' "
    },
    {
        "content": "HOUSTON ConocoPhillips   the largest U.S. independent oil and gas company  on Tuesday said its board amended its bylaws to allow minority shareholders to nominate directors.",
        "date": "10132015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Conoco changes bylaws to allow proxy access: filing "
    },
    {
        "content": "HOUSTON  Oct 13 ConocoPhillips  the largest U.S. independent oil and gas company  on Tuesday said its board amended its bylaws to allow minority shareholders to nominate directors.",
        "date": "10132015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 1-Conoco changes bylaws to allow proxy access -filing "
    },
    {
        "content": "BOSTON  Sept 30 One-in-four U.S. large-cap mutual funds have increased their stakes in energy companies this year and many have suffered heavier losses than their peers as a result of ill-timed bets.",
        "date": "09302015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "RPT-U.S. mutual funds that bet bigger on energy sector get burned "
    },
    {
        "content": "* Australia Pacific LNG still seen profitable   (Adds CEO  analyst comments)",
        "date": "09302015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 1-Australia's Origin seeks to raise $1.8 bln to ease oil price pain "
    },
    {
        "content": "BOSTON  Sept 30 One-in-four U.S. large-cap mutual funds have increased their stakes in energy companies this year and many have suffered heavier losses than their peers as a result of ill-timed bets.",
        "date": "09302015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "U.S. mutual funds that bet bigger on energy sector get burned "
    },
    {
        "content": "HOUSTON A federal court in New York has upheld a ruling granting U.S. oil and gas company ConocoPhillips sole ownership of a unit at the Sweeny  Texas  refinery  in a long-running dispute over the asset with Venezuela's PDVSA.",
        "date": "09092015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "U.S. judge upholds Conoco as sole owner of coker at Sweeny  Texas refinery "
    },
    {
        "content": "HOUSTON A federal court in New York has upheld a ruling granting U.S. oil and gas company ConocoPhillips sole ownership of a unit at the Sweeny  Texas refinery in a long-running dispute over the asset with Venezuela's PDVSA.",
        "date": "09082015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "U.S. judge upholds Conoco as sole owner of coker at Sweeny  Texas refinery "
    },
    {
        "content": "HOUSTON  Sept 8 A federal court in New York has upheld a ruling granting U.S. oil and gas company ConocoPhillips  sole ownership of a unit at the Sweeny  Texas  refinery  in a long-running dispute over the asset with Venezuela's PDVSA.",
        "date": "09092015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 3-U.S. judge upholds Conoco as sole owner of coker at Sweeny  Texas refinery "
    },
    {
        "content": "HOUSTON  Sept 8 A federal court in New York has upheld a ruling granting U.S. oil and gas company ConocoPhillips  sole ownership of a unit at the Sweeny  Texas refinery in a long-running dispute over the asset with Venezuela's PDVSA.",
        "date": "09082015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 2-U.S. judge upholds Conoco as sole owner of coker at Sweeny  Texas refinery "
    },
    {
        "content": "HOUSTON  Sept 8 A federal court in New York has upheld a ruling granting U.S. oil and gas company ConocoPhillips  sole ownership of a unit at the Sweeny  Texas refinery  ending a long-running dispute over the asset with Venezuela's PDVSA.",
        "date": "09082015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "U.S. judge upholds Conoco as sole owner of coker at Sweeny refinery "
    },
    {
        "content": "WASHINGTON Oil and gas producer ConocoPhillips on Friday said it would support a UN climate change agreement if it met its own policy principles  including creating a \"level playing among energy sources and between countries.\"",
        "date": "09042015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips signals conditional support for U.N. climate deal "
    },
    {
        "content": "WASHINGTON  Sept 4 Oil and gas producer ConocoPhillips on Friday said it would support a UN climate change agreement if it met its own policy principles  including creating a \"level playing among energy sources and between countries.\"",
        "date": "09042015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips signals conditional support for UN climate deal "
    },
    {
        "content": "CALGARY  Alberta  Sept 1 ConocoPhillips  and Penn West Petroleum are eliminating a combined 900 jobs in Canada  the two companies said on Tuesday  as low oil prices persist.",
        "date": "09012015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "UPDATE 1-Penn West  ConocoPhillips cut combined 900 jobs in Canada "
    },
    {
        "content": "HOUSTON Stung by the worst downturn in oil in six years  crude producer ConocoPhillips said on Tuesday it will trim its current workforce by 10 percent in a second round of layoffs - only months after a first round of cuts reduced staff by 5 percent.",
        "date": "09022015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Cumulative job cuts at ConocoPhillips to approach 15 percent "
    },
    {
        "content": "CALGARY  Alberta  Sept 1 Oil major ConocoPhillips is laying off 400 employees and 100 contractors in Canada  a company spokesman said on Tuesday  with the majority of cuts coming in the Calgary office.",
        "date": "09012015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips laying off 500 employees and contractors in Canada "
    },
    {
        "content": "HOUSTON  Sept 1 Stung by the worst downturn in oil in six years  crude producer ConocoPhillips said on Tuesday it will trim its current workforce by 10 percent in a second round of layoffs - only months after a first round of cuts reduced staff by 5 percent.",
        "date": "09022015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 1-Cumulative job cuts at ConocoPhillips to approach 15 pct "
    },
    {
        "content": "CARACAS  Aug 11 Venezuela has appealed for a second time to the World Bank's arbitration panel against its decision in the country's dispute with ConocoPhillips  linked to the nationalization of the company's assets.",
        "date": "08112015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Venezuela appeals for 2nd time to World Bank panel in Conoco dispute "
    },
    {
        "content": "JAKARTA U.S. oil and gas company ConocoPhillips is reviewing its portfolio in Indonesia and may soon seek buyers for a stake in a production sharing block it operates in the Natuna Sea  company and government sources said.",
        "date": "08112015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips to seek buyers for stake in Indonesian oil  gas block - sources "
    },
    {
        "content": "* ConocoPhillips looks to sell stake in South Natuna Sea Block B",
        "date": "08112015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 1-ConocoPhillips to seek buyers for stake in Indonesian oil  gas block -sources "
    },
    {
        "content": "JAKARTA  Aug 11 U.S. oil and gas company ConocoPhillips is reviewing its portfolio in Indonesia and may soon seek buyers for a stake in a production sharing block it operates in the Natuna Sea  company and government sources said.",
        "date": "08112015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "CORRECTED-ConocoPhillips to seek buyers for stake in Indonesian oil  gas block -sources "
    },
    {
        "content": "ConocoPhillips  the largest U.S. independent oil and gas company  reported quarterly results that beat analysts' expectations Thursday and said it would cut capital expenditure as low crude oil prices persist.",
        "date": "07302015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Conoco results beat estimates  cuts capex amid low oil price "
    },
    {
        "content": "HOUSTON ConocoPhillips  which is working to cut $1 billion in operating costs as low crude prices persist  has so far cut about 1 000 jobs  or 5 percent of its workforce and more cuts are to come  the company's chief financial officer said.",
        "date": "07302015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips has cut 5 percent of workforce  more to come: CFO "
    },
    {
        "content": "Cenovus Energy Inc   Canada's No. 2 independent oil producer  on Thursday slashed its quarterly dividend by 40 percent and said it would cut 300 to 400 jobs to further reduce costs because of slumping crude prices.",
        "date": "07302015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Cenovus Energy to cut jobs  dividend amid oil price slump "
    },
    {
        "content": "HOUSTON  July 30 ConocoPhillips  which is working to cut $1 billion in operating costs as low crude prices persist  has so far cut about 1 000 jobs  or 5 percent of its workforce and more cuts are to come  the company's chief financial officer said.",
        "date": "07302015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips has cut 5 pct of workforce  more to come -CFO "
    },
    {
        "content": "* Exec says sees Q3 charge of up to $400 million related to canceled drillship contract",
        "date": "07302015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-M&A may pick up if current prices persist-Conoco CEO "
    },
    {
        "content": "July 30 ConocoPhillips  the largest U.S. independent oil and gas company  reported quarterly results that beat analysts' expectations Thursday and said it would cut capital expenditure as low crude oil prices persist.",
        "date": "07302015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 1-Conoco results beat estimates  cuts capex amid low oil price "
    },
    {
        "content": "July 30 ConocoPhillips  the largest U.S. independent oil and gas company  reported a quarterly loss compared with a year-ago profit on Thursday as steep declines in crude oil prices hurt results.",
        "date": "07302015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Conoco has quarterly loss  lowers capex "
    },
    {
        "content": "July 16 ConocoPhillips said on Thursday it will reduce future spending on deepwater drilling due to low crude oil prices while raising its dividend one cent.",
        "date": "07162015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Conoco says cutting deepwater spending  dividend up a penny "
    },
    {
        "content": "July 16 ConocoPhillips said on Thursday it will reduce future spending on deepwater drilling due to low crude oil prices  and also raise its dividend 1 cent.",
        "date": "07162015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 1-Conoco says cutting deepwater spending  dividend up a penny "
    },
    {
        "content": "CARACAS  July 1 A World Bank tribunal has rejected Venezuela's request to recuse two arbitrators in a dispute with U.S. oil firm ConocoPhillips linked to the 2007 nationalization of the company's assets in the OPEC nation.",
        "date": "07012015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Venezuela loses bid to recuse arbitrators in Conoco dispute "
    },
    {
        "content": "LAGOS  June 30 Nigeria's Oando has agreed to sell a 60 percent stake in its downstream business to a consortium of investors including Vitol for $276 million  the energy company said on Tuesday.",
        "date": "06302015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Nigeria's Oando to sell 60 pct of downstream business for $276 mln "
    },
    {
        "content": "CARACAS  July 1 A World Bank tribunal has rejected Venezuela's request to recuse two arbitrators in a dispute with U.S. oil firm ConocoPhillips linked to the 2007 nationalization of the company's assets in the OPEC nation.",
        "date": "07012015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 1-Venezuela loses bid to recuse arbitrators in Conoco dispute "
    },
    {
        "content": "WARSAW  June 5 ConocoPhillips  the U.S. energy company  said on Friday it has stopped its shale gas exploration in Poland due to unsatisfactory results  leaving the rest of the field to Polish state-run firms.",
        "date": "06052015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "UPDATE 1-Conoco the last global oil firm to quit Polish shale gas "
    },
    {
        "content": "WARSAW  June 5 ConocoPhillips  the U.S. energy company  is withdrawing from shale gas exploration in Poland as it has not encountered commercial volumes of the gas  the company said on Friday.",
        "date": "06052015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Conoco stops its shale gas exploration in Poland "
    },
    {
        "content": "VIENNA The U.S. tight-oil boom is here to stay despite low crude prices as technological breakthroughs will allow steep reductions in costs  the head of U.S. firm ConocoPhillips told a seminar organised by oil-producing group OPEC.",
        "date": "06042015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Tight oil is here to stay  Conoco CEO tells OPEC "
    },
    {
        "content": "VIENNA  June 4 The U.S. tight-oil boom is here to stay despite low crude prices as technological breakthroughs will allow steep reductions in costs  the head of U.S. firm ConocoPhillips told a seminar organised by oil-producing group OPEC.",
        "date": "06042015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 2-Tight oil is here to stay  Conoco CEO tells OPEC "
    },
    {
        "content": "CALGARY  Alberta  June 1 ConocoPhillips  said on Monday it has started commercial operations at the 118 000 barrel per day phase 2 expansion of its Surmont project in the Canadian oil sands of northern Alberta.",
        "date": "06012015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Conoco's Surmont Alberta oil sands expansion begins operations "
    },
    {
        "content": "KUALA LUMPUR  May 18 ConocoPhillips  expects to maintain capital expenditure for the next three years  after reducing it earlier this year due to the oil price drop  Chief Executive Ryan Lance told Reuters on Monday.",
        "date": "05182015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips says to maintain capex for next 3 years "
    },
    {
        "content": "HOUSTON  May 12 ConocoPhillips'  shareholders on Tuesday voted for a non-binding resolution allowing minority shareholders to nominate directors to its board.",
        "date": "05122015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "UPDATE 2-Conoco shareholders approve proxy access proposal "
    },
    {
        "content": "HOUSTON  May 12 ConocoPhillips'  shareholders on Tuesday voted for a non-binding proposal allowing minority shareholders to nominate directors to its board.",
        "date": "05122015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips shareholders approve proxy access proposal "
    },
    {
        "content": "* Conocophillips ceo says company still taking time to digest u.s. Regulations around arctic drilling  Source text for Eikon:  Further company coverage:    (Reporting by Anna Driver)",
        "date": "05122015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-ConocoPhillips shareholders approve proxy access proposal "
    },
    {
        "content": "YANGON  May 3 Myanmar has awarded contracts to international oil majors Statoil and ConocoPhillips  for oil and gas exploration in a deepwater offshore block  the official Kyemon Daily said on Sunday.",
        "date": "05032015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Myanmar awards Statoil  Conoco Phillips deepsea exploration contract- paper "
    },
    {
        "content": "ConocoPhillips   the largest independent U.S. energy company  reported sharply lower quarterly profit on Thursday  hurt by a steep decline in crude oil prices.",
        "date": "04302015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips first-quarter profit falls sharply on oil price decline "
    },
    {
        "content": "April 30 ConocoPhillips  the largest independent U.S. energy company  reported sharply lower quarterly profit on Thursday  hurt by a steep decline in crude oil prices.",
        "date": "04302015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 2-ConocoPhillips 1st-qtr profit falls sharply on oil price decline "
    },
    {
        "content": "April 30 ConocoPhillips  the largest independent U.S. energy company  on Thursday reported a sharply lower quarterly profit as results were hurt by a steep decline in crude oil prices.",
        "date": "04302015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips profit falls sharply on oil prices "
    },
    {
        "content": "HOUSTON  April 20 Senator Lisa Murkowski (R-Alaska) said on Monday she will introduce legislation this year to allow U.S. crude exports  saying the Obama administration should not dare lift sanctions on Iran before scrapping the U.S. crude export ban.",
        "date": "04202015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "CERAWEEK-Evoking Iran  U.S. senator pushes for oil exports "
    },
    {
        "content": "April 21 ConocoPhillips Inc is weighing sale of some of its North Sea assets in Norway which may fetch as much as $1 billion  Bloomberg reported  citing sources familiar with the matter.",
        "date": "04212015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips weighs sale of North sea assets in Norway - Bloomberg "
    },
    {
        "content": "April 13 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "04132015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "ConocoPhillips  is preparing the sale of noncore oil and gas producing acreage in the United States  in the latest sign that oil majors are becoming more accepting of lower oil prices  according to people familiar with the matter.",
        "date": "04132015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Exclusive: ConocoPhillips to launch U.S. asset sales - sources "
    },
    {
        "content": "HOUSTON  April 8 ConocoPhillips has received U.S. government approval to export ultra-light domestic oil  a company spokesman said on Wednesday.",
        "date": "04082015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips has U.S. approval to export ultra-light oil "
    },
    {
        "content": "HOUSTON  April 8 ConocoPhillips  the largest independent producer of oil and natural gas  plans to add drilling rigs in 2017 in key U.S. shale acreage based on its expectations for a crude price recovery  the company's chief executive said on Wednesday.",
        "date": "04082015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Conoco CEO sees ramping up shale rigs when oil price recovers "
    },
    {
        "content": "* CEO says \"no\" when asked by an analyst if he has made any plans to sell the company  Further company coverage:    (Reporting By Anna Driver)",
        "date": "04082015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BRIEF-Conocophillips CEO says no plans to sell the company "
    },
    {
        "content": "JAKARTA  March 31 U.S. company ConocoPhillips  plans to invest around $2.5 billion in Indonesia's upstream oil and gas industry over the next three or four years  the nation's energy minister said on Tuesday.",
        "date": "03312015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Conoco to push on with investment in Indonesia oil  gas -govt "
    },
    {
        "content": "CARACAS Venezuela is seeking to recuse two arbitrators on a World Bank tribunal hearing in a dispute with U.S. oil firm ConocoPhillips   less than a year after the tribunal rejected a similar request regarding the same arbitrators.",
        "date": "03272015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Venezuela again seeks to recuse arbitrators in Conoco dispute "
    },
    {
        "content": "CARACAS  March 26 Venezuela is seeking to recuse two arbitrators on a World Bank tribunal hearing in a dispute with U.S. oil firm ConocoPhillips  less than a year after the tribunal rejected a similar request regarding the same arbitrators.",
        "date": "03272015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 1-Venezuela again seeks to recuse arbitrators in Conoco dispute "
    },
    {
        "content": "March 27 ConocoPhillips said on Friday it is looking to sell about 20 percent of its production in Western Canada  outside the oil sands  as tumbling oil prices have made operations in the country less profitable.",
        "date": "03282015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips puts some Western Canada assets up for sale "
    },
    {
        "content": "ConocoPhillips expects production to climb 11 percent to touch 1.7 million barrels of oil equivalent per day (mmboed) in 2017.",
        "date": "03172015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips expects output to rise 11 percent in next three years "
    },
    {
        "content": "March 17 ConocoPhillips expects production to climb 11 percent to touch 1.7 million barrels of oil equivalent per day (mmboed) in 2017.",
        "date": "03172015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "CORRECTED-UPDATE 1-ConocoPhillips expects output to rise 11 pct in next three years "
    },
    {
        "content": "March 17 Oil and gas producer ConocoPhillips  said it expects production to touch 1.7 million barrels of oil equivalent per day (mmboed) in 2017.",
        "date": "03172015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "CORRECTED-ConocoPhillips expects output to rise to 1.7 mmboed in 2017 "
    },
    {
        "content": "CALGARY  Alberta  March 18 Oil company ConocoPhillips plans to cut about 7 percent of its workforce in Canada  or about 200 employees  as tumbling oil prices have made its operations in the country less profitable.",
        "date": "03182015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "UPDATE 1-Conoco to cut 7 percent of Canadian workforce "
    },
    {
        "content": "OSLO  March 11 Oil major ConocoPhillips  has decided to cancel its 17 billion crown ($2.1 billion) Tommeliten Alpha gas and condensate development in the Norwegian sector of the North Sea  Stavanger Aftenblad reported on Wednesday.",
        "date": "03112015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "ConocoPhillips calls off $2.1 bln Norwegian North Sea project - report "
    },
    {
        "content": "LAGOS  March 3 Nigerian energy company Oando Plc  has prepaid $238 million out of the $900 million it borrowed to part finance the acquisition of ConocoPhillips'  Nigerian oil and gas business  the company said on Tuesday.",
        "date": "03042015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "CORRECTED--Oil hedge helps Oando prepay debt after ConocoPhillips' deal "
    },
    {
        "content": "LAGOS  March 3 Nigerian energy company Oando Plc  has prepaid $238 million out of the $753 million it borrowed to part finance the acquisition of ConocoPhillips'  Nigerian oil and gas business  the company said on Tuesday.",
        "date": "03032015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "UPDATE 1-Oil hedge helps Oando prepay debt after ConocoPhillips' deal "
    },
    {
        "content": "LAGOS  March 3 Oando Plc has prepaid $238 million out of the $753 million it borrowed to part finance the acquisition of ConocoPhillips' Nigerian oil and gas business  the company said on Tuesday.",
        "date": "03032015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Oil hedge helps Oando prepay debt after ConocoPhillips' Nigerian deal "
    },
    {
        "content": "WARSAW  Feb 12 Poland  once Europe's greatest hope for shale energy  is reeling from a rapid change in fortunes as U.S. companies walk away and low oil prices postpone any realistic start to commercial drilling.",
        "date": "02122015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Oil's fall rocks already reeling Polish shale gas hopes "
    },
    {
        "content": "Jan 28 Oil producer Chevron Corp said it would work with peers BP Plc and ConocoPhillips  to explore and appraise 24 jointly held offshore leases in deepwater Gulf of Mexico.",
        "date": "01282015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "UPDATE 1-Chevron to partner BP  Conoco for Gulf of Mexico leases "
    },
    {
        "content": "HOUSTON/WILLISTON  N.D. ConocoPhillips  and Occidental Petroleum Corp  on Thursday slashed exploration spending plans for this year  as the third- and fourth-largest U.S. oil companies attempt to cope with a steep slide in crude prices.",
        "date": "01292015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Conoco  Occidental and Shell cut 2015 budgets on crude slide "
    },
    {
        "content": "HOUSTON/WILLISTON  N.D.  Jan 29 ConocoPhillips  and Occidental Petroleum Corp on Thursday slashed exploration spending plans for this year  as the third- and fourth-largest U.S. oil companies attempt to cope with a steep slide in crude prices.",
        "date": "01292015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "WRAPUP-Conoco  Occidental and Shell cut 2015 budgets on crude slide "
    },
    {
        "content": "ConocoPhillips   the largest independent oil and gas company  on Thursday reported a quarterly loss and again slashed its 2015 capital expenditures  citing lower crude prices.",
        "date": "01292015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Conoco has quarterly loss  cuts capex again on oil slide "
    },
    {
        "content": "HOUSTON  Jan 29 The chief executive of ConocoPhillips  an oil company that reported a quarterly loss on Thursday and also made a second round of cuts to its 2015 budget  expects oil prices to remain low for the balance of the year.",
        "date": "01292015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Conoco CEO sees low oil prices lingering in 2015 "
    },
    {
        "content": "HOUSTON  Jan 29 ConocoPhillips and Occidental Petroleum Corp on Thursday slashed exploration spending plans for this year  as the third- and fourth-largest U.S. oil companies attempt to cope with a steep slide in crude prices.",
        "date": "01292015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "Conoco  Occidental slash 2015 budgets amid crude price collapse "
    },
    {
        "content": "Jan 29 ConocoPhillips  the largest independent oil and gas company  on Thursday reported a quarterly loss and again slashed its 2015 capital expenditures  citing lower crude prices.",
        "date": "01292015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "UPDATE 1-Conoco has quarterly loss  cuts capex again on oil slide "
    },
    {
        "content": "Jan 29 ConocoPhillips  the largest independent oil and gas company  on Thursday reported a quarterly loss and again slashed its 2015 capital expenditures  citing lower crude prices.",
        "date": "01292015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "ConocoPhillips has quarterly loss  cuts capex again "
    },
    {
        "content": "WASHINGTON  Jan 14 ConocoPhillips has asked the U.S. Commerce Department for guidance on whether it can ship its minimally treated light oil abroad  though the company does not believe it makes sense to export it now  the company's CEO said on Wednesday.",
        "date": "01142015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Conoco seeks U.S. guidance on light oil exports -CEO "
    },
    {
        "content": "LONDON  Jan 15 Britain will launch a review to identify key risks to oil and gas production in response to the collapse in oil prices  after oil majors BP and ConocoPhillips said they were cutting more than 500 jobs in their North Sea operations.",
        "date": "01152015",
        "name": "ConocoPhillips",
        "news_type": "topStory",
        "symbol": "COP",
        "title": "Britain to launch review of its oil and gas industry "
    },
    {
        "content": "LONDON Oil majors BP and ConocoPhillips will cut over 500 jobs in the North Sea following similar moves by rivals to reduce costs in one of the world's most expensive exploration areas as oil prices tumble.",
        "date": "01152015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "BP  Conoco to cut North Sea jobs as oil price plummets "
    },
    {
        "content": "LONDON  Jan 15 Oil majors BP and ConocoPhillips will cut over 500 jobs in the North Sea following similar moves by rivals to reduce costs in one of the world's most expensive exploration areas as oil prices tumble.",
        "date": "01152015",
        "name": "ConocoPhillips",
        "news_type": "normal",
        "symbol": "COP",
        "title": "RPT-UPDATE 2-BP  Conoco to cut North Sea jobs as oil price plummets "
    }
]