[
    {
        "content": "Beauty products maker Coty Inc  posted a quarterly profit on Thursday that beat Wall Street estimates  selling more products geared toward millennials and making progress folding in newly-acquired brands in an expanded global portfolio.",
        "date": "11092017",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Coty profit beats on demand for brands aimed at younger consumers "
    },
    {
        "content": "* Shares up as much as 21 pct (Adds analyst  conference call comments  updates share price)",
        "date": "11092017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "UPDATE 3-Coty profit beats on demand for brands aimed at younger consumers "
    },
    {
        "content": "* CFO on conf call - Q1 is the lowest quarter of the year from a revenue standpoint‍​",
        "date": "11092017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "BRIEF-Coty says sales in 2H will be roughly flat with previous year "
    },
    {
        "content": "* Coty Inc qtrly ‍net revenues of $2 238.3 million increased 5% for combined company at constant currency​",
        "date": "11092017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "BRIEF-Coty qtrly loss per share $‍0.03​ "
    },
    {
        "content": "* Coty Inc - ‍Declared a quarterly cash dividend of $0.125 per common share​ Source text for Eikon: Further company coverage:",
        "date": "11092017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "BRIEF-Coty Inc declares quarterly dividend of $0.125 per common share​ "
    },
    {
        "content": "Nov 9 Beauty products maker Coty Inc on Thursday posted a quarterly loss on higher expenses related to the acquisition of P&G's beauty brands and weak demand for its fragrances and color cosmetics.",
        "date": "11092017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "Coty posts quarterly loss on higher acquisition costs "
    },
    {
        "content": "Coty Inc  reported a surprise quarterly loss and warned that it expected retailers to reduce stocking some of the beauty products the company acquired from Procter & Gamble Co  until the second half of 2018.    Shares of the U.S. beauty products maker fell 13 percent to $17 in afternoon trading on Tuesday.",
        "date": "08222017",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Coty says some of its P&G brands to stay under pressure until 2018 "
    },
    {
        "content": "* Shares down 13 pct in afternoon trading (Adds analyst comment; Updates shares)",
        "date": "08222017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "UPDATE 3-Coty says some of its P&G brands to stay under pressure until 2018 "
    },
    {
        "content": "Aug 22 U.S. beauty products maker Coty Inc narrowed its quarterly loss and reported sales that more than doubled  powered by the acquisition of Procter & Gamble brands.",
        "date": "08222017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "Coty narrows Q4 loss  revenue more than doubles on P&G brands "
    },
    {
        "content": "* Coty Inc reports fiscal 2017 fourth quarter and full year results",
        "date": "08222017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "BRIEF-Coty Inc Q4 adjusted earnings per share $0.00 "
    },
    {
        "content": "LUXEMBOURG A decade-long battle by luxury brands to defend their image neared an end on Wednesday when an adviser to Europe's top court said Coty can block a German retailer from selling its beauty products via online marketplaces.",
        "date": "07262017",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Luxury firms' online battle boosted by EU court adviser's Coty stance "
    },
    {
        "content": "LUXEMBOURG  July 26 An adviser to Europe's top court said on Wednesday that U.S. beauty products maker Coty's German unit can block retailers from selling their products via marketplaces such as Amazon or eBay .",
        "date": "07262017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "Top EU court adviser says Coty can block retailers from online sales "
    },
    {
        "content": "* Coty Inc- during interim period  research and development team will report to CEO. Source text for Eikon: Further company coverage:",
        "date": "06132017",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "BRIEF-Coty Inc chief scientific officer Ralph Macchio to retire "
    },
    {
        "content": "Beauty products maker Coty Inc  reported higher-than-expected quarterly profit and sales  helped by strong demand for labels such as Calvin Klein as well as for recently acquired brands ghd and Younique.",
        "date": "05102017",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Coty profit and sales beat as acquisitions pay off; shares jump "
    },
    {
        "content": "* Shares set for best one-day pct gain in 15 months (Adds details  CEO comment; updates shares)",
        "date": "05102017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "UPDATE 2-Coty profit and sales beat as acquisitions pay off; shares jump "
    },
    {
        "content": "May 10 Beauty products maker Coty Inc reported a bigger quarterly loss  hurt by restructuring charges related to the integration of the beauty business it acquired from Procter & Gamble Co.",
        "date": "05102017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "Coty posts bigger loss due to charges related to P&G deal "
    },
    {
        "content": "* Q3 earnings per share view $0.13  revenue view $1.94 billion -- Thomson Reuters I/B/E/S",
        "date": "05102017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "BRIEF-Coty Q3 loss per share $ 0.22 "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.125per share Source text for Eikon: Further company coverage:",
        "date": "05102017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "BRIEF-Coty sets quarterly cash dividend of $0.125 per share "
    },
    {
        "content": "* Shares fall as much as 2 pct (Adds CFO comment from conference call  updates shares)",
        "date": "04262017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "UPDATE 3-P&G profit falls on strong dollar  slow consumer spending "
    },
    {
        "content": "LUXEMBOURG German beauty products maker Coty rejected claims that its distribution policies imply a blanket ban on online sales  arguing that its main concern was to safeguard the cachet of its luxury brands such as Marc Jacobs  Calvin Klein and Chloe.",
        "date": "03312017",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Coty says not against online sales  wants to protect luxury brands "
    },
    {
        "content": "LUXEMBOURG  March 30 German beauty products maker Coty rejected claims that its distribution policies imply a blanket ban on online sales  arguing that its main concern was to safeguard the cachet of its luxury brands such as Marc Jacobs  Calvin Klein and Chloe.",
        "date": "03302017",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Coty says not against online sales  wants to protect luxury brands "
    },
    {
        "content": "LONDON British luxury brand Burberry  has agreed to license its fragrances and cosmetics business to Coty  for $162 million  plus a $63 million payment for inventory  in a deal that will help it develop new products and give it the benefit of the U.S. group's extensive distribution network.",
        "date": "04032017",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Burberry licenses fragrances and cosmetics business to Coty "
    },
    {
        "content": "* France says online sales curbs safeguard brands' prestige (Updates with details about Parfumerie Akzente)",
        "date": "03312017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "UPDATE 2-Coty says not against online sales  wants to protect luxury brands "
    },
    {
        "content": "* Shares up 1 pct (Adds CFO comments  analyst reaction  shares)",
        "date": "04032017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "UPDATE 2-Burberry licenses beauty business to Coty in new drive to expand "
    },
    {
        "content": "LONDON  April 3 British luxury brand Burberry said on Monday it would transfer its beauty business to U.S. group Coty in a deal that will bring in around $225 million plus ongoing royalty payments in a bid to revitalise the division.",
        "date": "04032017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "Burberry licenses beauty business to Coty in new partnership deal "
    },
    {
        "content": "* Entered agreement to acquire exclusive long-term global license rights for Burberry beauty luxury fragrances  cosmetics and skincare",
        "date": "04032017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "BRIEF-Coty enters exclusive licensing agreement for some Burberry products "
    },
    {
        "content": "* Coty appoints laurent kleitman as president coty consumer beauty",
        "date": "03072017",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "BRIEF-Coty appoints Laurent Kleitman as president Coty consumer beauty "
    },
    {
        "content": "* Coty Inc reports second quarter fiscal 2017 results  the first quarter after successful completion of the merger with P&G Beauty Business",
        "date": "02092017",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "BRIEF-Coty reports qtrly adj EPS of $0.30 "
    },
    {
        "content": "* Coty inc qtrly net revenues of $2 296.7 million increased 90% as reported compared to legacy-coty net revenues in prior-year period",
        "date": "02092017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "BRIEF-Coty Inc qtrly adjusted EPS $ 0.30 "
    },
    {
        "content": "* Coty completes acquisition of 60% stake to enter into a partnership with Younique",
        "date": "02012017",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "BRIEF-Coty completes acquisition of 60pct stake to enter into a partnership with Younique "
    },
    {
        "content": "Beauty products maker Coty Inc  said it would buy a 60 percent stake in privately held online cosmetics retailer Younique LLC for about $600 million as it reduces its dependence on its ailing fragrance business.",
        "date": "01102017",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Coty to buy majority stake in Younique for about $600 million "
    },
    {
        "content": "Jan 10 Beauty products maker Coty Inc  said it would buy a 60 percent stake in privately held online cosmetics retailer Younique LLC for about $600 million as it reduces its dependence on its ailing fragrance business.",
        "date": "01102017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "UPDATE 1-Coty to buy majority stake in Younique for about $600 mln "
    },
    {
        "content": "Jan 10 Beauty products maker Coty Inc  said it would buy a majority stake in privately held online cosmetics retailer Younique LLC for about $600 million.",
        "date": "01102017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "Coty to buy 60 pct stake in Younique for about $600 mln "
    },
    {
        "content": "* Coty to enter into partnership with younique  a leading online peer-to-peer social selling platform in beauty",
        "date": "01102017",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "BRIEF-Coty to enter into partnership with Younique "
    },
    {
        "content": "Beauty products maker Coty Inc  reported lower-than-expected quarterly revenue  due to a slump in demand for its fragrances and color cosmetics  and said the slowdown in revenue would continue in the current quarter.",
        "date": "11092016",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Coty says sales slide to continue in current quarter  shares fall "
    },
    {
        "content": "Nov 9 Beauty products maker Coty Inc  reported lower-than-expected quarterly revenue  due to a slump in demand for its fragrances and color cosmetics  and said the slowdown in revenue would continue in the current quarter.",
        "date": "11092016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "UPDATE 2-Coty says sales slide to continue in current quarter  shares fall "
    },
    {
        "content": "Nov 9 Beauty products maker Coty Inc's  quarterly revenue fell 3 percent  due to a slump in demand across its businesses  including fragrances and color cosmetics.",
        "date": "11092016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "Coty's quarterly revenue falls 3 percent "
    },
    {
        "content": "* Coty Inc. reports first quarter fiscal 2017 results for stand-alone Coty business  prior to the completion of the merger with P&G specialty beauty business  Source text:  Further company coverage:",
        "date": "11092016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "BRIEF-Coty reports First Quarter Fiscal 2017 Results "
    },
    {
        "content": "* Coty -  entered into incremental assumption agreement and refinancing amendment which amends certain credit agreement  dated as of October 27  2015",
        "date": "10282016",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "BRIEF-Coty enters into incremental agreement for new term facility "
    },
    {
        "content": "JERUSALEM  Oct 26 Daniel Schwartz  managing partner at York Capital Management  on Wednesday recommended investing in beauty company Coty  citing a low valuation and high growth prospects.",
        "date": "10262016",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "York Capital's Schwartz sees growth in beauty company Coty "
    },
    {
        "content": "* UK \"very challenging and highly promotional\"  sales down 2 pct",
        "date": "10252016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "UPDATE 3-P&G profit beats on cost cuts  demand for home care goods "
    },
    {
        "content": "Oct 17 Beauty products maker Coty Inc  said it would buy ghd  a high-end hairstyling appliances brand  from private equity firm Lion Capital LLP for about 420 million pounds ($522 million).",
        "date": "10172016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "Coty to buy London-based hairstyling appliances maker ghd "
    },
    {
        "content": "Oct 17 Beauty products maker Coty Inc  said it would buy ghd  a high-end hairstyling appliances brand  from private equity firm Lion Capital LLP for about 420 million pounds ($522 million).",
        "date": "10172016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "UPDATE 1-Coty to buy London-based hairstyling appliances maker ghd "
    },
    {
        "content": "* Coty agrees to acquire GHD (\"Good Hair Day\") the world's premium hair straighteners & appliances company",
        "date": "10172016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "BRIEF-Coty agrees to acquire GHD (\"Good Hair Day\") "
    },
    {
        "content": "* T. Rowe Price Associates  Inc reports an 11.1 percent passive stake in Coty Inc as of Sept 30 - SEC filing  Source text - (http://bit.ly/2e2YPAr) Further company coverage:",
        "date": "10112016",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "BRIEF-T. Rowe Price Associates reports 11.1 pct passive stake in Coty - SEC filing "
    },
    {
        "content": "* Reports 11.4 pct passive stake in Coty Inc as of Sept 30  2016 - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "10062016",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "BRIEF-Jpmorgan chase reports 11.4 percent passive stake in Coty Inc "
    },
    {
        "content": "* S&P Dow Jones indices says Coty Inc will replace Diamond Offshore Drilling Inc in the S&P 500",
        "date": "09272016",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "BRIEF-S&P Dow Jones indices says Coty Inc will replace Diamond Offshore Drilling Inc in the S&P 500 "
    },
    {
        "content": "Beauty products maker Coty Inc reported its second straight quarterly loss  hurt by a jump in costs to integrate beauty brands acquired from Procter & Gamble and a slowdown in sales of some core brands.",
        "date": "08162016",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Perfume maker Coty posts loss as integration costs pinch "
    },
    {
        "content": "* Coty on track to close P&G beauty brands deal in October   (Updates share price)",
        "date": "08162016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "UPDATE 4-Perfume maker Coty posts loss as integration costs pinch "
    },
    {
        "content": "* Q4 net revenues $1.08 billion versus $1.02 billion in q4 2015",
        "date": "08162016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "BRIEF-Coty reports Q4 adjusted earnings per share $0.13 "
    },
    {
        "content": "Aug 16 Beauty products maker Coty Inc's  quarterly revenue rose 5.5 percent  driven by higher perfume sales.",
        "date": "08162016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "Perfume maker Coty's quarterly revenue rises 5.5 pct "
    },
    {
        "content": "* Coty Inc increases annual dividend by 10% to $0.275 per share",
        "date": "08012016",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "BRIEF-Coty increases annual dividend by 10 pct to $0.275 per share "
    },
    {
        "content": "July 21 Perfume maker Coty Inc said on Thursday Camillo Pane would take over as chief executive in October  following the scheduled closing of its acquisition of Procter & Gamble Co's beauty business.",
        "date": "07212016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "Perfume maker Coty names Camillo Pane as CEO "
    },
    {
        "content": "* Bart Becht to remain chairman and help oversee integration of two companies",
        "date": "07212016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "BRIEF-Coty Inc names Camillo Pane CEO "
    },
    {
        "content": "* Entered employment agreement effective on or about July 1  2016  with Patrice De Talhouët  CFO",
        "date": "06242016",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "BRIEF-Coty enters employment agreement with Patrice De Talhouët  CFO "
    },
    {
        "content": "Perfume maker Coty Inc  sharply raised its estimate of costs related to its $12.5 billion acquisition of beauty product brands from Procter & Gamble Co   sending its shares down sharply on Tuesday.",
        "date": "05032016",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Coty sharply raises estimate of costs related to P&G deal "
    },
    {
        "content": "* Coty inc. Announces update on transaction with p&g beauty brands",
        "date": "05032016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "BRIEF-Coty announces update on transaction with P&G Beauty Brands "
    },
    {
        "content": "May 3 Coty Inc's sales increased for the first time in six quarters due to higher demand for color cosmetics including Rimmel makeup.",
        "date": "05032016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "Coty sales rise for first time in six quarters "
    },
    {
        "content": "* On April 8  2016 co entered into incremental assumption agreement and amendment no. 1 to credit agreement",
        "date": "04142016",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "BRIEF-Coty entered into incremental assumption agreement on April 8 "
    },
    {
        "content": "* Wellington Management Group LLP reports a 10.12% passive stake in Coty Inc as of March 31  2016 - SEC filing  Source text - http://1.usa.gov/1RP11H5 Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04112016",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "BRIEF-Wellington Management Group LLP reports a 10.12% passive stake in Coty Inc as of March 31  2016 - SEC filing "
    },
    {
        "content": "BRUSSELS  Feb 16 The European Commission said on Tuesday it had approved Coty Inc's planned acquisition of Procter & Gamble's beauty products businesses by Coty after concluding the market competition would remain sufficiently strong.",
        "date": "02162016",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "EU clears Coty acquisition of P&G beauty businesses "
    },
    {
        "content": "BRUSSELS  Feb 10 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02102016",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "EU mergers and takeovers (Feb 10) "
    },
    {
        "content": "Perfume maker Coty Inc's  quarterly sales beat analysts' estimate as the company's efforts to transform into a global beauty products giant begin to bear fruit.",
        "date": "02042016",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Coty's beauty push more than makes up for fading fragrances "
    },
    {
        "content": "* Shares rise as much as 17 pct   (Adds analyst comment  details  shares)",
        "date": "02042016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "UPDATE 2-Coty's beauty push more than makes up for fading fragrances "
    },
    {
        "content": "BRUSSELS  Feb 4 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "02042016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "EU mergers and takeovers (Feb 4) "
    },
    {
        "content": "Feb 4 Coty Inc reported a 3.9 percent drop in quarterly sales  hurt by weak demand for its fragrances.",
        "date": "02042016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "Coty's sales drop 3.9 pct as perfume demand fades "
    },
    {
        "content": "BERLIN  Jan 18 Adidas has named Henkel's Kasper Rorsted as its new chief executive  boosting its shares as investors expressed hopes that the Dane has the credentials to boost profits at the German sportswear firm.",
        "date": "01182016",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "UPDATE 3-Adidas names Henkel's Rorsted to replace Hainer as CEO "
    },
    {
        "content": "NEW YORK She didn't make as many headlines  nor sell as many albums  but Katy Perry handily beat Taylor Swift to become the highest-earning woman in music this year  according to Forbes.",
        "date": "11042015",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Katy Perry's $135 million tops Taylor Swift as highest music earner "
    },
    {
        "content": "Coty Inc  reported higher-than-expected sales for the first time in five quarters as strong demand for its Sally Hansen nail products and Rimmel cosmetics more than made up for declining sales of its perfumes.",
        "date": "08132015",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Demand for Coty's cosmetics makes up for weak perfume sales "
    },
    {
        "content": "* Shares rise as much as 9 pct   (Adds CEO  analyst comments; updates shares)",
        "date": "08132015",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "UPDATE 3-Demand for Coty's cosmetics makes up for weak perfume sales "
    },
    {
        "content": "Aug 13 Coty Inc reported higher-than-expected sales for the first time in five quarters as strong demand for its Sally Hansen nail products and Rimmel cosmetics more than made up for declining sales of its perfumes.",
        "date": "08132015",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "CORRECTED-UPDATE 2-Coty sales  profit beat on strong demand for cosmetics "
    },
    {
        "content": "Aug 13 Coty Inc reported a fall in sales for the third straight quarter  hurt by weak demand for its fragrances named after celebrities.",
        "date": "08132015",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "Coty sales fall for 3rd straight qtr on weak demand for perfumes "
    },
    {
        "content": "* Futures up: Dow 1.01 pct  S&P 1.12 pct  Nasdaq 1.16 pct   (Adds details  comment  updates prices)",
        "date": "07092015",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "US STOCKS-Wall St set to open higher as China stems rout "
    },
    {
        "content": "June 17 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Wednesday:",
        "date": "06172015",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": " (This June 16 story has been refiled to fix typo in Procter in first paragraph)",
        "date": "06172015",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "Coty on track to clinch P&G beauty deal in coming weeks: sources "
    },
    {
        "content": "PARIS  June 16 Coty is on track to acquire Procter & Gamble's  beauty business in a $12 billion deal that would make the U.S. cosmetic company the world leader in perfume and hair care  sources close to the matter said.",
        "date": "06172015",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "REFILE-UPDATE 3-Coty on track to clinch P&G beauty deal in coming weeks-sources "
    },
    {
        "content": "* Deal would make Coty No. 1 perfume and hair care company   (Updates share prices  adds Breakingviews link)",
        "date": "06162015",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "UPDATE 3-Coty on track to clinch P&G beauty deal in coming weeks-sources "
    },
    {
        "content": "* Indexes up: Dow 0.64 pct  S&P 0.57 pct  Nasdaq 0.51 pct   (Updates to close  changes byline)",
        "date": "06162015",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "US STOCKS-Wall St up with eyes on Greece  Fed; M&A supports "
    },
    {
        "content": "Henkel & Co KGaA AG  and Coty Inc   both of which have personal care and cosmetics businesses  made binding offers to buy separate parts of Procter & Gamble Co's  beauty businesses worth up to a total of $12 billion  according to people familiar with the matter.",
        "date": "06082015",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Exclusive: Henkel  Coty submit binding bids for P&G assets: sources "
    },
    {
        "content": "* UnitedHealth biggest boost to Dow; Microsoft to S&P  Nasdaq",
        "date": "06162015",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "US STOCKS-Wall St rises as Fed meet eyed; M&A picks up "
    },
    {
        "content": "* Indexes up: Dow 0.5 pct  S&P 0.3 pct  Nasdaq 0.3 pct   (Adds details  changes comment  updates prices)",
        "date": "06162015",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "US STOCKS-Wall St rises as M&A chatter picks up; Fed meeting eyed "
    },
    {
        "content": "Henkel & Co KGaA AG and Coty Inc  both of which have personal care and cosmetics businesses  made binding offers to buy separate parts of Procter & Gamble Co's beauty businesses worth up to a total of $12 billion  according to people familiar with the matter.",
        "date": "06092015",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Exclusive: Henkel  Coty submit binding bids for P&G assets "
    },
    {
        "content": "PARIS June 16 Details of U.S. cosmetic company Coty's acquisition of Proctor & Gamble's (P&G)  beauty assets could take at least two weeks to be finalised  sources close to the matter said on Tuesday.",
        "date": "06162015",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "Coty purchase of P&G assets may take two weeks to finalise-sources "
    },
    {
        "content": "June 15 U.S. cosmetics group Coty has won auctions to acquire three businesses from Procter & Gamble Co for as much as $12 billion  a source familiar with the matter told Reuters.",
        "date": "06162015",
        "name": "Coty Inc",
        "news_type": "normal",
        "symbol": "COTY",
        "title": "Coty nears deal to buy P&G businesses for about $12 bln - source "
    },
    {
        "content": "Personal care and cosmetics companies Henkel & Co KGaA AG  Revlon Inc and Coty Inc are preparing bids for parts of Procter & Gamble Co's beauty business  according to sources.",
        "date": "04152015",
        "name": "Coty Inc",
        "news_type": "topStory",
        "symbol": "COTY",
        "title": "Exclusive: Henkel  Revlon  Coty prepare bids for P&G beauty brands -sources "
    }
]