[
    {
        "content": "* Says Teamsters Canada Rail Conference Maintenance of Way Employees Division reached tentative agreement with Canadian Pacific Source text for Eikon: Further company coverage:",
        "date": "05122017",
        "name": "Canadian Pacific Railway Limited",
        "news_type": "topStory",
        "symbol": "CP",
        "title": "BRIEF-Teamsters reach tentative agreement with Canadian Pacific "
    },
    {
        "content": "Sept 6 Activist investor William Ackman left the board of Canadian Pacific on Tuesday  marking the end of a four-year tenure that helped overhaul the ailing railroad company and earn his hedge fund roughly $2.6 billion.",
        "date": "09062016",
        "name": "Canadian Pacific Railway Limited",
        "news_type": "topStory",
        "symbol": "CP",
        "title": "UPDATE 1-Ackman off Canadian Pacific board  ends four-year tenure "
    },
    {
        "content": "BOSTON/MONTREAL Billionaire investor William Ackman has exited his hedge fund's investment in railway company Canadian Pacific   freeing up roughly $1.5 billion in cash to make other future investments.",
        "date": "08032016",
        "name": "Canadian Pacific Railway Limited",
        "news_type": "topStory",
        "symbol": "CP",
        "title": "Ackman exits Canadian Pacific  freeing up cash for next bet "
    },
    {
        "content": "BOSTON/MONTREAL  Aug 3 Billionaire investor William Ackman has exited his hedge fund's investment in railway company Canadian Pacific  freeing up roughly $1.5 billion in cash to make other future investments.",
        "date": "08032016",
        "name": "Canadian Pacific Railway Limited",
        "news_type": "normal",
        "symbol": "CP",
        "title": "UPDATE 1-Ackman exits Canadian Pacific  freeing up cash for next bet "
    },
    {
        "content": "* Pershing Square Holdings  Ltd. announces sale of Canadian Pacific stock",
        "date": "08032016",
        "name": "Canadian Pacific Railway Limited",
        "news_type": "normal",
        "symbol": "CP",
        "title": "BRIEF-Pershing Square Holdings Ltd announces sale of Canadian Pacific stock "
    },
    {
        "content": "* Says on track to achieve annual productivity savings of more than $650 million and an operating ratio below 65 percent by 2020",
        "date": "04112016",
        "name": "Canadian Pacific Railway Limited",
        "news_type": "topStory",
        "symbol": "CP",
        "title": "BRIEF-Norfolk Southern says savings plan on track after Canadian Pacific drops bid for co "
    },
    {
        "content": "CHICAGO/MONTREAL Canadian Pacific Railway Ltd  Chief Executive Hunter Harrison on Monday said the company would consider using cash once planned to acquire rival Norfolk Southern Corp  for a potential buyback  dividend  or combination of both. | Video ",
        "date": "04122016",
        "name": "Canadian Pacific Railway Limited",
        "news_type": "topStory",
        "symbol": "CP",
        "title": "CP Rail mulls buyback  dividend after dropping Norfolk bid: CEO "
    }
]