[
    {
        "content": "SAO PAULO/BRASILIA  Oct 20 Minority shareholders in the renewable energy unit of Brazil´s power holding company CPFL Energia SA are questioning the price offered by State Grid Corp of China to buy out minority shareholders in the unit  according to documents seen by Reuters.",
        "date": "10202017",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "UPDATE 1-Shareholders in CPFL Renovaveis in dispute with China's State Grid "
    },
    {
        "content": "SAO PAULO/BRASILIA  Oct 20 Minority shareholders in the renewable energy unit of Brazil´s power holding company CPFL Energia SA are questioning the price offered by State Grid Corp of China to buy out minority shareholders in the unit  newspaper Valor Economico reported on Friday.",
        "date": "10202017",
        "name": "CPFL Energia SA",
        "news_type": "normal",
        "symbol": "CPL",
        "title": "Shareholders in CPFL Renovaveis in dispute with China's State Grid "
    },
    {
        "content": "SAO PAULO  Sept 14 CPFL Energia SA  Brazil's largest private electricity company  wants to grow its power transmission business  including by bidding in coming rounds for new licenses to build and operate lines  a company executive told Reuters.",
        "date": "09142017",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "CPFL seeking to expand in Brazil's power transmission sector "
    },
    {
        "content": "SAO PAULO  May 3 Brazil's CPFL Energia SA   the country's largest private power company  on Wednesday launched a new firm called Envo with the aim of tapping the growing market for solar powered homes in Brazil.",
        "date": "05032017",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "Brazil's CPFL creates solar power company to sell home kits "
    },
    {
        "content": "SAO PAULO  Jan 24 CPFL Energia  Brazil's largest private power company  is eying acquisitions in power generation and distribution as an investment by China's State Grid boosts its growth plans  Chief Executive Officer André Dorf said on Tuesday.",
        "date": "01242017",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "UPDATE 1-Brazil power firm CPFL sees Chinese investment boosting expansion "
    },
    {
        "content": "SAO PAULO  Jan 23 State Grid Corp of China  on Monday took formal ownership of controlling stakes in Brazilian power utility CPFL Energia SA  five months after having signed the agreement for the acquisition.",
        "date": "01232017",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "State Grid takes formal ownership of Brazil's CPFL controlling stakes "
    },
    {
        "content": "SAO PAULO Former shareholders of Brazil's CPFL Energia SA  have handed over ownership of their stakes to State Grid Corp of China on Monday  which will automatically trigger a buyout of minority stakeholders  a person familiar with the matter said.",
        "date": "01232017",
        "name": "CPFL Energia SA",
        "news_type": "normal",
        "symbol": "CPL",
        "title": "Brazil's CPFL stake handover to State Grid to trigger minority buyout: source "
    },
    {
        "content": "SAO PAULO  Jan 23 Former shareholders of Brazil's CPFL Energia SA have handed over ownership of their stakes to State Grid Corp of China on Monday  which will automatically trigger a buyout of minority stakeholders  a person familiar with the matter said.",
        "date": "01232017",
        "name": "CPFL Energia SA",
        "news_type": "normal",
        "symbol": "CPL",
        "title": "Brazil's CPFL stake handover to State Grid to trigger minority buyout -source "
    },
    {
        "content": "SAO PAULO  Jan 6 Stricter legal and regulatory scrutiny may slow mergers and acquisitions in Brazil this year  compounding the impact of a harsh recession and lingering political turmoil that is keeping buyers and sellers at odds over valuations  bankers and lawyers said.",
        "date": "01062017",
        "name": "CPFL Energia SA",
        "news_type": "normal",
        "symbol": "CPL",
        "title": "UPDATE 2-Brazil's M&A deals may slow this year because of stricter due diligence "
    },
    {
        "content": "SAO PAULO  Jan 6 Stricter legal and regulatory scrutiny may slow mergers and acquisitions in Brazil this year  compounding the impact of a harsh recession and lingering political turmoil that is keeping buyers and sellers at odds over valuations  bankers and lawyers said.",
        "date": "01062017",
        "name": "CPFL Energia SA",
        "news_type": "normal",
        "symbol": "CPL",
        "title": "Stricter due diligence may slow Brazil M&A deals this year "
    },
    {
        "content": "SAO PAULO  Sept 28 Brazilian power company CPFL Energia SA shareholder Energia São Paulo Fundo de Investimento em Ações has decided to exercise tag-along rights in a deal with China's State Grid Corp  according to a securities filing by CPFL on Wendesday.",
        "date": "09282016",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "CPFL says shareholder Energia SP FIA to exercise tag-along rights "
    },
    {
        "content": "SAO PAULO  Sept 23 Brazilian power company CPFL Energia SA said on Monday that pension fund Previ will exercise its right to sell its holding in the company to China's State Grid  which has already bought a controlling stake in CPFL.",
        "date": "09232016",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "Brazil's CPFL says Previ fund to sell stake to State Grid "
    },
    {
        "content": "SAO PAULO  Sept 22 An investment holding company comprised of four Brazilian pension funds will decide on whether to accept State Grid Corp of China's bid for their combined stake in CPFL Energia SA on Sept. 27.",
        "date": "09222016",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "Brazil's Bonaire to decide on CPFL stake buyout on Sept. 27 "
    },
    {
        "content": "SAO PAULO  Sept 23 Brazil's largest pension fund Previ decided to sell its stake in power company CPFL Energia SA  to China's utility State Grid Corp  according to a CPFL securities filing on Friday.",
        "date": "09242016",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "UPDATE 1-Brazil Previ fund to sell CPFL stake to China's State Grid "
    },
    {
        "content": "FLORIANOPOLIS  Brazil Caixa de Previdência dos Funcionários do Banco do Brasil is inclined to accept State Grid Corp of China's bid for CPFL Energia SA   an electricity utility in which Brazil's largest pension fund has a 29.4 percent stake  Chief Executive Officer Gueitiro Genso said on Tuesday.",
        "date": "09132016",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "Brazil pension fund Previ inclined to sell CPFL stake "
    },
    {
        "content": "SAO PAULO State Grid Corp of China [STGRD.UL] plans to sign final terms of the purchase of a 23.6 percent stake in Brazilian power holding company CPFL Energia SA from conglomerate Camargo Correa SA as early as Friday  said a person directly involved in the matter.",
        "date": "09012016",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "State Grid to conclude Brazil's CPFL deal Friday: source "
    },
    {
        "content": "SAO PAULO  Aug 31 State Grid Corp of China  plans to sign final terms of the purchase of a 23.6 percent stake in Brazilian power holding company CPFL Energia SA from conglomerate Camargo Correa SA as early as Friday  said a person directly involved in the matter.",
        "date": "08312016",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "State Grid to conclude Brazil's CPFL deal Friday -source "
    },
    {
        "content": "* Brazilian engineering firm Camargo Correa says on Thursday in a market filing China's State Grid signed a letter of intent to buy its stake of power company CPFL Energia  though due diligence is still pending",
        "date": "08182016",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "BRIEF-Brazil's Camargo Correa says State Grid to buy stake of CPFL "
    },
    {
        "content": "SAO PAULO  Aug 19 Chinese power conglomerates are gradually becoming the dominant force in Brazil's electricity industry  where high debt  a harsh recession and less stringent takeover barriers than in other major markets have stoked a wave of acquisitions.",
        "date": "08192016",
        "name": "CPFL Energia SA",
        "news_type": "normal",
        "symbol": "CPL",
        "title": "Chinese power conglomerates becoming dominant forces in Brazil "
    },
    {
        "content": "By Bruno Federowski and Paula Arend Laier     SAO PAULO  July 4 Brazilian equities rose on Monday as shares of CPFL Energia SA jumped on news that the world's largest utility  China's State Grid International Development Ltd  will buy a controlling stake in the company for 5.85 billion reais ($1.8 billion).     CPFL led the gains in Brazil's benchmark Bovespa stock index  after Camargo Corrêa SA agreed to sell a 23 percent stake in the country's largest power distributor to the Chine",
        "date": "07042016",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "EMERGING MARKETS-Brazil stocks rise as CPFL jumps in thin trade "
    },
    {
        "content": "BRASILIA China's State Grid International Development Ltd has 20 billion reais ($6.02 billion) to buy minority stakes held by shareholders of CPFL Energia SA   two government sources told Reuters on Wednesday.",
        "date": "07062016",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "China's State Grid has $6 billion to buy CPFL minority stakes: sources "
    },
    {
        "content": " ",
        "date": "07052016",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "EMERGING MARKETS-Brazil stocks rise as CPFL jumps in thin trade "
    },
    {
        "content": "BRASILIA  July 6 China's State Grid International Development Ltd has 20 billion reais ($6.02 billion) to buy minority stakes held by shareholders of CPFL Energia SA  two government sources told Reuters on Wednesday.",
        "date": "07062016",
        "name": "CPFL Energia SA",
        "news_type": "normal",
        "symbol": "CPL",
        "title": "UPDATE 1-China's State Grid has $6 bln to buy CPFL minority stakes -sources "
    },
    {
        "content": "SAO PAULO CPFL Energia SA   Brazil's largest power distributor  said on Friday that the world's largest utility  China's State Grid International Development Ltd  will buy a controlling stake in the company for 5.85 billion reais ($1.8 billion).",
        "date": "07022016",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "China's State Grid to pay $1.8 billion for big stake in Brazil's CPFL "
    },
    {
        "content": "BRASILIA  June 22 Brazil's Energy Ministry has asked Wilson Ferreira Jr.  the outgoing chief executive officer of CPFL Energia SA  to become CEO of state-run energy company Centrais Eletricas Brasileiras SA  or Eletrobras  newspaper Valor Economico reported on Wednesday.",
        "date": "06222016",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "Brazil asks CPFL CEO to lead Eletrobras -paper "
    },
    {
        "content": "SAO PAULO  July 1 CPFL Energia SA  Brazil's largest power distributor  said on Friday that the world's largest utility  China's State Grid International Development Ltd  will buy a controlling stake in the company for 5.85 billion reais ($1.8 billion).",
        "date": "07022016",
        "name": "CPFL Energia SA",
        "news_type": "normal",
        "symbol": "CPL",
        "title": "UPDATE 1-China's State Grid to pay $1.8 bln for big stake in Brazil's CPFL "
    },
    {
        "content": "SAO PAULO  July 1 CPFL Energia SA  Brazil's largest power distributor  said on Friday that the world's largest utility  China's State Grid International Development Ltd  will buy a controlling stake in the company for 5.85 billion reais ($1.8 billion).",
        "date": "07022016",
        "name": "CPFL Energia SA",
        "news_type": "normal",
        "symbol": "CPL",
        "title": "China's State Grid to pay $1.8 bln for big stake in Brazil's CPFL "
    },
    {
        "content": "SAO PAULO  April 13 CPFL Energia SA  Brazil's largest non-government power holding company  said on Wednesday that Wilson Ferreira Jr will step down as chief executive officer on July 1  after 18 years at the helm of the group and some subsidiaries.",
        "date": "04132016",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "Brazil's CPFL CEO Ferreira to retire; Dorf tapped as replacement "
    },
    {
        "content": "SAO PAULO  Feb 5 U.S. power utility AES Corp  as well as Brazilian rivals CPFL Energia SA  and Equatorial Energia SA are among interested parties that have shown preliminary interest in buying state-controlled power distributor Centrais Elétricas de Goiás SA  a source briefed on the plan said.",
        "date": "02052016",
        "name": "CPFL Energia SA",
        "news_type": "topStory",
        "symbol": "CPL",
        "title": "AES  CPFL among interested in buying Brazil's Celg  source says "
    }
]