[
    {
        "content": "* PPC's shares fall by more than 2 pct (Releads  adds details  CRH response)",
        "date": "11132017",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "UPDATE 2-Ireland's CRH joins battle for South African cement maker PPC "
    },
    {
        "content": "BRUSSELS  Oct 31 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10312017",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "EU mergers and takeovers (Oct 31) "
    },
    {
        "content": "* ‍CRH has now received Ash Grove shareholder approval for proposed acquisition at a total consideration of $3.5 billion​ Source text for Eikon: Further company coverage: (Reporting By Rachel Armstrong)",
        "date": "10232017",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "BRIEF-Ash Grove shareholders approve $3.5 bln sale to CRH "
    },
    {
        "content": "DUBLIN  Oct 20 A majority of Ash Grove Cement's shareholders approved the sale of the U.S. cement maker to Ireland's CRH on Friday after a rival bid from Summit Materials failed to materialise.",
        "date": "10202017",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "Ash Grove approves sale to CRH after Summit drop out "
    },
    {
        "content": "* Ash Grove Cement Company announces stockholder approval of pending acquisition by CRH Plc",
        "date": "10202017",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "BRIEF-Ash Grove Cement announces stockholder approval of pending acquisition by CRH Plc "
    },
    {
        "content": "BRUSSELS  Oct 17 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "10172017",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "EU mergers and takeovers (Oct 17) "
    },
    {
        "content": "DUBLIN/LONDON Summit Materials  a U.S. construction firm set up by former CRH  executives  has made a rival offer for Ash Grove Cement   which CRH has agreed to pay $3.5 billion for  a source said.",
        "date": "10062017",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "Summit Materials makes $3.8 billion rival bid for Ash Grove Cement: source "
    },
    {
        "content": "* Fast-growing Summit run by former CRH executives (Adds Summit Materials statement  updates share price)",
        "date": "10062017",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "UPDATE 5-Summit Materials makes $3.8 bln rival bid for Ash Grove Cement - source "
    },
    {
        "content": "LONDON U.S. cement maker Summit Materials  has made a $3.8 billion offer for rival Ash Grove Cement   a source familiar with the matter told Reuters  hoping to trump an earlier takeover bid from Irish building materials firm CRH Plc .",
        "date": "10062017",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "Summit Materials makes $3.8 billion bid for Ash Grove Cement: source "
    },
    {
        "content": "LONDON  Oct 6 U.S. cement maker Summit Materials has made a $3.8 billion offer for rival Ash Grove Cement   a source familiar with the matter told Reuters  hoping to trump an earlier takeover bid from Irish building materials firm CRH Plc.",
        "date": "10062017",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "Summit Materials makes $3.8 bln bid for Ash Grove Cement - source "
    },
    {
        "content": "LONDON  Oct 6 Europe's major benchmarks were set to end a tumultuous week on a slightly softer note  with investors' focus turning from a separatist crisis in Catalonia to U.S. jobs data expected later in the day.",
        "date": "10062017",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "European stocks quiet ahead of U.S. jobs data  Spanish banks dip "
    },
    {
        "content": "* Says ‍proposed transaction remains subject to Ash Grove shareholder and regulatory approvals​ Source text for Eikon: Further company coverage:",
        "date": "10062017",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "BRIEF-CRH Plc says ‍proposed deal remains subject to Ash Grove shareholder  regulatory approvals​ "
    },
    {
        "content": "* Ash Grove cement company provides updates regarding pending acquisition by crh plc",
        "date": "10062017",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "BRIEF-Ash Grove receives third party offer at value of $3.7 bln to $3.8 bln "
    },
    {
        "content": "BRUSSELS  Sept 27 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "09272017",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "EU mergers and takeovers (Sept 27) "
    },
    {
        "content": "* CRH shares rise sharply as analysts see big synergies (Adds share price  quotes  details)",
        "date": "09212017",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "UPDATE 2-CRH reinforces U.S. grip with $3.5 bln Ash Grove Cement deal "
    },
    {
        "content": "* Deal will be financed through existing financial resources Source text for Eikon: Further company coverage:",
        "date": "09212017",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "BRIEF-CRH to buy Ash Grove Cement for $3.5 bln "
    },
    {
        "content": "Sept 20 Irish building materials firm CRH Plc said it would buy U.S. cement maker Ash Grove Cement Co for a total consideration of $3.5 billion.",
        "date": "09212017",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "Building materials firm CRH to buy Ash Grove Cement in $3.5 bln deal "
    },
    {
        "content": "* CRH CEO says UK market looks fairly stable for rest of year and into 2018 after Brexit volatility",
        "date": "08242017",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "BRIEF-CRH not anticipating any more large divestments over medium term "
    },
    {
        "content": "DUBLIN  Aug 24 CRH  has sold its U.S. distribution business to Beacon Roofing Supply Inc. for $2.63 billion in cash and will use the proceeds for acquisitions elsewhere  the Irish building materials group said on Thursday.",
        "date": "08242017",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "CRH sells U.S. distribution arm to Beacon Roofing for $2.6 billion "
    },
    {
        "content": "* Acquisition opens new markets for Beacon Roofing Supply (Adds details  share price  analyst quote)",
        "date": "08242017",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "UPDATE 1-CRH sells U.S. distribution arm to Beacon Roofing for $2.6 billion "
    },
    {
        "content": "* Shares in CRH rise 4.5 percent after it sells u.s. Distribution business to beacon roofing for $2.6 billion Source text for Eikon: Further company coverage: (Reporting By Padraic Halpin)",
        "date": "08242017",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "BRIEF-CRH shares up 4.5 pct after $2.6 bln sale of U.S. distribution arm "
    },
    {
        "content": "* BEACON ROOFING SUPPLY TO ACQUIRE ALLIED BUILDING PRODUCTS FROM CRH FOR $2.625 BILLION IN CASH",
        "date": "08242017",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "BRIEF-Beacon Roofing Supply to buy Allied Building Products from CRH for $2.63 bln "
    },
    {
        "content": "* H1 pretax profit 517 million euros versus 407 million eur year ago",
        "date": "08242017",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "BRIEF-CRH H1 earnings up 5 pct y/y  ramps up acquisition spend "
    },
    {
        "content": "* Cash tender offer by its wholly owned unit  Crh America with respect to any and all of its outstanding 8.125 pct notes due 2018 issued by Crh America Source text for Eikon: Further company coverage:",
        "date": "05022017",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "BRIEF-CRH announces any and all cash tender offer by Crh America "
    },
    {
        "content": "DUBLIN  March 1 Strong earnings growth and cash generation last year drove shares in building materials group CRH  higher on Wednesday as it awaited a further  medium-term boost to infrastructure under U.S. President Donald Trump.",
        "date": "03012017",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "CRH earnings up as Trump infrastructure boost seen in medium term "
    },
    {
        "content": "DUBLIN  Nov 17 Building materials group CRH   expects to benefit from an increase in infrastructure spending in the United States even without president-elect Donald Trump's plans for a major boost  its chief executive said on Thursday.",
        "date": "11172016",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "CRH sees big U.S. infrastructure boost regardless of Trump plans "
    },
    {
        "content": "* CRH group transformation director says has 1.5-2 billion euro capacity for acquisitions in next 12-18 months  pipeline good  Further company coverage:    (Reporting By Padraic Halpin)",
        "date": "11172016",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "BRIEF-CRH says has capacity for 1.5-2 billion euro in acquisitions "
    },
    {
        "content": "DUBLIN  March 18 Building materials companies CRH and LafargeHolcim are contesting the final price of CRH's acquisition of assets from the Swiss-French company  the two companies said.",
        "date": "03182016",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "CRH  LafargeHolcim contest final price of 2015 deal "
    },
    {
        "content": "DUBLIN  Nov 18 Irish building materials group CRH  expects strong growth in the United States to drive an increase in full-year earnings of around 25 percent  and more when a string of recent acquisitions are included.",
        "date": "11192015",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "CRH sees earnings up sharply on U.S construction demand "
    },
    {
        "content": "DUBLIN Ireland's CRH   bought U.S. glazing products manufacturer CR Laurence for $1.3 billion on Thursday and said this would be its last big acquisition for the next year or two.",
        "date": "08272015",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "CRH completes deal push with $1.3 billion purchase of U.S. glass firm "
    },
    {
        "content": "* H1 profit from continuing operations up 29 pct y/y   (Adds detail on auction  CRL figures)",
        "date": "08272015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "UPDATE 1-CRH completes deal push with $1.3 bln purchase of U.S. glass firm "
    },
    {
        "content": "DUBLIN  Aug 27 Ireland's CRH   bought U.S. glazing products manufacturer CR Laurence for $1.3 billion on Thursday and said this would be its last acquisition of that size for the next year or two after a surge in M&A.",
        "date": "08272015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "CRH ends acquisition push with $1.3 bln purchase of U.S. glass firm "
    },
    {
        "content": "LONDON  May 27 Britain's top share index bounced back on Wednesday from a two-week low the day before as acquisitions boosted Imperial Tobacco  cement maker CRH  and International Consolidated Airlines Group.",
        "date": "05272015",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "UK FTSE rises on acquisition activity and hopes for Greek deal "
    },
    {
        "content": "LONDON  May 27 Britain's top share index bounced back on Wednesday from a two-week low hit the day before as acquisitions activity boosted Imperial Tobacco  cement maker CRH and  International Consolidated Airlines Group .",
        "date": "05272015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "UK FTSE rises as acquisition plans boost CRH  Imperial Tobacco "
    },
    {
        "content": "LONDON  May 27 European shares rebounded from a one-week low on Wednesday with the construction and materials sector leading the market higher after Holcim and Lafarge agreed with CRH on divestment plans.",
        "date": "05272015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "Construction  material firms help European shares to rebound "
    },
    {
        "content": "LONDON  May 27 European shares rebounded from a one-week low on Wednesday  with the construction and materials sector leading the market higher after Holcim and Lafarge agreed with CRH on their divestment plans.",
        "date": "05272015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "Construction and material firms help European shares to rebound "
    },
    {
        "content": "DUBLIN  May 6 Ireland's CRH expects earnings to increase by 10 percent in the first half and improve for the year as a whole as it prepares to complete a major acquisition that will turn it into the world's third-biggest building materials supplier.",
        "date": "05062015",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "Building supplies group CRH sees earnings rising  Europe improving "
    },
    {
        "content": "BRUSSELS  April 27 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "04272015",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "EU mergers and takeovers (April 27) "
    },
    {
        "content": "BRUSSELS  April 24 EU antitrust regulators on Friday cleared Irish cement firm CRH's planned 6.5 billion euro ($7.1 billion) purchase of a number of mostly European assets from rivals Lafarge and Holcim",
        "date": "04242015",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "EU clears CRH purchase of some Lafarge and Holcim assets "
    },
    {
        "content": "LONDON  March 30 Britain's top share index rose on Monday  recovering ground in a broad-based rally after a steep weekly drop  supported by a rise in chip-designer ARM  after gains for the tech sector on Wall Street and a stronger Kingfisher.",
        "date": "03302015",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "ARM and Kingfisher help Britain's FTSE to bounce back "
    },
    {
        "content": "LONDON  March 30 Britain's top share index rose on Monday  recovering ground in a broad-based rally after a steep weekly drop  supported by a rise in chip-designer ARM  after gains for the tech sector on Wall Street.",
        "date": "03302015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "Britain's FTSE recovers from steep weekly fall  lifted by ARM "
    },
    {
        "content": "LONDON  March 20 Britain's top share index hit record highs on Friday  moving above 7 000 points for the first time in its history.",
        "date": "03202015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "UK's FTSE races to record highs as CRH climbs "
    },
    {
        "content": "BRUSSELS  March 19 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "03192015",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "EU mergers and takeovers (March 19) "
    },
    {
        "content": "March 19 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Thursday:",
        "date": "03192015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON  March 20 Britain's top share index rose to a new record high on Friday  led by Irish cement firm CRH which surged on expectations of lucrative European asset purchases.",
        "date": "03202015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "UK's FTSE hits new record highs as CRH climbs "
    },
    {
        "content": "DUBLIN  March 19 Irish cement firm CRH  is assuming the merger of rivals Lafarge and Holcim  will still happen  its chief said after CRH shareholders approved an asset purchase that depends on the deal.",
        "date": "03192015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "RPT-UPDATE 2-Cement rival CRH assumes Lafarge  Holcim deal will work "
    },
    {
        "content": "LONDON  March 20 Britain's top share index touched new record highs on Friday  led by Irish cement firm CRH which rose on expectations of lucrative European asset purchases.",
        "date": "03202015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "UK's FTSE touches new record highs as CRH climbs "
    },
    {
        "content": "LONDON  March 20 Britain's top share index notched up a new peak on Friday  with Irish cement firm CRH leading the market higher on expectations of European assets purchases from Lafarge and Holcim  and Tullow Oil gaining after it raised extra cash.",
        "date": "03202015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "CRH  Tullow help Britain's FTSE set new record high "
    },
    {
        "content": "DUBLIN  March 19 Irish cement firm CRH  is assuming the merger of rivals Lafarge and Holcim  will still happen  its chief said after CRH shareholders approved an asset purchase that depends on the deal.",
        "date": "03192015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "UPDATE 2-Cement rival CRH assumes Lafarge  Holcim deal will work "
    },
    {
        "content": "BRUSSELS  March 19 European Union antitrust regulators will rule by April 27 whether to approve Irish cement firm CRH's plan to buy assets from merging companies Lafarge and Holcim  the European Commission said on Thursday.",
        "date": "03192015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "EU to rule on CRH bid for Lafarge  Holcim assets by April 27 "
    },
    {
        "content": "LONDON  March 16 Britain's top share index rebounded on Monday after its biggest weekly drop of 2015  with mining stocks boosting the market on expectations of steady economic growth in China  the world's biggest metals consumer.",
        "date": "03162015",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "Stronger miners and Tesco help FTSE to close higher "
    },
    {
        "content": "DUBLIN  March 19 Shareholders at Ireland's CRH  approved a 6.5 billion euro ($6.93 billion) deal to buy assets from Lafarge and Holcim as their rivals scrambled to save a merger that the asset sales hinge on.",
        "date": "03192015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "CRH shareholders approve asset purchases from Lafarge  Holcim "
    },
    {
        "content": "LONDON  March 16 Britain's top share index rebounded on Monday after its biggest weekly drop of 2015  with Tesco leading the market higher on a report that WPP was eyeing a majority stake in the Dunnhumby customer data unit of the world's third-biggest retailer.",
        "date": "03162015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "Stronger Tesco and miners help FTSE to bounce back "
    },
    {
        "content": "LONDON  March 9 Britain's top share index extended its retreat from record highs on Monday  pulled down by property shares as a rise in gilt yields eroded the appeal of interest rate-sensitive stocks.",
        "date": "03092015",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "Property stocks lead FTSE down further from record highs "
    },
    {
        "content": "LONDON  March 16 Britain's top share index rose on Monday  recovering from its biggest weekly drop of 2015  with mining stocks leading the market higher on expectations of steady economic growth in China  the world's biggest metals consumer.",
        "date": "03162015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "UK's FTSE rebounds  led by mining shares; CRH slips "
    },
    {
        "content": "LONDON  March 9 Britain's top share index extended its retreat from record highs on Monday as property shares fell as a rise in gilt yields made interest rate-sensitive stocks paying similar dividends less attractive than lower-risk government debt.",
        "date": "03092015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "FTSE extends retreat from record highs as property stocks fall "
    },
    {
        "content": "LONDON  March 16 Britain's top share index edged higher on Monday  recovering from its biggest weekly drop of 2015 to head back towards all-time highs hit earlier this month  buoyed by a rally in financials.",
        "date": "03162015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "FTSE tentatively rallies after biggest weekly drop of 2015 "
    },
    {
        "content": "* Shares fall on lack of clear outlook   (Adds fresh CEO quotes  analyst  share price)",
        "date": "02262015",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "UPDATE 1-CRH eyes European recovery as yearly earnings up 11 percent "
    },
    {
        "content": "DUBLIN  Feb 26 Earnings at Ireland's CRH  rose for the first time in three years in 2014  ahead of its acquisition of assets from rivals that will transform it into the world's third-biggest building materials supplier.",
        "date": "02262015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "CRH yearly earnings up 11 pct as U.S. recovery gains momentum "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  February 05 (Fitch) Fitch Ratings has affirmed Switzerland-based  building materials group Holcim Ltd's (Holcim) Long-term Issuer Default Ratings  (IDR) at 'BBB' with Stable Outlook  This follows the announcement that Holcim  and Lafarge S.A. will jointly sell their global portfolio of assets to CRH for  an enterprise value of EUR6.5bn. A full list of rating actions is provided at  the end of this commentary. The affirmation ref",
        "date": "02052015",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "Fitch Affirms Holcim at 'BBB'; Outlook Stable "
    },
    {
        "content": "DUBLIN  Feb 1 Irish building supplies group CRH  said on Sunday it had agreed to pay 6.5 billion euros for assets Lafarge and Holcim were obliged to sell ahead of their planned merger.",
        "date": "02012015",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "UPDATE 2-CRH to buy Lafarge  Holcim assets for 6.5 bln euros "
    },
    {
        "content": "* Budget airlines fall after Ryanair update   (Adds quote  updates prices)",
        "date": "02022015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "CRH surge leads Britain's FTSE to modest gains "
    },
    {
        "content": "LONDON  Feb 2 Irish building supply firm CRH  is likely to price its accelerated bookbuild at 16.50 euros a share  after investors were told that orders below that sum risked missing out  two sources familiar with the matter said on Monday.",
        "date": "02022015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "CRH likely to price accelerated bookbuild at 16.50 euros a share - sources "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Here is a deal with all the red flags of M&A - ambition  leverage and a jumbo share placing. Yet the market is spurring on CRH's 6.5 billion euro ($7.4 billion) purchase of surplus assets from European cement rivals Lafarge and Holcim. The traditional criteria for judging such deals don't apply.",
        "date": "02022015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "Breakingviews: CRH's $7.4 bln buy reveals M&A tolerance "
    },
    {
        "content": "* CRH shares jump as much as 7 percent   (Adds CEO  analyst  quotes  background  details  updates shares)",
        "date": "02022015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "UPDATE 5-Ireland's CRH to buy Lafarge  Holcim assets for $7.4 bln "
    },
    {
        "content": "LONDON  Feb 2 Banks have lined up a 6.5 billion euro ($7.37 billion) bridge loan to back Irish building supplies group CRH's 6.5 billion euro acquisition of assets that rivals Lafarge and Holcim needed to sell ahead of their planned merger  CRH announced.",
        "date": "02022015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "TRLPC-CRH backs Lafarge Holcim asset buy with 6.5 bln euro bridge loan "
    },
    {
        "content": "LONDON  Feb 2 Britain's top share index edged up in morning trading on Monday  with Irish building supplies groups CRH leading the market higher after agreeing to buy assets from rivals.",
        "date": "02022015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "FTSE gains  CRH leads as asset purchase deal seen positive "
    },
    {
        "content": "LONDON  Feb 2 Books are covered for an accelerated bookbuild by CRH to help fund the Irish building supply group's acquisition of assets from cement firms Holcim and Lafarge  a source familiar with the matter said on Monday.",
        "date": "02022015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "Books covered for CRH placement to fund Lafarge  Holcim asset buy - source "
    },
    {
        "content": "FRANKFURT/LONDON  Jan 22 Irish cement maker CRH  and a consortium led by Blackstone are battling for assets which Lafarge and Holcim must sell ahead of their planned merger  several people familiar with the matter said.",
        "date": "01222015",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "UPDATE 1-CRH races Blackstone for Holcim  Lafarge assets -sources "
    },
    {
        "content": "* Shares up 1.2 percent after agreed to pay 6.5 billion euros for lafarge  holcim assets  Source text for Eikon:  Further company coverage:    (Reporting By Padraic Halpin)",
        "date": "02022015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "BRIEF-CRH shares rise after deal to buy Lafarge  Holcim assets "
    },
    {
        "content": "FRANKFURT/LONDON  Jan 22 Irish cement maker CRH  and a consortium led by Blackstone will battle for the assets which Lafarge and Holcim must sell ahead of their planned merger  several people familiar with the matter said.",
        "date": "01222015",
        "name": "CRH PLC",
        "news_type": "normal",
        "symbol": "CRH",
        "title": "CRH races Blackstone for Holcim  Lafarge assets -sources "
    },
    {
        "content": "DUBLIN  Jan 8 Irish building supplies group CRH  on Thursday said it generated 350 million euros ($413 million) from disposals last year with another 295 million due in the coming months as it streamlines ahead of possible bids for assets of rivals Lafarge and Holcim.",
        "date": "01082015",
        "name": "CRH PLC",
        "news_type": "topStory",
        "symbol": "CRH",
        "title": "CRH disposals set stage for possible Lafarge-Holcim asset bids "
    }
]