[
    {
        "content": "Nov 6 Cloud-based software maker Salesforce.com Inc said on Monday it has entered into a partnership with Google's cloud platform G Suite  to support its rapidly growing global customer base.",
        "date": "11062017",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce  Google form cloud partnership "
    },
    {
        "content": "Nov 6 Cloud-based software maker Salesforce.com Inc said on Monday it has entered into a partnership with Google's cloud platform G Suite  to support its rapidly growing global customer base.",
        "date": "11062017",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 1-Salesforce  Google form cloud partnership "
    },
    {
        "content": "* Salesforce.Com - ‍as part of agreement  co has named Google cloud as preferred public cloud provider to support co's growing global customer base​ Source text for Eikon: Further company coverage:",
        "date": "11062017",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce and Google form new strategic partnership "
    },
    {
        "content": "TORONTO  Oct 11 Short-seller Andrew Left of Citron Research said on Wednesday  he was investigating various aspects of software company Shopify Inc's business and would \"most likely\" publish a follow-up to an Oct. 4 report that sent its shares plunging.",
        "date": "10112017",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 2-Citron's Left says follow-up report on Shopify likely "
    },
    {
        "content": "SAN FRANCISCO  Sept 19 The venture wing of Salesforce.com Inc is launching a $50 million fund to invest in start-ups employing artificial intelligence  the cloud computing firm told Reuters on Tuesday.",
        "date": "09192017",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce to launch $50 million artificial intelligence fund "
    },
    {
        "content": "* Salesforce announces appointment of Bernard J Tyson to its board of directors",
        "date": "09082017",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce appoints Bernard Tyson to its board of directors "
    },
    {
        "content": "Aug 22 Salesforce.com Inc posted a quarterly profit that beat analysts' estimates as it invested heavily to fend off competition in the cloud-based software sector.",
        "date": "08222017",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "UPDATE 3-Salesforce.com profit beats estimates  shares dip after hours "
    },
    {
        "content": "Aug 22 Salesforce.com Inc reported a 25.8 percent rise in quarterly revenue  helped by strong demand for its cloud-based sales and marketing software.",
        "date": "08222017",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce quarterly revenue jumps 25.8 pct "
    },
    {
        "content": "* Third Point LLC takes share stake of 2.7 million shares in NXP Semiconductors",
        "date": "08112017",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Third Point LLC dissolves stake in Alcoa  Salesforce.Com "
    },
    {
        "content": "* Third Point LLC cuts share stake in Charter Communications Inc by 37.5 percent to 500 000 Class A shares - SEC filing",
        "date": "08112017",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "BRIEF-Third Point cuts share stake in Charter Communications  Sherwin-Williams "
    },
    {
        "content": "* Salesforce.Com Inc- ‍announced that it is now live on Amazon web service cloud infrastructure in Canada​ Source text for Eikon: Further company coverage:",
        "date": "07122017",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce.Com now live on Amazon web service cloud infrastructure in Canada​ "
    },
    {
        "content": "* salesforce.com inc - ‍announced a new $50 million fund from Salesforce Ventures  company's corporate investment group.​ Source text for Eikon: Further company coverage:",
        "date": "05312017",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce ‍announces new $50 million fund from Salesforce Ventures​ "
    },
    {
        "content": "* Salesforce announces strategic agreement with dell technologies Source text for Eikon: Further company coverage:",
        "date": "05242017",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce signs strategic agreement with Dell Technologies "
    },
    {
        "content": "Salesforce.com Inc  allayed concerns about a slowing pace of growth after it reported quarterly deferred revenue that came above its estimate on Thursday.",
        "date": "05182017",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Salesforce's strong results allay slowing growth concerns "
    },
    {
        "content": "May 18 Salesforce.com Inc allayed concerns about a slowing pace of growth after it reported quarterly deferred revenue that came above its estimate on Thursday.",
        "date": "05182017",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 2-Salesforce's strong results allay slowing growth concerns "
    },
    {
        "content": "* Q1 earnings per share view $0.26 -- Thomson Reuters I/B/E/S",
        "date": "05182017",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce.com posts Q1 GAAP loss per share $0.01 "
    },
    {
        "content": "May 18 Salesforce.com Inc reported a 24.6 percent rise in quarterly revenue  boosted by strong demand for its cloud-based sales and marketing software.",
        "date": "05182017",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce quarterly revenue rises 24.6 pct "
    },
    {
        "content": "* Salesforce expands relationship with Dell  signs multi-year commitment to use Dell EMC Infrastructure and Dell laptops",
        "date": "05042017",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Dell Inc says Salesforce expands relationship with Dell "
    },
    {
        "content": "* CEO Marc Benioff's 2017 total compensation was $13.2 million versus $33.4 million in 2016",
        "date": "04262017",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce.Com CEO's 2017 total compensation was $13.2 mln "
    },
    {
        "content": "SAN FRANCISCO Microsoft Corp  is rolling out upgrades to its sales software that integrates data from LinkedIn  an initiative that Microsoft CEO Satya Nadella told Reuters was central to the company's long-term strategy for building specialized business software.",
        "date": "04242017",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Microsoft's Nadella banks on LinkedIn data to challenge Salesforce "
    },
    {
        "content": "SAN FRANCISCO  April 24 Microsoft Corp is rolling out upgrades to its sales software that integrates data from LinkedIn  an initiative that Microsoft CEO Satya Nadella told Reuters was central to the company's long-term strategy for building specialized business software.",
        "date": "04242017",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "CORRECTED-Microsoft's Nadella banks on LinkedIn data to challenge Salesforce "
    },
    {
        "content": "* Quintiles IMS Holdings Inc - announced an alliance with Salesforce",
        "date": "04242017",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "BRIEF-Quintiles IMS Holdings Inc announces an alliance with Salesforce "
    },
    {
        "content": "* Salesforce to deliver Salesforce intelligent customer success platform to customers in Australia using Amazon web services cloud infrastructure  Source text for Eikon:  Further company coverage:",
        "date": "03212017",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce to deliver intelligent customer success platform to customers in Australia "
    },
    {
        "content": "March 10 U.S. automaker Ford Motor Co said on Friday it had elected former Salesforce.com Inc executive Lynn Vojvodich to its board of directors.",
        "date": "03102017",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Ford names tech executive Lynn Vojvodich to board "
    },
    {
        "content": "* IBM - partnership will bring new insights from Watson directly into the Salesforce intelligent customer success platform  Source text for Eikon:  Further company coverage:",
        "date": "03062017",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-IBM and Salesforce announce global strategic partnership "
    },
    {
        "content": "Salesforce.com Inc  raised its revenue forecast for its full fiscal year to slightly above analysts expectations but lowered its outlook for its next quarter to a lower-than-expected profit  sending its shares down 2 percent in extended trading on Tuesday.",
        "date": "03012017",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Salesforce.com forecasts lower-than-expected Q1 profit; shares fall "
    },
    {
        "content": "* Raises FY18 revenue guidance   (Adds details from conference call  analyst comments  updates share price)",
        "date": "02282017",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "UPDATE 3-Salesforce.com forecasts lower-than-expected Q1 profit; shares fall "
    },
    {
        "content": "* Says Infosys joins Salesforce partner ecosystem to deliver analytics cloud applications",
        "date": "02072017",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Infosys Ltd joins Salesforce partner ecosystem to deliver analytics cloud applications "
    },
    {
        "content": "* In coming months  salesforce plans to double its workforce in Bellevue to nearly 500  Source text for Eikon:  Further company coverage:",
        "date": "01182017",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce.Com to open its new office in Bellevue "
    },
    {
        "content": "* Salesforce.com says effective November 22   compensation committee approved changes to compensation arrangements of Marc Benioff  principal executive officer",
        "date": "11282016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce.com's compensation committee approved changes to compensation arrangements of Marc Benioff  principal executive officer "
    },
    {
        "content": "* Salesforce.com Inc COO Keith Block - expanded Amazon relationship in Q3 - conf call",
        "date": "11172016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce says won customers including Citigroup  PNC Bank in Q3 "
    },
    {
        "content": "SAN FRANCISCO Salesforce.com Inc on Thursday forecast current-quarter revenue above analysts' estimates as it closed deals for its  cloud-based sales and marketing software with a number of major customers  sending its shares 5 percent higher in extended trade.",
        "date": "11182016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Salesforce's revenue forecast beats estimates  shares rise "
    },
    {
        "content": "Nov 17 Salesforce.com Inc reported a 25.3 percent jump in quarterly revenue on Thursday  as more businesses used its cloud-based sales and marketing software.",
        "date": "11172016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce's quarterly revenue jumps 25.3 pct "
    },
    {
        "content": "SAN FRANCISCO  Nov 17 Salesforce.com Inc  on Thursday forecast current-quarter revenue above analysts' estimates as it closed deals for its  cloud-based sales and marketing software with a number of major customers  sending its shares 5 percent higher in extended trade.",
        "date": "11182016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 3-Salesforce's revenue forecast beats estimates  shares rise "
    },
    {
        "content": "Nov 17 Salesforce.com Inc on Thursday forecast current-quarter revenue above analysts' estimates as more businesses adopted its cloud-based sales and marketing software  sending its shares 5 higher in extended trade.",
        "date": "11182016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "REFILE-UPDATE 2-Salesforce's revenue forecast beats estimates  shares rise "
    },
    {
        "content": "* Salesforce.com sold $348.2 million in equity financing - SEC Filing  Source text for Eikon: (http://bit.ly/2fasp5W) Further company coverage:",
        "date": "11022016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce.com sold $348.2 mln in equity financing - SEC Filing "
    },
    {
        "content": "* Confirms The Financial Times report that said Salesforce walked away from Twitter bid -spokesperson  Further company coverage:",
        "date": "10142016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce confirms FT report that Salesforce walks away from Twitter bid "
    },
    {
        "content": "* Indexes up: Dow 0.2 pct  S&P 0.02 pct  Nasdaq 0.02 pct   (Updates to close)",
        "date": "10142016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "US STOCKS-Wall St's gains fade as Yellen questions economy's resilience "
    },
    {
        "content": "* Indexes up: Dow 0.5 pct  S&P 0.3 pct  Nasdaq 0.2 pct   (Updates to late afternoon)",
        "date": "10142016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "US STOCKS-Wall St up in volatile trade following Yellen comments "
    },
    {
        "content": "* Salesforce CEO says in interview with FT - \"We've walked away from twitter bid  it wasn't the right fit for us\"  Source text - http://on.ft.com/2eb3Hn8 Further company coverage:    (Bengaluru Newsroom)",
        "date": "10142016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce CEO says in interview with FT - \"We've walked away from Twitter bid  it wasn't the right fit for us\" "
    },
    {
        "content": "FLORENCE  Italy  Oct 14 Microsoft  sought EU antitrust approval on Friday for its $26 billion bid for social network LinkedIn  a spokesman said on Friday  kicking off a month-long review by regulators of its largest deal.",
        "date": "10142016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Microsoft seeks EU approval for LinkedIn buy "
    },
    {
        "content": "Salesforce.com Inc  is still deliberating whether it should make an offer for Twitter Inc  in the face of resistance from Salesforce shareholders over the strategic merits and valuation of such a deal  people familiar with the matter said on Monday. | Video ",
        "date": "10102016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Salesforce still mulls bid for Twitter as shareholders resist: sources "
    },
    {
        "content": "Oct 10 Salesforce.com Inc is still deliberating whether it should make an offer for Twitter Inc  in the face of resistance from Salesforce shareholders over the strategic merits and valuation of such a deal  people familiar with the matter said on Monday.",
        "date": "10102016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce still mulls bid for Twitter as shareholders resist -sources "
    },
    {
        "content": "* There are still other potential bidders beyond Salesforce taking a look at Twitter- CNBC  citing sources",
        "date": "10062016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-There are still other potential bidders beyond Salesforce taking a look at Twitter - CNBC  citing sources "
    },
    {
        "content": "Twitter Inc has told potential acquirers it is seeking to conclude negotiations about selling itself by the time it reports third-quarter earnings on Oct. 27  according to people familiar with the matter.",
        "date": "10062016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Exclusive: Twitter to conclude sale deliberations this month - sources "
    },
    {
        "content": "* Company entered into an agreement and plan of reorganization ( \"merger agreement\") to acquire krux",
        "date": "10032016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce.com to acquire Krux "
    },
    {
        "content": "* Salesforce agrees to buy data startup Krux; Salesforce is paying about $700 million split equally in cash and stock- WSJ  Source (http://on.wsj.com/2cOkl5O)",
        "date": "10032016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce agrees to buy marketing-data startup Krux - WSJ "
    },
    {
        "content": "BRUSSELS U.S. software company Salesforce called on EU regulators on Thursday to investigate antitrust issues related to Microsoft's $26 billion bid for social network LinkedIn.",
        "date": "09302016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce urges EU to probe Microsoft  Linkedin antitrust issues "
    },
    {
        "content": "BRUSSELS  Sept 29 U.S. software company Salesforce called on EU regulators on Thursday to investigate antitrust issues related to Microsoft's $26 billion bid for social network LinkedIn.",
        "date": "09292016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Salesforce urges EU to probe Microsoft  Linkedin antitrust issues "
    },
    {
        "content": "* Salesforce.com has raised concerns with Europe's antitrust authorities about Microsoft-Linkedin deal - NYT  citing sources  Source text - http://nyti.ms/2cOr3Mt Further company coverage:    (Bengaluru Newsroom)",
        "date": "09292016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce.com has raised concerns with europe's antitrust authorities about Microsoft-Linkedin deal - NYT  citing sources "
    },
    {
        "content": "BRUSSELS  Sept 29 U.S. software company Salesforce called on EU regulators on Thursday to investigate antitrust issues related to Microsoft's $26 billion bid for social network LinkedIn.",
        "date": "09302016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 1-Salesforce urges EU to probe Microsoft  Linkedin antitrust issues "
    },
    {
        "content": "* Twitter moving closer to sale  has received expressions of interest; no sale is imminent - CNBC  citing sources",
        "date": "09232016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Twitter may receive formal bid shortly  suitors said to include Salesforce and Google - CNBC  citing sources "
    },
    {
        "content": "SAN FRANCISCO  Sept 27 With speculation mounting that Twitter Inc will soon have a new corporate owner  the 10-year-old social networking service - which has long struggled to define its core purpose -may end up heading in one of several distinctly different directions depending on who ends up paying for it.",
        "date": "09272016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "RPT-Twitter could take many forms  depending on new owner "
    },
    {
        "content": "SAN FRANCISCO  Sept 26 With speculation mounting that Twitter Inc will soon have a new corporate owner  the 10-year-old social networking service - which has long struggled to define its core purpose -may end up heading in one of several distinctly different directions depending on who ends up paying for it.",
        "date": "09272016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Twitter could take many forms  depending on new owner "
    },
    {
        "content": "* Collaboration integrations are expected to be available in second half of 2017",
        "date": "09222016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Cisco  Salesforce announce global strategic alliance "
    },
    {
        "content": "* Salesforce.com Inc files Form D with U.S. SEC saying it raised about $93.3 million in equity financing - SEC filing  Source text: (http://bit.ly/2chrjUS) Further company coverage:",
        "date": "09062016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce says it raised about $93.3 mln in equity financing "
    },
    {
        "content": "* Selling stockholders may offer and resell up to 1.2 million shares of Salesforce  Source text: [http://bit.ly/2bUshFo] Further company coverage:",
        "date": "09062016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce.Com selling stockholders may offer and resell up to 1.2 million shares of salesforce "
    },
    {
        "content": "Cloud software maker Salesforce.com Inc  forecast third-quarter revenue below estimates as it saw some softness  primarily in the United States  sending the company's shares down by 7.7 percent in extended trading.",
        "date": "08312016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Salesforce third-quarter revenue forecast misses  shares fall "
    },
    {
        "content": "* Q2 earnings per share view $0.22 -- Thomson Reuters I/B/E/S",
        "date": "08312016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce Q2 non-GAAP EPS $0.24 "
    },
    {
        "content": "Aug 31 Cloud software maker Salesforce.com Inc  reported a 25 percent rise in quarterly revenue as demand for its web-based sales and marketing software increased.",
        "date": "08312016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce.com's quarterly revenue rises 25 percent "
    },
    {
        "content": "* Agreed to assume stock options and other equity awards of quip",
        "date": "08012016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce.com to buy Quip for about $582 mln "
    },
    {
        "content": "Cloud-based software maker Salesforce.com Inc  said on Monday it agreed to acquire document-editing startup Quip for about $582 million.",
        "date": "08012016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce to buy document-editing startup Quip for about $582 million "
    },
    {
        "content": "Aug 1 Cloud-based software maker Salesforce.com Inc said on Monday it agreed to acquire document-editing startup Quip for about $582 million.",
        "date": "08012016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce to buy document-editing startup Quip for about $582 mln "
    },
    {
        "content": "* Sam's club chooses Salesforce to digitally transform its membership engagement  Source text for Eikon:  Further company coverage:",
        "date": "07282016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Sam's Club selects Salesforce to change membership engagement "
    },
    {
        "content": "* Co and unit entered into a credit agreement on July 7  2016",
        "date": "07112016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce.com says Co and unit entered into a credit agreement on July 7- SEC filing "
    },
    {
        "content": "* Salesforce completes acquisition of Demandware  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "07112016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce completes acquisition of Demandware "
    },
    {
        "content": "* Salesforce and Demandware announce early termination of Hart-Scott-Rodino waiting period  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "06202016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce and Demandware announce early termination of Hart-Scott-Rodino waiting period "
    },
    {
        "content": "* Salesforce also made a bid for LinkedIn  CEO Benioff confirms- Recode",
        "date": "06172016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce also made a bid for LinkedIn  CEO Benioff confirms- Recode "
    },
    {
        "content": "June 13 Cloud computing giant Salesforce.com Inc  said prominent computer hacking expert Trey Ford will join the company's Heroku unit as its head of trust  starting on Monday.",
        "date": "06132016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce.com Inc hires prominent hacking expert Trey Ford "
    },
    {
        "content": "Cloud-based software maker Salesforce.com Inc  said on Wednesday it would buy Demandware Inc   whose software is used by businesses to run e-commerce websites  for about $2.8 billion. | Video ",
        "date": "06012016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Salesforce takes aim at e-commerce with $2.8 billion Demandware buy "
    },
    {
        "content": "* High premium indicative of bidding war for Demandware - analyst",
        "date": "06012016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 4-Salesforce takes aim at e-commerce with $2.8 bln Demandware buy "
    },
    {
        "content": "* Entered into a commitment letter pursuant to which  bank of america  n.a. Has committed to provide a $500 million term loan - sec filing",
        "date": "06012016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce.com says intends to fund Demandware deal with cash on hand and up to $500 mln under new term loan "
    },
    {
        "content": "* Required to pay salesforce.com inc a termination fee of $107 million under certain circumstances - sec filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06012016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "BRIEF-Demandware required to pay Salesforce.com termination fee of $107 mln "
    },
    {
        "content": "* Salesforce signs definitive agreement to acquire Demandware",
        "date": "06012016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce to buy Demandware in $2.8 bln deal "
    },
    {
        "content": "June 1 Cloud-based software maker Salesforce.com Inc said on Wednesday it would buy Demandware Inc   which provides software to design e-commerce websites  in a deal worth about $2.8 billion.",
        "date": "06012016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce to buy Demandware in $2.8 bln deal "
    },
    {
        "content": "* Salesforce selects AWS as preferred public cloud infrastructure provider    Source text for Eikon:    Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05252016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Amazon says Salesforce selected AWS as public cloud infrastructure provider "
    },
    {
        "content": "Salesforce.com Inc   a marketing-and-sales software provider for 17 years  may be joining the ranks of the technology old-guard  but the 27 percent first-quarter revenue growth it posted on Wednesday still showed some startup zip.",
        "date": "05192016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Salesforce CEO eyes artificial intelligence for robust growth "
    },
    {
        "content": "* Initiates Q2 revenue guidance of $2.005 billion to $2.015 billion",
        "date": "05182016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce announces Q1 GAAP EPS $0.06 "
    },
    {
        "content": "May 18 Salesforce.com Inc  a marketing-and-sales software provider for 17 years  may be joining the ranks of the technology old-guard  but the 27 percent first-quarter revenue growth it posted on Wednesday still showed some startup zip.",
        "date": "05192016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 3-Salesforce CEO eyes artificial intelligence for robust growth "
    },
    {
        "content": "May 18 Salesforce.com Inc reported a 26.8 percent rise in quarterly revenue  driven by higher demand for its web-based sales and marketing software.",
        "date": "05182016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce revenue rises 26.8 pct "
    },
    {
        "content": "* On April 21  CEO  Marc Benioff sold 12 500 shares in multiple transactions at price range between $76.66 and $77.63 per share",
        "date": "04252016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce.Com Inc says  on April 21  CEO Marc Benioff sold 12 500 shares in multiple transactions at price range between $76.66-$77.63/share "
    },
    {
        "content": "* Says CEO Marc Benioff FY 2016 total compensation $33.4 million versus $39.9 million in FY 2015",
        "date": "04112016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce.com CEO's FY 2016 total compensation $33.4 mln vs $39.9 mln in FY 2015 "
    },
    {
        "content": "* Salesforce signs agreement with NEC to establish second data center in Japan",
        "date": "04042016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce signs agreement with NEC to establish second data center in Japan "
    },
    {
        "content": "* Appointment will increase size of Salesforce board of directors to 12 members",
        "date": "03222016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce announces appointment of Neelie Kroes to Board Of Directors "
    },
    {
        "content": "* Board of Salesforce.com approved amendments to company's amended and restated bylaws",
        "date": "03212016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Salesforce.com board approves amended and restated bylaws "
    },
    {
        "content": "PARIS French advertising group Publicis  said on Wednesday its U.S.-based unit Publicis.Sapient had acquired Vertiba  a consulting company providing services based on Salesforce.com  cloud computing solutions  for an undisclosed sum.",
        "date": "03022016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Publicis' U.S.-based unit acquires Salesforce consulting partner Vertiba "
    },
    {
        "content": "PARIS  March 2 French advertising group Publicis  said on Wednesday its U.S.-based unit Publicis.Sapient had acquired Vertiba  a consulting company providing services based on Salesforce.com cloud computing solutions  for an undisclosed sum.",
        "date": "03022016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "REFILE-Publicis' U.S.-based unit acquires Salesforce consulting partner Vertiba "
    },
    {
        "content": "Salesforce.com Inc  reported higher-than-expected quarterly revenue and raised its full-year revenue forecast  saying customers were stepping up purchases of its web-based sales and marketing software despite economic uncertainty.",
        "date": "02252016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Salesforce quarterly revenue beats Wall St expectations "
    },
    {
        "content": "Feb 24 Salesforce.com Inc reported higher-than-expected quarterly revenue and raised its full-year revenue forecast  saying customers were stepping up purchases of its web-based sales and marketing software despite economic uncertainty.",
        "date": "02252016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 3-Salesforce quarterly revenue beats Wall St expectations "
    },
    {
        "content": "SAN FRANCISCO Salesforce.com's  quarterly report will be under the microscope after the bell on Wednesday as Wall Street searches for new signs of trouble in spending on cloud software.",
        "date": "02242016",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Salesforce.com faces scrutiny as Wall St frets over cloud spending "
    },
    {
        "content": "Feb 24 Salesforce.com Inc reported a 25.3 percent rise in quarterly revenue  helped by an increase in demand for its web-based sales and marketing software.",
        "date": "02242016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Cloud software maker Salesforce posts 25.3 pct rise in revenue "
    },
    {
        "content": "SAN FRANCISCO  Feb 24 Salesforce.com's  quarterly report will be under the microscope after the bell on Wednesday as Wall Street searches for new signs of trouble in spending on cloud software.",
        "date": "02242016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 1-Salesforce.com faces scrutiny as Wall St frets over cloud spending "
    },
    {
        "content": "SAN FRANCISCO  Feb 24 Salesforce.com's  quarterly report will be under the microscope after the bell on Wednesday as Wall Street searches for new signs of trouble in spending on cloud software.",
        "date": "02242016",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce.com faces scrutiny as Wall St frets over cloud software "
    },
    {
        "content": "Salesforce.com Inc raised its full-year revenue forecast for the fourth time after reporting a quarterly adjusted profit above market expectations  driven by higher demand for its web-based sales and marketing software.",
        "date": "11182015",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Cloud software maker Salesforce adj profit beats estimates "
    },
    {
        "content": "* Shares rise as much as 6 pct in extended trading   (Adds analysts' comments  details; updates shares)",
        "date": "11182015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 2-Cloud software maker Salesforce adj profit beats estimates "
    },
    {
        "content": "Nov 18 Salesforce.com Inc reported a 23.7 percent jump in quarterly revenue  driven by higher demand for its web-based sales and marketing software.",
        "date": "11182015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Cloud software maker Salesforce revenue jumps 23.7 pct "
    },
    {
        "content": "Oct 19 International Business Machines Corp  posted a bigger-than-expected drop in revenue and cut its full-year profit forecast  as a stronger U.S. dollar accentuated weakness in demand from China and emerging markets.",
        "date": "10192015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 4-IBM revenue falls more than expected  cuts profit forecast "
    },
    {
        "content": "* Enters partnership with WebResults  a company specialized in Salesforce projects  services and applications to support sales to deliver a free connector to integrate a Salesforce org with the semantic analysis platform 'Cogito' by Expert System",
        "date": "09302015",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Expert System enters partnership with WebResults to enhance Cogito software "
    },
    {
        "content": "Salesforce.com Inc  reported better-than-expected quarterly revenue and profit  helped by an increase in demand for its Web-based sales and marketing software  and raised its revenue forecast for the full year for the third time.",
        "date": "08202015",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Salesforce raises full-year revenue forecast again "
    },
    {
        "content": "* Shares up about 4 pct after market   (Adds CEO comment  details)",
        "date": "08202015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 2-Salesforce raises full-year revenue forecast again "
    },
    {
        "content": "Aug 20 Salesforce.com Inc reported a 24 percent jump in quarterly revenue  helped by an increase in demand for its web-based sales and marketing software.",
        "date": "08202015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce revenue rises 24 percent "
    },
    {
        "content": "(The Day Ahead is an email and PDF publication that includes the day's major stories and events  analyses and other features. To receive The Day Ahead  Eikon users can register at . Thomson One users can register at RT/DAY/US. All times in ET/GMT)       WEEK AHEAD      The stragglers for the earnings season - Home Depot  Wal-Mart and a few others - will report results to close out the quarter next week  with expectations that retailers would see decent sales after recent revisions show better",
        "date": "08142015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "What to Watch in the Week Ahead and on Monday  Aug. 17 "
    },
    {
        "content": "Middle market private equity firm HGGC is expected to announce an acquisition of a European automated marketing software company called Selligent for an undisclosed sum  two people familiar with the matter said on Friday.",
        "date": "07102015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "HGGC to buy European software company Selligent: sources "
    },
    {
        "content": "* Indexes up: Dow 0.07 pct  S&P 0.3 pct  Nasdaq 0.3 pct   (Add details  changes comment  updates prices)",
        "date": "05212015",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "US STOCKS-Wall St higher as rate hike worries fade; S&P near record "
    },
    {
        "content": "* Yellen comments leave rate expectations unchanged on Wall Street",
        "date": "05222015",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "US STOCKS-Wall St ends lower after Yellen comments fail to inspire "
    },
    {
        "content": "Microsoft Corp  and Salesforce.com Inc  held \"significant talks\" this spring but failed to agree on a price  CNBC reported  citing people familiar with the matter.",
        "date": "05222015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Microsoft  Salesforce talks fell through on pricing: CNBC "
    },
    {
        "content": "* Potential bidder can go up to $70 bln on high end - analyst",
        "date": "05222015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 2-Microsoft  Salesforce talks fell through on pricing - CNBC "
    },
    {
        "content": "Salesforce.com Inc   the subject of takeover speculation for the past few weeks  raised its revenue forecast for the full year  after the cloud software company reported a profit for the first time in seven quarters. | Video ",
        "date": "05202015",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Salesforce reports first profit in seven quarters  shares jump "
    },
    {
        "content": "* Yellen comments leave rate expectations unchanged on Wall Street",
        "date": "05222015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "US STOCKS-Wall St flat  Yellen comments in line with expectations "
    },
    {
        "content": "* Shares rise 7.3 pct after market   (Adds conference call details  analyst comment; updates shares)",
        "date": "05202015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 2-Salesforce reports first profit in seven quarters  shares jump "
    },
    {
        "content": "May 22 Microsoft Corp held \"significant\" talks with Salesforce.com Inc this spring and was willing to offer about $55 billion for the company  CNBC reported  citing people familiar with the situation. (http://cnb.cx/1IPBIkG)     (Reporting by Anya George Tharakan in Bengaluru; Editing by Kirti Pandey)",
        "date": "05222015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Microsoft  Salesforce held \"significant\" talks this spring - CNBC "
    },
    {
        "content": "May 20Cloud software company Salesforce.com Inc   the subject of takeover speculation for the past few weeks  reported a 23 percent jump in quarterly revenue  helped by an increase in demand for its web-based sales and marketing software.",
        "date": "05202015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce revenue jumps 23 pct "
    },
    {
        "content": "* With this partnership  Sage has built a new solution called Sage Life on Salesforce1 platform  Further company coverage: [SGE.L CRM.N]   (Bengaluru Newsroom: +91 80 6749 1136)",
        "date": "05132015",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "BRIEF-Sage Group announces global partnership with Salesforce "
    },
    {
        "content": "MANNHEIM  Germany German software company SAP's chief executive once again ruled out any move to acquire Salesforce.com  then went further by saying that its richly valued rival is unlikely to be acquired by any other player in the industry.",
        "date": "05202015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "SAP chief sees no takers for software rival Salesforce "
    },
    {
        "content": "MANNHEIM  Germany  May 20 German software company SAP's chief executive once again ruled out any move to acquire Salesforce.com  then went further by saying that its richly valued rival is unlikely to be acquired by any other player in the industry.",
        "date": "05202015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 1-SAP chief sees no takers for software rival Salesforce "
    },
    {
        "content": "MANNHEIM  May 20 SAP Chief Executive Bill McDermott once again ruled out that his company has any interest in buying rival Salesforce.com and went further on Wednesday by saying that Salesforce is unlikely to be acquired by any other player in the industry.",
        "date": "05202015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "SAP CEO says he does not believe Salesforce will be sold "
    },
    {
        "content": "NEW YORK The global bond market rout slowed on Thursday as long-term borrowing costs retreated from their highest levels in more than five months  helping to stabilize European stocks and kindle a mild recovery on Wall Street.",
        "date": "05072015",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Bond selloff cools  Wall Street rebounds "
    },
    {
        "content": "May 5 Shares of Salesforce.com Inc  jumped 6.2 percent in late afternoon trading on Tuesday  after Bloomberg reported that Microsoft Corp is evaluating a bid for the cloud software provider.",
        "date": "05052015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce shares spike on report of Microsoft evaluating bid "
    },
    {
        "content": "May 5 Shares of Salesforce.com Inc  jumped as much as 6.4 percent on Tuesday after a Bloomberg report that Microsoft Corp was evaluating a bid for the cloud software provider.",
        "date": "05052015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 1-Salesforce shares spike on report of Microsoft evaluating bid "
    },
    {
        "content": "U.S. stock indexes ended more than 1 percent higher on Friday after strong jobs data indicated U.S. economic growth was picking up momentum  but not enough to raise concerns about an earlier-than-expected interest-rate rise by the Federal Reserve.",
        "date": "05082015",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Stocks leap as Wall Street lauds jobs growth "
    },
    {
        "content": "* S&P 500  Dow up for the week; Nasdaq down slightly for week",
        "date": "05082015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "US STOCKS-Stocks leap as Wall Street lauds jobs growth "
    },
    {
        "content": "* SAP has spent $20 bln in acquisitions in recent years   (Adds more quotes from CEO  background)",
        "date": "05052015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 1-SAP has \"zero interest\" in buying Salesforce.com - CEO "
    },
    {
        "content": "FRANKFURT/WALLDORF  May 5 SAP Chief Executive Bill McDermott said his company has \"zero interest\" in acquiring software rival Salesforce.com  which is rumoured to be for sale.",
        "date": "05052015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "SAP CEO says has \"zero interest\" in Salesforce.com deal "
    },
    {
        "content": "* Indexes up: Dow 1.4 pct  S&P 1.2 pct  Nasdaq 1.1 pct   (Updates to mid-afternoon  adds detail on valuations)",
        "date": "05082015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "US STOCKS-Wall Street jumps as investors laud jobs growth "
    },
    {
        "content": "* Nonfarm payrolls up by 223 000  just below the 224 000 expected",
        "date": "05082015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "US STOCKS-Wall St soars after jobs growth rebounds "
    },
    {
        "content": "REDWOOD CITY  Calif. Oracle Corp  Chief Executive Safra Catz said her company could benefit if Microsoft Corp  or another rival bought online customer relationship management firm Salesforce.com Inc .",
        "date": "04302015",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Oracle CEO sees benefit if rival buys Salesforce.com "
    },
    {
        "content": "SAN FRANCISCO  May 1 German business software company SAP said on Friday it is not considering acquiring online rival Salesforce.com Inc  after a news report suggested the leaders of the two companies had held talks about strategic alliances last year.",
        "date": "05012015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "SAP says not considering acquiring Salesforce.com "
    },
    {
        "content": "* Nonfarm payrolls up by 223 000  just below the 224 000 expected",
        "date": "05082015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "US STOCKS-Wall St extends gains after strong jobs data "
    },
    {
        "content": "Cloud software company Salesforce.com Inc  is working with financial advisers to help it field takeover offers after being approached by a potential acquirer  Bloomberg said  citing people with knowledge of the matter.",
        "date": "04292015",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Salesforce working to field takeover offers: Bloomberg "
    },
    {
        "content": "REDWOOD CITY  Calif.  April 30 Oracle Corp  Chief Executive Safra Catz said her company could benefit if Microsoft Corp or another rival bought online customer relationship management firm Salesforce.com Inc .",
        "date": "04302015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 2-Oracle CEO sees benefit if rival buys Salesforce.com "
    },
    {
        "content": "REDWOOD CITY  Calif.  April 30 Oracle Corp  Chief Executive Safra Catz on Thursday declined comment on whether Oracle had made an offer to buy online customer relationship management rival Salesforce.com Inc.",
        "date": "04302015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Oracle CEO Safra Catz declines comment on Salesforce.com "
    },
    {
        "content": "* Nonfarm payrolls up by 223 000  just below the 224 000 expected",
        "date": "05082015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "US STOCKS-Wall St opens sharply higher after strong jobs data "
    },
    {
        "content": "April 29 Cloud software company Salesforce.com Inc is working with financial advisers to help it field takeover offers after being approached by a potential acquirer  Bloomberg said  citing people with knowledge of the matter.",
        "date": "04292015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 3-Salesforce working to field takeover offers - Bloomberg "
    },
    {
        "content": "Microsoft Corp  currently is not weighing an offer for Salesforce.com Inc   two people familiar with the matter said on Thursday  dampening speculation that Microsoft could be drawn into bidding for the cloud software company.",
        "date": "05082015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Exclusive: Microsoft has no plans to pursue Salesforce - sources "
    },
    {
        "content": "April 29 Cloud software company Salesforce.com Inc is working with financial advisers to help it field takeover offers after being approached by a potential acquirer  Bloomberg said  citing people with knowledge of the matter.",
        "date": "04292015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce working to field takeover offers - Bloomberg "
    },
    {
        "content": "PARIS  March 30 European stocks were set to rise on Monday  bouncing back from last week's losses with tech shares in focus after news of merger talks in the sector spurred a late-session rally on Wall Street on Friday.     Intel Corp is in talks to buy fellow chipmaker Altera Corp  in a deal likely to top $10 billion  according to a source familiar with the matter  which would make it Intel's biggest acquisition ever and the latest merger in the quickly consolidating semiconductor s",
        "date": "03302015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Europe Factors to Watch-Shares set to rise; techs in focus "
    },
    {
        "content": "FRANKFURT Cloud software company Salesforce.com Inc aims to overtake SAP in terms of sales on the German company's home market in the coming years  the Europe chief of Salesforce told a German magazine.",
        "date": "03282015",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Salesforce aims to surpass SAP on German market: executive tells WiWo "
    },
    {
        "content": "* Indexes: Dow off 0.1 pct  S&P off 0.2 pt  Nasdaq up 0.4 pct   (Updates to close)",
        "date": "02262015",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "US STOCKS-Nasdaq resumes climb; S&P 500  Dow fall with energy "
    },
    {
        "content": "Cloud software company Salesforce.com Inc  raised its full-year revenue forecast  betting on strong demand for its web-based sales and marketing software and services.",
        "date": "02252015",
        "name": "Salesforcecom Inc",
        "news_type": "topStory",
        "symbol": "CRM",
        "title": "Salesforce raises full-year revenue forecast  shares jump "
    },
    {
        "content": "* Indexes: Dow off 0.2 pct  S&P off 0.3 pt  Nasdaq up 0.1 pct   (Updates to afternoon trading)",
        "date": "02262015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "US STOCKS-S&P 500  Dow fall as energy sinks; Nasdaq up after deal news "
    },
    {
        "content": "Feb 25 Cloud software company Salesforce.com Inc  raised its full-year revenue forecast  betting on strong demand for its web-based sales and marketing software and services.",
        "date": "02252015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "UPDATE 2-Salesforce raises full-year revenue forecast  shares jump "
    },
    {
        "content": "Feb 25 Cloud software company Salesforce.com Inc  reported a 26 percent jump in quarterly revenue  helped by higher demand for its web-based sales and marketing software and services.",
        "date": "02252015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "Salesforce quarterly revenue jumps 26 pct "
    },
    {
        "content": "* Indexes: Dow off 0.1 pct  S&P off 0.1 pt  Nasdaq up 0.2 pct   (Updates to midday)",
        "date": "02262015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "US STOCKS-S&P 500  Dow dip with energy; Nasdaq up after deal news "
    },
    {
        "content": "* Indexes: Dow off 0.08 pct  S&P off 0.16 pt  Nasdaq up 0.14 pct   (Updates to late morning)",
        "date": "02262015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "US STOCKS-Wall St holds near unchanged mark after data flurry "
    },
    {
        "content": "* Indexes: Dow off 0.1 pct  S&P off 0.09 pt  Nasdaq up 0.04 pct   (Adds quote  data)",
        "date": "02262015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "US STOCKS-Wall St little changed after burst of data "
    },
    {
        "content": "* Futures: Dow off 12 pts  S&P 0.25 pt  Nasdaq up 6 pts   (Adds quote  data)",
        "date": "02262015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "US STOCKS-Wall St set for flat open after data "
    },
    {
        "content": "NEW YORK  Feb 26 U.S. stock index futures were little changed on Thursday ahead of a flurry of economic data  after the Dow edged up to a new record a day earlier while the Nasdaq snapped a 10-session winning streak.",
        "date": "02262015",
        "name": "Salesforcecom Inc",
        "news_type": "normal",
        "symbol": "CRM",
        "title": "US STOCKS-Futures flat ahead of data flurry "
    }
]