[
    {
        "content": "NEW YORK Credit Suisse Group AG  on Monday agreed to pay $135 million to New York to resolve a probe of misconduct in its foreign exchange business  which the state's banking regulator said deceived customers to enhance its own profits.",
        "date": "11132017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "NY state regulator fines Credit Suisse $135 mln over forex practices "
    },
    {
        "content": "NEW YORK  Nov 13 Credit Suisse Group AG on Monday agreed to pay $135 million to New York to resolve a probe of misconduct in its foreign exchange business  which the state's banking regulator said deceived customers to enhance its own profits.",
        "date": "11132017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-NY state regulator fines Credit Suisse $135 mln over forex practices "
    },
    {
        "content": "NEW YORK  Nov 13 Credit Suisse Group AG has agreed to pay $135 million to settle allegations that its foreign exchange traders deceived customers  improperly shared their information and tried to manipulate currency prices  the New York State Department of Financial Services (DFS) said on Monday.",
        "date": "11132017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "New York state regulator fines Credit Suisse $135 mln over forex practices "
    },
    {
        "content": "* Credit Suisse announces coupon payments and expected coupon payments on Credit Suisse X-links® exchange traded notes (the \"etns\") Source text for Eikon: Further company coverage:",
        "date": "11072017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse announces coupon payments and expected coupon payments on Credit Suisse X-links® exchange traded notes "
    },
    {
        "content": "NEW YORK  Nov 6 Andrew Van Der Vord  vice chairman and co-head of consumer retail investment banking at RBC Capital Markets  has left the bank to rejoin Credit Suisse  according to sources.",
        "date": "11062017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-RBC consumer retail co-head Van Der Vord to return to Credit Suisse "
    },
    {
        "content": "HONG KONG  Nov 7 China plans to allow global banks to take a stake of up to 51 percent in their onshore securities ventures for the first time and tie up with local non-financial firms  people familiar with the matter said.",
        "date": "11072017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "REFILE-China plans easing foreign holding  partner choice for securities ventures - sources "
    },
    {
        "content": "Nov 3 The following financial services industry appointments were announced on Friday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "11032017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Plurigestion  Cowen & Co  Credit Suisse  TD Securities "
    },
    {
        "content": "LONDON/ZURICH The leap in assets at Credit Suisse's private bank to a record high this year has been aided by a key plank of the bank's new strategy: lending money to the world's ultra-wealthy.",
        "date": "11062017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Need help to buy a ship or jet? Credit Suisse looks to lure super-rich "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  November 03 (Fitch) Credit Suisse Group AG's (Credit Suisse) 3Q17 results highlight continued progress in the execution of the bank's restructuring strategy  benefiting from sound revenue in the targeted wealth management-focused divisions and cost improvements  Fitch Ratings says. The bank reached CHF1 billion net savings in 9M17  ahead of its CHF900 million target for 2017. Nonetheless  revenue was negatively impacted by low m",
        "date": "11032017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Fitch: Credit Suisse's 3Q17 Shows Good Progress in Strategy "
    },
    {
        "content": "HANOI  Nov 6 Shares of Vietnam's biggest shopping mall operator  Vincom Retail  closed little changed in a lacklustre debut on Monday after the country's biggest ever initial public offering.",
        "date": "11062017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 2-Vincom Retail debuts in thin trade after Vietnam's biggest IPO "
    },
    {
        "content": "HANOI  Nov 6 Vietnam's largest shopping mall operator Vincom Retail traded slightly below its initial public offering (IPO) pricing in its debut on the main stock exchange on Monday  following the country's biggest IPO.",
        "date": "11062017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "CORRECTED-UPDATE 1-Vietnam's Vincom Retail debuts slightly below IPO pricing "
    },
    {
        "content": "Oct 30 Investment bank Credit Suisse Group AG has appointed senior banker Steven Geller head of Americas M&A  according to an internal memo seen by Reuters on Monday and confirmed by a Credit Suisse spokeswoman.",
        "date": "10302017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse appoints Steven Geller as head of Americas M&A "
    },
    {
        "content": "ZURICH Swiss specialty chemicals maker Clariant and U.S. group Huntsman abandoned their $20 billion merger on Friday  notching a win for activist investors who fought the deal for months on the grounds it would destroy shareholder value. | Video ",
        "date": "10272017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Activist investors scupper $20 billion Clariant-Huntsman merger "
    },
    {
        "content": "* Clariant shares down around 5 percent (Adds White Tale comment)",
        "date": "10272017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 5-Activist investors scupper $20 bln Clariant-Huntsman merger "
    },
    {
        "content": "* Reference price for listing lower than IPO price (Adds details  background)",
        "date": "10272017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Vingroup's retail unit to list on Nov 6 after raising $709 mln in IPO "
    },
    {
        "content": "Nov 2 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "11022017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES- Deutsche Bank  Nomura  Wells Fargo  Credit Suisse  MSCI "
    },
    {
        "content": "NEW YORK  Nov 2 Credit Suisse has appointed Craig Edgar as vice chairman of the bank's power and renewables group in the Americas  according to an internal memo seen by Reuters  the contents of which were verified by a spokesman for the bank.",
        "date": "11022017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse appoints UBS' Edgar as vice chair of power  renewables -memo "
    },
    {
        "content": "ZURICH Credit Suisse  Chief Executive Tidjane Thiam on Thursday expressed caution about Bitcoin  saying the current interest in the crypto-currency could eventually subside.",
        "date": "11022017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse CEO skeptical about Bitcoin 'bubble' "
    },
    {
        "content": "LONDON  Nov 2 (IFR) - Tidjane Thiam made a strong defence of his strategy for Credit Suisse when delivering the bank’s first set of quarterly numbers since raising SFr4.25bn (US$4.4bn) through a rights issue in June.",
        "date": "11022017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Thiam rebuts Credit Suisse break-up call "
    },
    {
        "content": "ZURICH Credit Suisse's  chief executive underlined his determination to keep the group's investment bank in the face of a campaign by a hedge fund investor to split up Switzerland's second-biggest lender. | Video ",
        "date": "11022017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse stresses value in investment bank after break-up call "
    },
    {
        "content": "* Credit Suisse CEO says integrated bank works best for customers",
        "date": "11022017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 3-Credit Suisse stresses value in investment bank after break-up call "
    },
    {
        "content": "ZURICH  Nov 2 Credit Suisse Chief Executive Tidjane Thiam on Thursday expressed caution about Bitcoin  saying the current interest in the crypto-currency could eventually subside.",
        "date": "11022017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse CEO sceptical about Bitcoin \"bubble\" "
    },
    {
        "content": "* CFO says revising down regularization outflows from 3-5 billion range to an expectation that these will total 2 billion in 2017 - analyst call",
        "date": "11022017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse sees regularisation outflows waning "
    },
    {
        "content": "* Credit Suisse CEO says to meet activist investor Bohli next week - CNBC",
        "date": "11022017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse CEO says to meet activist investor next week - CNBC "
    },
    {
        "content": "ZURICH  Nov 2 Credit Suisse on Thursday reported 244 million Swiss francs ($244.2 million) in third-quarter net income  the first time Switzerland's second-biggest bank has posted three consecutive profitable quarters under Chief Executive Tidjane Thiam.",
        "date": "11022017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse Q3 net income 244 mln Sfr; CET1 ratio 13.2 pct "
    },
    {
        "content": "ZURICH  Oct 25 Credit Suisse declined comment on whether it will exercise an option next year to repurchase so-called CoCo bonds on which it pays out around $550 million each year  after a Swiss newspaper highlighted the possibility.",
        "date": "10252017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse no comment on repurchase option for pricey CoCo bonds "
    },
    {
        "content": "LONDON  Oct 24 Swedish hotelier Pandox is among a group of bidders preparing binding offers for UK-focused hotel chain Jurys Inn in a deal worth about $1 billion  sources familiar with the matter said.",
        "date": "10242017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Sweden's Pandox eyes bid for Jurys Inn hotel chain - sources "
    },
    {
        "content": "FRANKFURT Industrial gases group Linde  has cut the approval threshold and extended a deadline for accepting its $80 billion tie-up with Praxair   while pushing on with plans to get a green light from regulators.",
        "date": "10232017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Linde cuts threshold for $80 billion Praxair deal  prepares asset sales "
    },
    {
        "content": "* RBR CEO says trying to raise at least $1 bln to buy more shares",
        "date": "10202017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Activist investor RBR wants to build $1 bln stake in Credit Suisse "
    },
    {
        "content": "Oct 19 Credit Suisse Group AG has appointed David Hammond and Spyros Svoronos as Americas co-heads of its global industrials investment banking and capital markets group  according to an internal memo sent by the investment bank and seen by Reuters.",
        "date": "10192017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse appoints Americas industrials co-heads "
    },
    {
        "content": "TORONTO Power Corp of Canada  should offload a number of non-core assets that could fetch about C$10 billion ($7.9 billion)  a shareholder told Reuters late on Monday  in a move he said would unlock shareholder value at the diversified holding company.",
        "date": "10242017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Investor urges Power Corp to sell C$10 billion in assets "
    },
    {
        "content": "* Divestitures worth up to 7.5 bln euros next step -sources (Adds details  background)",
        "date": "10232017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 2-Linde cuts threshold for $80 bln Praxair deal  prepares asset sales "
    },
    {
        "content": "SYDNEY Global miner Rio Tinto has opened its books to more than a half-dozen potential buyers of its remaining two Australian coal mines as it winds down the sales process  two people familiar with the sale process said on Friday.",
        "date": "10202017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Rio opens books to over half-dozen possible suitors for Australia coal mines: sources "
    },
    {
        "content": "* Credit Suisse management thinks projections misleading - source (Adds detail from presentation  source close to Credit Suisse)",
        "date": "10192017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Activist RBR wants Credit Suisse to float asset management unit  investment bank "
    },
    {
        "content": "TORONTO  Oct 24 Power Corp of Canada should offload a number of non-core assets that could fetch about C$10 billion ($7.9 billion)  a shareholder told Reuters late on Monday  in a move he said would unlock shareholder value at the diversified holding company.",
        "date": "10242017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Investor urges Power Corp to sell C$10 bln in assets "
    },
    {
        "content": "* Sale seen fetching around $2 bln - sources (Adds analyst comment  industry context)",
        "date": "10202017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 2-Rio opens books to over half-dozen possible suitors for Australia coal mines –sources "
    },
    {
        "content": "ZURICH  Oct 19 Activist investor RBR Capital Advisors wants Credit Suisse to float its asset management business and investment bank  according to a presentation reviewed by Reuters.",
        "date": "10192017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Activist RBR wants Credit Suisse to float asset management unit  investment bank -presentation "
    },
    {
        "content": "ZURICH Credit Suisse's  largest shareholder wants the bank's management to consider parts of the break-up plan proposed by an activist investor  including shifting the group's investment banking unit to the United States from Switzerland  the Financial Times reported on Wednesday.",
        "date": "10182017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Top Credit Suisse investor says activist plan needs be looked into: FT "
    },
    {
        "content": "Activist investor RBR Capital Advisors is launching a campaign for breaking up Swiss bank Credit Suisse Group AG  into three parts  the Financial Times reported on Monday.",
        "date": "10162017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Activist investor RBR launching campaign to break up Credit Suisse: FT "
    },
    {
        "content": "* Shares Bayer rise to top of DAX index (Adds BASF CEO comment  source  analyst comment on Bayer capital increase  further details)",
        "date": "10132017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 4-BASF to harvest seeds  herbicide businesses from Bayer for $7 bln "
    },
    {
        "content": "LONDON  Oct 12 A group of investors including buyout firm Apollo and pension fund Canada Pension Plan (CPP) is bidding for coal assets put up for sale by mining giant Rio Tinto  which could fetch $2 billion  sources familiar with the matter told Reuters.",
        "date": "10122017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Rio Tinto's $2 bln coal assets attract investor consortium - sources "
    },
    {
        "content": "ZURICH  Oct 18 Credit Suisse's largest shareholder wants the bank's management to consider parts of the break-up plan proposed by an activist investor  including shifting the group's investment banking unit to the United States from Switzerland  the Financial Times reported on Wednesday.",
        "date": "10182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Top Credit Suisse investor says activist plan needs be looked into -FT "
    },
    {
        "content": "BERLIN/FRANKFURT  Oct 18 The following are some of the factors that may move German stocks on Wednesday:",
        "date": "10182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "German stocks - Factors to watch on October 18 "
    },
    {
        "content": "Oct 16 Activist investor RBR Capital Advisors is launching a campaign for breaking up Swiss bank Credit Suisse Group AG into three parts  the Financial Times reported on Monday.",
        "date": "10162017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Activist investor RBR launching campaign to break up Credit Suisse -FT "
    },
    {
        "content": "HONG KONG Baidu Inc's  iQiyi  a Netflix  style video streaming service in China  has picked three banks to help arrange a U.S. initial public offering (IPO) worth about $1 billion  IFR reported on Monday  citing people familiar with the plans.",
        "date": "10162017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Baidu's iQiyi picks BofA  Credit Suisse  Goldman for U.S. IPO: IFR "
    },
    {
        "content": "* Activist goes public after meetings with Credit Suisse (Adds investor comment  updates share price  details on meetings)",
        "date": "10172017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "UPDATE 3-Activist RBR courts fellow investors for Credit Suisse break-up "
    },
    {
        "content": "* European shares slip from highs as results  commodities weigh",
        "date": "10172017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "GLOBAL MARKETS-U.S. dollar up  yield curve flat  on inflation; stocks rise "
    },
    {
        "content": "    MOSCOW  Oct 6 VTB Capital  a coordinator of the planned initial public offering of Russia's En+ has valued the group's total equity at between $9 billion and $12 billion  according to a VTB report obtained by Reuters.     En+ Group  which manages Russian tycoon Oleg Deripaska's aluminium and hydropower businesses  is planning an initial public share offering (IPO) in London and Moscow.      It has not said how much of its equity it plans to float but has said it hopes to raise $1",
        "date": "10062017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "VTB Capital values Russia's En+ at $9 bln-$12 bln ahead of IPO "
    },
    {
        "content": "* European shares slip from highs as results  commodities weigh",
        "date": "10172017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "GLOBAL MARKETS-U.S. dollar up  yield curve flat  on inflation; stocks mixed "
    },
    {
        "content": "NEW YORK  Oct 6 Private equity firms preparing bids for US electronics and optical sensor component maker Excelitas Technologies Corp are being offered debt financing from banks between roughly US$1bn and US$1.1bn  two sources close to the matter said.",
        "date": "10062017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "LPC: Banks offer Excelitas bidders more than US$1bn in buyout debt "
    },
    {
        "content": "* As part of $100 million transaction  Credit Suisse will enter into a long-term lease with iron mountain",
        "date": "10052017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-Iron Mountain ‍to buy two Credit Suisse data centers in London and Singapore "
    },
    {
        "content": "MILAN  Oct 3 The Benetton family's investment group Edizione Holding has teamed up with Goldman Sachs's private equity arm to bid for Italian packaging company Guala Closures  two sources said on Tuesday.",
        "date": "10032017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Italy's Edizione teams up with Goldman Sachs in bid for Guala Closures - sources "
    },
    {
        "content": "* Credit Suisse rises after activist investor move (Recasts  adds details and quote  updates prices at close)",
        "date": "10172017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 2-European shares slip from highs as results  commodities weigh "
    },
    {
        "content": "MILAN  Oct 5 Rainbow  the Italian animation producer famous for the Winx Club TV series  has picked UniCredit and Credit Suisse for a planned initial public offer  two sources close to the matter said on Thursday.",
        "date": "10052017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Italy's Rainbow picks UniCredit  Credit Suisse for IPO - sources "
    },
    {
        "content": "* Sterling sinks as rate-setters talk (Recasts with U.S. trading  updates throughout  changes byline  dateline  previous LONDON)",
        "date": "10172017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "GLOBAL MARKETS-U.S. dollar up  yield curve flat  on inflation; stocks pause "
    },
    {
        "content": "Online micro-credit provider Qudian Inc's  initial public offering could be priced above the expected range of $19-$22 per American depositary share  sources familiar with the matter told Reuters.",
        "date": "10172017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "China's Qudian IPO seen priced above range: sources "
    },
    {
        "content": "Oct 2 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "10022017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse  Bank of America  JPMorgan  Calastone  Baillie Gifford  Franklin Templeton "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Calls to action are designed to provoke an immediate response. Such imperatives are understandable in the case of Credit Suisse. Shares in the Swiss lender are 13 percent below the price at which it raised money from investors in 2015 and have underperformed the STOXX Europe 600 Banks index by 23 percent since Tidjane Thiam became chief executive. Even so  a plan to split the Zurich-based group into three faces a capital markets conundrum.",
        "date": "10172017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Breakingviews - Credit Suisse breakup faces trading conundrum "
    },
    {
        "content": "LONDON  Oct 17 World stocks stayed near record highs on Tuesday  as a flurry of U.S. earnings and a rally in commodity markets helped underpin one of the most durable bull runs of recent history.",
        "date": "10172017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "GLOBAL MARKETS-Earnings and commodities keep stocks bulls happy "
    },
    {
        "content": "LONDON  Oct 17 World equity markets held close to all-time highs on Tuesday  as investors latched on to rising bets on higher borrowing costs in the U.S. and Britain.",
        "date": "10172017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "GLOBAL MARKETS-Stocks stay buoyant as dollar  bond yields rise "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  September 28 (Fitch) Fitch Ratings has affirmed Credit Suisse Group AG's (CSGAG) Long-Term Issuer Default Rating (IDR) and Viability Rating (VR) at 'A-' and 'a-'  respectively. At the same time  Fitch has affirmed the ratings of the group's main operating entity  Credit Suisse AG (Credit Suisse)  at IDR 'A' and VR 'a-' and of the group's domestic subsidiary  Credit Suisse (Schweiz) AG (CS Schweiz) at IDR 'A' and VR 'a'. The Outl",
        "date": "09282017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Fitch Affirms Credit Suisse Group at 'A-'; Outlook Stable "
    },
    {
        "content": "AMSTERDAM  Sept 28 HEMA  one of the Netherlands' largest retail chains  said on Thursday it was exploring strategic options  including a possible sale.",
        "date": "09282017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Dutch retail chain HEMA exploring possible sale  other options "
    },
    {
        "content": "Sept 21 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "09212017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Citadel Securities  PineBridge  APG Group  Credit Suisse  Deutsche Bank "
    },
    {
        "content": "Sept 19 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "09192017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse  Goldman Sachs  Standard Chartered  Prudential "
    },
    {
        "content": "NEW YORK  Sept 19 Credit Suisse Group AG named Joe Steffa as global head of securitized products trading on Tuesday  according to an internal memo seen by Reuters.",
        "date": "09192017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse names Steffa as head of securitized products trading "
    },
    {
        "content": "Sept 18 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "09182017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse  Citigroup  Goldman Sachs  Societe Generale "
    },
    {
        "content": "NEW YORK  Sept 18 JPMorgan Chase & Co has been routing customer orders for bitcoin-related instruments  a spokesman said on Monday  despite the bank's chief executive's calling the crypto currency \"a fraud.\"",
        "date": "09182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "JPMorgan handles bitcoin-related trades for clients despite CEO warning "
    },
    {
        "content": "LONDON Credit Suisse has appointed Eraj Shirvani to the newly created role of vice chairman - emerging markets  according to a memo seen by Reuters and confirmed by the bank.",
        "date": "09182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse appoints Eraj Shirvani vice chairman  emerging markets: memo "
    },
    {
        "content": "ZURICH  Sept 15 Credit Suisse is taking a roughly $79.5 million hit to settle charges by Massachusetts Mutual Life Insurance about its residential mortgage-backed securities (RMBS) business  the Swiss bank said late on Thursday.",
        "date": "09152017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse reaches $79.5 mln settlement with MassMutual in RMBS case "
    },
    {
        "content": "LONDON  Sept 18 Credit Suisse has appointed Eraj Shirvani to the newly created role of vice chairman - emerging markets  according to a memo seen by Reuters and confirmed by the bank.",
        "date": "09182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse appoints Eraj Shirvani vice chairman  emerging markets - memo "
    },
    {
        "content": "* aims to sell at least 35 percent of its capital in its upcoming initial public offering (IPO)",
        "date": "09152017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Italy's Gamenet aims to sell at least 35 pct capital in IPO "
    },
    {
        "content": "LONDON  Sept 18 (IFR) - Credit Suisse has appointed Mathew Cestar and Jens Welter co-heads of its investment banking and capital markets (IBCM) business in Europe  the Middle East and Africa as part of a raft of changes at the top of the business.",
        "date": "09182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse overhauls IBCM top team in Europe "
    },
    {
        "content": "DOHA  Sept 13 The Qatar Investment Authority has deployed more than half of the $45 billion earmarked for the United States since 2015 and most of its future investments will go to the infrastructure sector  its chief executive said on Wednesday.",
        "date": "09132017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Qatar sovereign fund says most of future U.S. investments in infrastructure "
    },
    {
        "content": "LONDON Around 10 000 finance jobs will be shifted out of Britain or created overseas in the next few years if the UK is denied access to Europe's single market  according to a Reuters survey of firms employing the bulk of workers in international finance.",
        "date": "09182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Exclusive: 10 000 UK finance jobs affected in Brexit's first wave - Reuters survey "
    },
    {
        "content": "MUMBAI  Sept 13 India's cash crunch and confusion over the introduction of a national sales tax were initially blamed for pulling economic growth down to its weakest pace in more than three years. But that is masking a more debilitating factor affecting the economy - corporate debt.",
        "date": "09132017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "As India Inc struggles to cut down debt  the economy suffers "
    },
    {
        "content": "ZURICH  Sept 18 Credit Suisse has appointed Mathew Cestar and Jens Welter co-heads of its investment banking and capital markets (IBCM) business in Europe  the Middle East and Africa (EMEA)  the Swiss bank said in an internal memo seen by Reuters.",
        "date": "09182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse appoints new IBCM co-heads for EMEA - memo "
    },
    {
        "content": "ZURICH  Sept 18 Credit Suisse has set up a new department to nurture socially conscious investing  the latest effort by a major bank to cater for growing demand for so-called impact investing.",
        "date": "09182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse looks to make an impact with new investment wing "
    },
    {
        "content": "LONDON  Sept 8 Italy's Edizione Holding  the investment vehicle of the Benetton family  is preparing a bid for Italian packaging manufacturer Guala Closures  valued at more than 1 billion euros ($1.2 billion) including debt  three sources said.",
        "date": "09082017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Benetton's Edizione readying bid for packaging firm Guala Closures - sources "
    },
    {
        "content": "ZURICH  Sept 4 Credit Suisse said it has hired Bruno Hallak as its new vice chairman for the Europe  Middle East and Africa region within its Investment Banking and Capital Markets division.",
        "date": "09042017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse hires Hallak as EMEA vice chairman in IBCM "
    },
    {
        "content": "CARACAS  Sept 1 U.S. electronic brokerage firm Interactive Brokers has informed clients that it will no longer buy Venezuelan bonds for them  according to a message to clients seen by Reuters and confirmed by the company.",
        "date": "09012017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "U.S. Interactive Brokers halts purchases of Venezuela debt "
    },
    {
        "content": "* Will produce 100 000-200 000 vehicles per year in first phase",
        "date": "09022017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Vietnam's Vingroup starts construction on $1-1.5 bln first phase car factory "
    },
    {
        "content": "HANOI  Sept 2 Vietnam's property conglomerate Vingroup on Saturday started construction of the first phase of a car factory in a project worth $1-1.5 billion  it said.",
        "date": "09022017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Vietnam's Vingroup starts construction on $1-1.5 bln first phase car factory "
    },
    {
        "content": "ZURICH  Aug 24 Swiss bank Credit Suisse has hired Michael Ebert from Bank of America Merrill Lynch as its global head of equity derivatives  according to a memo seen by Reuters.",
        "date": "08242017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse hires BAML's Ebert for equity derivatives job -memo "
    },
    {
        "content": "Aug 22 Credit Suisse Group AG on Tuesday named Dominik Münchbach head of external asset managers (EAM) for Switzerland.",
        "date": "08222017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse names Münchbach head of external asset managers  Switzerland "
    },
    {
        "content": "* Qatar Investment Authority reports a 4.94 percent passive stake in Credit Suisse Group AG‍​ as of August 14  2017 - SEC filing Source text for Eikon: (http://bit.ly/2v1Shtx) Further company coverage:",
        "date": "08222017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Qatar Investment Authority reports a 4.94 pct passive stake in Credit Suisse Group AG‍​ "
    },
    {
        "content": "Aug 23 Credit Suisse Group AG has hired Kirk Kaludis and Owen Bittinger  two technology investment bankers from Barclays Plc in San Francisco  people familiar with the matter said on Wednesday.",
        "date": "08232017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse hires two technology bankers from Barclays -sources "
    },
    {
        "content": "* DIRECT AND INDIRECT SHAREHOLDERS SIGN A CONSULTANCY AGREEMENT WITH CREDIT SUISSE INTEREST. TO IDENTIFY AND EVALUATE STRATEGIC ALTERNATIVES‍​ Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "08232017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Vakko signs consultancy agreement with Credit Suisse to evaluate strategic alternatives "
    },
    {
        "content": "ZURICH  Aug 16 Qatar's voting stake in Swiss bank Credit Suisse has fallen to 15.91 percent from the 17.98 percent reported in June  a disclosure form on the SIX Swiss Exchange's website showed.",
        "date": "08162017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Qatar voting stake in Credit Suisse falls to 15.91 pct "
    },
    {
        "content": "CARACAS  Aug 10 Credit Suisse has barred transactions involving certain Venezuelan bonds and is requiring that business with Venezuela's government and related agencies be subject to a reputation risk review  according to an internal memo seen by Reuters.",
        "date": "08102017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse blocks trading of certain Venezuela bonds -memo "
    },
    {
        "content": "* NYSE will have primary listing with secondary LSE listing (Adds description of Worldpay in lead)",
        "date": "08092017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 4-U.S. payments firm Vantiv clinches $10 bln deal to buy Worldpay "
    },
    {
        "content": "LONDON Former Millennium Capital Partners and Brevan Howard Asset Management trader Arnaud Langlois is preparing to launch equities hedge fund Terreneuve Capital  two sources familiar with the matter told Reuters.",
        "date": "08042017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Ex-Millennium trader Langlois preps new hedge fund: sources "
    },
    {
        "content": "LONDON  Aug 3 Credit Suisse Wealth Management upgraded German equities to 'outperform' from 'neutral' on Thursday  citing strong earnings growth and attractive relative valuations.",
        "date": "08032017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse WM upgrades German equities  says valuation discount unwarranted "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  July 31 (Fitch) Credit Suisse Group AG's (Credit Suisse) 2Q17 results show progress in the bank's targeted cost reductions and sound performances in the group's wealth management businesses  although performance in Asia Pacific was still dragged down by weak trading results and Investment Banking and Capital Markets had a weak quarter. Results were also materially undermined by continued losses from the group's non-core assets. ",
        "date": "07312017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Fitch: Credit Suisse's 2Q17 Results Show Underlying Improvements "
    },
    {
        "content": "NEW YORK  July 27 Jonathan Golub will become chief U.S. equity strategist at Credit Suisse Group AG  having left a similar position at RBC Capital Markets  according to an internal memo viewed by Reuters.",
        "date": "07272017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Golub to lead U.S. equity strategy at Credit Suisse "
    },
    {
        "content": "ZURICH  July 31 The Swiss blue-chip SMI was seen opening flat at 9 018 points on Monday  according to premarket indications by bank Julius Baer.",
        "date": "07312017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Swiss stocks - Factors to watch on July 31 "
    },
    {
        "content": "ZURICH  July 28 A steady stream of new money from the world's wealthiest citizens drove up quarterly profits at Credit Suisse and UBS as they benefited from Switzerland's reputation as a safe haven for investors.",
        "date": "07282017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Rich customers buoy Credit Suisse while risk burdens UBS "
    },
    {
        "content": "July 25 Credit Suisse Group AG appointed Wolfgang Dehen as a senior adviser to the German investment banking and capital markets (IBCM) coverage team.",
        "date": "07252017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse appoints senior adviser to German IBCM coverage team "
    },
    {
        "content": "NEW YORK  July 28 Morgan Stanley  Royal Bank of Canada and three other banks agreed to pay a combined $111.2 million to settle U.S. litigation accusing them of rigging prices in the roughly $5 trillion-a-day foreign exchange market.",
        "date": "07282017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Morgan Stanley  RBC  others settle currency rigging lawsuit in U.S. "
    },
    {
        "content": "* CFO says aiming for loss in 2019 of less than 800 million SFR at strategic resolution unit",
        "date": "07282017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse CEO says should probably expect something on brexit planning by the end-2017 "
    },
    {
        "content": "* CFO says bank has had regularization outflows 0.8 billion Sfr so far in 2017  expect 3-5 billion Sfr in outflows for full year - analyst call",
        "date": "07282017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse hopes for improvement in activity after summer break -CFO "
    },
    {
        "content": "ZURICH Credit Suisse boosted second-quarter net profit 78 percent as Switzerland's second-biggest bank recovers after two years of losses.",
        "date": "07282017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse posts second straight quarterly profit "
    },
    {
        "content": "MEXICO CITY  July 24 Mexico's Coca-Cola Femsa   the world's largest Coke bottler  said on Monday it is poised to lose a key distribution contract in Brazil  sending its shares down 5 percent  even as it reported an 11.5 percent jump in quarterly net profit.",
        "date": "07242017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 4-Coke Femsa loses key Brazil distribution deal; shares slump "
    },
    {
        "content": "* Q2 net profit 303 mln Sfr vs 302 mln estimate in Reuters poll",
        "date": "07282017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Credit Suisse posts second straight quarterly profit "
    },
    {
        "content": "LONDON  July 24 A €575m-equivalent leveraged loan financing backing private equity firm Advent International’s acquisition of Danish packaging group Faerch Plast has closed after a successful early syndication  banking sources said.",
        "date": "07242017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "LPC-Faerch's €575m-equiv buyout loan successfully placed "
    },
    {
        "content": "MILAN/ZURICH  July 20 Italy's tax police have asked the Swiss authorities for information regarding Italians that deposited a total of 6.7 billion euros ($8 billion) in the country.",
        "date": "07202017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "UPDATE 1-Italian tax police ask Switzerland for details on 10 000 banking clients "
    },
    {
        "content": "ZURICH  July 17 Credit Suisse begins work this month on planning for its strategic priorities beyond the Swiss bank's current set of targets  Chief Executive Tidjane Thiam said in a memo to staff.",
        "date": "07172017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse CEO flags start of work on 2018-2020 plan "
    },
    {
        "content": "A former Credit Suisse Group AG  banker from Switzerland pleaded guilty on Wednesday to participating in a wide-ranging scheme to help Americans hide millions of dollars in offshore accounts to evade U.S. taxes.",
        "date": "07202017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Ex-Credit Suisse banker pleads guilty in U.S. offshore tax case "
    },
    {
        "content": "July 17 U.S. buyout firm Carlyle Group LP said it agreed to buy airfield lighting group ADB Safegate from private equity group PAI Partners.",
        "date": "07172017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Carlyle to buy airfield lighting group ADB Safegate "
    },
    {
        "content": "July 19 A former Credit Suisse Group AG banker from Switzerland pleaded guilty on Wednesday to participating in a wide-ranging scheme to help Americans hide millions of dollars in offshore accounts to evade U.S. taxes.",
        "date": "07202017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Ex-Credit Suisse banker pleads guilty in U.S. offshore tax case "
    },
    {
        "content": "WASHINGTON  July 19 A Swiss citizen pleaded guilty on Wednesday to conspiring to help U.S. taxpayers evade taxes from 2002 through 2011 while she headed a team of bankers in Zurich for Credit Suisse AG  the U.S. Justice Department said in a statement.",
        "date": "07202017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Former Credit Suisse banker pleads guilty to U.S. fraud charges "
    },
    {
        "content": "July 13 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "07132017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Lazard  Duff & Phelps  Credit Suisse  BTIG "
    },
    {
        "content": "LONDON  July 13 Credit Suisse has hired Antonia Rowan from U.S. investment bank Jefferies as a senior managing director in its U.K. advisory and corporate broking team  according to an internal memo.",
        "date": "07132017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse hires Antonia Rowan from Jefferies "
    },
    {
        "content": "July 10 Swiss bank Credit Suisse Group AG said on Monday it named Michael De Guzman as country manager in the Philippines.",
        "date": "07102017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse names new country manager in the Philippines "
    },
    {
        "content": "July 12 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "07122017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse  Artisan Partners  Barclays  Aldermore "
    },
    {
        "content": "The Qatar Investment Authority (QIA)  the world's ninth largest sovereign wealth fund  is playing a key role in helping Qatar's financial sector withstand the effects of an economic boycott by its powerful Arab neighbours.",
        "date": "07062017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Factbox: Qatar's sovereign fund plays key anchor role during Gulf rift "
    },
    {
        "content": "ZURICH  July 4 Switzerland's financial watchdog FINMA remains in touch with Credit Suisse over its role in arranging loans for Mozambique state-owned companies  a spokesman for the regulator said on Tuesday  after an independent report concluded it was unclear how the money had been spent.",
        "date": "07042017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Swiss watchdog still in contact with Credit Suisse on Mozambique "
    },
    {
        "content": "ZURICH  July 4 Credit Suisse has told 58 of its IT workers they will be transferred to Indian computer services company HCL Technologies as Switzerland's second biggest bank presses ahead with its cost cutting drive.",
        "date": "07042017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse to transfer 58 IT jobs to outsourcing firm "
    },
    {
        "content": "* AAC Holdings Inc - On June 30  co entered into that certain credit agreement with Credit Suisse AG - SEC Filing",
        "date": "07032017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-AAC Holdings on June 30  co entered into that certain credit agreement with Credit Suisse AG - SEC Filing "
    },
    {
        "content": "LONDON  June 26 Banking fees charged by Credit Suisse to arrange loans for Mozambique's state-owned companies amounted to $23 million  the Swiss lender said  disputing reports it had received more than $100 million.",
        "date": "06262017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse says earned $23 million in fees on Mozambique loans "
    },
    {
        "content": "LONDON/FRANKFURT  June 26 The field of prospective bidders for Japanese conglomerate  Toshiba Corp.'s Swiss-based smart meter group Landis+Gyr has narrowed to two  three banking sources said on Monday.",
        "date": "06262017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Bidders for Toshiba's Landis+Gyr narrows to two - sources "
    },
    {
        "content": "* Entered into purchase agreement with  among others  Credit Suisse  China Citic Bank International and Haitong International",
        "date": "06222017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-China Evergrande Group enters into purchase agreement with Credit Suisse among others "
    },
    {
        "content": "NEW YORK  June 21 Michael Romanowski is joining Credit Suisse as a director on the high-yield sales desk in the bank's global credit products division  according to a source familiar with the matter.",
        "date": "06212017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Romanowski joins Credit Suisse on HY sales desk "
    },
    {
        "content": "* French stocks  banks gain as Macron solidifies reform mandate",
        "date": "06192017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "France  banks  retail rebound make for bright start for European shares "
    },
    {
        "content": "ZURICH  June 23 The Swiss blue-chip SMI was seen opening 0.14 percent higher at 9 064 points on Friday  according to premarket indications by bank Julius Baer .",
        "date": "06232017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Swiss stocks - Factors to watch on June 23 "
    },
    {
        "content": "PARIS  June 19 French stocks outperformed upbeat European indices on Monday following a convincing parliamentary majority for President Emmanuel Macron  while banks bounced following upgrades and the retail sector recovered from last week's losses.",
        "date": "06192017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "France  banks and retail rebound make for bright start for European shares "
    },
    {
        "content": "* SNB says more progress required on loss-absorbing capacity (Adds comment from UBS and Credit Suisse)",
        "date": "06152017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "UPDATE 2-UBS and Credit Suisse need credible insolvency plans -SNB "
    },
    {
        "content": "Refining margins fell across all five U.S. regional petroleum districts in the week ended June 9  Credit Suisse said in a weekly report on Wednesday.",
        "date": "06142017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "U.S. refinery margins fall across all petroleum regions: Credit Suisse "
    },
    {
        "content": "ZURICH  June 15 Switzerland's two biggest banks  UBS and Credit Suisse  are on track to meet the country's updated too-big-to-fail rules but more progress is needed in preparing plans for a potential insolvency  the Swiss central bank said on Thursday.",
        "date": "06152017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UBS  Credit Suisse on track to meet banking rules -Swiss central bank "
    },
    {
        "content": "The following factors could affect Italian markets on Wednesday.",
        "date": "06142017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Italy - Factors to watch on June 14 "
    },
    {
        "content": "ZURICH  June 8 Credit Suisse is to cut roughly 1 500 jobs in London by the end of next year  according to a person familiar with the matter  part of the Swiss bank's efforts to cut costs globally.",
        "date": "06082017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse to cut jobs as it pares back in London "
    },
    {
        "content": "NEW YORK/WASHINGTON The U.S. Justice Department on Wednesday said it is barring legal settlements in federal investigations that include donating funds to community organizations or other third-party groups  rather than paying those directly harmed by the wrongdoing or involved in the cases.",
        "date": "06072017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "U.S. Justice Dept halts settlements funding outside groups "
    },
    {
        "content": "* Credit Suisse to cut 1 500 jobs in London (Adds UBS comment in paragraph 15)",
        "date": "06082017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Credit Suisse to cut jobs as it pares back in London "
    },
    {
        "content": "NEW YORK/WASHINGTON  June 7 The U.S. Justice Department on Wednesday said it is barring legal settlements in federal investigations that include donating funds to community organizations or other third-party groups  rather than paying those directly harmed by the wrongdoing or involved in the cases.",
        "date": "06072017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 3-U.S. Justice Dept halts settlements funding outside groups "
    },
    {
        "content": "* prices new rights issue of up to 400 million euros at 26.1 percent discount to theoretical ex-rights price (TERP)",
        "date": "06082017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Italy's UBI prices 400 mln euro rights issue at 26.1 pct discount "
    },
    {
        "content": "* Credit Suisse announces coupon payments and expected coupon payments on Credit Suisse x-links® exchange traded notes (the \"etns\") Source text for Eikon: Further company coverage:",
        "date": "06062017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse announces coupon payments on x-links exchange traded notes "
    },
    {
        "content": "WASHINGTON  June 7 The U.S. Justice Department has barred legal settlements in federal investigations that include donating funds to community organizations or other third-party groups  rather than to those directly harmed by the wrongdoing  in a change that could affect banks and other corporations.",
        "date": "06072017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-U.S. Justice Dept halts settlements funding outside groups "
    },
    {
        "content": "Contract drug manufacturer and research company Albany Molecular Research Inc  said on Tuesday it had agreed to be taken private by buyout firms Carlyle Group LP  and GTCR LLC for about $922 million in cash.",
        "date": "06062017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "GTCR  Carlyle to buy contract research firm Albany Molecular "
    },
    {
        "content": "* Unit CS Credit Limited entered into loan agreement with borrower",
        "date": "06012017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-China Strategic Holdings says CS Credit Ltd entered into loan agreement "
    },
    {
        "content": "SAN FRANCISCO Credit Suisse Group AG has hired Simon Auerbach from boutique investment bank Foros to focus on business and information services  according to people familiar with the matter.",
        "date": "06062017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse hires info services banker from Foros: sources "
    },
    {
        "content": "ZURICH  June 1 Major Credit Suisse investor Qatar Investment Authority (QIA) has increased its stake in the Swiss bank to 5.01 percent of shares  Credit Suisse said on Thursday.",
        "date": "06012017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Qatar stake in Credit Suisse rises above 5 pct "
    },
    {
        "content": "SAN FRANCISCO  June 5 Credit Suisse Group AG has hired Simon Auerbach from boutique investment bank Foros to focus on business and information services  according to people familiar with the matter.",
        "date": "06062017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse hires info services banker from Foros -sources "
    },
    {
        "content": "Credit Suisse Group AG has hired Cory Rapkin as vice chairman in the healthcare group of its investment banking and capital markets division  according to an internal memo seen by Reuters and confirmed by a spokesman from Credit Suisse.",
        "date": "06052017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse hires Rapkin for healthcare investment banking "
    },
    {
        "content": "SINGAPORE/ZURICH Singapore's central bank has fined Credit Suisse and United Overseas Bank (UOB) a total of S$1.6 million ($1.2 million) for breaching anti-money laundering rules in transactions related to Malaysia's scandal-ridden state fund 1MDB.",
        "date": "05302017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Singapore fines Credit Suisse  UOB over 1MDB-linked dealings  wraps up review "
    },
    {
        "content": "June 5 Credit Suisse Group AG has hired Cory Rapkin as vice chairman in the healthcare group of its investment banking and capital markets division  according to an internal memo seen by Reuters and confirmed by a spokesman from Credit Suisse.",
        "date": "06052017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse hires Rapkin for healthcare investment banking "
    },
    {
        "content": "* MAS says imposed total fines of S$29.1 mln on 8 banks (Adds comment from lawyer  Swiss financial watchdog FINMA)",
        "date": "05302017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 2-Singapore fines Credit Suisse  UOB over 1MDB-linked dealings  wraps up review "
    },
    {
        "content": "ZURICH  May 30 Swiss financial watchdog FINMA conducted \"extensive investigations\" into Credit Suisse's dealings surrounding Malaysia's scandal-hit state fund 1MDB  resulting in a written reprimand for Switzerland's second-biggest bank.",
        "date": "05302017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Swiss watchdog reprimands Credit Suisse over 1MDB dealings "
    },
    {
        "content": "WASHINGTON  May 26 The U.S. economy slowed less than initially thought in the first quarter  but softening business investment and moderate consumer spending are clouding expectations of a sharp acceleration in the second quarter.",
        "date": "05262017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "WRAPUP 2-U.S. economy slowed less than expected in Q1; outlook cloudier "
    },
    {
        "content": "May 25 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "05252017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES- Credit Suisse  Allianz Global "
    },
    {
        "content": "LONDON  May 25 Swiss bank Credit Suisse has hired Mike Di Iorio from Barclays as head of equities for Europe  the Middle East and Africa (EMEA)  as it seeks to beef up the business with new hires  according to a memo seen by Reuters on Thursday.",
        "date": "05252017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse hires new equities EMEA head from Barclays - memo "
    },
    {
        "content": "* Nine Energy Service says it adds BofA Merrill lynch  Credit Suisse  Raymond James and Simmons & Company International to underwriters to IPO",
        "date": "05192017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-Nine Energy Service says it adds BofA Merrill Lynch  Credit Suisse  Raymond James and Simmons & Company International to underwriters to IPO "
    },
    {
        "content": "* confirms it has picked Credit Suisse and Barclays as advisers on strategic Source text for Eikon: (Reporting by Milan newsroom)",
        "date": "05192017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Italy's Guala Closures confirms Credit Suisse and Barclays picked as advisers "
    },
    {
        "content": "May 19 Swiss lender Credit Suisse Group AG said on Friday it appointed Michael De Guzman as head of Philippines coverage in its Asia Pacific Investment Banking and Capital Markets (IBCM) division.",
        "date": "05192017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse appoints head of Philippines coverage "
    },
    {
        "content": "ZURICH Credit Suisse  shareholders on Thursday approved the Swiss bank's plan to sell around 4 billion Swiss francs ($4.1 billion) in new shares to raise funds for a revamp and get its financial strength on a par with rivals.",
        "date": "05182017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse shareholders approve $4.1 billion rights offering "
    },
    {
        "content": "PARIS  May 18 Private equity fund PAI Partners has put its majority stake in Belgian specialist lighting company ADB Safegate up for sale and mandated Credit Suisse and Rothschild to find a buyer  sources close to the matter said on Thursday.",
        "date": "05182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "PAI Partners puts stake in Belgium's ADB Safegate up for sale - sources "
    },
    {
        "content": "May 15 Credit Suisse Group AG has promoted Andy Lipsky and David Wah to co-heads of investment banking and capital markets in the Americas  according to an internal memo seen by Reuters and confirmed by a spokesman from Credit Suisse.",
        "date": "05152017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse appoints co-heads of Americas investment banking  capital markets "
    },
    {
        "content": "ZURICH/BUENOS AIRES Julius Baer  is in advanced talks to buy a minority stake in Argentinian financial services firm TPCG Group [TPCGT.UL]  a source familiar with the matter said  as the Swiss bank lays the groundwork for further expansion in Latin America.",
        "date": "05182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Julius Baer eyes minority stake in Argentina's TPCG: source "
    },
    {
        "content": "* Credit Suisse AG announces the repurchase of its CSLS ETNS and the acceleration of its CSCR and FIBG ETNs",
        "date": "05152017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse AG announces the repurchase of its CSLS ETNs and the acceleration of its CSCR and FIBG ETNs "
    },
    {
        "content": "ZURICH Credit Suisse is on track to hit its targeted cost base by end-2018  Chairman Urs Rohner said on Thursday  part of a broad restructure of Switzerland's second-biggest bank.",
        "date": "05182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse on track to achieve end-2018 cost target: chairman "
    },
    {
        "content": "ZURICH Credit Suisse  expects to make big profits in the next few years  Chairman Urs Rohner said on Thursday  following back-to-back full-year losses for the Swiss bank.",
        "date": "05182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse sees significant operating profits in years ahead: chairman "
    },
    {
        "content": "ZURICH  May 18 Credit Suisse expects to make big profits in the next few years  Chairman Urs Rohner said on Thursday  following back-to-back full-year losses for the Swiss bank.",
        "date": "05182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse sees significant operating profits in years ahead-chairman "
    },
    {
        "content": "ZURICH  May 18 Credit Suisse shareholders on Thursday approved the Swiss bank's plan to sell around 4 billion Swiss francs ($4.1 billion) in new shares to raise funds for a revamp and get its financial strength on a par with rivals.",
        "date": "05182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse shareholders approve 4 bln Sfr rights offering "
    },
    {
        "content": "ZURICH  May 18 Credit Suisse is on track to hit its targeted cost base by end-2018  Chairman Urs Rohner said on Thursday  part of a broad restructure of Switzerland's second-biggest bank.",
        "date": "05182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse on track to achieve end-2018 cost target -chairman "
    },
    {
        "content": "* Arconic completes debt-for-equity exchange of Alcoa Corporation common stock; reduces $800 million of debt year to date",
        "date": "05052017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-Arconic says purchased remainder of debt held by Citigroup and Credit Suisse "
    },
    {
        "content": "ZURICH  May 9 Credit Suisse plans to add around 1 200 jobs in North Carolina  partly by moving positions from New York City  the Swiss bank said on Tuesday  as it tries to cut costs following back-to-back annual losses.",
        "date": "05092017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse to add 1 200 jobs in Raleigh  North Carolina "
    },
    {
        "content": "NEW YORK  May 4 (IFR) - Credit Suisse has hired Matt Walsh as a managing director and co-head of technology  media and telecom to work alongside John Kolz in its equity capital markets group.",
        "date": "05042017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse hires Walsh as co-head of TMT ECM "
    },
    {
        "content": "ZURICH  May 4 The Swiss blue-chip SMI was seen opening 0.3 percent higher at 8 914 points on Thursday  according to premarket indications by bank Julius Baer .",
        "date": "05042017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Swiss stocks - Factors to watch on May 4 "
    },
    {
        "content": "PARIS Societe Generale  JP Morgan and Credit Suisse have been appointed as global coordinators for the initial public offering of ALD Automotive  three sources familiar with the matter said.",
        "date": "05092017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "SocGen  JP Morgan  Credit Suisse to lead ALD Automotive IPO: sources "
    },
    {
        "content": "PARIS  May 9 Societe Generale  JP Morgan and Credit Suisse have been appointed as global coordinators for the initial public offering of ALD Automotive  three sources familiar with the matter said.",
        "date": "05092017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "SocGen  JP Morgan  Credit Suisse to lead ALD Automotive IPO -sources "
    },
    {
        "content": "May 3 Credit Suisse Group AG has hired Matt Walsh as a managing director and co-head of its technology  media & telecom (TMT) equity capital markets (ECM) group  according to an internal memo seen by Reuters and confirmed by a spokesman on Wednesday.",
        "date": "05032017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse hires IPO banker Walsh from Bank of America "
    },
    {
        "content": "ZURICH Credit Suisse Group  said on Thursday it had finalised the banking syndicate underwriting its 4 billion Swiss franc ($4 billion) rights offering  adding more banks to the list of participants.",
        "date": "04272017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse enlarges syndicate underwriting its 4 billion Swiss franc rights offering "
    },
    {
        "content": "* CEO's AGM speech dramatically interrupted by Greenpeace (Recasts  adds comments from CEO  chairman and shareholder)",
        "date": "04282017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "UPDATE 1-Credit Suisse bosses grilled over bonuses after 2016 losses "
    },
    {
        "content": "RIYADH The Olayan family  which controls one of Saudi Arabia's largest conglomerates  is considering listing at least 30 percent of its Saudi business in a sale that could value the company at several billion dollars  banking sources say.",
        "date": "05032017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Olayan family plans to list its Saudi business: sources "
    },
    {
        "content": "LONDON/MILAN  April 27 Italy's Atlantia has agreed to sell 10 percent of its domestic motorway unit to a series of investors including Allianz for 1.48 billion euros ($1.6 billion) as it presses ahead with plans to bid for Spanish rival Abertis.",
        "date": "04272017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 2-Atlantia presses ahead with Abertis tie-up plans after motorway stake sale "
    },
    {
        "content": "ZURICH  April 27 Credit Suisse Group said on Thursday it had finalised the banking syndicate underwriting its 4 billion Swiss franc ($4 billion) rights offering  adding more banks to the list of participants.",
        "date": "04272017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse enlarges syndicate underwriting its 4 bln Sfr rights offering "
    },
    {
        "content": "ZURICH  April 28 Credit Suisse shareholders on Friday approved proposed compensation for its top managers and board of directors despite significant opposition to its decision to pay bonuses after a 2.7 billion Swiss franc ($2.7 billion) loss in 2016.",
        "date": "04282017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse AGM approves executive bonuses despite opposition "
    },
    {
        "content": "BEVERLY HILLS  Calif.  May 1 Credit Suisse AG has deployed 20 robots within the bank  some of which are helping employees answer basic compliance questions  the Swiss bank's global markets chief executive  Brian Chin  said on Monday.",
        "date": "05012017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse has deployed 20 robots within bank  markets CEO says "
    },
    {
        "content": "RIYADH  May 3 The Olayan family  which controls one of Saudi Arabia's largest conglomerates  is considering listing at least 30 percent of its Saudi business in a sale that could value the company at several billion dollars  banking sources say.",
        "date": "05032017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Olayan family plans to list its Saudi business - sources "
    },
    {
        "content": "* RBR unsuccessful in attempt to win three seats on GAM board (Adds detail  comments from chairman)",
        "date": "04272017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Swiss asset manager GAM shareholders veto execs' bonuses "
    },
    {
        "content": "ZURICH  April 28 Activists from environment group Greenpeace gatecrashed Credit Suisse's annual shareholder meeting on Friday to protest against the Swiss bank's dealings with companies behind the Dakota Access Pipeline (DAPL).",
        "date": "04282017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Greenpeace gatecrashes Credit Suisse shareholder meeting "
    },
    {
        "content": "BEVERLY HILLS  Calif.  May 1 Credit Suisse AG has deployed 20 robots within the bank  some of which are helping employees answer basic compliance questions  the Swiss bank's global markets chief executive  Brian Chin  said on Monday.",
        "date": "05012017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Credit Suisse has deployed 20 robots within bank  markets CEO says "
    },
    {
        "content": "ZURICH Credit Suisse has ditched plans to raise money by listing part of its Swiss business and will instead sell new shares worth about 4 billion Swiss francs ($4 billion) to get its financial strength back on a par with rivals.",
        "date": "04262017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse seeks capital security with $4 bln cash call "
    },
    {
        "content": "FRANKFURT Deutsche Bank  has named James von Moltke as new finance chief to replace Marcus Schenck who is taking on the role of co-head of the investment bank  it said on Friday.",
        "date": "04282017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Deutsche Bank names von Moltke as new CFO "
    },
    {
        "content": "* Present CFO in new role as co-head investment banking (Adds confirmation from Deutsche Bank)",
        "date": "04282017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 3-Deutsche Bank names von Moltke as new CFO "
    },
    {
        "content": "April 24 The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "04242017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "PRESS DIGEST- Financial Times - April 24 "
    },
    {
        "content": "ZURICH Credit Suisse  will not decide on how it wants to raise fresh capital until after this week's annual general meeting  SonntagsZeitung reported on Sunday.",
        "date": "04232017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse to make capital hike decision after AGM: report "
    },
    {
        "content": "ZURICH Credit Suisse  has ditched plans to raise money by listing part of its Swiss business and will instead sell new shares worth about 4 billion Swiss francs ($4 billion) to get its financial strength back on a par with rivals.",
        "date": "04262017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse seeks capital security with $4 billion cash call "
    },
    {
        "content": "ZURICH  April 23 Credit Suisse will not decide on how it wants to raise fresh capital until after this week's annual general meeting  SonntagsZeitung reported on Sunday.",
        "date": "04232017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse to make capital hike decision after AGM - report "
    },
    {
        "content": "ZURICH  April 25 Credit Suisse Chairman Urs Rohner faces his toughest shareholder meeting to date this week following an investor revolt over bonuses and losses totalling 5.65 billion Swiss francs ($5.7 billion) since 2015.",
        "date": "04252017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse investors prepare to grill chairman Rohner over pay "
    },
    {
        "content": "ZURICH Credit Suisse  Chairman Urs Rohner believes he has the support of most shareholders  he was quoted as saying on Wednesday ahead of what is expected to be a stormy annual shareholders meeting on Friday.",
        "date": "04262017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse chairman says has shareholder backing: report "
    },
    {
        "content": "ZURICH  April 26 Credit Suisse Chairman Urs Rohner believes he has the support of most shareholders  he was quoted as saying on Wednesday ahead of what is expected to be a stormy annual shareholders meeting on Friday.",
        "date": "04262017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse chairman says has shareholder backing - report "
    },
    {
        "content": "The following Spanish stocks may be affected by newspaper reports and other factors on Tuesday. Reuters has not verified the newspaper reports  and cannot vouch for their accuracy:",
        "date": "04252017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Spanish stocks - Factors to watch on Tuesday "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Tidjane Thiam’s plan to raise new capital isn’t the Credit Suisse boss’s first U-turn. Compared with other big reversals – like his decision in 2016 to dump securitised products and leave investors nursing big losses – this is  at least  the good kind.",
        "date": "04262017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse's Thiam picks capital over returns "
    },
    {
        "content": "LONDON  April 26 Bankers are lining up to around €570m of debt financing to back a potential sale of Danish packaging group Faerch Plast as the auction process progresses to the final round  banking sources said on Wednesday.",
        "date": "04262017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "LPC-Bankers line up €570m of debt for Faerch as sale heats up "
    },
    {
        "content": "LONDON  April 19 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "04192017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "FTSE to extend losses after sterling hits six-month peak - For more see the European equities LiveMarkets blog "
    },
    {
        "content": "ZURICH Credit Suisse has failed to completely quash a shareholder revolt over payouts to the bank's senior managers  even after offering to cut bonuses for top management by 40 percent and a pay freeze for its board of directors.",
        "date": "04182017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse pay revolt rumbles on even after concessions "
    },
    {
        "content": "* Said on Monday it bought 4 014 687 ordinary shares of Neinor Homes at 16.46 euros ($17.89) per share  exercising the over-allotment 'green-shoe' option granted to the placing entities",
        "date": "04252017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse exercises 'green-shoe' option in Neinor "
    },
    {
        "content": "* Shares hit highest since March 3 (Adds comments by CEO  investor and analysts  share price)",
        "date": "04262017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 3-Credit Suisse seeks capital security with $4 bln cash call "
    },
    {
        "content": "* Vote to take place at AGM on April 28 (Adds ISS recommendation)",
        "date": "04182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 4-Credit Suisse pay revolt rumbles on even after concessions "
    },
    {
        "content": "LONDON  April 26 (IFR) - In a well-flagged move  Credit Suisse has decided to raise SFr4bn (US$4.02bn) directly from existing shareholders rather than garnering a similar amount from spinning off part of its Swiss universal bank  which houses all its domestic activities.",
        "date": "04262017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse clarifies capital plans "
    },
    {
        "content": "* Bank says has now to cut bonuses by 40 percent (Adds detail  background)",
        "date": "04142017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "UPDATE 2-Credit Suisse cuts bonuses for top execs by 40 pct amid shareholder protest "
    },
    {
        "content": "April 13 Credit Suisse said its CEO and board of directors has proposed a reduction in performance awards by 40 percent.",
        "date": "04132017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse board proposes to cut variable pay by 40 pct "
    },
    {
        "content": "OSLO  April 18 Norway's $915 billion sovereign wealth fund  the world's largest  will vote in favour of Credit Suisse's planned payouts to senior managers following a recent bonus cut  the fund said in a statement on Tuesday.",
        "date": "04182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Norway's sovereign fund backs Credit Suisse executive pay "
    },
    {
        "content": "* CEO and Executive Board voluntarily propose a reduction of variable compensation by 40 percent",
        "date": "04132017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse - CEO and Executive Board voluntarily propose a reduction of variable compensation by 40 percent "
    },
    {
        "content": "ZURICH The lawmaker who instigated a shareholder veto over excessive management pay in Switzerland has urged investors to use this power to block 78 million Swiss francs ($78 million) in bonuses for Credit Suisse's  top executives.",
        "date": "04132017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Lawmaker behind Swiss pay veto calls for Credit Suisse bonus cut "
    },
    {
        "content": "* Credit suisse shareholder advisor ethos says credit suisse remunerations are still too high in light of the chf 2.7 billion loss posted by credit suisse in 2016",
        "date": "04182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Swiss shareholder advisor Ethos still opposes Credit Suisse pay "
    },
    {
        "content": "ZURICH  April 18 Credit Suisse Chief Executive Tidjane Thiam's 2016 compensation will total 10.24 million Swiss francs ($10.2 million)  down from 11.9 million after the Swiss bank's top management offered to cut their bonuses by 40 percent following mounting shareholder pressure.",
        "date": "04182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse CEO Thiam to get 10.2 mln Sfr for 2016 after bonus cut "
    },
    {
        "content": "* Raises chances shareholders block bonuses in AGM binding vote",
        "date": "04112017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "UPDATE 1-Proxy adviser ISS fuels Credit Suisse manager pay revolt "
    },
    {
        "content": "ZURICH Shareholder advisory firm Ethos rejected all Credit Suisse's executive pay plans and called for top management changes on Friday  adding to pressure on Switzerland's second-biggest bank over \"excessive\" remuneration.",
        "date": "04072017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Ethos joins Credit Suisse pay revolt  demands change at top "
    },
    {
        "content": "ZURICH  April 7 Shareholder advisory firm Ethos rejected all Credit Suisse's executive pay plans and called for top management changes on Friday  adding to pressure on Switzerland's second-biggest bank over \"excessive\" remuneration.",
        "date": "04072017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Ethos joins Credit Suisse pay revolt  demands change at top "
    },
    {
        "content": "ZURICH  April 7 Proxy adviser Ethos on Friday recommended Credit Suisse shareholders vote against the re-election of Chairman Urs Rohner and Vice-Chairman Richard Thornburgh in a binding vote at the April 28 annual general meeting.",
        "date": "04072017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Proxy adviser Ethos opposes re-election of Credit Suisse chairman "
    },
    {
        "content": "ZURICH  April 4 An anonymous tip to Dutch authorities on thousands of suspicious accounts at Credit Suisse could hardly have come at a worse time for Switzerland and its banks.",
        "date": "04052017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "RPT-Credit Suisse scandal threatens Swiss efforts to clean up reputation "
    },
    {
        "content": "Russia suggested it would publicly stand by Syrian President Bashar al-Assad despite outrage over a chemical weapons attack (< hyperlink: http://www.reuters.com/article/us-mideast-crisis-syria-idlib-idUSKBN1760IB) that choked scores of people to death in a rebel-held northern Syrian town. This sets U.S. President Donald Trump up with the same dilemma as his predecessor: openly challenge Moscow and risk deep involvement in a Middle East war by seeking to punish Assad  or compromise and accept ",
        "date": "04052017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Wednesday Morning Briefing "
    },
    {
        "content": "LONDON  April 5 Bankers are working on debt packages of around US$1.5bn to back a potential sale of one of the largest US herbal supplement makers  Nature's Bounty Co  banking sources said on Wednesday.",
        "date": "04052017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "LPC-Bankers prepare US$1.5bn to supplement Nature’s Bounty sale "
    },
    {
        "content": "LONDON Credit Suisse  has taken out adverts in British Sunday newspapers stressing a zero-tolerance policy on tax evasion  as the Swiss bank tries to limit any damage to its reputation from raids on three of its offices. | Video ",
        "date": "04032017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse takes out UK newspaper ads after office raids in tax case "
    },
    {
        "content": "LONDON  April 2 Credit Suisse has taken out adverts in British Sunday newspapers stressing a zero-tolerance policy on tax evasion  as the Swiss bank tries to limit any damage to its reputation from raids on three of its offices.",
        "date": "04022017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse takes out UK newspaper ads after office raids in tax case "
    },
    {
        "content": "* Credit Suisse Ag announces its intent to suspend further issuances of its CSLS ETNS",
        "date": "03302017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse AG announces its intent to suspend further issuances of its Csls Etns "
    },
    {
        "content": "April 4 Credit Suisse Securities (USA)  a unit of Credit Suisse AG  and a former investment adviser have agreed to pay about $8 million in fines to settle charges relating to improper investments  the U.S. Securities and Exchange Commission said.",
        "date": "04052017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "US regulator fines Credit Suisse unit  adviser over improper investments "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Credit Suisse knows the importance of keeping its nose clean. The Swiss bank confirmed on March 31 that its offices had been raided by authorities in several countries in relation to possible tax evasion. It later stressed its \"strict zero tolerance policy\"  pointing to a review initiated in 2011 to purge it of any dicey clients. A guilty plea and $2.6 billion settlement with U.S. authorities over tax evasion in 2014 have given the bank good reason to be scrupulo",
        "date": "04032017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse raid jabs at private bank model "
    },
    {
        "content": "* No premium offered for non-voting shares (Adds CEO comments  advisor names)",
        "date": "03302017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 2-China's Creat makes 1.2 bln euro bid for German blood plasma firm "
    },
    {
        "content": "* U.S. SEC - SEC charges Credit Suisse and Former IA representative with breaches of fiduciary duty",
        "date": "04052017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-U.S. SEC charges Credit Suisse  former IA representative with breaches of fiduciary duty "
    },
    {
        "content": "AMSTERDAM/ZURICH Swiss bank Credit Suisse  has been dragged into yet more tax evasion and money laundering investigations  after a tip-off to Dutch prosecutors about tens of thousands of suspect accounts triggered raids in five countries.",
        "date": "03312017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse under fire as clients hunted for tax evasion "
    },
    {
        "content": "ZURICH  April 4 An anonymous tip to Dutch authorities on thousands of suspicious accounts at Credit Suisse could hardly have come at a worse time for Switzerland and its banks.",
        "date": "04042017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse scandal threatens Swiss efforts to clean up reputation "
    },
    {
        "content": "ZURICH  March 30 Credit Suisse Group can take its time on deciding whether to go ahead with a planned listing of its domestic banking unit  originally envisioned for the second half of 2017  Chairman Urs Rohner told the Weltwoche magazine.",
        "date": "03302017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse can take time on Swiss unit IPO decision-Rohner "
    },
    {
        "content": "* Credit Suisse says cooperating with authorities (Adds Credit Suisse comment on 55 000 suspect accounts)",
        "date": "03312017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 7-Credit Suisse under fire as clients hunted for tax evasion "
    },
    {
        "content": "ZURICH  March 31 Credit Suisse is conducting an internal investigation over whether staff breached compliance rules after three of its offices were searched in tax evasion probes  the head of its International Wealth Management division said on Friday.",
        "date": "03312017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse launches internal investigation after offices searched in tax probe "
    },
    {
        "content": "HONG KONG Credit Suisse Group AG  will make a decision on its capital raising plans \"as soon as possible \" its chief executive said on Tuesday  without giving specific details on the timing or the type of fund-raising.",
        "date": "03282017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse CEO to decide on capital raising 'as soon as possible' "
    },
    {
        "content": "ZURICH  April 4 Proxy adviser Glass Lewis on Tuesday recommended Credit Suisse shareholders reject its proposal to pay 25.99 million Swiss francs ($25.9 million) in short-term bonuses to the executive board in a binding vote at the April 28 annual general meeting.",
        "date": "04042017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Glass Lewis recommends Credit Suisse investors reject executive bonuses "
    },
    {
        "content": "ZURICH  April 4 Proxy adviser Glass Lewis on Tuesday recommended Credit Suisse shareholders reject a proposal to pay 25.99 million Swiss francs ($25.9 million) in short-term bonuses to the executive board in a binding vote at the annual general meeting on April 28.",
        "date": "04042017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Glass Lewis recommends Credit Suisse investors reject executive bonuses "
    },
    {
        "content": "ZURICH  March 31 Swiss bank Credit Suisse said on Friday its offices in London  Paris and Amsterdam were contacted by local authorities concerning client tax matters.",
        "date": "03312017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Authorities visit Credit Suisse's London  Paris  Amsterdam offices "
    },
    {
        "content": "LONDON  March 28 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "03282017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "European stock futures open higher  eyes on Tesco as shareholders oppose takeover deal - For more see the European equities LiveMarkets blog "
    },
    {
        "content": "LONDON  March 28 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "03282017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "European shares set to open higher  Tesco shareholders oppose Booker deal - For more see the European equities LiveMarkets blog "
    },
    {
        "content": "BERN Swiss financial watchdog FINMA is talking to Credit Suisse about how much capital it should have while giving the bank the freedom to choose how it achieves this  FINMA Chief Executive Mark Branson said on Tuesday.",
        "date": "04042017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "FINMA talking to Credit Suisse about capital situation "
    },
    {
        "content": "FRANKFURT/LONDON/ZURICH Credit Suisse  is considering a quickfire share sale rather than pursuing a separate listing for its Swiss banking division  two sources close to the matter told Reuters  in a move that could raise 3 billion Swiss francs ($3.03 billion).",
        "date": "03232017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse considers stock sale over Swiss IPO: sources "
    },
    {
        "content": "ZURICH  March 21 Credit Suisse will say as soon as possible whether it will go ahead with plans to float a minority stake of its Swiss bank  Chief Executive Tidjane Thiam told Swiss paper Finanz und Wirtschaft  adding the bank still needs more capital.",
        "date": "03212017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse to disclose capital-raising plans soon  CEO tells FuW "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - Tidjane Thiam's compensation for 2016 shows up Credit Suisse's tin ear. The Swiss bank's board has granted its chief executive 11.9 million Swiss francs ($12 million) for the year. That looks bad in a period when it made a 2.7 billion Swiss franc loss and was considering a potentially dilutive capital raise.",
        "date": "03242017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse CEO payout is undeserved "
    },
    {
        "content": "* Does not give specific details on timing or fund-raising type",
        "date": "03282017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 2-Credit Suisse CEO to decide on capital raising 'as soon as possible' "
    },
    {
        "content": "BERN  April 4 Swiss financial watchdog FINMA is talking to Credit Suisse about how much capital it should have while giving the bank the freedom to choose how it achieves this  FINMA Chief Executive Mark Branson said on Tuesday.",
        "date": "04042017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-FINMA talking to Credit Suisse about capital situation "
    },
    {
        "content": "* Could raise about 3 bln Sfr through accelerated bookbuilding",
        "date": "03232017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 2-Credit Suisse considers stock sale over Swiss IPO -sources "
    },
    {
        "content": "ZURICH Credit Suisse  Chief Executive Tidjane Thiam's pay for his first full year in the job swelled to 11.9 million Swiss francs ($12 million)  while bonuses rose 6 percent despite back-to-back annual losses at Switzerland's second-biggest bank. | Video ",
        "date": "03242017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse CEO pockets $12 million despite back-to-back losses "
    },
    {
        "content": "* Bank says preparations continuing for Swiss unit IPO   (Adds comments from rating agency  detail)",
        "date": "03242017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 2-Credit Suisse CEO pockets $12 mln despite back-to-back losses "
    },
    {
        "content": "HONG KONG  March 28 Credit Suisse will make a decision on its capital raising plans \"as soon as possible \" its chief executive said on Tuesday  without giving specific details on the timing or the type of fund-raising.",
        "date": "03282017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse to decide on capital raising 'as soon as possible' "
    },
    {
        "content": "BERN  April 4 Swiss financial watchdog FINMA has spoken to Credit Suisse about searches last week at the Swiss bank's offices in London  Paris and Amsterdam  FINMA Chief Executive Mark Branson said on Tuesday.",
        "date": "04042017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "FINMA says in contact with Credit Suisse after office raids "
    },
    {
        "content": "LONDON  March 23 Live coverage of European markets now available on cpurl://apps.cp./cms/?pageId=livemarkets",
        "date": "03232017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse drops on share sale talk  Ford warning hits Fiat - For more see the European equities LiveMarkets blog "
    },
    {
        "content": "Shares of Snap Inc jumped nearly 5 percent on Monday after several of the Snapchat owner's IPO underwriters handed it badly needed \"buy\" ratings.",
        "date": "03282017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Snap surges after IPO banks give flurry of 'buy' ratings "
    },
    {
        "content": "FRANKFURT/LONDON  March 23 Credit Suisse  is considering an accelerated bookbuilding to raise capital instead of selling a minority stake in its Swiss banking division  two sources familiar with the matter told Reuters.",
        "date": "03232017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse considers stock sale instead of Swiss unit IPO -sources "
    },
    {
        "content": "* Bank to decide next month whether to do Swiss bank IPO - sources",
        "date": "03172017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse set to decide in April on Swiss bank IPO - sources "
    },
    {
        "content": "ZURICH/LONDON Credit Suisse's  board of directors is set to decide in April whether to go ahead with a partial initial public offering of its Swiss bank  two people familiar with the matter told Reuters  with alternative options being considered.",
        "date": "03172017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse set to decide in April on Swiss bank IPO: sources "
    },
    {
        "content": "Oil services company Wood Group has agreed to buy rival Amec Foster Wheeler for 2.2 billion pounds ($2.7 billion)  seeking rewards from the fast-growing U.S. shale energy sector.",
        "date": "03132017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Wood Group buys Amec Foster for $2.7 billion to target oil upturn benefits "
    },
    {
        "content": "ZURICH  March 9 Credit Suisse could opt for a 5 billion Swiss franc ($4.9 billion) capital increase instead of floating a minority stake of its Swiss business  Bernstein analysts predicted in a note on Thursday.",
        "date": "03092017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Bernstein expects Credit Suisse 2017 cap hike  no Swiss unit listing "
    },
    {
        "content": "HOUSTON  March 9 Foreign institutional investors  including sovereign wealth funds  are studying investments in the U.S. interstate oil and gas pipeline network as a way to obtain recurring returns in a low interest-rate environment.",
        "date": "03092017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "CERAWEEK-Foreign buyers eye U.S. pipeline investments in hunt for steady yields "
    },
    {
        "content": "SAO PAULO  March 9 Lojas Americanas SA raised 2.405 billion reais ($760.8 million) from the sale of new common and preferred shares in a restricted-efforts offer  helping Brazil's largest discount retailer reduce debt and pay for expansion.",
        "date": "03092017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 2-Brazil's Americanas raises $760.8 mln in share offering "
    },
    {
        "content": "ZURICH  March 8 Credit Suisse is looking at the merits of going ahead as planned with an initial public offering (IPO) of its domestic business after ending 2016 within its CET1 ratio target range  Chief Financial Officer David Mathers said on Wednesday.",
        "date": "03082017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse CFO says considering options over Swiss unit IPO "
    },
    {
        "content": "ZURICH  March 8 Credit Suisse expects to issue 13-15 billion Swiss francs ($12.8-14.8 billion) in debt in 2017  down from 16 billion last year  according to a slide presentation from Chief Financial Officer David Mathers on Wednesday.",
        "date": "03082017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse expects to issue 13-15 bln Sfr in debt in 2017 "
    },
    {
        "content": "TAIPEI  March 8 A senior executive of the Taiwan branch of Credit Suisse Group AG is under investigation for suspected insider trading  a Taiwan prosecutor said on Wednesday.",
        "date": "03082017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse executive investigated for suspected insider trading in Taiwan "
    },
    {
        "content": "* On Feb 23 units agreed and completed disposal of portfolio of predominately US second lien residential mortgage loans to DLJ Mortgage Capital  unit of of Credit Suisse",
        "date": "03072017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-HSBC says units completes disposal of residential mortgage loans portfolio to Credit Suisse's unit "
    },
    {
        "content": "TAIPEI  March 8 A senior executive of the Taiwan operation of Credit Suisse Group is under investigation for suspected insider trading  a Taiwan prosecutor said on Wednesday.",
        "date": "03082017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Credit Suisse executive investigated for suspected insider trading in Taiwan "
    },
    {
        "content": "LONDON/BOSTON Bank stocks are back in vogue for hedge funds  which have shunned the industry over the past seven years due to a squeeze on banks' profitability from low interest rates and because of their opaque balance sheets.",
        "date": "03072017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Banks come in from the cold for hedge funds "
    },
    {
        "content": "ZURICH  March 3 Credit Suisse has appointed Christian Berchem chief executive of Credit Suisse (UK) Ltd  its UK private banking business  as of June 7 pending regulatory approval  the Swiss banking group said on Friday.",
        "date": "03032017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse names Berchem CEO of UK private banking arm "
    },
    {
        "content": "ZURICH Credit Suisse  expects higher lending to the world's wealthiest individuals will help its big bet on wealth management pay off.",
        "date": "03022017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse sees more lending to the world's wealthy "
    },
    {
        "content": "March 1 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "03012017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse  ESM  Perella Weinberg  Brit Ltd "
    },
    {
        "content": "ZURICH Credit Suisse  has hired an investor relations manager for its Swiss entity  a bank spokesman said on Friday  as it moves ahead with plans to spin off a minority stake in its domestic bank.",
        "date": "03032017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse hires IR manager for possible Swiss unit IPO "
    },
    {
        "content": "ZURICH  March 3 Credit Suisse has hired an investor relations manager for its Swiss entity  a bank spokesman said on Friday  as it moves ahead with plans to spin off a minority stake in its domestic bank.",
        "date": "03032017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse hires IR manager for possible Swiss unit IPO "
    },
    {
        "content": "ZURICH  March 2 Credit Swiss will transfer its Swiss asset management business to a new entity due to begin operations under its own license at the end of March  the bank said on Thursday.",
        "date": "03022017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse to transfer Swiss asset management business to new entity "
    },
    {
        "content": "HONG KONG  March 1 Credit Suisse Group AG  said on Wednesday that Ken Pang  currently head of the Swiss bank's global markets trading in Asia Pacific  would take over as its new regional head for global markets business.",
        "date": "03012017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse names new Asia Pacific global markets head "
    },
    {
        "content": "Feb 24 Swiss financial services provider Credit Suisse AG  a unit of Credit Suisse Group AG  appointed two senior executives in its private banking business in India.",
        "date": "02242017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse makes two senior India appointments "
    },
    {
        "content": "Feb 22 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "02222017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse  HSBC  UBS  Aldermore  HighVista Strategies "
    },
    {
        "content": "Feb 22 Credit Suisse Group AG appointed Christoph Schumacher as head of global real estate in its asset management unit  effective June 1.",
        "date": "02222017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse Asset Management names head of global real estate "
    },
    {
        "content": "Feb 15 Credit Suisse said it appointed Mervyn Chow chief executive officer of China and Neil Harvey chairman of the Greater China region.",
        "date": "02152017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse announces senior leadership appointments in China "
    },
    {
        "content": "Feb 15 Try to hide wherever you like but periods of rising interest rates mean lower returns.",
        "date": "02152017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "SAFT ON WEALTH-Of rising rates and falling returns: James Saft "
    },
    {
        "content": "ZURICH Credit Suisse will cut up to 6 500 more jobs in 2017  as Chief Executive Tidjane Thiam pushes ahead with a major restructuring which he said on Tuesday might now no longer include floating the bank's Swiss business. | Video ",
        "date": "02142017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse flags 6 500 job cuts in 2017 after $2.4 billion loss "
    },
    {
        "content": "ZURICH  Feb 8 Credit Suisse  Switzerland's second-biggest bank  will shift some Swiss mortgages into a new investment fund to be run by an independent asset manager  it said on Wednesday.",
        "date": "02082017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse to shift some Swiss mortgages into fund "
    },
    {
        "content": "Feb 14 The buyout firm that owns Chuck E. Cheese has hired investment banks to help it prepare for either a sale or initial public offering (IPO)  people familiar with the matter said on Tuesday.",
        "date": "02142017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Chuck E. Cheese hires banks to run sale process  IPO -sources "
    },
    {
        "content": "LONDON  Feb 8 (IFR) - Apollo Global Management has resurrected its attempt to raise a payment-in-kind bond at Verallia  making a series of concessions to win over investors that snubbed the deal last time around.",
        "date": "02082017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Apollo reins in aggression on second attempt at Verallia PIK "
    },
    {
        "content": "* Shares in UK engineer Rolls-Royce drops after record loss   (Adds details  closing prices)",
        "date": "02142017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "M&A hopes drive auto stocks higher as European shares steady "
    },
    {
        "content": "ZURICH  Feb 14 Credit Suisse will push ahead with plans for an initial public offering of its Swiss business but is also open to alternative options to boost its balance sheet  Chief Executive Tidjane Thiam said on Tuesday.",
        "date": "02142017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse still plans to list Swiss unit  open to alternatives "
    },
    {
        "content": "* CEO still plans to list Swiss unit  open to alternatives   (Recasts  adds CEO and analyst comments  updates shares)",
        "date": "02142017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 3-Credit Suisse flags 6 500 job cuts in 2017 after $2.4 bln loss "
    },
    {
        "content": "LONDON  Feb 6 Credit Suisse is relocating its Dutch investment banking team from Amsterdam to London as the Swiss bank seeks to improve efficiency and profitability  a source familiar with matter said.",
        "date": "02062017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse to move Dutch investment banking team to London - source "
    },
    {
        "content": "* there has never been any prospect that we would not remain main owner of Swiss bank",
        "date": "02142017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse CEO: core business will be profitable in 2017  no certainty with SRU "
    },
    {
        "content": "SAO PAULO  Feb 3 Lojas Americanas SA  Brazil's largest discount retailer  said on Friday it had hired the local unit of Credit Suisse Group AG to analyze potential operations to change the company's capital structure  including a possible capital increase.",
        "date": "02032017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Brazil's Lojas Americanas says hired Credit Suisse to analyze capital structure "
    },
    {
        "content": "SAO PAULO  Feb 2 Lojas Americanas SA  Brazil's largest discount retailer  has hired the local unit of Credit Suisse Group AG to underwrite an offering of new shares to fund an acquisition  a Brazil-based blog said on Thursday.",
        "date": "02022017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Brazil's Lojas Americanas hires Credit Suisse for offering -blog "
    },
    {
        "content": "* CFO says expects to operate with cet1 ratio in 2017 between 11-12 percent pre-IPO of Swiss bank-newswires call",
        "date": "02142017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse CFO says 2017 CET1 ratio between 11-12 pct "
    },
    {
        "content": "* CEO says cautiously optimistic about 2017 - CNBC  Source text for Eikon:  Further company coverage:   (Reporting By Zurich newsroom)",
        "date": "02142017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse CEO \"cautiously optimistic\" about 2017 - CNBC "
    },
    {
        "content": "SAO PAULO  Feb 2 Petroleo Brasileiro SA  remains undecided about the sale of some refineries  a sign Brazil's state-controlled oil company might be leaning toward forming partnerships by offering stakes in some of them  a person with direct knowledge of the matter said on Thursday.",
        "date": "02022017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Petrobras undecided over outright sale of refining assets -source "
    },
    {
        "content": "-- Note: Reuters has not verified this story and does not vouch for its accuracy",
        "date": "01262017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MEDIA-Credit Suisse said to consider Dublin expansion as Brexit nears - BBG "
    },
    {
        "content": "Jan 31 Credit Suisse AG has hired Goldman Sachs Group Inc leveraged finance banker Matt DeFusco as a managing director.",
        "date": "01312017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "CORRECTED-MOVES-Goldman leveraged finance banker DeFusco to join Credit Suisse "
    },
    {
        "content": "LONDON The main pension scheme for Britain's universities is investing in a venture with Credit Suisse  to provide senior debt finance to funds active in the direct-lending market  as pension funds look for new ways to diversify their investments.",
        "date": "01252017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse  pension manager USS in direct-lending finance JV "
    },
    {
        "content": "* SMI blue-chip index composition faces biggest change in years",
        "date": "01312017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Actelion  Syngenta takeovers set to shake up Swiss SMI index "
    },
    {
        "content": "* Credit Suisse says expects more tie-ups to follow   (Adds details on Credit Suisse stake  quote)",
        "date": "01252017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Credit Suisse  pension manager USS in direct-lending finance JV "
    },
    {
        "content": "LONDON  Jan 25 Investment bank Credit Suisse  and Universities Superannuation Scheme have agreed a deal to provide senior debt finance to funds active in the growing direct-lending market.",
        "date": "01252017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse  USS agree direct-lending finance joint venture "
    },
    {
        "content": "NEW YORK  Jan 23 (IFR) - Matthew Masso has been tapped by Credit Suisse to head the commercial real estate finance group  replacing former chief Mark Brown  a person familiar with the matter told IFR.",
        "date": "01232017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse gets new head of commercial real estate finance "
    },
    {
        "content": "* Entered into incremental assumption agreement with Credit Suisse Ag  Cayman Islands Branch  and CitiBank  N.A. - SEC filing",
        "date": "01202017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-Berry Plastics Group enters into agreement with Credit Suisse Ag  Cayman Islands Branch and Citibank "
    },
    {
        "content": "Jan 17 (IFR) - Mathew Cestar and Jeff Cohen have been appointed co-heads of global leveraged finance capital markets at Credit Suisse  according to an internal memo seen by IFR.",
        "date": "01172017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse appoints co-heads of global leveraged finance "
    },
    {
        "content": "ZURICH Credit Suisse  Chief Executive Tidjane Thiam sees market conditions improving during 2017 as the bank's reorganization gathers pace and its efficiency drive continues.",
        "date": "01172017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse CEO sees conditions improving in 2017: Bloomberg TV "
    },
    {
        "content": "NEW YORK  Jan 18 Credit Suisse formally agreed to pay $5.3 billion to settle with U.S. authorities over claims it misled investors in residential mortgage-backed securities it sold in the run-up to the 2008 financial crisis  the U.S. Department of Justice said said on Wedenesday.",
        "date": "01182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse finalizes $5.3 bln mortgage deal with U.S. "
    },
    {
        "content": "ZURICH  Jan 17 Credit Suisse Chief Executive Tidjane Thiam sees market conditions improving during 2017 as the bank's reorganisation gathers pace and its efficiency drive continues.",
        "date": "01172017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse CEO sees conditions improving in 2017 - Bloomberg TV "
    },
    {
        "content": "LONDON  Jan 10 The co-head of Credit Suisse's  trading unit in EMEA is leaving the bank  it said in a memo to staff seen by Reuters  the latest management change in the division behind $1 billion in trading losses that came to light last year.",
        "date": "01112017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "CORRECTED-MOVES-Credit Suisse's EMEA co-head of global markets to exit bank -memo "
    },
    {
        "content": "Jan 10 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "01102017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES- Morgan Stanley  Ruffer  SIX  Vontobel  Credit Suisse "
    },
    {
        "content": "NEW YORK Credit Suisse  has formally agreed to pay $5.3 billion to settle with U.S. authorities over claims it misled investors in residential mortgage-backed securities it sold in the run-up to the 2008 financial crisis.",
        "date": "01182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse finalizes $5.3 billion mortgage deal with U.S. "
    },
    {
        "content": "NEW YORK  Jan 18 Credit Suisse has formally agreed to pay $5.3 billion to settle with U.S. authorities over claims it misled investors in residential mortgage-backed securities it sold in the run-up to the 2008 financial crisis.",
        "date": "01182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 2-Credit Suisse finalizes $5.3 bln mortgage deal with U.S. "
    },
    {
        "content": "NEW YORK A U.S. appeals court on Wednesday revived a lawsuit by the Federal Deposit Insurance Corp against five banks including Credit Suisse Group AG  stemming from the sales of mortgage-backed securities ahead of the 2008 financial crisis.",
        "date": "01182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "U.S. regulator can sue banks over mortgage bond sales: appeals court "
    },
    {
        "content": "NEW YORK A U.S. appeals court on Wednesday revived a lawsuit by the Federal Deposit Insurance Corp against five banks including Credit Suisse Group AG stemming from the sales of mortgage-backed securities ahead of the 2008 financial crisis.",
        "date": "01182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "U.S. regulator can sue banks over mortgage bond sales -appeals court "
    },
    {
        "content": "NEW YORK  Jan 18 A U.S. appeals court on Wednesday revived a lawsuit by the Federal Deposit Insurance Corp against five banks including Credit Suisse Group AG  stemming from the sales of mortgage-backed securities ahead of the 2008 financial crisis.",
        "date": "01182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-U.S. regulator can sue banks over mortgage bond sales -appeals court "
    },
    {
        "content": "NEW YORK  Jan 18 (Reuters LPC) - Credit Suisse has hired Michael Eilert as head of US par loan trading  according to an internal memo from the bank.",
        "date": "01182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse hires Eilert as head of US par loan trading "
    },
    {
        "content": "NEW YORK  Jan 18 A U.S. appeals court on Wednesday revived a lawsuit by the Federal Deposit Insurance Corp against five banks including Credit Suisse Group AG  stemming from their sale of mortgage-backed securities ahead of the 2008 financial crisis.",
        "date": "01182017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "U.S. banking regulator can sue banks over mortgage bonds -court "
    },
    {
        "content": "LONDON Credit Suisse and AstraZeneca are among Bank of America-Merrill Lynch's top picks for the first quarter of 2017  as the market is overly pessimistic on both stocks  according to analysts at the bank.",
        "date": "01032017",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse  AstraZeneca among top BofA-ML's top European picks for first quarter "
    },
    {
        "content": "NEW YORK  Jan 9 Post-trade provider the Depository Trust & Clearing Corporation (DTCC) will use blockchain technology this year to rebuild its platform that processes $11 trillion worth of credit default swaps  as Wall Street intensifies efforts to take advantage of the emerging technology.",
        "date": "01092017",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "DTCC to rebuild credit default swaps processing platform with blockchain "
    },
    {
        "content": "ZURICH/FRANKFURT Credit Suisse  and Deutsche Bank  have been hit with a combined penalty of more than $12 billion over the sale of U.S. toxic debt  further hampering two of Europe's leading investment banks as they struggle with weak earnings. | Video ",
        "date": "12232016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "U.S. hits Credit Suisse  Deutsche Bank with toxic debt penalties "
    },
    {
        "content": "NEW YORK Key stock indexes around the world were little changed on Friday  as were the U.S. dollar and U.S. Treasury yields  in low volume trading ahead of the Christmas holiday weekend.",
        "date": "12232016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Global stocks steady  U.S. dollar near 14-year peak on low volumes "
    },
    {
        "content": "ZURICH/NEW YORK The U.S. Department of Justice has asked Credit Suisse to pay between $5 billion and $7 billion to settle a probe over its sale of toxic mortgage securities in the run-up to the 2008 financial crisis  a source with knowledge of the matter said  but the bank has resisted settling for that amount.",
        "date": "12192016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Exclusive: U.S. proposed $5 billion - 7 billion penalty on Credit Suisse on toxic debt - source "
    },
    {
        "content": "LONDON (Reuters Breakingviews) - European lenders' end-of-year fines for mortgage mis-selling have confounded market expectations and left a clear winner: Deutsche Bank. Although Britain's Barclays failed to achieve similar closure  Germany's largest lender by assets and peer Credit Suisse's agreed settlements with the U.S. Department of Justice remove a major question mark.",
        "date": "12232016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Deutsche wins biggest in U.S. regulatory casino "
    },
    {
        "content": "ZURICH Credit Suisse  had agreed in principle to pay U.S. authorities $2.48 billion to settle claims it misled investors in residential mortgage-backed securities it sold in the run-up to the 2008 financial crisis  the Swiss bank said on Friday.",
        "date": "12232016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse agrees $5.3 billion U.S. mortgage settlement "
    },
    {
        "content": "NEW YORK Credit Suisse is the latest bank to shutter one of its private U.S. stock trading venues  as increasing regulatory scrutiny makes it harder to justify the costs of running such trading systems.",
        "date": "12132016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Lights out for Credit Suisse's 'Light Pool' stock trading venue "
    },
    {
        "content": "ZURICH Credit Suisse  on Wednesday pledged to cut another 1 billion Swiss francs ($991 million) in costs and pared back profit targets amid challenging markets which have made it harder for banks to make money.",
        "date": "12072016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse's Thiam steps up cost cuts  lowers profit goals "
    },
    {
        "content": "NEW YORK Credit Suisse on Friday said it would lower investors' hurdle to redeeming two popular exchange-traded notes  used to bet on the price of oil  after it delisted the products in a surprise move this week.",
        "date": "12092016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse lowers hurdle to redeem delisted oil ETNs "
    },
    {
        "content": "ZURICH Challenging market conditions could be set to improve  Credit Suisse  Chief Executive Tidjane Thiam said on Wednesday.",
        "date": "12072016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse CEO says has good reason to believe conditions improving "
    },
    {
        "content": "* Credit Suisse AG - announces its intent to delist and repurchase its MLPN ETN  Source text for Eikon:  Further company coverage:",
        "date": "11092016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse announces its intent to delist and repurchase MLPN ETN "
    },
    {
        "content": "SAN FRANCISCO  Nov 7 Credit Suisse Group AG  has hired Brian Marshall  a corporate development executive at cloud software firm HortonWorks Inc  to be a software-focused investment banker  according to a memo sent out by the bank.",
        "date": "11072016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse hires software investment banker-memo "
    },
    {
        "content": "* CEO says advises not to look at short-term movements in share price  investors taking profits from recent share price rally -media call",
        "date": "11032016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse CEO says investors taking profits from recent share price rally "
    },
    {
        "content": "* CEO says we expect to approach end-2018 cost target in global markets by end-2016 -analyst call",
        "date": "11032016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse CFO says will come back on investor day with revised SRU guidance "
    },
    {
        "content": "Nov 3 Credit Suisse Group AG CFO tells newswire call",
        "date": "11032016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse CFO says will update on cost plans at investor day "
    },
    {
        "content": "* Also filed request to pay 8.5 mln euros to settle criminal case",
        "date": "10212016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "UPDATE 1-Credit Suisse reaches 109.5 mln euro settlement in Italy "
    },
    {
        "content": "MILAN/ZURICH Credit Suisse has agreed to pay 109.5 million euros ($119 million) in taxes and penalties to settle allegations by Italian authorities that it helped clients transfer undeclared funds offshore  the Swiss bank said on Friday.",
        "date": "10212016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse reaches 109.5 mln euro settlement in Italy "
    },
    {
        "content": "MILAN/ZURICH  Oct 21 Credit Suisse has agreed to pay Italian authorities 101 million euros ($109.9 million) in taxes  late payment interest and penalties to settle its tax position in Italy  the Swiss bank said on Friday.",
        "date": "10212016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse says reaches 109.5 mln euro settlement with Italy "
    },
    {
        "content": "Oct 18 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "10182016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-BNP Paribas  Societe Generale  Credit Suisse  JPMorgan "
    },
    {
        "content": "Oct 18 Credit Suisse Group AG named Edwin Yeung as director  US and European credit trading  to establish a new credit trading desk in Hong Kong  according to an internal memo seen by Reuters.",
        "date": "10182016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse names new director at Hong Kong credit trading desk "
    },
    {
        "content": "Oct 13 Credit Suisse Group AG has hired Jason Wortendyke from rival Citigroup Inc as co-head of its global diversified industrials  aerospace and defense investment banking group  according to an internal memo on Thursday reviewed by Reuters.",
        "date": "10132016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse hires top industrials banker from Citi "
    },
    {
        "content": "WASHINGTON Credit Suisse AG   will pay a $90 million penalty and admit wrongdoing after an investigation by U.S. regulators found the bank misrepresented how it determined a performance metric in its wealth management business to investors.",
        "date": "10052016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse admits wrongdoing in asset measure  to pay $90 million "
    },
    {
        "content": "WASHINGTON  Oct 5 Credit Suisse AG will pay a $90 million penalty and admit to wrongdoing  after an investigation by U.S. regulators found the bank misrepresented to investors how it determined a performance metric in its wealth management business.",
        "date": "10052016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse to pay $90 mln over misrepresenting performance metric "
    },
    {
        "content": "Sept 28 Credit Suisse Group AG and Barclays Plc are in mortgage-settlement talks with the U.S. Department of Justice  Bloomberg reported  citing sources.",
        "date": "09282016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "UPDATE 1-Credit Suisse  Barclays in mortgage-settlement talks with DoJ-Bbg "
    },
    {
        "content": "Sept 28 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "09282016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-MFA  Amherst Capital  Credit Suisse  Peel Hunt  Saudi Hollandi Bank "
    },
    {
        "content": "Sept 28 Credit Suisse Group AG and Barclays Plc are in mortgage-settlement talks with the U.S. Department of Justice  Bloomberg reported  citing sources.",
        "date": "09282016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Barclays  Credit Suisse in mortgage-settlement talks with DoJ - Bbg "
    },
    {
        "content": "Sept 28 Credit Suisse Group named Tsuneaki Hirao as managing director and head of Private Banking Japan.",
        "date": "09282016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse names Tsuneaki Hirao head of Japan private banking "
    },
    {
        "content": "ZURICH Credit Suisse Group is on track to deliver its 2016 cost savings target  Chief Executive Tidjane Thiam said in slides prepared for an investment conference on Tuesday.",
        "date": "09272016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse on track for 2016 job cuts: CEO "
    },
    {
        "content": "ZURICH  Sept 27 Credit Suisse Group is on track to deliver its 2016 cost savings target  Chief Executive Tidjane Thiam said in slides prepared for an investment conference on Tuesday.",
        "date": "09272016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse on track for 2016 job cuts - CEO "
    },
    {
        "content": "Sept 19 The following financial services industry appointments were announced on Monday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "09192016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Houlihan Lokey  Credit Suisse  AXA "
    },
    {
        "content": "ZURICH  Sept 19 Credit Suisse Group has named Bill Johnson as head of Asset Management Americas and Michel Degen as head of Asset Management Switzerland and EMEA (Europe  Middle East and Africa)  according to a memo seen by Reuters and confirmed by the Swiss bank.",
        "date": "09192016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse names Americas  EMEA asset management heads "
    },
    {
        "content": "Sept 7 The head of Credit Suisse Group AG's  Global Markets division Timothy O'Hara has stepped down just over 10 months into the job and will be replaced by Brian Chin  the bank's co-head of credit.",
        "date": "09072016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "UPDATE 1-Credit Suisse's O'Hara departs from Global Markets CEO role "
    },
    {
        "content": "Sept 6 Credit Suisse Group AG said Brian Chin will succeed Timothy O'Hara as chief executive of global markets and join the executive board of the bank.",
        "date": "09062016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Brian Chin to become CEO of global markets at Credit Suisse "
    },
    {
        "content": "* Tim O'Hara will be succeeded by Brian Chin  currently co-head of credit  as CEO of global markets",
        "date": "09062016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse Group- Tim O'Hara will be succeeded by Brian Chin as CEO of global markets "
    },
    {
        "content": "* Plans to use net proceeds from bridge credit to pay cash consideration and fees of acquisition of AIG's mortgage-insurance unit",
        "date": "08162016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-Arch Capital enters into bridge credit agreement with Credit Suisse AG  Cayman Islands branch  as administrative agent  initial lender "
    },
    {
        "content": "CARACAS/HOUSTON  Aug 19 Venezuelan state oil company PDVSA has begun talks with Credit Suisse AG  for a possible swap of bonds expiring in 2017  according to sources familiar with the conversations.",
        "date": "08192016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Venezuela's PDVSA in talks with Credit Suisse for bond swap "
    },
    {
        "content": "NEW YORK  Aug 18 Credit Suisse Group AG  is accusing a group of five investment bankers who left for Jefferies Group LLC in May of stealing confidential information and trying to coax former colleagues to join them.",
        "date": "08182016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse banker dispute shows challenge of CEO's new strategy "
    },
    {
        "content": "CARACAS/HOUSTON  Aug 19 Venezuelan state oil company PDVSA has begun talks with Credit Suisse AG  for a possible swap of bonds due in 2017  according to sources familiar with the conversations.",
        "date": "08192016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Venezuela's PDVSA in talks with Credit Suisse for bond swap "
    },
    {
        "content": "NEW YORK  Aug 18 Credit Suisse Group AG  is accusing a group of five investment bankers who left for Jefferies Group LLC in May of stealing confidential information and trying to coax former colleagues to join them.",
        "date": "08182016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Credit Suisse banker dispute shows challenge of CEO's new strategy "
    },
    {
        "content": "Swiss bank Credit Suisse AG  does not need to raise capital \"in most foreseeable scenarios\"  Chief Executive Tidjane Thiam said in an interview with Bloomberg.",
        "date": "08092016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse CEO says bank does not need to raise capital: Bloomberg "
    },
    {
        "content": "Aug 9 Swiss bank Credit Suisse AG does not need to raise capital \"in most foreseeable scenarios\"  Chief Executive Tidjane Thiam said in an interview with Bloomberg.",
        "date": "08092016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse CEO says bank does not need to raise capital-Bloomberg "
    },
    {
        "content": "* Cfo says would be surprised if we don't make significant progress in the course of the year in winding down RWAs in strategic resolution unit -analyst call",
        "date": "07282016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse says revenue guidance same as in Q1 "
    },
    {
        "content": "July 29 Credit Suisse Group AG  which exited its U.S. private wealth business last year  is building out a new investment banking group in the region to serve billionaires.",
        "date": "07292016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse to create U.S. banking business for billionaires "
    },
    {
        "content": "* CFO says  would expect to see further progress in leverage ratio later this year -media call",
        "date": "07282016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse CFO says on track for 6 000 net job reduction in 2016 "
    },
    {
        "content": "NEW YORK  July 18 The Credit Suisse distressed trading team led by Bob Franz  former head of US credit trading at the bank  and Ken Hoffman  former head of distressed trading  has founded asset management firm Arbour Lane Capital Management.",
        "date": "07182016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "REFILE-MOVES-Former Credit Suisse distressed team forms Arbour Lane Capital "
    },
    {
        "content": "ZURICH  July 14 UBS kept its ranking as the world's biggest private bank last year  a study by wealth management researcher Scorpio Partnership showed on Thursday.",
        "date": "07142016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UBS retains positions as world's biggest private bank - study "
    },
    {
        "content": "July 13 Swiss investment bank Credit Suisse Group AG has named David Kostel and Punit Mehta as global co-heads of healthcare investment banking  according to an internal memo reviewed by Reuters on Wednesday.",
        "date": "07132016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse names global heathcare investment banking co-heads "
    },
    {
        "content": "ZURICH  July 12 Credit Suisse on Thursday announced the appointment of three senior bankers to its investment banking and capital markets (IBCM) team in China.",
        "date": "07122016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse strengthens onshore China business with new hires "
    },
    {
        "content": "* Credit Suisse stays benchmark on European cyclicals   (ADVISORY- Follow European and UK stock markets in real time on the Reuters Live Markets blog on Eikon - see cpurl://apps.cp./cms/?pageId=livemarkets)",
        "date": "07132016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "European stocks steady after four days of gains "
    },
    {
        "content": "ZURICH/MOSCOW  July 11 Credit Suisse  plans to close its booking platform for its private banking business in Russia  the bank said on Monday  the latest move in a major restructure by Switzerland's second-largest lender.",
        "date": "07112016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse says to close booking platform in Russia "
    },
    {
        "content": "GENEVA  July 10 Credit Suisse Chief Executive Tidjane Thiam congratulated all the bank's trading teams for the way they handled the aftermath of the Brexit referendum  he said in a newspaper interview published on Sunday.",
        "date": "07102016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse CEO says cheered by traders' Brexit performance "
    },
    {
        "content": "NEW YORK  July 13 (IFR) - Pulp and paper company Celulosa Argentina has put its latest bond sale on hold  a source told IFR Wednesday.",
        "date": "07132016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Celulosa Argentina puts bond sale on hold "
    },
    {
        "content": "LONDON  July 11 The Royal Bank of Scotland  is facing setbacks over a proposed sale of its Greek ship finance business  with potential suitors backing off  partly due to the British vote to leave the European Union  sources told Reuters.",
        "date": "07112016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Interest in RBS' Greek shipping unit cools post-Brexit vote - sources "
    },
    {
        "content": "LONDON  July 13 European stocks gained ground on Wednesday to leave a benchmark regional index near its highest level in more than two weeks  with shares in Spanish banks and AccorHotels outperforming.",
        "date": "07132016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "European stocks lifted by gains at Spanish banks and Accor "
    },
    {
        "content": "ZURICH/MOSCOW  July 11 Credit Suisse  plans to close its booking platform for its private banking business in Russia  the bank said on Monday  the latest move in a major restructure by Switzerland's second-largest lender.",
        "date": "07112016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Credit Suisse says to close booking platform in Russia "
    },
    {
        "content": "ZURICH  July 7 Credit Suisse on Thursday said that Adam Gishen would become the group's new head of investor relations  as current head Christian Stark moves into an expanded role.",
        "date": "07072016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse names Gishen head of investor relations as Stark promoted "
    },
    {
        "content": "* Credit Suisse AG  acting on behalf of syndicate banks  has fully exercised over-allotment option of its initial public offering of 280 000 existing shares at offer price of 53 Swiss francs ($54.21) per share",
        "date": "07072016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Investis Holding says IPO over-allotment option fully exercised "
    },
    {
        "content": "LONDON The halving in value this year of shares in Credit Suisse and Deutsche Bank and their slide to record lows have raised the prospect of both exiting an index of Europe's top bluechips   according to analysts at Societe Generale.",
        "date": "07062016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse  Deutsche Bank could lose spots in European bluechip index: SocGen "
    },
    {
        "content": " ",
        "date": "07052016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Swiss warning to UBS and Credit Suisse to raise billions in bonds "
    },
    {
        "content": "AIX-EN-PROVENCE  France  July 3 Britain is paying the price for a high level of inequality and a chronic lack of investment in education which have prompted a disillusioned population to vote to leave the European Union  Credit Suisse Chief Executive Tidjane Thiam said on Sunday.",
        "date": "07032016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse CEO blames Brexit on low UK education spending "
    },
    {
        "content": "LONDON  July 6 The halving in value this year of shares in Credit Suisse and Deutsche Bank and their slide to record lows have raised the prospect of both exiting an index of Europe's top bluechips  according to analysts at Societe Generale.",
        "date": "07062016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "C.Suisse  Deutsche Bank could lose spots in European bluechip index: SocGen "
    },
    {
        "content": "LONDON  July 6 European stocks fell on Wednesday  led lower by major banks  amid persistent worries over Britain's vote to leave the European Union.",
        "date": "07062016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "European shares pulled lower by banks hurting from Brexit decision "
    },
    {
        "content": "July 5 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Tuesday:",
        "date": "07052016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "HONG KONG  July 5 Credit Suisse has decided to combine its fixed income and equities businesses in Asia Pacific and has named Ali Naqvi as head of the combined unit  according to an internal memo seen by Reuters on Tuesday.",
        "date": "07052016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse names Naqvi head of fixed-income  equities biz in Asia Pacific "
    },
    {
        "content": "ZURICH  June 30 Credit Suisse Chief Executive Tidjane Thiam likes to joke he has a predilection for being under pressure. A year into the job he may have got more than he bargained for.",
        "date": "06302016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "A year into the job  Credit Suisse CEO's superstar status loses shine "
    },
    {
        "content": " (Corrects attribution in 5th paragraph after Credit Suisse clarification)",
        "date": "07062016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse merges fixed income with equities in Asia Pacific "
    },
    {
        "content": "HONG KONG  July 5 Credit Suisse is merging its fixed income and equities divisions in Asia Pacific  according to an internal memo seen by Reuters on Tuesday  as the Swiss bank overhauls its global markets businesses.",
        "date": "07062016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "CORRECTED-(OFFICIAL)-UPDATE 2-Credit Suisse merges fixed income with equities in Asia Pacific "
    },
    {
        "content": "HONG KONG Global investment banks tumbled in league table rankings for equity capital market (ECM) deals in Asia Pacific in the first half of 2016  as share offerings outside China that they typically rely on dried up  preliminary Thomson Reuters data showed.",
        "date": "06302016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Global banks sink in AsiaPac first-half ECM rankings; fees down 33 percent "
    },
    {
        "content": "BERN  June 28 The uncertainty caused by Britain's vote to leave the European Union is unlikely to go away in the coming weeks  the chairman of Swiss bank Credit Suisse said on Tuesday.",
        "date": "06282016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse chairman sees prolonged uncertainty over Brexit vote "
    },
    {
        "content": "ZURICH Credit Suisse  Chairman Urs Rohner sees backing from investors on the bank's new strategy despite the falling share price  he told Swiss paper Handelszeitung in an interview published on Wednesday.",
        "date": "06292016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse chairman says investors back group strategy: paper "
    },
    {
        "content": "ZURICH  June 29 Credit Suisse Chairman Urs Rohner sees backing from investors on the bank's new strategy despite the falling share price  he told Swiss paper Handelszeitung in an interview published on Wednesday.",
        "date": "06292016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse chairman says investors back group strategy - paper "
    },
    {
        "content": "NEW YORK  June 24 Barry Zamore  the former head of US trading of performing leveraged loans at Credit Suisse in New York  is heading to UBS  according to sources.",
        "date": "06242016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES- UBS hires Credit Suisse's former head of performing loan trading Zamore "
    },
    {
        "content": "* Credit Suisse CEO says in statement that markets have been impacted negatively by UK referendum result  bank expects market volatility to stay with us for some time  Further company coverage:    (Reporting by Zurich Newsroom)",
        "date": "06242016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse CEO expects market volatility to stay with us after Brexit vote "
    },
    {
        "content": "WASHINGTON  June 22 A former Credit Suisse AG  banker pleaded guilty on Wednesday in U.S. District Court in Virginia to charges of helping U.S. taxpayers evade income taxes  the U.S. Justice Department said.",
        "date": "06222016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Ex-Credit Suisse banker pleads guilty in tax fraud conspiracy "
    },
    {
        "content": "* Says result of the uk vote does not lead to any automatic changes in uk's legal relationship with the eu  no immediate legal implications for cs's uk clients  employees",
        "date": "06242016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse: Brexit vote has no immediate legal implications "
    },
    {
        "content": "NEW YORK  June 17 (IFR) - Caliber Home Loans this week sold the first rated non-prime home loan securitization since the financial crisis  a US$137m mortgage bond deal that set an uneasy tone for the sector's reopening.",
        "date": "06172016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "CORRECTED-Investors concerned by new RMBS of riskier loans "
    },
    {
        "content": "LONDON The Royal Bank of Scotland has received bids for its Greek ship finance business  banking and financial sources familiar with the matter said  following a leap in bad shipping debts at the lender over the past few months.",
        "date": "06222016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Exclusive: RBS receives bids for Greek shipping business - sources "
    },
    {
        "content": "LONDON  June 22 The Royal Bank of Scotland  has received bids for its Greek ship finance business  banking and financial sources familiar with the matter said  following a leap in bad shipping debts at the lender over the past few months.",
        "date": "06222016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "EXCLUSIVE-RBS receives bids for Greek shipping business - sources "
    },
    {
        "content": "NEW YORK  June 22 Goldman Sachs has hired Benji Cheung from Credit Suisse as a managing director for loan sales  according to sources.",
        "date": "06222016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Goldman Sachs hires Cheung from Credit Suisse for loan sales "
    },
    {
        "content": "SAO PAULO  June 16 Credit Suisse Group AG  said an internal investigation found no evidence that a former employee  Sérgio Firmeza Machado  used his position at the bank to help his father funnel illicit campaign donations to Brazilian politicians as part of a sweeping corruption scandal.",
        "date": "06162016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "UPDATE 1-Credit Suisse finds no wrongdoing by ex-banker linked to Brazil probe "
    },
    {
        "content": "* U.S. DOJ probe focused on determining whether Credit Suisse employees in israel helped dual Israeli and U.S. citizens to evade american taxes - WSJ",
        "date": "06222016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-U.S. investigates Credit Suisse over possible client tax evasion at Israeli unit - WSJ "
    },
    {
        "content": "SAO PAULO  June 16 Credit Suisse Group AG  said an internal investigation has found no evidence that a former banker  Sérgio Firmeza Machado  used his position at the bank to help his father funnel illicit campaign donations to Brazilian politicians as part of a sweeping corruption scandal.",
        "date": "06162016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse finds no wrongdoing by ex-banker linked to Brazil probe "
    },
    {
        "content": "LONDON Credit Suisse would cut its year-end forecasts for Britain's benchmark FTSE 100  equity index by 6 percent if Britain voted to leave the European Union this week.",
        "date": "06222016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse would cut FTSE target by 6 percent if Brexit occurs "
    },
    {
        "content": "ZURICH  June 16 Credit Suisse already plans to bring its capital stock in line with new Swiss too-big-to-fail (TBTF) bank rules  it said on Thursday.",
        "date": "06162016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse reiterates bringing capital in line with new rules "
    },
    {
        "content": "LONDON  June 22 Credit Suisse would cut its year-end forecasts for Britain's benchmark FTSE 100  equity index by 6 percent if Britain voted to leave the European Union this week.",
        "date": "06222016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse would cut FTSE target by 6 pct if Brexit occurs "
    },
    {
        "content": "TAIPEI Dutch chipmaking equipment firm ASML Holdings NV has agreed to buy Taiwanese peer Hermes Microvision Inc (HMI) for about T$100 billion ($3.1 billion) to strengthen the pair's technology offering for semiconductor manufacturers.",
        "date": "06162016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "ASML to buy Taiwan's Hermes Microvision for $3.1 billion in chip sector shake-up "
    },
    {
        "content": "* HMI shares rise by daily limit in Taipei   (Adds advising investment banks)",
        "date": "06162016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 3-ASML to buy Taiwan's Hermes Microvision for $3.1 bln in chip sector shake-up "
    },
    {
        "content": "ZURICH Credit Suisse  is open to making acquisitions to boost its asset gathering businesses  the head of the Swiss bank's international wealth management division said on Monday.",
        "date": "06132016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse's Khan says open to acquisitions "
    },
    {
        "content": "ZURICH Switzerland's two largest lenders  UBS and Credit Suisse  will likely each need to raise an extra 10 billion Swiss francs ($10.4 billion) in capital to meet new leverage requirements  the Swiss National Bank (SNB) said.",
        "date": "06162016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UBS  Credit Suisse likely need 10 billion Sfr in new capital: SNB "
    },
    {
        "content": "June 13 Mesoblast Ltd on Monday said it had regained full rights to its experimental stem cell therapy for advanced chronic heart failure  which is currently in late stage testing  from Teva Pharmaceutical Industries.",
        "date": "06132016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Mesoblast regains full rights to stem cell heart failure treatment "
    },
    {
        "content": "ZURICH  June 16 The Swiss National Bank (SNB) said on Thursday the country's two biggest banks  UBS  and Credit Suisse  will likely each need to raise an extra 10 billion Swiss francs  ($10.4 billion) in capital to meet new leverage requirements.",
        "date": "06162016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "SNB says UBS  Credit Suisse likely need 10 bln Sfr in new capital "
    },
    {
        "content": "FRANKFURT  June 13 (The DAX top-30 index  looked set to open 1.4 percent lower on Monday  according to premarket data from brokerage Lang & Schwarz at 0620 GMT.",
        "date": "06132016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "German stocks - Factors to watch on June 13 "
    },
    {
        "content": "ZURICH  June 7 Swiss financial watchdog FINMA is in touch with lender Credit Suisse over its role in Mozambique loans  a FINMA spokesman said.",
        "date": "06072016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Swiss watchdog in contact with Credit Suisse over Mozambique debt "
    },
    {
        "content": "* Announces coupon payments and expected coupon payments on Credit Suisse X-Links Exchange Traded Notes (the \"ETNs\")  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06062016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse announces coupon payments "
    },
    {
        "content": "(The following statement was released by the rating agency) HONG KONG/LONDON  June 08 (Fitch) HSBC's plans to further restructure its  investment banking division suggest it is following a trend for European global  systemically important banks (GSIBs) to operate capital markets businesses with  greater focus on core strengths  says Fitch Ratings. Several European GSIBs'  first-quarter results showed weak contributions from capital-markets activities   reflecting a challenging market environment",
        "date": "06082016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Fitch: HSBC Investment Bank Plan Follows Shifting GSIB Focus "
    },
    {
        "content": "CAPE TOWN  June 7 Standard Bank is taking a cautious approach to projects in Mozambique due to recent sovereign debt issues but still believes in the potential of the power sector  Rentia van Tonder  the bank's head of renewable energy  power and infrastructure  said on Tuesday.",
        "date": "06072016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Standard Bank cautious on Mozambique due to debt concerns "
    },
    {
        "content": "Longtime Credit Suisse Group AG  investment banker David DeNunzio is leaving the Swiss bank to become global head of mergers and acquisitions (M&A) at Wells Fargo & Co   according to people familiar with the matter.",
        "date": "06042016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse M&A chairman DeNunzio joins Wells Fargo: sources "
    },
    {
        "content": "June 3 Longtime Credit Suisse Group AG  investment banker David DeNunzio is leaving the Swiss bank to become global head of mergers and acquisitions (M&A) at Wells Fargo & Co  according to people familiar with the matter.",
        "date": "06042016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-MOVES-Credit Suisse M&A chairman DeNunzio joins Wells Fargo -sources "
    },
    {
        "content": "June 3 Longtime Credit Suisse Group AG  investment banker David DeNunzio is leaving the Swiss bank to become global head of mergers and acquisitions (M&A) at Wells Fargo & Co  according to people familiar with the matter.",
        "date": "06042016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse M&A chairman DeNunzio joins Wells Fargo -sources "
    },
    {
        "content": "LONDON  June 2 Credit Suisse has told its staff to leave work by 7pm on a Friday and not return until at least Saturday lunchtime  unless a big deal is in the works.",
        "date": "06022016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse seeks to make Friday nights special for staff "
    },
    {
        "content": "June 9 The following financial services industry appointments were announced on Thursday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "06092016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES- Credit Suisse  Bank Sohar  Bank Of America Merrill Lynch "
    },
    {
        "content": "LONDON  June 2 - Simon Francis  a managing director in Credit Suisse's leveraged finance and high-yield syndicate business  is taking on added syndication responsibilities for investment-grade corporates  according to two sources.",
        "date": "06022016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse's Francis adds high grade responsibilities "
    },
    {
        "content": "MAPUTO  June 9 Mozambique President Filipe Nyusi on Thursday fired Finance Minister Adriano Maleiane  who has been embroiled in more than two weeks of negotiations with Russia's VTB Bank over a late $178 million loan repayment.",
        "date": "06092016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Mozambique president dismisses finance minister "
    },
    {
        "content": "ZURICH  June 2 Swiss bank Credit Suisse  said on Thursday it is issuing around 75.5 million new shares representing 3.8 percent of its currently issued share capital for its 2015 scrip dividend.",
        "date": "06022016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse announces terms of share issue for scrip dividend "
    },
    {
        "content": "LONDON  June 9 Credit Suisse has hired Jerome Renard  a former head of equity capital markets at Nomura   as a managing director  according to a memo seen by Reuters on Thursday.",
        "date": "06092016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse hires Nomura banker for equity capital markets role - memo "
    },
    {
        "content": "SINGAPORE/HONG KONG  May 31 AIA Group  and Britain's Prudential PLC are among insurers considering bids to buy at least 49 percent of the $3 billion insurance unit of Thai lender Siam Commercial Bank (SCB)   people with direct knowledge of the matter said.",
        "date": "05312016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "AIA  Prudential  others weigh bids for Thai SCB's insurance unit stake-sources "
    },
    {
        "content": "FRANKFURT  May 31 The DAX top-30 index  looked set to open 0.2 percent higher on Tuesday  according to premarket data from brokerage Lang & Schwarz at 0616 GMT.",
        "date": "05312016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "German stocks - Factors to watch on May 31 "
    },
    {
        "content": "ZURICH  May 26 Credit Suisse has sold bonds worth 220 million Swiss francs ($222 million) to help insure against certain operational risks such as rogue trading and cybercrime  a source familiar with the matter said on Thursday.",
        "date": "05262016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse sells operational risk bonds for $222 mln - source "
    },
    {
        "content": "NEW YORK  May 26 (IFR) - Credit Suisse has hired Marco Chisari as a managing director in its west coast technology mergers and acquisitions group.",
        "date": "05262016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse hires Chisari for tech M&A "
    },
    {
        "content": "NEW YORK  May 25 Credit Suisse named Brent Patry vice chairman  acquisition and leveraged finance capital markets  according to sources.",
        "date": "05252016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse names Patry vice chair of LevFin capital markets "
    },
    {
        "content": "* Signs of success in wealth management   (Adds bank statement)",
        "date": "05252016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 2-Fitch downgrades Credit Suisse on challenging capital markets "
    },
    {
        "content": "* Fitch downgrades Credit Suisse Group to 'A'; affirms Credit Suisse ag",
        "date": "05242016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-Fitch downgrades Credit Suisse Group to 'A' "
    },
    {
        "content": "HONG KONG  May 25 Fitch Ratings downgraded Credit Suisse Group's long-term default rating by a notch to A-minus and its viability rating to A-minus from A  citing the Swiss bank's reliance on difficult capital markets.",
        "date": "05252016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Fitch downgrades Credit Suisse on challenging capital markets "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  May 24 (Fitch) Fitch Ratings has downgraded Credit Suisse Group AG's  (CSGAG) Long-Term Issuer Default Rating (Long-Term IDR) to 'A-' from 'A' and  affirmed Credit Suisse AG's (Credit Suisse) Long-Term IDR at 'A'. The Viability  Ratings (VR) of both Credit Suisse and CSGAG have been downgraded to 'a-' from  'a'.  The Outlook on Credit Suisse's Long-Term IDR has been revised to Stable from  Positive.  CSGAG's Long-Term IDR Outloo",
        "date": "05242016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Fitch Downgrades Credit Suisse Group to 'A-'; Affirms Credit Suisse AG "
    },
    {
        "content": "LONDON  May 24 The bad bank charged with winding down the assets of two failed British lenders will sell a 15.65 billion pound ($23 billion) mortgage portfolio in two or three transactions starting this year  the group's incoming boss said on Tuesday.",
        "date": "05242016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Britain outlines plans for sale of Bradford & Bingley loans "
    },
    {
        "content": "MADRID  May 24 Credit Suisse chairman Urs Rohner said on Tuesday that he would expect to see more volatility closer to a vote in Britain on whether or not to stay in the European Union.   (Reporting By John O'Donnell; editing by Balazs Koranyi)",
        "date": "05242016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse's Rohner says expects volatility close to Brexit vote "
    },
    {
        "content": "BANGKOK  May 18 Credit Suisse said on Wednesday it set up a wealth management team in Thailand to tap rising demand from high-net-worth individuals  as part of its expansion in Asia.",
        "date": "05182016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse set up wealth management team in Thailand "
    },
    {
        "content": "NEW YORK  May 18 Five major banks and four traders were sued on Wednesday in a private U.S. lawsuit claiming they conspired to rig prices worldwide in a more than $9 trillion market for bonds issued by government-linked organizations and agencies.",
        "date": "05182016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Five banks sued in U.S. for rigging $9 trillion agency bond market "
    },
    {
        "content": "Buyout firm Onex Corp  has revived an auction for Carestream Health that could value it at more than $3 billion  including debt  and is exploring a breakup of the U.S. medical imaging company  people familiar with the matter said.",
        "date": "05182016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Exclusive: Onex explores breaking up Carestream Health in sale - sources "
    },
    {
        "content": "May 18 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "05182016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Royal Bank of Canada  Jefferies  PwC  Liquidnet "
    },
    {
        "content": "NEW YORK  May 16 Credit Suisse has hired Ray Raimondi  formerly of Barclays  to lead its global mergers and acquisitions team for deals in the industrials sector  the Swiss bank said on Monday.",
        "date": "05162016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse hires Raimondi to head industrials M&A "
    },
    {
        "content": "May 18 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "05182016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES- Jefferies  PwC  Liquidnet "
    },
    {
        "content": "ZURICH  May 18 The following are some of the main factors expected to affect Swiss stocks on Wednesday.",
        "date": "05182016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Swiss stocks - Factors to watch on May 18 "
    },
    {
        "content": "HONG KONG  May 12 Credit Suisse  which saw a pickup in inflows of net new money into its Asia Pacific private banking unit last quarter  plans to hire more staff to build on that momentum in a market buffeted by slowing economies and cut-throat competition.",
        "date": "05122016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse eyes bigger share of private banking in Asia "
    },
    {
        "content": "NEW YORK  May 11 (IFR) - Credit Suisse named Haidee Lee head of sellside M&A Americas in its investment banking and capital markets division  according to a memo obtained by IFR.",
        "date": "05112016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse taps Lee for middle market M&A "
    },
    {
        "content": "May 17 Jefferies Group LLC hired five senior investment bankers from Credit Suisse on Tuesday  according to people familiar with the matter  in a major move to bulk up its technology banking practice.",
        "date": "05182016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Jefferies hires five senior bankers from Credit Suisse-sources "
    },
    {
        "content": "FRANKFURT  May 11 German industrial group Siemens has hired Clarissa Haller from Credit Suisse  as its new head of communications  it said on Wednesday.",
        "date": "05112016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Siemens hired Credit Suisse's Haller as head of comms "
    },
    {
        "content": "ZURICH  May 11 Credit Suisse has hired Burkhard Varnholt from Julius Baer to be deputy global chief investment officer of its international wealth management unit effective Nov. 1  it said on Wednesday.",
        "date": "05112016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse names Varnholt as deputy global CIO "
    },
    {
        "content": "LONDON  May 10 (IFR) - Credit Suisse has appointed Eric Varvel as global head of asset management within the international wealth management division  effective June 1.",
        "date": "05102016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Varvel to head Credit Suisse asset management "
    },
    {
        "content": "ZURICH Credit Suisse  is placing asset management under the twin direction of its wealth management and Swiss banking divisions  it said on Sunday  announcing a further strategy rejig after a shake-up in October.",
        "date": "05082016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse's Swiss and wealth units to run asset management "
    },
    {
        "content": "DUBAI The cost of insuring Saudi Arabia's debt against default has risen since the kingdom announced a plan to wean itself off volatile oil exports  showing that some investors fear it won't be able to raise enough revenue to make the reforms work.",
        "date": "05102016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Revenue may be weak spot in Saudi economic reform plan "
    },
    {
        "content": "ZURICH Credit Suisse posted its worst start to a year since the financial crisis amid a major restructuring but cost cuts  a healthy performance in private banking and robust capital levels offered investors much-needed comfort.",
        "date": "05102016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse gets welcome boost from private bank despite first-quarter loss "
    },
    {
        "content": "* Shares rose as much as 6.4 percent   (Recasts  adds analyst  CEO and CFO comments  shares)",
        "date": "05102016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 3-Credit Suisse gets welcome boost from private bank despite Q1 loss "
    },
    {
        "content": "LONDON  May 10 (IFR) - Half of the 2 000 staff earmarked to go from Credit Suisse's global markets division have already been notified  the bank said on Tuesday  as it reported a swing to a first-quarter loss.",
        "date": "05102016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse halfway through markets job cuts "
    },
    {
        "content": "LONDON  May 4 (IFR) - Credit Suisse is cutting about 130 staff in its global markets business in London  a person familiar with the matter said  part of its attempt to cut costs and streamline its business.",
        "date": "05042016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse cuts 130 equities  FICC staff in London "
    },
    {
        "content": "* Says Eric Varvel appointed global head of asset management at Credit Suisse",
        "date": "05102016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse appoints Eric Varvel as Head of Asset Management "
    },
    {
        "content": "LONDON  May 4 Credit Suisse is cutting around 80 people in its global fixed income business and just under 50 people in its equities division as part of the Swiss bank's accelerated restructuring programme  a source familiar with the matter said on Wednesday.",
        "date": "05042016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse takes axe to equities  fixed income divisions "
    },
    {
        "content": "ZURICH  May 4 Credit Suisse will take another around $100 million writedown as part of the sale of assets in its distressed credit portfolio to U.S. investment firm TPG's TSSP  with most of the charge reflected in the Swiss bank's first-quarter results.",
        "date": "05042016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse takes another $100 mln writedown on credit portfolio "
    },
    {
        "content": "* Announced acquisition of credit assets including part of Credit Suisse's distressed credit portfolio for about $1.27 billion",
        "date": "05042016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-TSSP acquires distressed portfolio from Credit Suisse "
    },
    {
        "content": "LONDON  May 10 European shares advanced on Tuesday  with Danish jewellery maker Pandora surging after strong results and bank Credit Suisse gaining after a smaller than expected first quarter loss.",
        "date": "05102016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "European shares rise led by Pandora  Credit Suisse; Athens outperform "
    },
    {
        "content": "* Credit Suisse agrees to sell distressed-debt portfolio to TPG affiliate for $1.27 bln - wsj  citing sources  Source text -(http://on.wsj.com/1ZahRB0) Further company coverage:    (Bengaluru Newsroom)",
        "date": "05042016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse agrees to sell distressed-debt portfolio to TPG affiliate for $1.27 bln - WSJ "
    },
    {
        "content": "* CEO says very confident share price will recover as we deliver quarter by quarter -news conference",
        "date": "05102016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse CFO says hopes Q2 sees a better result than Q1 "
    },
    {
        "content": "* CEO says preparation for partial IPO of swiss bank is on track  expects to receive separate banking licence by Q4 2016 -analyst call",
        "date": "05102016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse CEO says Q2 likely better than Q1 "
    },
    {
        "content": "LONDON  May 10 European shares advanced on Tuesday  with Danish jewellery maker Pandora surging after strong results and Swiss bank Credit Suisse  gaining following its smaller than expected first quarter loss.",
        "date": "05102016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Pandora and Credit Suisse help European shares to advance "
    },
    {
        "content": "April 27 The following financial services industry appointments were announced on Wednesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "04272016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse  Vontobel Wealth Management  AXA "
    },
    {
        "content": "ZURICH Credit Suisse's  leadership came under fire on Friday from shareholders disgruntled by a share slide amid a major restructuring of Switzerland's second-biggest bank.",
        "date": "04292016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse's Thiam faces shareholder ire at AGM "
    },
    {
        "content": "ZURICH  April 27 Swiss bank Credit Suisse  has recruited at least a dozen wealth managers in Mexico from rival UBS  a source familiar with the matter said on Wednesday  part of efforts to beef up its private banking business.",
        "date": "04272016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse beefs up Mexico private bank with UBS hires -source "
    },
    {
        "content": "* Re-elect chairman Urs Rohner in AGM vote  Further company coverage:    (Reporting by Zurich Newsroom)",
        "date": "04292016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse shareholders re-elect chairman in AGM vote "
    },
    {
        "content": "VIENNA Proxy adviser Glass Lewis has recommended shareholders in Credit Suisse  reject the amount of remuneration set for the bank's management and board members  Swiss newspaper NZZ am Sonntag reported.",
        "date": "04242016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Glass Lewis tells Credit Suisse investors to reject pay packages: paper "
    },
    {
        "content": "BERLIN/FRANKFURT  April 27 The DAX top-30 index  looked set to open unchanged on Wednesday  according to premarket data from brokerage Lang & Schwarz at 0627 GMT.",
        "date": "04272016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "German stocks - Factors to watch on April 27 "
    },
    {
        "content": "ZURICH  April 29 Credit Suisse  shareholders on Friday approved all of the Swiss bank's proposed pay packages and bonuses for top management in binding votes at its annual general meeting.",
        "date": "04292016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse shareholders approve management pay  bonuses "
    },
    {
        "content": "VIENNA  April 24 Proxy adviser Glass Lewis has recommended shareholders in Credit Suisse reject the amount of remuneration set for the bank's management and board members  Swiss newspaper NZZ am Sonntag reported.",
        "date": "04242016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Glass Lewis tells C.Suisse investors to reject pay packages -paper "
    },
    {
        "content": "ZURICH  April 29 The following are some of the main factors expected to affect Swiss stocks on Friday:",
        "date": "04292016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Swiss stocks - Factors to watch on April 29 "
    },
    {
        "content": "LONDON  April 20 (IFR) - Credit Suisse has hired Henrik Aslaksen  who was one of Deutsche Bank's top investment bankers for a decade until he left last year.",
        "date": "04202016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse hires ex-Deutsche Bank M&A chief Aslaksen "
    },
    {
        "content": "ZURICH/LONDON  April 22 Credit Suisse  is trying to offload some of the risk it faces from events such as rogue trading and cybercrime by issuing a new type of insurance bond  a source familiar with the matter said on Friday.",
        "date": "04222016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "UPDATE 1-Credit Suisse looks at covering risks with insurance bond - source "
    },
    {
        "content": "WASHINGTON  April 15 The U.S. Treasury Department inched closer on Friday toward finalizing a rule requiring banks to identify the legal owners of shell companies  a move it hopes will help prevent illegal financial activities such as money laundering.",
        "date": "04202016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "REFILE-Bank shell company rule nears approval as final draft sent to White House "
    },
    {
        "content": "ZURICH/LONDON  April 22 Credit Suisse  is trying to offload some of the risk it faces from events such as rogue trading and cybercrime by issuing a new type of insurance bond  a source familiar with the matter said on Friday.",
        "date": "04222016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse looks at covering risks with insurance bond - source "
    },
    {
        "content": "ZURICH Credit Suisse's Tidjane Thiam  under pressure after a more than 40 percent fall in the bank's share price since taking over  tried to win over the Swiss public on Monday by donning a cape to march in one of Switzerland's most festive traditions.",
        "date": "04192016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse's Thiam dons hat and cape to join Swiss spring parade "
    },
    {
        "content": "ZURICH  April 18 Credit Suisse's  Tidjane Thiam  under pressure after a more than 40 percent fall in the bank's share price since taking over  tried to win over the Swiss public on Monday by donning a cape to march in one of Switzerland's most festive traditions.",
        "date": "04182016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse's Thiam dons hat and cape to join Swiss spring parade "
    },
    {
        "content": "TOKYO  April 15 Japan's securities watchdog on Friday recommended a Japanese unit of Credit Suisse Group AG  be punished after ruling that the brokerage provided information to clients without using the required internal clearance channels.",
        "date": "04152016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "UPDATE 1-Japan securities watchdog recommends punishment of Credit Suisse unit "
    },
    {
        "content": "ZURICH  April 14 Credit Suisse's  chairman for the Americas region  Robert Shafir  will leave the Swiss bank in July  a spokeswoman said on Thursday.",
        "date": "04142016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse says Americas chairman Shafir to leave bank "
    },
    {
        "content": "ZURICH  April 13 Credit Suisse Chief Executive Tidjane Thiam is taking the right steps by shrinking investment banking to focus on wealth management  a senior official at Harris Associates  which holds a 4.2 percent stake  told a Swiss newspaper.",
        "date": "04132016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse CEO on right track  board needs work - Harris "
    },
    {
        "content": "April 15 Shares of BATS Global Markets Inc  jumped as much as 23 percent in their debut on the company's own exchange - redemption after a botched attempt to go public in 2012.",
        "date": "04152016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 2-Second time lucky: BATS shares soar in debut "
    },
    {
        "content": "NEW YORK  April 14 (IFR) - Credit Suisse has withdrawn from an 18-bank group that provides a multi-billion dollar credit line for Ally Financial  one of the main US auto lenders  sources close to the matter told IFR.",
        "date": "04142016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse withdraws from Ally loan arrangement "
    },
    {
        "content": "BERLIN  April 14 Shareholders in Scout24  placed a stake of around 11 percent of the German digital classifieds group at 30 euros  ($33.78) per share on Thursday  putting the company's stock under pressure.",
        "date": "04142016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Shares in Germany's Scout24 fall after owners sell stake "
    },
    {
        "content": "Shares of BATS Global Markets Inc  jumped as much as 23 percent in their debut on the company's own exchange - redemption after a botched attempt to go public in 2012.",
        "date": "04152016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Second time lucky: BATS shares soar in debut "
    },
    {
        "content": "* Business analytics company Domo said to work with Morgan Stanley  Credit Suisse On IPO- Bloomberg  citing sources",
        "date": "04122016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "BRIEF-Domo said to work with Morgan stanley  Credit Suisse on IPO - Bloomberg "
    },
    {
        "content": " (This version of the April 4th story fixes spelling of analyst name in 13th paragraph)",
        "date": "04112016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse faces tough questions after $1 billion write-downs "
    },
    {
        "content": "TOKYO  April 15 Japan's securities watchdog will recommend as early as Friday punishment of Credit Suisse for violations of the country's financial instruments and exchange laws  a person with direct knowledge of the matter said on Friday.",
        "date": "04152016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Japan's securities watchdog to recommend punishment of Credit Suisse -source "
    },
    {
        "content": "* CEO raised concerns in January  materials seen by Reuters show",
        "date": "04112016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "REFILE--Credit Suisse faces tough questions after $1 bln write-downs "
    },
    {
        "content": "ZURICH  April 8 Credit Suisse's major investors back the Swiss bank's senior management to implement Chief Executive Tidjane Thiam's new strategy  Chairman Urs Rohner told Swiss magazine Bilanz.",
        "date": "04082016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse chairman says investors back current management - Bilanz "
    },
    {
        "content": "April 7 Credit Suisse Group AG asked its employees not to take part in activities that could promote a particular outcome ahead of the June 23 referendum on Britain's membership of the European Union  according to a memo seen by Reuters.",
        "date": "04072016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse sends memo to employees ahead of EU referendum "
    },
    {
        "content": "April 6 Credit Suisse Group AG is laying off nine executives in its fixed-income business in Brazil amid an industry slump  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "04062016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "UPDATE 1-Credit Suisse to cut jobs at Brazil fixed-income unit-Bbg "
    },
    {
        "content": "NEW YORK  April 5 Barry Zamore  head of US trading of performing leveraged loans at Credit Suisse in New York  has left the bank  sources said.",
        "date": "04052016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "UPDATE 2-MOVES-LPC: Credit Suisse's head of performing loan trading Zamore leaves "
    },
    {
        "content": "ZURICH  April 7 Switzerland's FINMA is monitoring recent large trading losses at major Swiss banks  the head of the financial watchdog said on Thursday.",
        "date": "04072016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "FINMA head says looking at trading losses at Credit Suisse  others "
    },
    {
        "content": "April 6 Credit Suisse Group AG is laying off nine executives in its fixed-income business in Brazil amid an industry slump  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "04062016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse to cut jobs at Brazil fixed-income unit - Bbg "
    },
    {
        "content": "LONDON  April 6 Pharmaceuticals companies helped Britain's top share index move higher on Wednesday  benefiting as Pfizer pulled out of a deal for Allergan  prompting speculation over other merger and acquisition activity in the sector.",
        "date": "04062016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Britain's FTSE lifted by pharma companies as Pfizer deal falls apart "
    },
    {
        "content": "April 5 The following financial services industry appointments were announced on Tuesday. To inform us of other job changes  email moves@thomsonreuters.com.",
        "date": "04052016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Deutsche Bank  StanChart  Credit Suisse  Lloyds  Legal & General "
    },
    {
        "content": "NEW YORK  April 5 Barry Zamore  head of US par loan trading at Credit Suisse in New York  who championed the removal of assignment fees from the US$880bn loan market  has left the bank  sources said.",
        "date": "04052016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-LPC: Credit Suisse's head of par loan trading Zamore said to leave "
    },
    {
        "content": "HONG KONG  April 5 Credit Suisse Chief Executive Officer Tidjane Thiam said on Tuesday the Swiss bank has been \"underweight\" in China and would look to build its wealth management capabilities in the world's second-biggest economy  despite slowing growth.",
        "date": "04052016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse CEO Thiam targets bigger China presence "
    },
    {
        "content": "* OCBC Singapore assets under management to rise a third   (Recasts  adds adviser name  shares  Barclays CEO quote)",
        "date": "04072016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 3-Singapore's OCBC to buy Barclays Asia wealth business for $320 mln "
    },
    {
        "content": "LONDON  April 6 Pharmaceutical firms helped Britain's top share index to gains on Wednesday  benefiting as Pfizer was set to pull out of a deal for Allergan   prompting speculation over other M&A in the sector.",
        "date": "04062016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Britain's FTSE lifted by pharma firms after Pfizer deal falls apart "
    },
    {
        "content": "* Has entered into a definitive agreement with Canada Pension Plan Investment Board for purchase by a wholly owned subsidiary of CPPIB of a 40 pct equity interest in Glencore Agricultural Products",
        "date": "04062016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Glencore agrees to sell 40 pct stake in Glencore Agri to CPPIB "
    },
    {
        "content": "HONG KONG/SINGAPORE Credit Suisse and HSBC  two of the world's largest wealth managers  dismissed on Tuesday suggestions they were actively using offshore structures to help clients cheat on their taxes.",
        "date": "04052016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse  HSBC dismiss 'Panama Papers' tax avoidance allegations "
    },
    {
        "content": "SINGAPORE OCBC's  path to snapping up Barclays'  Singapore and Hong Kong wealth management business became much easier after rival DBS Group Holdings  was turned off by fears of poaching at the unit  financial sources familiar with matter said.",
        "date": "04072016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "OCBC grabs Barclays Asia wealth business after poaching concerns spook rival "
    },
    {
        "content": "HONG KONG/SINGAPORE  April 5 Credit Suisse  and HSBC  two of the world's largest wealth managers  dismissed on Tuesday suggestions they were actively using offshore structures to help clients cheat on their taxes.",
        "date": "04052016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-Credit Suisse  HSBC dismiss \"Panama Papers\" tax avoidance allegations "
    },
    {
        "content": "* CEO raised concerns in January  materials seen by Reuters show",
        "date": "04042016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse faces tough questions after $1 bln write-downs "
    },
    {
        "content": "HONG KONG/SINGAPORE  April 5 Credit Suisse  and HSBC  two of the world's largest wealth managers  dismissed on Tuesday suggestions they were actively using offshore structures to help clients cheat on their taxes.",
        "date": "04052016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse  HSBC dismiss \"Panama Papers\" tax avoidance allegations "
    },
    {
        "content": "* Mondi falls on paper probe   (ADVISORY- Reuters plans to replace intra-day European and UK stock market reports with a Live Markets blog on Eikon - see cpurl://apps.cp./cms/?pageId=livemarkets  for site in development. See the bottom of the report for more details)",
        "date": "04042016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Britain's FTSE advances  helped by pharma stocks "
    },
    {
        "content": "* Mondi falls on paper probe   (ADVISORY- Reuters plans to replace intra-day European and UK stock market reports with a Live Markets blog on Eikon - see cpurl://apps.cp./cms/?pageId=livemarkets  for site in development. See the bottom of the report for more details)",
        "date": "04042016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Britain's FTSE advances  breaking losing run "
    },
    {
        "content": "LONDON  April 4 British shares edged higher on Monday as commodities-related stocks shrugged off declines in copper and oil prices  although Mondi fell on news of an anti-monopoly investigation.",
        "date": "04042016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Britain's FTSE advances  shrugs off declines in commodities "
    },
    {
        "content": "LONDON  March 30 Credit Suisse has hired Patrick Porritt of Bank of America Merrill Lynch  as a vice chairman of its Financial Institutions Group (FIG)  according to an internal memo seen by Reuters on Wednesday.",
        "date": "03302016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse bulks up with senior FIG hire - memo "
    },
    {
        "content": "ZURICH  March 31 Credit Suisse's  chairman said on Thursday there are no blind spots in the bank's trading operations  a week after its chief executive said he had been unaware of the scale of  positions that triggered major writedowns.",
        "date": "03312016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "No blind spots in Credit Suisse's trading operations -chairman "
    },
    {
        "content": "NEW YORK/SAO PAULO  March 30 Pulpmaker Eldorado Brasil SA has hired the investment-banking units of three international banks and a Brazilian lender to manage a debut global bond offering of up to $500 million  four sources with direct knowledge of the decision said on Wednesday.",
        "date": "03302016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Eldorado Brasil hires Credit Suisse  BofA for bond debut -sources "
    },
    {
        "content": "LONDON  March 31 Four of Europe's major investment banks have reduced their bonus awards by a third since 2009  but deferred bonus payouts  which came in after the financial crisis  are on the wane  Barclays research analysts said in a note on Thursday.",
        "date": "03312016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "European investment banks pay less in bonuses- Barclays' research "
    },
    {
        "content": "March 29 UBS Group AG has named Joseph Hershberger a vice chairman in its financial institutions group  where he will focus on global asset management efforts  according to a memo seen by Reuters.",
        "date": "03292016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "MOVES-UBS hires asset management banker Hershberger from Credit Suisse "
    },
    {
        "content": "LONDON/LISBON  March 29 The family owners of Portuguese plastics packaging firm Logoplaste are studying ways to finance its expansion  founder and Chief Executive Filipe de Botton told Reuters on Tuesday.",
        "date": "03292016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Portuguese packager Logoplaste working with Credit Suisse on options -sources "
    },
    {
        "content": "MOSCOW Swiss banks UBS and Credit Suisse are interested in advising the Russian government on several privatizations as long as the deals do not violate sanctions  three banking sources told Reuters.",
        "date": "03292016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Exclusive: UBS  Credit Suisse interested in advising on Russia privatization - sources "
    },
    {
        "content": "NEW YORK  March 24 Credit Suisse Group AG  has agreed to pay more than $29 million to resolve a U.S. regulator's claims that it sold toxic mortgage-backed securities to credit unions that later failed  according to court papers filed on Thursday.",
        "date": "03242016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse to pay $29 million in U.S. regulator's mortgage case "
    },
    {
        "content": "NEW YORK Credit Suisse Group AG has agreed to pay more than $29 million to resolve a U.S. regulator's claims that it sold toxic mortgage-backed securities to credit unions that later failed  according to court papers filed on Thursday.",
        "date": "03242016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse to pay $29 mln in U.S. regulator's mortgage case "
    },
    {
        "content": "WASHINGTON  March 22 U.S. Commodity Futures Trading Commission has ordered Credit Suisse International  to pay $665 000 in penalties to settle charges that it violated over the speculative position limit for wheat futures  the agency said on Tuesday.",
        "date": "03222016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "U.S. orders Credit Suisse to pay $665 000 over wheat futures "
    },
    {
        "content": "HANOI  March 21 Vietcombank  Vietnam's top lender by market value  plans to sell new shares to foreign investors  equivalent to 10 percent of existing stock  to meet capital requirements and fund strategic activities  bank officials said.",
        "date": "03212016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Vietcombank plans new issue of 10 pct of stock for foreigners "
    },
    {
        "content": "NEW YORK  March 24 Credit Suisse Group AG  has agreed to pay more than $29 million to resolve a U.S. regulator's claims that it sold toxic mortgage-backed securities to credit unions that later failed  according to court papers filed on Thursday.",
        "date": "03242016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "REFILE-UPDATE 1-Credit Suisse to pay $29 mln in U.S. regulator's mortgage case "
    },
    {
        "content": "Activist hedge fund Starboard Value LP on Thursday unveiled a slate of nine potential candidates for election to Yahoo Inc's  board of directors.",
        "date": "03242016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Factbox: Starboard's nominees for Yahoo board "
    },
    {
        "content": "ZURICH  March 22 Private banking group J. Safra Sarasin said on Tuesday it had agreed to acquire Credit Suisse businesses in Monaco and Gibraltar.",
        "date": "03222016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "J. Safra Sarasin to buy Credit Suisse units in Monaco  Gibraltar "
    },
    {
        "content": "LONDON Sean Shepley  head of global macro product strategy at Credit Suisse  is set to leave the bank  according to a memo seen by Reuters on Wednesday  as the Swiss bank steps up its restructuring plan.",
        "date": "03232016",
        "name": "Credit Suisse Group",
        "news_type": "topStory",
        "symbol": "CS",
        "title": "Credit Suisse head of global macro strategy to leave: memo "
    },
    {
        "content": "ZURICH A slump in investment banking revenues pushed Credit Suisse  to accelerate its cost-cutting plan as Chief Executive Tidjane Thiam admitted he had been unaware of trading positions that triggered more big writedowns in the first quarter. | Video ",
        "date": "03242016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse to axe 2 000 more investment banking jobs "
    },
    {
        "content": "ZURICH  March 22 Swiss private banking group J. Safra Sarasin said it had agreed to acquire Credit Suisse  businesses in Monaco and Gibraltar  which it called excellent strategic fits.",
        "date": "03222016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 1-J. Safra Sarasin to buy Credit Suisse units in Monaco  Gibraltar "
    },
    {
        "content": "* Savings goal raised to at least 4.3 bln francs from 3.5 bln",
        "date": "03232016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 7-Credit Suisse to axe 2 000 more investment banking jobs "
    },
    {
        "content": "ZURICH Credit Suisse  Chief Executive Tidjane Thiam received 18.9 million Swiss francs ($19.4 million) in cash and share awards from the Swiss bank in 2015 even after requesting a 40 percent bonus cut  according to its annual report.",
        "date": "03242016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse CEO paid $19.4 million in cash and shares last year "
    },
    {
        "content": "March 22 Sarah-Marie Martin has resigned as co-head of Credit Suisse Group AG's Americas financial sponsors group  which focuses on private equity firms  to join Goldman Sachs Group Inc  people familiar with the matter said on Tuesday.",
        "date": "03222016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse sponsors co-head to join Goldman Sachs -sources "
    },
    {
        "content": "ZURICH  March 16 Lawyers for former Georgia Prime Minister Bidzina Ivanishvili have filed a Swiss criminal complaint against Credit Suisse relating to allegations of money laundering  one of the lawyers told Reuters on Wednesday.",
        "date": "03162016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Ex-Georgia premier files Swiss complaint against Credit Suisse "
    },
    {
        "content": "ZURICH  March 23 Credit Suisse Chief Executive Tidjane Thiam said he has total confidence in finance chief David Mathers and global markets head Tim O'Hara after large illiquid trading positions pushed the bank to accelerate its cost-cutting plan.",
        "date": "03232016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse CEO says has total confidence in CFO "
    },
    {
        "content": "ZURICH  March 24 Credit Suisse Chief Executive Tidjane Thiam received 18.9 million Swiss francs ($19.4 million) in cash and share awards from the Swiss bank in 2015 even after requesting a 40 percent bonus cut  according to its annual report.",
        "date": "03242016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "UPDATE 2-Credit Suisse CEO paid $19.4 mln in cash and shares last year "
    },
    {
        "content": "March 24 An obscure corner of the U.S. IPO market is getting a new lease on life as more Wall Street banks and institutional investors turn to blank-check acquisition vehicles  once the domain of only a few underwriters and hedge funds  for better fortunes.",
        "date": "03242016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "RPT-DEALTALK-More Wall Street banks  investors help write blank checks "
    },
    {
        "content": "* Says in 2015 annual report that in Italy  a criminal investigation into allegations of money laundering activities has been initiated against Credit Suisse AG",
        "date": "03242016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Credit Suisse says Italian criminal probe into money laundering allegations "
    },
    {
        "content": "NEW YORK  March 23 (IFR) - Credit Suisse merged its global credit and structured finance groups on Wednesday as part of the bank's wider restructuring  according to a market source with knowledge of the situation.",
        "date": "03232016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-Credit Suisse merges units in new shake-up "
    },
    {
        "content": "March 23 Michael Gilbert  an investment banker focused on advising media companies  has left Credit Suisse Group AG to join former Morgan Stanley rainmaker Paul Taubman's PJT Partners Inc  people familiar with the matter said.",
        "date": "03232016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "MOVES-PJT hires media banker from Credit Suisse -sources "
    },
    {
        "content": "* Credit Suisse's accelerated restructuring adds to execution risks",
        "date": "03232016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "BRIEF-Fitch says Credit Suisse's accelerated restructuring adds to execution risks "
    },
    {
        "content": "(The following statement was released by the rating agency) FRANKFURT/LONDON  March 23 (Fitch) Fitch Ratings says that Credit Suisse AG's  (Credit Suisse  A/Positive/a) accelerated restructuring announced today  highlights that earnings downside from some of its core capital markets  franchises is proving greater than expected in challenging market conditions.  Credit Suisse guided that its Global Markets (GM) business will likely report a  pre-tax loss in 1Q16  and announced that it is stepping",
        "date": "03232016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Fitch: Credit Suisse's Accelerated Restructuring Adds to Execution Risks "
    },
    {
        "content": "LONDON  March 23 (IFR) - Credit Suisse boss Tidjane Thiam only became aware in January of big adverse positions in the bank's distressed credit book  prompting him to make more savage cuts to its markets business just three months after a strategic review.",
        "date": "03232016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse caught out by hefty trading positions "
    },
    {
        "content": "LONDON  March 23 Sean Shepley  head of global macro product strategy at Credit Suisse is set to leave the bank  according to a memo seen by Reuters on Wednesday  as the Swiss bank steps up its restructuring plan.",
        "date": "03232016",
        "name": "Credit Suisse Group",
        "news_type": "normal",
        "symbol": "CS",
        "title": "Credit Suisse head of global macro strategy to leave -memo "
    }
]