[
    {
        "content": "Oct 26 The resignation of two prominent female executives at CSX Corp hours before CSX canceled a long-planned investor conference this week rattled employees and investors on Thursday  sending the No. 3 U.S. railroad's shares down 1 percent.",
        "date": "10262017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX executive shakeup rattles employees  investors; shares drop "
    },
    {
        "content": "Oct 26 The resignation of two prominent female executives at CSX Corp hours before CSX canceled a long-planned investor conference this week rattled employees and investors on Thursday  sending the No. 3 U.S. railroad's shares down 1 percent.",
        "date": "10262017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 1-CSX executive shakeup rattles employees  investors; shares drop "
    },
    {
        "content": "Oct 25 CSX Corp  the third-largest U.S. railroad operator  said on Wednesday it was postponing an Oct. 30 investor conference to a later date  and said its board approved a $1.5 billion share buyback program.",
        "date": "10252017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "UPDATE 1-CSX postpones investor conference amid leadership shakeup "
    },
    {
        "content": "CSX Corp   the third-largest U.S. railroad operator  said on Wednesday it was postponing an Oct. 30 investor conference to a later date  and said its board approved a $1.5 billion share buyback program.",
        "date": "10262017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX postpones investor conference amid leadership shakeup "
    },
    {
        "content": "Oct 25 CSX Corp  the third-largest U.S. railroad operator  said on Wednesday it is postponing an Oct. 30 investor conference to a later date  and said its board approved a $1.5 billion share buyback program.",
        "date": "10252017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX postpones investor conference amid leadership shakeup "
    },
    {
        "content": "* CSX postpones investor conference and announces share buyback",
        "date": "10252017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX postpones investor conference and authorizes $1.5 bln in share repurchases​ "
    },
    {
        "content": "CSX Corp   the third-largest U.S. railroad operator  reported a slight rise in quarterly net profit on par with analyst expectations on Tuesday  as coal and consumer goods shipments and higher freight rates lifted its revenue 1 percent.",
        "date": "10172017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "Coal  consumer goods rail shipments lift CSX Corp's quarterly profit "
    },
    {
        "content": "Oct 18 CSX Corp  the No. 3 U.S. railroad operator  will slash the number of locomotives served by a long-term maintenance agreement  a move that cuts service bills under the agreement by some $3.3 billion  company filings showed on Wednesday.",
        "date": "10182017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "Rail operator CSX reduces locomotives in maintenance program "
    },
    {
        "content": "Oct 17 CSX Corp  the third-largest U.S. railroad operator  reported a slight rise in quarterly net profit on par with analyst expectations on Tuesday  as coal and consumer goods shipments and higher freight rates lifted its revenue 1 percent.",
        "date": "10172017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 4-Coal  consumer goods rail shipments lift CSX Corp's quarterly profit "
    },
    {
        "content": "* CSX Corp - qtrly revenue $2 743​ million versus $2 710 million",
        "date": "10172017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX Corp qtrly revenue $2 743​ million "
    },
    {
        "content": "Oct 17 CSX Corp  the third-largest U.S. railroad operator  posted a slight increase in quarterly net profit on Tuesday  driven by increased rates it charges its customers to haul freight.",
        "date": "10172017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "REFILE-Higher freight rates lift CSX Corp's quarterly profit "
    },
    {
        "content": "* Q3 earnings per share view $0.51 -- Thomson Reuters I/B/E/S",
        "date": "10172017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX Corp posts Q3 earnings of $0.51 per share "
    },
    {
        "content": "Oct 9 CSX Corp said on Monday it has fully resumed operations into New Orleans  Louisiana and other U.S. Gulf Coast areas following the landfall of Hurricane Nate over the weekend.",
        "date": "10092017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX resumes rail operations to U.S. Gulf Coast areas following Nate "
    },
    {
        "content": "The head of No. 3 U.S. railroad CSX Corp promised on Wednesday to improve service as companies like Cargill Inc [CARG.UL] demanded greater accountability and fewer delays   criticizing an overhaul CSX launched six months ago.",
        "date": "10112017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX customers demand end to shipping bottlenecks as CEO apologizes "
    },
    {
        "content": "Oct 11 The head of No. 3 U.S. railroad CSX Corp promised on Wednesday to improve service as companies like Cargill Inc demanded greater accountability and fewer delays   criticizing an overhaul CSX launched six months ago.",
        "date": "10112017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 3-CSX customers demand end to shipping bottlenecks as CEO apologizes "
    },
    {
        "content": "Oct 11 Cargill Inc  Dow Chemical Co and other major corporate rail customers are expected to speak on Wednesday before the top U.S. rail regulator about their experiences with CSX Corp's network  which has been dogged by service problems since the summer.",
        "date": "10112017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "Major U.S. rail customers to air complaints over CSX at hearing "
    },
    {
        "content": "* CSX Corp says \"‍despite impacts of Irma  key service metrics show that CSX's operational performance continues to improve\" Source text for Eikon: Further company coverage:",
        "date": "09212017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-CSX says operational performance continues to improve​ ‍despite impacts of Irma "
    },
    {
        "content": "Csx Corp said on Wednesday it has resumed normal train operations into Waycross and Savannah  in Georgia  and limited service into Jacksonville  Florida  where it has also reopened intermodal facilities.",
        "date": "09132017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX resumes normal train operations into parts of Georgia: statement "
    },
    {
        "content": "Sept 13 Csx Corp said on Wednesday it has resumed normal train operations into Waycross and Savannah  in Georgia  and limited service into Jacksonville  Florida  where it has also reopened intermodal facilities.",
        "date": "09132017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX resumes normal train operations into parts of Georgia -statement "
    },
    {
        "content": "Sept 14 CSX Corp canceled its appearance at a Morgan Stanley conference in California to focus on impacts to its rail network from Hurricane Irma  a company spokesman said on Thursday. (Reporting by Eric M. Johnson in Seattle)",
        "date": "09142017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX cancels appearance at Morgan Stanley conference due to Irma "
    },
    {
        "content": "SEATTLE  Sept 12 CSX Corp said on Tuesday it expects to re-open rail traffic into Jacksonville  Florida  later this evening  although customers should expect delays as crews work despite power outages and fallen trees in the region.",
        "date": "09122017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX says to re-open rail traffic into storm-hit Jacksonville  Florida "
    },
    {
        "content": "Major eastern U.S. railroads CSX Corp and Norfolk Southern Corp are rerouting rail cars and locomotives  holding traffic in yards out of harm's way  relocating workers  and putting repair equipment into place as Hurricane Irma barrels toward Florida.",
        "date": "09082017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "Factbox: Key railroad assets in Hurricane Irma's path "
    },
    {
        "content": "* CSX begins operations at Pittsburgh intermodal rail terminal Source text for Eikon: Further company coverage:",
        "date": "09072017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-CSX begins operations at Pittsburgh intermodal rail terminal "
    },
    {
        "content": "CSX Corp  cut its full-year 2017 earnings per share growth forecast on Wednesday and said its operating ratio  a closely watched performance metric  had worsened  in light of service problems this summer that sparked fierce customer blowback.",
        "date": "09062017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX Corp cuts earnings forecast after service disruptions "
    },
    {
        "content": "Sept 7 CSX Corp  the No. 3 U.S. railroad  said all shipments scheduled into the greater Miami  Florida area on Thursday through the weekend will experience delays due to Hurricane Irma.",
        "date": "09072017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX warns of rail traffic delays in Florida due to Hurricane Irma "
    },
    {
        "content": "* ‍Seeking delivery proposals for up to 500 000 tons of CSX rail coal  beginning in January 2018 and ending in December 2018​",
        "date": "08292017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-American Electric Power seeks bids for coal "
    },
    {
        "content": "DETROIT  Aug 28 CSX Corp said it is dealing with service issues even as it forges ahead with a controversial overhaul of its network that has led dozens of trade groups to call for an investigation into disruptions at the No. 3 U.S. railroad.",
        "date": "08282017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX tackling service issues  CEO tells rail regulator "
    },
    {
        "content": "* CSX Corp - ‍revised way it calculates three key service metrics - train velocity  terminal dwell and cars online​",
        "date": "08222017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-CSX Corp - ‍revised way it calculates three key service metrics‍​ "
    },
    {
        "content": "Aug 15 Dozens of U.S. trade groups have asked federal rail regulators to investigate CSX Corp's \"chronic service failures \" saying problems at No. 3 U.S. railroad have rippled across the North American rail network  according to a letter seen by Reuters.",
        "date": "08152017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "Trade groups call on U.S. to investigate CSX rail disruptions "
    },
    {
        "content": "CSX Corp Chief Executive Hunter Harrison hit back at dozens of trade groups that urged a federal probe of service disruptions at the No. 3 U.S. railroad  saying their complaints were \"grossly exaggerated \" according to a letter seen by Reuters on Thursday.",
        "date": "08172017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX chief executive bashes U.S. trade groups over rail complaints "
    },
    {
        "content": "Aug 17 CSX Corp Chief Executive Hunter Harrison hit back at dozens of trade groups that urged a federal probe into service disruptions at the No. 3 U.S. rail road  saying their complaints were \"grossly overstated \" according to a letter seen by Reuters on Thursday.",
        "date": "08172017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX's Hunter Harrison bashes U.S. trade groups over rail complaints "
    },
    {
        "content": "Aug 4 Firefighters were still battling small fires on Friday in a Pennsylvania town where dozens of CSX Corp rail cars careened off the tracks and ignited Wednesday  as authorities prolonged evacuation orders for hundreds of residents.",
        "date": "08042017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "Fires still burning after CSX train derailment in Pennsylvania "
    },
    {
        "content": "Firefighters on Friday extinguished a string of sulfur fires that broke out in a small Pennsylvania town after dozens of CSX Corp rail cars careened off the tracks  the company said  but residents remained under evacuation orders.",
        "date": "08052017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "Fires extinguished after CSX train derailment in Pennsylvania "
    },
    {
        "content": "Hyndman  Pa. Rail cars carrying gas and sulfur on a CSX Corp freight train skidded off the tracks and burst into flames on Wednesday in a small Pennsylvania town  forcing hundreds of residents to flee their homes as firefighters fought the blaze.",
        "date": "08022017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "Freight train cars burning after derailment in Pennsylvania; residents flee "
    },
    {
        "content": "SEATTLE CSX Corp Chief Executive Hunter Harrison has apologized to customers for service disruptions that he attributed to some railroad employees resisting changes at the company  according to an email seen by Reuters.",
        "date": "08012017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX chief executive attributes service disruptions to employee push-back "
    },
    {
        "content": "Aug 4 Firefighters on Friday extinguished a string of sulfur fires that broke out in a small Pennsylvania town after dozens of CSX Corp rail cars careened off the tracks  the company said  but residents remained under evacuation orders.",
        "date": "08052017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 1-Fires extinguished after CSX train derailment in Pennsylvania "
    },
    {
        "content": "Hyndman  Pa.  Aug 2 Rail cars carrying gas and sulfur on a CSX Corp freight train skidded off the tracks and burst into flames on Wednesday in a small Pennsylvania town  forcing hundreds of residents to flee their homes as firefighters fought the blaze.",
        "date": "08022017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 4-Freight train cars burning after derailment in Pennsylvania; residents flee "
    },
    {
        "content": "Aug 2 CSX Corp said a freight train derailed in southern Pennsylvania on Wednesday.",
        "date": "08022017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX freight train derails in Pennsylvania "
    },
    {
        "content": "SEATTLE  Aug 1 CSX Corp Chief Executive Hunter Harrison has apologized to customers for service disruptions that he attributed to some railroad employees resisting changes at the company  according to an email seen by Reuters.",
        "date": "08012017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 2-CSX chief executive attributes service disruptions to employee push-back "
    },
    {
        "content": "SEATTLE  Aug 1 CSX Corp Chief Executive Hunter Harrison has apologized to customers for service disruptions that he blamed on resistance from some of the railroad's employees  according to an email seen by Reuters  as a shipper survey found the No. 3 U.S. railroad losing business to rivals.",
        "date": "08012017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX top executive blames employee push-back on service disruptions "
    },
    {
        "content": "DETROIT  July 28 A letter from the top U.S. rail regulator to CSX Corp this week highlights growing customer dissatisfaction with the No. 3 U.S. railroad's service problems since its new chief executive officer Hunter Harrison was appointed to the spot amid investor and analyst fanfare in March.",
        "date": "07282017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "Regulator letter to railroad CSX highlights customer complaints "
    },
    {
        "content": "DETROIT CSX Corp   the third-largest U.S. railroad operator  posted a better-than-expected rise in quarterly net profit on Tuesday  helped by improved coal shipments  and the company also announced a $500 million increase to its share repurchase program.",
        "date": "07182017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX profit beats expectations but shares fall after-hours "
    },
    {
        "content": "DETROIT  July 18 CSX Corp  the third-largest U.S. railroad operator  posted a better-than-expected rise in quarterly net profit on Tuesday  helped by improved coal shipments  and the company also announced a $500 million increase to its share repurchase program.",
        "date": "07182017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 2-CSX profit beats expectations but shares fall after-hours "
    },
    {
        "content": "* CSX Corp qtrly revenue $2 933 million versus $2 704 million",
        "date": "07182017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX Corp qtrly revenue $2 933 million versus $2 704 million "
    },
    {
        "content": "DETROIT  July 18 CSX Corp  the third-largest U.S. railroad operator  reported a higher quarterly net profit on Tuesday  driven by an 8 percent rise in revenue and growth across nearly all of its freight markets.",
        "date": "07182017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX quarterly profit rises on jump in revenue "
    },
    {
        "content": "* CSX Corporation announces second quarter earnings and increase in share repurchase program",
        "date": "07182017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX Corp announces Q2 earnings per share $0.55 "
    },
    {
        "content": "* On July 7  board approved an amendment to company's amended and restated bylaws - SEC filing​",
        "date": "07112017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-CSX Corp says board approved amendment to co's bylaws - SEC filing​ "
    },
    {
        "content": "* Sets quarterly dividend of $0.20 per share Source text for Eikon: Further company coverage:",
        "date": "07072017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-CSX sets quarterly dividend of $0.20 per share "
    },
    {
        "content": "NEW YORK CSX Corp.  shareholders approved a proposal on Monday to reimburse an activist investor  Mantle Ridge Partners LP  $84 million for arranging the hiring of new Chief Executive Hunter Harrison.",
        "date": "06052017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX shareholders approve $84 million reimbursement to Mantle Ridge "
    },
    {
        "content": "NEW YORK  June 5 CSX Corp. shareholders approved a proposal on Monday to reimburse an activist investor  Mantle Ridge Partners LP  $84 million for arranging the hiring of new Chief Executive Hunter Harrison.",
        "date": "06052017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 2-CSX shareholders approve $84 mln reimbursement to Mantle Ridge "
    },
    {
        "content": "* Shareholders ‍approved reimbursement arrangements sought in connection with retention of E. Hunter Harrison as CEO of CSX Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "06052017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX shareholders ‍approve reimbursement arrangements regarding Hunter Harrison's retention  as CEO "
    },
    {
        "content": "NEW YORK  June 5 CSX Corp. shareholders have approved a proposal to reimburse an activist investor  Mantle Ridge Partners LP  $84 million for arranging the hiring of new Chief Executive Hunter Harrison  according to a person familiar with the matter.",
        "date": "06052017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX shareholders OK $84 mln reimbursement to investor for new CEO -source "
    },
    {
        "content": "NEW YORK Proxy adviser Institutional Shareholder Services (ISS) has recommended that owners of CSX Corp stock vote in favor of an $84 million payment related to the appointment of new Chief Executive Officer Hunter Harrison.",
        "date": "05232017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "Proxy adviser ISS recommends CSX shareholders vote for $84 million CEO reimbursement "
    },
    {
        "content": "NEW YORK  May 22 Proxy adviser Institutional Shareholder Services (ISS) has recommended that owners of CSX Corp stock vote in favor of an $84 million payment related to the appointment of new Chief Executive Officer Hunter Harrison.",
        "date": "05232017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 1-Proxy adviser ISS recommends CSX shareholders vote for $84 mln CEO reimbursement "
    },
    {
        "content": "NEW YORK  May 22 Institutional Shareholder Services (ISS) has recommended that owners of CSX Corp. stock vote in favor of an $84 million payment related to the appointment of new CEO Hunter Harrison.",
        "date": "05232017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "ISS recommends CSX shareholders vote for $84 mln CEO reimbursement "
    },
    {
        "content": "April 27 U.S. power company FirstEnergy Corp agreed to pay $109 million to settle a legal dispute with two railroads concerning a long-term coal transportation contract  the Ohio based company said in a federal filing on Wednesday.",
        "date": "04272017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "FirstEnergy settles coal transport dispute with CSX  BNSF "
    },
    {
        "content": "* Former chairman and CEO Michael Ward's 2016 total compensation was $13.6 million versus $9.2 million - Sec Filing Source text: (http://bit.ly/2pIuKuk) Further company coverage:",
        "date": "04202017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-CSX former chairman and CEO Michael Ward's 2016 total compensation was $13.6 mln "
    },
    {
        "content": "MONTREAL  April 19 Canadian Pacific Railway Ltd reported a higher-than-expected quarterly profit as it earned more from shipments of commodities such as grain and coal  and the company expressed optimism that demand was improving.",
        "date": "04192017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "UPDATE 3-Railroad operator CP Rail's profit tops estimates "
    },
    {
        "content": "NEW YORK/MONTREAL Shares of railroad operator CSX Corp  soared more than 7 percent on Thursday to a record high  after the company reported better-than-expected quarterly earnings and its new chief executive officer outlined plans to improve margins and cut costs  including job reductions.",
        "date": "04202017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "Railroad CSX stock jumps on earnings  share buyback; CEO sees efficiencies "
    },
    {
        "content": "CHICAGO No. 3 U.S. railroad CSX Corp  on Wednesday reported a better-than-expected quarterly net profit driven by rising freight volumes across most of the markets it covers and said it plans to cut costs and boost profitability moving forward.",
        "date": "04192017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX posts higher profit  new CEO says better is to come "
    },
    {
        "content": "NEW YORK/MONTREAL April 20 Shares of railroad operator CSX Corp soared more than 7 percent on Thursday to a record high  after the company reported better-than-expected quarterly earnings and its new chief executive officer outlined plans to improve margins and cut costs  including job reductions.",
        "date": "04202017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 1-Railroad CSX stock jumps on earnings  share buyback; CEO sees efficiencies "
    },
    {
        "content": "CHICAGO  April 19 No. 3 U.S. railroad CSX Corp on Wednesday reported a better-than-expected quarterly net profit driven by rising freight volumes across most of the markets it covers and said it plans to cut costs and boost profitability moving forward.",
        "date": "04192017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 2-CSX posts higher profit  new CEO says better is to come "
    },
    {
        "content": "NEW YORK  April 20 Shares of railroad operator CSX Corp jumped more than 6 percent on Thursday after the company reported better-than-expected quarterly earnings and its CEO said it aims at lower costs  including job reductions  and improved margins.",
        "date": "04202017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "Railroad CSX stock jumps on earnings  share buy-back; CEO sees efficiencies "
    },
    {
        "content": "* Q1 earnings per share view $0.42 -- Thomson Reuters I/B/E/S",
        "date": "04192017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX Corp reports Q1 earnings per share $0.39 "
    },
    {
        "content": "* CSX Corp -  in march 2017  company reduced its management workforce by 765 employees through an involuntary separation program with enhanced benefits",
        "date": "04192017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX Q1 adjusted EPS $0.51 excluding items "
    },
    {
        "content": "CHICAGO  April 19 No. 3 U.S. railroad CSX Corp on Wednesday reported a higher first-quarter profit because of rising freight volumes across most of the markets it covers and rate increases for its customers.",
        "date": "04192017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX quarterly profit rises on higher freight volumes "
    },
    {
        "content": "* CSX Corp - CEO Michael J. Ward's total compensation for 2016 was $13.6 million versus $9.2 million in 2015 Source text: (http://bit.ly/2oCvf5A) Further company coverage:",
        "date": "04032017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-CSX Corp's CEO's total compensation for 2016 was $13.6 mln "
    },
    {
        "content": "* On March 30  2017  Co  Mantle Ridge Group entered into a registration rights agreement - SEC filing",
        "date": "04032017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX  Mantle Ridge Group enter registration rights agreement - SEC filing "
    },
    {
        "content": "* CSX Corp - in connection with Harrison's appointment as CEO  co entered four-year employment agreement providing him an annual base salary of $2.2 million",
        "date": "03072017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-CSX enters 4-year employment agreement with Harrison "
    },
    {
        "content": "DETROIT/NEW YORK/MONTREAL  March 9 Shortly after being named CEO of Canadian Pacific in 2012  Hunter Harrison hoisted himself onto a roof near a Montreal rail yard  pulled up a beach chair and timed the company's switch engines using a stopwatch and binoculars.",
        "date": "03092017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "UPDATE 1-CSX's new CEO eyes yard closures  truckers' market share "
    },
    {
        "content": "March 7 A CSX Corp freight train containing hazardous materials partially derailed in the area of Newburgh  New York  on Tuesday  but the cars with dangerous substances appear to have been unbreached  an official with the railroad company said.",
        "date": "03082017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "Hazardous cargo train derails in New York state but cars unbreached "
    },
    {
        "content": "March 6 CSX Corp named veteran railroad executive Hunter Harrison Chief Executive Officer  bowing to pressure from activist investor Mantle Ridge LP.",
        "date": "03062017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "UPDATE 2-CSX names Hunter Harrison CEO "
    },
    {
        "content": "* Says Harrison replaces Michael Ward  who announced his decision to retire as chairman and CEO on February 21  2017",
        "date": "03062017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX names Hunter Harrison as CEO "
    },
    {
        "content": "March 3 CSX Corp is nearing a deal with one of its largest investors  activist hedge fund Mantle Ridge LP  to sign up veteran railroad executive Hunter Harrison as the U.S. railroad company's CEO  people familiar with the matter said on Friday.",
        "date": "03042017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "UPDATE 1-Mantle Ridge nears deal to install Harrison as CSX CEO -sources "
    },
    {
        "content": "March 3 CSX Corp is nearing a deal with one of its largest investors  activist hedge fund Mantle Ridge LP  to sign up veteran railroad executive Hunter Harrison as the U.S. railroad company's CEO  people familiar with the matter said on Friday.",
        "date": "03032017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "Mantle Ridge nears deal to install Harrison as CSX CEO -sources "
    },
    {
        "content": "March 6 CSX Corp said on Monday it named veteran railroad executive Hunter Harrison as the company's chief executive.",
        "date": "03062017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX names Hunter Harrison CEO "
    },
    {
        "content": "March 6 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Monday:",
        "date": "03062017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "March 6 CSX Corp has struck a deal with activist investor Mantle Ridge LP to install railroad executive Hunter Harrison as the company's chief executive and to nominate for five seats on its board  the Wall Street Journal reported on Monday.",
        "date": "03062017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX reaches deal with activist investor over new CEO  board seats -WSJ "
    },
    {
        "content": "* CSX Corp has agreed to appoint Hunter Harrison as its next chief executive- WSJ  citing sources  Source: http://on.wsj.com/2lUywvw Further company coverage:",
        "date": "03062017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX Corp has agreed to appoint Hunter Harrison as its next chief executive- WSJ  citing sources "
    },
    {
        "content": "* Harrison pay package up for vote at CSX annual mtg - CNBC  citing sources",
        "date": "03062017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX to pay Harrison as much as $107 mln in potential deal - CNBC  citing sources "
    },
    {
        "content": "* CSX Corp - announced decisions of Michael Ward  chairman CEO  and Clarence Gooden  president  to retire from company effective May 31  2017",
        "date": "02212017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-CSX appoints Fredrik Eliasson as president "
    },
    {
        "content": "U.S. rail operator CSX Corp  said its board has called for a special meeting of its shareholders to discuss requests made by hedge fund Mantle Ridge LP  which is trying to install  Hunter Harrison  outgoing chief executive of Canadian Pacific Railway Ltd  as the company's chief executive.",
        "date": "02222017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX calls for shareholder meeting over activist investor requests "
    },
    {
        "content": "Feb 21 U.S. railroad operator CSX Corp said on Tuesday Chairman and Chief Executive Michael Ward would retire  effective May 31  after being in the role for more than 14 years.",
        "date": "02212017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX CEO Michael Ward to retire "
    },
    {
        "content": "Feb 21 U.S. rail operator CSX Corp said its board has called for a special meeting of its shareholders to discuss requests made by hedge fund Mantle Ridge LP  which is trying to install  Hunter Harrison  outgoing chief executive of Canadian Pacific Railway Ltd as the company's chief executive.",
        "date": "02222017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CORRECTED-UPDATE 2-CSX calls for shareholder meeting over activist investor requests "
    },
    {
        "content": "The activist investor targeting U.S. railroad operator CSX Corp.  said in a letter to the company's board on Thursday that he was willing to adjust certain demands as long as his CEO candidate was guaranteed a four-year contract.",
        "date": "02172017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX activist Mantle Ridge says willing to adjust demands "
    },
    {
        "content": "Feb 16 The activist investor targeting U.S. railroad operator CSX Corp. said in a letter to the company's board on Thursday that he was willing to adjust certain demands as long as his CEO candidate was guaranteed a four-year contract.",
        "date": "02222017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CORRECTED-UPDATE 1-CSX activist Mantle Ridge says willing to adjust demands "
    },
    {
        "content": "* CSX Corp - \"board will carefully review letter sent to us this evening by Mantle Ridge and continue to act in best interests of all CSX shareholders\"  Source text for Eikon:  Further company coverage:",
        "date": "02172017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX responds to Mantle Ridge "
    },
    {
        "content": "Feb 21 U.S. railroad operator CSX Corp will cut 1 000 management employees and its chief executive will retire in May  a company spokesman said on Tuesday  as activist investor Mantle Ridge LP pushes to shake up the company's board.",
        "date": "02222017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 2-CSX to cut 1 000 managers  CEO to exit as railway faces board shakeup "
    },
    {
        "content": "Feb 16 Activist investor Paul Hilal's Mantle Ridge LP has sent a letter to CSX Corp after the U.S. railroad operator called for a special meeting of its shareholders to discuss requests by the hedge fund.",
        "date": "02172017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "Mantle Ridge responds to CSX call for special shareholder meeting "
    },
    {
        "content": "U.S. rail operator CSX Corp  said its board has called for a special meeting of its shareholders to discuss requests made by hedge fund Mantle Ridge LP  which is trying to install  Hunter Harrison  outgoing chief executive of Canadian Pacific Railway Ltd  as the company's chief executive.",
        "date": "02152017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX calls for shareholder meeting over activist investor requests "
    },
    {
        "content": "NEW YORK CSX Corp  has extended the director nomination deadline for its board of directors  giving the U.S. railroad company more time to reach an agreement with an activist investor and industry veteran Hunter Harrison.",
        "date": "02102017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX extends director deadline as activist seeks CEO ouster "
    },
    {
        "content": "* Mantle Ridge comments on CSX's decision to call special meeting of shareholders",
        "date": "02152017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-Mantle Ridge comments on CSX's decision to call special meeting of shareholders "
    },
    {
        "content": "NEW YORK  Feb 10 CSX Corp has extended the director nomination deadline for its board of directors  giving the U.S. railroad company more time to reach an agreement with an activist investor and industry veteran Hunter Harrison.",
        "date": "02102017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 2-CSX extends director deadline as activist seeks CEO ouster "
    },
    {
        "content": "Feb 14 U.S. rail operator CSX Corp said its board has called for a special meeting of its shareholders to discuss requests made by hedge fund Mantle Ridge LP  which is trying to install  Hunter Harrison  outgoing chief executive of Canadian Pacific Railway Ltd as the company's chief executive.",
        "date": "02152017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX calls for special meeting of shareholders "
    },
    {
        "content": "* CSX calls special meeting in light of extraordinary mantle ridge and hunter harrison requests",
        "date": "02152017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX calls special meeting in light of extraordinary Mantle Ridge and Hunter Harrison requests "
    },
    {
        "content": "* CSX  railroad veteran Harrison discussing 3 year CEO contract; deal delayed over activist's request for board seats - CNBC  citing DJ   Further company coverage:",
        "date": "02102017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX  railroad veteran Harrison discussing 3 year CEO contract deal delayed over activist's request for board seats - CNBC  citing DJ "
    },
    {
        "content": "NEW YORK  Feb 10 CSX Corp. has extended the director nomination deadline for its board of directors  giving the U.S. railroad company more time to reach an agreement with investor Mantle Ridge LP.",
        "date": "02102017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX extends director nomination deadline amid activist pressure "
    },
    {
        "content": "Jan 30 CSX Corp is in early discussions with an activist investor over changes to its board and installing turnaround expert Hunter Harrison as the U.S. rail operator's CEO  according to a person familiar with the matter.",
        "date": "01302017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "UPDATE 1-CSX in talks to reach deal with activist  ex-CP CEO -source "
    },
    {
        "content": "Jan 29 U.S. railroad operator CSX Corp  is discussing a settlement with Hunter Harrison  the outgoing chief executive of Canadian Pacific Railway Ltd  and activist investor Paul Hilal that could make Harrison CSX's CEO  the Wall Street Journal reported.",
        "date": "01302017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX  outgoing Canadian Pacific CEO in settlement talks - WSJ "
    },
    {
        "content": "* CSX in settlement talks with Hunter Harrison & activist investor that could make him ceo only 2 weeks after coming after the co- CNBC citing DJ",
        "date": "01302017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX in settlement talks with Hunter Harrison & activist investor- CNBC citing DJ "
    },
    {
        "content": "NEW YORK/MONTREAL  Jan 25 A Neuberger Berman LLC portfolio manager has thrown her support behind a plan to put railroad industry veteran Hunter Harrison into CSX Corp's  CEO chair with the help of an activist investor.",
        "date": "01252017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX shareholder backs Harrison for CEO as activist swoops in "
    },
    {
        "content": "NEW YORK/MONTREAL  Jan 25 A portfolio manager from an influential shareholder has thrown her support behind a plan to put railroad industry veteran Hunter Harrison into CSX Corp's CEO chair with the help of an activist investor.",
        "date": "01252017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 1-CSX shareholder backs Harrison for CEO as activist swoops in "
    },
    {
        "content": "MONTREAL  Jan 23 The outgoing chief executive of Canadian Pacific Railway Ltd  said to be in advanced talks with a partner to shake up CSX Corp  cannot hire any CP management except its chief of staff  according to details of an agreement published on Monday.",
        "date": "01232017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "Outgoing CP Rail boss barred from hiring managers except chief of staff "
    },
    {
        "content": "DETROIT No. 3 U.S. railroad CSX Corp  on Tuesday reported a slight dip in quarterly net profit  in results that met Wall Street analyst expectations  and said conditions for its business were improving after taking a hit from low commodity prices and a strong U.S. dollar.",
        "date": "01172017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX profit dips but meets Wall Street expectations "
    },
    {
        "content": "DETROIT  Jan 17 No. 3 U.S. railroad CSX Corp  on Tuesday reported a slight dip in quarterly net profit  in results that met Wall Street analyst expectations  and said conditions for its business were improving after taking a hit from low commodity prices and a strong U.S. dollar.",
        "date": "01172017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 1-CSX profit dips but meets Wall Street expectations "
    },
    {
        "content": "* CSX Corporation announces fourth-quarter and  full-year 2016 earnings",
        "date": "01172017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX Corp posts Q4 earnings per share of $0.49 "
    },
    {
        "content": "* Q4 revenue view $2.89 billion -- Thomson Reuters I/B/E/S  Source: (http://bit.ly/2jHr1HA) Further company coverage:",
        "date": "01172017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX Q4 revenue $3 037 mln vs $2 781 mln "
    },
    {
        "content": "Shares of CSX Corp  soared 20 percent on Thursday after an activist investor's plan to shake up the U.S. rail operator fueled speculation that the company was once again a takeover target.",
        "date": "01192017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX shares jump 20 percent as activist reignites rail merger hopes "
    },
    {
        "content": "Jan 19 Shares of CSX Corp soared 20 percent on Thursday after an activist investor's plan to shake up the U.S. rail operator fueled speculation that the company was once again a takeover target.",
        "date": "01192017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "WRAPUP 1-CSX shares jump 20 pct as activist reignites rail merger hopes "
    },
    {
        "content": "* Indexes down: Dow 0.5 pct  S&P 0.4 pct  Nasdaq 0.3 pct   (Updates to late afternoon)",
        "date": "01192017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "US STOCKS-Wall St falls as investors ready for Trump's inauguration "
    },
    {
        "content": "* Indexes down: Dow 0.16 pct  S&P 0.15 pct  Nasdaq 0.03 pct   (Updates to early afternoon)",
        "date": "01192017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "US STOCKS-Wall St dips as investors ready for Trump's inauguration "
    },
    {
        "content": "* Indexes down: Dow 0.25 pct  S&P 0.22 pct  Nasdaq 0.15 pct   (Adds details  comments  updates prices)",
        "date": "01192017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "US STOCKS-Wall St slips as countdown to Trump's swearing-in begins "
    },
    {
        "content": "DETROIT The head of No. 3 U.S. railroad CSX Corp  said on Wednesday he sees room for optimism that the U.S. economy could continue to gain momentum in 2017  especially if President-elect Donald Trump follows through on pro-growth promises.",
        "date": "01182017",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX CEO hopeful for U.S. economy in 2017 and that Trump can help "
    },
    {
        "content": "* Indexes up: Dow 0.05 pct  S&P 0.08 pct  Nasdaq 0.21 pct   (Updates to open)",
        "date": "01192017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "US STOCKS-Wall St flat as countdown to Trump's swearing-in begins "
    },
    {
        "content": "Canadian Pacific Railway Ltd    Canada's No. 2 railroad operator  said on Wednesday its chief executive would leave five months earlier than originally expected and it reported a lower-than-expected adjusted quarterly profit.",
        "date": "01192017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "Canadian Pacific CEO Harrison to leave early "
    },
    {
        "content": "Former Canadian Pacific Chief Executive Hunter Harrison is in advanced talks to team up with a former Pershing Square Capital partner  seeking to shake up rival railroad CSX Corp   according to a person familiar with the matter.",
        "date": "01192017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "Ex-Canadian Pacific CEO  activist investor teaming up for CSX stake: source "
    },
    {
        "content": "DETROIT  Jan 18 The head of No. 3 U.S. railroad CSX Corp said on Wednesday he sees room for optimism that the U.S. economy could continue to gain momentum in 2017  especially if President-elect Donald Trump follows through on pro-growth promises.",
        "date": "01182017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 1-CSX CEO hopeful for U.S. economy in 2017 and that Trump can help "
    },
    {
        "content": "Jan 18 Canadian Pacific Railway Ltd    Canada's No. 2 railroad operator  said on Wednesday its chief executive would leave five months earlier than originally expected and it reported a lower-than-expected adjusted quarterly profit.",
        "date": "01192017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 3-Canadian Pacific CEO Harrison to leave early "
    },
    {
        "content": "Jan 18 Former Canadian Pacific Chief Executive Hunter Harrison is in advanced talks to team up with a former Pershing Square Capital partner  seeking to shake up rival railroad CSX Corp  according to a person familiar with the matter.",
        "date": "01192017",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 1-Ex-Canadian Pacific CEO  activist investor teaming up for CSX stake: source "
    },
    {
        "content": "Two CSX Corp  trains collided and derailed in central Florida early on Wednesday  injuring two crew members  the company said.",
        "date": "11162016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "Two CSX trains in Florida collide  derail; two injured "
    },
    {
        "content": "Nov 16 Two CSX Corp trains collided and derailed in central Florida early on Wednesday  injuring two crew members  the company said.",
        "date": "11162016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 1-Two CSX trains in Florida collide  derail; two injured "
    },
    {
        "content": "* CSX COO updates expectations for fourth quarter performance",
        "date": "11092016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-Csx COO updates expectations for Q4 performance "
    },
    {
        "content": "* CSX Corp - Expects to make a voluntary contribution of $220 million to defined benefit pension plans on or before October 31  2016",
        "date": "10182016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-CSX Corp expects to make voluntary contribution of $220 mln to defined benefit pension plans "
    },
    {
        "content": "CHICAGO U.S. coal freight volumes  in decline for close to two years   will fall further  though the slowing pace of drop should ease the shock to U.S. railroads  the top executive of No. 3 U.S. railroad CSX Corp  said on Thursday.",
        "date": "10132016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX CEO says coal volumes set to decline further "
    },
    {
        "content": "CHICAGO  Oct 13 U.S. coal freight volumes  in decline for close to two years   will fall further  though the slowing pace of drop should ease the shock to U.S. railroads  the top executive of No. 3 U.S. railroad CSX Corp said on Thursday.",
        "date": "10132016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 1-CSX CEO says coal volumes set to decline further "
    },
    {
        "content": "CHICAGO No. 3 U.S. railroad CSX Corp  on Wednesday reported a lower quarterly net profit that was hurt by an 8 percent drop in revenue and freight volumes  but came in above market expectations and sent its stock up nearly 3 percent.",
        "date": "10132016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX takes revenue  freight volume hit  but beats expectations "
    },
    {
        "content": "CHICAGO  Oct 12 No. 3 U.S. railroad CSX Corp  on Wednesday reported a lower quarterly net profit that was hurt by an 8 percent drop in revenue and freight volumes  but came in above market expectations and sent its stock up nearly 3 percent.",
        "date": "10122016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "UPDATE 2-CSX takes revenue  freight volume hit  but beats expectations "
    },
    {
        "content": "CHICAGO  Oct 12 No. 3 U.S. railroad CSX Corp  on Wednesday reported a lower quarterly net profit that was hurt by an 8 percent drop in revenue and freight volumes  but came in above market expectations and sent its stock up nearly 3 percent.",
        "date": "10122016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CORRECTED-UPDATE 1-CSX takes revenue  freight volume hit  but beats expectations "
    },
    {
        "content": "CHICAGO  Oct 12 No. 3 U.S. railroad CSX Corp  on Wednesday reported a lower quarterly net profit  citing an 8 percent drop in revenue and freight volumes  with coal freight down 21 percent in the three months ended Sept. 30.",
        "date": "10122016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CORRECTED-CSX 3rd qtr profit falls on lower revenue  coal volumes down 21 pct "
    },
    {
        "content": "* Q3 earnings per share view $0.45 -- Thomson Reuters I/B/E/S",
        "date": "10122016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX Corp Q3 earnings per share $0.48 "
    },
    {
        "content": "NEW YORK A CSX Corp freight train derailed on Wednesday morning in New York City's Bronx borough  suspending northbound Amtrak service from the city for hours but causing no injuries.",
        "date": "10052016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "Freight train derailment in New York disrupts Amtrak service "
    },
    {
        "content": "NEW YORK  Oct 5 A CSX Corp freight train derailed on Wednesday morning in New York City's Bronx borough  suspending northbound Amtrak service from the city for hours but causing no injuries.",
        "date": "10052016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 1-Freight train derailment in New York disrupts Amtrak service "
    },
    {
        "content": "* Sets quarterly dividend of $0.18per share  Source text for Eikon:  Further company coverage:",
        "date": "10052016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX sets quarterly dividend of $0.18/share "
    },
    {
        "content": "* CSX Corporation announces revised dates for earnings release and third quarter earnings call",
        "date": "09152016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-CSX Corporation announces revised dates for earnings release and Q3 earnings call "
    },
    {
        "content": "* Csx corp says  q3 earnings per share expected to decline slightly sequentially",
        "date": "09072016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-CSX says expects Q3 EPS to decline slightly sequentially "
    },
    {
        "content": "* CSX Corporation announces redemption of zero coupon convertible debentures due October 30  2021",
        "date": "07262016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-CSX Corporation announces redemption of zero coupon convertible debentures due October 2021 "
    },
    {
        "content": "CHICAGO  July 14 U.S. railroad CSX Corp  said on Thursday that its freight volumes should be down in the \"mid- to high single digits \" driven primarily by weak coal and crude tonnage  and that its earnings for the rest of 2016 will be down versus the previous year.",
        "date": "07142016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX says weak coal  crude will hurt earnings for rest of 2016 "
    },
    {
        "content": "NEW YORK U.S. stocks ticked up on Wednesday  just enough for the S&P 500 and Dow industrials to set record highs  with investors expecting upbeat earnings to keep the rally going. | Video ",
        "date": "07142016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "Wall Street ticks up to extend record streak "
    },
    {
        "content": "* Sets quarterly dividend of $0.18 per share  Source text for Eikon:  Further company coverage:",
        "date": "07132016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-CSX sets quarterly dividend of $0.18 per share "
    },
    {
        "content": "CHICAGO  July 13 CSX Corp  the third-largest U.S. railroad  on Wednesday posted a lower second-quarter net profit that beat expectations as lower costs partly offset a 34 percent drop in coal volumes.",
        "date": "07132016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 2-Lower costs help CSX beat profit estimates; coal volumes down "
    },
    {
        "content": "CHICAGO  July 13 CSX Corp  the third-largest U.S. railroad  on Wednesday reported a lower second-quarter net profit  driven by an overall decline in freight volumes of 9 percent.",
        "date": "07132016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX quarterly profit falls "
    },
    {
        "content": "* Q2 revenue view $2.69 billion -- Thomson Reuters I/B/E/S  Source text (http://bit.ly/29I2oZC) Further company coverage:",
        "date": "07132016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX Corp posts Q2 revenue of $2.7 bln vs $3.06 bln "
    },
    {
        "content": "* Q2 earnings per share view $0.44 -- Thomson Reuters I/B/E/S",
        "date": "07132016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX Corporation Q2 earnings per share $0.47 "
    },
    {
        "content": "* Futures up: Dow 8 pts  S&P 1.75 pts  Nasdaq 7 pts   (Adds details  comments  updates prices)",
        "date": "07132016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "US STOCKS-Wall St set to open flat after record-setting rally "
    },
    {
        "content": "July 13 U.S. stock index futures were flat on Wednesday as investors stopped to take a breather a day after the S&P 500 and the Dow hit record highs  amid growing optimism about the economy.",
        "date": "07132016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "US STOCKS-Futures flat a day after S&P 500  Dow hit record highs "
    },
    {
        "content": "* Retirement on July 1 of Lisa Mancini  executive vice president and chief administrative officer",
        "date": "05202016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-CSX announces senior leadership team changes "
    },
    {
        "content": "* Board approved an $0.18 per share quarterly dividend on company's common stock  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05132016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "BRIEF-CSX says board approved $0.18 per share quarterly dividend "
    },
    {
        "content": "WASHINGTON A CSX freight train derailed in northeastern Washington on Sunday  spilling hazardous material near a subway station and disrupting commuter rail and long-distance Amtrak passenger trains but causing no injuries  authorities said. | Video ",
        "date": "05012016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "Derailed train in Washington leaks hazardous chemical  disrupts rail service "
    },
    {
        "content": "April 23 Federal agents have found more than 30 cases of commercial-grade aerial fireworks in Detroit after the explosives were reported stolen from a CSX freight train earlier this week  officials said on Saturday.",
        "date": "04232016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "Fireworks stolen from CSX freight train recovered in Detroit "
    },
    {
        "content": "CHICAGO  April 13 No. 3 U.S. railroad CSX Corp  said on Wednesday its expects \"mid-to-high single digit\" freight volume declines in the second quarter due largely to slumping coal demand  but its top executive said there are signs America's industrial economy may avoid a recession.",
        "date": "04132016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "UPDATE 1-CSX CEO says industrial sector shows signs of stabilizing "
    },
    {
        "content": "CHICAGO No. 3 U.S. railroad CSX Corp  said on Tuesday that lower freight  in particular a 31 percent drop in coal volumes  had hurt its first-quarter profit and still expected coal to weigh on earnings throughout 2016.",
        "date": "04122016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX profit dragged down by coal  to stay weak through 2016 "
    },
    {
        "content": "CHICAGO Executives at CSX Corp  said on Wednesday they expected a \"mid-to-high single digit\" decline in freight volumes at the No. 3 U.S. railroad during the second quarter.",
        "date": "04132016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX expects 'mid-to-high single digit' freight decline in second quarter "
    },
    {
        "content": "* Continued low commodity prices  strong U.S. Dollar and energy market transition will challenge q2 and full-year 2016 performance",
        "date": "04122016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX posts Q1 earnings per share $0.37 "
    },
    {
        "content": "CHICAGO  April 13 Executives at CSX Corp  said on Wednesday they expected a \"mid-to-high single digit\" decline in freight volumes at the No. 3 U.S. railroad during the second quarter.",
        "date": "04132016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX expects \"mid-to-high single digit\" freight decline in Q2 "
    },
    {
        "content": "CHICAGO  April 12 No. 3 U.S. railroad CSX Corp  said on Tuesday that lower freight  in particular a 31 percent drop in coal volumes  had hurt its first-quarter profit and still expected coal to weigh on earnings throughout 2016.",
        "date": "04122016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 1-CSX profit dragged down by coal  to stay weak through 2016 "
    },
    {
        "content": "* Q1 earnings per share view $0.37  revenue view $2.68 billion -- Thomson Reuters I/B/E/S  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04122016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "BRIEF-CSX qtrly revenue $2.62 bln vs $3.03 bln "
    },
    {
        "content": "CHICAGO  April 12 No. 3 U.S. railroad CSX Corp  on Tuesday reported a lower quarterly net profit  in line with analysts' expectations  citing declines in most freight segments  especially coal.",
        "date": "04122016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX first-quarter net profit down as freight volumes fall "
    },
    {
        "content": "CHICAGO/MONTREAL Canadian Pacific Railway Ltd  Chief Executive Hunter Harrison on Monday said the company would consider using cash once planned to acquire rival Norfolk Southern Corp  for a potential buyback  dividend  or combination of both. | Video ",
        "date": "04122016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CP Rail mulls buyback  dividend after dropping Norfolk bid: CEO "
    },
    {
        "content": "CHICAGO  March 23 Archer Daniels Midland Co  has filed a lawsuit against Canadian Pacific  over service disruptions in 2013 and 2014 at crop-processing plants in North Dakota and Minnesota  alleging they stemmed partly from cost-cutting and the Canadian railroad's pursuit of merger partners.",
        "date": "03232016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 2-ADM sues Canadian Pacific over 2013-14 rail service disruptions "
    },
    {
        "content": "MONTREAL Canadian Pacific Railway Ltd  Chief Executive Officer Hunter Harrison on Wednesday said CSX Corp  has several strengths as a merger target  but stressed that he never made a formal offer for the U.S. railroad.",
        "date": "03092016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CP's CEO says CSX and Norfolk Southern 'both work' as merger targets "
    },
    {
        "content": "MONTREAL  March 9 Canadian Pacific Railway Ltd  Chief Executive Officer Hunter Harrison on Wednesday said CSX Corp has several strengths as a merger target  but stressed that he never made a formal offer for the U.S. railroad.",
        "date": "03092016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 1-CP's CEO says CSX and Norfolk Southern 'both work' as merger targets "
    },
    {
        "content": "MONTREAL  March 9 Canadian Pacific Railway Co Chief Executive Hunter Harrison said on Wednesday that he never made an offer for CSX and that a merger with the U.S. railroad would not work culturally.",
        "date": "03092016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CP's CEO said he never made merger offer for U.S. railroad CSX "
    },
    {
        "content": "Jan 19 Canadian Pacific Railway Ltd  urged the U.S. Department of Justice to look into statements by U.S. railroad companies about \"working closely with each other to block\" the company's proposed takeover of Norfolk Southern Corp.",
        "date": "01192016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 1-CP wants U.S. DOJ to look into talks held by U.S. railroads "
    },
    {
        "content": "Jan 19 Canadian Pacific Railway Ltd  urged the U.S. Department of Justice to look into statements by U.S. railroad companies about \"working closely with each other to block\" the company's proposed takeover of Norfolk Southern Corp.",
        "date": "01192016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CP wants U.S. DOJ to look into talks held by U.S. railroads "
    },
    {
        "content": "CHICAGO No. 3 U.S. railroad CSX Corp  on Tuesday reported a lower quarterly net profit  citing a drop in freight volumes  and said the weak global economy and U.S. industrial markets would weigh on results in the coming year.",
        "date": "01132016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX fourth quarter profit falls on lower freight volumes "
    },
    {
        "content": "CHICAGO No. 3 U.S. railroad CSX Corp  on Tuesday reported a lower quarterly net profit  citing a drop in freight volumes  and said the weak global economy and U.S. industrial markets would weigh on results in the coming year.",
        "date": "01122016",
        "name": "CSX Corporation",
        "news_type": "topStory",
        "symbol": "CSX",
        "title": "CSX fourth quarter profit falls on lower freight volumes "
    },
    {
        "content": "LOMBARD  Ill.  Jan 13 No. 1 U.S. railroad Union Pacific Corp believes major railroad mergers are not in the interest of the rail industry or customers and is working behind the scenes to make sure none take place  the company's top executive said on Wednesday.",
        "date": "01132016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "Union Pacific will do all in its power to stop rail mergers- CEO "
    },
    {
        "content": "CHICAGO  Jan 12 No. 3 U.S. railroad CSX Corp  on Tuesday reported a lower quarterly net profit  citing a drop in freight volumes  and said the weak global economy and U.S. industrial markets would weigh on results in the coming year.",
        "date": "01122016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "UPDATE 1-CSX Q4 profit falls on lower freight volumes "
    },
    {
        "content": "CHICAGO  Jan 12 No. 3 U.S. railroad CSX Corp  on Tuesday reported a lower quarterly net profit citing a drop in freight volumes  especially a 32 percent decline in the amount of coal hauled.",
        "date": "01122016",
        "name": "CSX Corporation",
        "news_type": "normal",
        "symbol": "CSX",
        "title": "CSX Q4 profit falls on lower freight volumes "
    }
]