[
    {
        "content": "* Temasek Holdings (Private) Limited reports 8.7 percent stake in CenturyLink Inc. as on November 1  2017 - SEC filing ‍​ Source text (http://bit.ly/2iEL8Xi)",
        "date": "11082017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-Temasek Holdings (Private) Limited reports 8.7 pct stake in CenturyLink Inc. as on Nov. 1 ‍​ "
    },
    {
        "content": "WASHINGTON Telecommunications provider CenturyLink Inc  on Monday won anti-trust approval from the U.S. Federal Communications Commission for its purchase of Level 3 Communications Inc   the agency said.",
        "date": "10312017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "U.S. regulator approves CenturyLink's $24 billion Level 3 acquisition "
    },
    {
        "content": "* ‍Partnership to provide Centurylink customers with complementary enterprise-grade cloud options from Data#3​ Source text for Eikon: Further company coverage: (bangalore.newsroom@thomsonreuters.com)",
        "date": "10292017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-Data#3 ‍signs partner agreement with Centurylink​ "
    },
    {
        "content": "* CenturyLink acquisition of Level 3 receives approval from Federal Communications Commission",
        "date": "10302017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-CenturyLink acquisition of Level 3 receives approval from Federal Communications Commission "
    },
    {
        "content": "WASHINGTON  Oct 30 Telecommunications provider CenturyLink Inc on Monday won anti-trust approval from the U.S. Federal Communications Commission for its purchase of Level 3 Communications Inc  the agency said.",
        "date": "10312017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "UPDATE 4-U.S. regulator approves CenturyLink's $24 bln Level 3 acquisition "
    },
    {
        "content": "WASHINGTON  Oct 30 Telecommunications provider CenturyLink Inc won U.S. antitrust approval from the U.S. Federal Communications Commission for its purchase of Level 3 Communications Inc  a person briefed on the matter said on Monday.",
        "date": "10302017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "U.S. FCC approves CenturyLink acquisition of Level 3 -source "
    },
    {
        "content": "* Dow down 0.48 pct  S&P 500 down 0.47 pct  Nasdaq down 0.52 pct (Updates to market close)",
        "date": "10252017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "US STOCKS-Higher bond yields  soft earnings weigh on Wall St "
    },
    {
        "content": "* S&P  Dow on track for worst percentage losses since Sept. 5",
        "date": "10252017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "US STOCKS-Rising bond yields  soft earnings hit Wall St "
    },
    {
        "content": "* S&P  Dow on track for worst percentage losses since Sept. 9",
        "date": "10252017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "US STOCKS-Tax plan worries  tepid earnings halt rally "
    },
    {
        "content": "* TRC Capital says due to pending Level 3 Communications and Centurylink deal  TRC amended terms of its tender offer for up to 2 million shares of :evel 3",
        "date": "10052017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-‍TRC Capital amends offer for Level 3 Communications "
    },
    {
        "content": "Oct 3 The following bids  mergers  acquisitions and disposals were reported by 1300 GMT on Tuesday:",
        "date": "10032017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "WASHINGTON Telecommunications provider CenturyLink Inc  has won U.S. antitrust approval for its purchase of Level 3 Communications Inc  on condition that it sell certain assets  according to a court filing dated on Monday.",
        "date": "10022017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "CenturyLink wins U.S. antitrust approval to buy Level 3 telecoms "
    },
    {
        "content": "WASHINGTON  Oct 2 Telecommunications provider CenturyLink Inc has won U.S. antitrust approval for its purchase of Level 3 Communications Inc on condition that it sell certain assets  according to a court filing dated on Monday.",
        "date": "10022017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "UPDATE 1-CenturyLink wins U.S. antitrust approval to buy Level 3 telecoms "
    },
    {
        "content": "* U.S. Department of Justice clears CenturyLink's acquisition of level 3",
        "date": "10022017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "BRIEF-U.S. Department Of Justice clears CenturyLink's acquisition of Level 3 "
    },
    {
        "content": "WASHINGTON  Oct 2 Telecommunications provider CenturyLink Inc has won U.S. antitrust approval for its purchase of Level 3 Communications Inc on condition that it sell certain assets  according to a court filing dated on Monday.",
        "date": "10022017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "Centurylink wins U.S. antitrust to buy Level 3 with conditions -court filing "
    },
    {
        "content": "* Level 3 Communications recommends stockholders reject \"mini-tender\" offer by TRC Capital Corporation",
        "date": "10022017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "BRIEF-Level 3 Communications says it does not endorse TRC Capital's mini-tender offer "
    },
    {
        "content": "* CenturyLink says state of New Jersey has approved CenturyLink's pending acquisition of Level 3 Communications",
        "date": "08232017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-CenturyLink says state of New Jersey has approved its pending acquisition of Level 3 Communications "
    },
    {
        "content": "* Corvex Management Lp reports 6.6 percent stake in CenturyLink Inc as of August 17  2017 - sec filing‍​",
        "date": "08172017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-Corvex Management reports 6.6 pct stake in CenturyLink "
    },
    {
        "content": "* CenturyLink Inc - ‍signed agreement to sell King & Union's Avalon to company's commercial and government clients​ Source text for Eikon: Further company coverage:",
        "date": "08092017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-CenturyLink Inc - ‍signed agreement to sell King & Union's Avalon to co's commercial and government clients​ "
    },
    {
        "content": "* Centurylink  - Mississippi and Washington approved Centurylink pending acquisition of Level 3 Communications​ Source text for Eikon: Further company coverage:",
        "date": "08012017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-Two more states approve Centurylink - Level 3 Acquisition "
    },
    {
        "content": "The chief executive of CenturyLink Inc said he disagrees with claims made by the Minnesota Attorney General of not cooperating with the investigation related to a lawsuit on overcharging for internet and cable services.",
        "date": "07242017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "CenturyLink CEO says disagrees with Minnesota claims "
    },
    {
        "content": "July 21 The chief executive of CenturyLink Inc said he disagrees with claims made by the Minnesota Attorney General of not cooperating with the investigation related to a lawsuit on overcharging for internet and cable services.",
        "date": "07222017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "CenturyLink CEO says disagrees with Minnesota claims "
    },
    {
        "content": "* Four additional states approve CenturyLink - Level 3 acquisition",
        "date": "07102017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-Four additional states approve CenturyLink-Level 3 acquisition "
    },
    {
        "content": "WASHINGTON  July 11 Microsoft Corp on Tuesday announced an initiative to bring high-speed internet to millions of rural Americans through unused television airwaves in a long-term bet for user growth.",
        "date": "07112017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "Microsoft vows to bring broadband to millions of rural Americans "
    },
    {
        "content": "NEW YORK Minnesota filed a lawsuit against CenturyLink Inc alleging the telecommunications provider charged customers more than they agreed to pay for internet and cable services  the state's Attorney General Lori Swanson said in a statement  sending its shares down on Wednesday.",
        "date": "07122017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "Minnesota sues CenturyLink alleging it overcharges customers "
    },
    {
        "content": "NEW YORK  July 12 Minnesota filed a lawsuit against CenturyLink Inc alleging the telecommunications provider charged customers more than they agreed to pay for internet and cable services  the state's Attorney General Lori Swanson said in a statement  sending its shares down on Wednesday.",
        "date": "07122017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "UPDATE 2-Minnesota sues CenturyLink alleging it overcharges customers "
    },
    {
        "content": "NEW YORK  July 12 Minnesota Attorney General Lori Swanson filed a lawsuit against cable provider CenturyLink Inc for its billing practices  sending shares down on Wednesday.",
        "date": "07122017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "Minnesota attorney general sues CenturyLink on billing practices "
    },
    {
        "content": "A CenturyLink Inc  employee claimed she lost her job for blowing the whistle on the telecom company's sales culture  according to a Bloomberg report on Friday.",
        "date": "06162017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "CenturyLink's ex-employee alleges fraudulent sales practice: Bloomberg "
    },
    {
        "content": "June 16 A CenturyLink Inc employee claimed she lost her job for blowing the whistle on the telecom company's sales culture  according to a Bloomberg report on Friday.",
        "date": "06162017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "UPDATE 2-CenturyLink's ex-employee alleges fraudulent sales practice - BBG "
    },
    {
        "content": "* CenturyLink Inc says Glen F. Post III will remain ceo until Jan. 1  2019",
        "date": "06012017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-CenturyLink says Glen Post III will remain CEO until Jan. 1  2019 "
    },
    {
        "content": "* CenturyLink announces pricing and allocation of $6.0 billion term loan B facility",
        "date": "05192017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-CenturyLink announces pricing of $6 bln term loan B facility "
    },
    {
        "content": "* Co  Seattle Seahawks and First & Goal have agreed to terms on a stadium naming rights extension beginning 2019 through 2033 NFL season",
        "date": "05152017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-Seahawks  CenturyLink extend stadium and event center naming rights deal "
    },
    {
        "content": "NEW YORK With the U.S. stock market near record highs  hedge fund managers presented ideas that largely depend on rising property values and corporate mergers for growth at a high-profile investment event in New York on Monday.",
        "date": "05092017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "Property  merger bets dominate bullish Sohn conference "
    },
    {
        "content": "NEW YORK  May 8 Activist investor Keith Meister revealed his fund's newest investment on Monday  detailing a bet on CenturyLink Inc and describing the telecom infrastructure company's pending purchase of Level 3 Communications Inc as \"game changing\" for the industry.",
        "date": "05082017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "UPDATE 1-Corvex's Meister reveals 5.5 pct stake in CenturyLink "
    },
    {
        "content": "NEW YORK  May 8 Shares in a real estate developer  a cable company and the Canadian creator of the Teletubbies show all rose on Monday after being promoted at an event in New York where hedge fund managers present a diverse range of investment ideas.",
        "date": "05082017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "Property  merger bets dominate picks at Sohn conference "
    },
    {
        "content": "NEW YORK  May 8 Corvex Management is betting on telecom infrastructure company CenturyLink Inc  predicting a 43 percent upside to its stock  the managing partner of the hedge fund said on Monday.",
        "date": "05082017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "Corvex's Meister says fund owns 5.5 pct of CenturyLink "
    },
    {
        "content": "* On April 27  co's unit Qwest Corp sold $575 million aggregate principal amount of its unsecured 6.75% notes due 2057 - SEC filing",
        "date": "05052017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-CenturyLink says on April 27 unit sold $575 mln of its 6.75% notes due 2057 "
    },
    {
        "content": "SAN FRANCISCO  May 2Private equity firm BC Partners said it would turn the data center portfolio it acquired from CenturyLink for $2.8 billion on Tuesday into a new technology company called Cyxtera Technologies.",
        "date": "05022017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "New BC Partners-backed company to focus on data centers  cybersecurity "
    },
    {
        "content": "* Centurylink Inc says estimate that total capital expenditures for remainder of 2017 to be about $1.9 billion",
        "date": "05052017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "BRIEF-Centurylink Inc estimates total capital expenditures of $1.9 bln "
    },
    {
        "content": "* Centurylink announces combined company senior leadership team Source text for Eikon: Further company coverage:",
        "date": "04282017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-Centurylink announces combined company senior leadership team "
    },
    {
        "content": "* CenturyLink Inc says CEO Glen F. Post  III total 2016 compensation was $13.97 million versus $10.7 million in 2015 - sec filing Source text: (http://bit.ly/2peh5Z1) Further company coverage:",
        "date": "04132017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-CenturyLink says CEO Glen Posttotal 2016 compensation was $13.97 mln "
    },
    {
        "content": "* Centurylink Inc - co's subisidary Qwest corporation agreed to sell $575 million aggregate principal amount of 6.75 pct notes due 2057 Source text for Eikon: Further company coverage:",
        "date": "04192017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-Qwest Corp agrees to sell debt securities "
    },
    {
        "content": "A successor to the licensing firm that achieved notoriety by asserting a patent on the idea of an online shopping cart has filed infringement claims against communications services company CenturyLink Inc.",
        "date": "04122017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "'Shopping cart' patent successor targets CenturyLink with lawsuit "
    },
    {
        "content": "* CenturyLink Inc- Delaware  Hawaii  Maryland and District of Columbia approve CenturyLink - level 3 merger Source text for Eikon: Further company coverage:",
        "date": "04122017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "BRIEF-CenturyLink says Delaware  Hawaii  Maryland and District of Columbia approve company's level 3 merger "
    },
    {
        "content": "* CenturyLink signs agreement with EagleForce associates to provide government agencies with real-time monitoring of opioid prescriptions Source text for Eikon: Further company coverage:",
        "date": "04042017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-CenturyLink signs agreement to provide  real-time monitoring of opioid prescriptions "
    },
    {
        "content": "* CenturyLink -about 96.3 percent of votes cast supported proposal to issue co's common stock to level 3 stockholders in connection with proposed merger",
        "date": "03162017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-Centurylink and Level 3 shareholders approve merger "
    },
    {
        "content": "* Centurylink expands its collaboration with VMware to accelerate enterprise cloud adoption  Source text for Eikon:  Further company coverage:",
        "date": "02222017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-Centurylink expands collaboration with VMware to accelerate enterprise cloud adoption "
    },
    {
        "content": "* Sets regular quarterly cash dividend of $0.54per share  Source text for Eikon:  Further company coverage:",
        "date": "02212017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-CenturyLink sets quarterly cash dividend of $0.54 per share "
    },
    {
        "content": "* Centurylink - Ohio  Utah approve the merger of Centurylink and Level 3 Communications; merger also received regulatory clearance from State of Nevada",
        "date": "02142017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-Ohio  Utah approve merger of Centurylink and Level 3 Communications "
    },
    {
        "content": "* Centurylink Inc - entered into a memorandum of understanding providing for settlement of putative shareholder class action lawsuit filed on Jan.11  2017",
        "date": "02162017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-Centurylink Inc entered into a memorandum of understanding for settlement of lawsuit "
    },
    {
        "content": "Jan 26 Digital Bridge Holdings LLC  a firm that invests in data centers  has agreed to acquire Vantage Data Centers Management Co LLC from buyout firm Silver Lake Partners for well over $1 billion  including debt  people familiar with the matter said on Thursday.",
        "date": "01272017",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "Digital Bridge to acquire Vantage Data Centers for $1 bln -sources "
    },
    {
        "content": "* Centurylink -refiled pre-merger notification under hart-scott-rodino antitrust improvements act of 1976 in connection with previously-announced acquisition of level 3",
        "date": "01122017",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-Centurylink -refiled pre-merger notification under Hart-Scott-Rodino antitrust improvements act of 1976 related to Level 3 acquisition "
    },
    {
        "content": "* Sets regular quarterly cash dividend of $0.54 per share  Source text for Eikon:  Further company coverage:",
        "date": "11152016",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-CenturyLink sets regular quarterly cash dividend of $0.54per share "
    },
    {
        "content": "* Centurylink Inc - currently projects that net cash proceeds from data centers and colocation divestiture will be approximately $1.5 billion to $1.7 billion",
        "date": "11072016",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-Centurylink Inc - plans to use net cash proceeds from divestiture to partly fund acquisition of Level 3 Communications "
    },
    {
        "content": "Nov 4 Telecom company CenturyLink Inc  said it would sell its data centers and colocation business to a group of funds for $2.15 billion in cash and a minority stake to be valued at $150 million in the consortium's global secure infrastructure company.",
        "date": "11042016",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "CenturyLink to sell data centers  colocation business "
    },
    {
        "content": "Nov 4 Telecommunications firm CenturyLink Inc  said it would sell its data centers and colocation business to a group of funds for $2.15 billion in cash and a minority stake to be valued at $150 million in the investor's group new private infrastructure company.",
        "date": "11042016",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "UPDATE 2-CenturyLink to sell data centers  colocation business "
    },
    {
        "content": "* Centurylink reaches agreement to sell data centers and colocation business to a consortium led by BC Partners and Medina Capital",
        "date": "11042016",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "BRIEF-CenturyLink reaches agreement to sell data centers "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 31 (Fitch) Fitch Ratings has placed the 'BB+' Long-Term Issuer  Default Ratings (IDRs) of CenturyLink Inc. (CenturyLink) (NYSE: CTL) and its  subsidiaries on Rating Watch Negative. The rating action affects approximately  $19.9 billion of debt outstanding as of June 30  2016. Fitch has affirmed the Long-Term IDRs of Level 3 Communications  Inc. (LVLT) and  its wholly owned subsidiary Level 3 Financing  Inc. (Level 3 Fin",
        "date": "10312016",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "Fitch Places CenturyLink's 'BB+' IDR on Negative Watch on Proposed LVLT Acquisition "
    },
    {
        "content": "Oct 31 Telecom company CenturyLink Inc  said on Monday it would buy Level 3 Communications Inc  in a cash-and-stock deal with an equity value of about $24 billion to expand its fiber optic network and high-speed data services.",
        "date": "10312016",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "CORRECTED-UPDATE 2-CenturyLink to buy Level 3 Communications for about $24 bln "
    },
    {
        "content": "* Glen Post will serve as CEO and President and Sunit Patel will serve as CFO for combined company",
        "date": "10312016",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "BRIEF-CenturyLink to acquire Level 3 Communications for about $34 bln "
    },
    {
        "content": "Oct 31 CenturyLink Inc said on Monday it would buy Level 3 Communications Inc in a cash-and-stock deal valued at about $34 billion  including debt.",
        "date": "10312016",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "CenturyLink agrees to buy Level 3 Communications in $34 bln deal "
    },
    {
        "content": "* CenturyLink is in advanced talks to merge with Level 3 Communications- CNBC citing DJ",
        "date": "10272016",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-CenturyLink is in advanced talks to merge with Level 3 Communications- CNBC  citing DJ "
    },
    {
        "content": "Buyout firm BC Partners Ltd is in pole position to acquire a data center business that CenturyLink Inc  a U.S. provider of phone and internet services  is hoping to divest for more than $2.5 billion  people familiar with the matter said.",
        "date": "10112016",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "Exclusive: BC Partners in lead to acquire CenturyLink's data centers - sources "
    },
    {
        "content": "Sept 9 The following bids  mergers  acquisitions and disposals were reported by 1000 GMT on Friday:",
        "date": "09092016",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Announced availability of Centurylink cloud in Australia  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "04132016",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-Centurylink expands its cloud platform to Australia "
    },
    {
        "content": "* Says CEO Glen F. Post  iii  total compensation for FY 2015 was $10.7 million versus $13.1 million in FY 2014 - sec filing  Source text for Eikon: (http://1.usa.gov/1S8XJKr) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04052016",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-Centurylink CEO's 2015 total compensation was $10.7 mln vs $13.1 mln in 2014 - SEC Filing "
    },
    {
        "content": "* Agreed to sell $1 billion of newly-issued unsecured eight-year senior notes",
        "date": "03222016",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "BRIEF-Centurylink agrees to sell $1 bln of debt securities "
    },
    {
        "content": "* Agreed to sell $1.0 billion of newly-issued unsecured senior notes due 2024",
        "date": "03222016",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "BRIEF-Centurylink to sell $1 bln of newly-issued unsecured senior notes due 2024 "
    },
    {
        "content": "Jan 7 Joseph Nacchio  the former Qwest Communications International chief executive  on Thursday won a $14.2 million jury verdict against a Goldman Sachs Group Inc  unit and financial adviser over the sale of life insurance policies  his law firm said.",
        "date": "01082016",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "UPDATE 1-Ex-Qwest CEO Nacchio wins $14 mln verdict vs Goldman unit -lawyer "
    },
    {
        "content": "Jan 7 Joseph Nacchio  the former Qwest Communications International chief executive  has won a $14.2 million jury verdict against a Goldman Sachs Group Inc  unit and financial adviser over the sale of life insurance policies  his law firm said on Thursday.",
        "date": "01072016",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "Ex-Qwest CEO Nacchio wins $14 mln verdict vs Goldman unit  law firm says "
    },
    {
        "content": "WASHINGTON AT&T Inc  CenturyLink Inc  and U.S. telecom and cable industry groups called for regulators to block parts of new rules for Internet service providers on Friday  citing \"crushing\" compliance costs and threats to investment.",
        "date": "05012015",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "AT&T  U.S. telecom groups seek to block new Internet rules "
    },
    {
        "content": "WASHINGTON  May 1 AT&T Inc  CenturyLink Inc and U.S. telecom and cable industry groups called for regulators to block parts of new rules for Internet service providers on Friday  citing \"crushing\" compliance costs and threats to investment.",
        "date": "05012015",
        "name": "CenturyLink Inc",
        "news_type": "normal",
        "symbol": "CTL",
        "title": "UPDATE 2-AT&T  U.S. telecom groups seek to block new Internet rules "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 30 (Fitch) Fitch Ratings has affirmed the Issuer Default Ratings  (IDRs) of CenturyLink  Inc. (CenturyLink) and its subsidiaries at 'BB+'. The  issue ratings of CenturyLink's $8 billion of outstanding senior unsecured notes  (pro forma for first-quarter 2015 refinancing) and revolving credit facility  (RCF) have been affirmed at 'BB+'. The ratings on the outstanding $10.1 billion  aggregate amount of senior unsecured debt",
        "date": "03302015",
        "name": "CenturyLink Inc",
        "news_type": "topStory",
        "symbol": "CTL",
        "title": "Fitch Affirms CenturyLink's IDR at 'BB+'; Outlook Stable "
    }
]