[
    {
        "content": "Nov 15 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Wednesday:",
        "date": "11152017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "CALGARY  Alberta Canada's Cenovus Energy Inc  has reached a deal to sell its Weyburn oil facility for C$940 million ($738.53 million)  the company said on Monday  completing its main divesture plans.",
        "date": "11132017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Canada's Cenovus finishes main divesture plans with Weyburn sale "
    },
    {
        "content": "CALGARY  Nov 15 Canadian oil producer Cenovus Energy Inc has put a package of some of its Deep Basin gas assets up for sale  the company's new chief executive said on Wednesday  adding that Cenovus was looking to reduce costs in the long term.",
        "date": "11152017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 2-Canada's Cenovus to sell some Deep Basin gas assets  cut costs -new CEO "
    },
    {
        "content": "CALGARY  Alberta  Nov 13 Canada's Cenovus Energy Inc has reached a deal to sell its Weyburn oil facility for C$940 million ($738.53 million)  the company said on Monday  completing its main divesture plans.",
        "date": "11132017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 2-Canada's Cenovus finishes main divesture plans with Weyburn sale "
    },
    {
        "content": "* Ups share stake in Kellogg by 40.6 percent to 382 697 shares - SEC filing",
        "date": "11142017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "BRIEF-Soros Fund Management takes share stake in GM  Cenovus Energy "
    },
    {
        "content": "CALGARY  Nov 15 Canadian oil producer Cenovus Energy inc has put a package of mainly non-core Deep Basin gas assets for sale  its new CEO Alex Pourbaix said in his first media briefing on Wednesday.",
        "date": "11152017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Canada's Cenovus has put some non-core deep basin assets for sale -new CEO "
    },
    {
        "content": "CALGARY  Alberta  Nov 13 Canada's Cenovus Energy Inc has reached an agreement  to sell its Weyburn oil facility for C$940 million ($738.53 million) to Whitecap Resources Inc  Cenovus said on Monday  completing its main divesture plans.",
        "date": "11132017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Canada's Cenovus to sell Weyburn asset to Whitecap for $739 mln "
    },
    {
        "content": "* Cenovus reaches agreement to sell interest in Weyburn asset for $940 million",
        "date": "11132017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus to sell interest in Weyburn asset for $940 mln "
    },
    {
        "content": "TORONTO/NEW YORK  Nov 7 Canada's Whitecap Resources Inc and at least three other companies have submitted final-round bids for Cenovus Energy Inc's Weyburn oil facility in a deal that could fetch about C$1 billion ($782 million)  people familiar with the situation said on Tuesday.",
        "date": "11072017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 1-Whitecap among final-round bidders for Cenovus' Weyburn asset -sources "
    },
    {
        "content": "Nov 7 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Tuesday:",
        "date": "11072017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Cenovus Energy Inc's   third-quarter adjusted profit beat Wall Street estimates on Thursday  as it benefited from the purchase of ConocoPhillips'  Canadian oil-sands assets that more than doubled production.",
        "date": "11022017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Cenovus' profit beats Street view  production more than doubles "
    },
    {
        "content": "Nov 2 Cenovus Energy Inc's third-quarter adjusted profit beat Wall Street estimates on Thursday  as it benefited from the purchase of ConocoPhillips' Canadian oil-sands assets that more than doubled production.",
        "date": "11022017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 2-Cenovus' profit beats Street view  production more than doubles "
    },
    {
        "content": "Oct 30 Canadian oil producer Cenovus Energy Inc on Monday named Alex Pourbaix  formerly of pipeline company TransCanada Corp  as its new chief executive  tapping another leader without direct technical experience even as some investors and analysts were expecting change.",
        "date": "10302017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 2-Cenovus names TransCanada veteran Pourbaix as new CEO "
    },
    {
        "content": "* Cenovus Energy - ‍announced sale agreements for Pelican Lake  Suffield and Palliser assets for combined gross cash proceeds of approximately $2.8 billion​",
        "date": "11022017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus Q3 ‍loss per share $0.06​ "
    },
    {
        "content": "* Cenovus Energy Inc - ‍Alex Pourbaix replaces Brian Ferguson​ Source text for Eikon: Further company coverage:",
        "date": "10302017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus appoints Alex Pourbaix as new president & CEO "
    },
    {
        "content": "Nov 2 Canadian oil producer Cenovus Energy Inc reported a smaller third-quarter loss on Thursday as production more than doubled.",
        "date": "11022017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus posts smaller loss as production more than doubles "
    },
    {
        "content": "* Says committed to returns-focused strategy regardless of commodity price improvement",
        "date": "10262017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "BRIEF-ConocoPhillips says committed to returns-focused strategy regardless of oil price "
    },
    {
        "content": "Oct 30 Canadian oil and gas producer Cenovus Energy Inc  on Monday named Alex Pourbaix chief executive officer.",
        "date": "10302017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Canada's Cenovus names Alex Pourbaix CEO "
    },
    {
        "content": "Oct 19 Oilfield services giant Schlumberger Ltd sealed a deal to buy oil and gas assets worth $1 billion from Cenovus Energy on Thursday  raising further concerns about its strategy to own more refining and drilling operations directly.",
        "date": "10192017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 3-Schlumberger's latest asset deal raises fresh concerns ahead of Q3 "
    },
    {
        "content": "* Cenovus reaches agreement to sell Palliser assets for $1.3 billion",
        "date": "10192017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus reaches agreement to sell Palliser assets for $1.3 bln "
    },
    {
        "content": "Oct 19 Cenovus Energy  said on Thursday it will sell its Palliser crude oil and natural gas assets in southeastern Alberta to Torxen Energy and Schlumberger Ltd for C$1.3 billion ($1.04 billion) to pay down debt.",
        "date": "10192017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus to sell Palliser assets for $1.3 bln "
    },
    {
        "content": "CALGARY  Alberta  Sept 28 Canadian oil and gas producer Cenovus Energy filed a mixed shelf offering for $7.5 billion with Canada and U.S. regulators on Thursday  although the company said it currently has no plans to issue more debt or equity.",
        "date": "09282017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus Energy files for $7.5 billion mixed shelf offering "
    },
    {
        "content": "* Cenovus Energy Inc - files for mixed shelf of up to $7.5 billion - SEC Filing‍​ Source text: (http://bit.ly/2x01C6a) Further company coverage:",
        "date": "09282017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus Energy says files for mixed shelf of up to $7.5 bln "
    },
    {
        "content": "CALGARY  Alberta Canada's Cenovus Energy Inc  has reached an agreement to sell its Suffield oil and gas assets for C$512 million ($416 million) to International Petroleum Corp   striking its second deal this month as it pushes ahead with its debt reduction plan.",
        "date": "09252017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Canada's Cenovus sells Suffield for $416 million to International Petroleum "
    },
    {
        "content": "CALGARY  Alberta  Sept 25 Canada's Cenovus Energy Inc has reached an agreement to sell its Suffield oil and gas assets for C$512 million ($416 million) to International Petroleum Corp  striking its second deal this month as it pushes ahead with its debt reduction plan.",
        "date": "09252017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Canada's Cenovus sells Suffield for $416 mln to International Petroleum "
    },
    {
        "content": "* Cenovus reaches agreement to sell Suffield assets for more than half a billion dollars",
        "date": "09252017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "CORRECTED-BRIEF-Cenovus reaches agreement to sell Suffield assets for $512 mln "
    },
    {
        "content": "Canadian Natural Resources Ltd  said on Tuesday it has agreed to buy Cenovus Energy Inc's  Pelican Lake heavy oil operations in Alberta for C$975 million ($787 million)  the company's second acquisition this year.",
        "date": "09052017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Canadian Natural buys Cenovus Pelican Lake assets for C$975 million "
    },
    {
        "content": "Sept 5 Canadian Natural Resources Ltd said on Tuesday it has agreed to buy Cenovus Energy Inc's Pelican Lake heavy oil operations in Alberta for C$975 million ($787 million)  the company's second acquisition this year.",
        "date": "09052017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 2-Canadian Natural buys Cenovus Pelican Lake assets for C$975 million "
    },
    {
        "content": "Sept 5 Canada's Cenovus Energy Inc said on Tuesday it would sell its Pelican Lake heavy oil operations in Alberta for C$975 million ($786.92 million).",
        "date": "09052017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus Energy to sell Pelican Lake assets for C$975 mln "
    },
    {
        "content": "* Cenovus reaches agreement to sell Pelican Lake assets for approximately $1 billion",
        "date": "09052017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus to sell Pelican Lake assets for about $1 bln "
    },
    {
        "content": "Sept 1 Canadian Natural Resources Ltd is nearing a deal to buy Cenovus Energy Inc's heavy oil project in Pelican Lake  Alberta  for about C$1 billion ($807 million)  Bloomberg reported on Friday.",
        "date": "09012017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Canadian Natural nears deal for Cenovus's Pelican Lake asset -Bloomberg "
    },
    {
        "content": "TORONTO/CALGARY  Sept 1 Canadian Natural Resources Ltd is in advanced talks to buy Cenovus Energy Inc's heavy oil project in Pelican Lake in northeastern Alberta  for about C$1 billion ($807 million)  according to a source familiar with the situation.",
        "date": "09022017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 2-Canadian Natural in advanced talks for Cenovus Pelican Lake asset -source "
    },
    {
        "content": "TORONTO/CALGARY  Aug 4 Cenovus Energy Inc has received separate bids from Canadian Natural Resources Ltd  ARC Financial Corp and  others for a heavy oil project in Pelican Lake  Alberta  according to people familiar with the matter who told Reuters the project was valued at as much as C$1 billion ($796 million).",
        "date": "08042017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Canadian Natural among bidders for Cenovus' Pelican Lake: sources "
    },
    {
        "content": "* Shares up as much as 6 percent after Reuters report on bids for Pelican Lake  Suffield assets Source text for Eikon: Further company coverage: (Reporting by Ethan Lou)",
        "date": "08042017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus up as much as 6 pct after Reuters report on bids for assets "
    },
    {
        "content": "TORONTO  July 27 Canada's main stock index eked out a small gain on Thursday  as higher oil prices broadly boosted energy stocks and Cenovus Energy Inc soared after saying asset sales could exceed its estimates  while Goldcorp Inc weighed as its earnings disappointed.",
        "date": "07272017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "CANADA STOCKS-TSX rises as energy shares gain  Cenovus jumps "
    },
    {
        "content": "TORONTO  July 27 Canada's main stock index ended slightly higher on Thursday  led by energy stocks as Cenovus Energy Inc soared after saying asset sales may exceed its target  while a string of gold miners and others also gained on positive earnings surprises.",
        "date": "07272017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "CANADA STOCKS-TSX ends higher  energy leads as Cenovus soars "
    },
    {
        "content": "HOUSTON ConocoPhillips  cut its 2017 capital spending by 4 percent on Thursday  the latest U.S. oil and natural gas producer to do so in reaction to depressed crude prices.",
        "date": "07272017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "ConocoPhillips trims capex after posting quarterly loss "
    },
    {
        "content": "HOUSTON  July 27 ConocoPhillips cut its 2017 capital spending by 4 percent on Thursday  the latest U.S. oil and natural gas producer to do so in reaction to depressed crude prices.",
        "date": "07272017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 3-ConocoPhillips trims capex after posting quarterly loss "
    },
    {
        "content": "July 27 Cenovus Energy Inc will have a sale agreement for its Suffield and Pelican Lake assets by the third quarter and its total divesture may exceed its C$5-billion estimate  the company said on Thursday as its shares surged after it posted a profit.",
        "date": "07272017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 3-Canada's Cenovus says divesture may exceed target; shares surge "
    },
    {
        "content": "* Chief Executive Ferguson says will announce sale agreement for Suffield and Pelican Lake assets in third quarter",
        "date": "07272017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus says asset divestiture could exceed C$5 billion "
    },
    {
        "content": "TORONTO  July 27 Canada's main stock index gained on Thursday as major gold miner Barrick Gold Corp and a string of other companies reported better-than-expected earnings and oil producer Cenovus Energy Inc turned a profit.",
        "date": "07272017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "CANADA STOCKS-TSX rises as Barrick earnings soar  Cenovus turns profit "
    },
    {
        "content": "* Q2 earnings per share view c$0.02 -- Thomson Reuters I/B/E/S",
        "date": "07272017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus Reports Q2 EPS c$2.37 "
    },
    {
        "content": "July 27 Oil producer Cenovus Energy Inc reported a profit in the second quarter  compared to a year-ago loss  helped by its recent purchase of ConocoPhillips' Canadian oil-sands assets.",
        "date": "07272017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Canada's Cenovus Energy posts profit in 2nd qtr "
    },
    {
        "content": "CALGARY/TORONTO  July 14 Cenovus Energy Inc's search for a new chief is focusing on external candidates with strong technical skills to help stabilize a company whose shares have nearly halved after an unpopular acquisition.",
        "date": "07142017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "In search for new CEO  Cenovus seeks fresh blood for old path "
    },
    {
        "content": "TORONTO Canadian oil and gas producer Cenovus Energy Inc  has hired investment banks to sell the Weyburn and Palliser oil assets  which it hopes would fetch as much as C$2.5 billion ($2 billion)  according to people familiar with the situation.",
        "date": "07122017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Cenovus expects up to C$2.5 billion from Weyburn  Palliser sales: sources "
    },
    {
        "content": "TORONTO  July 12 Canadian oil and gas producer Cenovus Energy Inc has hired investment banks to sell the Weyburn and Palliser oil assets  which it hopes would fetch as much as C$2.5 billion ($2 billion)  according to people familiar with the situation.",
        "date": "07122017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus expects up to C$2.5 bln from Weyburn  Palliser sales -sources "
    },
    {
        "content": "TORONTO  July 6 Canadian mergers and acquisitions rose about 13 percent to      C$120.5 billion ($93.2 billion) in the first half of 2017  driven by big-ticket energy deals and robust cross-border activity  according to Thomson Reuters data released on Thursday.",
        "date": "07062017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "JPMorgan tops Canadian M&A activity in energy-driven first half "
    },
    {
        "content": "CALGARY  Alberta  June 23 Ratings agency DBRS on Friday downgraded Cenovus Energy Inc  saying the Canadian oil company's acquisition of ConocoPhillips assets in March negatively affects its credit and more than outweighs the benefits of the deal.",
        "date": "06232017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "DBRS downgrades Cenovus after ConocoPhillips deal "
    },
    {
        "content": "CALGARY  Alberta Cenovus Energy Inc's  efforts to sell C$5 billion ($3.8 billion) of energy assets  already facing a rocky road because weak oil prices are depressing the appetite for deals  has become complicated by the surprise departure of its chief executive officer  fund managers said.",
        "date": "06222017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Canada's Cenovus facing tough market for critical asset sales "
    },
    {
        "content": "CALGARY  Alberta Cenovus Energy Inc said on Tuesday it would replace Chief Executive Brian Ferguson  who championed an unpopular purchase of western Canadian oil sands assets  and its shares tumbled nearly 9 percent.",
        "date": "06212017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Cenovus to replace CEO  plans asset sales after unpopular deal "
    },
    {
        "content": "CALGARY  Alberta  June 21 Cenovus Energy Inc's efforts to sell C$5 billion ($3.8 billion) of energy assets  already facing a rocky road because weak oil prices are depressing the appetite for deals  has become complicated by the surprise departure of its chief executive officer  fund managers said.",
        "date": "06222017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "CORRECTED-Canada's Cenovus facing tough market for critical asset sales "
    },
    {
        "content": "TORONTO Cenovus Energy Inc Chief Executive Brian Ferguson said on Tuesday that the company expects to cut some jobs as part of an effort to reduce costs  by C$1 billion ($754 million).",
        "date": "06212017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus CEO says company cut some jobs as it reviews operations "
    },
    {
        "content": "CALGARY  Alberta  June 20 Cenovus Energy Inc said on Tuesday it would replace Chief Executive Brian Ferguson  who championed an unpopular purchase of western Canadian oil sands assets  and its shares tumbled nearly 9 percent.",
        "date": "06202017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 7-Cenovus to replace CEO  plans asset sales after unpopular deal "
    },
    {
        "content": "TORONTO  June 20 Canada's main stock index closed sharply lower on Tuesday as energy stocks  weighed by a decline in oil prices  led the market's broad declines  while Cenovus Energy Inc shares tumbled after the company announced its chief executive was stepping down.",
        "date": "06202017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "CANADA STOCKS-TSX hit as crude prices fall  Cenovus drags "
    },
    {
        "content": "TORONTO  June 20 Cenovus Energy Inc Chief Executive Brian Ferguson said on Tuesday that the company expects to cut some jobs as part of an effort to reduce costs by C$1 billion ($754 million).",
        "date": "06202017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus CEO says company cut some jobs as it reviews operations "
    },
    {
        "content": "TORONTO  June 20 Canada's main stock index fell on Tuesday as energy shares dived with oil prices  while Cenovus Energy Inc tumbled after the company announced plans to replace its chief executive.",
        "date": "06202017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "CANADA STOCKS-TSX falls as oil price drops  Cenovus Energy weighs "
    },
    {
        "content": "CALGARY  Alberta/HOUSTON In the boreal forests and on the remote prairies of Alberta  a handful of firms are running pilot projects they hope will end a two-decade drought in innovation and stem the exodus of top global energy firms from Canada's oil sands.",
        "date": "06202017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Innovators toil to revive Canada oil sands as majors exit "
    },
    {
        "content": "CALGARY  Alberta/HOUSTON  June 19 In the boreal forests and on the remote prairies of Alberta  a handful of firms are running pilot projects they hope will end a two-decade drought in innovation and stem the exodus of top global energy firms from Canada's oil sands.",
        "date": "06202017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "RPT-INSIGHT-Innovators toil to revive Canada oil sands as majors exit "
    },
    {
        "content": "CALGARY  Alberta  June 20 Cenovus Energy Inc will seek on Tuesday to convince investors of the value of an unpopular acquisition this year amid continuing skepticism from shareholders.",
        "date": "06202017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus to face investors amid rift after share decline "
    },
    {
        "content": "June 20 Cenovus Energy Inc said on Tuesday its chief executive  Brian Ferguson  would retire in October  following a more than eight-year stint at the helm of the Canadian oil company.",
        "date": "06202017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus Energy CEO Brian Ferguson to step down "
    },
    {
        "content": "* Cenovus - put forward five-year plan that co expects will generate 14% annualized free funds flow growth through 2021 at wti price of US$55 per barrel",
        "date": "06202017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus says progressing plan to divest non-core assets "
    },
    {
        "content": "* Cenovus president & Chief Executive Officer Brian Ferguson to retire",
        "date": "06202017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus CEO Brian Ferguson to retire "
    },
    {
        "content": "CALGARY  Alberta  June 1 U.S. oil and gas producer Apache Corp is selling Canadian light oil assets to Canada's Cardinal Energy Ltd to focus on high-growth areas like the Permian basin shale play  an Apache spokesman said on Thursday.",
        "date": "06012017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 1-Apache sells Canadian oil assets to Cardinal for C$330 mln "
    },
    {
        "content": "* Says completed acquisition of ConocoPhillips western Canadian assets Further company coverage: (Reporting by Ethan Lou)",
        "date": "05172017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus says completed purchase of ConocoPhillips Canada assets "
    },
    {
        "content": "CALGARY  Alberta  May 4 ConocoPhillips will lay off 300 Canadian workers  mostly in the country's oil capital of Calgary  after selling most of its local assets to local producer Cenovus Energy Inc  the Houston-based company said on Thursday.",
        "date": "05042017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "ConocoPhillips to lay off 300 in Canada after Cenovus deal "
    },
    {
        "content": "May 2 ConocoPhillips reported a quarterly profit on Tuesday  compared with a year-earlier loss  helped by a gain on its sale of oil sands and western Canadian natural gas assets to Cenovus Energy Inc.",
        "date": "05022017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "CORRECTED-UPDATE 1-ConocoPhillips posts profit on asset sale gain "
    },
    {
        "content": "CALGARY  Alberta/TORONTO  April 24 As Cenovus Energy Inc prepares to release first-quarter earnings this week  investors are looking for answers about a recent C$17 billion ($12.6 billion) acquisition that wiped out about a fifth of its market value.",
        "date": "04242017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "PREVIEW-Cenovus earnings overshadowed by unpopular ConocoPhillips deal "
    },
    {
        "content": "April 25 A Cenovus Energy Inc shareholder has asked a Canadian regulator to halt the company's recent C$17 billion ($12.6 billion) purchase of some ConocoPhillips assets  saying the new stock issued to help fund the deal has diluted the value of Cenovus shares.",
        "date": "04252017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus shareholder seeks to halt purchase of ConocoPhillips assets "
    },
    {
        "content": "TORONTO  April 25 A Cenovus Energy Inc shareholder has asked a Canadian regulator to halt the company's recent C$17 billion ($12.6 billion) purchase of some ConocoPhillips assets  saying the new stock issued to help fund the deal has diluted the value of Cenovus shares.",
        "date": "04252017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 1-Cenovus shareholder seeks to halt purchase of ConocoPhillips assets "
    },
    {
        "content": "CALGARY  Alberta  April 26 Cenovus Energy Inc won about 87 percent of shareholders' votes for its board of director slate on Wednesday  below previous near-unanimous approvals  as some voters protested the company's C$17 billion ($12.6 billion) purchase of ConocoPhillips assets.",
        "date": "04262017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 3-Cenovus faces investor displeasure after ConocoPhillips deal "
    },
    {
        "content": "CALGARY  Alberta/TORONTO As Cenovus Energy Inc prepares to release first-quarter earnings this week  investors are looking for answers about a recent C$17 billion ($12.6 billion) acquisition that wiped out about a fifth of its market value.",
        "date": "04252017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus earnings overshadowed by unpopular ConocoPhillips deal "
    },
    {
        "content": "* Says has ability to cut deep basin spending to focus on oil sands",
        "date": "04262017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-No vote on Conocophillips deal because confidentiality -Cenovus "
    },
    {
        "content": "* Says in Q3 will have more information on Suffield and Pelican Lake asset sales",
        "date": "04262017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus says 'not worried' about recent complaint to regulator "
    },
    {
        "content": "* Cenovus delivers strong first quarter operational performance",
        "date": "04262017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus Energy Inc q1 earnings per share $0.25 "
    },
    {
        "content": "* Cenovus delivers strong first quarter operational performance",
        "date": "04262017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus qtrly earnings per share $0.25 "
    },
    {
        "content": "CALGARY  Alberta  April 23 Canada's Cenovus Energy Inc has said it may sell parts of the Deep Basin natural gas assets it recently bought from Houston-based ConocoPhillips  Royal Bank of Canada (RBC) analysts wrote in a research note on Sunday.",
        "date": "04232017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Cenovus may sell parts of acquired natgas assets -analysts "
    },
    {
        "content": "HOUSTON  April 20 ConocoPhillips has beaten its 2017 asset sales target less than four months into the year  after shedding $30.8 billion worth of energy assets in six years.",
        "date": "04202017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "ConocoPhillips takes slow  steady route in race for oil profits "
    },
    {
        "content": "April 26 Canadian oil company Cenovus Energy Inc reported a quarterly profit  compared with a year-ago loss  helped by lower operating costs and higher oil sands production",
        "date": "04262017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus Energy posts quarterly profit "
    },
    {
        "content": "TORONTO  April 11 Cenovus Energy Inc will do more hedging after its acquisition of ConocoPhillips assets  the Canadian company's Chief Executive Brian Ferguson said on Tuesday as he mounted a charm offensive on investors who balked at the deal.",
        "date": "04112017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 2-Cenovus CEO seeks backing as bold bet and market jitters test his legacy "
    },
    {
        "content": "TORONTO  April 11 Cenovus Energy Inc has 75 percent of financing in place for its C$17.7 billion ($13.3 billion) acquisition of ConocoPhillips' oil and gas assets  Cenovus Chief Executive Brian Ferguson said on Tuesday.",
        "date": "04112017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus CEO says investors understand 'strategic rationale' for deal "
    },
    {
        "content": "* Cenovus Energy Inc - acquisition is expected to close in Q2 of this year",
        "date": "04072017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus achieves key acquisition financing milestones "
    },
    {
        "content": "April 4 Cenovus Energy said on Tuesday it priced a $2.9 billion offering of senior notes to fund the acquisition of assets in Western Canada from ConocoPhillips .",
        "date": "04042017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Cenovus prices $2.9 bln debt offering "
    },
    {
        "content": "TORONTO Cenovus Energy Inc's  C$3 billion ($2.25 billion) equity offering to partly fund its planned C$17.7 billion acquisition of some of ConocoPhillips Co's  Canadian assets has been fully subscribed  sources familiar with the situation said on Friday.",
        "date": "03312017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Cenovus C$3 billion offering has been fully subscribed: sources "
    },
    {
        "content": "TORONTO  March 31 Cenovus Energy Inc's C$3 billion ($2.25 billion) equity offering to partly fund its planned C$17.7 billion acquisition of some of ConocoPhillips Co's Canadian assets has been fully subscribed  sources familiar with the situation said on Friday.",
        "date": "03312017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus C$3 billion offering has been fully subscribed - sources "
    },
    {
        "content": "CALGARY  Alberta Cenovus Energy shares had their biggest one-day percentage fall ever on Thursday as investors balked at the company's C$17.7 billion ($13.3 billion) cash and stock deal to buy oil sands and natural gas assets from ConocoPhillips.",
        "date": "03312017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus shares slump on $13 billion deal to buy Conoco's assets "
    },
    {
        "content": "CALGARY  Alberta Cenovus Energy's offer to buy ConocoPhillips oil sands and natural gas assets for C$17.7 billion ($13.27 billion) was unsolicited  a ConocoPhillips Canada spokeswoman said on Thursday.",
        "date": "03312017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "ConocoPhillips says Cenovus made unsolicited offer for oil and gas assets "
    },
    {
        "content": "March 31 Canadian stock futures fell on Friday ahead of GDP data for January  which is expected to show that the economy grew at a similar pace compared to a month earlier.",
        "date": "03312017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "CANADA STOCKS-TSX futures dip as oil slips; GDP data eyed "
    },
    {
        "content": "* Says will review dividends  after acquisition of ConocoPhillips Co assets in Canada Source text for Eikon: Further company coverage: (Reporting by Ethan Lou)",
        "date": "03292017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "BRIEF-Canada's Cenovus to review dividends after buying ConocoPhillips assets "
    },
    {
        "content": "* Cenovus announces $3.0 billion bought-deal offering of common shares",
        "date": "03292017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus announces $3 bln bought-deal offering of common shares "
    },
    {
        "content": "CALGARY  Alberta  March 30 Cenovus Energy shares had their biggest one-day percentage fall ever on Thursday as investors balked at the company's C$17.7 billion ($13.3 billion) cash and stock deal to buy oil sands and natural gas assets from ConocoPhillips.",
        "date": "03302017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 4-Cenovus shares slump on $13 bln deal to buy Conoco's assets "
    },
    {
        "content": "* Cenovus Energy Inc - agreed to acquire ConocoPhillips' 50% interest in FCCL partnership",
        "date": "03292017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus to buy ConocoPhillips' 50 pct interest in FCCL partnership for $17.7 bln "
    },
    {
        "content": "CALGARY  Alberta  March 30 Cenovus Energy's offer to buy ConocoPhillips oil sands and natural gas assets for C$17.7 billion ($13.27 billion) was unsolicited  a ConocoPhillips Canada spokeswoman said on Thursday.",
        "date": "03302017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "ConocoPhillips says Cenovus made unsolicited offer for oil and gas assets "
    },
    {
        "content": "TORONTO  March 30 Canada's main stock index pulled back from a one-month high on Thursday as deal-related news pressured shares of Cenovus Energy Inc and Canadian Imperial Bank of Commerce.",
        "date": "03302017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "CANADA STOCKS-TSX falls as deal news pressures Cenovus  CIBC "
    },
    {
        "content": "March 29 Canada's Cenovus Energy Inc said it would buy ConocoPhillips' 50 percent stake in an oilsands venture owned by the two companies  and some oil and gas assets held by the U.S. company in Alberta and British Columbia for $17.7 billion.",
        "date": "03292017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus to buy oil and gas assets from ConocoPhillips for $17.7 bln "
    },
    {
        "content": "TORONTO  March 30 Canada's main stock index pulled back from a one-month high on Thursday as deal-related news pressured shares of Cenovus Energy Inc and Canadian Imperial Bank of Commerce.",
        "date": "03302017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "CANADA STOCKS-TSX pulls back from 1-month high as Cenovus tumbles "
    },
    {
        "content": "CALGARY  Alberta  March 30 Cenovus Energy shares tumbled more than 11 percent on Thursday after the Canadian company agreed to buy oil sands and natural gas assets from ConocoPhillips for C$17.7 billion ($13.32 billion). Cenovus shares were last trading at C$15.44 on the Toronto Stock Exchange  down 11.5 percent on the day. ($1 = 1.3289 Canadian dollars) (Reporting by Nia Williams)",
        "date": "03302017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "CORRECTED-Cenovus shares slump after C$17.7 billion ConocoPhillips deal "
    },
    {
        "content": "* Canada energy minister  pressed on Cenovus-Conocophillips deal  says \"these are market decisions\"",
        "date": "03302017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Canada energy minister says Cenovus-Conocophillips deal is a market decision "
    },
    {
        "content": "CALGARY  Alberta ConocoPhillips  on Wednesday agreed to sell oil sands and western Canadian natural gas assets to Cenovus Energy Inc  for C$17.7 billion ($13.3 billion)  making it the latest international oil major to pull back from a region where high costs and low crude prices have made it hard for large companies to make an acceptable return.",
        "date": "03302017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "ConocoPhillips sells oil and gas assets to Cenovus for $13.3 billion "
    },
    {
        "content": "CALGARY  Alberta  March 29 ConocoPhillips on Wednesday agreed to sell oil sands and western Canadian natural gas assets to Cenovus Energy Inc for C$17.7 billion ($13.3 billion)  making it the latest international oil major to pull back from a region where high costs and low crude prices have made it hard for large companies to make an acceptable return.",
        "date": "03302017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 4-ConocoPhillips sells oil and gas assets to Cenovus for $13.3 bln "
    },
    {
        "content": "CALGARY  Alberta  Feb 21 ConocoPhillips has revised down over a billion barrels of oil sands reserves because of low global crude prices  a company filing showed on Tuesday  the latest sign that some of Canada's vast hydrocarbon potential may be left untapped.",
        "date": "02222017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 2-ConocoPhillips revises down over 1 bln bbls of oil sands reserves "
    },
    {
        "content": "CALGARY  Alberta Canadian oil and gas producer Cenovus Energy Inc  said on Thursday it is doing engineering and design work at two of its deferred oil sands projects in northern Alberta and it could potentially reactivate them in 2018 and 2019  respectively.",
        "date": "02162017",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Cenovus may restart another two deferred oil sands projects "
    },
    {
        "content": "CALGARY  Alberta  Feb 16 Canadian oil and gas producer Cenovus Energy Inc said on Thursday it is doing engineering and design work at two of its deferred oil sands projects in northern Alberta and it could potentially reactivate them in 2018 and 2019  respectively.",
        "date": "02162017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "CORRECTED-UPDATE 2-Cenovus may restart another two deferred oil sands projects "
    },
    {
        "content": "* Says it is continuing to do engineering and design work on deferred oil sands expansions",
        "date": "02162017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus says has committed to capacity on KXL crude oil pipeline "
    },
    {
        "content": "Feb 16 Canadian oil company Cenovus Energy Inc   swung to a quarterly profit  as production rose and costs fell.",
        "date": "02162017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus Energy swings to profit as production rises "
    },
    {
        "content": "* Qtrly total oil production  219 551 bbls/d versus 199 556 bbls/d",
        "date": "02162017",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus Energy Inc reports qtrly earnings per share $0.11 "
    },
    {
        "content": "CALGARY  Alberta  Oct 27 Canadian oil and gas producer Cenovus Energy Inc said on Thursday it would consider refinery acquisitions in areas including the U.S. Gulf coast region provided the opportunity offered good value and was easily accessible for Canadian crude.",
        "date": "10272016",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 3-Canada's Cenovus says would consider refinery acquisitions "
    },
    {
        "content": "CALGARY  Alberta  Oct 27 Canadian oil and gas producer Cenovus Energy Inc reported a bigger-than-expected third-quarter loss on Thursday due to asset impairment charges resulting from declining heavy oil and natural gas prices.",
        "date": "10272016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "CORRECTED-UPDATE 2-Cenovus Energy reports quarterly loss  trims 2016 capex "
    },
    {
        "content": "* Says it is updating cost estimates on deferred Christina Lake Phase G oil sands project",
        "date": "10272016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus updating cost estimates on deferred oil sands project "
    },
    {
        "content": "Oct 27 Canadian oil producer Cenovus Energy Inc   reported a quarterly loss  compared with profit in the year-ago period  when it recorded a C$1.9 billion ($1.42 billion) after-tax gain.",
        "date": "10272016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Canadian oil producer Cenovus posts quarterly loss "
    },
    {
        "content": "* Qtrly loss per share $0.30  Source text for Eikon:  Further company coverage:",
        "date": "10272016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus Energy Q3 loss per share $0.30 "
    },
    {
        "content": "NEW YORK/HOUSTON  Aug 25 LyondellBasell Industries NV has retained Bank of America Merrill Lynch  to help with the potential sale of its 263 776 barrel-per-day refinery in Houston  according to two people familiar with the talks.",
        "date": "08252016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 1-LyondellBasell retains bank for potential Houston refinery sale -sources "
    },
    {
        "content": "July 28 Cenovus Energy Inc posted a smaller-than-expected quarterly loss  helped by its cost-reduction efforts  and said about two-thirds of the costs it had cut since 2014-end would be \"sustainable\" even when oil prices recover.",
        "date": "07282016",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 1-Cenovus posts smaller-than-expected loss as costs fall "
    },
    {
        "content": "* Remains on track with its plans to bring on two new oil sands expansion phases and achieve up to $500 million in capital",
        "date": "07282016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus Energy reports Q2 loss per share $0.32 "
    },
    {
        "content": "July 28 Canadian oil producer Cenovus Energy Inc  posted a quarterly loss  compared with a year-ago profit  hurt by a slump in oil prices that has now lasted two years.",
        "date": "07282016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Canadian oil producer Cenovus posts quarterly loss "
    },
    {
        "content": "CALGARY  Alberta Oil sands producers Canadian Natural Resources Limited  and Cenovus Energy shut projects and evacuated workers at Pelican Lake facilities in northern Alberta as wildfires threatened western Canadian output for the second time in a five weeks.",
        "date": "06082016",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Wildfire prompts more Canada oil sands production cuts "
    },
    {
        "content": "CALGARY  Alberta Canadian Natural Resources Ltd and Cenovus Energy said they restarted operations at two oil sands facilities in the Wabasca region of northern Alberta on Thursday after a wildfire threat dissipated.",
        "date": "06092016",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Canadian Natural  Cenovus resume Pelican Lake operations after fire threat "
    },
    {
        "content": "CALGARY  Alberta  June 8 Oil sands producers Canadian Natural Resources Limited  and Cenovus Energy  shut projects and evacuated workers at Pelican Lake facilities in northern Alberta as wildfires threatened western Canadian output for the second time in a five weeks.",
        "date": "06082016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 4-Wildfire prompts more Canada oil sands production cuts "
    },
    {
        "content": "CALGARY  Alberta  June 9 Canadian Natural Resources Ltd and Cenovus Energy said they restarted operations at two oil sands facilities in the Wabasca region of northern Alberta on Thursday after a wildfire threat dissipated.",
        "date": "06092016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 1-Canadian Natural  Cenovus resume Pelican Lake operations after fire threat "
    },
    {
        "content": "* Says wildfire near Pelican Lake oil sands project has been downgraded  now being held by firefighters",
        "date": "06082016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus says may be able to restart Pelican Lake output on Thursday "
    },
    {
        "content": "* Says wildfire near facilities continues to burn but is being contained by Alberta firefighters",
        "date": "06092016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus restarting Pelican Lake oil sands operations "
    },
    {
        "content": "CALGARY  Alberta  April 27 Cenovus Energy  is looking into building a diluent recovery unit at its Bruderheim crude-by-rail terminal near Edmonton  Alberta  which would allow the company to ship raw bitumen in tank cars and save on condensate costs.",
        "date": "04272016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus mulling diluent recovery unit at Alberta rail terminal "
    },
    {
        "content": "* Cuts 2016 capital budget by C$300 mln   (Adds CEO comments  financial details  company and industry background)",
        "date": "04272016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 3-Cenovus posts 1st qtr loss  seeks regulatory clarity from Ottawa "
    },
    {
        "content": "* Says Wood River refinery debottleneck project on track to start up Q3 this year  adding 18 000 bpd of crude capacity",
        "date": "04272016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus says seeking regulatory clarity from Canadian gov't "
    },
    {
        "content": "* Cenovus Energy Inc qtrly cash flow earnings per share $0.03",
        "date": "04272016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus posts Q1 operating loss $0.51/shr "
    },
    {
        "content": "April 27 Canadian oil producer Cenovus Energy Inc  reported a smaller quarterly loss  helped mainly by foreign exchange gains.",
        "date": "04272016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus Energy posts smaller loss on foreign exchange gain "
    },
    {
        "content": "CALGARY  Alberta  April 12 Cenovus Energy  said it let go nearly 250 employees on Tuesday as part of a previously announced restructuring  a spokesman said  adding to the tens of thousands of energy industry workers laid off in Canada since oil prices crashed.",
        "date": "04122016",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Cenovus cuts nearly 250 workers as oil sector job losses mount "
    },
    {
        "content": "Canadian oil producer Cenovus Energy Inc  said it may sell up to $5 billion of stock  debt or other securities  a day after it announced a dividend cut  as the company shores up its balance sheet amid a slump in oil prices.",
        "date": "02122016",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Cenovus Energy may sell up to $5 billion in securities amid oil slump "
    },
    {
        "content": "CALGARY  Alberta Canadian oil producer Cenovus Energy Inc  posted a bigger-than-expected quarterly loss and announced a fresh round of cuts to its quarterly dividend  2016 capital budget and workforce on Thursday in response to an incessant fall in oil prices.",
        "date": "02112016",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Cenovus Energy again cuts dividend  2016 budget and jobs "
    },
    {
        "content": "Feb 12 Canadian oil producer Cenovus Energy Inc  said it may sell up to $5 billion of stock  debt or other securities  a day after it announced a dividend cut  as the company shores up its balance sheet amid a slump in oil prices.",
        "date": "02122016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "CORRECTED-UPDATE 1-Cenovus Energy may sell up to $5 bln in securities amid oil slump "
    },
    {
        "content": "* Says plans to further reduce its workforce   (Adds quote  details on divestiture plans; share price)",
        "date": "02112016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 3-Cenovus Energy again cuts dividend  2016 budget and jobs "
    },
    {
        "content": "* Says will probably look at doing deferred maintenance at Foster Creek oil sands project in spring next year",
        "date": "02112016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "BRIEF-Cenovus defers maintenance at Foster Creek oil sands project "
    },
    {
        "content": "Feb 12 Canadian oil producer Cenovus Energy Inc  said it would sell up to $5 billion of stock  debt and other securities in one or more tranches  a day after it cuts its dividend  to shore up cash amid a slump in oil prices.",
        "date": "02122016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus Energy to sell up to $5 bln in securities amid oil slump "
    },
    {
        "content": "Feb 11 Canadian oil producer Cenovus Energy Inc  reported a bigger quarterly loss and also cut its dividend and 2016 capital spending budget amid a prolonged slump in oil prices.",
        "date": "02112016",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus Energy reports bigger loss; cuts dividend "
    },
    {
        "content": "* Expects OK for advanced phase of Christina Lake project soon   (Adds CEO comments  conference call details; updates share activity)",
        "date": "12102015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 2-Cenovus Energy to lower capex in 2016; no changes to dividend "
    },
    {
        "content": "Dec 10 Canadian oil producer Cenovus Energy Inc  said it expects to spend between C$1.4 billion ($1.03 billion) and C$1.6 billion in 2016  19 percent lower than its estimated budget for this year  in response to a steep decline in crude prices.",
        "date": "12102015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus Energy to lower capital spending in 2016 "
    },
    {
        "content": "Cenovus Energy Inc  has achieved 700 job cuts for the second half of 2015  double the number it forecast in July  the Canadian oil producer said on Thursday.",
        "date": "10292015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Cenovus Energy exceeds job-cut target  shares rise "
    },
    {
        "content": "Oct 29 Cenovus Energy Inc has achieved 700 job cuts for the second half of 2015  double the number it forecast in July  the Canadian oil producer said on Thursday.",
        "date": "10292015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 3-Cenovus Energy exceeds job-cut target  shares rise "
    },
    {
        "content": "Oct 29 Canadian oil producer Cenovus Energy Inc  reported a five-fold rise in net quarterly profit  mainly due to a gain of C$1.9 billion ($1.44 billion) from divesting its royalty and fee land business.",
        "date": "10292015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus net profit jumps on gain from sale of royalty unit "
    },
    {
        "content": "CALGARY  Alberta  Sept 30 Oil sands producer Cenovus Energy is setting up its first marketing desk outside Canada in Houston  Texas  to sell more of its heavy crude to refineries in the Gulf Coast region  the company said on Wednesday.",
        "date": "09302015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Canada's Cenovus opening crude marketing desk in Houston "
    },
    {
        "content": "CALGARY  Alberta  Sept 9 Canadian Oil Sands Ltd   the largest stakeholder in the Syncrude oil sands project  said on Wednesday it had reviewed selling a small portion of its future production but decided against the option for now.",
        "date": "09092015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Canadian Oil Sands says no plan to sell future production "
    },
    {
        "content": "Cenovus Energy Inc   Canada's No. 2 independent oil producer  on Thursday slashed its quarterly dividend by 40 percent and said it would cut 300 to 400 jobs to further reduce costs because of slumping crude prices.",
        "date": "07302015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Cenovus Energy to cut jobs  dividend amid oil price slump "
    },
    {
        "content": "July 30 Cenovus Energy Inc  Canada's No. 2 independent oil producer  on Thursday slashed its quarterly dividend by 40 percent and said it would cut 300 to 400 jobs to further reduce costs because of slumping crude prices.",
        "date": "07302015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 3-Cenovus Energy to cut jobs  dividend amid oil price slump "
    },
    {
        "content": "July 30 Cenovus Energy Inc  Canada's No.2 independent oil producer  reported an 80 percent fall in quarterly profit  hurt by a steep decline in oil prices.",
        "date": "07302015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus Energy profit plunges 80 pct amid crude slump "
    },
    {
        "content": "TORONTO Cenovus Energy Inc   Canada's second-largest independent oil producer  said on Tuesday it has agreed to sell its portfolio of oil and gas royalty properties to Ontario Teachers' Pension Plan for about C$3.3 billion ($2.66 billion).",
        "date": "06302015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Cenovus to sell royalty portfolio to Ontario Teachers' for $2.66 billion "
    },
    {
        "content": "TORONTO  June 30 Cenovus Energy Inc  Canada's second-largest independent oil producer  said on Tuesday it has agreed to sell its portfolio of oil and gas royalty properties to Ontario Teachers' Pension Plan for about C$3.3 billion ($2.66 billion).",
        "date": "06302015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 2-Cenovus to sell royalty portfolio to Ontario Teachers' for C$3.3 bln "
    },
    {
        "content": "June 30 Canadian oil producer Cenovus Energy Inc   said it would sell its royalty business  Heritage Royalty Limited Partnership  to Ontario Teachers' Pension Plan.",
        "date": "06302015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus to sell royalty business to Ontario Teachers' "
    },
    {
        "content": "TORONTO  June 19 Cenovus Energy Inc   confirmed on Friday it is in discussions with another party about the sale of its royalty interest and mineral fee title lands.",
        "date": "06192015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Cenovus confirms it is in talks to sell royalty lands "
    },
    {
        "content": "TORONTO/CALGARY  June 18 Cenovus Energy Inc  is in exclusive talks to sell   Canadian oil and gas royalty lands to the Ontario Teachers' Pension Plan in a deal that could fetch C$2.5 billion to C$3 billion ($2.45 billion)  according to four sources familiar with the matter.",
        "date": "06182015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "EXCLUSIVE-Cenovus in exclusive talks with Teachers' fund on land assets -sources "
    },
    {
        "content": "June 11 Cenovus Energy Inc said it had resumed normal operations at its Foster Creek oil sands site in Alberta after a forest fire led to a precautionary shutdown on May 23.",
        "date": "06112015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Cenovus resumes operations at Foster Creek oil sands site "
    },
    {
        "content": " ",
        "date": "06082015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 1-CNRL says fire-affected output in Alberta oil sands to return this week "
    },
    {
        "content": "CALGARY  Alberta  June 4 Cenovus Energy Inc   Canada's No. 2 independent oil producer  has agreed to buy the Bruderheim  Alberta  crude-by-rail terminal from Canexus Corp for C$75 million in cash  the two companies said on Thursday.",
        "date": "06042015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 1-Cenovus to buy Alberta oil train terminal from Canexus for C$75 mln "
    },
    {
        "content": "CALGARY  Alberta  June 4 Cenovus Energy Inc   Canada's No. 2 independent oil producer  has agreed to buy the Bruderheim  Alberta  crude-by-rail terminal from Canexus Corp for C$75 million in cash  the two companies said on Thursday.",
        "date": "06042015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus to buy Alberta oil train terminal from Canexus for C$75 mln "
    },
    {
        "content": "CALGARY  Alberta  June 2 Cenovus Energy Inc  said on Tuesday that production from its 135 000 barrel per day Foster Creek oil sands project is \"still days away\" from resuming normal operations after the site was evacuated for more than a week because of nearby wildfires in northeastern Alberta.",
        "date": "06022015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Cenovus says production at evacuated oil sands site \"days away\" "
    },
    {
        "content": "CALGARY  Alberta  June 4 Production at two of Canada's major oil sands operations remained suspended on Thursday as wildfires continue to rage in northern Alberta.",
        "date": "06042015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "CNRL  Cenovus wait to resume oil production lost to wildfires "
    },
    {
        "content": "CALGARY  Alberta  June 1 Firefighters made progress battling wildfires in northern Alberta on Monday that have shut in 10 percent of total oil sands production  and workers began returning to some sites to assess damage.",
        "date": "06022015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 2-CNRL  Cenovus return to oil sands sites  fires still burn "
    },
    {
        "content": "CALGARY  Alberta Statoil ASA  MEG Energy Corp and Cenovus Energy Inc evacuated hundreds of workers from three oil sands projects in northeastern Alberta on Tuesday as wildfires raged through the key crude-producing region.",
        "date": "05272015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Hundreds more oil sands staff evacuated on Alberta fire threat "
    },
    {
        "content": "CALGARY  Alberta  May 26 Statoil ASA  MEG Energy Corp and Cenovus Energy Inc  evacuated hundreds of workers from three oil sands projects in northeastern Alberta on Tuesday as wildfires raged through the key crude-producing region.",
        "date": "05262015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 4-Hundreds more oil sands staff evacuated on Alberta fire threat "
    },
    {
        "content": "CALGARY  Alberta  May 26 Cenovus Energy Inc  evacuated all 90 workers from its Narrows Lake oil sands project in northeastern Alberta on Tuesday as a precaution against wildfires  the company said.",
        "date": "05262015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 1-Cenovus evacuates all workers from Narrows Lake oil sands project "
    },
    {
        "content": "CALGARY  Alberta  May 26 Cenovus Energy Inc  evacuated all 90 workers from its Narrows Lake oil sands project in northeastern Alberta on Tuesday as a precaution against wildfires raging in the region  the company said.",
        "date": "05262015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus evacuates all workers from Narrows Lake oil sands project "
    },
    {
        "content": "May 24 Cenovus Energy Inc has evacuated about 1 800 workers and shut down production at its Foster Creek oil sands site in Alberta as a precaution because of a nearby forest fire  the company said.",
        "date": "05242015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 1-Cenovus evacuates oil sands project due to nearby forest fire "
    },
    {
        "content": "CALGARY  Alberta  May 25 A wildfire raging in northeastern Alberta has shut down around 233 000 barrels per day (bpd) of production at three oil sands projects and is expected to remain out of control for \"some while yet \" a provincial government spokesman said on Monday.",
        "date": "05252015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 2-Wildfire shuts down about 9 pct of Alberta crude output "
    },
    {
        "content": "May 24 Cenovus Energy Inc has evacuated about 1 800 workers and shut down production at its Foster Creek oil sands site in Alberta as a precaution because of a nearby forest fire  the company said.",
        "date": "05242015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus evacuates oil sands project due to nearby forest fire "
    },
    {
        "content": "April 29 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "04292015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "CALGARY  Alberta  April 29 Cenovus Energy Inc   Canada's No.2 independent oil producer  said on Wednesday it has no plans to tinker with its dividend despite reporting an unexpectedly large quarterly loss due to weak oil prices.",
        "date": "04292015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 2-Cenovus says dividend safe despite loss on low oil prices "
    },
    {
        "content": "CALGARY  Alberta  April 29 Cenovus Energy Inc  will sell or spin off its wholly-owned oil and gas lands when it believes market value for the properties meet its expectations  Chief executive Brian Ferguson said on Wednesday.",
        "date": "04292015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus says will divest royalty lands when values right "
    },
    {
        "content": "April 29 - Cenovus Energy Inc  Canada's No.2 independent oil producer  said it expects operating expenses to be at the near the low end of its forecast range for 2015.",
        "date": "04292015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus says expenses to be at low end of 2015 forecast "
    },
    {
        "content": "April 23 Cenovus Energy Inc  Canada's second-largest independent oil producer  has hired bankers to explore a sale or initial public offering of its royalty lands in Western Canada  a company spokesman told Reuters.",
        "date": "04232015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Canada's Cenovus hires bankers to explore sale/IPO of some assets "
    },
    {
        "content": "CALGARY  Alberta  Feb 17 Cenovus Energy Inc   Canada's No. 2 independent oil producer  said on Tuesday it has agreed to sell 67.5 million shares to a group of underwriters as it seeks to raise about C$1.5 billion ($1.21 billion) for its 2015 capital spending budget as oil prices remain weak.",
        "date": "02172015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "Cenovus to raise up to C$1.73 bln through share sale "
    },
    {
        "content": "CALGARY  Alberta  Feb 12 Cenovus Energy Inc   Canada's second-largest independent oil producer  said on Thursday it will cut about 800 jobs and may slash its 2015 capital budget for a third time if oil  prices continue to weaken.",
        "date": "02122015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 2-Canada's Cenovus Energy to cut 800 jobs as losses deepen "
    },
    {
        "content": "* Shares rise as much as 13 pct   (Adds details from conference call  updates shares)",
        "date": "02122015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "UPDATE 3-Hercules Offshore cuts jobs  salaries to rein in costs "
    },
    {
        "content": "CALGARY  Alberta  Feb 12 Cenovus Energy Inc   Canada's No. 2 independent oil producer  said on Thursday that it could cut another C$500 million ($400.6 million) from its 2015 capital spending budget if oil prices fall further.",
        "date": "02122015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus Energy says it has room for further spending cuts "
    },
    {
        "content": "Feb 12 Cenovus Energy Inc  Canada's second-largest independent oil producer  said it would cut 15 percent jobs and reported a much bigger quarterly loss  hurt by weak oil prices.",
        "date": "02122015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Cenovus Energy to cut 15 pct jobs  reports bigger loss "
    },
    {
        "content": "Jan 28 Cenovus Energy Inc Canada's No. 2 independent oil producer  cut its 2015 capital budget by C$700 million ($562.5 million) on Wednesday  blaming plunging crude oil prices.",
        "date": "01282015",
        "name": "Cenovus Energy Inc",
        "news_type": "topStory",
        "symbol": "CVE",
        "title": "UPDATE 2-Cenovus Energy deepens 2015 budget cuts as oil prices dive "
    },
    {
        "content": "Jan 28 Cenovus Energy Inc  Canada's No. 2 independent oil producer  cut its capital spending budget for 2015 in response to the slump in crude oil prices.",
        "date": "01282015",
        "name": "Cenovus Energy Inc",
        "news_type": "normal",
        "symbol": "CVE",
        "title": "Oil producer Cenovus Energy cuts 2015 capital spending "
    }
]