[
    {
        "content": "* CVS Health Corp - ‍has set a goal of hiring 5 000 new apprentices by 2022​",
        "date": "11142017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health sets goal of hiring 5 000 new apprentices by 2022​ "
    },
    {
        "content": "* Amazon also expected to muscle in on prescription drugs (Adds details of online mail order in OTC  prescription drugs)",
        "date": "11152017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 2-Bayer hires new blood to stem 'Amazon effect' in consumer health "
    },
    {
        "content": "* Makes overdose-reversal drug available without individual prescription at CVS pharmacy locations in Michigan",
        "date": "11092017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health makes overdose-reversal drug available without individual prescription "
    },
    {
        "content": "Drug distributor McKesson Corp  said on Monday it would buy drugstore operator CVS Health Corp's  unit that provides various tailored services to pharma firms in a $735 million deal to expand the range of services it offers.",
        "date": "11062017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "Drug distributor McKesson to buy CVS Health's services unit "
    },
    {
        "content": "Nov 6 Drug distributor McKesson Corp said on Monday it would buy drugstore operator CVS Health Corp's unit that provides various tailored services to pharma firms in a $735 million deal to expand the range of services it offers.",
        "date": "11062017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 2-Drug distributor McKesson to buy CVS Health's services unit "
    },
    {
        "content": "* Q3 revenue $1.125 billion versus I/B/E/S view $1.16 billion",
        "date": "11062017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-Diplomat Pharmacy announces 3rd quarter financial results "
    },
    {
        "content": "Nov 6 Drug distributor McKesson Corp said on Monday it would buy rival CVS Health Corp's unit in a deal valued at $735 million in cash.",
        "date": "11062017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Drug distributor McKesson to buy CVS Health's unit for $735 mln "
    },
    {
        "content": "U.S. drugstore chain CVS Health Corp  said on Monday it would start next-day delivery from its stores in 2018  a move some analysts said was in response to Amazon.com's  potential entry into prescription drug sales.",
        "date": "11062017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS to start next-day delivery as Amazon threat looms "
    },
    {
        "content": "Nov 6 U.S. drugstore chain CVS Health Corp said on Monday it would start next-day delivery from its stores in 2018  a move some analysts said was in response to Amazon.com's potential entry into prescription drug sales.",
        "date": "11062017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 3-CVS to start next-day delivery as Amazon threat looms "
    },
    {
        "content": "* In presentation-  expects FY revenue growth of 3.25-3.75 pct‍​",
        "date": "11062017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health in presentation- Expects FY revenue growth of 3.25-3.75 pct‍​ "
    },
    {
        "content": "Nov 6 CVS Health Corp  which is said to have offered to buy health insurer Aetna Inc  reported a 17 percent drop in quarterly profit on Monday  hurt by lower prices and reimbursements in its pharmacy business.",
        "date": "11062017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS Health's profit drops 17 pct "
    },
    {
        "content": "U.S. pharmacy operator CVS Health Corp  and health insurer Aetna Inc  are working toward finalizing merger terms and announcing a deal for more than $70 billion as early as December  according to people familiar with the matter.",
        "date": "11032017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS  Aetna aim to finalize deal as early as December: sources "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Aetna's third-quarter results lay out its insurance value for CVS Health. Revenue at the $56 billion health-coverage firm fell 5 percent in the three months to the end of September  partly from dumping some Obamacare policies. But profit jumped 48 percent as the company kept costs under control. That offers alluring protection for CVS  whose pharmacy and drug-benefit business is threatened by rising competition and transparency.",
        "date": "10312017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "Breakingviews - Aetna lays out its insurance value for CVS "
    },
    {
        "content": "NEW YORK  Oct 29 The proposed merger between U.S. pharmacy operator CVS Health Corp and No. 3 health insurer Aetna Inc represents a $66 billion bet that insurers can drive down high U.S. drug prices by cutting out the middleman.",
        "date": "10292017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS bid for Aetna: A $66 billion bet on cutting drug costs "
    },
    {
        "content": "Nov 3 U.S. pharmacy operator CVS Health Corp and health insurer Aetna Inc are working toward finalizing merger terms and announcing a deal for more than $70 billion as early as December  according to people familiar with the matter.",
        "date": "11032017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 1-CVS  Aetna aim to finalize deal as early as December -sources "
    },
    {
        "content": "U.S. health insurer Aetna Inc failed to provide any hints on reported merger talks with CVS Health Corp when discussing quarterly results on Tuesday and laid out obstacles to 2018 earnings growth  sending its shares lower.",
        "date": "10312017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Aetna silent on CVS bid reports  flags tax hit in 2018 "
    },
    {
        "content": "NEW YORK  Nov 3 U.S. pharmacy operator CVS Health Corp and health insurer Aetna Inc are working toward finalizing merger terms and announcing a deal for more than $70 billion as early as December  according to people familiar with the matter.",
        "date": "11032017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS  Aetna aim to finalize deal as early as December -sources "
    },
    {
        "content": "NEW YORK  Oct 31 Aetna Inc Chief Executive Mark Bertolini on Tuesday said during an analyst conference call to discuss third-quarter results that the company would not discuss rumor or speculation  referencing recent source-based reports that it was in merger talks with CVS Health Corp.",
        "date": "10312017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Aetna CEO declines to discuss CVS bid reports on conference call "
    },
    {
        "content": "NEW YORK CVS Health Corp’s planned US$66bn buy of Aetna Inc is poised to boost the healthcare sector’s share of US investment-grade mergers and acquisitions lending beyond its current one-third share of the US$122bn total as the sector remains a bright spot in an otherwise lackluster market.",
        "date": "11032017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "U.S. healthcare brightens tame U.S. high-grade M&A lending "
    },
    {
        "content": "NEW YORK  Nov 3 CVS Health Corp’s planned US$66bn buy of Aetna Inc is poised to boost the healthcare sector’s share of US investment-grade mergers and acquisitions lending beyond its current one-third share of the US$122bn total as the sector remains a bright spot in an otherwise lackluster market.",
        "date": "11032017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "LPC: US healthcare brightens tame US high-grade M&A lending "
    },
    {
        "content": "U.S. pharmacy operator CVS Health Corp's  move to buy health insurer Aetna Inc  could shore-up CVS' vulnerable pharmacy business and spur another round of dealmaking in an industry fearing Amazon's arrival  analysts said. | Video ",
        "date": "10272017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS deal for Aetna could help retailer face Amazon entry: analysts "
    },
    {
        "content": "Oct 26 U.S. pharmacy operator CVS Health Corp has made an offer to acquire No. 3 U.S. health insurer Aetna Inc for more than $200 per share  or over $66 billion  people familiar with the matter said on Thursday.",
        "date": "10262017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "UPDATE 3-CVS makes more than $66 billion bid for Aetna -sources "
    },
    {
        "content": "* CVS Health introduces new PBM performance-based pharmacy network focused on reducing costs and improving clinical outcomes",
        "date": "10242017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health introduces new PBM performance-based pharmacy network "
    },
    {
        "content": "Oct 27 U.S. pharmacy operator CVS Health Corp's move to buy health insurer Aetna Inc could shore-up CVS' vulnerable pharmacy business and spur another round of dealmaking in an industry fearing Amazon's arrival  analysts said.",
        "date": "10272017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 1-CVS deal for Aetna could help retailer face Amazon entry - analysts "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - A bid for Aetna is a defensive prescription for CVS Health. The drugstore and pharmacy-benefit company should be able to generate some cost savings if its $66 billion offer for the health insurer prevails. Even more important  it could help the firm resist Amazon’s entry into drug distribution  and the unpleasant side effects of transparency and low margins that may follow.",
        "date": "10262017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Breakingviews - Aetna bid is a defensive prescription for CVS "
    },
    {
        "content": "NEW YORK The Dow and S&P 500 advanced on Thursday after a round of positive corporate earnings announcements  but gains were curbed and the Nasdaq lost ground on a drop in the healthcare sector. | Video ",
        "date": "10262017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Dow  S&P gain but Nasdaq dips as healthcare lags "
    },
    {
        "content": "Oct 26 U.S pharmacy operator CVS Health Corp has made an offer to acquire U.S. health insurer Aetna Inc for more than $200 per share  a person familiar with the matter said on Thursday.",
        "date": "10262017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS makes bid for Aetna-source "
    },
    {
        "content": "U.S. pharmacy operator CVS Health Corp has made an offer to acquire No. 3 U.S. health insurer Aetna Inc for more than $200 per share  or over $66 billion  people familiar with the matter said on Thursday. | Video ",
        "date": "10272017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS makes more than $66 billion bid for Aetna: sources "
    },
    {
        "content": "* Dow up 0.31 pct  S&P 500 up 0.13 pct  Nasdaq down 0.11 pct (Updates to market close)",
        "date": "10262017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "US STOCKS-Dow  S&P gain but Nasdaq dips as healthcare lags "
    },
    {
        "content": "Oct 27 U.S. pharmacy operator CVS Health Corp's move to buy health insurer Aetna Inc will broaden their reach in the industry and could spark another round of dealmaking in a sector dreading Amazon's arrival  analysts said.",
        "date": "10272017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS-Aetna deal gets Wall Street thumbs up amid Amazon entry fears "
    },
    {
        "content": "Drug retailer CVS Health Corp  is in talks to buy health insurer Aetna Inc   the Wall Street Journal reported on Thursday  citing sources.",
        "date": "10262017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS Health in talks to buy health insurer Aetna: WSJ "
    },
    {
        "content": "Oct 26 Drug retailer CVS Health Corp is in talks to buy health insurer Aetna Inc  the Wall Street Journal reported on Thursday  citing sources.",
        "date": "10262017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS Health in talks to buy health insurer Aetna - WSJ "
    },
    {
        "content": "* CVS has proposed to acquire AETNA for more than $200 per share - CNBC citing DJ‍​ Further company coverage:",
        "date": "10262017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS has proposed to acquire Aetna for more than $200 per share - CNBC  citing DJ‍​ "
    },
    {
        "content": "Oct 26 ‍​ * CVS Health in talks to buy Aetna - CNBC  citing DJ ‍​ ",
        "date": "10262017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health in talks to buy Aetna - CNBC  citing DJ ‍​ "
    },
    {
        "content": "Oct 18 Health insurer Anthem Inc will start managing its billions of dollars of patient prescriptions itself in 2020  it said on Wednesday  ending a deal with Express Scripts Holding that had deteriorated into lawsuits over terms.",
        "date": "10182017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CORRECTED-UPDATE 2-Health insurer Anthem takes pharmacy business in house  taps CVS to help "
    },
    {
        "content": "* CVS Health signs five-year agreement with anthem  inc. To provide services to support ingeniorx",
        "date": "10182017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health signs five-year agreement with Anthem "
    },
    {
        "content": "Oct 18 Drug retailer CVS Health Corp said on Wednesday it entered into an agreement with Anthem Inc to provide services to the health insurer's newly launched pharmacy benefit management (PBM) business  IngenioRx.",
        "date": "10182017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Anthem signs agreement with CVS Health for new PBM business "
    },
    {
        "content": "Shares of drug retailers Walgreens Boots Alliance Inc   CVS Health Corp  and Rite Aid Corp  tumbled on Friday after reports that Amazon.com Inc  was looking to make a move into selling drugs online.",
        "date": "10062017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "Drug chains tumble on reports Amazon eyeing their pie "
    },
    {
        "content": "* Says \"in addition to our legacy opioid-abuse prevention programs  we are adding a new suite of tools‍​\"‍​",
        "date": "09212017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health responds to opioid situation in the U.S. "
    },
    {
        "content": "By Nate Raymond A federal judge has dismissed a class action lawsuit accusing pharmacy chain CVS Health Corp of systematically overcharging people who bought generic drugs using insurance rather than cash.",
        "date": "09062017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS defeats generic drug overcharging class action "
    },
    {
        "content": "CVS Health Corp forecast current quarter profit below Wall Street estimates and said it has been ordered to cooperate with investigations into possible false claims submitted to a government healthcare program and drug pricing.",
        "date": "08082017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS Health's dull third-quarter forecast overshadows profit beat "
    },
    {
        "content": "* Shares down 1.4 pct (Adds investor comment  company response; updates shares)",
        "date": "08082017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 3-CVS Health's dull Q3 forecast overshadows profit beat "
    },
    {
        "content": "* CVS Health Corp - in July 2017  co received a civil investigative demand from the attorney general of Minnesota - sec filing",
        "date": "08082017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health received civil investigative demand from Attorney General of Minnesota "
    },
    {
        "content": "* Q2 gaap earnings per share $1.07 from continuing operations",
        "date": "08082017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health reports Q2 GAAP earnings per share $1.07 from continuing operations "
    },
    {
        "content": "Aug 8 CVS Health Corp  the No.2 U.S. drugstore chain by store count  reported an 18.8 percent rise in quarterly profit on Tuesday  as its pharmacy benefits management business serviced more claims and demand for its specialty pharmacy services rose.",
        "date": "08082017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS Health's quarterly profit jumps 19 pct "
    },
    {
        "content": "* Wellcare Health Plans CFO says company and CVS Health have agreed to extend their pharmacy benefit manager agreement for 2019 and 2020 - Conf Call Further company coverage:",
        "date": "08042017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-Wellcare Health Plans CFO says company and CVS Health have agreed to extend their pharmacy benefit manager agreement for 2019 and 2020 "
    },
    {
        "content": "COPENHAGEN  Aug 2 U.S. pharmacy benefit manager (PBM)  CVS Health  said late Tuesday it had kept Novo Nordisk's key drugs on its 2018 list  removing some uncertainty over the U.S. market for the world's top insulin maker.",
        "date": "08022017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "Two biggest U.S. drug purchasers keep key Novo Nordisk drugs on 2018 list "
    },
    {
        "content": "* Zubsolv gains preferred position on CVS Caremark 2018 formulary",
        "date": "08022017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-Orexo says Zubsolv gains preferred position on CVS Caremark 2018 formulary "
    },
    {
        "content": "July 11 CVS Health Corp has paid $5 million to resolve allegations that pharmacies it operates in California failed to keep and maintain accurate records of prescription drugs  the U.S. Justice Department said on Tuesday. (Reporting by Nate Raymond in Boston; Editing by Andrew Hay)",
        "date": "07112017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS to pay $5 million to resolve U.S. drug probe "
    },
    {
        "content": "July 11 CVS Health Corp has paid $5 million to resolve allegations that pharmacies it operates in California failed to keep and maintain accurate records of prescription drugs  the U.S. Justice Department said on Tuesday.",
        "date": "07112017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 1-CVS to pay $5 million to resolve U.S. drug probe "
    },
    {
        "content": "* BioDelivery Sciences announces agreement with CVS/Caremark for Belbuca® and Bunavail® through 2020",
        "date": "06212017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-BioDelivery Sciences announces agreement with CVS/Caremark for Belbuca  Bunavail "
    },
    {
        "content": "By Jim Christie Midwestern grocery market chain Marsh Supermarkets said in court papers on Wednesday it had reached a deal with subsidiaries of CVS Health Corp that will keep its $24 million bankruptcy sale to Topvalco Inc and Generative Growth II LLC on track. The deal settles a dispute that arose from Marsh's separate sale of its pharmacy business to the units of the pharmacy chain.",
        "date": "06222017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "Bankrupt Marsh Supermarkets  CVS resolve dispute over pharmacies "
    },
    {
        "content": "BOSTON  May 26 CVS Health Corp's Omnicare unit has agreed to pay $23 million to resolve a long-running whistleblower lawsuit alleging that it took kickbacks from a drugmaker  according to settlement papers released on Friday. (Reporting by Nate Raymond in Boston)",
        "date": "05262017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS's Omnicare to pay $23 million to resolve U.S. kickback case "
    },
    {
        "content": "CVS Health Corp  reported a bigger-than-expected quarterly profit as higher margins in its pharmacy business helped offset the loss of major contracts last year.",
        "date": "05022017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS Health's profit beats as pharmacy margins rise "
    },
    {
        "content": "* Pharmacy gross margins up 35 bps (Adds details from conference call  share move)",
        "date": "05022017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 2-CVS Health's profit beats as pharmacy margins rise "
    },
    {
        "content": "* In presentation -  already have some PBM contract wins for ’18",
        "date": "05022017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health on conf call- Have net new PBM business of about $5.4 bln in 2017 "
    },
    {
        "content": "* CVS Health reports first quarter results; confirms 2017 eps guidance",
        "date": "05022017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health reports Q1 adjusted earnings per share $1.17 "
    },
    {
        "content": "May 2 Drugstore chain and pharmacy benefits manager CVS Health Corp reported a 17 percent drop in quarterly profit  as it filled fewer prescriptions at its pharmacies and lower traffic hurt sales at the front-end of its stores.",
        "date": "05022017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Drugstore chain CVS posts 17 pct drop in profit "
    },
    {
        "content": "* By end of 2019  chemicals like parabens  phthalates in products within CVS Health  Beauty 360 Essence of Beauty  other products to be removed",
        "date": "04192017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Pharmacy removes certain chemicals from its beauty and personal care products "
    },
    {
        "content": "* CVS Health expands its policy and external affairs team; bolsters presence in d.c. And state capitals",
        "date": "04062017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health expands policy and external affairs team "
    },
    {
        "content": "* CVS Health Corp- CEO Larry J. Merlo's 2016 total compensation $18.4 million - sec filing Source text (http://bit.ly/2oI0qMc) Further company coverage:",
        "date": "03312017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health - CEO Larry J.Merlo's 2016 total compensation $18.4 mln "
    },
    {
        "content": "* CVS Health -confirmed that contract to provide specialty pharmacy services for Blue Cross  Blue Shield Federal Employee Program will terminate at end of 2017",
        "date": "03312017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS says specialty pharmacy services contract for Blue Cross  Blue Shield Federal Employee Program will terminate at end of 2017 "
    },
    {
        "content": "A federal judge has denied a bid by CVS Health Corp customers for class certification in a $1.23 billion lawsuit accusing the pharmacy chain of systematically overcharging people who bought generic drugs using insurance rather than cash.",
        "date": "03232017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS beats class certification bid in generic drug overcharging case "
    },
    {
        "content": "(Reuters Health) - - The retail pharmacy company CVS Health helped its customers quit smoking by pulling cigarettes off the shelves two years ago  a new study suggests.",
        "date": "03202017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "When CVS stopped selling cigarettes  some customers quit smoking "
    },
    {
        "content": "* CVS Health Corp says will launch reduced RX  a prescription savings program that will offer discounts on certain medications",
        "date": "03162017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health to launch reduced RX "
    },
    {
        "content": "* CVS Health PBM clients achieved lowest prescription drug trend in four years  despite rising drug prices",
        "date": "03152017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health says caremark clients saw prescription drug trend drop to avg. of 3.2 pct in 2016 "
    },
    {
        "content": "Feb 22 CVS Health Corp said its pharmacy chain had removed artificial trans fats  which have been linked to rising rates of heart diseases  from its store-branded food products well ahead of a June 2018 federal deadline.",
        "date": "02222017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS removes artificial trans fats from its food brands "
    },
    {
        "content": "Drugstore chain and pharmacy benefits manager CVS Health Corp  defended the industry on Thursday  saying any suggestion that PBMs are causing drug prices to rise was \"simply erroneous\".",
        "date": "02092017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS defends PBM industry against drug price hikes "
    },
    {
        "content": "* Q4 revenue rises 11.7 pct to $45.97 bln vs. est. $46.50 bln",
        "date": "02092017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 3-CVS defends PBM industry against drug price hikes "
    },
    {
        "content": "* Qtrly same store sales decreased 0.7 pct versus prior year  with pharmacy same store sales up 0.2 pct",
        "date": "02092017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health reports Q4 adj. EPS $1.71 "
    },
    {
        "content": "Feb 9 Drugstore chain and pharmacy benefits manager CVS Health Corp reported an 11.7 percent rise in quarterly revenue on Thursday  helped by strength in its PBM business.",
        "date": "02092017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS Health quarterly revenue rises 11.7 pct "
    },
    {
        "content": "Independent pharmacies that have brought lawsuits accusing pharmacy benefit managers CVS Caremark and Express Scripts of conspiring to pay them less than chain pharmacies cannot bring their claims as class actions  a federal judge has ruled.",
        "date": "01192017",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "Pharmacies lose class status bid in antitrust lawsuits against Caremark  Express Scripts "
    },
    {
        "content": "Drugstore chain CVS Health Corp  has cut the price of a generic version of Impax Laboratories Inc's  emergency allergy injection  a device similar to Mylan NV's  controversial EpiPen.",
        "date": "01122017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS slashes price of Impax's EpiPen rival "
    },
    {
        "content": "Jan 12 Drugstore chain CVS Health Corp  has cut the price of a generic version of Impax Laboratories Inc's emergency allergy injection  a device similar to Mylan NV's controversial EpiPen.",
        "date": "01122017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CORRECTED-UPDATE 1-CVS slashes price of Impax's EpiPen rival "
    },
    {
        "content": "Jan 12 Drugstore chain CVS Health Corp  has cut the price of a generic version of Impax Laboratories Inc's emergency allergy injection  a device similar to Mylan NV's controversial Epipen.",
        "date": "01122017",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CORRECTED-CVS slashes price of Impax's emergency allergy shot "
    },
    {
        "content": "Drugstore chain and pharmacy benefits manager CVS Health Corp  cut its profit forecast for this year and projected weak growth for 2017  saying it expected to lose more than 40 million retail prescriptions to other pharmacy chains  sending its shares down as much as 17 percent to a more than two-year low. | Video ",
        "date": "11082016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS cuts forecast after contract losses to Walgreens  shares dive "
    },
    {
        "content": "Nov 3 CVS Health Corp said it would cut about 600 jobs  mostly at its corporate offices in Rhode Island  Illinois and Arizona over the next two months  citing an increasingly competitive environment.",
        "date": "11032016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS Health to cut about 600 jobs over next two months "
    },
    {
        "content": "* Shares fall to a more than 2-year low   (Adds Breakingviews link; updates shares)",
        "date": "11082016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 4-CVS cuts forecast after contract losses to Walgreens  shares dive "
    },
    {
        "content": "* Q3 GAAP earnings per share $1.43 from continuing operations",
        "date": "11082016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS reports Q3 adjusted EPS of $1.64 "
    },
    {
        "content": "* CVS Health executive says for Q4 2016 total same-store sales at retail are expected to be flat to down 1.75 percent -conf call",
        "date": "11082016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS says \"Caught a little bit off guard\" in bid process for Prime  TRICARE network "
    },
    {
        "content": "* CVS Health Corp - eliminating a small percentage of positions at CVS health in November and December 2016",
        "date": "11032016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health says eliminating small percentage of positions in Nov and Dec 2016 "
    },
    {
        "content": "* CVS Health Inc to eliminate 600 jobs - WSJ  citing statement",
        "date": "11032016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health Inc to eliminate 600 jobs - WSJ  citing statement "
    },
    {
        "content": "* In Q4 of 2016  expects to deliver gaap diluted EPS of $1.52 to $1.58 and adjusted EPS of $1.64 to $1.70",
        "date": "11082016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health posts Q3 adjusted earnings per share of $1.64 "
    },
    {
        "content": "Nov 8 CVS Health Corp  the No. 2 U.S. drugstore chain by store count  reported a 15.5 percent rise in quarterly revenue  helped by strong demand for its pharmacy benefit management (PBM) services.",
        "date": "11082016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS's quarterly revenue rises 15.5 pct "
    },
    {
        "content": "* Says its unit  FamilyMart Co. Ltd  plans to split its CVS business and subleasing real estate to transfer to Mitsuuroko Group Holdings unit  which is engaged in support of convenient store development business",
        "date": "10312016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-FamilyMart UNY Holdings unit to split CVS business and subleasing real estate to Mitsuuroko Group Holdings' unit "
    },
    {
        "content": "* National rollout of CVS pay  an end-to-end mobile payment solution at CVS pharmacy  Source text for Eikon:  Further company coverage:",
        "date": "10192016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Pharmacy takes CVS pay nationwide following successful pilot "
    },
    {
        "content": "Sept 30 The U.S. Food and Drug Administration warned against the use of homeopathic teething tablets and gels on Friday  citing potential risks to infants and children and prompting CVS Health Corp Inc to withdraw the products.",
        "date": "09302016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "FDA warns against use of homeopathic teething products "
    },
    {
        "content": "* Voluntary withdrawal being conducted in light of FDA's announcement recommending consumers stop using homeopathic teething products",
        "date": "09302016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS Pharmacy announces voluntary withdrawal of homeopathic teething products "
    },
    {
        "content": "* Consolidated Tomoka announces acquisition of a CVS ground lease in Dallas  texas for approximately $14.9 million  Source text for Eikon:  Further company coverage:",
        "date": "09232016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-Consolidated Tomoka acquires a CVS ground lease in Dallas "
    },
    {
        "content": "* Sets quarterly dividend of $0.425 per share  Source text for Eikon:  Further company coverage:",
        "date": "09222016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health sets quarterly dividend of $0.425 per share "
    },
    {
        "content": "A federal appeals court on Tuesday revived a lawsuit accusing CVS Health Corp  one of the largest U.S. drugstore chains  of deceiving consumers with labels touting how CVS-branded vitamin E promotes \"heart health.\"",
        "date": "09062016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS must face revived lawsuit in U.S. over vitamin E label "
    },
    {
        "content": "Sept 6 A federal appeals court on Tuesday revived a lawsuit accusing CVS Health Corp  one of the largest U.S. drugstore chains  of deceiving consumers with labels touting how CVS-branded vitamin E promotes \"heart health.\"",
        "date": "09062016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 1-CVS must face revived lawsuit in U.S. over vitamin E label "
    },
    {
        "content": "* Says the company plans to split its CVS (convenience store) business (69 stores) and subleasing real estate to Mitsuuroko Group Holdings ' unit  which is engaged in CVS development support business",
        "date": "08252016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-FamilyMart to split CVS business to Mitsuuroko Group Holdings' unit for 57 mln yen "
    },
    {
        "content": "* Makes overdose reversal drug available without a prescription at all CVS pharmacy locations in Colorado",
        "date": "08172016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health makes overdose-reversal drug available without prescription in Colorado "
    },
    {
        "content": "* CVS Pharmacy launches breakthrough  end-to-end mobile payment experience",
        "date": "08112016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "REFILE-BRIEF-CVS Health launches end-to-end mobile payment experience "
    },
    {
        "content": "* Opioid overdose-reversal medication Naloxone is now available without a prescription at CVS Pharmacy locations in Idaho  Source text for Eikon:  Further company coverage:",
        "date": "08122016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health Makes Overdose-Reversal Drug Naloxone Available Without A Prescription in Idaho "
    },
    {
        "content": "ZURICH  Aug 3 Big U.S. pharmacy chain CVS Health's move to jettison an Actelion drug from a list of covered medications is not expected to have a \"meaningful impact\" on the Swiss biotechnology company's sales  a spokesman said on Wednesday.",
        "date": "08032016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Actelion does not see significant CVS hit to Opsumit sales "
    },
    {
        "content": "Drugstore chain operator CVS Health Corp  reported a better-than-expected profit  helped by strong demand for its pharmacy benefit management (PBM) services  and raised its full-year adjusted profit forecast.",
        "date": "08022016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS Health's profit beats estimates on pharma business strength "
    },
    {
        "content": "* Shares up 3 pct premarket   (Adds details  analyst comment  shares)",
        "date": "08022016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 2-CVS Health's profit beats estimates on pharma business strength "
    },
    {
        "content": "* Sees q3 2016 adjusted earnings per share $1.55 to $1.58 excluding items",
        "date": "08022016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health Q2 GAAP earnings per share $0.86 "
    },
    {
        "content": "Aug 2 CVS Health Corp  the No. 2 U.S. drugstore chain by store count  reported a 17.6 percent rise in quarterly revenue  helped by strength in its pharmacy business.",
        "date": "08022016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Drugstore chain CVS's revenue jumps on pharma business "
    },
    {
        "content": "* Says to increase access to FDA-approved nasal naloxone for patients without insurance",
        "date": "07292016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health to increase access to FDA-approved nasal naloxone for patients without insurance "
    },
    {
        "content": "* Says overdose-reversal drug available without a prescription at all CVS pharmacy locations in Texas  Source text for Eikon:  Further company coverage:",
        "date": "07252016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health makes overdose-reversal drug available without prescription in Texas "
    },
    {
        "content": "* Sets quarterly dividend of $0.425 per share  Source text for Eikon:  Further company coverage:",
        "date": "07062016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health sets quarterly dividend of $0.425 per share "
    },
    {
        "content": "Walgreens Boots Alliance Inc   the No.1 U.S. drugstore operator by store count  reported a lower-than-expected increase in quarterly sales  hurt by weak demand for over-the-counter drugs and other products. | Video ",
        "date": "07062016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Walgreens U.S. retail sales rise less than expected "
    },
    {
        "content": "* Shares fall as much as 3.5 percent   (Adds analyst comment)",
        "date": "07062016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 4-Walgreens U.S. retail sales rise less than expected "
    },
    {
        "content": "Republican Senate Judiciary Committee Chairman Chuck Grassley  of Iowa is urging a federal appeals court to revive a whistleblower lawsuit accusing pharmacy benefit manager CVS Caremark Corp of defrauding Medicare  saying a lower court decision dismissing the case could undermine the goals of the federal False Claims Act.",
        "date": "06102016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "Grassley urges 3rd Circuit to revive fraud case against Caremark "
    },
    {
        "content": "* CVS Pharmacy Now Open In Target Stores Throughout Washington  Source text for Eikon:  Further company coverage:",
        "date": "06072016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-Cvs Pharmacy Now Open In Target Stores Throughout Washington "
    },
    {
        "content": "* Cvs health to expand access to opioid overdose-reversal drug for cvs pharmacy patients in seven additional states",
        "date": "05252016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health to expand access to opioid overdose-reversal drug "
    },
    {
        "content": "* Company will launch digital receipts as a new option for all members of its ExtraCare rewards program",
        "date": "05232016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS to launch digital receipts option for ExtraCare rewards program members "
    },
    {
        "content": "CHICAGO  May 18 Retail chain Target Corp  gave a cautious outlook on Wednesday after reporting a lower-than-expected increase in quarterly sales due to unseasonable weather and weaker demand for electronics and groceries.",
        "date": "05182016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 4-Target shares plunge after sales  outlook disappoint "
    },
    {
        "content": "* Has commenced cash tender offers for any and all of its 5.75% senior notes due 2017  its 6.60% senior notes due 2019",
        "date": "05162016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health announces cash tender offers for certain outstanding notes "
    },
    {
        "content": "* Shares up 2.9 pct at $220.00   (Adds Breakingviews link  updates share price)",
        "date": "05102016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 5-Allergan profit beats estimates  share buybacks planned "
    },
    {
        "content": "* Presentation - continued to pull back on broad-based promotion at store front in Q1  leading to fewer visits from  lower-value customers",
        "date": "05032016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS presentation - expect Q2 net revenue to grow 18.5-20 pct "
    },
    {
        "content": "* Launched expanded health care offerings to support health of people with hepatitis b  hepatitis c and other liver diseases in hawaii",
        "date": "05022016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health launches expanded hepatitis care options in Hawaii "
    },
    {
        "content": "CVS Health Corp   the No. 2 U.S. drugstore chain by store count  reported better-than-expected quarterly revenue and profit  helped by strong demand for its pharmacy benefit management (PBM) services.",
        "date": "05032016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Drugstore operator CVS's revenue  profit beat estimates "
    },
    {
        "content": "* CVS Health reports first quarter results; confirms 2016 adjusted EPS guidance",
        "date": "05032016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health reports Q1 adjusted earnings per share $1.18 "
    },
    {
        "content": "* Files for debt shelf of up to $10.0 billion - SEC Filing  Source text: http://1.usa.gov/1SzDFUX Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04222016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health files for debt shelf of up to $10 bln "
    },
    {
        "content": "* Chief Executive Officer Larry Merlo total 2015 compensation $28.9 million versus $32.4 million in 2014",
        "date": "04082016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-CVS Health CEO Larry Merlo total 2015 compensation $28.9 mln vs. $32.4 mln in 2014 "
    },
    {
        "content": "NEW YORK  April 4 For much of the last three years  investors have been willing to pay more for expected profit at Walgreens than for competitor CVS  but the pharmacy chain may be losing that edge on Wall Street.",
        "date": "04042016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Walgreens' Wall Street edge fades against rival CVS as earnings near "
    },
    {
        "content": "March 23 Hospital staffing provider TeamHealth Holdings Inc said on Wednesday it had appointed three nominees of activist hedge fund Jana Partners LLC to its board.",
        "date": "03232016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CORRECTED-UPDATE 1-TeamHealth appoints Jana Partners' nominees as directors "
    },
    {
        "content": "NEW YORK  Feb 23 CVS Health Corp said on Tuesday its pharmacy benefit customers spent about 5 percent more on prescription drugs in 2015 than in 2014  a year when drug spending jumped nearly 12 percent.",
        "date": "02232016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CORRECTED-CVS says 2015 drug spending grew 5 percent  far less than in 2014 "
    },
    {
        "content": "CVS Health Corp   the No.2 U.S. drugstore chain by store count  forecast current-quarter profit below analysts' estimates as customer traffic to its retail stores slows.",
        "date": "02092016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS Health forecasts first-quarter profit below estimates "
    },
    {
        "content": "* Pharmacy comparable sales up 4.5 pct   (Adds analyst comment  shares)",
        "date": "02092016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 2-CVS Health forecasts 1st-qtr profit below estimates "
    },
    {
        "content": "CVS Health Corp has been hit with a proposed class action accusing it of dramatically overcharging healthcare plans for generic drugs over the past seven years.",
        "date": "02032016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS overcharged health plans for generic drugs - class action "
    },
    {
        "content": "Feb 9 CVS Health Corp  the No.2 U.S. drugstore chain by store count  reported an 11 percent rise in quarterly net revenue  helped by strong demand in its pharmacy business.",
        "date": "02092016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS Health's quarterly revenue rises 11 pct "
    },
    {
        "content": "CVS Health Corp said it would make the opioid overdose antidote  naloxone  available without a prescription at all its pharmacies across Ohio  a state with one of the highest rates of overdose-related deaths.",
        "date": "02012016",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS to make overdose drug naloxone prescription-free in Ohio "
    },
    {
        "content": "Feb 1 CVS Health Corp said it would make the opioid overdose antidote  naloxone  available without a prescription at all its pharmacies across Ohio  a state with one of the highest rates of overdose-related deaths.",
        "date": "02012016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 1-CVS to make overdose drug naloxone prescription-free in Ohio "
    },
    {
        "content": "Feb 1 CVS Health Corp said it would make the opioid overdose reversal medicine  naloxone  available without a prescription at all its pharmacies across Ohio beginning in late March.",
        "date": "02012016",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS to sell overdose-reversal drug without prescription in Ohio "
    },
    {
        "content": "Health insurer WellCare Health Plans said it would change its pharmacy benefit manager to CVS Health Corp from UnitedHealth Corp's Optum Rx  effective Jan. 1.",
        "date": "12312015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "WellCare makes CVS Health its pharmacy benefit manager "
    },
    {
        "content": "Dec 31 Health insurer WellCare Health Plans  said it would change its pharmacy benefit manager to CVS Health Corp from UnitedHealth Corp's Optum Rx  effective Jan. 1.",
        "date": "12312015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 1-WellCare makes CVS Health its pharmacy benefit manager "
    },
    {
        "content": "Dec 31 Health insurer WellCare Health Plans  said it would transition its pharmacy benefit management to CVS Health Corp from Jan. 1.",
        "date": "12312015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "WellCare to transition pharmacy benefit management to CVS Health "
    },
    {
        "content": "Oct 30 Vertex Pharmaceuticals Inc said it received a subpoena from the U.S. Department of Justice in the third quarter related to its marketed medicines  seeking documents related primarily to its \"good laboratory practices\" in a bioanalytical lab.",
        "date": "10312015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "UPDATE 1-Vertex Pharma receives subpoena from Department of Justice "
    },
    {
        "content": "Oct 30 Vertex Pharmaceuticals Inc said it received a subpoena from the U.S. Department of Justice in the third quarter  seeking documents related primarily to its \"good laboratory practices\" in a bioanalytical lab.",
        "date": "10302015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Vertex  Mylan  CVS subpoenaed by federal agencies "
    },
    {
        "content": "Valeant Pharmaceuticals Inc. sustained hits on several fronts on Thursday after CVS Health Corp and Express Scripts dropped Philidor from their networks in a sign the fallout from the drugmaker's connection with the specialty pharmacy is spreading.",
        "date": "10292015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS  Express Scripts drop Valeant's Philidor; stock dives "
    },
    {
        "content": "CVS Health Corp  gave a disappointing profit forecast for 2016  hurt by costs related to the acquisition of Target Corp's pharmacies and as its own pharmacy benefits management (PBM) business expands in low-margin Medicare and Medicaid plans.",
        "date": "10302015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS 2016 profit forecast hurt by healthcare plans  Target deal "
    },
    {
        "content": "Oct 29 Shares of Valeant Pharmaceuticals Inc. fell further on Thursday after CVS Health Corp and Express Scripts dropped Philidor Rx from their networks in a sign the fall-out from the drugmaker's connection with the specialty pharmacy is spreading.",
        "date": "10292015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 4-CVS  Express Scripts drop Valeant's Philidor; stock dives "
    },
    {
        "content": "Oct 29 Drugstore chain CVS Health Corp  said it had dropped Philidor Rx  a specialty pharmacy associated with Valeant Pharmaceuticals Inc   from its Caremark program.",
        "date": "10292015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS Health drops Philidor  adds to Valeant's woes "
    },
    {
        "content": "* Shares fall as much as 7 pct in heavy trading   (Adds details from conference call  analyst comment; updates shares)",
        "date": "10302015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 3-CVS 2016 profit forecast hurt by healthcare plans  Target deal "
    },
    {
        "content": "Oct 30 CVS Health Corp  the second-largest U.S. drugstore chain  reported a 10.3 percent rise in quarterly net revenue  helped by strong demand for its pharmacy benefit management services.",
        "date": "10302015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS Health quarterly revenue increases 10 pct "
    },
    {
        "content": "CVS Health Corp's pharmacy benefit management unit has dodged a whistleblower lawsuit accusing it of multiple violations of the federal Medicare law  including approving claims for drugs without proper physician identification or necessary authorization.",
        "date": "09232015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS dodges Medicare fraud whistleblower lawsuit "
    },
    {
        "content": "CVS Health Corp  reached a $48 million settlement of a lawsuit accusing the U.S. drugstore operator of fraudulently concealing a big loss of revenue in its pharmacy benefits manager business  culminating in a plunge in its stock price.",
        "date": "09162015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS Health in $48 million settlement of lawsuit over hiding loss "
    },
    {
        "content": "Sept 16 CVS Health Corp reached a $48 million settlement of a lawsuit accusing the U.S. drugstore operator of fraudulently concealing a big loss of revenue in its pharmacy benefits manager business  culminating in a plunge in its stock price.",
        "date": "09162015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 1-CVS Health in $48 million settlement of lawsuit over hiding loss "
    },
    {
        "content": "Sept 16 CVS Health Corp reached a $48 million settlement of a lawsuit accusing the U.S. drugstore operator of fraudulently concealing a big loss of revenue in its pharmacy benefits manager business  culminating in a plunge in its stock price.",
        "date": "09162015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS Health in $48 million settlement of lawsuit over stock plunge "
    },
    {
        "content": "* Ceo says in letter to shareholders is encouraged by zubsolv market share gains in the last two month",
        "date": "09022015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "BRIEF-Orexo says encouraged by zubsolv market share gains in past 2 mos "
    },
    {
        "content": "CHICAGO  Sept 3 CVS Health Corp said on Thursday its decision to stop selling tobacco products last year led to a 1 percent decrease in cigarette sales in some states where the drugstore chain has a sizeable presence.",
        "date": "09032015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS says its ban on cigarette sales has reduced smoking "
    },
    {
        "content": "CVS Health Corp  the No 2 manager of drug benefit plans for U.S. employers and insurers  will wait until a second new cholesterol-lowering drug is approved by regulators before negotiating for price discounts or adding either of the much pricer new drugs to its list of covered medications.",
        "date": "08102015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS: 'all bets are off' for new cholesterol drug contracts "
    },
    {
        "content": "Aug 5 CVS Health Corp  which operates the nation's second-biggest pharmacy benefit manager  said that next year it will exclude an additional 31 prescription medicines from insurance coverage  including Viagra and widely used treatments for diabetes and multiple sclerosis.",
        "date": "08052015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "UPDATE 1-CVS strips Viagra  other top drugs  from insurance coverage "
    },
    {
        "content": "Aug 5 CVS Health Corp  which operates the nation's second-biggest pharmacy benefit manager  said that next year it will exclude an additional 31 prescription medicines from insurance coverage  including Viagra and widely used treatments for diabetes and multiple sclerosis.",
        "date": "08052015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS strips Viagra  other top drugs  from insurance coverage "
    },
    {
        "content": "* Zubsolv market access update on agreement with cvs caremark and announcement of new exclusive agreement in managed medicaid",
        "date": "08052015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "BRIEF-Orexo says Zubsolv removed from preferred position on CVS Caremark list "
    },
    {
        "content": "Wall Street ended lower on Tuesday for a third straight session as investors worried about a rise in interest rates while Apple's shares hit their lowest in over six months. | Video ",
        "date": "08042015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "Wall Street moves lower on Apple  interest rate worries "
    },
    {
        "content": "U.S. drugstore chain operator CVS Health Corp estimated current-quarter profit below analysts' expectations  hurt by pressure from reimbursement rates and lower customer traffic after the company stopped selling tobacco products.",
        "date": "08042015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Drugstore chain operator CVS forecasts profit below estimates "
    },
    {
        "content": "Aug 4 U.S. drugstore chain operator CVS Health Corp estimated current-quarter profit below analysts' expectations  hurt by pressure from reimbursement rates and lower customer traffic after the company stopped selling tobacco products.",
        "date": "08042015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 2-Drugstore chain operator CVS forecasts profit below estimates "
    },
    {
        "content": "* Indexes up: Dow 0.02 pct  S&P 0.04 pct  Nasdaq 0.05 pct   (Updates to open)",
        "date": "08042015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "US STOCKS-Wall St flat amid slew of earnings  Apple weighs "
    },
    {
        "content": "* Futures: Dow up 13 pts  S&P little changed  Nasdaq down 4 pts   (Adds details  comment  updates prices)",
        "date": "08042015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "US STOCKS-Wall St set to open little changed amid earnings "
    },
    {
        "content": "Aug 4 Drugstore operator CVS Health Corp  reported a 7.4 percent rise in quarterly sales as demand for its specialty pharmacy services increased and pharmacy claims rose.",
        "date": "08042015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CORRECTED-CVS Health's sales rise 7.4 percent "
    },
    {
        "content": "University of California (UCLA) Health  which runs four hospitals in the university's campuses  and drug retailer CVS Health Corp's  CVSphoto.com became the latest victims of cyber attacks.",
        "date": "07172015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS Health's photo service  UCLA Health get hacked "
    },
    {
        "content": "July 17 University of California (UCLA) Health  which runs four hospitals in the university's campuses  and drug retailer CVS Health Corp's CVSphoto.com became the latest victims of cyber attacks.",
        "date": "07172015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 1-CVS Health's photo service  UCLA Health get hacked "
    },
    {
        "content": "(Adds details on CVS deal  updates prices)     * Greek deal reduces safe-haven bond buying     * Focus on Fed after hawkish Yellen speech     * Large CVS bond deal weighs on market      By Karen Brettell     NEW YORK  July 13 U.S. Treasury yields rose on Monday after Greek and euro zone leaders reached a deal that is likely to keep Greece in the single currency and as a large corporate bond deal weighed on the market.     Euro zone leaders made Greece surrender much of its soverei",
        "date": "07132015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "TREASURIES-Yields rise on Greek deal  corporate bond sale weighs "
    },
    {
        "content": "CVS Caremark's \"ExtraBucks Rewards\" program was too widely publicized to be the basis for a customer's whistleblower action  a federal judge in Chicago has ruled.",
        "date": "06302015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "Judge tosses whistleblower suits over CVS ExtraBucks program "
    },
    {
        "content": "CHICAGO Target Corp's  sale of its in-store pharmacies to CVS Health Corp  may encourage large supermarket chains with struggling pharmacies to look for professional drug store partners of their own.",
        "date": "06152015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS-Target deal could spur supermarkets to find pharmacy partners "
    },
    {
        "content": "Drugstore operator CVS Health Corp  will buy Target Corp's  pharmacies and clinics in a $1.9 billion deal that should help it bargain with drug makers for lower prices  while freeing Target from a costly business where it struggled to make a profit. | Video ",
        "date": "06152015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS Health to buy Target's pharmacy business for $1.9 billion "
    },
    {
        "content": "* All new Target stores with pharmacies to include CVS pharmacy",
        "date": "06152015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 4-CVS Health to buy Target's pharmacy business for $1.9 bln "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  June 15 (Fitch) Fitch Ratings does not expect any rating implications  from Target Corporation's (Target) announcement that it has signed a definitive  agreement to sell its pharmacy and clinic businesses to CVS Health (CVS) for  pretax proceeds of $1.9 billion. Target's long-term Issuer Default Rating (IDR)  is 'A-' and short-term IDR is 'F2'. The Rating Outlook is Stable. A full list of  ratings follows at the end of this re",
        "date": "06152015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Fitch: No Rating Implications from Target's Announcement of Pharmacy Sale to CVS "
    },
    {
        "content": "June 15 Drugstore operator CVS Health Corp  said it will acquire Target Corp's pharmacy and clinic businesses for about $1.9 billion.",
        "date": "06152015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS to buy Target's pharmacy  clinic businesses for $1.9 bln "
    },
    {
        "content": "CVS Health Corp   the second-largest U.S. drugstore operator  is nearing a deal to buy pharmacy service provider Omnicare Inc  for more than $12 billion  according to two people familiar with the matter.",
        "date": "05202015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS nears deal to buy Omnicare for more than $12 billion: sources "
    },
    {
        "content": "May 20 CVS Health Corp  the second-largest U.S. drugstore operator  is nearing a deal to buy pharmacy service provider Omnicare Inc for more than $12 billion  according to two people familiar with the matter.",
        "date": "05202015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 1-CVS nears deal to buy Omnicare for more than $12 bln -sources "
    },
    {
        "content": "May 21 The following bids  mergers  acquisitions and disposals were reported by 1030 GMT on Thursday:",
        "date": "05212015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "May 20 CVS Health Corp  the second-largest U.S. drugstore operator  is in advanced talks to buy pharmacy service provider Omnicare Inc  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "05202015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS Health in advanced talks to buy pharmacy service provider Omnicare -Bloomberg "
    },
    {
        "content": "Drugstore operator CVS Health Corp  said Thursday it will spend $10.1 billion to buy Omnicare Inc   a company that supplies prescription medicines to nursing  assisted living and other healthcare facilities. | Video ",
        "date": "05212015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS to expand pharmacy business with $10.1 billion Omnicare buy "
    },
    {
        "content": "* Deal to add $0.20/share to CVS adjusted earnings in 2016   (Adds analyst comments  updates trading)",
        "date": "05212015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 3-CVS to expand pharmacy business with $10.1 billion Omnicare buy "
    },
    {
        "content": "* Indexes up: Dow 0.02 pct  S&P 0.1 pct  Nasdaq 0.2 pct   (Updates to open)",
        "date": "05212015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "US STOCKS-Wall St shrugs off weak data to inch higher "
    },
    {
        "content": "May 21 CVS Health Corp  the second-largest U.S. drugstore operator  said on Thursday it will buy pharmacy services provider Omnicare Inc for $10.1 billion to expand in the growing market serving the senior patient population.",
        "date": "05212015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CORRECTED-UPDATE 2-CVS to buy pharmacy services provider Omnicare for $10.1 bln "
    },
    {
        "content": "* Futures down: Dow 23 pts  S&P 2.75 pts  Nasdaq 10.50 pts   (Adds details  comment  updates prices)",
        "date": "05212015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "US STOCKS-Wall St set to open lower as weekly jobless claims rise "
    },
    {
        "content": "May 21 Drugstore operator CVS Health Corp  said it will acquire pharmacy service provider Omnicare Inc for an enterprise value of about $12.7 billion.",
        "date": "05212015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS Health to buy Omnicare in $12.7 billion deal "
    },
    {
        "content": "CVS Health Corp  the second-largest U.S. drugstore operator  will pay $22 million to resolve a federal probe into whether two of its pharmacies in central Florida sold powerful  potentially addictive painkillers that were not prescribed for legitimate medical purposes.",
        "date": "05132015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS pays $22 million to resolve Florida painkiller probe "
    },
    {
        "content": "May 13 CVS Health Corp  the second-largest U.S. drugstore operator  will pay $22 million to resolve a federal probe into whether two of its pharmacies in central Florida sold powerful  potentially addictive painkillers that were not prescribed for legitimate medical purposes.",
        "date": "05132015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS pays $22 mln to resolve Florida painkiller probe "
    },
    {
        "content": "CVS Health Corp  reported higher-than-expected quarterly results on Friday  helped by increased revenue from its specialty pharmacy services and increased claim processing.",
        "date": "05012015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS profit beats estimates on pharmacy services strength "
    },
    {
        "content": "May 1 CVS Health Corp reported higher-than-expected quarterly results on Friday  helped by increased revenue from its specialty pharmacy services and increased claim processing.",
        "date": "05012015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 2-CVS profit beats estimates on pharmacy services strength "
    },
    {
        "content": "Pharmacy service provider Omnicare Inc  is getting buyout interest from potential buyers  including Express Scripts Holding Co  and CVS Health Corp   Bloomberg reported  citing people with knowledge of the matter.",
        "date": "04302015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "Omnicare draws buyout interest from CVS  Express Scripts: Bloomberg "
    },
    {
        "content": "May 1 CVS Health Corp  the No.2 U.S drugstore operator  reported an 11 percent rise in quarterly net revenue  helped by higher revenue from specialty pharmacy services and an increase in pharmacy network claims.",
        "date": "05012015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Drugstore operator CVS reports 11 pct rise in revenue "
    },
    {
        "content": "April 30 Pharmacy service provider Omnicare Inc  is getting buyout interest from potential buyers  including Express Scripts Holding Co and CVS Health Corp  Bloomberg reported  citing people with knowledge of the matter.",
        "date": "04302015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "Omnicare draws buyout interest from CVS  Express Scripts - Bloomberg "
    },
    {
        "content": "WASHINGTON The entry of copycat biotech drugs into the U.S. market could cut prices of expensive medications by 40 percent to 50 percent  depending on the level of competition among drugmakers  a top executive at CVS Health Corp told Reuters.",
        "date": "03112015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "Exclusive: CVS says biotech drug copies may bring price cuts of 40-50 percent "
    },
    {
        "content": "CVS Health warned on Tuesday that the costs of a potent new class of cholesterol treatments could eclipse those of other expensive medicines and overwhelm the U.S. healthcare system \"if rigid cost control mechanisms are not put in place.\"",
        "date": "02172015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS urges cost controls for new cholesterol drugs "
    },
    {
        "content": "Feb 17 CVS Health warned on Tuesday that the costs of a potent new class of cholesterol treatments could eclipse those of other expensive medicines and overwhelm the U.S. healthcare system \"if rigid cost control mechanisms are not put in place.\"",
        "date": "02172015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 2-CVS urges cost controls for new cholesterol drugs "
    },
    {
        "content": "Feb 17 CVS Health on Tuesday warned that costs of a potent new class of cholesterol treatments and other specialty drugs in development could eclipse those of expensive new medicines and overwhelm the healthcare system \"if rigid cost control mechanisms are not put in place.\"",
        "date": "02172015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CORRECTED-UPDATE 1-CVS urges cost controls for new cholesterol  specialty drugs "
    },
    {
        "content": "Feb 17 CVS Health Corp  the second-largest U.S. pharmacy chain operator  has warned that a new class of drugs being developed to lower \"bad\" cholesterol could cost the U.S. healthcare system as much as $150 billion per year.",
        "date": "02172015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS says new cholesterol drugs could cost U.S. $150 bln/year "
    },
    {
        "content": "CVS Health Corp  reported a better-than-expected quarterly net revenue  boosted by growth in its Medicaid business and strength in specialty drug sales.",
        "date": "02102015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS Health revenue beats as pharmacy services sales rise "
    },
    {
        "content": "Feb 10 CVS Health Corp reported a better-than-expected quarterly net revenue  boosted by growth in its Medicaid business and strength in specialty drug sales.",
        "date": "02102015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 2-CVS Health revenue beats as pharmacy services sales rise "
    },
    {
        "content": "Feb 10 CVS Health Corp  the No. 2 U.S. drugstore operator  reported a near 13 percent rise in quarterly net revenue  helped by an increase in pharmacy same-store sales.",
        "date": "02102015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "CVS Health revenue rises nearly 13 pct "
    },
    {
        "content": "CVS Health Corp  one of the largest U.S. managers of drug benefits  said it would give preferred status to the hepatitis C treatments from Gilead Sciences and cover a new competing treatment from AbbVie Inc only as an exception.",
        "date": "01052015",
        "name": "CVS Health Corporation",
        "news_type": "topStory",
        "symbol": "CVS",
        "title": "CVS to cover Gilead hepatitis C treatment over AbbVie regimen "
    },
    {
        "content": "(Recasts with attribution from CVS; adds Express Scripts  analyst comment  background)",
        "date": "01052015",
        "name": "CVS Health Corporation",
        "news_type": "normal",
        "symbol": "CVS",
        "title": "UPDATE 1-CVS to cover Gilead hepatitis C treatment over AbbVie regimen "
    }
]