[
    {
        "content": "LONDON  Nov 15 Chevron's Gorgon liquefied natural gas (LNG) export facility in Australia shut down its third production unit on Wednesday for a planned maintenance lasting up to Dec. 25  trade sources said.",
        "date": "11152017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron's Gorgon LNG export plant shuts third unit for maintenance -trade "
    },
    {
        "content": "TOKYO  Nov 13 Japan's JERA Co  the fuel-buying joint venture of Tokyo Electric Power and Chubu Electric Power  said it received the first liquefied natural gas (LNG) cargo shipped from Chevron's Wheatstone project in Australia.",
        "date": "11132017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Japan's JERA imports first LNG cargo shipped from Chevron's Wheatstone site "
    },
    {
        "content": "* Australia Barrow Island  Cooper Basin reach close to $70/bbl",
        "date": "11072017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Oil at $70/barrel already a reality for some as Asian premium bites "
    },
    {
        "content": "There’s a landmine buried in a footnote on the last page of Digital Realty’s newly filed reply brief in the U.S. Supreme Court case that will determine the scope of Dodd-Frank anti-retaliation protections for corporate whistleblowers. And if the justices step on it  they could blow up administrative law as it’s currently practiced.",
        "date": "11092017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron deference landmine lurks in new brief in SCOTUS whistleblower case "
    },
    {
        "content": "* Chevron Corp says on Aug 14  an agreement was reached with the Australian Taxation Office to settle dispute - SEC filing",
        "date": "11022017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron updates on dispute with Australian Taxation Office "
    },
    {
        "content": "DHAKA  Oct 29 The U.S. oil company Chevron will not sell three subsidiaries and leave Bangladesh as planned  Chevron said on Sunday.",
        "date": "10292017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron drops decision to leave Bangladesh "
    },
    {
        "content": "DHAKA The U.S. oil company Chevron  will not sell three subsidiaries and leave Bangladesh as planned  Chevron said on Sunday.",
        "date": "10302017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron drops decision to leave Bangladesh "
    },
    {
        "content": "* Announced a seven-year partnership with Microsoft Corp establishing company as Chevron's primary cloud provider​ Source text for Eikon: Further company coverage:",
        "date": "10302017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Microsoft Corp to become Chevron's primary cloud provider​ "
    },
    {
        "content": "* Wheatstone part of massive Australian LNG export programme (Adds detail  graphic)",
        "date": "10312017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 1-Australia's Wheatstone LNG facility exports 1st cargo to Japan - Chevron "
    },
    {
        "content": "SINGAPORE  Oct 31 The cargo exporting liquefied natural gas (LNG) from Australia's Wheatstone project has left for Japan  Chevron said on Tuesday.",
        "date": "10312017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Australia's Wheatstone LNG facility exports 1st cargo to Japan - Chevron "
    },
    {
        "content": "SINGAPORE China's state oil major Sinopec is evaluating two projects in the United States that could boost Gulf Coast crude oil exports and also expand storage facilities in the Caribbean  two people familiar with the matter said on Tuesday  with U.S. President Donald Trump set to visit Beijing next week.",
        "date": "10312017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "China's Sinopec mulls U.S. oil projects ahead of Trump's visit: sources "
    },
    {
        "content": "HOUSTON Rising oil and natural gas prices boosted third-quarter profits at Exxon Mobil Corp and Chevron Corp by about 50 percent  underscoring how reliant they remain on commodity markets for their financial futures than better technology or cost cuts.",
        "date": "10272017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Exxon  Chevron results linked to oil price  not cost cuts "
    },
    {
        "content": "HOUSTON  Oct 27 Rising oil and natural gas prices boosted third-quarter profits at Exxon Mobil Corp and Chevron Corp by about 50 percent  underscoring how reliant they remain on commodity markets for their financial futures than better technology or cost cuts.",
        "date": "10272017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "WRAPUP 2-Exxon  Chevron results linked to oil price  not cost cuts "
    },
    {
        "content": "* Chevron Corp - ‍Frank is Vice Chairman of Oaktree Capital Management  L.P.​ Source text for Eikon: Further company coverage:",
        "date": "10262017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-John B. Frank elected to Chevron’s Board of Directors "
    },
    {
        "content": "HOUSTON Chevron Corp  reported a lower-than-expected quarterly profit on Friday as U.S. production slipped  offsetting a rise in oil and natural gas prices.",
        "date": "10272017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron profit misses estimates on output decline; shares dip "
    },
    {
        "content": "HOUSTON  Oct 27 Chevron Corp reported a lower-than-expected quarterly profit on Friday as U.S. production slipped  offsetting a rise in oil and natural gas prices.",
        "date": "10272017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron profit misses estimates on output decline; shares dip "
    },
    {
        "content": "* Q3 earnings per share view $0.98 -- Thomson Reuters I/B/E/S",
        "date": "10272017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron reports Q3 earnings per share $1.03 "
    },
    {
        "content": "HOUSTON  Oct 27 Chevron Corp said on Friday its quarterly profit rose 52 percent on higher oil and natural gas prices.",
        "date": "10272017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron 3rd-qtr profit soars 52 percent on higher oil  natgas prices "
    },
    {
        "content": "* Chevron Corp - ‍declared a quarterly dividend of $1.08 per share​ Source text for Eikon: Further company coverage:",
        "date": "10252017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron corp declares quarterly dividend of $1.08 per share​ "
    },
    {
        "content": "* SNC-Lavalin signs master service agreement with Chevron for systems completion support",
        "date": "10232017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-SNC-Lavalin signs master service agreement with Chevron for systems completion support "
    },
    {
        "content": "Workers at Chevron's Pascagoula refinery in Mississippi were evacuated after a tornado hit the plant on Sunday afternoon  according to a website affiliated to NBC.",
        "date": "10232017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Tornado leads to evacuations at Chevron's Pascagoula  Miss. refinery: report "
    },
    {
        "content": "Oct 20 U.S. oil major Chevron has approved an investment to increase output from its Captain oilfield by using a new water-injection technology for the first time in the North Sea  the company said on Friday.",
        "date": "10202017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron approves new tech investment to raise output at North Sea field "
    },
    {
        "content": "BOSTON/HOUSTON  Oct 18 Shareholder activists will speak with Chevron Corp next week to request the energy giant use its influence with the government of Myanmar to press for a resolution of ethnic violence that has led to a refugee crisis.",
        "date": "10182017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Activists set talks with Chevron on Myanmar rights concerns "
    },
    {
        "content": "* Concerns about U.S. fuel build as driving season ends (New throughout  updates prices  market activity   analyst comments  Kurds flee Kirkuk  Shell lifting force majeure on Bonny Light in Nigeria)",
        "date": "10192017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 10-Oil drops more than 1 pct on profit taking after 4 days of gains "
    },
    {
        "content": "LONDON  Oct 19 Chevron has temporarily suspended oil and gas drilling activity in Iraqi Kurdistan  the company said on Thursday  in the latest setback to the region following recent unrest.",
        "date": "10192017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron suspends drilling activity in Kurdistan "
    },
    {
        "content": "* Chevron is temporarily suspending operations in Iraqi Kurdistan - WSJ‍​ Source text: http://on.wsj.com/2gnMncJ Further company coverage:",
        "date": "10192017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron is temporarily suspending operations in Iraqi Kurdistan - WSJ‍​ "
    },
    {
        "content": "HOUSTON Chevron Corp  has begun to redeploy personnel and restore oil production at its Gulf of Mexico facilities after storm Nate  the company said in a statement on Sunday.",
        "date": "10082017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron starts redeploying staff  restoring production in Gulf post: storm "
    },
    {
        "content": "HOUSTON  Oct 8 Chevron Corp has begun to redeploy personnel and restore oil production at its Gulf of Mexico facilities after storm Nate  the company said in a statement on Sunday.",
        "date": "10082017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron starts redeploying staff  restoring production in Gulf post-storm "
    },
    {
        "content": "Oct 10 Canadian pipeline operator Keyera Corp said on Tuesday it signed a 20-year agreement with Chevron's Canadian unit to transport and store natural gas liquids (NGL).",
        "date": "10102017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Canada's Keyera signs pact with Chevron to transport  store NGL "
    },
    {
        "content": "HOUSTON  Oct 11 Chevron Corp said on Wednesday it has resumed normal operations in the U.S. Gulf of Mexico after last weekend's Hurricane Nate knocked its oil and gas output in the region offline.",
        "date": "10112017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron says U.S. Gulf operations back to normal after Nate "
    },
    {
        "content": "HOUSTON  Oct 9 Chevron Corp said on Monday it has sent staff back to U.S. Gulf of Mexico platforms that were shuttered ahead of Hurricane Nate  but would not speculate on when operations would return to normal.",
        "date": "10092017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron returns staff to Gulf platforms; no timeline on operations "
    },
    {
        "content": "* Keyera announces long-term Duvernay natural gas liquids agreement with Chevron",
        "date": "10102017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Keyera announces long-term Duvernay natural gas liquids agreement with Chevron "
    },
    {
        "content": "HOUSTON Chevron Corp  said on Monday it was working to restore its 340 000 barrel per day (bpd) Pascagoula  Mississippi  refinery to full production after the passage of Hurricane Nate.",
        "date": "10092017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron working to restore Pascagoula refinery to full production "
    },
    {
        "content": "HOUSTON  Oct 7 Hurricane Nate had curtailed 92 percent of U.S. Gulf of Mexico oil output and up to 3 percent of refining capacity on Saturday as it sped toward energy facilities in the central U.S. Gulf Coast that largely were spared by Hurricane Harvey's wrath nearly six weeks ago.",
        "date": "10072017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 3-Oil output on U.S. Gulf Coast curtailed as Hurricane  Nate nears "
    },
    {
        "content": "BEIRUT  Oct 12 Lebanon's Energy Minister Cesar Abi Khalil on Thursday said a tender had closed on a first round of offshore energy blocks  and told local media that two consortiums had submitted bids.",
        "date": "10122017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Bids on Lebanon offshore energy blocks close "
    },
    {
        "content": "* ‍Wheatstone LNG has commenced production from its onshore facility near Onslow  Western Australia​‍",
        "date": "10092017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Woodside Petroleum says Wheatstone LNG has commenced production ​ "
    },
    {
        "content": "BEIRUT  Oct 12 Lebanon's energy minister Cesar Abi Khalil on Thursday said a tender had closed on a first round of offshore energy blocks  without saying how many companies had bid.",
        "date": "10122017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Bids close on Lebanon offshore energy blocks "
    },
    {
        "content": "SINGAPORE The appeal of Indonesia's oil and gas sector is improving for some independent producers as the resource-rich nation scrambles to reduce its dependence on imports and fill a gap left by the exit of some producers  the head of GSS Energy told Reuters.",
        "date": "10122017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Indonesia's drive to reduce oil imports a boon for producers: GSS Energy "
    },
    {
        "content": "HOUSTON  Oct 5 Chevron Corp said on Thursday it has begun shutting in its U.S. Gulf of Mexico oil and natural gas production ahead of Tropical Storm Nate.",
        "date": "10052017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron shutting in U.S. Gulf production ahead of Tropical Storm Nate "
    },
    {
        "content": "* For other news from Reuters Global Commodities Summit  click on http://www.reuters.com/summit/COMMODITIES17",
        "date": "10122017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "REUTERS SUMMIT-Indonesia's drive to reduce oil imports a boon for producers - GSS Energy "
    },
    {
        "content": "Oct 5 Oilfield services company Petrofac Ltd said its North Sea engineering services contract with a unit of Chevron Corp  had been extended for 12 months.",
        "date": "10052017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Petrofac extends North Sea contract with Chevron "
    },
    {
        "content": "* SECURED CONTRACT EXTENSION FROM CHEVRON NORTH SEA FOR PROVISION OF ENGINEERING SERVICES; AGREEMENT HELD SINCE 2014​",
        "date": "10052017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Petrofac secures North Sea contract extension with Chevron "
    },
    {
        "content": "* Chevron Corp says effective September 28  2017  Jon Huntsman Jr. resigned from board of directors of Chevron Corporation - SEC filing Source text: (http://bit.ly/2ykrFFp) Further company coverage:",
        "date": "10032017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron says Jon Huntsman Jr resigned from board  eff. Sept. 28 - SEC filing "
    },
    {
        "content": "Oct 4 Chevron Corp said it is preparing to shut its Petronius and Blind Faith facilities ahead of Tropical Depression 16 now at the of the Gulf of Mexico.",
        "date": "10052017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron preparing to shut two facilities ahead of Gulf storm "
    },
    {
        "content": "* Glencore is said to mull bid for Chevron's South Africa assets - Bloomberg  citing sources Source text: https://bloom.bg/2fw4tbQ",
        "date": "09292017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Glencore is said to mull bid for Chevron's South Africa assets - Bloomberg "
    },
    {
        "content": "HOUSTON  Sept 28 Chevron Corp said on Thursday that Vice Chairman Mike Wirth will become chief executive next February  replacing the retiring John Watson.",
        "date": "09282017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron taps Mike Wirth to be next CEO as Watson retires "
    },
    {
        "content": "HOUSTON  Sept 28 Chevron Corp Vice Chairman Mike Wirth will become chief executive next February  replacing the retiring John Watson  the oil and natural gas producer said on Thursday.",
        "date": "09282017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-Chevron taps Mike Wirth to be next CEO as Watson retires "
    },
    {
        "content": "* Chevron Corp - ‍Wirth  who is currently vice chairman of board and executive vice president of midstream and development  succeeds John S. Watson​",
        "date": "09282017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron appoints Michael Wirth as CEO "
    },
    {
        "content": "SINGAPORE Oil major Chevron Corp will next year invest around $4 billion to ramp up its crude production in the Permian Basin area of the United States  a company executive said on Monday.",
        "date": "09252017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron to invest $4 billion to boost Permian Basin output "
    },
    {
        "content": "* Chevron plans to boost its Permian output to over 400 000 bpd",
        "date": "09252017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron to invest $4 billion to boost Permian Basin output "
    },
    {
        "content": "DHAKA/BEIJING Chevron Corp may miss its mid-October target for closing the agreed $2-billion sale of its natural gas assets in Bangladesh to a Chinese consortium  as Dhaka weighs the prospect of a counterbid  people with knowledge of the matter said.",
        "date": "09272017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron may miss mid-October target to close sale of Bangladesh gas fields: sources "
    },
    {
        "content": "SINGAPORE  Sept 25 Crude oil production from the Permian basin in the United States is expected to rise by 1.4 million barrels per day (bpd) in 2020  from 2.4 million bpd at present  a Chevron executive said on Monday.",
        "date": "09252017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Permian basin output to rise by 1.4 million bpd in 2020 – Chevron "
    },
    {
        "content": "* China firm has Beijing green light for acquisition (Adds Chevron comment  paragraph 13; makes clear fields are onshore  paragraph 7)",
        "date": "09272017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron may miss mid-Oct target to close sale of Bangladesh gas fields -sources "
    },
    {
        "content": "DHAKA/BEIJING  Sept 27 Chevron Corp may miss its mid-October target for closing the agreed $2 billion sale of its natural gas assets in Bangladesh to a Chinese consortium as Dhaka weighs the prospect of a counterbid  people with knowledge of the matter said.",
        "date": "09272017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron may miss mid-Oct target to close sale of Bangladesh gas fields -sources "
    },
    {
        "content": "LONDON U.S. firm Chevron drilled its first exploration well this month in Iraqi Kurdistan after a two-year break  industry sources said  signaling its confidence in the area despite an international row over region's independence referendum plan.",
        "date": "09202017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron drills oil well in Iraqi Kurdish area after two-year gap: sources "
    },
    {
        "content": "LONDON  Sept 20 U.S. firm Chevron drilled its first exploration well this month in Iraqi Kurdistan after a two-year break  industry sources said  signalling its confidence in the area despite an international row over region's independence referendum plan.",
        "date": "09202017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron drills oil well in Iraqi Kurdish area after two-year gap - sources "
    },
    {
        "content": "* TOTAL SIGNS AGREEMENT WITH CHEVRON ON EXPLORATION IN DEEPWATER GULF OF MEXICO",
        "date": "09222017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Total signs agreement with Chevron on exploration in deepwater Gulf of Mexico‍​ "
    },
    {
        "content": "* ANNOUNCE ACQUISITION OF CHEVRON'S 100% OPERATED INTEREST IN ITS OIL PRODUCING ASSETS AT PUESTO FLORES AND ESTANCIA VIEJA",
        "date": "09212017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-President Energy says acquisition of Chevron's 100% operated interest in oil producing assets "
    },
    {
        "content": "* CHEVRON SELECTS DASSAULT SYSTÈMES’ 3DEXPERIENCE PLATFORM TO ACCELERATE NEW LUBRICANT PRODUCT DEVELOPMENT Source text for Eikon: Further company coverage: (Gdynia Newsroom)",
        "date": "09192017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron selects Dassault Systèmes’ 3DEXPERIENCE platform "
    },
    {
        "content": "BAKU  Sept 14 British oil major BP and Azeri state energy SOCAR on Thursday signed a contract extending its production sharing deal for Azerbaijan's biggest oilfields until 2050.",
        "date": "09142017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BP-led group signs Azerbaijan oilfield extension deal "
    },
    {
        "content": "BAKU  Sept 14 Azerbaijan's state energy firm SOCAR plans to more than double its share in a new production sharing agreement with BP for the development of the country's biggest oilfields  SOCAR First Vice-President Khoshbakht Yusifzadeh told reporters on Thursday.",
        "date": "09142017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Azerbaijan's SOCAR seeks 25 pct share in deal with BP on oil fields "
    },
    {
        "content": "ASTANA Kazakhstan wants oil majors led by Shell and ENI to improve their offer for ending a dispute over profit sharing in the Karachaganak gas project  Kazakh Energy Minister Kanat Bozumbayev said on Friday.",
        "date": "09082017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Kazakhstan seeks better offer from oil majors to end Karachaganak gas row "
    },
    {
        "content": "TBILISI/BAKU BP's stake in Azerbaijan's vast oilfields is expected to shrink under a new production-sharing agreement with state energy company SOCAR  two industry sources familiar with the talks told Reuters.",
        "date": "09082017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Exclusive: BP's stake in giant Azeri oilfields set to fall: sources "
    },
    {
        "content": "TBILISI/BAKU  Sept 8 Azeri state energy company SOCAR is expected to increase its share in a new production sharing agreement with oil major BP for development of the country's biggest oilfields  two industry sources familiar with the content of talks on the deal told Reuters.",
        "date": "09082017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Azerbaijan's SOCAR to boost its share in new deal with BP on oil fields "
    },
    {
        "content": "BEIRUT Lebanon's energy ministry has extended a deadline for bids in its first licensing round for offshore oil and gas exploration by four weeks to Oct. 12  the state-run National News Agency (NNA) reported on Friday.",
        "date": "09082017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Lebanon extends deadline for offshore oil exploration bids: NNA "
    },
    {
        "content": "NEW YORK Florida Attorney General Pam Bondi said on Thursday her office had received 45 complaints of inflated prices at Chevron Corp branded gasoline stations in the southern part of the state  as shortages worsened ahead of Hurricane Irma's expected U.S. landfall this weekend.",
        "date": "09072017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Florida cites complaints over Chevron gas prices as shortages mount "
    },
    {
        "content": "BEIRUT  Sept 8 Lebanon's energy ministry has extended a deadline for bids in its first licensing round for offshore oil and gas exploration by four weeks to Oct. 12  the state-run National News Agency (NNA) reported on Friday.",
        "date": "09082017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Lebanon extends deadline for offshore oil exploration bids - NNA "
    },
    {
        "content": "NEW YORK  Sept 7 Florida Attorney General Pam Bondi said on Thursday her office had received 45 complaints of inflated prices at Chevron Corp branded gasoline stations in the southern part of the state  as shortages worsened ahead of Hurricane Irma's expected U.S. landfall this weekend.",
        "date": "09072017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 4-Florida cites complaints over Chevron gas prices as shortages mount "
    },
    {
        "content": "WASHINGTON  Sept 7 Florida Attorney General Pam Bondi said on Thursday her office had received 45 complaints of inflated prices at Chevron gasoline stations in the southern part of the state where consumers are bracing for Hurricane Irma  expressing concern the company may be price gouging.",
        "date": "09072017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Consumers complaining of inflated gas prices at Chevron in Florida -state AG "
    },
    {
        "content": "* Govt wants to expand Arctic oil exploration (Recasts  adds analysts  detail  background)",
        "date": "08292017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-Norway's Arctic oil ambitions suffer setback as most promising well yields none "
    },
    {
        "content": "The Senate confirmation hearings for U.S. Supreme Court Justice Neil Gorsuch provided a rare moment in the spotlight for the Chevron doctrine  the Supreme Court’s holding that when laws are ambiguous  courts must defer to statutory interpretations from the executive-branch agencies Congress has empowered to enforce those laws. Justice Gorsuch  as you probably recall  argued as a judge on the 10th U.S. Circuit Court of Appeals that the Chevron doctrine may well be an unconstitutional ",
        "date": "08252017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "New SCOTUS brief in Dodd-Frank whistleblower case: SEC doesn’t deserve deference "
    },
    {
        "content": "HOUSTON  Aug 25 Chevron Corp said on Friday it does not expect Hurricane Harvey to affect its U.S. Gulf of Mexico production.",
        "date": "08252017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron does not expect Harvey to affect its Gulf production "
    },
    {
        "content": "HOUSTON Chevron Corp Chief Executive John Watson will step down by the end of next month and likely be replaced by Vice Chairman Mike Wirth  a source familiar with the matter told Reuters on Tuesday.",
        "date": "08222017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron CEO Watson to step down  Wirth likely successor: source "
    },
    {
        "content": "HOUSTON  Aug 22 Chevron Corp Chief Executive John Watson will step down by the end of next month and likely be replaced by Vice Chairman Mike Wirth  a source familiar with the matter told Reuters on Tuesday.",
        "date": "08222017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 3-Chevron CEO Watson to step down  Wirth likely successor -source "
    },
    {
        "content": "Aug 22 Chevron Corp Chief Executive John Watson is stepping down from his post atop the nation's second-largest oil company  according to a report from the Wall Street Journal.",
        "date": "08222017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron CEO John Watson to step down -WSJ "
    },
    {
        "content": "* Chevron CEO John Watson to step down; transition expected to be announced next month; successor not yet finalized - WSJ Source text - http://on.wsj.com/2g1SoyO Further company coverage:",
        "date": "08222017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron CEO John Watson to step down - WSJ "
    },
    {
        "content": "HOUSTON  Aug 16 Major oil producers pushed up high bids at a Gulf of Mexico offshore auction to $121 million on Wednesday  a nearly seven-fold increase from a year ago  as their return to deep water exploration gained momentum.",
        "date": "08162017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Oil producers signal offshore return in latest Gulf of Mexico auction "
    },
    {
        "content": "MEXICO CITY U.S. energy company Chevron Corp and trading firm Glencore on Thursday announced separate plans to enter Mexico's fuel market  as the long-hidebound sector begins to attract major foreign players.",
        "date": "08172017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Glencore  Chevron enter Mexico's recently opened fuel market "
    },
    {
        "content": "MEXICO CITY  Aug 17 U.S. energy company Chevron Corp and trading firm Glencore on Thursday announced separate plans to enter Mexico's fuel market  as the long-hidebound sector begins to attract major foreign players.",
        "date": "08172017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-Glencore  Chevron enter Mexico's recently opened fuel market "
    },
    {
        "content": "MELBOURNE Chevron Corp  has withdrawn an appeal to Australia's High Court over a disputed A$340 million ($268 million) tax bill  leaving in place a landmark court ruling on related-party loans that could affect other multinational companies.",
        "date": "08182017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Australia puts multinationals on notice after Chevron drops tax appeal "
    },
    {
        "content": "MEXICO CITY  Aug 17 U.S. energy company Chevron Corporation said on Thursday it is set to enter Mexico's recently opened fuel sector  by importing  distributing and selling refined products in partnership with a local gas station network it did not name.",
        "date": "08172017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron says to enter Mexican fuel market in local partnership "
    },
    {
        "content": "MELBOURNE  Aug 18 Chevron Corp has withdrawn an appeal to Australia's High Court over a disputed A$340 million ($268 million) tax bill  leaving in place a landmark court ruling on related-party loans that could affect other multinational companies.",
        "date": "08182017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Australia puts multinationals on notice after Chevron drops tax appeal "
    },
    {
        "content": "MELBOURNE  Aug 18 Chevron Corp has withdrawn an appeal to Australia's High Court over a disputed A$340 million ($268 million) tax bill      leaving in place a landmark court ruling on related-party loans that could affect other multinational companies.",
        "date": "08182017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron drops appeal over landmark Australian tax ruling "
    },
    {
        "content": "* Takes share stake of 2.5 million shares in Altaba - SEC filing",
        "date": "08142017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Soros Fund Management dissolves share stake in Chevron  Citi  Disney "
    },
    {
        "content": "* Jacobs receives expanded master services agreement to provide construction management for Chevron's U.S. refineries and terminals Source text for Eikon: Further company coverage:",
        "date": "08092017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Jacobs receives services agreement to provide construction management for Chevron "
    },
    {
        "content": "HOUSTON Exxon Mobil Corp  posted a rare earnings miss on Friday  the only international oil producer to do so last quarter  as production slipped in its African and Canadian operations. | Video ",
        "date": "07282017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Exxon Mobil profit disappoints Wall Street  Chevron shines "
    },
    {
        "content": "HOUSTON  July 28 Exxon Mobil Corp posted a rare earnings miss on Friday  the only international oil producer to do so last quarter  as production slipped in its African and Canadian operations.",
        "date": "07282017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "WRAPUP 2-Exxon Mobil profit disappoints Wall Street  Chevron shines "
    },
    {
        "content": "July 28 U.S. oil producer Chevron Corp swung to a quarterly profit on Friday as some costs fell and production jumped.",
        "date": "07282017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron swings to quarterly profit as costs drop "
    },
    {
        "content": "* Chevron Corp - ‍quarterly dividend of one dollar and eight cents​ Source text for Eikon: Further company coverage:",
        "date": "07262017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron reports quarterly dividend "
    },
    {
        "content": "* Still expects first production from Tengiz expansion in Kazakhstan in 2022",
        "date": "07282017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron sees steady growth in Permian Shale operations "
    },
    {
        "content": "July 28 Chevron Corp swung to a quarterly profit on Friday  helped largely by resurgence in oil and gas production as prices jumped and costs slipped.",
        "date": "07282017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron swings to quarterly profit as costs drop "
    },
    {
        "content": "* Q2 earnings per share view $0.87 -- Thomson Reuters I/B/E/S",
        "date": "07282017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron Q2 earnings per share $0.77 "
    },
    {
        "content": "July 24 California Department of Industrial Relations:",
        "date": "07242017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "CORRECTED-BRIEF-Cal/OSHA  Chevron reach settlement for plan to improve safety at Chevron Richmond refinery​ "
    },
    {
        "content": "LONDON After a brief respite at the start of the year  the world's top oil and gas companies are set to double down on cost cutting as a recovery in crude prices after a three-year slump falters.",
        "date": "07242017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "After false dawn  Big Oil to double down on cost cuts "
    },
    {
        "content": "* GRAPHIC: Oil companies dividend yield http://tmsnrt.rs/2ui9dZ8",
        "date": "07242017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "RPT-After false dawn  Big Oil to double down on cost cuts "
    },
    {
        "content": "COLOMBO  July 19 Sri Lankan shares fell on Wednesday to a one-month closing low  marking their sixth losing session in seven  led by the decline in Chevron Lubricants Lanka after it reported a drop in the June-quarter earnings.",
        "date": "07192017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Sri Lankan shares fall to 1-mth low; Chevron Lubricants leads "
    },
    {
        "content": "* Ensco Plc - Ensco DS-4 contracted to Chevron for two years Ensco DS-10 contracted to Shell for one year Ensco DS-7 to return to work with total​",
        "date": "07112017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Ensco announces three drillship contracts "
    },
    {
        "content": "SAO PAULO  July 6 Brazil's oil company Petróleo Brasileiro SA disclosed  on Thursday initial terms for a plan to sell its 70-percent stake in the Maromba oil field  at Campos basin  according to a securities filing.",
        "date": "07072017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Petrobras to sell stake at Maromba oil field  in Campos basin "
    },
    {
        "content": "WASHINGTON The U.S. Supreme Court on Monday handed a victory to Chevron Corp  by preventing Ecuadorean villagers and their American lawyer from trying to collect on an $8.65 billion pollution judgment issued against the oil company by a court in Ecuador.",
        "date": "06192017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "U.S. top court hands Chevron victory in Ecuador pollution case "
    },
    {
        "content": "* MRC Global Inc - has extended its worldwide master contract with Chevron Corporation for seven more years Source text for Eikon: Further company coverage:",
        "date": "06072017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-MRC Global renews global PVF contract with Chevron "
    },
    {
        "content": "NEW YORK  June 7 Works of art  furniture and decorative objects from the collection of the late David Rockefeller  the billionaire banker and philanthropist who was the last surviving grandchild of Standard Oil founder John D. Rockefeller  will be sold at auction next year  Christie's said on Wednesday.",
        "date": "06072017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Rockefeller art collection to be auctioned benefiting charities "
    },
    {
        "content": "June 2 Asian spot LNG prices edged lower this week as the early restart of Chevron's Gorgon production facility in Australia weighed on sentiment  projects offered supply and demand from Japan stayed weak.",
        "date": "06022017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "GLOBAL LNG-Prices inch lower as Gorgon plant restarts production "
    },
    {
        "content": "** Royal Dutch Shell has agreed to acquire Chevron's assets in Trinidad and Tobago  including its holdings in the East Coast Marine Area Blocks 6  5a and E  the company said",
        "date": "06022017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Shell buys Chevron's Trinidad and Tobago assets for $250 mln "
    },
    {
        "content": "A federal judge has dismissed a proposed class action against Chevron Corp alleging that participants in its $19 billion 401(k) plan lost millions of dollars because of conflicts of interest and excessive fees.",
        "date": "06012017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Judge tosses ERISA lawsuit over Chevron 401(k) plan "
    },
    {
        "content": "* Chevron corp says  an average of 97 percent of votes cast were voted for each of 12 nominees for election to board of directors at the annual meeting",
        "date": "05312017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron says average of 97 pct of votes cast were voted for each of 12 nominees for election to board at annual meeting "
    },
    {
        "content": "LONDON  May 31 Chevron has restarted the first production line at its giant Gorgon liquefied natural gas (LNG) export facility in Australia following an outage  a company spokesman said on Wednesday.",
        "date": "05312017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron resumes output from Gorgon LNG Train 1 ahead of time "
    },
    {
        "content": "BAKU  May 31 British oil company BP expects to sign a contract at the end of June extending its production sharing deal for Azerbaijan's biggest oilfields until 2050  the company's regional head said on Wednesday.",
        "date": "05312017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BP to sign Azerbaijan oilfield extension deal at end of June "
    },
    {
        "content": "CALGARY  Alberta Canadian equity markets risk being swamped with oil sands company shares this year as Royal Dutch Shell  and ConocoPhillips  prepare to offload C$6.8 billion ($5.1 billion) worth of stakes in two domestic producers  just months after acquiring them.",
        "date": "05252017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Shell  ConocoPhillips oil sands share selloff risks flooding market "
    },
    {
        "content": "ONITSHA  Nigeria  May 16 Nigerian workers from an oil labour union have extended a strike to oil majors Chevron  Shell and Eni subsidiary Agip in protest over the sacking of members from Exxon Mobil Corp  the union's general secretary said on Tuesday.",
        "date": "05162017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Nigerian oil workers extend Exxon Mobil strike to Chevron  Agip and Shell "
    },
    {
        "content": "ONITSHA  Nigeria  May 16 Nigerian workers from an oil labour union have extended a strike to oil majors Chevron   Shell and Eni subsidiary Agip in protest over the sacking of members from Exxon Mobil Corp   the union's general secretary said on Tuesday.",
        "date": "05162017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Nigerian oil workers extend Exxon Mobil strike to Chevron  Agip and Shell "
    },
    {
        "content": "* Signs global master services agreement with Chevron and is awarded conceptual engineering contracts for Tigris and Anchor",
        "date": "05172017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Wood Group wins a ten-year services contract from Chevron "
    },
    {
        "content": "LONDON  May 15 Chevron Corp has shut the first production line at its giant Gorgon liquefied natural gas (LNG) export plant in Australia and expects the outage to last about a month in order to replace a faulty device  a spokesman said on Monday.",
        "date": "05152017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron shuts first Gorgon LNG export plant unit for around a month "
    },
    {
        "content": "* Chevron Corp - On Nov 18  2016  co received an administrative order from the U.S. Environmental Protection Agency - SEC filing",
        "date": "05042017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron Corp says received an administrative order from U.S. EPA in Nov 2016 "
    },
    {
        "content": "OSLO Norway's Statoil  posted significantly better-than-expected quarterly results on Thursday  helped by a rise in output and higher crude prices  year-on-year.",
        "date": "05042017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Statoil first-quarter results handily beat estimates "
    },
    {
        "content": "HOUSTON Rising crude prices helped Chevron Corp and Exxon Mobil Corp easily beat analysts' quarterly profit expectations on Friday  setting an upbeat tone as the two companies press ahead with shale oil expansions.",
        "date": "05012017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Surging Chevron  Exxon profits signal oil industry turnaround "
    },
    {
        "content": "HOUSTON  April 28 Rising crude prices helped Chevron Corp and Exxon Mobil Corp easily beat analysts' quarterly profit expectations on Friday  setting an upbeat tone as the two companies press ahead with shale oil expansions.",
        "date": "04282017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "WRAPUP 3-Surging Chevron  Exxon profits signal oil industry turnaround "
    },
    {
        "content": "HOUSTON  April 28 Rising crude prices helped Chevron Corp and Exxon Mobil Corp easily beat analysts' quarterly profit expectations on Friday  setting an upbeat tone as the two companies press ahead with shale oil and liquefied natural gas expansions.",
        "date": "04282017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "WRAPUP 2-Surging Chevron  Exxon profits signal oil industry turnaround "
    },
    {
        "content": "HOUSTON  April 28 Rising crude prices helped Chevron Corp and Exxon Mobil Corp easily beat Wall Street's profit expectations on Friday  a sign the oil industry has regained its footing after a two-year price spiral.",
        "date": "04282017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "WRAPUP 1-Surging Chevron  Exxon profits signal oil industry turnaround "
    },
    {
        "content": "HOUSTON Oil producer Chevron Corp  posted a better-than-expected quarterly profit on Friday due to cost cuts  asset sales and rising crude prices .",
        "date": "04282017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron profit beats expectations on cost cuts  asset sales "
    },
    {
        "content": "HOUSTON  April 28 Oil producer Chevron Corp posted a better-than-expected quarterly profit on Friday due to cost cuts  asset sales and rising crude prices.",
        "date": "04282017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron profit beats expectations on cost cuts  asset sales "
    },
    {
        "content": "* Chevron corp - international upstream operations earned $1.4 billion in q1 2017  compared with a loss of $609 million a year earlier.",
        "date": "04282017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron Q1 earnings per share $1.41 "
    },
    {
        "content": "HOUSTON  April 28 Oil producer Chevron Corp said on Friday it swung to a first-quarter profit due to cost cuts and rising crude prices.",
        "date": "04282017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron swings to Q1 profit on cost cuts  rising oil prices "
    },
    {
        "content": "* Chevron - declared a quarterly dividend of one dollar and eight cents $1.08 per share Source text for Eikon: Further company coverage:",
        "date": "04262017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron announces quarterly dividend "
    },
    {
        "content": "HOUSTON/CARACAS As political turmoil in Venezuela mounts  oil firms including Norwegian major Statoil ASA  and Spain's Repsol SA  have further reduced their already-dwindling ranks of expatriate employees in the country  sources familiar with the situation said.",
        "date": "04262017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Some oil companies in Venezuela pull expats as unrest escalates: sources "
    },
    {
        "content": "Chevron Corp is selling its three Bangladesh gas fields  worth an estimated $2 billion  to a Chinese consortium as the U.S. oil and gas group looks to shed non-core assets this year.",
        "date": "04242017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron to sell Bangladesh gas fields to Chinese consortium "
    },
    {
        "content": "* Chevron says has agreed deal with Chinese-owned Himalaya Energy",
        "date": "04242017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron to sell Bangladesh gas fields to Chinese consortium "
    },
    {
        "content": "NEW DELHI  April 24 U.S. oil and gas company Chevron Corp said on Monday it has agreed to sell its three gas producing fields in Bangladesh to Chinese firm Himalaya Energy  as part of a plan to raise billions of dollars by shedding non-core properties this year.",
        "date": "04242017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron to sell Bangladesh gas fields to Chinese co "
    },
    {
        "content": "CALGARY  Alberta/TORONTO April 21 As international energy companies retreat from the Canadian oil sands sector because of depressed oil prices  a fast-shrinking universe of potential buyers may leave some stranded in the high-cost  capital-intensive sector.",
        "date": "04212017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "DEALTALK-Canada's oil sands acquisition pool dwindles as global firms flee "
    },
    {
        "content": "* Entered into an agreement to sell shares of its wholly-owned indirect subsidiaries operating in Bangladesh to Himalaya Energy Co. Ltd",
        "date": "04242017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron announces sale of wholly-owned Bangladesh units "
    },
    {
        "content": "TORONTO/CALGARY  April 20 BP Plc is considering the sale of its stakes in three Canadian oil sands projects  people familiar with the matter told Reuters this week  as part of the British oil company's strategy of retreating from noncore businesses.",
        "date": "04202017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-BP mulls sale of stakes in Canadian oil sands assets -sources "
    },
    {
        "content": "* KBR - awarded contract by PT Chevron Pacific Indonesia for engineering  construction management services for Chevron's operating fields in Sumatra",
        "date": "04192017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-KBR awarded contract by PT Chevron Pacific Indonesia "
    },
    {
        "content": "Chevron Corp  the second-largest U.S.-based oil company  sold its Canadian gasoline stations and refinery in British Columbia to Parkland Fuel Corp  a marketer of petroleum products  for C$1.46 billion ($1.09 billion).",
        "date": "04182017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Parkland Fuel to buy Chevron Canada's downstream fuel business "
    },
    {
        "content": "April 18 Chevron Corp  the second-largest U.S.-based oil company  sold its Canadian gasoline stations and refinery in British Columbia to Parkland Fuel Corp  a marketer of petroleum products  for C$1.46 billion ($1.09 billion).",
        "date": "04182017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Parkland Fuel to buy Chevron Canada's downstream fuel business "
    },
    {
        "content": "SINGAPORE  April 18 Chevron is restarting liquefied natural gas (LNG) production at its Gorgon Train Two facility in Australia  a company spokeswoman said on Tuesday.",
        "date": "04182017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "RPT-Chevron says restarting output at Gorgon Train Two LNG project in Australia "
    },
    {
        "content": "TORONTO/NEW YORK Chevron Corp   the second-largest U.S.-based oil producer  is exploring the sale of its 20 percent stake in Canada's Athabasca Oil Sands project  which could fetch about $2.5 billion  according to people familiar with the situation.",
        "date": "04132017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron exploring sale of Canada oil sands stake worth about $2.5 billion: sources "
    },
    {
        "content": "TORONTO/NEW YORK  April 13 Chevron Corp  the second-largest U.S.-based oil producer  is exploring the sale of its 20 percent stake in Canada's Athabasca Oil Sands project  which could fetch about $2.5 billion  according to people familiar with the situation.",
        "date": "04132017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron exploring sale of Canadian oil sands stake -sources "
    },
    {
        "content": "HOUSTON  April 11 Compensation for three of Chevron Corp's senior leaders  including Chief Executive John Watson  rose last year due to a change in how the value of pensions are calculated.",
        "date": "04112017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron executive pay rises in 2016 on value of pensions "
    },
    {
        "content": "* CEO John Watson's 2016 total compensation $24.7 million versus $22 million in 2015",
        "date": "04112017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron says CEO's 2016 total compensation $24.7 mln vs $22 mln in 2015 "
    },
    {
        "content": "BOSTON/BUENOS AIRES  April 10 Argentina’s state-run oil company YPF SA is among the bidders for Royal Dutch Shell Plc's refinery and network of gasoline stations in Argentina  according to two people familiar with the process.",
        "date": "04102017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "YPF among bidders for Shell's Argentina refinery -sources "
    },
    {
        "content": "HOUSTON  April 5 Nearly a century after Chevron Corp amassed the No. 2 stake in America's largest oilfield  Chief Executive John Watson is hitting the accelerator on developing the company's vast Permian Basin holdings.",
        "date": "04052017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron pivots to Permian shale as mega-project era fades "
    },
    {
        "content": "HOUSTON  April 5 Nearly a century after Chevron Corp amassed the No. 2 stake in America's largest oilfield  Chief Executive John Watson is hitting the accelerator on developing the company's vast Permian Basin holdings.",
        "date": "04052017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "RPT-Chevron pivots to Permian shale as mega-project era fades "
    },
    {
        "content": "CHIBA A supply gap is likely to open up in the liquefied natural gas (LNG) industry if new projects are not sanctioned  said Chevron Corp Vice Chairman Michael Wirth at a gas industry conference on Tuesday in Japan.",
        "date": "04042017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "LNG supply gap to open up if new projects not sanctioned: Chevron vice chairman "
    },
    {
        "content": "* Chevron Vice Chairman Michael Wirth says firm has opportunities to drive down \"everyday operating costs\"",
        "date": "04042017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "CORRECTED-BRIEF-Chevron has opportunities to drive down \"everyday operating costs\" - exec "
    },
    {
        "content": "CHIBA  April 4 A supply gap is likely to open up in the liquefied natural gas (LNG) industry if new projects are not sanctioned  said Chevron Corp Vice Chairman Michael Wirth at a gas industry conference on Tuesday in Japan.",
        "date": "04042017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "LNG supply gap to open up if new projects not sanctioned -Chevron vice chairman "
    },
    {
        "content": "* Chevron concludes sale of geothermal operations in Indonesia",
        "date": "03312017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron concludes sale of geothermal operations in Indonesia "
    },
    {
        "content": "SINGAPORE/BEIJING  March 30 China's Zhenhua Oil is setting up an oil trading office in Singapore that will start operating in April  three sources at the company said on Thursday.",
        "date": "03302017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "China's Zhenhua Oil setting up Singapore trading office -sources "
    },
    {
        "content": "SINGAPORE Chevron has temporarily suspended production of liquefied natural gas (LNG) at its Gorgon Train Two production line in Australia  the company said on Monday.",
        "date": "03272017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron suspends production at Gorgon Train Two LNG project "
    },
    {
        "content": "SINGAPORE  March 27 Chevron has temporarily suspended production of liquefied natural gas (LNG) at its Gorgon Train Two production line in Australia  the company said on Monday.",
        "date": "03272017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron suspends production at Gorgon Train Two LNG project "
    },
    {
        "content": "SINGAPORE  March 28 Chevron has started production of liquefied natural gas (LNG) from the third of three production units at the Gorgon LNG project in Australia  the company said on Tuesday.",
        "date": "03282017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron starts production at Gorgon Train Three LNG project "
    },
    {
        "content": "* Spot LNG supplies could rise on Train Three startup -traders   (Adds details on Train 2 outage  trader comments)",
        "date": "03282017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron starts production at Gorgon Train Three LNG project "
    },
    {
        "content": "* Toisa Ltd says Chevron Corp agreed to ratify its charter with co's united ideal vessel to cover a 30-day voyage from Arabian Gulf to South Africa  Source text for Eikon:  Further company coverage:",
        "date": "03232017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Toisa says Chevron agreed to ratify its charter with co's united ideal vessel to cover a 30-day voyage from Arabian Gulf to South Africa "
    },
    {
        "content": "HOUSTON  March 22 Royal Dutch Shell plc  Chevron Corp and Exxon Mobil Corp signaled the oil industry's return to the Gulf of Mexico's deep waters with high bids in a government auction up 76 percent over a year ago.",
        "date": "03232017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Major oil companies open their wallets in Gulf of Mexico bidding "
    },
    {
        "content": "BEIJING China's Sinopec   will pay almost $1 billion for a 75 percent stake in Chevron Corp's  South African assets and its subsidiary in Botswana to secure its first major refinery in Africa  the companies announced on Wednesday.",
        "date": "03222017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "China's Sinopec buys first major refinery in Africa from Chevron "
    },
    {
        "content": "BEIJING  March 22 China's Sinopec  will pay almost $1 billion for a 75 percent stake in Chevron Corp's South African assets and its subsidiary in Botswana to secure its first major refinery in Africa  the companies announced on Wednesday.",
        "date": "03222017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-China's Sinopec buys first major refinery in Africa from Chevron "
    },
    {
        "content": "CAPE TOWN  March 22 Chevron Global Energy  confirmed on Wednesday that it had signed a sales and purchase agreement with a wholly-owned subsidiary of China's Sinopec  for Chevron's assets in South Africa and Botswana.",
        "date": "03222017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron confirms sale of its South African assets to Sinopec "
    },
    {
        "content": "BEIJING  March 22 China Petroleum and Chemical Corp (Sinopec) said it reached an agreement to buy a 75 percent stake in Chevron Corp's South African assets for around $900 million.",
        "date": "03222017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "China's Sinopec to buy stake in Chevron's S.African oil assets for $900 mln "
    },
    {
        "content": "NEW YORK/SINGAPORE China's Sinopec is nearing a deal to buy Chevron's South African oil assets for up to $1 billion to secure its first major refinery on the continent  several people familiar with the matter said.",
        "date": "03172017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "China's Sinopec nears deal to buy Chevron's South African assets: sources "
    },
    {
        "content": "* Deal would give Sinopec first refinery in Africa   (Adds details  background)",
        "date": "03172017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-China's Sinopec nears deal to buy Chevron's South African assets -sources "
    },
    {
        "content": "NEW YORK/SINGAPORE  March 17 China Petroleum and Chemical Corp (Sinopec) is nearing an agreement to buy a majority stake in Chevron Corp's South African assets  which are estimated at $1 billion  two people familiar with the transaction said.",
        "date": "03172017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "China's Sinopec nears deal to buy Chevron's South African oil assets-sources "
    },
    {
        "content": "* Chevron Corp - Mafumeira Sul offshore Angola has a design capacity of 150 000 barrels of liquids and 350 million cubic feet of natural gas per day",
        "date": "03082017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron starts production at Mafumeira Sul offshore Angola "
    },
    {
        "content": "* Chevron CEO on CNBC says will make $30 billion investment in U.S. Over next four years",
        "date": "03072017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron CEO on CNBC says support tax reform  encouraged by Trump administration's \"pro business\" approach "
    },
    {
        "content": "* Chevron affirms production  margins  and cash flow growth plans",
        "date": "03072017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron affirms production  margins  cash flow growth plans "
    },
    {
        "content": "NEW YORK  March 1 Exxon Mobil Corp  the world's largest publicly traded oil producer  sought to reassure anxious investors on Wednesday about its growth potential  highlighting both short- and long-term projects executives said should continue to help fund the 106-year-old dividend.",
        "date": "03012017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 4-Exxon touts growth potential with eye toward dividend "
    },
    {
        "content": "SINGAPORE  Feb 24 Chevron has temporarily suspended production of liquefied natural gas (LNG) at its Gorgon Train Two production line in Australia  a company spokesman said in an email statement on Friday.",
        "date": "02242017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron suspends production at Gorgon Train Two LNG project - spokesman "
    },
    {
        "content": "Feb 23 Oil and gas producer Apache Corp said it would spend 63.2 percent more in 2017 than it did last year  joining a growing list of U.S. shale producers who are ramping up spending to take advantage of a recovery in oil prices.",
        "date": "02272017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "CORRECTED-UPDATE 1-Oil and gas producer Apache to spend 63.2 pct more this year "
    },
    {
        "content": "Feb 27 Liquefied natural gas production at Chevron's Gorgon Train Two project in Australia has resumed  a company spokesman said on Monday.",
        "date": "02272017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron says production at Gorgon Train Two LNG project has resumed "
    },
    {
        "content": "* Pursuing selected opportunities for divestment of additional properties in the U.S. in 2017 - SEC filing",
        "date": "02232017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron sees average worldwide oil-equivalent production in 2017 to grow 4-9 pct "
    },
    {
        "content": "BEIJING/DHAKA China's state-run Zhenhua Oil has signed a preliminary deal with Chevron  to buy the U.S. oil major's natural gas fields in Bangladesh that are worth about $2 billion  two Beijing-based Chinese oil executives said.",
        "date": "02222017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Exclusive: China state firm in preliminary deal to buy Chevron's Bangladesh gas fields - oil executives "
    },
    {
        "content": "Feb 22 The following bids  mergers  acquisitions and disposals were reported by 1430 GMT on Wednesday:",
        "date": "02222017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "LUANDA U.S. energy company Chevron is in talks with the Angolan government and state oil firm Sonangol to revise tax terms and any future investment will hinge on those talks  a senior company official was quoted as saying on Wednesday.",
        "date": "02222017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron  Angola government in tax  investment talks "
    },
    {
        "content": "LUANDA  Feb 22 U.S. energy company Chevron  is in talks with the Angolan government and state oil firm Sonangol to revise tax terms and any future investment will hinge on those talks  a senior company official was quoted as saying on Wednesday.",
        "date": "02222017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron  Angola government in tax  investment talks "
    },
    {
        "content": "* State Street Corporation reports 6.23 percent passive stake in Chevron Corp as of Dec 31  2016 - SEC filing  Source: (http://bit.ly/2kS9T5n) Further company coverage:",
        "date": "02092017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-State Street reports 6.23 pct passive stake in Chevron "
    },
    {
        "content": "MELBOURNE BHP Billiton on Thursday approved its $2.2 billion share of investment for the second phase of the Mad Dog oilfield in the Gulf of Mexico  as expected.",
        "date": "02092017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BHP Billiton approves $2.2 billion for U.S. Mad Dog oil project "
    },
    {
        "content": "* Will modularize new facilities to minimize construction in vicinity of operating refinery units and provide significant overall cost savings",
        "date": "02082017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Worleyparsons wins EPCM and fabrication contract with Chevron "
    },
    {
        "content": "MELBOURNE  Feb 9 BHP Billiton  on Thursday approved its $2.2 billion share of investment for the second phase of the Mad Dog oilfield in the Gulf of Mexico  as expected.",
        "date": "02092017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BHP Billiton approves $2.2 bln for U.S. Mad Dog oil project "
    },
    {
        "content": "* Sale of stake would mark Shell's exit from Denmark   (Adds DUC production figures)",
        "date": "02062017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-Shell looking to sell stake in Danish venture -banking sources "
    },
    {
        "content": "LONDON  Feb 6 Royal Dutch Shell is seeking to sell its stake in the Danish Underground Consortium (DUC)  an offshore oil and gas joint venture  in what would mark the company's effective exit from Denmark  three banking sources said.",
        "date": "02062017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Shell looking to sell stake in Danish venture -banking sources "
    },
    {
        "content": "London-listed DCC Plc  said it would buy the retail petrol station network of ExxonMobil's  Norwegian unit  Esso Norge AS  for 2.43 billion Norwegian crowns ($293.38 million).",
        "date": "02072017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "DCC to buy ExxonMobil's Norwegian retail petrol station network "
    },
    {
        "content": "DHAKA  Jan 30 Bangladesh is hiring an international firm to assess reserves at Chevron Corp's  natural gas fields in the country before  placing a formal bid to buy the assets  its energy minister told Reuters on Monday.",
        "date": "01302017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Bangladesh to bid for Chevron gas fields after assessing reserves "
    },
    {
        "content": "Jan 30 Oil and natural gas producer Chevron Corp  said it would give its top executive fewer stock options after shareholders expressed concern about executive pay.",
        "date": "01302017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron says to give CEO fewer stock options "
    },
    {
        "content": "* Chevron Corp says to decrease percentage of compensation awarded as stock options to \"reduce excessive volatility\" - SEC filing",
        "date": "01302017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron Corp says to decrease percentage of compensation awarded as stock options to \"reduce excessive volatility\" "
    },
    {
        "content": "Helped by rising oil prices  Chevron Corp  swung to a quarterly profit on Friday that still fell short of analyst expectations  dragging down the company's share price  and with it  the Dow Jones industrial average  index.",
        "date": "01272017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron profit miss hurts stock  Dow Jones index "
    },
    {
        "content": "* Chevron says approved annual base salary of $1.9 million for CEO John Watson  no increase from prior year  Source text for Eikon: (http://bit.ly/2kJNrM3) Further company coverage:",
        "date": "01302017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron says approved annual base salary of $1.9 million for CEO John Watson  no increase from prior year "
    },
    {
        "content": "Jan 27 Helped by rising oil prices  Chevron Corp  swung to a quarterly profit on Friday that still fell short of analyst expectations  dragging down the company's share price  and with it  the Dow Jones industrial average  index.",
        "date": "01272017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 4-Chevron profit miss hurts stock  Dow Jones index "
    },
    {
        "content": "* Chief Executive John Watson says top priority remains keeping & growing dividend",
        "date": "01272017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron CEO says top priority remains dividend "
    },
    {
        "content": "Jan 27 O produtor de petróleo e gás natural Chevron Corp anunciou esta sexta-feira que regressou a um lucro trimestral devido à subida de preços de 'commodities' e cortes de custos.",
        "date": "01272017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron regressa aos lucros trimestrais com subida preços petróleo "
    },
    {
        "content": "* Chevron names Michael K. Wirth vice chairman  Source text for Eikon:  Further company coverage:",
        "date": "01252017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron names Michael Wirth vice chairman "
    },
    {
        "content": "* Q4 earnings per share view $0.64 -- Thomson Reuters I/B/E/S",
        "date": "01272017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron reports Q4 earnings per share $0.22 "
    },
    {
        "content": "* Chevron corp - declared a quarterly dividend of one dollar and eight cents ($1.08) per share  Source text for Eikon:  Further company coverage:",
        "date": "01252017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron announces quarterly dividend "
    },
    {
        "content": "Jan 27 Oil and natural gas producer Chevron Corp  said on Friday it swung to a fourth-quarter profit due to rising commodity prices and cost cuts.",
        "date": "01272017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron swings to fourth-quarter profit on rising oil prices "
    },
    {
        "content": "* Size of board was increased to 12 members  effective February 1  2017  Source text: (http://bit.ly/2juAUu0) Further company coverage:",
        "date": "01262017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron Corp increases size of board to 12 members "
    },
    {
        "content": "ASTANA Kazakhstan has agreed to continue talks about a tax dispute with the Karachaganak consortium of oil majors led by Shell  and Eni  despite beginning arbitration proceedings  the Kazakh Energy Ministry said on Thursday.",
        "date": "01262017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Kazakhstan  Shell-Eni group continue talks over tax dispute "
    },
    {
        "content": "Jan 20 A Toronto court has rejected a bid by Ecuadorian villagers to enforce a judgment in their home country against Chevron Canada Ltd  ruling the subsidiary is not liable for parent Chevron Corp  the U.S. oil major said on Friday.",
        "date": "01212017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 3-Court rejects bid to enforce Ecuador judgment on Chevron Canada "
    },
    {
        "content": "Jan 20 A Canadian court has rejected an attempt by Ecuadorian communities to enforce a judgment against Chevron Corp  they obtained in their home country  saying the company's local subsidiary liable for the parent  the oil major said on Friday.",
        "date": "01202017",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Canada court rejects attempt to enforce Ecuador Chevron judgment "
    },
    {
        "content": "BUENOS AIRES  Jan 10 Argentina has clinched a deal with labor unions and energy companies aimed at luring investors to the Vaca Muerta shale  formation in Patagonia  one of the largest unconventional reserves in the world  the government said on Tuesday.",
        "date": "01102017",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Argentina clinches labor/subsidy deal to attract energy investment "
    },
    {
        "content": "MANILA Philippine property to banking conglomerate Ayala Corp  said on Friday two groups of companies in which its energy unit has stakes will acquire Chevron's  geothermal assets in Indonesia and the Philippines  earlier valued at $3 billion.",
        "date": "12232016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Indonesia  Philippine groups acquire Chevron's $3 billion geothermal assets "
    },
    {
        "content": "Oil and gas major Chevron Corp  on Wednesday announced a $19.8 billion capital and exploratory investment program for 2017  down 42 percent from its outlays in 2015.",
        "date": "12082016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron sets 2017 capital budget  in 4th year of spending cuts "
    },
    {
        "content": "Nov 14 Production at Chevron Corp's $54 billion Gorgon liquefied natural gas (LNG) export project has safely resumed operations following a temporary shutdown last week  a company spokesman said on Monday.",
        "date": "11142016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron's Gorgon LNG resumes production after brief outage "
    },
    {
        "content": "-- Note: Reuters has not verified this story and does not vouch for its accuracy.",
        "date": "11142016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "REFILE-MEDIA-Philippines' EDC  Aboitiz  Ayala bid to acquire Chevron's geothermal assets - Malaya "
    },
    {
        "content": "PARIS Italy's biggest utility Enel has decided not to bid for Indonesian geothermal assets being sold by U.S. energy giant Chevron Corp  Enel's CEO said on Thursday.",
        "date": "11042016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Enel pulls out of bidding for Chevron's Indonesian geothermal assets "
    },
    {
        "content": "PARIS  Nov 3 Italy's biggest utility Enel  has decided not to bid for Indonesian geothermal assets being sold by U.S. energy giant Chevron Corp  Enel's CEO said on Thursday.",
        "date": "11032016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 1-Enel pulls out of bidding for Chevron's Indonesian geothermal assets "
    },
    {
        "content": "PARIS  Nov 3 Italy's biggest utility Enel  has decided not to bid for Indonesian geothermal assets being sold by U.S. energy giant Chevron Corp  Enel's CEO said on Thursday.",
        "date": "11032016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Enel pulls out of bidding for Chevron's Indonesian geothermal assets "
    },
    {
        "content": "JAKARTA  Nov 3 Indonesia's PT Perusahaan Listrik Negara (PLN) has opted out of a tender for geothermal assets on offer from U.S. energy giant Chevron Corp  citing governance concerns  an official at the state electricity utility said on Thursday.",
        "date": "11032016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Indonesia's PLN pulls out of bid for Chevron geothermal units "
    },
    {
        "content": "MELBOURNE Woodside Petroleum said on Monday it faces an 8 percent rise in its expected costs on the Wheatstone LNG (liquefied natural gas) project in Australia  after operator Chevron Corp flagged total costs would jump to $34 billion.",
        "date": "10302016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron Wheatstone LNG cost blowout to $34 billion hits Woodside "
    },
    {
        "content": "MELBOURNE  Oct 31 Woodside Petroleum  said on Monday it faces an 8 percent rise in its expected costs on the Wheatstone LNG (liquefied natural gas) project in Australia  after operator Chevron Corp flagged total costs would jump to $34 billion.",
        "date": "10302016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron Wheatstone LNG cost blowout to $34 bln hits Woodside "
    },
    {
        "content": " ",
        "date": "10312016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Angola LNG production suspended for several weeks -Chevron "
    },
    {
        "content": "* Graphic http://tmsnrt.rs/2c0eSev   (Adds Shell CFO comment  updates shares)",
        "date": "11012016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "WRAPUP 3-Shell takes top earnings spot from Exxon as oil majors adapt to low prices "
    },
    {
        "content": "BUENOS AIRES Argentina's government is negotiating more flexible oil workers' contracts to woo investors to the Vaca Muerta shale fields and overcome an energy deficit  the head of one of the sector's most powerful unions told Reuters on Monday.",
        "date": "10312016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Argentina negotiates oil worker contracts in effort to woo investment "
    },
    {
        "content": "DHAKA Bangladesh is considering buying Chevron Corp's  interest in three natural gas fields in the country  worth an estimated $2 billion  two senior government officials said  as Dhaka looks to secure the supply of a critical source of energy.",
        "date": "10312016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Bangladesh considers buying Chevron's local natural gas assets: sources "
    },
    {
        "content": "DHAKA  Oct 31 Bangladesh is considering buying Chevron Corp's interest in three natural gas fields in the country  worth an estimated $2 billion  two senior government officials said  as Dhaka looks to secure the supply of a critical source of energy.",
        "date": "10312016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Bangladesh considers buying Chevron's local natural gas assets -sources "
    },
    {
        "content": "Japan Sept industrial output stalls in worrying sign for economy",
        "date": "10312016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Reuters Business News Schedule at 0430 GMT/00.30AM ET "
    },
    {
        "content": "* Nearly $11.5 billion recouped for Madoff victims   (Adds details on claims and recovery efforts  case citations  byline)",
        "date": "10282016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 2-Madoff trustee reaches $277 mln accord with money manager's family "
    },
    {
        "content": "HOUSTON Chevron Corp  reported a drop in quarterly profit on Friday that still beat expectations as cost cuts in the company's U.S. oil production division helped mitigate some of the impact of low crude prices .",
        "date": "10282016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron profit drops on weak oil price  but beats forecasts "
    },
    {
        "content": "HOUSTON  Oct 28 Chevron Corp reported a drop in quarterly profit on Friday that still beat expectations as cost cuts in the company's U.S. oil production division helped mitigate some of the impact of low crude prices.",
        "date": "10282016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "RPT-UPDATE 1-Chevron profit drops on weak oil price  but beats forecasts "
    },
    {
        "content": "Oct 28 The S&P 500 index and the Nasdaq opened lower on Friday weighed down by Amazon  while Chevron's strong results boosted the Dow.",
        "date": "10282016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "US STOCKS SNAPSHOT-S&P  Nasdaq open lower; Chevron lifts Dow "
    },
    {
        "content": "HOUSTON  Oct 28 Chevron Corp reported a drop in quarterly profit on Friday that still beat expectations as cost cuts in the company's U.S. oil production division helped mitigate some of the impact of low crude prices.",
        "date": "10282016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron profit drops on weak oil price  but beats forecasts "
    },
    {
        "content": "* Q3 earnings per share view $0.37 -- Thomson Reuters I/B/E/S",
        "date": "10282016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron reports Q3 earnings of $0.68 per share "
    },
    {
        "content": "HOUSTON  Oct 28 Oil producer Chevron Corp  said on Friday its quarterly profit fell 35 percent due to low crude prices.",
        "date": "10282016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron quarterly profit drops 35 percent on low oil prices "
    },
    {
        "content": "* Chevron announces increase in quarterly dividend  Source text for Eikon:  Further company coverage:",
        "date": "10262016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron announces increase in quarterly dividend "
    },
    {
        "content": "Oct 26 Chevron Corp will increase its quarterly dividend by a penny  to $1.08  payable on Dec. 12 to shareholders of record on Nov. 18  the company said on Wednesday. Its shares rose 0.4 percent to close Wednesday trading at $101.19.   (Reporting by Ernest Scheyder; Editing by Steve Orlofsky)",
        "date": "10262016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron increases quarterly dividend by a penny "
    },
    {
        "content": "CAPE TOWN  Oct 25 Total  Glencore  and Gunvor are bidding for a 75 percent stake in Chevron's South African downstream assets  which include a refinery  three industry sources told Reuters on Tuesday.",
        "date": "10252016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Total  Glencore and Gunvor bidding for Chevron's South African assets "
    },
    {
        "content": "RICHMOND  Calif. The land of liberal politics  electric cars and strict pollution controls might seem like an odd place to drop $1 billion into a 115-year-old oil refinery.",
        "date": "10242016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron sees big profits in California despite regulations "
    },
    {
        "content": "Oct 18 John Stumpf resigned from the boards of Chevron Corp and Target Corp a week after he quit Wells Fargo & Co as chief executive bowing to pressure over its sales tactics.",
        "date": "10182016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Wells Fargo ex-CEO John Stumpf resigns from Chevron  Target boards "
    },
    {
        "content": "NEW YORK  Oct 18 Chevron Corp completed an initial round of bidding on its Burnaby  British Columbia  refinery late last week  three people familiar with the process said on Tuesday.",
        "date": "10182016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron completes first bid round on British Columbia refinery "
    },
    {
        "content": "SINGAPORE Chevron Corp could this month start selling condensate produced at the Australian Gorgon gas field  trade sources said on Thursday.",
        "date": "10132016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron plans to start Gorgon condensate sales this month: sources "
    },
    {
        "content": "SINGAPORE  Oct 13 Chevron Corp could this month start selling condensate produced at the Australian Gorgon gas field  trade sources said on Thursday.",
        "date": "10132016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron plans to start Gorgon condensate sales this month -sources "
    },
    {
        "content": "DHAKA  Oct 13 Chevron Corp confirmed that the company is in \"commercial discussions\" regarding its Bangladesh assets  as the second-largest U.S. energy company moves forward with plans to sell assets amid a prolonged slump in energy prices.",
        "date": "10132016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron confirms is in discussions for potential Bangladesh sale "
    },
    {
        "content": "SAN FRANCISCO  Oct 6 Carl Ferrer  chief executive of advertising website Backpage.com  was arrested on Thursday on criminal charges including pimping  as authorities investigate the company which has been accused of facilitating sex trafficking of minors.",
        "date": "10062016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-Backpage.com CEO arrested over sex trafficking allegations "
    },
    {
        "content": "HOUSTON Chevron Corp  on Monday said it stands behind John Stumpf  a member of its board and the chief executive of bank Wells Fargo & Co   despite growing concerns about his leadership during a customer service scandal.",
        "date": "10042016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron supports director Stumpf despite Wells Fargo morass "
    },
    {
        "content": "HOUSTON  Oct 3 Chevron Corp on Monday said it stands behind John Stumpf  a member of its board and the chief executive of bank Wells Fargo & Co  despite growing concerns about his leadership during a customer service scandal.",
        "date": "10042016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron supports director Stumpf despite Wells Fargo morass "
    },
    {
        "content": "HOUSTON  Oct 3 Chevron Corp on Monday said it stands behind John Stumpf  a member of its board and the chief executive of bank Wells Fargo & Co  despite growing concerns about his leadership during a customer service scandal.",
        "date": "10032016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron supports director Stumpf despite Wells Fargo morass "
    },
    {
        "content": "BANGKOK  Sept 26 Thailand's military government will complete by September 2017 an auction for expiring oil and gas contracts held by Chevron Corp and PTT Exploration and Production  the country's energy minister said on Monday.",
        "date": "09262016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Thai petroleum concession auction to be completed by Sept.2017 - energy minister "
    },
    {
        "content": "CARACAS/HOUSTON  Sept 21 Venezuela's state oil company PDVSA said on Wednesday it has awarded $3.2 billion in contracts to drill wells in the Orinoco Belt  although sources close to the matter said some foreign partners had complaints the tender was rushed and there were structural problems that could hinder projects.",
        "date": "09212016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 3-Venezuela PDVSA awards $3.2 bln oil service contracts  protest brews "
    },
    {
        "content": " ",
        "date": "09022016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron LNG supply deal with China's ENN may boost spot market growth "
    },
    {
        "content": "NEW YORK  Aug 30 A U.S. judge has dismissed a lawsuit by Chevron Corp workers who said the oil company breached its fiduciary duties by putting costly and poorly performing investment options in a $19 billion employee savings plan.",
        "date": "08302016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron wins dismissal of claims of poor savings plan oversight "
    },
    {
        "content": "SINGAPORE Chevron Corp's  liquefied natural gas (LNG) supply deal with China's ENN LNG Trading Co may boost the formation of a spot market for the fuel in Asia.",
        "date": "08302016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron LNG supply deal with China's ENN may boost spot market growth "
    },
    {
        "content": "* Under terms of SPA  ENN will receive up to 0.65 million metric tons per annum (mtpa) of lng over 10 years",
        "date": "08292016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron and ENN sign LNG sales and purchase deal "
    },
    {
        "content": "BANGKOK  Aug 25 Thailand's military government plans to open bids in March 2017 for expiring oil and gas contracts held by Chevron Corp and PTT Exploration and Production  an energy ministry official said on Thursday.",
        "date": "08252016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Thailand to open bids for energy concessions in March 2017 "
    },
    {
        "content": "Aug 25 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "08252016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "PRESS DIGEST - Wall Street Journal - Aug 25 "
    },
    {
        "content": "SYDNEY  Aug 22 Australian construction company CIMIC Group said on Monday it had started court proceedings in the United States against Chevron Corp  and KBR Inc  seeking as much as A$1.86 billion ($1.42 billion) regarding a dispute over the jetty at the Gorgon LNG project in Western Australia.",
        "date": "08212016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Australia's CIMIC sues Chevron over $1.4bln Gorgon LNG construction dispute "
    },
    {
        "content": "* Exxon  Chevron  Hess said to be in joint bid for Mexican oil- Bloomberg  citing sources",
        "date": "08192016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Exxon  Chevron  Hess said to be in joint bid for Mexican oil- Bloomberg  citing sources "
    },
    {
        "content": "ONITSHA  Nigeria Aug 15 Protesters blocked the gate to offices of U.S. oil company Chevron in Nigeria's Niger Delta on Monday  widening a week-long demonstration to demand jobs and housing  a protest organizer and a community leader said.",
        "date": "08152016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Demonstration against Chevron in Nigeria's Delta widens - protest leader "
    },
    {
        "content": "ONITSHA  Nigeria Militants blew up another crude pipeline in Nigeria's Niger Delta  a youth and protest leader said on Thursday.",
        "date": "08112016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Militants blow up Nigeria pipeline  Chevron protest goes on "
    },
    {
        "content": "ONITSHA  Nigeria  Aug 11 Militants blew up another crude pipeline in Nigeria's Niger Delta  a youth and protest leader said on Thursday.",
        "date": "08112016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Militants blow up Nigeria pipeline  Chevron protest goes on "
    },
    {
        "content": "ONITSHA  Nigeria  Aug 11 Protesters blocked the entrance to a Chevron oil depot in Nigeria's restive Niger Delta for a third day on Thursday  demanding jobs and housing  a protest leader said.",
        "date": "08112016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Protesters block gate to Chevron oil depot in Nigeria for 3rd day "
    },
    {
        "content": "* Dr. Dambisa Moyo and Dr. Wanda M. Austin elected to Chevron's board of directors",
        "date": "08092016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron announces appointment of Dambisa Moyo  Wanda Austin to the board "
    },
    {
        "content": "VIENNA  Aug 9 Austrian energy group OMV  has agreed to sell most of its 50 percent stake in the British Rosebank field to Canada's Suncor Energy for as much as $215 million  OMV said on Tuesday.",
        "date": "08092016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "OMV agrees to sell 30 pct stake in British Rosebank field to Suncor "
    },
    {
        "content": "NEW YORK Chevron Corp persuaded a federal appeals court on Monday to block enforcement in the United States of an $8.65 billion Ecuadorean pollution judgment that it said  and which the court agreed  was obtained through bribery and fraud.",
        "date": "08082016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron wins U.S. ruling blocking $8.6 billion Ecuador rainforest award "
    },
    {
        "content": "Chevron Corp  the second-largest U.S. oil company  is selling some assets in Asia worth up to $5 billion  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "08042016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron to sell assets in Asia worth up to $5 billion: WSJ "
    },
    {
        "content": "Aug 4 Chevron Corp  the second-largest U.S. oil company  is selling some assets in Asia worth up to $5 billion  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "08042016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron to sell assets in Asia worth up to $5 bln-WSJ "
    },
    {
        "content": "Aug 4 Chevron Corp  the second-largest U.S. oil company  is planning to sell certain assets in Asia worth up to $5 billion  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "08042016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron to sell Asia assets worth up to $5 bln-WSJ "
    },
    {
        "content": "SAO PAULO  Aug 4 Ultrapar Participações SA   a large player in energy and infrastructure in Brazil  said on Thursday it will partner with Chevron Corp  to sell lubricants  additives and coolants in the Brazilian market.",
        "date": "08042016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Ultrapar to partner with Chevron in Brazil to sell lubricants "
    },
    {
        "content": "* Chevron to sell assets in Asia worth up to $5 billion - WSJ  citing sources",
        "date": "08042016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron to sell assets in Asia worth up to $5 bln - WSJ "
    },
    {
        "content": "* Executive Jay Johnson says expects to be 'near bottom' of 2016 production outlook",
        "date": "07292016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron reiterates goal to be cash flow neutral by 2017 "
    },
    {
        "content": "HOUSTON Chevron Corp  the second largest U.S.-based oil producer  posted a second-quarter loss on Friday  its largest since 2001  due to the slump in crude prices and refining income.",
        "date": "07292016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron posts largest quarterly loss since 2001 on weak oil prices "
    },
    {
        "content": "HOUSTON  July 29 Chevron Corp  the second largest U.S.-based oil producer  posted a second-quarter loss on Friday  its largest since 2001  due to the slump in crude prices and refining income.",
        "date": "07292016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "CORRECTED-UPDATE 1-Chevron posts largest quarterly loss since 2001 on weak oil prices "
    },
    {
        "content": "HOUSTON  July 29 Chevron Corp  the second-largest U.S.-based oil producer  posted a second-quarter loss on Friday  its largest since 2001  due to the slump in crude prices and refining income.",
        "date": "07292016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "CORRECTED-Chevron posts largest quarterly loss since 2001 on weak oil prices "
    },
    {
        "content": "* Dow down 0.17 pct  S&P down 0.02 pct  Nasdaq up 0.17 pct   (Updates to open)",
        "date": "07292016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "US STOCKS-Oil majors drag down S&P  Dow; tech stocks boost Nasdaq "
    },
    {
        "content": "* Futures: Dow down 60 pts  S&P down 5.5 pts  Nasdaq up 1.25 pts   (Adds details  comments  updates prices)",
        "date": "07292016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "US STOCKS-Wall St set to open lower on weak earnings  data "
    },
    {
        "content": "* Aims to increase returns on deepwater projects to 25 pct   (Adds quotes  details of projects)",
        "date": "07292016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Indonesia to start natural gas output from two deepwater fields "
    },
    {
        "content": "JAKARTA  July 29 Indonesia expects to start natural gas production from two deepwater fields this year and next  even as major oil companies are reviewing economics for other projects  a senior energy official said late on Thursday.",
        "date": "07292016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "CORRECTED-Indonesia to start producing natural gas from two projects - official "
    },
    {
        "content": "CARACAS/BOGOTA  July 26 Even for Venezuela's notoriously opaque economy  it was a sweetheart deal that went too far.",
        "date": "07262016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "SPECIAL REPORT-In Venezuela's murky oil industry  the deal that went too far "
    },
    {
        "content": "* Declares a quarterly dividend of $1.07  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07272016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron declares quarterly dividend of $1.07 "
    },
    {
        "content": "HOUSTON Hess Corp said on Wednesday it was pursuing legal action against Schlumberger NV for $40 million or more  claiming the oilfield service provider supplied a defective valve for a U.S. Gulf of Mexico oilfield that shuttered three wells and crimped production.",
        "date": "07272016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Hess seeks over $40 mln from Schlumberger in valve dispute "
    },
    {
        "content": "HOUSTON Hess Corp said on Wednesday it was pursuing legal action against Schlumberger NV for $40 million or more  claiming the oilfield service provider supplied a defective valve for a U.S. Gulf of Mexico oilfield that shuttered three wells and crimped production.",
        "date": "07272016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Hess seeks over $40 million from Schlumberger in valve dispute "
    },
    {
        "content": "HOUSTON  July 27 Hess Corp said on Wednesday it was pursuing legal action against Schlumberger NV  for $40 million or more  claiming the oilfield service provider supplied a defective valve for a U.S. Gulf of Mexico oilfield that shuttered three wells and crimped production.",
        "date": "07272016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Hess seeks over $40 mln from Schlumberger in valve dispute "
    },
    {
        "content": "HOUSTON  July 27 Hess Corp said on Wednesday it was pursuing legal action against Schlumberger NV  for as much as $40 million  claiming the oilfield service provider supplied a defective valve for a U.S. Gulf of Mexico oilfield that shuttered three wells and crimped production.",
        "date": "07272016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Hess seeks up to $40 mln from Schlumberger in dispute over well valve "
    },
    {
        "content": "CAPE TOWN South African energy workers plan to strike indefinitely from Thursday over pay  the union representing them said  a stoppage that will potentially hit oil refineries of companies including Shell  BP Chevron and Sasol.",
        "date": "07272016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "South Africa oil workers' strike could hit refineries "
    },
    {
        "content": "* Shell  BP  Chevron and Sasol plants may be hit   (Adds employer body's comments  details)",
        "date": "07272016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-South Africa oil workers' strike could hit refineries "
    },
    {
        "content": "CARACAS  July 23 Ecuador has paid $112 million to energy company Chevron Corp over a four-decade-old contract dispute  even though it remains in disagreement  the head of the central bank has said.",
        "date": "07232016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Ecuador pays $112 million award to Chevron - central bank "
    },
    {
        "content": "MELBOURNE/MILAN/LONDON - Forced to shut its $54 billion Gorgon liquefied natural gas (LNG) export plant twice in its first five months  Chevron Corp now faces calls from union officials for a probe into the site's safety.",
        "date": "07212016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Exclusive: Chevron's giant Australia LNG plant facing union calls for safety checks "
    },
    {
        "content": "* Jovo is expected to receive up to 0.5 million metric tons per annum of lng over five years",
        "date": "07202016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron and JOVO sign LNG agreement "
    },
    {
        "content": "* Announced on Wednesday an agreement with Chevron  to manage and operate Chevron's existing 509 000 cbm terminal in Panama",
        "date": "07142016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Vopak strengthens presence in Panama "
    },
    {
        "content": "July 6 Nigerian militant group Niger Delta Avengers said on Wednesday that it had blown up Chevron Corp's manifolds RMP 22  23 and 24.",
        "date": "07062016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Nigerian militant group blow up three Chevron manifolds "
    },
    {
        "content": " ",
        "date": "07052016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 1-Sasol mulling bid for Chevron's South African assets "
    },
    {
        "content": " ",
        "date": "07052016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Nigerian militants say they blew up oil facilities near Warri "
    },
    {
        "content": "LAGOS Nigerian militant group the Niger Delta Avengers said on Tuesday it had blown up a Chevron well and oil pipelines near the city of Warri in the country's southern oil hub.",
        "date": "07052016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Nigerian militants say they blew up oil facilities near Warri "
    },
    {
        "content": "July 5 A Nigerian militant group said it has blown up a Chevron Corp well near the Otunana flowstation.",
        "date": "07052016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Nigerian militants say they blew up Chevron well "
    },
    {
        "content": "* Chevron approves next major Tengiz expansion project in Kazakhstan",
        "date": "07052016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron approves next major Tengiz expansion project in Kazakhstan "
    },
    {
        "content": "ASTANA  July 5 Kazakhstan and a group of oil majors led by Chevron have approved a $36.8 billion plan to boost production at the Tengiz oil field  the Central Asian nations's Energy Ministry and foreign partners said in a joint statement on Tuesday.",
        "date": "07052016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Kazakhstan  Chevron-led group approve $37 bln Tengiz expansion "
    },
    {
        "content": "JOHANNESBURG  July 1 The heads of South Africa's state-owned Strategic Fuel Fund resigned on Friday  a day after the Department of Energy said it would investigate the fund's unauthorised bid to buy Chevron's assets in the country.",
        "date": "07012016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Heads of South Africa's fuel fund resign after making Chevron bid "
    },
    {
        "content": "JOHANNESBURG Petrochemicals firm Sasol  said on Friday it was considering buying a majority stake in Chevron's  South African assets  including a 110 000 barrels-per-day oil refinery and retail stations.",
        "date": "07012016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Sasol mulling bid for Chevron's South African assets "
    },
    {
        "content": "CAPE TOWN  June 29 South Africa's Strategic Fuel Fund has expressed interest in purchasing a 75 percent stake in Chevron's downstream assets  the government-owned firm said on Wednesday.",
        "date": "06292016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "South African state company to buy Chevron's stake in oil refinery "
    },
    {
        "content": "JOHANNESBURG  July 1 Petrochemicals firm Sasol  said on Friday it was considering buying a majority stake in Chevron's South African assets  including a refinery and retail stations.",
        "date": "07012016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "South Africa's Sasol considers snapping up Chevron's assets "
    },
    {
        "content": "SYDNEY Chevron on Friday suspended production at Australia's Gorgon liquefied natural gas (LNG) export facility after a leak but remained on track to make a second shipment in coming days  it said.",
        "date": "07012016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron suspends Gorgon LNG production after gas leak "
    },
    {
        "content": "* Chevron says no injuries after workers evacuated   (Releads with production suspension)",
        "date": "07012016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-Chevron suspends Gorgon LNG production after gas leak "
    },
    {
        "content": "* South Africa's state-owned Strategic Fuel Fund said has interest in buying Chevron's stake in a Cape Town oil refinery- Bloomberg  citing statement  Source text : (http://bloom.bg/29cdsPy) Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06292016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Strategic Fuel Fund interested in buying Chevron's stake in Cape Town refinery- Bloomberg "
    },
    {
        "content": "JAKARTA  June 29 Indonesia's president on Wednesday ordered an expansion of offshore oil exploration and commercial fishing in the waters near the Natuna Islands  the latest in a new campaign to assert sovereignty over the area in the South China Sea.",
        "date": "06292016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Indonesia to step up oil exploration  fishing in South China Sea waters "
    },
    {
        "content": "* Leak at Gorgon LNG but Chevron says next cargo to ship soon",
        "date": "07012016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-Stronger North Asian demand  Gorgon gas leak lift Asian LNG prices "
    },
    {
        "content": "JOHANNESBURG South Africa's state-owned Strategic Fuel Fund (SFF) will face an investigation by its shareholder for making a bid to buy Chevron's local assets without seeking clearance  a government official said on Thursday.",
        "date": "06302016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Strategic Fuel Fund's bid for Chevron South Africa assets faces probe "
    },
    {
        "content": "SYDNEY  July 1 A gas leak has occurred at the Gorgon liquefied natural gas (LNG) export project on Barrow Island in Australia  Chevron said.",
        "date": "07012016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron confirms leak at its Gorgon gas project in Australia "
    },
    {
        "content": "JOHANNESBURG  June 30 South Africa's state-owned Strategic Fuel Fund (SFF) will face an investigation by its shareholder for making a bid to buy Chevron's local assets without seeking clearance  a government official said on Thursday.",
        "date": "06302016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Strategic Fuel Fund's bid for Chevron South Africa assets faces probe "
    },
    {
        "content": "JOHANNESBURG  June 30 South Africa's energy department said on Thursday the state-owned Strategic Fuel Fund's (SFF) had not been cleared to make an offer to buy 75 percent of Chevron's refinery and other downstream assets.",
        "date": "06302016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Strategic Fuel Fund's bid for Chevron assets not approved - S.Africa govt "
    },
    {
        "content": "* Notes with concern concern the reports regarding the SFF's expression of interest in the Chevron assets",
        "date": "06302016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-S.Africa's energy department to investigate SFF's offer for Chevron assets "
    },
    {
        "content": "JOHANNESBURG  June 29 South Africa's state-owned Strategic Fuel Fund (SFF) said on Wednesday it had offered to buy Chevron's majority stake in the country's oil refinery in Cape Town and other downstream assets as well as those in neighbouring countries.",
        "date": "06302016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-South Africa's Strategic Fuel Fund bids for Chevron refinery "
    },
    {
        "content": "WASHINGTON The U.S. Securities and Exchange Commission on Monday approved a rule requiring oil  gas and mining companies to disclose payments made to foreign governments  capping a process stalled in the courts for years.",
        "date": "06272016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "U.S. SEC adopts rule on oil  mining payments to foreign governments "
    },
    {
        "content": "WASHINGTON  June 27 The U.S. Securities and Exchange Commission on Monday approved a rule requiring oil  gas and mining companies to disclose payments made to foreign governments  capping a process stalled in the courts for years.",
        "date": "06272016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-U.S. SEC adopts rule on oil  mining payments to foreign governments "
    },
    {
        "content": " ",
        "date": "06242016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Australia in sweet spot to meet Asia demand for ultra-light oil "
    },
    {
        "content": "NEW YORK Global oil majors Chevron Corp and Royal Dutch Shell Plc are putting small refineries on the auction block as they look to trim lower-margin assets in the face of headwinds from rising crude oil prices.",
        "date": "06172016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Global oil majors look to shed refineries as crude prices rebound "
    },
    {
        "content": "WASHINGTON  June 6 The U.S. Supreme Court on Monday rejected Ecuador's challenge to a $96 million international arbitration award in favor of energy company Chevron Corp in a dispute over the development of oil fields in the South American country.",
        "date": "06062016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "U.S. top court rejects Ecuador challenge to Chevron arbitration award "
    },
    {
        "content": "SAO JOAO DA BARRA  Brazil Chevron Corp plans to sign a five-year agreement to lease berthing space for its vessels from U.S. oil service company Edison Chouest Offshore  Chouest's head of Brazilian operations Ricardo Chagas said on Tuesday.",
        "date": "06072016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron to lease Chouest oil vessel base at Acu in Brazil "
    },
    {
        "content": "LUANDA The managing director of Chevron's Angola subsidiary has said he supports the direction state oil firm is taking after  President Jose Eduardo dos Santos appointed his daughter to head the company.",
        "date": "06052016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Head of Chevron' Angola unit backs state oil firm after dos Santos appointment "
    },
    {
        "content": "WASHINGTON  June 6 The U.S. Supreme Court on Monday let stand a $96 million  international arbitration award issued in 2011 in favor of energy company Chevron Corp  in a dispute over the development of oil fields in Ecuador.",
        "date": "06062016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-U.S. top court rejects Ecuador challenge to Chevron arbitration award "
    },
    {
        "content": "SAO JOAO DA BARRA  Brazil  June 7 Chevron Corp  plans to sign a five-year agreement to lease berthing space for its vessels from U.S. oil service company Edison Chouest Offshore  Chouest's head of Brazilian operations Ricardo Chagas said on Tuesday.",
        "date": "06072016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron to lease Chouest oil vessel base at Acu in Brazil "
    },
    {
        "content": "SAO JOAO DA BARRA  Brazil  June 7 Chevron  plans to sign a 5-year agreement to lease berthing space for its vessels from U.S. oil service company Edison Chouest Offshore  Chouest's head of Brazilian operations said on Tuesday.",
        "date": "06072016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron to lease Chouest's oil vessel base at Acu in Brazil "
    },
    {
        "content": "* Skechers performance extends partnership with the chevron houston marathon and aramco houston half marathon  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06072016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Skechers Performance extends partnership with Chevron  Aramco Houston marathons "
    },
    {
        "content": "LUANDA  June 5 The managing director of Chevron's Angola subsidiary has said he supports the direction state oil firm is taking after  President Jose Eduardo dos Santos appointed his daughter to head the company.",
        "date": "06052016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Head of Chevron' Angola unit backs state oil firm after dos Santos appointment "
    },
    {
        "content": "* Up to six more cargoes may be offered by Angola -trader   (Adds company statement)",
        "date": "06062016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-Angola LNG returns to global market with first post-shutdown cargo "
    },
    {
        "content": "BEIJING  June 7 Chevron corporation's  fully-owned subsidiary Unocal East China Sea will ramp up production in the Luojiazhai and Gunziping gas fields  its biggest investment in China  the firm said on Tuesday.",
        "date": "06072016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron to ramp up gas production in China's southwest Chuandongbei project "
    },
    {
        "content": "LUANDA  June 5 The managing director of Chevron's Angola subsidiary has said he supports the direction state oil firm is taking after  President Jose Eduardo dos Santos appointed his daughter to head the company.",
        "date": "06052016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Head of Chevron' Angola subsidiary says supports direction state oil firm taking "
    },
    {
        "content": "YENAGOA  Nigeria A Nigerian militant group said on Wednesday that it had blown  up two Chevron oil wells in the second such attack in a week on the company's facilities in Nigeria's oil-producing Delta region.",
        "date": "06012016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Nigerian militant group says it blew up two Chevron wells "
    },
    {
        "content": "YENAGOA  Nigeria  June 1 A Nigerian militant group said on Wednesday that it had blown  up two Chevron  oil wells in the second such attack in a week on the company's facilities in Nigeria's oil-producing Delta region.",
        "date": "06012016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-Nigerian militant group says it blew up two Chevron wells "
    },
    {
        "content": "* Stockholder proposals on targets for reducing greenhouse gas emissions  climate change impact assessment  lobbying not approved - SEC filing  Source text for Eikon: (http://1.usa.gov/1TKjsKC) Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06012016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron stockholder proposals for reducing greenhouse gas emissions not approved - SEC filing "
    },
    {
        "content": "BANGKOK  May 30 Thailand's military government plans to put petroleum concessions held by Chevron Corp  and PTT Exploration and Production Pcl up for auction  energy minister Anantaporn Kanjanarat said on Monday.",
        "date": "05302016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Thailand to auction petroleum concessions held by Chevron  PTTEP "
    },
    {
        "content": "* Decision taken in interest of transparency   (Adds companies comments in para 6)",
        "date": "05302016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-Thailand to auction petroleum concessions held by Chevron  PTTEP "
    },
    {
        "content": "Shareholders of Exxon Mobil Corp  and Chevron Corp   two of the world's largest oil producers  will vote on Wednesday on a raft of proposals designed to push the companies to respond more proactively to climate change risks and regulations.",
        "date": "05252016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Factbox: Climate change proposals for Exxon  Chevron shareholders "
    },
    {
        "content": "DALLAS/SAN RAMON  Calif. May 25 Voters at Exxon Mobil's annual meeting approved a measure on Wednesday to let minority shareholders nominate outsiders for seats on the company's board  meaning a climate activist could eventually become a director at the oil giant.",
        "date": "05252016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Exxon shareholders OK measure that could put climate expert on board "
    },
    {
        "content": "BANGKOK  May 25 Thailand wants to negotiate a better return from its petroleum concessions held by Chevron Corp and Thailand's PTT Exploration and Production   the Energy Minister said on Wednesday.",
        "date": "05252016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Thailand considers options for petroleum concession deals "
    },
    {
        "content": "Shareholders of Exxon Mobil Corp  and Chevron Corp   two of the world's largest oil producers  will vote on Wednesday on a raft of proposals designed to push the companies to respond more proactively to climate change risks and regulations.",
        "date": "05242016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Factbox: Climate change proposals for Exxon  Chevron shareholders "
    },
    {
        "content": "PHILADELPHIA - The Federal Reserve will likely raise interest rates two or three times this year  another top Fed official said  reinforcing the central bank's message it is getting ready to act now that the U.S. economy has recovered from a weak winter. (USA-FED/HARKER  moved  225 words)",
        "date": "05242016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Reuters Business News Schedule at 0430 GMT/00.30AM ET "
    },
    {
        "content": "LAGOS/YENAGOA  Nigeria Nigeria's government needs to address grievances in the oil-producing Niger Delta  its oil minister said on Thursday  hours after a Chevron source said a militant attack had forced it to shut its onshore operations in the restive region.",
        "date": "05262016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Nigeria minister wants Delta grievances addressed as Chevron attacked "
    },
    {
        "content": "LAGOS/YENAGOA  Nigeria  May 26 Nigeria's government needs to address grievances in the oil-producing Niger Delta  its oil minister said on Thursday  hours after a Chevron source said a militant attack had forced it to shut its onshore operations in the restive region.",
        "date": "05262016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 5-Nigeria minister wants Delta grievances addressed as Chevron attacked "
    },
    {
        "content": "YENAGOA  Nigeria Chevron's onshore activities in Nigeria's Niger Delta have been shut down by a militant attack on an electricity power line leading to its Escravos terminal  a company source said on Thursday.",
        "date": "05262016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron Nigeria facilities 'grounded' by attack: source "
    },
    {
        "content": "YENAGOA  Nigeria  May 26 Chevron's  onshore activities in Nigeria's Niger Delta have been shut down by a militant attack on an electricity power line leading to its Escravos terminal  a company source said on Thursday.",
        "date": "05262016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron Nigeria facilities \"grounded\" by attack - source "
    },
    {
        "content": "LAGOS  May 26 A militant group has purportedly claimed a new attack on a Chevron oil facility in Nigeria's restive Delta region  a message on a Twitter feed previously used by the group to take credit for strikes against oil facilities said.",
        "date": "05262016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Militant group purportedly claims new attack in Nigeria's Delta "
    },
    {
        "content": "MANILA  May 16 Aboitiz Power Corp  one of the Philippines' biggest power producers  said it is interested in acquiring Chevron Corp's Indonesia and Philippine geothermal assets that are up for sale but wants to see the terms before making offers.",
        "date": "05162016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 1-Aboitiz interested in Chevron's Indonesian  Philippine geothermal assets "
    },
    {
        "content": "SINGAPORE  May 18 Chevron has begun to restart its Gorgon liquefied natural gas (LNG) export facility in Australia following an unplanned shutdown in April  the U.S. energy major said.",
        "date": "05182016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "RPT-UPDATE 1-Australia's Gorgon LNG export facility restarting operations -Chevron "
    },
    {
        "content": "MANILA  May 16 Aboitiz Power Corp  one of the Philippines' biggest power producers  said on Monday it would take a look at the Asian geothermal assets that Chevron will be selling  as it  plans to expand its clean energy portfolio.",
        "date": "05162016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Philippines' Aboitiz Power interested in Chevron's geothermal assets "
    },
    {
        "content": "* Next export cargoes not likely until June   (Adds detail  background  prices)",
        "date": "05182016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Australia's Gorgon LNG export facility restarting operations -Chevron "
    },
    {
        "content": "SINGAPORE  May 18 Chevron has begun to restart its Gorgon liquefied natural gas (LNG) export facility in Australia following its unplanned shutdown in April  the U.S. energy major said on Wednesday.",
        "date": "05182016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Australia's Gorgon LNG export facility restarting operations -Chevron "
    },
    {
        "content": "YENAGOA  Nigeria An explosion rocked a Chevron oil pipeline in Nigeria's restive Delta region on Friday  a security source said  the second blast at a facility of the U.S. oil major within a week  feeding concern over a revived militant campaign in the area.",
        "date": "05132016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Blast hits Chevron oil facility in Nigeria's Delta: security source "
    },
    {
        "content": "* Baldwin Brothers Inc urge chevron shareholders to vote \"for\" proposal  asks to prioritize profitability  value over growth in light of potential for significant stranded carbon assets  Source text: http://1.usa.gov/1T6SV9W Further company coverage:",
        "date": "05112016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Baldwin Brothers urge Chevron shareholders to vote for proposal 9 "
    },
    {
        "content": "YENAGOA  Nigeria  May 13 An explosion rocked a Chevron oil pipeline in Nigeria's restive Delta region on Friday  a security source said  the second blast at a facility of the U.S. oil major within a week  feeding concern over a revived militant campaign in the area.",
        "date": "05132016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Blast hits Chevron oil facility in Nigeria's Delta -security source "
    },
    {
        "content": "May 13 Petrobras officials  including Chief Financial Officer Ivan Monteiro spoke with investors and analysts via conference call on Friday about the state-controlled oil company's 1.25 billion first-quarter loss announced late Thursday. Here are some highlights from the call:",
        "date": "05132016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Brazil's Petrobras expects year end 2016 cash of $21 bln "
    },
    {
        "content": "NEW YORK  May 13 (IFR) - Oil and gas producer Chevron had a tough time selling debt in the high-grade bond market this week in the wake of heavy supply  the weak performance of some newly minted energy bonds and a lack of conviction about the recent rally in the sector's credits.",
        "date": "05132016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "REFILE-Investors stand firm on Chevron "
    },
    {
        "content": "YENAGOA  Nigeria Militants attacked a Chevron  platform in Nigeria's oil-rich Niger Delta region late on Wednesday  the U.S. energy company said on Thursday  amid growing fears of a revived militant campaign in the region.",
        "date": "05052016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Militants attack Chevron platform in Nigeria's oil-rich Niger Delta "
    },
    {
        "content": "MELBOURNE Chevron Corp has appointed a new chief executive for its Australian operations after starting production at its $54 billion Gorgon liquefied natural gas (LNG) project  which last month ran into trouble after shipping one cargo.",
        "date": "05052016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron taps new boss for Australia after Gorgon LNG starts up "
    },
    {
        "content": "* Alexander B. Cummings Jr. notified board that he was resigning as a director of Chevron effective immediately  Source - http://1.usa.gov/1riLdCk Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "05032016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron - Director Alexander B. Cummings Jr. notified Board of resignation "
    },
    {
        "content": "* Says Board decreased the number of directors on the board to ten directors",
        "date": "05032016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron says Board decreased the number of directors to ten "
    },
    {
        "content": "OSLO Norway's $872-billion sovereign wealth fund  the world's largest  said it would press U.S. oil majors ExxonMobil and Chevron to do more to report on the risks of climate change.",
        "date": "05032016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Norway wealth fund turns up climate heat on Exxon and Chevron "
    },
    {
        "content": "* Says acquires white oils and food machinery lubricants business from Chevron",
        "date": "05032016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Fuchs Petrolub buys white oils business from Chevron "
    },
    {
        "content": "OSLO  May 3 Norway's $872 billion sovereign wealth fund gave its backing on Tuesday to three shareholder proposals aimed to change corporate governance and climate policies at U.S. oil major Exxon Mobil.",
        "date": "05032016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Norway's wealth fund backs shareholder proposals at Exxon  Chevron "
    },
    {
        "content": "HOUSTON Exxon Mobil Corp and Chevron Corpon Friday reported their most dismal quarterly results in more than a decade on low oil prices and an oversupplied fuel market that hurt what had been lucrative refining margins.",
        "date": "04292016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Refining's silver lining loses luster at Exxon and Chevron "
    },
    {
        "content": "HOUSTON Oil and gas producer Chevron Corp  on Friday posted an adjusted profit that fell short of Wall Street's expectations  as its cost cuts failed to fully offset low crude prices  and weak refining margins.",
        "date": "04292016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron adjusted profit misses expectations "
    },
    {
        "content": "* Q1 earnings per share view $-0.20 -- Thomson Reuters I/B/E/S",
        "date": "04292016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron reports Q1 loss per share $0.39 "
    },
    {
        "content": "* Declared a quarterly dividend of one dollar and seven cents ($1.07) per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04272016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron declares qtrly dividend of $1.07 per share "
    },
    {
        "content": "DHAKA  April 25 Bangladesh has increased security at its largest natural gas field  which is operated by Chevron  the government said on Monday  citing a rare threat by a militant group operating in neighbouring India.",
        "date": "04252016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Bangladesh tightens security at gas field after militant threat "
    },
    {
        "content": "April 21 A former Chevron Corp trader and an oil company consultant have been arrested and charged with running a kickback scheme that allegedly enriched them while cheating Chevron out of the full value of trades  U.S. authorities said on Thursday.",
        "date": "04212016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Ex-oil trader  consultant charged with conspiracy to defraud Chevron "
    },
    {
        "content": "HOUSTON  April 19 Chevron Corp has signed an agreement to sell its Hawaii refinery to private equity firm One Rock Capital Partners  ending a more-than six year quest to sell an asset not considered core to its business.",
        "date": "04192016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 2-Chevron to sell Hawaii refinery to private equity group "
    },
    {
        "content": "HOUSTON Chevron Corp has signed an agreement to sell its Hawaii refinery to private equity firm One Rock Capital Partners  ending a more-than six year quest to sell an asset not considered core to its business.",
        "date": "04192016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron to sell Hawaii refinery to private equity group "
    },
    {
        "content": "* One rock capital partners to acquire downstream assets from chevron in hawaii",
        "date": "04192016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-One Rock Capital Partners to acquire downstream assets from Chevron in Hawaii "
    },
    {
        "content": "HONG KONG/SINGAPORE U.S. oil and gas major Chevron Corp has put its Myanmar gas block stakes worth an estimated $1.3 billion up for sale  banking sources familiar with the matter said  in what would mark the biggest M&A transaction involving the country's assets.",
        "date": "04192016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Exclusive: Chevron seeks buyers for Myanmar gas assets worth $1.3 billion - sources "
    },
    {
        "content": "* Chevron's $3 billion Asia sale said to draw China Investment Corp  Ormat interest - Bloomberg  citing sources",
        "date": "04122016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron's $3 bln Asia sale said to draw CIC  Ormat interest-Bloomberg "
    },
    {
        "content": "* Downgrade of chevron to aa2 reflects expectations of negative free cash flow rising debts levels caused by low oil prices in 2016 and 2017",
        "date": "04082016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Moody's downgrades Chevron to Aa2 stable outlook "
    },
    {
        "content": "TOKYO  April 8 Japan's Osaka Gas Co  said this week it plans to expand its liquefied natural gas (LNG) trading activity as it adjusts to a market that has shifted from being undersupplied to a glut within the last two years.",
        "date": "04082016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Japan's Osaka Gas to expand LNG trading to adjust to global glut "
    },
    {
        "content": "* Says CEO J.S. Watson's 2015 total compensation was $22 million versus $26 million in 2014 - SEC filing",
        "date": "04072016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron CEO J.S. Watson's 2015 total compensation $22 mln "
    },
    {
        "content": "ASTANA  April 7 Kazakhstan and global oil majors developing the Karachaganak gas condensate field aim to \"peacefully resolve\" their dispute over a production sharing agreement  Kazakhstan's Energy Ministry said on Thursday.",
        "date": "04072016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Kazakhstan aims to 'peacefully resolve' Karachaganak dispute "
    },
    {
        "content": "* Gorgon's 1st export cargo delivered at destination in Japan",
        "date": "04062016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "RPT-UPDATE 2-Australia's Gorgon LNG export plant to restart within 30-60 days - Chevron "
    },
    {
        "content": "* MRC Global expands service to Chevron into the gulf of Mexico",
        "date": "04062016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-MRC Global expands service to Chevron into the Gulf of Mexico "
    },
    {
        "content": "April 6 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "04062016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Pfizer and Allergan scrap $160 bln deal after U.S. pushes tax rule",
        "date": "04062016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Reuters Business News Schedule at 1230 GMT/0830 AM ET "
    },
    {
        "content": "SINGAPORE  April 6 French power and gas group Engie and Japan's Marubeni are among several suitors preparing to bid for Chevron Corp's Asian geothermal energy blocks valued at about $3 billion  sources familiar with the matter said.",
        "date": "04062016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Marubeni  Engie eye bids for Chevron's $3 bln Asia geothermal assets-sources "
    },
    {
        "content": "* Says to increase annual base salary of CFO Patricia Yarrington  by $19 400  resulting in an annual base salary of $1.08 million",
        "date": "04042016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Chevron to increase CFO Yarrington's annual base salary to $1.08 mln "
    },
    {
        "content": "* Gorgon's 1st export cargo delivered at destination in Japan",
        "date": "04062016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-Australia's Gorgon LNG export plant to restart within 30-60 days - Chevron "
    },
    {
        "content": "SINGAPORE  April 6 Australia's Gorgon liquefied natural gas (LNG) export terminal is expected to resume production within 30 to 60 days after the facility halted output earlier this month due to mechanical problems  operator Chevron  said on Wednesday.",
        "date": "04062016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Australia's Gorgon LNG plant to restart within 30-60 days -Chevron "
    },
    {
        "content": "* Maersk to shut Tyra field if no viable solution found this year",
        "date": "04042016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 3-Denmark says aims to solve North Sea gas problems with Maersk "
    },
    {
        "content": "* Suspension comes less than a month after LNG output started",
        "date": "04042016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron Gorgon LNG plant halts exports due to mechanical problems "
    },
    {
        "content": "SINGAPORE  April 4 Chevron's massive Gorgon liquefied natural gas (LNG) facility in Australia has hit technical difficulties  a spokesman said on Monday  resulting in a temporary suspension of exports less than a month after it reached first production.",
        "date": "04042016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron's Australian Gorgon LNG plant suspends exports due to mechanical problems "
    },
    {
        "content": " (The opinions expressed here are those of the author  a columnist for Reuters.)",
        "date": "03292016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "LNG producers need to go downstream to build industry: Russell "
    },
    {
        "content": "LAUNCESTON  Australia  March 29 - The falling dominoes that are major liquefied natural gas (LNG) projects show that the industry needs a re-think on how it is structured and operates.",
        "date": "03292016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "COLUMN-LNG producers need to go downstream to build industry: Russell "
    },
    {
        "content": "OKLAHOMA CITY  March 22 Nearly 15 years since Enron's collapse decimated the retirement accounts of its employees  hundreds of thousands of U.S. energy workers remain precariously exposed to big  concentrated bets on company stock in their 401(k) retirement plans.",
        "date": "03222016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "INSIGHT-Ride to the Bottom: US energy workers hit hard by company stock bets "
    },
    {
        "content": "BUENOS AIRES Argentina's state energy company YPF  said on Wednesday it appealed a local court ruling ordering it to disclose details of its contract with Chevron Corp   amid allegations of secret clauses in the agreement.",
        "date": "03162016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Argentina's YPF appeals court order to show Chevron pact details "
    },
    {
        "content": "NEW YORK Oil and gas major Chevron Corp  will slash its capital budget by as much as 36 percent in 2017 and 2018  a cash-saving bid to preserve its 90-year-old dividend as it copes with crude prices  near 10-year lows.",
        "date": "03082016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron plans to slash budget to save cash for dividend "
    },
    {
        "content": "NEW YORK  March 8 Chevron Corp will add two drilling rigs to the oil-rich Permian shale of West Texas in 2016  part of a bet that crude prices will rise this year from near 10-year lows.",
        "date": "03082016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Eyeing oil price rise  Chevron to boost Permian rig count "
    },
    {
        "content": "NEW YORK March 8 Oil and gas major Chevron Corp  will slash its capital budget by as much as 36 percent in 2017 and 2018  a cash-saving bid to preserve its 90-year-old dividend as it copes with crude prices near 10-year lows.",
        "date": "03082016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 3-Chevron plans to slash budget to save cash for dividend "
    },
    {
        "content": "* Says first production at Angola LNG project expected in second half of 2018",
        "date": "03082016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron says no plans to resume share repurchase program "
    },
    {
        "content": "NEW YORK  March 8 Oil and natural gas producer Chevron Corp said on Tuesday it will slash its budget by at least 17 percent for the next two years as it finishes construction on major expansion projects and works to save cash as oil prices sit near 10-year lows.",
        "date": "03082016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron plans to slash budget in next two years to save cash "
    },
    {
        "content": "Chevron Corp   the No. 2 U.S. oil producer  is considering a sale of its geothermal assets in Asia  Bloomberg reported citing people familiar with the matter.",
        "date": "02292016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron mulling sale of Asian geothermal assets: Bloomberg "
    },
    {
        "content": "Feb 29 Chevron Corp  the No. 2 U.S. oil producer  is considering a sale of its geothermal assets in Asia  Bloomberg reported citing people familiar with the matter.",
        "date": "02292016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron mulling sale of Asian geothermal assets - Bloomberg "
    },
    {
        "content": "(Updates to reflect delays to Gorgon  Wheatstone  Ichthys)     Feb 25 Australia has more than $180 billion of liquefied natural gas export projects coming online  with developers planning to add about 53 million tonnes per annum (mtpa) of LNG production by 2017  an increase that would make the country the world's top LNG exporter.     Chevron Corp and its partners including Exxon Mobil Corp and Royal Dutch Shell  are due to ship will ship the first LNG cargo from the $54 billion G",
        "date": "02252016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Australia's LNG industry: $54 billion Chevron-led Gorgon project to ship first cargo "
    },
    {
        "content": "LONDON  Feb 15 Royal Dutch Shell on Monday sealed the $53 billion (36 billion pounds) acquisition of British rival BG Group to form the world's top liquefied natural gas company  even as slumping oil prices cast a shadow on the upcoming years of transition.",
        "date": "02152016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Shell pursues transition plan after sealing $53 bln BG deal "
    },
    {
        "content": "Feb 1 Chevron Corp is sweetening its sales pitch to attract new buyers to the under-booked $54 billion Gorgon liquefied natural gas export plant off northwest Australia  hit by high costs as fuel prices and demand plunge.",
        "date": "02012016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron lowers Gorgon LNG prices-industry sources "
    },
    {
        "content": "Chevron Corp  reported its first quarterly loss in more than 13 years on Friday despite Wall Street's expectations for a profit  as plunging oil prices eroded profitability across all its divisions.",
        "date": "01292016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron posts first loss since 2002 on crude oil plunge "
    },
    {
        "content": "Jan 29 Chevron Corp reported its first quarterly loss in more than 13 years on Friday despite Wall Street's expectations for a profit  as plunging oil prices eroded profitability across all its divisions.",
        "date": "01292016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-Chevron posts first loss since 2002 on crude oil plunge "
    },
    {
        "content": "Jan 29 Chevron Corp reported a fourth-quarter loss on Friday as the oil producer grappled with how best to handle plunging crude prices.",
        "date": "01292016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron reports quarterly loss on sliding oil prices "
    },
    {
        "content": "LONDON/MILAN  Jan 26 The Angola liquefied natural gas (LNG) export project has started recommissioning  a spokesperson for the Chevron-led venture said.",
        "date": "01262016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 1-Angola LNG export project commences recommissioning - spokesperson "
    },
    {
        "content": "MOSCOW  Jan 20 Swiss-based trader and miner Glencore has sold 100 000 tonnes of Urals for loadings from Primorsk on Jan. 16-17 to Chevron for delivery to the US Gulf Coast  traders said  making a return to the United States after a four-year hiatus.",
        "date": "01202016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 1-Glencore sells Russian oil blend to Chevron for U.S. delivery - sources "
    },
    {
        "content": "CAPE TOWN  Jan 21 U.S. oil major Chevron  said on Thursday it plans to sell 75 percent of its South African business unit which includes a 110 000 barrel a day refinery in Cape Town.",
        "date": "01212016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 1-U.S oil major Chevron looks to dispose of 75 pct of South African business "
    },
    {
        "content": "CAPE TOWN U.S. oil major Chevron said on Thursday it plans to sell 75 percent of its South African business unit which includes a 110 000 barrel a day refinery in Cape Town.",
        "date": "01212016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "U.S oil major Chevron looks to dispose of 75 percent of South African business "
    },
    {
        "content": "CAPE TOWN  Jan 21 U.S. oil major Chevron  said on Thursday it plans to sell 75 percent of its South African business unit which includes a 110 000 barrel a day refinery in Cape Town.",
        "date": "01212016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "U.S oil major Chevron looks to dispose of 75 pct of South African business "
    },
    {
        "content": "JAKARTA  Jan 19 Chevron will not extend its contract to operate the East Kalimantan oil and gas block in Indonesia  the U.S. energy giant said on Tuesday  as plunging crude prices hit producers around the world.",
        "date": "01192016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron says will not extend contract to operate Indonesia oil and gas block "
    },
    {
        "content": "* Goldman says Iran will only increase 2016 output by 285 000 bpd",
        "date": "01192016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Oil stays under pressure as Iran orders sharp rise in crude output "
    },
    {
        "content": "SINGAPORE  Jan 15 Chevron Corp said on Friday it is on track to export the first cargo of liquefied natural gas (LNG) from its Australian Gorgon project - the world's most expensive - early this year.",
        "date": "01152016",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron readies first LNG cargo from Australian mega project "
    },
    {
        "content": "BEIJING  Jan 11 PetroChina   and Chevron began production at an onshore natural gas field in China's southwest at the end of 2015  PetroChina's parent said on Monday  after years of delays.",
        "date": "01132016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "CORRECTED-PetroChina-Chevron sour gas project begins production in China "
    },
    {
        "content": "BEIJING  Jan 11 PetroChina   and Chevron began production at an onshore natural gas field in China's southwest at the end of 2015  PetroChina's parent said on Monday  after years of delays.",
        "date": "01112016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "PetroChina-Chevron sour gas project begins production in China "
    },
    {
        "content": "JAKARTA  Jan 5 Chevron has offered to sell 125 000 barrels per day of crude oil to Indonesia from two of its domestic oilfields on condition of an exemption from a 3 percent value added tax  the country's oil and gas regulator (SKKMigas) said on Tuesday.",
        "date": "01052016",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron offers crude to Indonesia on condition of VAT cut -regulator "
    },
    {
        "content": "CIREBON  Indonesia  Dec 19 Indonesia's upstream oil and gas regulator said state energy firm Pertamina is interested in buying the stakes in the South Natuna Sea Block B that ConocoPhillips and Chevron plan to sell  its spokesman said on Saturday.",
        "date": "12202015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "REFILE-Indonesia Pertamina shows interests in buying shares in Natuna oil and gas block - regulator spokesmman "
    },
    {
        "content": "SYDNEY  Dec 22 Chevron Corp on Tuesday said it has agreed to sell up to 1 million tonnes a year of liquefied natural gas (LNG) from its Australian Gorgon project to China Huadian Green Energy Co over 10 years starting in 2020.",
        "date": "12222015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron agrees deal to sell Australian Gorgon LNG to Chinese firm "
    },
    {
        "content": "CIREBON  Indonesia  Dec 19 Indonesia's upstream oil and gas regulator said state energy firm Pertamina is interested in buying the stakes in the South Natuna Sea Block B that ConocoPhillips and Chevron plans to sell  its spokesman said on Saturday.",
        "date": "12192015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Indonesia Pertamina in buying shares in Natuna oil and gas block - regulator spokesmman "
    },
    {
        "content": "Chevron Corp won $28 million in damages after Gibraltar's highest court ruled against a company that was set up to receive and distribute funds resulting from a judgment against Chevron in Ecuador.",
        "date": "12162015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Gibraltar court awards Chevron $28 million in damages "
    },
    {
        "content": "Dec 16 Chevron Corp won $28 million in damages after Gibraltar's highest court ruled against a company that was set up to receive and distribute funds resulting from a judgment against Chevron in Ecuador.",
        "date": "12162015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Gibraltar court awards Chevron $28 mln in damages "
    },
    {
        "content": "Dec 16 Chevron Corp won $28 million in damages after Gibraltar's highest court ruled against a company that was set up to receive and distribute funds resulting from a judgment against Chevron in Ecuador.",
        "date": "12162015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Gibraltar court awards Chevron $28 mln in damages "
    },
    {
        "content": "** British engineering conglomerate Smiths Group  down c.2 pct & biggest loser on Stoxx 600 Industrial Goods & Services after Morgan Stanley sounds a warning bell about co's commodity-exposed John Crane unit",
        "date": "12102015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BUZZ-Smiths: MS cautious on commodity-exposed John Crane unit "
    },
    {
        "content": "Chevron Corp  plans to slash its budget by 24 percent next year  part of a revamped strategy to rein in spending and position the energy giant to be nimble as oil prices show little sign of rising in the near future.",
        "date": "12092015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron slashes budget by 24 percent to weather low oil prices "
    },
    {
        "content": "JAKARTA U.S.-listed energy giants ConocoPhillips  and Chevron Corp  plan to sell their interests in a key oil and gas block in Indonesia and the government has received written requests for the same  an energy ministry official said.",
        "date": "12112015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "ConocoPhillips  Chevron seek to sell stakes in Indonesia oil and gas block "
    },
    {
        "content": "Dec 9 Chevron Corp plans to slash its budget by 24 percent next year  part of a revamped strategy to rein in spending and position the energy giant to be nimble as oil prices show little sign of rising in the near future.",
        "date": "12092015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron slashes budget by 24 pct to weather low oil prices "
    },
    {
        "content": "Dec 9 Chevron Corp said on Wednesday it would slash its budget by 24 percent next year as it aims to control spending after oil prices  fell more than 50 percent in the past 18 months.",
        "date": "12092015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron slashes 2016 budget 24 pct as oil price slump lingers "
    },
    {
        "content": "JAKARTA  Dec 11 Indonesia has received written requests from U.S.-listed energy giants ConocoPhillips  and Chevron Corp to sell their interests in the South Natuna Sea Block B oil and gas block  an energy ministry official said on Friday.",
        "date": "12112015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "ConocoPhillips  Chevron seek to sell stakes in Indonesia oil and gas block -energy ministry official "
    },
    {
        "content": "DHAKA  Dec 6 Chevron has started producing gas from two new wells in the Bangladeshi state of Sylhet  aimed at easing the country's chronic energy shortages.",
        "date": "12062015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron starts natural gas production from two new wells in Bangladesh "
    },
    {
        "content": "BOSTON  Dec 1 Several of the world's biggest climate-focused mutual funds have stakes in traditional oil and gas companies mixed in with their solar  wind and clean tech holdings  a potential shock to green investors seeking to avoid fossil fuels altogether.",
        "date": "12012015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Green investors take note: climate-focused mutual funds dabble in oil "
    },
    {
        "content": "BANGKOK  Nov 10 Thailand's Star Petroleum Refining Pcl has set its IPO price at 9 baht ($0.2510) per share  aiming to raise up to 15.6 billion baht ($435.03 million) in an initial public offering later this month  the company said in a filing.",
        "date": "11172015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "CORRECTED-Chevron's Thai unit IPO to raise $435 mln. "
    },
    {
        "content": "BUENOS AIRES Argentina's Supreme Court on Tuesday ordered the state-controlled energy firm YPF to fully disclose its contract with Chevron Corp amid allegations of secret clauses in the agreement.",
        "date": "11112015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Argentina's Supreme Court orders YPF to disclose Chevron contract "
    },
    {
        "content": "BUENOS AIRES  Nov 10 Argentina's Supreme Court on Tuesday ordered the state-controlled energy firm YPF to fully disclose its contract with Chevron Corp amid allegations of secret clauses in the agreement.",
        "date": "11102015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 1-Argentina's Supreme Court orders YPF to disclose Chevron contract "
    },
    {
        "content": "BUENOS AIRES  Nov 10 Argentina's Supreme Court on Tuesday ordered the state-controlled energy firm YPF to fully disclose its contract with Chevron Corp amid allegations of secret clauses in the agreement.",
        "date": "11102015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Argentina's Supreme Court orders YPF to disclose Chevron contract "
    },
    {
        "content": "BANGKOK  Nov 10 Thailand's Star Petroleum Refining Pcl has set its IPO price at 9 baht ($0.2510) per share  aiming to raise up to 15.6 billion baht ($435.03 million) in an initial public offering later this month  the company said in a filing.",
        "date": "11102015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron's Thai unit IPO raises $435 mln. "
    },
    {
        "content": "Chevron Corp  is slashing 10 percent of its workforce and sharply paring back its budget  with Chief Executive Officer John Watson giving a downbeat view on Friday of an industry beleaguered by low oil prices. | Video ",
        "date": "10302015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron slashes jobs and spending to weather low oil prices "
    },
    {
        "content": "NEW YORK Oil gained on Friday while stocks on Wall Street closed lower even as major U.S. and European stock indices posted their best month in at least four years  boosted in part by accommodative monetary policies in the euro zone and Japan.",
        "date": "10302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Global stocks slip  but post best month in four years; oil gains "
    },
    {
        "content": "NEW YORK  Oct 30 Oil gained on Friday while stocks on Wall Street closed lower even as major U.S. and European stock indices posted their best month in at least four years  boosted in part by accommodative monetary policies in the euro zone and Japan.",
        "date": "10302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "GLOBAL MARKETS-Stocks slip  but post best month in 4 years; oil gains "
    },
    {
        "content": "NEW YORK  Oct 30 Oil gained and a gauge of world equities rose on Friday as investors mulled a year-end rally  with major stock indices on track to close their best month in four years  boosted in part by accommodative monetary policies in the euro zone and Japan.",
        "date": "10302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "GLOBAL MARKETS-Stocks headed for best month in four years; oil gains "
    },
    {
        "content": "Oct 30 Chevron Corp is slashing 10 percent of its workforce and sharply paring back its budget  with Chief Executive Officer John Watson giving a downbeat view on Friday of an industry beleaguered by low oil prices.",
        "date": "10302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-Chevron slashes jobs and spending to weather low oil prices "
    },
    {
        "content": "NEW YORK  Oct 30 Oil gained and global equity markets edged higher on Friday as investors mulled a year-end rally  with major stock indices on track to close their best month in four years  boosted in part by accommodative monetary policies in the euro zone and Japan.",
        "date": "10302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "GLOBAL MARKETS-Stocks gain  headed for best month in four years "
    },
    {
        "content": "* Dow up 0.05 pct  S&P flat  Nasdaq up 0.03 pct   (Updates to early afternoon)",
        "date": "10302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "US STOCKS-Indexes flat; on track for best month in 4 years "
    },
    {
        "content": "* Chief Executive John Watson: 'Our first priority is to maintain the dividend'",
        "date": "10302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron CEO: 'Our first priority is to maintain the dividend' "
    },
    {
        "content": "* Indexes up: Dow 0.03 pct  S&P 0.04 pct  Nasdaq 0.14 pct   (Updates to open)",
        "date": "10302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "US STOCKS-Wall St flat; indexes set for best month in 4 years "
    },
    {
        "content": "A U.S. court has thrown out Chevron's claims against an oil distribution company for more than $30 million in cleanup costs related to a leaking Maryland pipeline.",
        "date": "10222015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "U.S. court dismisses Chevron claims over $30 mln in cleanup costs "
    },
    {
        "content": "Oct 30 U.S. stock indexes opened slightly higher on Friday after energy majors Exxon and Chevron reported better-than-expected earnings in the third quarter.",
        "date": "10302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "US STOCKS SNAPSHOT-Wall St opens higher on Exxon  Chevron results "
    },
    {
        "content": "* Says Hyundai yard demands additional time and $167 mln payment",
        "date": "10222015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Fred. Olsen Energy faces new oil rig delay  demand for cash "
    },
    {
        "content": "WASHINGTON A crew member on a Gulf of Mexico oil rig contracted by Chevron Corp was killed in an accident  the company said on Tuesday.",
        "date": "10202015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Gulf of Mexico oil rig worker dies in accident "
    },
    {
        "content": "WASHINGTON  Oct 20 A crew member on a Gulf of Mexico oil rig contracted by Chevron Corp was killed in an accident  the company said on Tuesday.",
        "date": "10202015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Gulf of Mexico oil rig worker dies in accident "
    },
    {
        "content": "NEW YORK Chevron Corp  is cutting staff on its global energy trading desks this week  sources said on Thursday  making it the latest division to face reductions as part of a $3 billion cost-saving plan brought on by low crude oil prices.",
        "date": "10082015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron extends job cuts to global trading desks "
    },
    {
        "content": "DHAKA U.S. oil firm Chevron has launched an 18-month enterprise development program in Bangladesh worth $10 million  the company said on Thursday.",
        "date": "10012015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron launches $10 million Bangladesh social program "
    },
    {
        "content": "DHAKA  Oct 1 U.S. oil firm Chevron has launched an 18-month enterprise development programme in Bangladesh worth $10 million  the company said on Thursday.",
        "date": "10012015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron launches $10 mln Bangladesh social programme "
    },
    {
        "content": "LUANDA  Sept 29 About 500 fishermen in Angola's Cabinda province are demanding compensation from Chevron Corp   saying it was behind an oil spill that prevented them from catching fish for nearly two weeks  an industry body said on Tuesday.",
        "date": "09292015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Angolan fishermen accuse Chevron of oil spill  demand compensation "
    },
    {
        "content": "OTTAWA Canada's top court ruled on Friday that a group of Ecuadorean villagers could pursue a multi-billion pollution lawsuit against Chevron Corp in the Canadian province of Ontario.",
        "date": "09042015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Canada's top court says Ecuadoreans can sue Chevron in Ontario "
    },
    {
        "content": "OTTAWA  Sept 4 Canada's top court ruled on Friday that a group of Ecuadorean villagers could pursue a multi-billion pollution lawsuit against Chevron Corp in the Canadian province of Ontario.",
        "date": "09042015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 3-Canada's top court says Ecuadoreans can sue Chevron in Ontario "
    },
    {
        "content": "OTTAWA  Sept 4 Canada's top court ruled on Friday that a group of Ecuadorian villagers could pursue a multi-billion dollar pollution lawsuit against Chevron Corp in the Canadian province of Ontario.",
        "date": "09042015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Top Canada court: Ecuador villagers can sue Chevron in Ontario "
    },
    {
        "content": "* Says Canadian court decision allowing pollution lawsuit has \"no bearing on the legitimacy or enforceability of the fraudulent Ecuadorean judgment\"",
        "date": "09042015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron says effort to bring Ecuadorean judgment should be stopped early "
    },
    {
        "content": "NEW YORK Chevron Corp is set to shut key processing units at its 324 000 barrel-per-day (bpd) Pascagoula  Mississippi  refinery for work in March 2016  according to a person familiar with the plant.",
        "date": "08202015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron to shut units at Pascagoula refinery for work in March 2016: source "
    },
    {
        "content": "* ConocoPhillips looks to sell stake in South Natuna Sea Block B",
        "date": "08112015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-ConocoPhillips to seek buyers for stake in Indonesian oil  gas block -sources "
    },
    {
        "content": "JAKARTA  Aug 11 U.S. oil and gas company ConocoPhillips is reviewing its portfolio in Indonesia and may soon seek buyers for a stake in a production sharing block it operates in the Natuna Sea  company and government sources said.",
        "date": "08112015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "CORRECTED-ConocoPhillips to seek buyers for stake in Indonesian oil  gas block -sources "
    },
    {
        "content": "ASTANA  Aug 10 Chevron-led Tengizchevroil  (TCO)  Kazakhstan's No.1 oil company  said on Monday it had increased crude output by 8.2 pct year-on-year to 14.07 million tonnes in the first half of the year.",
        "date": "08102015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron-led Kazakh oil company boosts H1 output "
    },
    {
        "content": "LAUNCESTON  Australia   Want a snapshot of the problems facing natural resource companies and why the era of big projects is over? Consider the recent dilemmas of Chevron  Adani and Fortescue Metals in Australia.",
        "date": "08062015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Why Chevron  Adani  Fortescue show commodity mega-projects era is over: Russell "
    },
    {
        "content": "--Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "08062015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "RPT-COLUMN-Why Chevron  Adani  Fortescue show commodity mega-projects era is over: Russell "
    },
    {
        "content": "--Clyde Russell is a Reuters columnist. The views expressed are his own.--",
        "date": "08062015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "COLUMN-Why Chevron  Adani  Fortescue show commodity mega-projects era is over: Russell "
    },
    {
        "content": "Wall Street ended lower on Monday as tumbling oil prices dragged energy shares to a three-year low and factory data from China raised concerns about the world's second-biggest economy.",
        "date": "08032015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Weak oil prices  China worries drag Wall Street lower "
    },
    {
        "content": "NEW YORK A U.S. appeals court on Tuesday rejected Ecuador's challenge to a $96 million international arbitration award in favor of energy giant Chevron Corp  marking the latest twist in a decades-long dispute over the development of oil fields in the South American country.",
        "date": "08052015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "U.S. court rejects Ecuador challenge to $96 mln Chevron award "
    },
    {
        "content": "NEW YORK  Aug 4 A U.S. appeals court on Tuesday rejected Ecuador's challenge to a $96 million international arbitration award in favor of energy giant Chevron Corp  marking the latest twist in a decades-long dispute over the development of oil fields in the South American country.",
        "date": "08052015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 2-U.S. court rejects Ecuador challenge to $96 mln Chevron award "
    },
    {
        "content": "NEW YORK A U.S. appeals court on Tuesday rejected Ecuador's challenge to a $96 million international arbitration award in favor of energy giant Chevron Corp  marking the latest twist in a decades-long dispute over the development of oil fields in the South American country.",
        "date": "08042015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "U.S. court rejects Ecuador challenge to $96 million Chevron award "
    },
    {
        "content": "NEW YORK  Aug 4 A U.S. appeals court on Tuesday rejected Ecuador's challenge to a $96 million international arbitration award in favor of Chevron Corp  the latest development in a decades-long dispute over the development of oil fields in the South American country.",
        "date": "08042015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "U.S. court rejects Ecuador challenge to $96 mln Chevron award "
    },
    {
        "content": "NEW YORK  Aug 4 A U.S. appeals court on Tuesday rejected Ecuador's challenge to a $96 million international arbitration award in favor of energy giant Chevron Corp  marking the latest twist in a decades-long dispute over the development of oil fields in the South American country.",
        "date": "08042015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-U.S. court rejects Ecuador challenge to $96 mln Chevron award "
    },
    {
        "content": "Weak oil prices shriveled quarterly profit at Exxon Mobil Corp and Chevron Corp on Friday  compelling both companies to rethink operations and plan for what many expect to be a sustained period of cheap crude. | Video ",
        "date": "07312015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Tumbling oil prices slam profit at Exxon Mobil  Chevron "
    },
    {
        "content": "July 31 Weak oil prices shriveled quarterly profit at Exxon Mobil Corp and Chevron Corp  on Friday  compelling both companies to rethink operations and plan for what many expect to be a sustained period of cheap crude.",
        "date": "07312015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "WRAPUP 4-Tumbling oil prices slam profit at Exxon Mobil  Chevron "
    },
    {
        "content": "* Indexes end down: Dow 0.31 pct  S&P 0.22 pct  Nasdaq 0.01 pct   (Updates to close  adds comment  detail on indices)",
        "date": "07312015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "US STOCKS-Wall Street ends lower as weak oil weighs "
    },
    {
        "content": "* Indexes: Dow down 0.16 pct  S&P flat  Nasdaq up 0.18 pct   (Updates to afternoon)",
        "date": "07312015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "US STOCKS-Wall St mixed; weak results drag on energy stocks "
    },
    {
        "content": "* Indexes up: Dow 0.01 pct  S&P 0.14 pct  Nasdaq 0.40 pct   (Updates to early afternoon)",
        "date": "07312015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "US STOCKS-Wall St higher amid wage growth data  earnings "
    },
    {
        "content": "* Indexes up: Dow 0.02 pct  S&P 0.13 pct  Nasdaq 0.35 pct   (Adds details  comment  updates prices)",
        "date": "07312015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "US STOCKS-Wall St edges up after wage growth data "
    },
    {
        "content": "* Dow down 0.33 pct  S&P down 0.09 pct  Nasdaq up 0.07 pct   (Updates to open)",
        "date": "07312015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "US STOCKS-Dow  S&P dragged down by poor earnings from Exxon  Chevron "
    },
    {
        "content": "Second-quarter profit at oil producer Chevron Corp  tumbled 90 percent  missing analysts' expectations  amid weakness in oil prices .",
        "date": "07312015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron profit tumbles 90 percent  misses estimates; shares drop "
    },
    {
        "content": "July 28 Chevron Corp  the second-largest U.S. oil company  said on Tuesday it would lay off 1 500 employees  about 2 percent of its global work force  as it trims costs to offset declining crude prices.",
        "date": "07282015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron to lay off 1 500 workers amidst oil price slump "
    },
    {
        "content": "Chevron Corp said a cogeneration plant at its 245 271 barrel-per-day refinery in Richmond  California was operating in \"standby\" mode after experiencing a temporary power dip early Friday.",
        "date": "07242015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Cogeneration unit at Chevron Richmond refinery in standby mode after power dip "
    },
    {
        "content": "** Reports lower-than-expected Q2 profit as falling oil prices hurt results",
        "date": "07312015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BUZZ-Chevron Corp: Q2 profit drops 90 pct "
    },
    {
        "content": "July 31 Second-quarter profit at oil producer Chevron Corp tumbled 90 percent  missing analysts' expectations  amid weakness in oil prices.",
        "date": "07312015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "REFILE-UPDATE 1-Chevron profit tumbles 90 percent  misses estimates; shares drop "
    },
    {
        "content": "BANGKOK  July 14 Thai refiner Star Petroleum Refining PCL (SPRC) could raise 20-25 billion baht ($588-$735 million) in an initial public offering that would also mark the exit of energy firm PTT PCL  two people with knowledge of the deal said on Tuesday.",
        "date": "07142015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Thai Star Petroleum to raise up to $735 mln from IPO in Q4 - sources "
    },
    {
        "content": "* Gorgon has suffered cost overruns  competition from U.S. shale",
        "date": "07072015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "In new blow  Chevron's Gorgon faces struggle to offload test LNG "
    },
    {
        "content": "* Says has been awarded four contracts by Chevron  and INPEX (operator of the Ichthys LNG Project)  for the engineering  procurement and construction of an Emergency Pipeline Repair System (EPRS) to be used offshore Australia",
        "date": "07032015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Subsea 7 awarded emergency pipeline repair contracts offshore Australia "
    },
    {
        "content": "HOUSTON Petty legal filings. Diversionary ballot measures. Counting abstentions as no votes. These are just some of the tactics U.S. oil companies used this spring to quash efforts by investors to win the right to nominate climate experts for board seats.",
        "date": "06292015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Oil companies played hardball in bid to defeat climate outsiders "
    },
    {
        "content": "* Russian oil exports exempt from sanctions   (Adds Par Petroleum comment)",
        "date": "06252015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-U.S. West Coast refiners snap up Russian crude cargoes "
    },
    {
        "content": "June 24 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "06242015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LAGOS  June 24 U.S. oil company Chevron Corp  said on Wednesday it was selling its 40 percent stakes in two more Nigerian shallow water offshore oil blocks  Oil Mining Leases (OML) 86 and 88 in the Niger Delta area.",
        "date": "06242015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron selling 40 pct stakes in two more Nigerian oil blocks "
    },
    {
        "content": "June 24 U.S. oil company Chevron Corp  said on Wednesday it was selling its 40 percent stakes in two Nigerian shallow water offshore oil blocks.",
        "date": "06242015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron selling 40 pct stakes in two more Nigerian oil blocks "
    },
    {
        "content": "SINGAPORE  June 24 Refiners on the U.S. West Coast and Hawaii have stepped up purchases of Russian crude  taking advantage of a narrow gap between U.S. and global prices as they look to guard against a seasonal shortage of Alaskan supply  trade and industry sources said.",
        "date": "06242015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "U.S. West Coast refiners snap up Russian crude cargoes "
    },
    {
        "content": "HANOI  June 19 State oil and gas group PetroVietnam has acquired all of the upstream Vietnamese assets of U.S. oil major Chevron Corp as it seeks to boost gas output  the Vietnamese group said.",
        "date": "06192015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 1-PetroVietnam acquires Chevron's upstream Vietnam assets "
    },
    {
        "content": "LAGOS U.S. oil company Chevron Corp said on Thursday it has completed the sale of its 40 percent stake in two Nigerian shallow water offshore oil blocks to local firm First Exploration & Petroleum Development Company Limited (First E&P).",
        "date": "06182015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron completes sale of 40 percent stake in two Nigerian oil blocks "
    },
    {
        "content": "LAGOS  June 18 U.S. oil company Chevron Corp  said on Thursday it has completed the sale of its 40 percent stake in two Nigerian shallow water offshore oil blocks to local firm First Exploration & Petroleum Development Company Limited (First E&P).",
        "date": "06182015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron completes sale of 40 pct stake in two Nigerian oil blocks "
    },
    {
        "content": "LAGOS  June 18 U.S. oil company Chevron Corp  said on Thursday it has completed the sale of its 40 percent stake in two Nigerian offshore oil blocks to local firm First Exploration & Petroleum Development Company Limited.",
        "date": "06182015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron completes sale of 40 pct stake in two Nigerian oil blocks "
    },
    {
        "content": "HANOI  June 18 State oil and gas group PetroVietnam has acquired all of the Vietnamese assets of U.S. oil major Chevron Corp as it seeks to boost gas output  the Vietnamese group said.",
        "date": "06182015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "PetroVietnam says acquires all Chevron's Vietnam assets "
    },
    {
        "content": "HOUSTON  June 15 Chevron Corp has evacuated some workers not essential to oil production from its Gulf of Mexico operations as a low-pressure storm system moves through the basin  but output has not been affected  the company said on Monday.",
        "date": "06152015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron says no production impact from US Gulf storm "
    },
    {
        "content": "HOUSTON/NEW YORK Steep downward revisions to oil and gas reserves at the end of this year are likely to increase scrutiny of how energy companies tally future barrels - a process that has become more opaque with the rise of shale drilling.",
        "date": "06152015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Guesswork  inconsistency nag U.S. shale oil accounting "
    },
    {
        "content": "HOUSTON/WILLISTON  N.D.  June 11 Engineers examining why nine giant tendons sank at Chevron Corp's  Big Foot deepwater oil project are considering whether buoys taking on water  combined with a strong current that prevented vessels from repairing them  caused the costly setback  a source familiar with the matter said.",
        "date": "06112015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Buoy breaches and current eyed in Chevron platform woes -source "
    },
    {
        "content": "June 6 Three more tendons designed to link Chevron Corp's Big Foot deepwater oil project to the Gulf of Mexico seabed have sunk  escalating concerns about how long it will take for the project to start.",
        "date": "06062015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Three more tendons sink at Chevron's Big Foot site in U.S. Gulf "
    },
    {
        "content": "* Wins subsea contract in Gulf of Mexico from Chevron U.S.A. Inc. subsidiary Chevron North America Exploration and Production Company",
        "date": "06102015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "BRIEF-Technip wins Chevron subsea contract in Gulf of Mexico "
    },
    {
        "content": "VIENNA  June 3 Chevron Chief Executive Officer John Watson on Wednesday rejected calls by European peers to introduce a price for carbon emissions  saying the region should instead focus on shale gas and nuclear power.",
        "date": "06032015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Focus on nuclear and shale  not carbon  Chevron boss tells Europe "
    },
    {
        "content": "WELLINGTON  June 2 New Zealand petrol retailer Z Energy Ltd said on Tuesday it plans to acquire Chevron Corp's downstream operations in the country as the U.S. energy company unloads assets in the region in response to falling oil prices and struggling margins.",
        "date": "06012015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Z Energy picks up Chevron New Zealand operations for $556 million "
    },
    {
        "content": "LONDON  June 1 Europe's top oil and gas companies urged governments around the world to introduce a pricing system for carbon emissions  as governments meet in Bonn  Germany  on Monday to work on a U.N. deal to fight climate change.",
        "date": "06012015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 3-Europe's top oil firms jointly call for carbon pricing "
    },
    {
        "content": "ASTANA  June 1 Chevron-led Tengizchevroil  (TCO)  Kazakhstan's No.1 oil company  increased crude output by 4.4 pct year-on-year to 7.1 million tonnes (about 56.7 million barrels) in the first quarter of this year  TCO General Director Tim Miller said on Monday.",
        "date": "06012015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron-led Kazakh oil company boosts first-quarter output "
    },
    {
        "content": "ASTANA  June 1 Chevron-led Tengizchevroil  (TCO) venture increased oil output by 4.4 pct year-on-year to 7.1 million tonnes in the first quarter of this year  TCO General Director Tim Miller said on Monday.   (Reporting by Raushan Nurshayeva; Writing by Dmitry Solovyov; Editing by Biju Dwarakanath)",
        "date": "06012015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron-led Kazakh oil company boosts first-quarter output "
    },
    {
        "content": "June 2 Chevron Corp has deployed robots on the seafloor near its Big Foot deepwater oil project  aiming to find just how much damage it must contend with after six giant tendons sank and indefinitely delayed the start of production at the platform.",
        "date": "06022015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron deploys robots to see damage at Big Foot site in US Gulf "
    },
    {
        "content": "HARRISBURG  Pa.  June 2 Oil and natural gas producer Chevron Corp paid a $939 553 fine for a fatal 2014 explosion at one its Pennsylvania gas wells that state officials on Tuesday said may be the largest amount paid for a single incident.",
        "date": "06022015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron pays record fine in Pennsylvania blast  regulator says "
    },
    {
        "content": "HARRISBURG  Pa.  May 29 Chevron Corp.  has paid a reported $5 million to settle a lawsuit filed last year by the parents of a worker who was burnt to death in a gas well fire in western Pennsylvania.",
        "date": "05292015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron pays reported $5M to family of Pennsylvania well fire victim "
    },
    {
        "content": "BANGKOK  June 2 Thailand's PTT PCL said it plans to negotiate arrangements for import of liquefied natural gas (LNG) with several gas suppliers  including Chevron Corp  to offset a decline in domestic resources and to secure long-term supply.",
        "date": "06022015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Thai PTT seeks to secure LNG imports with global suppliers "
    },
    {
        "content": "HOUSTON Shareholders of the top two U.S. oil companies on Wednesday rejected proposals to add directors with climate change expertise to their boards  but a measure passed at one  Chevron Corp  could give new power to minority investors with environmental concerns.",
        "date": "05272015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Exxon  Chevron holders say 'no' to adding climate experts to boards "
    },
    {
        "content": "HOUSTON  May 27 Shareholders of the top two U.S. oil companies on Wednesday rejected proposals to add directors with climate change expertise to their boards  but a measure passed at one  Chevron Corp  could give new power to minority investors with environmental concerns.",
        "date": "05272015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Exxon  Chevron holders say 'no' to adding climate experts to boards "
    },
    {
        "content": "DUBAI  May 27 An jointly-operated onshore oilfield between Saudi Arabia and Kuwait will remain shut until difficulties to operate there are resolved  a spokeswoman for U.S. oil major Chevron said on Wednesday.",
        "date": "05272015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron says output from Saudi-Kuwait joint oilfield remains shut "
    },
    {
        "content": "HOUSTON  May 27 Progressive shareholders are pushing to add directors with climate change expertise to the boards of Exxon Mobil Corp and Chevron Corp  arguing the largest U.S. oil companies need more depth of knowledge to navigate environmental issues.",
        "date": "05272015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Shareholders press for board voice on climate at Exxon  Chevron "
    },
    {
        "content": "SYDNEY  May 1 An Australian port has been forced to close by a cyclone off the country's west coast  though the country's largest iron ore port was not impacted.",
        "date": "05022015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "CORRECTED-Cyclone threat closes Australian port "
    },
    {
        "content": "Oil and natural gas producer Chevron Corp  reported a 43 percent drop in quarterly profit on Friday  though results beat analysts' expectations as cost cuts and robust refining margins helped offset the impact of tumbling crude prices.",
        "date": "05012015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron profit drops but beats expectations on refining margins "
    },
    {
        "content": "May 1 Oil and natural gas producer Chevron Corp  reported a 43 percent drop in quarterly profit on Friday  though results beat analysts' expectations as cost cuts and robust refining margins helped offset the impact of tumbling crude prices.",
        "date": "05012015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 3-Chevron profit drops but beats expectations on refining margins "
    },
    {
        "content": "* Says production in partition zone between Kuwait  Saudi Arabia could be hurt by inability to get work permits  supplies",
        "date": "05012015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron says renegotiated contracts to save $900 mln this year "
    },
    {
        "content": "May 1 Oil and natural gas producer Chevron Corp  reported a 43 percent drop in quarterly profit on Friday  though results beat analysts' expectations as cost cuts and robust refining margins helped offset the impact of tumbling oil prices.",
        "date": "05012015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "RPT-UPDATE 2-Chevron profit beats expectations  cost cuts offset cheap oil "
    },
    {
        "content": "Thomson Reuters May 1  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                    ",
        "date": "05012015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "May 1 Oil and natural gas producer Chevron Corp  posted a 43 percent drop in quarterly profit on Friday due to low oil prices .",
        "date": "05012015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron quarterly profit drops 43 percent on cheap oil "
    },
    {
        "content": "Thomson Reuters April 28  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04282015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "SYDNEY  May 1 An Australian port used by Chevron  for liquefied natural gas exports has been forced to close by a cyclone off the country's west coast.",
        "date": "05012015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Cyclone threat closes Australian port used by Chevron for LNG exports "
    },
    {
        "content": "KHOBAR  Saudi Arabia  April 22 A Saudi Arabian unit of U.S. oil major Chevron has told its Kuwaiti partner it plans to shut down an oilfield jointly operated between the two Gulf OPEC countries next month over long-standing disputes  three industry sources familiar with the matter said.",
        "date": "04222015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron Saudi unit plans to shut joint Kuwait oilfield in May "
    },
    {
        "content": "ATYRAU  Kazakhstan  April 21 Kazakhstan's leading oil producer has slowed its expansion plans further and cut planned spending this year in response to lower oil prices  a senior executive at Chevron's joint venture Tengizchevroil (TCO) said.",
        "date": "04212015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron's Kazakh joint venture slows expansion plans due to weak oil price "
    },
    {
        "content": "April 20 Chevron Corp urged a U.S. appeals court on Monday to uphold a ruling finding that an American lawyer used corrupt means to secure a $9.5 billion pollution judgment in Ecuador.",
        "date": "04202015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "U.S. court hears Chevron's fraud claims in $9.5 bln Ecuador dispute "
    },
    {
        "content": "Chevron Corp urged a U.S. appeals court on Monday to uphold a ruling finding that an American lawyer used corrupt means to secure a $9.5 billion pollution judgment in Ecuador.A lawyer for Chevron told the 2nd U.S. Circuit Court of Appeals in New York that Steven Donziger  a U.S. lawyer who represented a group of Ecuadorians that sued the oil giant  pursued a case \"shot through with fraud.\"",
        "date": "04202015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "U.S. court hears Chevron's fraud claims in $9.5 billion Ecuador dispute "
    },
    {
        "content": "* PetroChina sold rare Australian grade gasoline to Chevron last month - source",
        "date": "04022015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "China sells Australia-spec gasoline cargo  eyes growing market "
    },
    {
        "content": "Par Petroleum Corp  today announced the completion of the acquisition of Hawaii based Mid Pac Petroleum  LLC.",
        "date": "04022015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Par wraps up Mid Pac takeover in Hawaii "
    },
    {
        "content": "PERTH  March 28 U.S. energy giant Chevron  sold its entire stake in refiner Caltex Australia Ltd  for A$4.7 billion ($3.7 billion) in Asia's biggest block deal this year  as falling oil prices and high costs hurt margins.",
        "date": "03292015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "RPT-Chevron exits Caltex Australia stake for $3.7 bln "
    },
    {
        "content": "PERTH U.S. energy giant Chevron sold its entire stake in refiner Caltex Australia Ltd for A$4.7 billion ($3.7 billion) in Asia’s biggest block deal this year  as falling oil prices and high costs hurt margins.",
        "date": "03282015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron exits Caltex Australia stake for $3.7 billion "
    },
    {
        "content": "SYDNEY  March 30 Australian shares fell sharply on Monday as resources stocks followed oil and metals prices lower  while Caltex Australia's stock slumped as U.S. energy giant Chevron Corp sold its entire stake at a discounted price.",
        "date": "03302015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Australia shares slump on falling metals  oil prices "
    },
    {
        "content": "PERTH  March 28 U.S. energy giant Chevron  sold its entire stake in refiner Caltex Australia Ltd  for A$4.7 billion ($3.7 billion) in Asia's biggest block deal this year  as falling oil prices and high costs hurt margins.",
        "date": "03282015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron exits Caltex Australia stake for $3.7 bln "
    },
    {
        "content": "* Little upbeat economic data   (Adds analysis  quotes  stocks on the move)",
        "date": "03302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Australia shares tumble as commodities decline weighs on resources "
    },
    {
        "content": "HONG KONG/SYDNEY U.S. energy firm Chevron  is seeking to sell its entire stake in Caltex Australia Ltd  for about A$4.6 billion ($3.6 billion)  exiting Australia's biggest refiner after nearly 40 years as falling oil prices and high costs hurt margins.",
        "date": "03272015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron seeks to exit Caltex Australia with $3.6 billion stake sale "
    },
    {
        "content": "* Chevron selling 135 mln shares at 9.7 pct discount to Fri close",
        "date": "03272015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron seeks to exit Caltex Australia with $3.6 bln stake sale "
    },
    {
        "content": "HONG KONG  March 27 U.S. energy firm Chevron  is seeking to raise up to A$4.62 billion ($3.6 billion) by selling its entire stake in Caltex Australia Ltd  according to a term sheet of the deal seen by Reuters on Friday.",
        "date": "03272015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron seeking $3.6 bln by selling Caltex Australia stake-term sheet "
    },
    {
        "content": "SINGAPORE  March 25 Chevron Corp has signed a production sharing contract (PSC) with Myanmar Oil & Gas Enterprise (MOGE) to explore oil and gas in the Rakhine Basin.",
        "date": "03252015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron inks oil  gas production sharing contract in Myanmar "
    },
    {
        "content": "NEW YORK/WILLISTON  N.D.  March 13 Whiting Petroleum Corp  North Dakota's largest oil producer  has put Texas acreage and pipeline assets up for sale as an alternative to a sale of the full company  according to sources familiar with the matter.",
        "date": "03132015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Whiting aims to sell assets as alternative to full sale - sources "
    },
    {
        "content": "NEW YORK  March 10 Chevron Corp boosted its asset sales plans by 50 percent to $15 billion by 2017 and trimmed spending to generate more cash as the second-largest U.S. oil company reaffirmed plans to raise production 20 percent despite a plunge in crude prices.",
        "date": "03102015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron to boost asset sales as sticks by outlook amid cheap oil "
    },
    {
        "content": "* CEO John Watson says 80 percent production linked to oil prices  says \"this is the right positioning and will benefit us in the long run\"",
        "date": "03102015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron CEO says Permian  Marcellus focus for U.S. shale "
    },
    {
        "content": "BUCHAREST  Feb 22 Chevron Corp said it will give up shale gas exploration plans in Romania  after an assessment showed the Black Sea state does not compete favourably with other investment opportunities.",
        "date": "02222015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron says plans to give up Romania shale gas project "
    },
    {
        "content": "CALGARY  Alberta  Feb 23 Royal Dutch Shell Plc  said it was shelving plans to build a new oil sands mine in northern Alberta  the largest such project to be deferred as producers struggle with low energy prices.",
        "date": "02232015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Shell shelves 200 000-bpd Pierre River oil sands mining project "
    },
    {
        "content": "WILLISTON  N.D.  Feb 20 Chevron Corp  the second-largest U.S.-based oil producer  said on Friday its oil and natural gas reserves fell 1 percent last year largely due to the sale of its stake in a Chad oil field.",
        "date": "02202015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron's 2014 oil  gas reserves slip after Chad asset sale "
    },
    {
        "content": "WILLISTON  N.D. Chevron Corp  the second-largest U.S.-based oil producer  said on Friday its oil and natural gas reserves fell 1 percent last year.",
        "date": "02202015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron's oil and natural gas reserves dipped in 2014 "
    },
    {
        "content": "WILLISTON  N.D.  Feb 20 Chevron Corp  the second-largest U.S.-based oil producer  said on Friday its oil and natural gas reserves fell 1 percent last year.",
        "date": "02202015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "REFILE-Chevron's oil and natural gas reserves dipped in 2014 "
    },
    {
        "content": "SAN FRANCISCO Environmentalists and city officials in Richmond  California  on Thursday voiced support for a shareholder resolution that would prevent Chevron Corp from spending on elections  a move that comes after the oil giant spent more than $3 million last year to influence elections in the Bay Area city.",
        "date": "02132015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Environmentalists in California target Chevron election spending "
    },
    {
        "content": "SAN FRANCISCO  Feb 12 Environmentalists and city officials in Richmond  California  on Thursday voiced support for a shareholder resolution that would prevent Chevron Corp  from spending on elections  a move that comes after the oil giant spent more than $3 million last year to influence elections in the Bay Area city.",
        "date": "02132015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Environmentalists in Calif. target Chevron election spending "
    },
    {
        "content": "ASTANA  Feb 11 Chevron-led venture Tengizchevroil (TCO)  Kazakhstan's largest oil producer  is expected to boost output by 42 percent to 38 million tonnes by 2021  Kazakh Energy Minister Vladimir Shkolnik said on Wednesday.",
        "date": "02112015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 1-Tengizchevroil output seen rising 42 pct by 2021 -minister "
    },
    {
        "content": "PRAGUE/LONDON  Feb 2 U.S. energy major Chevron's decision to stop exploring for shale gas in Poland has highlighted the sector's uncertain future and role in strengthening energy security in Europe  analysts said on Monday.",
        "date": "02022015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Opposition  disappointing data wither Europe's shale gas prospects "
    },
    {
        "content": "PRAGUE/LONDON  Feb 2 U.S. energy major Chevron's decision to stop exploring for shale gas in Poland has highlighted the sector's uncertain future and role in strengthening energy security in Europe  analysts said on Monday.",
        "date": "02032015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "RPT-Opposition  disappointing data wither Europe's shale gas prospects "
    },
    {
        "content": "WARSAW  Jan 31 U.S. energy major Chevron Corp  said it will stop exploring for shale gas in Poland  a sector that has failed to live up to its early promise of transforming eastern Europe's energy supplies.",
        "date": "01312015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron to stop its shale gas exploration in Poland "
    },
    {
        "content": "WARSAW  Jan 31 U.S. energy major Chevron Corp  said it will stop exploring for shale gas in Poland  a sector that has failed to live up to its early promise of transforming eastern Europe's energy supplies.",
        "date": "01312015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron to stop its shale gas exploration in Poland "
    },
    {
        "content": "WILLISTON  N.D. Chevron Corp   the second-largest U.S. oil producer  reported a higher-than-expected quarterly profit on Friday as sales of chemicals  lubricants and other refined products helped offset plunging crude prices .",
        "date": "01302015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron's profit beats as chemical sales offset cheap oil "
    },
    {
        "content": "WILLISTON  N.D. Chevron Corp  halted its 2015 share repurchase program on Friday  a move designed to conserve cash amid tumbling oil prices and its latest cost-cutting step after slashing capital spending.",
        "date": "01302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron scraps 2015 share repurchases as oil prices plunge "
    },
    {
        "content": "WILLISTON  N.D.  Jan 30 Chevron Corp  halted its 2015 share repurchase program on Friday  a move designed to conserve cash amid tumbling oil prices and its latest cost-cutting step after slashing capital spending.",
        "date": "01302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 3-Chevron scraps 2015 share repurchases as oil prices plunge "
    },
    {
        "content": "* CEO says optimistic can keep well-decline rates this year to historical average of 3 percent",
        "date": "01302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron CEO says 'dividend is highest priority' for balance sheet "
    },
    {
        "content": "* CEO says capital spending on projects that have not received final investment decision will be \"significantly reduced\"",
        "date": "01302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-Chevron CEO says \"significant cost reduction efforts underway\" "
    },
    {
        "content": "WILLISTON  N.D.  Jan 30 Chevron Corp  the second-largest U.S. oil producer  reported a higher-than-expected quarterly profit on Friday as sales of chemicals  lubricants and other refined products helped offset plunging crude prices.",
        "date": "01302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron's profit beats as chemical sales offset cheap oil "
    },
    {
        "content": "* Futures down: Dow 174 pts  S&P 19 pts  Nasdaq 14 pts   (Updates prices  adds data  comment)",
        "date": "01302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "US STOCKS-Wall St poised to open lower as energy weighs "
    },
    {
        "content": "WILLISTON  N.D.  Jan 30 Chevron Corp  said Friday it plans to spend $35 billion this year on oil and gas projects  13 percent less than in 2014.",
        "date": "01302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron plans $35 billion capex budget for 2015  a 13 percent cut "
    },
    {
        "content": "WILLISTON  N.D.  Jan 30 Chevron Corp  the second-largest U.S. oil producer  said on Friday its quarterly profit fell 30 percent due to plunging crude prices .",
        "date": "01302015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron quarterly profit drops 30 percent on cheap oil "
    },
    {
        "content": "Oil producer Chevron Corp  said it would work with peers BP Plc  and ConocoPhillips  to explore and appraise 24 jointly held offshore leases in deepwater Gulf of Mexico.",
        "date": "01282015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "Chevron to partner BP  Conoco for Gulf of Mexico leases "
    },
    {
        "content": "WILLISTON  N.D.  Jan 29 Occidental Petroleum Corp Chief Executive Stephen Chazen quipped on Thursday that his larger rival Chevron Corp was too poor to buy the No. 4 U.S oil producer  but the offhand remark sent Oxy's stock up anyway.",
        "date": "01292015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Occidental CEO jokes Chevron is an unsuitable buyer; lifts stock "
    },
    {
        "content": "Jan 28 Oil producer Chevron Corp said it would work with peers BP Plc and ConocoPhillips  to explore and appraise 24 jointly held offshore leases in deepwater Gulf of Mexico.",
        "date": "01282015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "UPDATE 1-Chevron to partner BP  Conoco for Gulf of Mexico leases "
    },
    {
        "content": "* BP forms alliance to advance paleogene discoveries in deepwater Gulf of Mexico",
        "date": "01282015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "BRIEF-BP to sell some stakes in Gulf of Mexico leases to Chevron "
    },
    {
        "content": "Jan 28 Chevron Corp said it would work with BP Plc and ConocoPhillips to explore and appraise 24 jointly held offshore leases in deepwater Gulf of Mexico.",
        "date": "01282015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron to partner with BP  Conoco for Gulf of Mexico leases "
    },
    {
        "content": "MELBOURNE  Jan 21 Chevron Corp  which has been struggling to lock in long-term sales contracts for its Australian liquefied natural gas   said it has lined up South Korean conglomerate SK Group as a new customer from its $54 billion Gorgon LNG project.",
        "date": "01212015",
        "name": "Chevron Corporation",
        "news_type": "topStory",
        "symbol": "CVX",
        "title": "RPT-Chevron lines up new Gorgon LNG sales to South Korea "
    },
    {
        "content": "MELBOURNE  Jan 21 Chevron Corp  which has been struggling to lock in long-term sales contracts for its Australian liquefied natural gas   said it has lined up South Korean conglomerate SK Group as a new customer from its $54 billion Gorgon LNG project.",
        "date": "01212015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Chevron lines up new Gorgon LNG sales to South Korea "
    },
    {
        "content": "JAKARTA  Jan 16 Indonesia has scrapped a land tax that companies pay while exploring for oil and gas  a move that might encourage exploration at a time of concern that it could fall sharply due to tumbling oil prices.",
        "date": "01162015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "REFILE-Indonesia scraps land tax on oil and gas exploration "
    },
    {
        "content": "NEW YORK As if plummeting oil prices were not giving energy companies enough to worry about in 2015  Wall Street has turned against the sector  with stock analysts slashing earnings estimates.",
        "date": "01062015",
        "name": "Chevron Corporation",
        "news_type": "normal",
        "symbol": "CVX",
        "title": "Exclusive: Sell-side sours on U.S. energy stocks more than any sector "
    }
]