[
    {
        "content": "* Cemex and Quikrete agree on terms and conditions for sale of u.s. Reinforced concrete pipe manufacturing business",
        "date": "11282016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "BRIEF-CEMEX says a U.S. unit will divest reinforced concrete business to Quikrete "
    },
    {
        "content": "NEW YORK  Nov 28 The only Cuba-focused stock fund in the United States rallied more than 13 percent Monday  a sign investors expect Fidel Castro's death to continue to open up relations between the United States and the island country despite President-elect Donald Trump's threat to end the normalization process that began under President Obama in 2014.",
        "date": "11282016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Cuba-focused closed-end fund rallies in wake of Castro's death "
    },
    {
        "content": "* Cemex sab de cv-informed mexican stock exchange it wasn't aware of causes that may have initiated unusual movements for securities identified with \"cemexcpo\"  Source text - http://bit.ly/2fgESF3 Further company coverage:",
        "date": "11102016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "BRIEF-Cemex Sab De Cv-informed Mexican stock exchange it wasn't aware of causes that may have initiated unusual movements for securities identified with \"cemexcpo\" "
    },
    {
        "content": "MONTERREY  Oct 27 Mexico's Cemex  one of the world's largest cement producers  reported a better-than-expected quarterly net profit on Thursday  driven by a jump in sales in its home country  where it boosted prices.",
        "date": "10272016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "UPDATE 2-Mexican cement producer Cemex 3rd-qtr profit beats expectations "
    },
    {
        "content": "* Net income for quarter reached US$286 million  an improvement of US$330 million over same period last year",
        "date": "10272016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "BRIEF-Cemex SAB de CV Q3 net income US$286 million "
    },
    {
        "content": "Oct 27 Mexico's Cemex  one of the world's largest cement producers  said third-quarter consolidated net sales rose 4 percent  helped by increased prices and higher volumes in Mexico  Europe  Asia  Middle East and Africa.",
        "date": "10272016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Mexican cement producer Cemex's quarterly sales rise 4 pct "
    },
    {
        "content": "* Cemex announces expiration and final settlement of its tender offer for 7.250% senior secured notes due 2021  Source text for Eikon:  Further company coverage:",
        "date": "10282016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "BRIEF-Cemex announces expiration and final settlement of its tender offer for 7.25 pct senior secured notes due 2021 "
    },
    {
        "content": "BRUSSELS  Oct 10 EU antitrust regulators opened an in-depth investigation on Monday into German cement producers HeidelbergCement and Schwenk's joint acquisition of Mexican peer Cemex's Croatian unit  saying the deal might hurt competition and lead to price hikes.",
        "date": "10102016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "EU to investigate HeidelbergCement  Schwenk joint buy of Cemex Croatia "
    },
    {
        "content": "MONTERREY  Mexico  Oct 14 Mexico's Cemex said on Friday that it would amortize $241.7 million in senior notes from debtholders  with an early settlement date of October 19.",
        "date": "10142016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "Cemex says to amortize $242 mln in debt "
    },
    {
        "content": "MEXICO CITY  Sept 30 Mexican cement maker Cemex  said on Friday it had sought approval from the stock exchange to sell the 23 percent direct stake it holds in Grupo Cementos de Chihuahua via a secondary public offering.",
        "date": "09302016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "Cemex plans to sell 23 pct stake in Cementos de Chihuahua "
    },
    {
        "content": "MEXICO CITY  Sept 29 Mexican cement maker Cemex  said on Thursday it had launched a tender offer for up to $500 million in outstanding 7.250 percent senior secured notes due in 2021.",
        "date": "09302016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Mexico's Cemex launches offer for $500 mln in 2021 notes "
    },
    {
        "content": "* Cemex announces tender offer for 7.250% senior secured notes due 2021",
        "date": "09302016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "BRIEF-Cemex announces tender offer for 7.250% senior secured notes due 2021 "
    },
    {
        "content": "MEXICO CITY  Sept 23 Mexican cement maker Cemex said on Friday it had dismissed two senior Cemex Latam executives over suspect payments worth some $20 million relating to a land deal in Colombia.",
        "date": "09242016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "UPDATE 1-Mexico's Cemex fires two executives over Colombia land deal "
    },
    {
        "content": "* Says 2016 EBITDA for assets sold to Eagle Materials is estimated to be $33 mln",
        "date": "09122016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "BRIEF-Cemex says 2016 EBITDA for assets sold about $33 mln - SEC filing "
    },
    {
        "content": "* Eagle Materials Inc. announces a definitive agreement to acquire Cemex's Fairborn cement plant and related assets",
        "date": "09122016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "BRIEF-Eagle Materials announces deal to acquire Cemex's Fairborn cement plant "
    },
    {
        "content": "Mexico's Cemex   one of the world's largest cement producers  on Monday said it had agreed to sell some of its U.S. assets to  Grupo Cementos de Chihuahua   or GCC  for $306 million.",
        "date": "08292016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "Cemex to sell some of its U.S. assets for $306 million "
    },
    {
        "content": "Aug 29 Mexico's Cemex  one of the world's largest cement producers  on Monday said it had agreed to sell some of its U.S. assets to  Grupo Cementos de Chihuahua   or GCC  for $306 million.",
        "date": "08292016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Cemex to sell some of its U.S. assets for $306 mln "
    },
    {
        "content": "* Cemex and GCC agree on terms and conditions for sale of certain U.S. assets",
        "date": "08292016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "BRIEF-Cemex agrees to sell some of its U.S. assets to GCC "
    },
    {
        "content": "* Offer includes \"significant wage and benefit increases while holding fast on other terms and conditions that employers attempted to modify\"",
        "date": "08082016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "BRIEF-Teamsters says Cemex and Central Concrete reach tentative agreement "
    },
    {
        "content": "* Cemex and its affiliate  Kosmos Cement Company  have voluntarily entered into a settlemt with the EPA",
        "date": "07282016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "BRIEF-Cemex and Kosmos Cement Company have voluntarily entered into a settlemt with the EPA "
    },
    {
        "content": "MONTERREY Mexico's Cemex still has around $400 million of non-productive assets identified that it could sell as part of its divestment plan  Chief Executive Fernando Gonzalez said on Wednesday.",
        "date": "07272016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "Mexico's Cemex has $400 million of non-productive assets it could sell "
    },
    {
        "content": "Mexico's Cemex  one of the world's largest cement producers  on Wednesday said it aims to cut debt over the next two years more than it previously planned as it reported that its quarterly profit unexpectedly surged by 81 percent.",
        "date": "07272016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Mexico's Cemex to slash debt faster as profit beats expectations "
    },
    {
        "content": "July 27 Mexico's Cemex  one of the world's largest cement producers  on Wednesday said it aims to cut debt over the next two years more than it previously planned as it reported that its quarterly profit unexpectedly surged by 81 percent.",
        "date": "07272016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "UPDATE 3-Mexico's Cemex to slash debt faster as profit beats expectations "
    },
    {
        "content": "July 27 Mexico's Cemex  one of the world's largest cement producers  said on Wednesday its net profit soared a stronger-than-expected 81 percent in the second quarter  helped by a jump in sales in the United States and Mexico.",
        "date": "07272016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "UPDATE 2-Mexico Cemex's profit jumps  aided by U.S.  Mexico sales growth "
    },
    {
        "content": "* Sees 2016 consolidated volumes to grow by low single digit in ready-mix",
        "date": "07272016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "BRIEF-Cemex SAB de CV sees 2016 consolidated volumes to remain flat in cement "
    },
    {
        "content": "July 27 Mexico's Cemex  one of the world's largest cement producers  reported a jump in second-quarter profit  boosted by sales in the United States and Mexico.",
        "date": "07272016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Mexican cement producer Cemex's profit jumps 16 pct "
    },
    {
        "content": "MEXICO CITY  July 14 Mexican cement maker Cemex  said on Thursday it had amortized debt worth $352.95 million that was due to expire in 2022  as part of its refinancing strategy to lower costs.",
        "date": "07152016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "Mexico's Cemex says amortizes debt worth over $350 mln "
    },
    {
        "content": "MEXICO CITY  July 12 Mexico's Cemex  will receive a 106 million euro ($117.23 million) loan from the World Bank's private sector investment arm to help the cement maker reduce greenhouse gas emissions and boost its emission controls  the company said on Tuesday.",
        "date": "07122016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "Mexico's Cemex gets 106 million euro loan from World Bank's IFC "
    },
    {
        "content": "* Cemex subsidiary in the philippines receives pre-effective approval for sale of a minority stake in its capital stock",
        "date": "06202016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "BRIEF-Cemex Sab de CV says Philippines unit receives pre-effective approval for minority stake sale in capital stock "
    },
    {
        "content": "* Notes will bear interest at an annual rate of 4.625% ; notes will be issued at a price of 100% of face value",
        "date": "06092016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "BRIEF-CEMEX announces pricing of EUR400 mln in senior secured notes "
    },
    {
        "content": "NEW YORK  June 8 (IFR) - Below is a recap of primary issuance activity in the LatAm market on Wednesday:",
        "date": "06082016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "LATAM CLOSE-Five issuers tap LatAm primary market "
    },
    {
        "content": "MEXICO CITY  May 9 Mexican cement maker Cemex  said on Monday it had amortized debt worth $397.4 million that was due to expire in 2018 and 2019  as part of its refinancing strategy to lower costs.",
        "date": "05102016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "Mexico's Cemex says amortizes debt worth nearly $400 million "
    },
    {
        "content": "* Sale of certain assets in U.S. To Grupo Cementos De Chihuahua  S.A.B. De C.V. for U.S. $400 million",
        "date": "05022016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "BRIEF-Cemex to divest certain assets in the U.S. "
    },
    {
        "content": "MEXICO CITY  April 25 Mexican cement maker Cemex  said on Monday it had launched an offer to buy back up to $400 million of debt on senior note issues due to mature in 2018  2019 and 2022.",
        "date": "04262016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "Cemex offers to buy back up to $400 mln in debt "
    },
    {
        "content": "MONTERREY  Mexico  April 21 Mexico's Cemex  reported an unexpected $35 million profit in the first quarter of 2016  following a loss of $149 million in the same period a year earlier  helped by increased sales in the United States.",
        "date": "04212016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "UPDATE 3-Mexico's Cemex posts surprise profit  sends stock to 8-month high "
    },
    {
        "content": "* Says consolidated net sales reached $3.2 billion during Q1 of 2016  an increase of 3 percent on a like to-like basis",
        "date": "04212016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "BRIEF-Cemex SAB de CV says consolidated net sales reached $3.2 bln during Q1 "
    },
    {
        "content": "April 21 Mexico's Cemex  one of the world's largest cement producers  reported a 19 percent rise in first-quarter earnings to $358 million.",
        "date": "04212016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Mexico's Cemex reports 19 pct rise in 1st-qtr profit "
    },
    {
        "content": "* Cemex says IPO an option for divestiture plan   (Adds milestone  background)",
        "date": "03142016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "UPDATE 1-Cemex unit eyes Philippines' record IPO with up to $855 mln offer "
    },
    {
        "content": "MANILA  March 14 Cemex Holdings Philippines Inc  a unit of Mexican cement giant Cemex  is looking to raise as much as 39.745 billion pesos ($855 million)  a registration statement filed with the Philippines' Securities and Exchange Commission showed.",
        "date": "03142016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Cemex Philippines plans up to $855 mln IPO "
    },
    {
        "content": "HONG KONG  March 14 Cemex Holdings Philippines  a subsidiary of Mexican cement giant Cemex  plans to raise up to $500 million in an initial public offering  IFR reported on Monday  citing a banker familiar with the plans.",
        "date": "03142016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Cemex Philippines unit plans up to $500 mln IPO - IFR "
    },
    {
        "content": "MONTERREY/MEXICO CITY  Feb 4 Mexico's Cemex on Thursday set ambitious asset sales and debt-cutting targets and reported a surprise fourth-quarter profit  triggering a rally in its beaten-down shares.",
        "date": "02042016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "UPDATE 4-Mexico's Cemex sets ambitious asset-sales target  shares soar "
    },
    {
        "content": "MEXICO CITY  Feb 4 Mexico's Cemex  one of the world's largest cement companies  on Thursday said it made a profit in the fourth quarter  compared to a year-earlier loss.",
        "date": "02042016",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Mexico's Cemex swings to fourth-quarter profit "
    },
    {
        "content": "MEXICO CITY  Jan 20 Shares in Mexican cement giant Cemex fell more than 8 percent on Wednesday  punished by a record low peso exchange rate which ratchets up its debt load.",
        "date": "01202016",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "Shares in Mexico's Cemex fall more than 8 pct as peso slumps "
    },
    {
        "content": "MONTERREY/MEXICO CITY  Oct 22 Mexico's Cemex   one of the world's largest cement companies  on Thursday reported a third-quarter loss  missing analysts' expectations of a small profit  as a cut in expenses failed to offset a dip in revenue.",
        "date": "10222015",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "UPDATE 2-Mexico's Cemex misses analysts' expectations  shares sink "
    },
    {
        "content": "MEXICO CITY  Oct 22 Mexico's Cemex  one of the world's largest cement companies  on Thursday reported a narrower third-quarter loss.",
        "date": "10222015",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Mexico's Cemex reports narrower third-quarter loss "
    },
    {
        "content": "MEXICO CITY Mexico's Cemex  one of the world's largest cement companies  on Wednesday reported a jump in quarterly profit but sales slumped on weakness in Mexico and northern Europe.",
        "date": "07222015",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "Mexico's Cemex profit jumps but sales slump on Mexico  Europe "
    },
    {
        "content": "MEXICO CITY  July 22 Mexico's Cemex  one of the world's largest cement companies  on Wednesday reported a jump in quarterly profit but sales slumped on weakness in Mexico and northern Europe.",
        "date": "07222015",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "UPDATE 1-Mexico's Cemex profit jumps but sales slump on Mexico  Europe "
    },
    {
        "content": "* Mexico's Cemex says to refinance $1.937 billion of debt to extend maturity by three years  save $20 million per year in finance expense  Source text for Eikon:  Further company coverage:",
        "date": "07222015",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "BRIEF-Mexico's Cemex says to refinance $1.937 bln of debt "
    },
    {
        "content": "MEXICO CITY  July 22 Mexico's Cemex  one of the world's largest cement companies  on Wednesday reported a 50 percent jump in second-quarter net profit compared to the same period a year earlier.",
        "date": "07222015",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Mexico's Cemex posts 50 pct jump in 2nd-qtr profit "
    },
    {
        "content": "WASHINGTON  May 19 The U.S. House of Representatives overwhelmingly passed on Tuesday a two-month extension of federal spending authority on transportation projects  delaying decisions over longer-term funding until the Highway Trust Fund is depleted in July.",
        "date": "05192015",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "UPDATE 1-U.S. House passes transportation spending extension "
    },
    {
        "content": "NEW YORK  May 3 Building materials company Cemex  is projected to make a profit in 2016  the first time since 2009  as demand improves  Barron's reported late Friday.",
        "date": "05032015",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "Cemex stock could turn to profit in 2016 -Barron's "
    },
    {
        "content": "MEXICO CITY/MONTERREY  April 23 Mexico's Cemex  one of the world's largest cement companies  on Thursday said its first-quarter loss narrowed from the year-earlier period  but weak sales in Europe and Latin America pushed the loss wider than analysts' estimates.",
        "date": "04232015",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "UPDATE 2-Mexico's Cemex reports narrower first-quarter loss "
    },
    {
        "content": "MEXICO CITY  April 23 Mexico's Cemex  one of the world's largest cement companies  on Thursday said its first-quarter loss narrowed from the year-earlier period.",
        "date": "04232015",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Mexico's Cemex reports narrower first-quarter loss "
    },
    {
        "content": "MONTERREY  March 26 Mexico's Cemex  one of the world's biggest cement makers  said on Thursday it had so far earmarked around $100 million worth of assets of the roughly $1 billion to $1.5 billion it is looking to divest.",
        "date": "03262015",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "CORRECTED-(OFFICIAL)-Mexico's Cemex has earmarked $100 mln of assets for sale - CEO "
    },
    {
        "content": "MONTERREY  Mexico  March 17 Mexico's Cemex  one of the world's biggest cement makers  said on Tuesday it aims to cut its debt by up to $1 billion this year and sees compound annual growth of 4 percent in sales volumes between 2014-2016.",
        "date": "03172015",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "UPDATE 1-Mexico's Cemex aims to trim debt by $1 bln in 2015 "
    },
    {
        "content": "MONTERREY  Mexico  March 17 Mexico's Cemex  one of the world's biggest cement makers  is aiming to cut its debt by up to $1 billion this year.",
        "date": "03172015",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Mexico's Cemex aims to trim debt by $1 bln in 2015 "
    },
    {
        "content": "NEW YORK  Feb 27 (IFR) - LatAm credit markets enjoyed another strong start on Friday with the exception of the Brazilian sovereign  which continues to lag as investors fret about the fallout from the Petrobras corruption scandal.",
        "date": "02272015",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "LatAm enjoys another solid start as Cemex climbs "
    },
    {
        "content": "MEXICO CITY  Feb 19 Mexican cement-maker Cemex said on Thursday it has created an energy division to take advantage of Mexico's landmark energy reform  and launch power projects that could provide up to 5 percent of Mexico's electricity requirements within five years.",
        "date": "02192015",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "UPDATE 1-Mexico's Cemex creates electricity unit to tap into energy reform "
    },
    {
        "content": "MEXICO CITY  Feb 19 Mexican cement-maker Cemex said on Thursday it has created an energy division to take advantage of Mexico's landmark energy reform  and launch power projects that could provide up to 5 percent of Mexico's electricity requirements within five years.",
        "date": "02192015",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Mexico's Cemex creates electricity unit to tap energy reform "
    },
    {
        "content": "MONTERREY Mexico's Cemex could sell part of its business in northern Europe  the Mediterranean and Asia as it seeks to pay down debt  the cement giant's CEO told Reuters on Tuesday.",
        "date": "02112015",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "Mexico's Cemex could sell part of business to pay down debt: CEO "
    },
    {
        "content": "MEXICO CITY  Feb 5 Shares of Mexican cement maker Cemex on Thursday extended gains to more than 9 percent after the company posted a narrower fourth quarter loss earlier in the day.   (Reporting by Jean Luis Arce)",
        "date": "02052015",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "Mexico's Cemex up more than 9 pct following narrower 4th-qtr loss "
    },
    {
        "content": "MEXICO CITY  Feb 5 Mexican cement-maker Cemex   on Thursday posted a narrower fourth-quarter loss and said it was stepping up efforts to regain its investment-grade debt rating by cutting costs and selling up to $1.5 billion in assets over the next 18 months.",
        "date": "02052015",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "UPDATE 4-Mexico's Cemex plans asset sales  cost cuts to boost debt rating "
    },
    {
        "content": "MEXICO CITY  Feb 5 Mexican cement-maker Cemex said on Thursday it expects to sell up to $1.5 billion in assets over the next 12 to 18 months  and that investment will reach $800 million this year.",
        "date": "02052015",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Mexico's Cemex expects up to $1.5 bln in asset sales by mid-2016 "
    },
    {
        "content": "MEXICO CITY  Feb 5 Shares in Mexican cement-maker Cemex rose more than 4 percent on Thursday  after the company reported a narrower fourth-quarter loss.",
        "date": "02052015",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Cemex shares rise over 4 pct after reporting narrower 4th-qtr loss "
    },
    {
        "content": "MEXICO CITY  Feb 5 Mexican cement-maker Cemex  on Thursday reported a narrower fourth-quarter loss.",
        "date": "02052015",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "Mexico cement-maker Cemex reports narrower fourth-quarter loss "
    },
    {
        "content": "ZURICH  Jan 6 Swiss cement maker Holcim  said on Monday it had closed a series of transactions with Mexico's Cemex in Europe.",
        "date": "01062015",
        "name": "Cemex SAB de CV",
        "news_type": "topStory",
        "symbol": "CX",
        "title": "Holcim and Cemex close series of European deals "
    },
    {
        "content": "* Says Holcim and Cemex announce  successful completion of its series of transactions in Europe",
        "date": "01062015",
        "name": "Cemex SAB de CV",
        "news_type": "normal",
        "symbol": "CX",
        "title": "BRIEF-Holcim and Cemex close their series of transactions in Europe "
    }
]