[
    {
        "content": "A federal judge in Washington  D.C.  has rejected a bid by three conservation and preservation groups to block construction of a transmission line by Dominion Energy through a popular Virginia historic region.",
        "date": "10242017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "Judge rejects bid to halt Dominion Energy transmission line "
    },
    {
        "content": "LONDON  Oct 19 British home repairs provider HomeServe is stepping up its expansion in the United States by buying Dominion Energy's  home services unit  which has 500 000 customers across 16 states.",
        "date": "10192017",
        "name": "Dominion Energy Inc",
        "news_type": "normal",
        "symbol": "D",
        "title": "HomeServe steps up U.S. push with Dominion Energy deal "
    },
    {
        "content": "* Dominion Energy Virginia seeking solar and onshore wind generation proposals",
        "date": "10162017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Energy Virginia seeks solar and onshore wind generation proposals "
    },
    {
        "content": "Virginia energy company Dominion Energy Inc said Tuesday its $4 billion Cove Point liquefied natural gas export facility in Maryland was about 96 percent complete and was expected to enter service by the end of the year.",
        "date": "10172017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "Dominion sees Maryland Cove Point LNG export terminal on line in fourth quarter "
    },
    {
        "content": "* Dominion Energy declares quarterly dividend of 77 cents Source text for Eikon: Further company coverage:",
        "date": "10122017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Energy declares quarterly dividend of 77 cents "
    },
    {
        "content": "* Dominion Energy to revise dividend policy Source text for Eikon: Further company coverage:",
        "date": "09072017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Energy to revise dividend policy "
    },
    {
        "content": "* Dominion Energy declares quarterly dividend of 75.5 cents Source text for Eikon: Further company coverage:",
        "date": "08012017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Energy declares quarterly dividend of 75.5 cents "
    },
    {
        "content": "* Q2 earnings per share view $0.67 -- Thomson Reuters I/B/E/S",
        "date": "08022017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Energy reports Q2 operating EPS of $0.67 "
    },
    {
        "content": "* Dominion Energy acquires  plans to acquire four North Carolina solar energy projects",
        "date": "08032017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Energy says acquired 2 ‍solar generating facilities​ "
    },
    {
        "content": "The U.S. Federal Energy Regulatory Commission (FERC) issued a final environmental impact statement on Friday for Dominion Energy Inc's Atlantic Coast natural gas pipeline from West Virginia to North Carolina.",
        "date": "07212017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "U.S. FERC issues Dominion Atlantic Coast natgas pipe report "
    },
    {
        "content": "* Dominion Energy moving forward on offshore wind project with global market leader DONG Energy as partner",
        "date": "07102017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Energy signs agreement with DONG Energy to build turbines off coast of Virginia Beach "
    },
    {
        "content": "* Washington Co  whose takeover bid has been accepted by Canada's Dominion Diamond  will continue search for new Dominion CEO  no timeline  Washington president Lawrence Simkins says",
        "date": "07172017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Washington Co to start talks with Canada gov't on Dominion takeover "
    },
    {
        "content": "The National Parks Conservation Association has sued the U.S. Army Corps of Engineers challenging a permit granted to Virginia-based Dominion Energy for a transmission line through a popular historic region in the state.",
        "date": "07122017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "Lawsuit seeks to block Dominion project in Virginia's Historic Triangle "
    },
    {
        "content": "July 13 Dominion Energy Inc said on Thursday it would keep fighting to get the Connecticut legislature to include power from the company's Millstone nuclear plant included in a state energy procurement plan.",
        "date": "07132017",
        "name": "Dominion Energy Inc",
        "news_type": "normal",
        "symbol": "D",
        "title": "Dominion fights to get nuclear in Connecticut power procurement plan "
    },
    {
        "content": "* Says entered into three separate sales agency agreements for offerings of up to $500 million",
        "date": "07032017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Energy Inc enters into three separate sales agency agreements "
    },
    {
        "content": "* Dominion Energy Inc files for potential mixed shelf offering; size not disclosed - SEC filing Source text: (http://bit.ly/2ttkk3t) Further company coverage:",
        "date": "06302017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Energy files for potential mixed shelf offering "
    },
    {
        "content": "* Dominion to acquire large-scale solar facility under construction in North Carolina",
        "date": "05042017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion to acquire large-scale solar facility under construction in North Carolina "
    },
    {
        "content": "* Reaffirms fy 2017 operating earnings per share view $3.40 to $3.90",
        "date": "05042017",
        "name": "Dominion Energy Inc",
        "news_type": "normal",
        "symbol": "D",
        "title": "BRIEF-Dominion resources Q1 operating earnings per share $0.97 "
    },
    {
        "content": "March 21 Dominion Diamond   target of a $1.1 billion unsolicited bid  should run a formal sales process for the company and open its books to what could be several interested parties  Dominion's biggest shareholder told Reuters on Tuesday.",
        "date": "03212017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "UPDATE 1-Dominion Diamond should open books to potential suitors -top shareholder "
    },
    {
        "content": "March 21 Dominion Diamond   target of a $1.1 billion unsolicited bid  should run a formal sales process for the company and open its books to what could be several interested parties  Dominion's biggest shareholder told Reuters on Tuesday.",
        "date": "03212017",
        "name": "Dominion Energy Inc",
        "news_type": "normal",
        "symbol": "D",
        "title": "Dominion Diamond should open books to potential suitors -shareholder "
    },
    {
        "content": "* CEO Thomas Farrell's FY 2016 total compensation $13.3 million versus $9.7 million in FY 2015 - sec filing",
        "date": "03202017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Resources CEO Thomas Farrell's FY 2016 total compensation $13.3 mln vs $9.7 mln in FY 2015 "
    },
    {
        "content": "* Announces two large-scale solar energy projects in South Carolina",
        "date": "03202017",
        "name": "Dominion Energy Inc",
        "news_type": "normal",
        "symbol": "D",
        "title": "BRIEF-Dominion announces 2 solar energy projects in South Carolina "
    },
    {
        "content": "* Dominion announces fourth-quarter and full-year 2016 earnings",
        "date": "02012017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion reports Q4 operating EPS $0.99 "
    },
    {
        "content": "* Dominion Resources Inc - elected two new directors  Joseph M. Rigby and Susan N. Story  effective immediately",
        "date": "01242017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Resources elected two new directors effective immediately "
    },
    {
        "content": "* Files for potential senior notes offering  size not disclosed - SEC filing  Source text: (http://bit.ly/2iUxXB1) Further company coverage:",
        "date": "01092017",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Resources files for potential senior notes offering  size not disclosed "
    },
    {
        "content": "* Executives promoted to head Dominion Energy  Dominion Virginia power  Source text for Eikon:  Further company coverage:",
        "date": "11212016",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Executives promoted to head Dominion Energy  Dominion Virginia power "
    },
    {
        "content": "* Dominion Resources- on Nov 10  co  units entered into a $5 billion second amended and restated revolving credit agreement - sec filing",
        "date": "11102016",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Resources says its units enter into $5 bln second amended  restated revolving credit agreement on Nov 10 "
    },
    {
        "content": "Oct 31 Dominion Midstream Partners LP said on Monday it will buy Questar Pipeline LLC for about $1.73 billion including debt from Dominion Resources.",
        "date": "10312016",
        "name": "Dominion Energy Inc",
        "news_type": "normal",
        "symbol": "D",
        "title": "UPDATE 1-Dominion Midstream to buy Questar Pipeline for about $1.73 bln "
    },
    {
        "content": "* Dominion-Questar combination receives Wyoming Public Service Commission approval; companies expect to close on merger september 16  Source text for Eikon:  Further company coverage:",
        "date": "09142016",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion-Questar receives Wyoming Public Service Commission approval on merger "
    },
    {
        "content": "* Public Service Commission of Utah has approved merger with Dominion Resources",
        "date": "08232016",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Questar says Public Service Commission of Utah has approved merger with Dominion Resources "
    },
    {
        "content": "* Says its intention to offer to sell 25 million equity units  subject to market and other conditions  Source text for Eikon:  Further company coverage:",
        "date": "08082016",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion says intents to offer to sell 25 mln equity units "
    },
    {
        "content": "* Dominion Resources Inc files for potential senior notes offering; size not disclosed - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "08042016",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Resources files for senior notes offering "
    },
    {
        "content": "* Company is maintaining its previously issued 2016 operating earnings guidance of $3.60-$4.00 per share",
        "date": "08032016",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Resources Q2 operating earnings per share $0.71 "
    },
    {
        "content": "* To purchase up to $200 million maximum aggregate principal amount of notes issued  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom : +1-646-223-8780)",
        "date": "07192016",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Resources to purchase notes up to $200 mln "
    },
    {
        "content": "* Dominion Resources Inc Files For $800.0 Mln 2016 Series 5.25% Enhanced Junior Subordinated Notes Due 2076 - Sec filing",
        "date": "07132016",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Resources files for $800 mln 2016 series 5.25% enhanced junior subordinated notes "
    },
    {
        "content": "* CEO Brendan Bell says there are \"encouraging\" diamond acquisition prospects in Canada",
        "date": "07062016",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Diamond CEO says encouraging diamond buys in Canada "
    },
    {
        "content": "* Dominion announces cash tender offer for up to $200 000 000 of its 2006 series a enhanced junior subordinated notes due 2066  2006 series b enhanced junior subordinated notes due 2066  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07052016",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Dominion Resources announces cash tender offer for certain notes "
    },
    {
        "content": "* Questar chairman  president and CEO Ron Jibson to retire upon close of dominion resources merger  Source text for Eikon:  Further company coverage:",
        "date": "04272016",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "BRIEF-Questar CEO to retire upon close of Dominion Resources merger "
    },
    {
        "content": "WASHINGTON  May 7 The U.S. Energy Department said Thursday it has given the final approval for Dominion Resources to export liquefied natural gas (LNG) from its Cove Point  Maryland plant.",
        "date": "05072015",
        "name": "Dominion Energy Inc",
        "news_type": "topStory",
        "symbol": "D",
        "title": "UPDATE 1-US Energy Dept gives Cove Point final OK to export LNG "
    }
]