[
    {
        "content": "DETROIT C would use savings from a lower U.S. corporate tax rate to buy new equipment and pay down some of its debt  the carrier's chief executive said on Wednesday  as congressional Republicans work to push forward a tax cut bill.",
        "date": "11152017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air says tax cut would buy new planes  pay down debt "
    },
    {
        "content": "* Appaloosa Lp ups share stake in Ally Financial Inc to 6.8 million shares from 1.1 million shares - SEC filing‍​",
        "date": "11142017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Appaloosa Lp dissolves share stake in Nucor  Delta Air Lines "
    },
    {
        "content": "* Press release - aeromexico and delta launch nonstop service between seattle and mexico city",
        "date": "11072017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Aeromexico and Delta launch nonstop service between Seattle and Mexico City "
    },
    {
        "content": "DUBAI Bombardier Inc  is in talks to reshuffle Delta Air Line  CSeries delivery slots with other customers in case a trade dispute holds up the U.S. carrier's order  a senior executive said on Sunday.",
        "date": "11122017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Bombardier in talks to reshuffle Delta CSeries deliveries "
    },
    {
        "content": "SINGAPORE Fast-growing Russian airline group Aeroflot  is considering a \"sizeable\" order for Airbus SE  A320neo family and Boeing Co's  737 MAX narrow-body aircraft  a top executive said on Tuesday.",
        "date": "11072017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Russia's Aeroflot sizes up Airbus  Boeing for narrow-body order "
    },
    {
        "content": "DUBAI  Nov 12 Bombardier Inc is in talks to reshuffle Delta Air Line CSeries delivery slots with other customers in case a trade dispute holds up the U.S. carrier's order  a senior executive said on Sunday.",
        "date": "11122017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "AIRSHOW-Bombardier in talks to reshuffle Delta CSeries deliveries "
    },
    {
        "content": "* For Oct  total system ASMS 21.29 billion  up 3.1 percent​ Source text for Eikon: Further company coverage:",
        "date": "11022017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines total system load factor 86 pct in October "
    },
    {
        "content": "Oct 31 Canadian carrier WestJet Airlines Ltd said on Tuesday it would weigh the possibility of a revenue-sharing arrangement or joint-venture with a U.S. carrier  after reporting better-than-expected profits on an increase in passengers in the third quarter.",
        "date": "10312017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 3-WestJet to weigh possible joint venture with U.S. carrier -CEO "
    },
    {
        "content": "* Delta board of directors names Ash Carter as newest member Source text for Eikon: Further company coverage:",
        "date": "10232017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta board of directors names Ash Carter as newest member "
    },
    {
        "content": "* Madison Square Garden Co - co  MSG Networks announced a renewed and expanded 10-year marketing partnership with Delta Air Lines​ Source text for Eikon: Further company coverage:",
        "date": "10172017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Madison Square Garden  MSG Networks announce renewed 10-year marketing partnership with Delta Air Lines​ "
    },
    {
        "content": "ATLANTA  Oct 18 Delta Air Lines Inc's chief executive on Wednesday said the carrier did not play a role in pushing an industry-changing deal between planemakers Airbus and Bombardier Inc  as a regulatory spat between the United States and Canada threatened the future of a Bombardier plane program.",
        "date": "10182017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta says it did not play a role in Airbus-Bombardier deal "
    },
    {
        "content": "NEW YORK Delta Air Lines Inc on Wednesday said it would refuse to pay a 300 percent U.S. tariff on Canadian-built Bombardier CSeries jets  raising doubts about its purchase of 75 of the new aircraft at a list price of more than $5 billion.",
        "date": "10112017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta refuses to pay tariffs on Bombardier CSeries jets "
    },
    {
        "content": "NEW YORK  Oct 11 Delta Air Lines Inc on Wednesday said it would refuse to pay a 300 percent U.S. tariff on Canadian-built Bombardier CSeries jets  raising doubts about its purchase of 75 of the new aircraft at a list price of more than $5 billion.",
        "date": "10112017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 3-Delta refuses to pay tariffs on Bombardier CSeries jets "
    },
    {
        "content": "* Micron Technology dips after launching $1 bln stock offering",
        "date": "10112017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "US STOCKS-Sluggish mood on Wall St as earnings season kicks off "
    },
    {
        "content": "NEW YORK  Oct 3 Airline shares were up overall on Tuesday and Delta Air Lines Inc by as much as 6.62 percent on its monthly traffic results  as the Atlanta-based carrier reported a softer-than-expected impact from powerful and disruptive hurricanes last month.",
        "date": "10032017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta shares soar on September  post-hurricane operating results "
    },
    {
        "content": "* Says Hurricane Irma significantly impacted operations in Florida  Caribbean  and Georgia  including company's Atlanta hub",
        "date": "10032017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta reports operating performance for September 2017 "
    },
    {
        "content": "Delta Air Lines Inc's  chief executive on Wednesday characterized as \"bizarre\" the claim by Boeing Co  that rival planemaker Bombardier Inc  is doing business unfairly and said he does not expect the U.S. government to impose stiff duties on the Canadian jets.",
        "date": "09272017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta CEO says he does not expect U.S. duties on Bombardier jets "
    },
    {
        "content": "Sept 27 Delta Air Lines Inc's chief executive on Wednesday characterized as \"bizarre\" the claim by Boeing Co that rival planemaker Bombardier Inc is doing business unfairly and said he does not expect the U.S. government to impose stiff duties on the Canadian jets.",
        "date": "09272017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta CEO says he does not expect U.S. duties on Bombardier jets "
    },
    {
        "content": "* Air France-KLM says regulatory approvals of completion of capital increases reserved to China Eastern Airlines and Delta Air Lines",
        "date": "09272017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Air France-KLM says capital increases reserved to China Eastern Airlines and Delta Air Lines approved "
    },
    {
        "content": "* CEO Bastian calls boeing anti-dumping claims \"absurd\" and \"bizarre\"‍​",
        "date": "09272017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines CEO calls Boeing anti-dumping claims \"absurd\" & \"bizarre\"‍​ "
    },
    {
        "content": "* U.S. to rule on Boeing anti-dumping complaint against Bombardier",
        "date": "09262017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Bombardier would not pick up tab for duties on CSeries jet -sources "
    },
    {
        "content": "* Delta Air Lines Inc - ‍beginning Oct 1  delta air lines will offer free mobile messaging in flight​",
        "date": "09272017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines to offer free mobile messaging in flight​ "
    },
    {
        "content": "MONTREAL  Sept 26 Delta Air Lines said on Tuesday it is confident that a trade complaint brought by Boeing Co against the sale of Bombardier Inc CSeries jets in the United States will be rejected at a later stage.",
        "date": "09272017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta: confident U.S. trade complaint against Bombardier will be rejected "
    },
    {
        "content": "Sept 11 Delta Air Lines Inc said it would cancel about 800 flights on Monday as it braces for Tropical Storm Irma at its Atlanta hub.",
        "date": "09112017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta to cancel about 800 flights due to Irma "
    },
    {
        "content": "Sept 11 Delta Air Lines Inc said it would cancel about 800 flights on Monday as it braces for impacts from Tropical Storm Irma at its Atlanta hub.",
        "date": "09112017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta to cancel about 800 flights due to Irma "
    },
    {
        "content": "* American Express Co - ‍American Express and Delta Air Lines  launching New Blue Delta Skymiles credit card​",
        "date": "09072017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-American Express and Delta to launch new Blue Delta Skymiles credit card​ "
    },
    {
        "content": "United Continental Holdings Inc  on Wednesday said  third-quarter results will be sharply lower than previously forecast  as Hurricane Harvey and geopolitical tensions between the United States and North Korea weigh on the airline's performance.",
        "date": "09062017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "United Continental lowers third-quarter forecast in wake of Harvey  North Korea "
    },
    {
        "content": "Sept 5 Delta Air Lines Inc on Tuesday cut its forecast for passenger unit revenue  a closely watched performance metric  for the current quarter due to slower than anticipated recovery in fares for last-minute flights.",
        "date": "09052017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta cuts passenger unit revenue forecast  shares drop "
    },
    {
        "content": "Sept 6 United Continental Holdings Inc on Wednesday said  third-quarter results will be sharply lower than previously forecast  as Hurricane Harvey and geopolitical tensions between the United States and North Korea weigh on the airline's performance.",
        "date": "09062017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 3-United Continental lowers Q3 forecast in wake of Harvey  N. Korea "
    },
    {
        "content": "* SkyWest Inc Announces order of 25 new aircraft  new flying agreements",
        "date": "09062017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-SkyWest Inc orders 25 new aircraft and new flying agreements "
    },
    {
        "content": "* REG-AIR FRANCE - KLM : EQUITY INVESTMENT OF CHINA EASTERN AND DELTA AIR LINES IN AIR FRANCE-KLM'S SHARE CAPITAL APPROVED BY MORE THAN 94% OF THE SHAREHOLDERS' VOTING CAST Source text for Eikon: Further company coverage: (Gdynia Newsroom:)",
        "date": "09042017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Shareholders approve equity investment of China Eastern and Delta Air Lines in Air France-KLM "
    },
    {
        "content": "* Delta Air Lines Inc - sees ‍September quarter passenger unit revenue change year over year 2 pct to 3 pct​",
        "date": "09052017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta reports operating performance for August 2017 "
    },
    {
        "content": "* Delta Air Lines Inc - ‍Co's test program at Ronald Reagan Washington National airport allows customers to video chat from airport with a specialist​ Source text for Eikon: Further company coverage:",
        "date": "08222017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta's test program allows customers to video chat from airport with a specialist​ "
    },
    {
        "content": "* New service between Orlando International Airport and Amsterdam Airport Schiphol will debut on March 30  2018 Source text for Eikon: Further company coverage:",
        "date": "08072017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines Inc - new service between Orlando and Amsterdam airport "
    },
    {
        "content": "* Sets quarterly dividend of $0.305 per share Source text for Eikon: Further company coverage:",
        "date": "08092017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines sets quarterly dividend of $0.305 per share "
    },
    {
        "content": "NEW YORK  Aug 2 U.S. airlines striving to boost profitability are up against an army of penny-pinching customers who would rather sit in a dreaded middle seat than pay more to fly  says a Reuters/Ipsos opinion poll released on Wednesday.",
        "date": "08022017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Perks? No! U.S. flyers prefer the cheap seats -Reuters/Ipsos poll "
    },
    {
        "content": "Delta Air Lines  on Saturday said it would cut its once-weekly flights from Atlanta to Caracas  Venezuela  in the latest instance of a U.S. airline cutting operations with the embattled nation.",
        "date": "07292017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta to stop weekly Atlanta-Caracas flights in September "
    },
    {
        "content": "PARIS/NEW YORK  July 27 Delta Air Lines  Air France-KLM and Virgin Atlantic unveiled plans on Thursday to combine two overlapping transatlantic joint-ventures  supported by equity deals worth $1 billion  as airlines brace for more competition.",
        "date": "07272017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "UPDATE 2-Delta  Air France-KLM  Virgin rejig Atlantic alliances "
    },
    {
        "content": "BERLIN  July 28 Air France-KLM  Delta Air Lines and Virgin Atlantic have agreed a so-called 'put' option with Virgin Group that allows Virgin Atlantic to remain in majority UK ownership in the event of a hard Brexit.",
        "date": "07282017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Air France-KLM agrees option for Virgin Atlantic ownership in event of hard Brexit "
    },
    {
        "content": "PARIS  July 27 Air France-KLM said Alitalia's precarious situation was one element of its plans to set up a new transatlantic joint venture with Delta Air Lines and Virgin Atlantic  with financial considerations and consolidation also playing a role.",
        "date": "07272017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Air France-KLM says Alitalia woes helped drive transatlantic shake-up "
    },
    {
        "content": "BERLIN  July 28 Air France-KLM offered more optimism than rivals on pricing for the rest of the year  after good travel demand resulted in better than expected second-quarter profit.",
        "date": "07282017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Air France-KLM upbeat on pricing as bookings improve "
    },
    {
        "content": "PARIS/NEW YORK Delta Air Lines   Air France-KLM  and Virgin Atlantic unveiled plans on Thursday to combine two overlapping transatlantic joint-ventures  supported by equity deals worth $1 billion  as airlines brace for more competition.",
        "date": "07282017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta  Air France-KLM  Virgin rejig Atlantic alliances "
    },
    {
        "content": "* Delta deepening longstanding partnership with Air France-KLM through 10% equity investment",
        "date": "07272017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines to acquire 10 pct equity in JV partner Air France-KLM "
    },
    {
        "content": "SINGAPORE  July 28 China Eastern Airlines Corp Ltd said on Friday it would buy a 10 percent stake in European carrier Air France KLM SA and form a strategic partnership to improve its presence in the China-Europe market.",
        "date": "07282017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "China Eastern buys 10 pct Air France KLM stake to boost European presence "
    },
    {
        "content": "NEW YORK Transportation officials on Thursday approved a revised $4 billion plan from Delta Air Lines  to renovate its terminal at New York's LaGuardia Airport after Goldman  Sachs & Co   a financial partner in the project  exited the deal.",
        "date": "07202017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta proceeds with New York's LaGuardia $4 billion project without Goldman "
    },
    {
        "content": "NEW YORK  July 20 Transportation officials on Thursday approved a revised $4 billion plan from Delta Air Lines to renovate its terminal at New York's LaGuardia Airport after Goldman  Sachs & Co  a financial partner in the project  exited the deal.",
        "date": "07202017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta proceeds with New York's LaGuardia $4 bln project without Goldman "
    },
    {
        "content": "WASHINGTON Frontier Airlines  American Airlines and Delta Air Lines have been fined for violating U.S. Transportation Department airline consumer protection rules  the department said on Friday.",
        "date": "07212017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "U.S. fines American  Delta  Frontier for consumer rule violations "
    },
    {
        "content": "* Press release - Delta to expand trans-pacific service with nonstop Shanghai-Atlanta flight",
        "date": "07192017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta to expand trans-pacific service with nonstop Shanghai-Atlanta flight "
    },
    {
        "content": "* Delta Air Lines - VP  Chief Accounting Officer  Craig Meynard reports open market sale of 5 000 shares of co's common stock at average price of $55.26 per share on July 14 Source text for Eikon: (http://bit.ly/2uAnVgx) Further company coverage:",
        "date": "07182017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines' Chief Accounting Officer reports open market sale of 5 000 shares of co's stock "
    },
    {
        "content": "WASHINGTON  July 21 Frontier Airlines  American Airlines and Delta Air Lines have been fined for violating U.S. Transportation Department airline consumer protection rules  the department said on Friday.",
        "date": "07212017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-U.S. fines American  Delta  Frontier for consumer rule violations "
    },
    {
        "content": "* Press release - Delta expands Austin  adds Medford  Oregon service from Seattle",
        "date": "07182017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta expands Austin  adds Medford  Oregon service from Seattle "
    },
    {
        "content": "WASHINGTON  July 21 The U.S. Transportation Department said on Friday has fined Frontier Airlines  American Airlines and Delta Air Lines for violating the department’s airline consumer protection rules.",
        "date": "07212017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "U.S. fines American Airlines  Delta  Frontier for violating consumer protection rules "
    },
    {
        "content": "* Will launch daily nonstop service between Los Angeles and Mexico City on Dec. 1",
        "date": "07172017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines to launch daily service between Los Angeles and Mexico City "
    },
    {
        "content": "Delta Air Lines Inc  on Thursday reported a 21 percent drop in second-quarter profit because of sharply higher labor and fuel costs  despite higher passenger unit revenue  sending its shares down 2 percent.",
        "date": "07132017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta's profit tumbles on higher costs; passenger unit revenue rises "
    },
    {
        "content": "MONTREAL/NEW YORK Delta Air Lines  will not delay its 2018 deliveries of CSeries planes from Canada's Bombardier Inc   the carrier's chief executive said on Thursday  following an anti-dumping complaint by Boeing Co  against the jets.",
        "date": "07132017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Boeing trade complaint won't slow CSeries deliveries: Delta CEO "
    },
    {
        "content": "MONTREAL/NEW YORK July 13 Delta Air Lines will not delay its 2018 deliveries of CSeries planes from Canada's Bombardier Inc  the carrier's chief executive said on Thursday  following an anti-dumping complaint by Boeing Co against the jets.",
        "date": "07132017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Boeing trade complaint won't slow CSeries deliveries -Delta CEO "
    },
    {
        "content": "* Delta takes delivery of first flagship Airbus A350-900 Source text for Eikon: Further company coverage:",
        "date": "07132017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines takes delivery of first Airbus A350-900 "
    },
    {
        "content": "July 13 Delta Air Lines Inc on Thursday reported a 21 percent drop in second-quarter profit because of sharply higher labor and fuel costs  despite higher passenger unit revenue  sending its shares down 2 percent.",
        "date": "07132017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 4-Delta's profit tumbles on higher costs; passenger unit revenue rises "
    },
    {
        "content": "* Delta Air Lines Inc sees September quarter fuel price  including taxes and refinery impact of $1.55 - $1.60",
        "date": "07132017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines qtrly revenue $10.8 billion "
    },
    {
        "content": "* Press Release - Delta continues Boston expansion with new service to Pittsburgh and New Orleans",
        "date": "07062017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines announces new service to Pittsburgh and New Orleans "
    },
    {
        "content": "July 5 Delta Air Lines Inc said it expects a closely watched performance metric to be near the upper end of its second-quarter forecast  citing improving revenues.",
        "date": "07052017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air expects key revenue metric near upper end of forecast "
    },
    {
        "content": "* Delta Air Lines Inc - Expects to record roughly $350 million of other expenses in June quarter - SEC Filing",
        "date": "07052017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines expects to record roughly $350 mln of other expenses in June quarter - SEC Filing "
    },
    {
        "content": "WASHINGTON  June 26 Amtrak on Monday named a former Delta Air Lines chief executive as its next president and CEO as the U.S. passenger rail carrier makes major repairs at its busiest U.S. hub.",
        "date": "06262017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Amtrak names former Delta executive as next CEO "
    },
    {
        "content": "WASHINGTON  June 26 Amtrak on Monday named a former Delta Air Lines chief to lead the U.S. passenger rail carrier as it embarks on a major renovation of its busiest U.S. hub following years of disruptions and delays along the Northeast Corridor.",
        "date": "06262017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-Amtrak names former Delta executive as next CEO "
    },
    {
        "content": "* SAYS DELTA AIR LINES HAS PLACED AN ORDER FOR ANOTHER 10 AIRBUS A321CEO AIRCRAFTS Further company coverage: (Gdynia Newsroom)",
        "date": "06202017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Airbus says Delta Air Lines places order for additional 10 Airbus A321ceo aircrafts "
    },
    {
        "content": "MONTREAL  June 14 Bombardier Inc is unlikely to announce new CSeries orders at the Paris Air Show next week  as it grapples with broader market weakness  though demand for smaller regional aircraft is growing  a person familiar with the matter told Reuters.",
        "date": "06142017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Bombardier not expected to announce CSeries orders in Paris -source "
    },
    {
        "content": "* Delta Air Lines says under joint cooperation agreement  co and Aeromexico will provide customers with expanded travel options",
        "date": "05242017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta and Aeromexico expand options for U.S.-Mexico travel "
    },
    {
        "content": "* Delta Air Lines Inc - co  Lyft partnering to offer skymiles members more opportunities to earn miles by requesting a ride Source text for Eikon: Further company coverage:",
        "date": "05172017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta and Lyft team up to to offer skymiles members more opportunities "
    },
    {
        "content": "* To expand its connections between Brazil and United States with a new nonstop flight between Rio De Janeiro and New York-JFK Source text for Eikon: Further company coverage:",
        "date": "05122017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta boosts connectivity between Rio De Janeiro & New York "
    },
    {
        "content": "Delta Air Lines Inc  said on Thursday it was delaying taking delivery of 10 Airbus A350-900 jets and placed a fresh order for 30 smaller A321-200s  putting a question mark on the demand for wide-body aircraft.",
        "date": "05112017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta delays taking delivery of 10 A350 jets "
    },
    {
        "content": "* Delivery schedule for co's first A350-900 aircraft on track",
        "date": "05112017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-Delta delays taking delivery of 10 A350 jets "
    },
    {
        "content": "May 11 Delta Air Lines Inc said on Thursday it was delaying taking delivery of 10 wide-body A350-900 jets made by Airbus SE  putting a question mark over their demand  even as the no. 2 U.S. airline placed a fresh order for 30 smaller A321-200s.",
        "date": "05112017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "CORRECTED-UPDATE 1-Delta delays taking delivery of 10 A350 jets "
    },
    {
        "content": "* Delta to expand Airbus A321-200 aircraft order; defer 10 A350 deliveries",
        "date": "05112017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta to expand Airbus A321-200 aircraft order defer 10 A350 deliveries "
    },
    {
        "content": "May 11 Delta Air Lines Inc said on Thursday it would expand its order for Airbus SE's single-aisle A321-200 aircraft  and defer deliveries of the wide-body A350-900 jets.",
        "date": "05112017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta to order more Airbus A321-200 aircraft "
    },
    {
        "content": "OMAHA  Neb.  May 6 Warren Buffett  the chairman of Berkshire Hathaway Inc  on Saturday faulted Wells Fargo & Co for failing to stop employees from signing up customers for bogus accounts even after learning it was happening  causing a scandal.",
        "date": "05062017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Buffett assails Wells Fargo  defends 3G at wide-ranging meeting "
    },
    {
        "content": "* Sets quarterly dividend of $0.2025 per share Source text for Eikon: Further company coverage:",
        "date": "05052017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines sets quarterly dividend of $0.2025 per share "
    },
    {
        "content": "May 4 Delta Air Lines Inc apologized on Thursday to customers  who were forced off its flight last month  and said it would refund them and provide additional compensation.",
        "date": "05042017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta apologizes for \"booting\" passenger off flight "
    },
    {
        "content": "Delta Air Lines apologized on Thursday after a couple said they were kicked off an overbooked flight with their two toddlers so their seats could be given to waiting passengers  the latest U.S. airline to apologize over incidents on board their flights.",
        "date": "05052017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta apologizes for forcing family off flight "
    },
    {
        "content": "* Delta statement regarding flight 2222  Maui to Los Angeles  on April 23  2017",
        "date": "05042017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta statement regarding flight 2222 \"sorry for unfortunate experience our customers had with Delta\" "
    },
    {
        "content": "* Delta and Aeromexico strike multi-year deal with the Mexican national team",
        "date": "05042017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta and Aeromexico strike multi-year deal with the Mexican national soccer team "
    },
    {
        "content": "* CEO Edward Bastian's FY 2016 total compensation was  $12.6 million Source text:(http://bit.ly/2qggo1G) Further company coverage:",
        "date": "04282017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines CEO 2016 total compensation was  $12.6 mln "
    },
    {
        "content": "* Delta Air Lines Inc qtrly total revenue $9 148 million versus $9 251 million",
        "date": "04122017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines reports qtrly earnings per diluted share $0.82 "
    },
    {
        "content": "April 12 Delta Air Lines Inc on Wednesday reported a 36.3 percent decline in quarterly profit and forecast passenger unit revenue  a closely watched metric  to increase 1-3 percent in the second quarter.",
        "date": "04122017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air profit falls 36.3 percent "
    },
    {
        "content": "Shares of Delta Air Lines Inc  fell on Tuesday after the carrier lowered its forecast for a closely watched revenue metric for the second time in less than a month.",
        "date": "04042017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta shares down after carrier cuts revenue metric a second time "
    },
    {
        "content": "NEW YORK  April 7 Delta Air Lines Inc said it had cancelled nearly 3 000 flights this week after a severe storm hit its hometown of Atlanta  Georgia and apologised for its response to the \"unprecedented\" weather.",
        "date": "04072017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Atlanta storm halts thousands of Delta Air flights "
    },
    {
        "content": "* Sees 1st-qtr average fuel price of $1.68-$1.73/gallon (Adds analyst comment  updates share price)",
        "date": "04042017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 3-Delta shares down after carrier cuts revenue metric a second time "
    },
    {
        "content": "* Delta Air Lines Inc - march total system asms 21.16 billion  up 1 percent",
        "date": "04042017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines says March total system ASMS 21.16 billion  up 1 pct "
    },
    {
        "content": "* Delta air lines inc says  will begin selling delta comfort+ on crj-200 aircraft beginning april 1 for flights scheduled on may 1 and beyond Source text for Eikon: Further company coverage:",
        "date": "03312017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines to begin selling Delta Comfort+ on CRJ-200 aircraft beginning April 1 "
    },
    {
        "content": "* Delta reports financial and operating performance for march 2017",
        "date": "04042017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta reports financial and operating performance for march 2017 "
    },
    {
        "content": "    April 7 Diary of U.S. (.SPX) corporate earnings for the week ahead.         ** Please Note - All times given are in U.S. EST unless otherwise stated **                  U.S. EARNINGS        Start Date   Start Time  RIC      Company                 Event Name  12-Apr-2017  07:00       FAST.O   Fastenal Co             Q1 2017 Fastenal Co Earnings Release  12-Apr-2017  BMO         DAL.N    Delta Air Lines Inc     Q1 2017 Delta Air Lines Inc Earnings Release  13-Apr-2017  08:00      ",
        "date": "04072017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "DIARY-U.S. earnings week ahead "
    },
    {
        "content": "* Delta Air Lines Inc - files for resale of common stock of up to 15.32 million shares by the Delta Master Trust - SEC filing Source text: (http://bit.ly/2nQkoHu) Further company coverage:",
        "date": "03302017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines files for resale of common stock of up to 15.32 mln shares by the Delta Master Trust - SEC filing "
    },
    {
        "content": "* Delta Air Lines - reached agreement with expanded trans-pacific network that will increase travel choices and boost competition between U.S. and Asia",
        "date": "03292017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta and Korean Air to expand partnership "
    },
    {
        "content": "SHANGHAI  March 28 China Southern Airlines Co Ltd's Hong Kong-listed shares jumped by more than 2.5 pct in opening trade after the company said it would sell a stake to a subsidiary of American Airlines",
        "date": "03282017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "China Southern Airlines' shares jump after American Airlines buy-in "
    },
    {
        "content": "* Press release - Delta plans new daily nonstop service between New York-JFK and Rio De Janeiro  Brazil",
        "date": "03232017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta plans new daily nonstop service between New York-JFK and Rio De Janeiro "
    },
    {
        "content": "* Delta to begin Seattle to Chicago-O'hare service in June 2017",
        "date": "03202017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta to begin Seattle to Chicago-O'hare service in June 2017 "
    },
    {
        "content": "* Delta successfully completes cash tender offer for additional shares of Grupo Aeroméxico  Source text for Eikon:  Further company coverage:",
        "date": "03132017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta completes cash tender offer for additional shares of Grupo Aeroméxico "
    },
    {
        "content": "NEW YORK American Airlines Group Inc  on Thursday became the second major U.S. airline this week to lower guidance on a closely watched revenue metric  sending shares of several major carriers lower.",
        "date": "03102017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "American Air lowers key revenue guidance  sending shares down "
    },
    {
        "content": "BOSTON  March 9 Delta Air Lines Inc. Chief Executive Ed Bastian on Thursday sounded an optimistic note for 2017 earnings and said he expects to meet soon with the company's newest and biggest investor  billionaire Warren Buffett.",
        "date": "03092017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta's CEO sounds optimistic note for 2017; hopes to meet Buffett "
    },
    {
        "content": "NEW YORK Delta Air Lines has hired a consultant to assess the impact on jet fuel prices if the carrier sells or closes the Philadelphia-area refinery it purchased five years ago to keep fuel affordable  two sources familiar with the process said.",
        "date": "03142017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Exclusive: Delta hires consultant to study refinery options - sources "
    },
    {
        "content": "* Press release - delta introduces one-of-a-kind alessi-designed serviceware at 30 000 feet  Source text for Eikon:  Further company coverage:",
        "date": "03142017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta introduces one-of-a-kind alessi-designed serviceware at 30 000 feet "
    },
    {
        "content": "* Sees March quarter passenger unit revenue to be about flat y-o-y - SEC filing",
        "date": "03062017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines sees March quarter passenger unit revenue to be about flat yoy "
    },
    {
        "content": "March 6 Delta Air Lines Inc said on Monday it expected passenger unit revenue  a closely watched revenue metric  to be at the lower end of its forecast in the first quarter ending March  and the airline cut its operating margin outlook.",
        "date": "03062017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air expects key revenue metric at low end of forecast "
    },
    {
        "content": "* Delta cargo launches GPS tracking  same-day shipments - website  Source text : http://bit.ly/2m98zeN  Further company coverage:",
        "date": "03012017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta cargo launches GPS tracking  same-day shipments - website "
    },
    {
        "content": "* Will stop flying MD-88 aircraft on a scheduled basis at New York's Laguardia Airport effective March 2",
        "date": "03022017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta to stop flying MD-88 aircraft on a scheduled basis at Laguardia Airport "
    },
    {
        "content": "* ANNOUNCED A SETTLEMENT OF ITS PREVIOUSLY DISCLOSED LAWSUIT WITH DELTA AIR LINES  INC",
        "date": "02232017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-INNOVATIVE SOLUTIONS AND SUPPORT ANNOUNCES SETTLEMENT LAWSUIT WITH DELTA AIR LINES "
    },
    {
        "content": "* Aeromexico's board of directors issue opinion on Delta Air Lines' Tender Offer",
        "date": "02212017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Aeromexico's board issue opinion on Delta Air Lines' tender offer "
    },
    {
        "content": "MEXICO CITY Grupo Aeromexico  said on Tuesday that its board had determined that Delta Air Lines Inc's  offer to buy an additional 32 percent of its shares was fair.",
        "date": "02212017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Aeromexico board says Delta offer for shares 'fair' "
    },
    {
        "content": "MEXICO CITY  Feb 21 Grupo Aeromexico  said on Tuesday that its board had determined that Delta Air Lines Inc's offer to buy an additional 32 percent of its shares was fair.",
        "date": "02212017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Aeromexico board says Delta offer for shares \"fair\" "
    },
    {
        "content": "* Soros Fund Management dissolves share stake in Coca Cola Co - SEC filing",
        "date": "02142017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Soros Fund Management takes share stake in Tata Motors  dissolves share stake in Coca Cola  Dunkin' Brands "
    },
    {
        "content": "* Delta to pay out more than $1 billion in profit sharing on Feb 14  thanks to record-setting year",
        "date": "02132017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta to pay out more than $1 bln in profit sharing on Feb 14 "
    },
    {
        "content": "Delta Air Lines Inc  said on Monday it plans to launch a cash tender offer to buy up to an additional 32 percent of Grupo Aeromexico SAB de CV's stock  at 53 Mexican pesos per share  valuing the deal at about $590 million.",
        "date": "02132017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines offers to buy additional Aeromexico stake "
    },
    {
        "content": "Feb 13 Delta Air Lines Inc said on Monday it plans to launch a cash tender offer to buy up to an additional 32 percent of Grupo Aeromexico SAB de CV's stock  at 53 Mexican pesos per share  valuing the deal at about $590 million.",
        "date": "02132017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta Air Lines offers to buy additional Aeromexico stake "
    },
    {
        "content": "* Says \u007flaunched cash tender offer to acquire up to additional 32 percent outstanding capital stock of Grupo Aeroméxico for MXN $53/share\u007f",
        "date": "02132017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air \u007flaunches cash tender offer to acquire additional shares of Grupo Aeroméxico\u007f "
    },
    {
        "content": "* Delta announces intention to acquire additional shares of Grupo Aeroméxico",
        "date": "02132017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta announces intention to acquire additional shares of Grupo Aeroméxico "
    },
    {
        "content": "* Sets quarterly dividend of $0.2025 per share  Source text for Eikon:  Further company coverage:",
        "date": "02102017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines sets qtrly dividend of $0.2025 per share "
    },
    {
        "content": "DUBAI  Feb 9 Emirates has accused Delta Air Lines of harming its operations by refusing it a spare part for its aircraft in the United States  stoking tensions between U.S. and Gulf carriers feuding over state subsidies.",
        "date": "02092017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Emirates says flight delayed after Delta refuse spare part "
    },
    {
        "content": "* Delta Air Lines CEO says plan to hire 25 000 people over the next five years  Source http://bit.ly/2k8kCo1 Further company coverage:",
        "date": "02092017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines CEO says plan to hire 25 000 people over the next five years "
    },
    {
        "content": "NEW YORK U.S. airline and online booking agency shares slumped for the second consecutive day on Tuesday  and some industry executives have begun speaking out against the Trump administration's ban on travel from seven majority Muslim nations.",
        "date": "02012017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "U.S. airline  travel agency shares nosedive amid immigration ban turmoil "
    },
    {
        "content": "* \"Approximately 80 flights scheduled for today have been canceled with additional cancellations possible\"",
        "date": "01302017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta systems return to normal; some flight cancellations linger "
    },
    {
        "content": "NEW YORK Delta Air Lines Inc said it had resumed limited operations after a systems outage grounded its domestic U.S. flights on Sunday evening.",
        "date": "01302017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta resumes limited U.S. domestic operations after systems outage "
    },
    {
        "content": "* Delta says canceled 150 flights to depart Sunday/early Monday   (Updates with website back up)",
        "date": "01302017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-Delta resumes limited U.S. domestic operations after systems outage "
    },
    {
        "content": "* Delta flights are departing and ground stop has been lifted as the airline's IT systems begin to return to normal - website",
        "date": "01302017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta says flights are departing and ground stop has been lifted "
    },
    {
        "content": "NEW YORK  Jan 29 The Federal Aviation Administration on Sunday said all Delta Air Lines Inc's  domestic flights were grounded until 0100 GMT after a request from the company due to an \"automation issue.\"",
        "date": "01302017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta grounds domestic U.S. flights after 'automation issue' -FAA "
    },
    {
        "content": "* Delta board of directors names Jeanne Jackson as newest member",
        "date": "01252017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines names Jeanne Jackson to board of directors "
    },
    {
        "content": "DUBLIN Aeromexico said on Thursday it expects a share tender transaction to lift Delta Air Lines' stake to 49 percent to be completed by the end of the second quarter.",
        "date": "01192017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Aeromexico says Delta to complete acquisition of 49 percent stake in second quarter "
    },
    {
        "content": "DUBLIN  Jan 19 Aeromexico said on Thursday it expects a share tender transaction to lift Delta Air Lines' stake to 49 percent to be completed by the end of the second quarter.",
        "date": "01192017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Aeromexico says Delta to complete acquisition of 49 percent stake in Q2 "
    },
    {
        "content": "Delta Air Lines Inc  expects a closely watched revenue measure to rise for the first time in two years  although higher labor costs will weigh on its profits in 2017  the company said on Thursday.",
        "date": "01122017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air predicts rise in key revenue measure "
    },
    {
        "content": "Jan 12 Delta Air Lines Inc expects a closely watched revenue measure to rise for the first time in two years  although higher labor costs will weigh on its profits in 2017  the company said on Thursday.",
        "date": "01122017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 3-Delta Air predicts rise in key revenue measure "
    },
    {
        "content": "* Delta Air Lines announces December quarter and full year 2016 profit",
        "date": "01122017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines Q4 earnings per share $0.84 "
    },
    {
        "content": "Jan 12 Delta Air Lines Inc on Thursday reported a 36.5 percent decline in fourth-quarter profit and forecast passenger unit revenue  a closely watched metric  to be flat to up 2 percent in early 2017.",
        "date": "01122017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air profit falls 36.5 percent "
    },
    {
        "content": "* Delta - expects continued disruption to Fort Lauderdale flying for rest of day  following reports of shooting in baggage claim area in Terminal 2  Source text: (http://bit.ly/2i1RuAV ) Further company coverage:",
        "date": "01062017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta cancels Fort Lauderdale flights  activates care team "
    },
    {
        "content": "Jan 6 Diary of U.S. (.SPX) corporate earnings for the week ahead.         ** Please Note - All times given are in U.S. EST unless otherwise stated **            U.S. EARNINGS            Start Date    Start Time  RIC     Company                            Event Name  09-Jan-2017   BMO         GPN.N   Global Payments Inc                Q2 2017 Global Payments Inc Earnings Release  09-Jan-2017   BMO         AYI.N   Acuity Brands Inc                  Q1 2017 Acuity Brands Inc Earnings Re",
        "date": "01062017",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "DIARY-U.S. earnings week ahead "
    },
    {
        "content": "Delta Air Lines Inc  said on Wednesday it expected a smaller decline in fourth-quarter passenger unit revenue  a closely watched metric  than it had previously forecast  citing strong demand in December.",
        "date": "01042017",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air Lines forecasts smaller drop in key revenue measure "
    },
    {
        "content": "Delta Air Lines Inc  said on Tuesday that in agreement with Boeing Co  it would cancel an order for 18 787 Dreamliner aircraft  which it assumed as a part of its merger with Northwest Airlines. | Video ",
        "date": "12282016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta to cancel order for 18 Boeing 787 Dreamliner aircraft "
    },
    {
        "content": "NEW YORK Delta Air Lines Inc removed two men from a plane at London's Heathrow Airport before takeoff on Wednesday  and one of the men accused the airline of acting on passenger complaints that he had been speaking on a phone in Arabic. | Video ",
        "date": "12222016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta says removes plane passengers for 'provocative behavior' "
    },
    {
        "content": "Delta Air Lines Inc   which has expanded its own operations in the Pacific Northwest  will end its codeshare agreement next year with Alaska Air Group Inc   which is acquiring Virgin America Inc   Delta said on Monday.",
        "date": "12192016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air to end codeshare deal with Alaska Air "
    },
    {
        "content": "Delta Air Lines Inc  on Thursday said it expected a two-year decline in unit revenue to end in early 2017 as prices for last-minute trips have firmed  and appealed to U.S. President-elect Donald Trump to fight foreign airlines that it says compete unfairly.",
        "date": "12152016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta sees demand surge post-U.S. election  asks Trump to fight Gulf airlines "
    },
    {
        "content": "WASHINGTON The U.S. Transportation Department said on Wednesday it had granted final approval to an alliance agreement submitted by Delta Air Lines Inc  and Aeromexico .",
        "date": "12142016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "U.S. gives final approval to Delta-Aeromexico venture "
    },
    {
        "content": "MONTREAL/NEW YORK Delta Air Lines Inc  pilots on Thursday agreed to a new contract that delivers a 30 percent pay raise by 2019  as the aviation industry deals with mounting demand for higher wages to fly planes at a time of big profits.",
        "date": "12012016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta pilots get 30 percent raise by 2019 in new contract "
    },
    {
        "content": "NEW YORK Delta Air Lines Inc is preparing to market gasoline from a refinery it owns outside Philadelphia  signaling a shift in strategy toward managing the plant as a commercial refiner rather than a dedicated jet fuel supplier.",
        "date": "12022016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air to sell gasoline and diesel as losses at its refinery climb "
    },
    {
        "content": "Delta Air Lines Inc  said on Friday it would take a $475 million hit in the fourth quarter from a new contract that hikes pilots' pay retroactively to the beginning of 2016.",
        "date": "12022016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines lowers profit forecast due to new pilot contract "
    },
    {
        "content": "MONTREAL Delta Air Lines Inc  pilots are expected to keep existing rules in their new labor contract that prevent the U.S. No. 2 carrier from flying aircraft above a certain weight on regional routes  in a blow to Embraer SA  and Mitsubishi Heavy Industries Ltd   whose latest models exceed that limit.",
        "date": "11252016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta pilots oppose big regional jets  could be issue for Embraer  Mitsubishi "
    },
    {
        "content": "MEXICO CITY  Nov 22 Shares in Mexican airline Aeromexico slid more than 7.5 percent on Tuesday  on fears that a proposed alliance with Delta Air Lines Inc  could face headwinds after the U.S. airline said U.S. regulators had put strict conditions on the deal.    (Reporting by Veronica Gomez; Editing by Jonathan Oatis)",
        "date": "11222016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Shares in Aeromexico plunge on fears of Delta alliance complications "
    },
    {
        "content": "MONTREAL  Nov 25 Delta Air Lines Inc  pilots are expected to keep existing rules in their new labor contract that prevent the U.S. No. 2 carrier from flying aircraft above a certain weight on regional routes  in a blow to Embraer SA and Mitsubishi Heavy Industries Ltd   whose latest models exceed that limit.",
        "date": "11252016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta pilots oppose big regional jets  could be issue for Embraer  Mitsubishi "
    },
    {
        "content": "MONTREAL  Nov 25 Delta Air Lines Inc  pilots are expected to keep existing rules in their new labor contract that prevent the U.S. No. 2 carrier from flying aircraft above a certain weight on regional routes  in a blow to Embraer SA and Mitsubishi Heavy Industries Ltd   whose latest models exceed that limit.",
        "date": "11252016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta pilots oppose larger regional aircraft  in blow to Embraer -sources "
    },
    {
        "content": "* Berkshire Hathaway Inc takes share stake of 6.3 million shares in Delta Air Lines Inc - SEC filing",
        "date": "11142016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Berkshire Hathaway takes stakes in United Continental  Delta Air "
    },
    {
        "content": "Nov 14 Warren Buffett's Berkshire Hathaway Inc  on Monday said it has bought shares in the four biggest U.S. airlines: American Airlines Group Inc  Delta Air Lines Inc  Southwest Airlines Co and United Continental Holdings Inc.",
        "date": "11142016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Buffett's Berkshire makes bet on U.S. airlines "
    },
    {
        "content": "* Omega advisors cuts share stake in delta air lines by 15.8 percent to 976 400 shares",
        "date": "11142016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Omega Advisors takes share stake in U.S. Steel  cuts in Delta Air - SEC Filing "
    },
    {
        "content": "SHANGHAI  Nov 14 China Eastern Airlines   said it has applied for government permission to operate as an investment firm - a move that would allow it to reduce its reliance on ticket sales and diversify into other businesses.",
        "date": "11142016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "China Eastern Airlines seeks govt approval to become investment firm "
    },
    {
        "content": "* Delta Air Lines Inc - on October 28  2016  board approved amendments to delta's bylaws  primarily to implement a proxy access provision - SEC filing  Source text: (http://bit.ly/2f2hlbi) Further company coverage:",
        "date": "10312016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines' board approve amendments to Delta's bylaws "
    },
    {
        "content": "* Delta  Virgin Atlantic and Jet Airways expand cooperation with India-United States codeshare via London-Heathrow  Source text for Eikon:  Further company coverage:",
        "date": "10312016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines  Virgin Atlantic expand cooperation with Jet Airways "
    },
    {
        "content": "Nov 2 Delta Air Lines Inc on Wednesday announced a marketing agreement with Airbnb  becoming one of the largest established companies in the travel industry to embrace the 8-year-old apartment-sharing service.",
        "date": "11022016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta turns to apartment-sharing service Airbnb for more business "
    },
    {
        "content": "NEW YORK/HOUSTON Major airlines including Delta  United and American could face higher fuel costs if U.S. regulators allow Colonial Pipeline Co to stop shipping a dirtier blend of jet fuel by 2018.",
        "date": "11022016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Colonial Pipeline plan to cut off dirty jet fuel could hit airlines "
    },
    {
        "content": "* Delta and Airbnb team up to invite travelers to fly global  live local",
        "date": "11022016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta  Airbnb team up to invite travelers to fly global  live local "
    },
    {
        "content": "WASHINGTON/NEW YORK Delta Air Lines Inc  and Aeromexico can set prices and coordinate schedules for their U.S.-Mexico flights  but they must free up certain airport slots to bolster competition  the U.S. Transportation Department tentatively ruled on Friday.",
        "date": "11042016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "U.S. tentatively approves Delta-Aeromexico venture "
    },
    {
        "content": "WASHINGTON/NEW YORK  Nov 4 Delta Air Lines Inc  and Aeromexico can set prices and coordinate schedules for their U.S.-Mexico flights  but they must free up certain airport slots to bolster competition  the U.S. Transportation Department tentatively ruled on Friday.",
        "date": "11042016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-U.S. tentatively approves Delta-Aeromexico venture "
    },
    {
        "content": "WASHINGTON  Nov 4 The U.S. Transportation Department said Friday it has tentatively granted antitrust immunity for a proposed alliance between Delta Air Lines Inc  and Grupo Aeromexico SAB de CV  requiring the carriers to divest some slots in New York and Mexico City.",
        "date": "11042016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "U.S. tentatively grants antitrust approval for Delta  Aeromexico alliance "
    },
    {
        "content": "* Sets quarterly dividend of $0.2025 per share  Source text for Eikon:  Further company coverage:",
        "date": "10282016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines sets quarterly dividend of $0.2025 per share "
    },
    {
        "content": "Delta Air Lines Inc  on Thursday said it will add fewer seats for purchase than usual in early 2017 to prop up fares  reacting to a deluge of flights from rivals that is squeezing its profit margins.",
        "date": "10132016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta profit tops view  plans to curb flight capacity "
    },
    {
        "content": "Oct 13 Delta Air Lines Inc on Thursday said it will add fewer seats for purchase than usual in early 2017 to prop up fares  reacting to a deluge of flights from rivals that is squeezing its profit margins.",
        "date": "10132016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 3-Delta profit tops view  plans to curb flight capacity "
    },
    {
        "content": "* Delta Air Lines CEO Ed Bastian on CNBC- cautiously optimistic about economic growth going into 2017",
        "date": "10132016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines CEO says is cautiously optimistic about economic growth going into 2017- CNBC "
    },
    {
        "content": "Oct 13 Delta Air Lines Inc on Thursday reported a third-quarter profit above analysts' expectations and said moves to curb its growth in flight capacity will help offset the future decline of a closely watched revenue measure.",
        "date": "10132016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines Q3 profit tops estimates "
    },
    {
        "content": "* Delta Air Lines CEO Ed Bastian on CNBC- demand was really strong this quarter; had some of the co's strongest days in its history this summer",
        "date": "10132016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines CEO Ed Bastian says demand was really strong this quarter - CNBC "
    },
    {
        "content": "* Delta Air Lines Inc sees december 2016 quarter operating margin 14 pct - 16 pct",
        "date": "10132016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines reports September quarter profit "
    },
    {
        "content": "* Anderson retiring from Delta board of directors; Francis S. Blake named non-executive chairman",
        "date": "10112016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines announces board changes "
    },
    {
        "content": "* Press release - Delta adds service between Los Angeles and Washington-Reagan",
        "date": "10102016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta adds service between Los Angeles and Washington "
    },
    {
        "content": "* Delta has canceled 120 flights to and from Miami  Fort Lauderdale And West Palm Beach airports beginning about noon Thursday",
        "date": "10062016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta cancels 120 flights to and from Miami  Fort Lauderdale  West Palm Beach airports "
    },
    {
        "content": "NEW YORK Delta Air Lines  this year carried the most passengers in a summer ever  despite a computer outage in August  Chief Executive Officer Ed Bastian said on Friday.",
        "date": "10072016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta had best-ever summer traffic; adds computer backup: CEO "
    },
    {
        "content": "NEW YORK  Oct 7 Delta Air Lines this year carried the most passengers in a summer ever  despite a computer outage in August  Chief Executive Officer Ed Bastian said on Friday.",
        "date": "10072016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-Delta had best-ever summer traffic; adds computer backup -CEO "
    },
    {
        "content": "Oct 4 Delta Air Lines Inc reported a smaller-than-expected drop in consolidated passenger unit revenue for September and maintained its operating margin forecast for the quarter despite suffering a system outage in August.",
        "date": "10042016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta posts smaller-than-expected fall in passenger unit revenue "
    },
    {
        "content": "Oct 4 Delta Air Lines Inc reported a smaller-than-expected drop in consolidated passenger unit revenue for September and maintained its operating margin forecast for the quarter despite suffering a system outage in August.",
        "date": "10042016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta posts smaller-than-expected fall in passenger unit revenue "
    },
    {
        "content": "* Expects Sept quarter operating margin of about 18-19 percent  which includes 1.5 pts of impact from the August outage",
        "date": "10042016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines expects Sept. quarter operating margin of about 18-19 pct "
    },
    {
        "content": "Delta Air Lines Inc plans to buy larger regional jets with a list value of up to $2.3 billion if it can get its pilots' union to accept an overhaul of the small-plane fleet  Bloomberg reported on Tuesday.",
        "date": "09272016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta plans regional-jet purchase for up to $2.3 billion: Bloomberg "
    },
    {
        "content": "Sept 27 Delta Air Lines Inc plans to buy larger regional jets with a list value of up to $2.3 billion if it can get its pilots' union to accept an overhaul of the small-plane fleet  Bloomberg reported on Tuesday.",
        "date": "09272016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta plans regional-jet purchase for up to $2.3 bln - Bloomberg "
    },
    {
        "content": "* Delta mulls $2.3 billion regional-jet purchase in fleet shift - Bloomberg",
        "date": "09272016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta mulls $2.3 billion regional-jet purchase in fleet shift - Bloomberg "
    },
    {
        "content": "CHICAGO  Sept 29 The U.S. Commodity Futures Trading Commission on Thursday penalized a former Delta Air Lines fuel trading executive $5.25 million over futures and options trades the agency said were illegal.",
        "date": "09292016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "CFTC fines  bans former Delta Air fuel executive over illegal trades "
    },
    {
        "content": "* Delta  Air France-KLM extend codeshare co-operation with Jet Airways through Paris and Amsterdam  Source text for Eikon:  Further company coverage:",
        "date": "09272016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta  Air France-KLM extend codeshare co-operation with Jet Airways through Paris and Amsterdam "
    },
    {
        "content": "* Delta Air Lines announces new routes to connect New York-JFK  Boston to Europe",
        "date": "09292016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines announces new routes connecting New York-JFK  Boston to Europe "
    },
    {
        "content": "* Delta adds to trans-Pacific network with new Virgin Australia route to Melbourne  Source text for Eikon:  Further company coverage:",
        "date": "09202016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta adds to trans-Pacific network with new Virgin Australia route to Melbourne "
    },
    {
        "content": "* Operations back to normal at Juan Santamaria International Airport in San Jose  volcanic ash from Turrialba volcano triggered temporary closure of San Jose Airport  Source text: http://bit.ly/2cmxMtG  Further company coverage:",
        "date": "09212016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta resumes Costa Rica operations after volcanic ash incident "
    },
    {
        "content": "U.S. airline stocks jumped on Wednesday after Delta Air Lines Inc  said sales trends were improving and Southwest Airlines Co  said it would slow its breakneck growth of flights in 2017  giving investors hope that the industry could recover from a revenue rut.",
        "date": "09072016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta  Southwest outlooks lift U.S. airline stocks "
    },
    {
        "content": "Sept 7 U.S. airline stocks jumped on Wednesday after Delta Air Lines Inc said sales trends were improving and Southwest Airlines Co said it would slow its breakneck growth of flights in 2017  giving investors hope that the industry could recover from a revenue rut.",
        "date": "09072016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-Delta  Southwest outlooks lift U.S. airline stocks "
    },
    {
        "content": "Sept 7 Delta Air Lines Inc has lowered its operating profit margin forecast for the third quarter after a power outage in August forced it to cancel 2 300 flights over a three-day period  the company said in a filing on Wednesday.",
        "date": "09072016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air lowers profit margin forecast after outage "
    },
    {
        "content": "* Sees September quarter operating margin 18 percent to 19 percent",
        "date": "09072016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines sees September qtr operating margin 18-19 pct "
    },
    {
        "content": "* S&P - Delta Air Lines outlook revised to positive; Ratings affirmed",
        "date": "09022016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-S&P revises Delta Air Lines outlook to positive "
    },
    {
        "content": "Aug 31 The U.S. government on Wednesday granted eight U.S. airlines permission to begin scheduled commercial flights to Havana starting as early as this fall  with American Airlines Group Inc  Delta Air Lines Inc and United Continental Holdings Inc among the winners.",
        "date": "08312016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "U.S. awards Havana routes to 8 airlines  including American  Delta "
    },
    {
        "content": "* Delta reports financial and operating performance for august 2016",
        "date": "09022016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta reports financial and operating performance for august 2016 "
    },
    {
        "content": "* Delta Air Lines is expanding in Boston with new service to San Francisco and Nashville  as well as more flights to Seattle Milwaukee  Source text for Eikon:  ]",
        "date": "08152016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta adds service from Boston International Airport "
    },
    {
        "content": "Delta Air Lines Inc  canceled hundreds of flights and delayed many others on Monday after an outage hit its computer systems  grounding planes and stranding passengers of one of the world's largest carriers at airports around the globe. | Video ",
        "date": "08082016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Power outage at Delta causes flight cancellations  delays "
    },
    {
        "content": "Delta Air Lines Inc  said it had canceled about 25 flights on Thursday as operations return to normal following a power outage on Monday that hit its computer systems  leading to cancellation of nearly 2 000 flights.",
        "date": "08112016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta cancels 25 flights  some due to bad weather "
    },
    {
        "content": "Aug 8 Delta Air Lines Inc canceled hundreds of flights and delayed many others on Monday after an outage hit its computer systems  grounding planes and stranding passengers of one of the world's largest carriers at airports around the globe.",
        "date": "08082016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 9-Power outage at Delta causes flight cancellations  delays "
    },
    {
        "content": "* Vouchers are available for travel on all Delta and Delta connection-operated flights",
        "date": "08082016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines offers compensation for customers affected by systemwide outage "
    },
    {
        "content": "Aug 11 Delta Air Lines Inc said it had canceled about 25 flights on Thursday as operations return to normal following a power outage on Monday that hit its computer systems  leading to cancellation of nearly 2 000 flights.",
        "date": "08112016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta cancels 25 flights  some due to bad weather "
    },
    {
        "content": "Delta Air Lines Inc  on Wednesday canceled more than 300 flights and upended thousands of travelers' plans for the third day in a row after a power outage hit its computer systems  though it forecast a return to normal operations later this afternoon.",
        "date": "08102016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta cancels hundreds more flights  expects normal operations soon "
    },
    {
        "content": "NEW YORK  Aug 10 Major refiners like Valero Energy Corp are on track to pay record amounts this year for credits to comply with U.S. renewable fuel rules  corporate filings show  a trend that hurts profits and has some looking to export more to avoid the cost.",
        "date": "08102016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Refiners on track to spend record on U.S. clean fuel standards "
    },
    {
        "content": "Aug 10 Delta Air Lines Inc on Wednesday canceled more than 300 flights and upended thousands of travelers' plans for the third day in a row after a power outage hit its computer systems  though it forecast a return to normal operations later this afternoon.",
        "date": "08102016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 3-Delta cancels hundreds more flights  expects normal operations soon "
    },
    {
        "content": "Aug 10 Delta Air Lines said it expects to return to normal operations on Wednesday after a power outage hit its computer systems on Monday  causing the cancellation of more than 1 600 flights over two days.",
        "date": "08102016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta expects normal operations to resume on Wednesday "
    },
    {
        "content": "* Delta Air Lines says \"working hard to achieve a normal operation by mid day tomorrow\"",
        "date": "08102016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines says outlook for Wednesday's operation is positive "
    },
    {
        "content": "NEW YORK Delta Air Lines Inc is flooding the New York market with jet fuel from its refinery  sacrificing refining profits in order to lower the carrier’s fuel costs  according to a company memo seen by Reuters.",
        "date": "08032016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Exclusive: Delta's refinery sacrifices profits for lower fuel cost - memo "
    },
    {
        "content": "* Consolidated passenger unit revenue (prasm) for month of july declined 7.0% year over year",
        "date": "08022016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines consolidated passenger unit revenue for July declined 7% year over year "
    },
    {
        "content": "* Sets quarterly dividend of $0.2025 per share  Source text for Eikon:  Further company coverage:",
        "date": "07292016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta air lines sets quarterly dividend of $0.2025/share "
    },
    {
        "content": "NEW YORK  July 26 Valero Energy Corp  the largest U.S. refiner  expects to get hit with a half-billion-dollar bill in the second half of the year thanks to the rising cost of meeting government mandates to blend biofuels.",
        "date": "07262016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Valero says biofuels blending costs could double in 2016 "
    },
    {
        "content": "* Co  port authority of New York and New Jersey will partner to replace terminals C and D at New York's Laguardia airport  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07212016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta to partner with Port Authority on LaGuardia terminal redevelopment "
    },
    {
        "content": "July 20 Delta Air Lines Inc said its $1.9 billion plan to upgrade its terminals at Los Angeles International Airport were approved by the airport on Wednesday.",
        "date": "07212016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Los Angeles airport approves Delta terminal plan "
    },
    {
        "content": "WASHINGTON  July 20 Four U.S. carriers have won tentative approval to launch daytime U.S. flights to Tokyo's Haneda airport as early as this fall  the U.S. Transportation Department said on Wednesday.",
        "date": "07202016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Four U.S. airlines get OK for daytime flights to Tokyo Haneda "
    },
    {
        "content": "July 14 Delta Air Lines Inc's decision to sell fewer seats from the United Kingdom this winter highlights the threat that Britain's planned exit from the European Union and new airline competition pose to U.S. airlines that have raked in cash from flights across the Atlantic.",
        "date": "07142016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta's UK woes signal tougher times for airlines' trans-Atlantic business "
    },
    {
        "content": "Delta Air Lines Inc  on Thursday reported a higher-than-expected profit for the second quarter and said it would make fewer seats available to the United Kingdom and elsewhere than previously planned this autumn so ticket prices do not drop.",
        "date": "07142016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air tops profit expectations  plans to curb growth "
    },
    {
        "content": "July 14 Delta Air Lines Inc on Thursday reported a higher-than-expected profit for the second quarter and said it would make fewer seats available to the United Kingdom and elsewhere than previously planned this autumn so ticket prices do not drop.",
        "date": "07142016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-Delta Air tops profit expectations  plans to curb growth "
    },
    {
        "content": "NEW YORK  July 6 U.S. East Coast refiners have cut production in recent days amid mounting concerns that a glut of supply will hammer profits even as motorists are expected to hit U.S. roads in record numbers this summer.",
        "date": "07062016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "UPDATE 2-Philadelphia refinery cuts output as gasoline margins sink -source "
    },
    {
        "content": "* Delta reports financial and operating performance for june 2016",
        "date": "07052016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta reports financial and operating performance for June 2016 "
    },
    {
        "content": "July 5 Delta Air Lines Inc on Tuesday said it expects a smaller profit margin for the just-ended second quarter because it settled fuel hedges early  and it lowered guidance slightly for passenger unit revenue.",
        "date": "07052016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines lowers profit margin forecast due to fuel hedges "
    },
    {
        "content": "* Delta to serve Havana  Cuba  from New York-JFK  Atlanta and Miami",
        "date": "07072016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines to serve Havana from New York-JFK  Atlanta  Miami "
    },
    {
        "content": "* Delta Air Lines Inc Sees June Qtr Average Fuel Price Per Gallon $1.95 - $2.00",
        "date": "07052016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines sees June quarter system capacity up about 3 pct "
    },
    {
        "content": "WASHINGTON  July 7 The Obama administration on Thursday proposed eight airlines including United Continental Holdings Inc  Delta Air Lines Inc  American Airlines Group Inc (AAL.O> and JetBlue Airlines Corp to start nonstop flights from the United States to Havana  Cuba as early as this fall  administration officials said.",
        "date": "07072016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "U.S. proposes United  Delta  American airlines fly nonstop to Havana "
    },
    {
        "content": "CHICAGO CME Group on Monday banned a former Delta Air Lines fuel trading executive for using his wife's accounts to \"front-run\" the airline's hedging positions - trades that netted him a profit of more than $3 million.",
        "date": "06142016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Former Delta fuel executive  wife banned by CME "
    },
    {
        "content": "CHICAGO  June 13 CME Group on Monday banned a former Delta Air Lines fuel trading executive for using his wife's accounts to \"front-run\" the airline's hedging positions - trades that netted him a profit of more than $3 million.",
        "date": "06142016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Former Delta fuel executive  wife banned by CME "
    },
    {
        "content": "CHICAGO  June 13 CME Group on Monday banned a former Delta Air Lines fuel executive for using accounts owned by his wife to front-run trades subsequently entered in an account controlled by the carrier and for breaking other exchange rules.",
        "date": "06132016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Former Delta Air fuel executive  wife banned from CME markets "
    },
    {
        "content": "NEW YORK Airlines' efforts to help the U.S. government manage long airport security lines are not sustainable  the chief executive of American Airlines Group Inc said in an interview.",
        "date": "06092016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Efforts to cut U.S. airport security delays not sustainable: American Airlines CEO "
    },
    {
        "content": "Delta Air Lines Inc   the No. 2 U.S. airline by passenger traffic  expects two key second-quarter financial measures will be at the weaker end of its prior forecast  its chief financial officer said on Wednesday.",
        "date": "06082016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air Lines sees second-quarter profit margin near lower end of guidance: CFO "
    },
    {
        "content": "June 8 Delta Air Lines Inc  the No. 2 U.S. airline by passenger traffic  expects two key second-quarter financial measures will be at the weaker end of its prior forecast  its chief financial officer said on Wednesday.",
        "date": "06082016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta Air Lines sees Q2 profit margin near lower end of guidance - CFO "
    },
    {
        "content": "June 8 Delta Air Lines Inc  the No. 2 U.S. airline by passenger traffic  expects two key financial measures to fall near the lower end of its prior forecast in the second quarter  the chief financial officer said on Wednesday.",
        "date": "06082016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines expects 2nd qtr profit margin near lower end of guidance - CFO "
    },
    {
        "content": "* Currently operates a daily year-round service between Brussels and New York-JFK",
        "date": "06082016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta to restart Brussels-Atlanta service for summer 2017 "
    },
    {
        "content": "* Delta doubles network to Scotland with new route between New York-JFK and Glasgow",
        "date": "06072016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines announces new route between New York-JFK  Glasgow "
    },
    {
        "content": "ZURICH South American airlines group Avianca's doors are open to any opportunities presented by interested partners to help it grow when economic conditions in its region improve  the head of Avianca Brasil said on Saturday.",
        "date": "06042016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Avianca Brasil chief says 'door open' for interested airlines "
    },
    {
        "content": "United Continental Holdings Inc  and Delta Air Lines Inc  are among the possible bidders for Colombia's Avianca Holdings SA   the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "06032016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "United Continental  Delta Air Lines possible bidders for Avianca: WSJ "
    },
    {
        "content": "DUBLIN  June 1 Canada's Bombardier Inc  believes it has turned the corner with its troubled CSeries jet programme and is confident of posting further wins on top of a recent major order from Delta Air Lines  its chief executive said.",
        "date": "06012016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "UPDATE 2-Bombardier sees more CSeries jet deals after Delta "
    },
    {
        "content": "June 2 United Continental Holdings Inc  and Delta Air Lines Inc are among the possible bidders for Latin America's Avianca Holdings SA  the Wall Street Journal reported on Thursday.",
        "date": "06022016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "United Continental  Delta Air Lines possible bidders for Avianca -WSJ "
    },
    {
        "content": "ZURICH  June 4 South American airlines group Avianca's doors are open to any opportunities presented by interested partners to help it grow when economic conditions in its region improve  the head of Avianca Brasil said on Saturday.",
        "date": "06042016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Avianca Brasil chief says \"door open\" for interested airlines "
    },
    {
        "content": "DUBLIN/MONTREAL  June 3 Bombardier  performed a high-stake sales pitch for its CSeries jet at 30 000 feet on Friday  hoping to persuade more than two dozen airline bosses to buy the industry's newest fuel-saving model while reining in discounts.",
        "date": "06032016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "REFILE-Bombardier faces discount headache as CSeries sales take off "
    },
    {
        "content": "NEW YORK  June 2 Boeing Co expects to hit its target of $10 billion in operating cash flow this year and to return all free cash flow to shareholders  Chief Executive Officer Dennis Muilenburg said on Thursday.",
        "date": "06022016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-Boeing promises cash amid tanker delay; sees Iran deals ahead "
    },
    {
        "content": "June 3 The following bids  mergers  acquisitions and disposals were reported by 2030 GMT on Friday:",
        "date": "06032016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Says demand is strong  sees all time record this summer; making record margins  Further company coverage:    (Reporting By Conor Humphries)",
        "date": "06022016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta CEO says sees record demand this summer "
    },
    {
        "content": "June 3 Avianca Holdings SA's   U.S.-listed shares jumped as much as 23 percent on Friday after reports that United Continental Holdings Inc and Delta Air Lines Inc were weighing bids for the airline.",
        "date": "06032016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "RPT-Colombia's Avianca surges on takeover reports "
    },
    {
        "content": "June 3 Avianca Holdings SA's   U.S.-listed shares jumped as much as 23 percent on Friday after reports that United Continental Holdings Inc and Delta Air Lines Inc were weighing bids for the airline.",
        "date": "06032016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Colombia's Avianca surges on takeover reports "
    },
    {
        "content": "June 2 United Continental Holdings Inc  and Delta Air Lines Inc are among the possible bidders for Colombia's Avianca Holdings SA  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "06032016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-United Continental  Delta Air Lines possible bidders for Avianca -WSJ "
    },
    {
        "content": "LOS ANGELES  May 26 Planes arriving and departing Los Angeles International Airport were delayed on Thursday after a problem with air-traffic control software briefly halted all flights  according to U.S. and local air traffic officials.",
        "date": "05262016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "UPDATE 2-Software problem delays Los Angeles flights - FAA "
    },
    {
        "content": "* New year-round service extends delta's UK network into Scotland",
        "date": "05262016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta says launches year-round service from NY-JFK to Edinburgh "
    },
    {
        "content": "May 16 Delta Air Lines Inc on Monday said it will fly fewer seats this winter than it had planned and defer the 2018 delivery of four large aircraft  as extra flights by rivals threaten to depress its ticket prices.",
        "date": "05162016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta trims growth in flights as rivals' expansion hurts prices "
    },
    {
        "content": "* Omega advisors inc cuts share stake in e*trade financial corp by 27.0 percent to 2.5 million shares",
        "date": "05162016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Omega Advisors cuts share stake in AIG  Delta Air Lines "
    },
    {
        "content": "* U.S. Bankruptcy court issued ruling approving co's amendments to agreements with Delta Air Lines",
        "date": "05032016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Republic Airways says U.S. Bankruptcy court approved co's amendments to agreements with Delta Air Lines "
    },
    {
        "content": "* Delta reports financial and operating performance for april 2016",
        "date": "05032016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines April load factor 83.3 pct vs 83.2 pct "
    },
    {
        "content": "MEXICO CITY Mexico's federal competition commission (Cofece) approved Aeromexico's $1.5 billion joint venture with Delta with certain conditions  Aeromexico said in a filing on Monday.",
        "date": "05022016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Mexico competition watchdog approves Aeromexico-Delta joint venture "
    },
    {
        "content": "MONTREAL/TORONTO Canadian planemaker Bombardier Inc  faces a pivotal week that may see a key deal announced with Delta Air Lines Inc  but a federal aid package is unlikely to be approved in time for its annual meeting on Friday.",
        "date": "04252016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Bombardier in spotlight as market watches for Delta deal  AGM "
    },
    {
        "content": "* Declared a quarterly dividend of $0.135 per share  Source text for Eikon:  Further company coverage:",
        "date": "04272016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air lines declares qtrly dividend of $0.135 per share "
    },
    {
        "content": "OTTAWA  April 28 A big order by Delta Airlines Inc for Bombardier Inc jets does not change the Canadian government's stance on whether to meet the plane maker's request for financial aid  a source close to the matter said on Thursday.",
        "date": "04282016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "UPDATE 1-Bombardier jet order does not change Ottawa's stance on aid -source "
    },
    {
        "content": "Bombardier Inc  announced on Thursday a much-anticipated order from Delta Air Lines  for up to 125 of its CSeries passenger jets  throwing a lifeline to the Canadian company which also reported a quarterly loss.",
        "date": "04282016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Bombardier to sell up to 125 CSeries jets to Delta  posts first-quarter loss "
    },
    {
        "content": "* Delta Air Lines and Bombardier sign largest C SERIES order for up to 125 aircraft",
        "date": "04282016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF- Delta Air Lines and Bombardier sign largest C SERIES order "
    },
    {
        "content": "April 28 Bombardier Inc announced on Thursday a much-anticipated order from Delta Air Lines  for up to 125 of its CSeries passenger jets  throwing a lifeline to the Canadian company which also reported a quarterly loss.",
        "date": "04282016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Bombardier to sell up to 125 CSeries jets to Delta  posts Q1 loss "
    },
    {
        "content": "* Bombardier announces major C Series order and reports financial results for the first quarter of 2016",
        "date": "04282016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Bombardier reports Q1 loss per share $0.07 "
    },
    {
        "content": "(Adds details  background)     April 28 Delta Air Lines Inc on Thursday ordered 75 CSeries CS100 planes worth $5.6 billion from Bombardier Inc  throwing a lifeline to a new aircraft program that is years late and billions of dollars over budget.     The widely anticipated order marks a turning point for Canada's Bombardier as it strives to break into the fleets of top airlines globally and serve a niche market for 100-seat planes that larger rivals Boeing Co and Airbus Group SE  h",
        "date": "04282016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta throws Bombardier a lifeline with deal to buy 75 CSeries "
    },
    {
        "content": "ATLANTA Delta Air Lines Inc  said on Friday it has ordered 37 current-generation A321 aircraft from Airbus Group SE  worth $4.25 billion at list prices  a move that will help it replace aging aircraft.",
        "date": "04292016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta orders 37 Airbus A321s worth $4.25 billion "
    },
    {
        "content": "* Delta orders Of-The-Art  fuel-efficient bombardier c series",
        "date": "04282016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta orders state-of-the-art  fuel-efficient Bombardier C Series "
    },
    {
        "content": "April 28 Bombardier Inc announced a much anticipated order from Delta Air Lines for 75 of its CSeries narrow-body passenger jets on Thursday.",
        "date": "04282016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Bombardier to sell Delta 75 CSeries jets  posts Q1 loss "
    },
    {
        "content": "ATLANTA Concern over future U.N. aircraft emissions standards was a factor in a Delta Air Lines Inc deal announced this week to buy 75 new CS100 jets from Bombardier Inc  a Delta executive said on Friday.",
        "date": "04292016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Emissions standards a factor in Delta's Bombardier jets deal: Delta executive "
    },
    {
        "content": "ATLANTA Delta Air Lines Inc  sees opportunities for the airlines in which it owns equity stakes to cooperate more in the next five years  Delta's incoming Chief Executive Ed Bastian told reporters in Atlanta on Friday.",
        "date": "04292016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta sees room for more cooperation with equity partners "
    },
    {
        "content": "ATLANTA  April 29 Delta Air Lines Inc  sees opportunities for the airlines in which it owns equity stakes to cooperate more in the next five years  Delta's incoming Chief Executive Ed Bastian told reporters in Atlanta on Friday.",
        "date": "04292016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta sees room for more cooperation with equity partners "
    },
    {
        "content": "April 28 Delta Air Lines Inc on Thursday said it ordered 75 CSeries CS100 planes from Bombardier Inc   throwing a lifeline to a new aircraft program that is years late and billions of dollars over budget.     The widely anticipated order marks a turning point for Canada's Bombardier as it strives to break into the fleets of top airlines globally and serve a niche market for 100-seat planes that larger rivals Boeing Co and Airbus Group SE  have neglected.    (Reporting By Jeffrey Dast",
        "date": "04282016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta throws Bombardier a lifeline with deal to buy 75 CSeries "
    },
    {
        "content": "TORONTO  April 29 Canada's main stock index rose on Friday as mining and energy stocks firmed on higher commodity prices  while shares of its largest airline jumped after quarterly results were reported.",
        "date": "04292016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "CANADA STOCKS-TSX rises as resource stocks rally on higher commodity prices "
    },
    {
        "content": "ATLANTA  April 29 Delta Air Lines Inc  sees opportunities for the airlines in which it owns equity stakes to cooperate more in the next five years  Delta's incoming Chief Executive Ed Bastian told reporters in Atlanta on Friday.",
        "date": "04292016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air sees chance for equity partners to cooperate more - incoming CEO "
    },
    {
        "content": "April 29 Canada's main stock index was set to open lower on Friday after data showed that the country's economy stalled in February as activity in the manufacturing and natural resource sectors slowed.",
        "date": "04292016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "CANADA STOCKS-Futures decline after weak economic data "
    },
    {
        "content": "* Reached an agreement with Airbus to acquire 37 additional A321s as part of its efforts to renew its narrowbody fleet  Source text for Eikon:  Further company coverage:",
        "date": "04292016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines orders additional Airbus A321 jets "
    },
    {
        "content": "ATLANTA  April 29 Delta Air Lines Inc  plans to buy a 5 percent stake in biometric technology company CLEAR to deploy fingerprinting and iris identification services at major U.S. airports and speed up security lines  Delta's incoming Chief Executive Ed Bastian told reporters in Atlanta on Friday.",
        "date": "04292016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta to buy 5 pct of iris-scanning company CLEAR to speed up airport security "
    },
    {
        "content": "April 29 Stock futures pointed to a higher opening for Canada's main stock index on Friday as oil rose and ahead of the release of GDP and producer and raw material price data.",
        "date": "04292016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "CANADA STOCKS-Futures rise ahead of economic data "
    },
    {
        "content": "Delta Air Lines Inc  has not decided which planes to acquire to renew its fleet of single-aisle jets  Chief Financial Officer Paul Jacobson said on Thursday  as various manufacturers appeared to be vying for a deal.",
        "date": "04152016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta has not decided on single-aisle jet deal: CFO "
    },
    {
        "content": "TORONTO  April 15 Canada's main stock index fell on Friday as a pullback in oil prices weighed on energy shares  while Bombardier Inc surged on reports that it is close to a deal to sell up to 125 CSeries jets to a U.S. airline.",
        "date": "04152016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "CANADA STOCKS-TSX falls with energy retreat; Bombardier jump on deal talk "
    },
    {
        "content": "Delta Air Lines Inc  on Thursday said demand for U.S. travel is steady and domestic fares are starting to rise for the first time in a year  allaying investor concerns and giving a boost to airline stocks Thursday.",
        "date": "04142016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Strong demand for Delta flights bodes well for U.S. rivals "
    },
    {
        "content": "April 14 Delta Air Lines Inc on Thursday said demand for U.S. travel is steady and domestic fares are starting to rise for the first time in a year  allaying investor concerns and giving a boost to airline stocks Thursday.",
        "date": "04142016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-Strong demand for Delta flights bodes well for U.S. rivals "
    },
    {
        "content": "WASHINGTON/NEW YORK The U.S. Justice Department said on Wednesday that it dropped a lawsuit against United Continental Holdings Inc and Delta Air Lines Inc  after they abandoned a deal over landing slots in the New York area  which the department had warned threatened consumers.",
        "date": "04062016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "United drops plan to acquire Delta's Newark landing slots "
    },
    {
        "content": "WASHINGTON/NEW YORK  April 6 The U.S. Justice Department said on Wednesday that it dropped a lawsuit against United Continental Holdings Inc and Delta Air Lines Inc  after they abandoned a deal over landing slots in the New York area  which the department had warned threatened consumers.",
        "date": "04062016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-United drops plan to acquire Delta's Newark landing slots "
    },
    {
        "content": "WASHINGTON  April 6 United Continental Holdings Inc has dropped its plan to acquire 24 take-off and landing slots at Newark Liberty International Airport from Delta Air Lines Inc  the U.S. Justice Department said on Wednesday.",
        "date": "04062016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "United drops plan to acquire Delta's Newark landing slots -U.S. Justice "
    },
    {
        "content": "April 5 Alaska Air Group Inc's plan to buy Virgin America Inc makes the company a more attractive partner to Asian airlines looking for extra revenue from connecting passengers to flights within the United States  industry executives and experts say.",
        "date": "04062016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Airlines in Asia could get a lift from Alaska-Virgin merger "
    },
    {
        "content": "* Expects march quarter operating margin of 18% -19%  an approximate 10 point improvement over march 2015 quarter",
        "date": "04042016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines expects march quarter operating margin of 18 pct -19 pct "
    },
    {
        "content": "PARIS/MONTREAL  April 7 Delta Air Lines  is in talks with planemakers that could lead to the acquisition of dozens of small narrowbody jets  industry sources said.",
        "date": "04072016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta in talks to acquire dozens of small narrowbody jets - sources "
    },
    {
        "content": "PARIS/MONTREAL Delta Air Lines  is in talks with planemakers that could lead to the purchase of dozens of small narrowbody jets  industry sources said.",
        "date": "04072016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta in talks to buy dozens of small narrowbody jets: sources "
    },
    {
        "content": "PARIS/MONTREAL  April 7 Delta Air Lines  is in talks with planemakers that could lead to the purchase of dozens of small narrowbody jets  industry sources said.",
        "date": "04072016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta in talks to buy dozens of small narrowbody jets - sources "
    },
    {
        "content": "March 31 Delta Air Lines and its pilots' union have filed for federal mediation after failing to come to an agreement on a tentative contract  the Air Line Pilots Association International (ALPA) said on Thursday.",
        "date": "03312016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air Lines and pilots' union file for mediation "
    },
    {
        "content": "March 31 Delta Master Executive Council  represented by ALPA:",
        "date": "03312016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta pilots union files for mediation "
    },
    {
        "content": "Delta Air Lines Inc has agreed to settle a lawsuit that accused Republic Airways Holdings Inc of breaching a contract to operate flights for Delta  Republic said in a news release Thursday.",
        "date": "03252016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air Lines in agreement to settle lawsuit against Republic "
    },
    {
        "content": "* Delta's flight DL80 from Atlanta to Brussels landed safely at airport and all customers have deplaned  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "03222016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines issues statement on Brussels Airport "
    },
    {
        "content": "* Says Delta's flight DL80 from Atlanta to Brussels has landed safely at airport and is parked remotely",
        "date": "03222016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines issues statement on Brussels airport "
    },
    {
        "content": "* Delta to begin daily service between Los Angeles and Beijing",
        "date": "03142016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta to begin daily service between Los Angeles and Beijing "
    },
    {
        "content": "SAO PAULO  March 11 Shares of Brazil's airline Gol Linhas Aereas Inteligentes SA seesawed on Friday after the company denied a media report saying Delta Airlines  would inject capital in the embattled company through a share offering.",
        "date": "03112016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Shares of Brazil's Gol seesaw on talk of Delta capital injection "
    },
    {
        "content": "Feb 19 Delta Air Lines Inc received a civil investigative demand from the U.S. Justice Department last year about the mail it carries for the U.S. Postal Service  and it is fully cooperating with the request  a spokesman told Reuters on Friday.",
        "date": "02192016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta  like United  received Justice Dept inquiry about mail - spokesman "
    },
    {
        "content": "MINNEAPOLIS/NEW YORK A refinery owned by Delta Air Lines is renewing a push to change a U.S. Environmental Protection Agency policy laid down as part of a national program that requires increased use of biofuels like ethanol.",
        "date": "02062016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta-owned refinery challenges U.S. policy on bio-fuels program "
    },
    {
        "content": "MINNEAPOLIS/NEW YORK  Feb 5 A refinery owned by Delta Air Lines is renewing a push to change a U.S. Environmental Protection Agency policy laid down as part of a national program that requires increased use of biofuels like ethanol.",
        "date": "02052016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta-owned refinery challenges U.S. policy on bio-fuels program "
    },
    {
        "content": "The rapidly spreading Zika virus has not impacted bookings on Delta Air Lines Inc  to Latin America and the Caribbean  its president and CEO-designate said on Thursday  but added that customers' future plans were tough to predict.",
        "date": "02042016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta CEO-designate: Zika has not impacted flight bookings "
    },
    {
        "content": "Delta Air Lines Inc  on Wednesday said President Ed Bastian would replace Richard Anderson as chief executive in May  a long expected move that will see one of the most successful and outspoken leaders in the airline industry retire.",
        "date": "02042016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines CEO to retire; president named as successor "
    },
    {
        "content": "Feb 2 Delta Air Lines Inc delayed boarding for about two dozen flights on Tuesday as a result of a brief outage in its software that powers ground operations  a spokesman said.",
        "date": "02022016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta software outage delays boarding for two dozen flights "
    },
    {
        "content": "Feb 3 U.S. carrier Delta Air Lines Inc  said President Ed Bastian would replace Richard Anderson as chief executive.",
        "date": "02032016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air Lines CEO to retire  names insider as successor "
    },
    {
        "content": "Feb 3 Delta Air Lines Inc on Wednesday said President Ed Bastian would replace Richard Anderson as chief executive in May  a long expected move that will see one of the most successful and outspoken leaders in the airline industry retire.",
        "date": "02042016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-Delta Air Lines CEO to retire; president named as successor "
    },
    {
        "content": "Feb 2 Delta Air Lines Inc delayed boarding for about two dozen flights on Tuesday as a result of a brief outage in its software that powers ground operations  a spokesman said.",
        "date": "02022016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta software outage delays boarding for two dozen flights "
    },
    {
        "content": "American Airlines Group Inc  said on Wednesday it will add flights from Los Angeles to two hubs of its rival Delta Air Lines Inc   the latest move in a tug of war between the carriers for dominance in the No. 2 U.S. city.",
        "date": "01202016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "American to add flights from Los Angeles in battle with Delta "
    },
    {
        "content": "Delta Air Lines Inc  on Tuesday said a billion-dollar windfall from low fuel prices will far offset slumping sales to Europe after the November Paris attacks  forecasting its profit margin will more than double in the first quarter.",
        "date": "01192016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air Lines sees profit margins doubling from cheap fuel "
    },
    {
        "content": "Jan 20 American Airlines Group Inc said on Wednesday it will add flights from Los Angeles to two hubs of its rival Delta Air Lines Inc  the latest move in a tug of war between the carriers for dominance in the No. 2 U.S. city.",
        "date": "01202016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-American to add flights from Los Angeles in battle with Delta "
    },
    {
        "content": "Jan 19 Delta Air Lines Inc is considering whether to purchase Bombardier's CSeries aircraft  the carrier's chief executive said Tuesday  in what could be a headline-grabbing win for the planemaker's new flagship jet.",
        "date": "01192016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta CEO says mulling purchase of Bombardier CSeries jets "
    },
    {
        "content": "Jan 19 Delta Air Lines Inc on Tuesday said a billion-dollar windfall from low fuel prices will far offset slumping sales to Europe after the November Paris attacks  forecasting its profit margin will more than double in the first quarter.",
        "date": "01192016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 3-Delta Air Lines sees profit margins doubling from cheap fuel "
    },
    {
        "content": "Jan 8 Southwest Airlines Co must make room for rival Delta Air Lines Inc in its gates at Dallas Love Field Airport  a U.S. district court ordered on Friday.",
        "date": "01092016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta granted right to stay at Dallas Love Field - U.S. District Court "
    },
    {
        "content": "Jan 13 United Continental Holdings Inc  and Delta Air Lines Inc asked a federal judge to dismiss a U.S. Department of Justice lawsuit seeking to stop United from expanding its large presence at Newark Liberty International Airport in New Jersey.",
        "date": "01132016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "United  Delta seek dismissal of antitrust lawsuit over Newark slots "
    },
    {
        "content": "Delta Air Lines Inc  the third-largest U.S. carrier  on Tuesday said it expected unit revenues for the just-ended fourth quarter were slightly better than it forecast last month.",
        "date": "01052016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air Lines sees smaller unit revenue decline in fourth quarter "
    },
    {
        "content": "NEW YORK  Jan 5 The top U.S. airlines said Tuesday that they have raised fares in the first industry-wide hike since June  moves that may offset increasing labor costs but draw the ire of customers.",
        "date": "01052016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-U.S. airlines raise fares $3 in first sector-wide hike since June "
    },
    {
        "content": "Jan 5 Delta Air Lines Inc  the third-largest U.S. carrier  on Tuesday said it expected unit revenues for the just-ended fourth quarter were slightly better than it forecast last month.",
        "date": "01052016",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines sees smaller unit revenue decline in 4th qtr "
    },
    {
        "content": "The union representing Delta Air Lines Inc's pilots is seeking a wage hike of about 40 percent compounded over three years as the carrier's profits surge  Bloomberg reported  citing a memo from the Air Line Pilots Association.",
        "date": "01012016",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta's pilots union seeks big wage hike as profits surge: Bbg "
    },
    {
        "content": "Dec 31 The union representing Delta Air Lines Inc's pilots is seeking a wage hike of about 40 percent compounded over three years as the carrier's profits surge  Bloomberg reported  citing a memo from the Air Line Pilots Association.",
        "date": "12312015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta's pilots union seeks big wage hike as profits surge - Bbg "
    },
    {
        "content": "Delta Air Lines Inc said it expected its passenger revenue per available seat mile (PRASM) to decline about 2 percent in the current quarter  less than it had expected.",
        "date": "12172015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta says fourth-quarter passenger unit revenue to fall less than expected "
    },
    {
        "content": "* Sees $3 bln savings in 2016 from low fuel costs   (Adds details from the call  updates share)",
        "date": "12172015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 3-Delta says Q4 passenger unit revenue to fall less than expected "
    },
    {
        "content": "Dec 17 Delta Air Lines Inc said it expected a smaller fall in its passenger revenue per available seat mile (PRASM) for the December quarter.",
        "date": "12172015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air sees smaller fall in quarterly PRASM "
    },
    {
        "content": "* Delta Air Lines and KLM announce codeshare partnership with Jet Airways  via Amsterdam Airport Schiphol",
        "date": "12142015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta and KLM announce codeshare partnership with Jet Airways "
    },
    {
        "content": "Delta Air Lines Inc  on Wednesday said it earned more per mile in November than a year ago  as earlier cuts to its flight capacity abroad helped offset flat trans-Atlantic traffic in a month disrupted by the Paris attacks.",
        "date": "12022015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air Lines unit revenue up in November despite Paris attacks "
    },
    {
        "content": "Dec 2 Delta Air Lines Inc on Wednesday said it earned more per mile in November than a year ago  as earlier cuts to its flight capacity abroad helped offset flat trans-Atlantic traffic in a month disrupted by the Paris attacks.",
        "date": "12022015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-Delta Air Lines unit revenue up in November despite Paris attacks "
    },
    {
        "content": "MEXICO CITY  Dec 1 Aeromexico's board of directors on Tuesday said it would study an offer from Delta Airlines to increase its stake in Mexico's largest airline.",
        "date": "12012015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Aeromexico says evaluating Delta Airlines offer "
    },
    {
        "content": "Delta Air Lines Inc  said Wednesday it intends to buy up to an additional 32 percent of Grupo Aeromexico SAB de CV   in what could be a nearly $600 million cash deal that strengthens its grip on a fast-growing market.",
        "date": "11182015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air Lines  trust offer to raise Aeromexico stake to up to 49 percent "
    },
    {
        "content": "Nov 18 Delta Air Lines Inc said Wednesday it intends to buy up to an additional 32 percent of Grupo Aeromexico SAB de CV  in what could be a nearly $600 million cash deal that strengthens its grip on a fast-growing market.",
        "date": "11182015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta Air Lines  trust offer to raise Aeromexico stake to up to 49 pct "
    },
    {
        "content": "Nov 18 Delta Air Lines Inc said on Wednesday it has offered to buy up to an additional 32 percent of Grupo Aeromexico SAB de CV  raising its stake in the Mexican airline to up to 49 percent including share purchase options held by the U.S. carrier and its pension trust.",
        "date": "11182015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air  trust offer to raise Aeromexico stake to up to 49 pct "
    },
    {
        "content": "NEW YORK  Nov 13 American Airlines Group   the world's biggest carrier by passenger traffic  said on Friday it was delaying flights to Paris in response to the explosions and shooting attacks there  even though French airports remained open.",
        "date": "11142015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "UPDATE 2-American Airlines delays Paris flights; United operates as planned "
    },
    {
        "content": "WASHINGTON/CHICAGO The U.S. Justice Department on Tuesday sued to stop United Continental Holdings Inc  from taking over 24 take-off and landing slots at Newark Liberty International Airport  an action that could thwart United's expansion at its New Jersey hub.",
        "date": "11102015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "U.S. sues to block United Airlines from Newark expansion "
    },
    {
        "content": "WASHINGTON/CHICAGO  Nov 10 The U.S. Justice Department on Tuesday sued to stop United Continental Holdings Inc from taking over 24 take-off and landing slots at Newark Liberty International Airport  an action that could thwart United's expansion at its New Jersey hub.",
        "date": "11102015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 4-U.S. sues to block United Airlines from Newark expansion "
    },
    {
        "content": "WASHINGTON  Nov 10 The U.S. Justice Department has sued to stop United Airlines from acquiring 24 takeoff and landing slots at Newark Liberty International Airport from Delta Airlines  it said on Tuesday.",
        "date": "11102015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "U.S. government seeks to block United Airlines from acquiring Newark slots "
    },
    {
        "content": "Nov 3 Delta Air Lines Inc on Tuesday said passenger unit revenue fell slightly in October  its smallest decline in months  as the company shrank flight capacity to match lower demand.",
        "date": "11032015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines says capacity cuts muted October unit revenue drop "
    },
    {
        "content": "Oct 30 A Delta airliner returned safely to Portland International Airport with possible engine trouble on Friday  a Delta Air Lines statement said.",
        "date": "10302015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "UPDATE 3-Delta jet with engine trouble lands safely in Portland  Oregon "
    },
    {
        "content": "* Delta Air Lines Inc to cancel all Atlanta-Dubai flights starting Feb. 11  2016 - spokeswoman",
        "date": "10282015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air Lines to end Atlanta-Dubai flights in 2016 "
    },
    {
        "content": "NEW YORK Delta Air Lines Inc  on Wednesday said it will put the brakes on its expansion of flight capacity in 2016  in a move to fill up more planes and sell more seats at higher fares.",
        "date": "10152015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta to fill more flights by putting brakes on expansion in 2016 "
    },
    {
        "content": "Shares in the world's two leading planemakers fell after Delta Air Lines Inc  warned of a surplus of second-hand widebody planes  raising concerns about their ability to command good prices for new aircraft.",
        "date": "10152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Planemaker shares fall after Delta warns of surplus "
    },
    {
        "content": "Oct 15 Shares in the world's two leading planemakers fell after Delta Air Lines Inc warned of a surplus of second-hand widebody planes  raising concerns about their ability to command good prices for new aircraft.",
        "date": "10152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-Planemaker shares fall after Delta warns of surplus "
    },
    {
        "content": "NEW YORK Low interest rates and a U.S. stock market that is still down 2 percent for the year have taken their toll on corporate America's pension plans.",
        "date": "10152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Market losses  low yields sideswipe U.S. corporate pensions "
    },
    {
        "content": "NEW YORK Delta Air Lines Inc  on Wednesday said it will put the brakes on its expansion of flight capacity in 2016  in a move to fill up more planes and sell more seats at higher fares.",
        "date": "10142015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta to fill more flights by putting brakes on expansion in 2016 "
    },
    {
        "content": "Delta Air Lines Inc  on Wednesday forecast a buyer's market for used widebody planes  raising concern about Boeing Co's  ability to command prices for new aircraft when airlines can buy old ones on the cheap.",
        "date": "10142015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta sees buyer's market for used twinjets; Boeing stock drops "
    },
    {
        "content": "Oct 14 Delta Air Lines Inc on Wednesday forecast a buyer's market for used widebody planes  raising concern about Boeing Co's ability to command prices for new aircraft when airlines can buy old ones on the cheap.",
        "date": "10142015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta sees buyer's market for used twinjets; Boeing stock drops "
    },
    {
        "content": "Oct 14 Delta Air Lines Inc expects the United States and Brazil to reach an aviation deal that removes restrictions on flights between the countries in the next year  the airline's president told investors on a call Wednesday.",
        "date": "10142015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Airline partners Delta  Gol expect to apply for immunity from antitrust law soon "
    },
    {
        "content": "NEW YORK  Oct 14 Delta Air Lines Inc on Wednesday said it will put the brakes on its expansion of flight capacity in 2016  in a move to fill up more planes and sell more seats at higher fares.",
        "date": "10142015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "REFILE-UPDATE 2-Delta to fill more flights by putting brakes on expansion in 2016 "
    },
    {
        "content": "Oct 14 Delta Air Lines Inc expects the market for it to buy used widebody planes will be \"ripe\" over the next 12 to 36 months  as low interest rates have created a market bubble  Chief Executive Richard Anderson told media on a call Wednesday.",
        "date": "10142015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air sees \"ripe\" market for it to buy used widebody planes -CEO "
    },
    {
        "content": "Oct 14 Delta Air Lines Inc on Wednesday reported third-quarter profit that topped analysts' expectations  and IT forecast that unit revenue would decline in the fourth quarter year-over-year  although less than it has dropped in the prior two quarters.",
        "date": "10142015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air beats 3rd-qtr profit estimate  expects unit rev drop "
    },
    {
        "content": "Delta Air Lines Inc on Friday said its third-quarter unit revenue continued to fall during the year's busiest travel season but hinted that financial metrics were already improving.",
        "date": "10022015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta says third-quarter unit revenue down 4.5-5.5 percent "
    },
    {
        "content": "Oct 2 Delta Air Lines Inc on Friday said its third-quarter unit revenue continued to fall during the year's busiest travel season but hinted that financial metrics were already improving.",
        "date": "10022015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta says third-quarter unit revenue down 4.5-5.5 pct "
    },
    {
        "content": "Sept 17 U.S. airline leaders will meet with Secretary of State John Kerry on Thursday to argue for American action on subsidies that they allege three Gulf carriers have received  according to a State Department official.",
        "date": "09172015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-U.S. airline CEOs to meet with Kerry on Gulf carriers "
    },
    {
        "content": "NEW YORK Delta Air Lines Inc is running its Philadelphia area oil refinery at a near-record 110 percent of capacity  according to a person familiar with operations  a sign of the surprisingly strong summer profits U.S. refineries are generating.",
        "date": "09032015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta's Philadelphia refinery running at 110 percent  margins swell "
    },
    {
        "content": "NEW YORK  Sept 3 Delta Air Lines Inc is running its Philadelphia area oil refinery at a near-record 110 percent of capacity  according to a person familiar with operations  a sign of the surprisingly strong summer profits U.S. refineries are generating.",
        "date": "09032015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta's Philadelphia refinery running at 110 pct  margins swell "
    },
    {
        "content": "* CEO  speaking in Shanghai  says decision to invest in China Eastern Airlines Corp Ltd \"quick and easy\" despite recent stock market volatility    (Reporting by Christopher Cushing)",
        "date": "09012015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air CEO: Decision to invest in China Eastern \"quick  easy\" "
    },
    {
        "content": "SHANGHAI  Sept 1 China Eastern Airlines Corp's  Chairman Liu Shaoyong said on Tuesday that the carrier's equity deal with Delta Air Lines will give the U.S. airline an opportunity to extend code-sharing in China's domestic network.",
        "date": "09012015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "China Eastern chmn says equity tie gives Delta new code-share opening in China network "
    },
    {
        "content": "DUBAI  Aug 11 Emirates Airline said on Tuesday that Gulf airlines were not to blame for overcapacity on services between the United States and Dubai  rejecting comments at the weekend by U.S. carrier Delta Air Lines.",
        "date": "08112015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Emirates Airline rejects Delta's criticism of overcapacity on Dubai-US routes "
    },
    {
        "content": "DUBAI Emirates Airline [EMIRA.UL] said Tuesday that state-owned Gulf Arab airlines were not to blame for overcapacity on services between the United States and Dubai  rejecting criticism by U.S. carrier Delta Air Lines .",
        "date": "08122015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Emirates Airline rejects Delta's criticism of overcapacity on Dubai-U.S. routes "
    },
    {
        "content": "Aug 9 Delta Air Lines Inc has scrapped a number of its flights to Dubai this winter in an apparent nod to how competition with three Gulf carriers is hurting its business.",
        "date": "08092015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air Lines shrinks Dubai service  points to Gulf carrier growth "
    },
    {
        "content": "DUBAI  Aug 11 Emirates Airline said Tuesday that state-owned Gulf Arab airlines were not to blame for overcapacity on services between the United States and Dubai  rejecting criticism by U.S. carrier Delta Air Lines .",
        "date": "08122015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Emirates Airline rejects Delta's criticism of overcapacity on Dubai-US routes "
    },
    {
        "content": "Delta Air Lines banned shipments of lion  leopard  elephant  rhinoceros and buffalo trophies on its aircraft on Monday amid international outrage over the killing of Zimbabwe's most famous lion by a American hunter.",
        "date": "08032015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta bans shipments of trophies of lions  other big game "
    },
    {
        "content": "Aug 4 Delta Air Lines Inc said on Tuesday that passenger unit revenue fell in July compared to a year earlier as the strong U.S. dollar  lower surcharges abroad and excess seats on flights from some U.S. cities weighed down sales relative to capacity.",
        "date": "08042015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines saw unit revenue drop in July "
    },
    {
        "content": "TOKYO ANA Holdings Inc  has won creditor backing to lead a turnaround of bankrupt Japanese discount carrier Skymark Airlines Inc [SKALF.PK]  defeating a plan that proposed Delta Air Lines Inc  as its sponsor.",
        "date": "08052015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Skymark creditors pick ANA to lead turnaround plan  reject Delta proposal "
    },
    {
        "content": "Aug 5 The following bids  mergers  acquisitions and disposals were reported by 0930 GMT on Wednesday:",
        "date": "08052015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* ANA  with its track record in Japan  seen best option -creditor   (Adds comments from ANA executive  creditor  context)",
        "date": "08052015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 3-Skymark creditors pick ANA to lead turnaround plan  reject Delta proposal "
    },
    {
        "content": "LONDON  Aug 5    European stocks were seen edging slightly higher on Wednesday  with financial spreadbetters expecting Britain's FTSE 100  to open 6-8 points or 0.1 percent higher  Germany's DAX to open 13-14 points or 0.1 percent higher  and France's CAC 40 to open 2-3 points or as much as 0.1 percent up.          SOCIETE GENERALE      The French bank targeted a slightly bigger cushion of capital and higher cost savings as it reported better-than-expected earnings.             AIRBU",
        "date": "08052015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "European Factors to Watch- Shares to edge slightly higher "
    },
    {
        "content": "TOKYO ANA Holdings Inc won the backing of creditors to lead a turnaround of bankrupt Japanese discount carrier Skymark Airlines Inc  defeating a rival plan that proposed Delta Air Lines as its sponsor  a participant at the creditor meeting said.",
        "date": "08052015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Skymark creditors choose ANA to sponsor turnaround: participant "
    },
    {
        "content": "TOKYO  Aug 5 ANA Holdings Inc won the backing of creditors to lead a turnaround of bankrupt Japanese discount carrier Skymark Airlines Inc  defeating a rival plan that proposed Delta Air Lines as its sponsor  a participant at the creditor meeting said.",
        "date": "08052015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Skymark creditors choose ANA to sponsor turnaround -participant "
    },
    {
        "content": "BEIJING Delta Air Lines Inc  has agreed to buy 3.55 percent of China Eastern Airlines Corp Ltd   a move that would make it the first U.S. carrier to own part of a Chinese airline.",
        "date": "07272015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta to buy 3.55 percent stake of China Eastern for $450 million "
    },
    {
        "content": "BEIJING/SHANGHAI  July 28 China Eastern Airlines  plans to work with new investor Delta Air Lines  to expand its global footprint beyond China-U.S. routes  an executive from the Shanghai-based carrier said.",
        "date": "07282015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "China Eastern says looks beyond U.S.-China routes with Delta stake deal "
    },
    {
        "content": "BEIJING  July 27 Delta Air Lines Inc has agreed to buy 3.55 percent of China Eastern Airlines Corp Ltd    a move that would make it the first U.S. carrier to own part of a Chinese airline.",
        "date": "07272015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-Delta to buy 3.55 pct stake of China Eastern for $450 mln "
    },
    {
        "content": "BEIJING  July 27 Delta Air Lines has agreed to buy an estimated 3.55-percent stake in China Eastern Airlines  for $450 million  the Chinese operator said in stock filing on Monday.",
        "date": "07272015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "RPT-Delta to buy 3.55 pct stake of China Eastern for $450 mln "
    },
    {
        "content": "BEIJING  July 28 Air China Ltd said on Tuesday it aims to raise up to 12 billion yuan ($1.93 billion) in a private placement of A-shares to help fund the purchase of 15 Boeing planes and upgrade its direct sales service.",
        "date": "07282015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Air China to raise up to 12 bln yuan to fund plane order "
    },
    {
        "content": "BEIJING  July 27 Delta Air Lines has agreed to buy an estimated 3.55-percent stake in China Eastern Airlines  for $450 million  the Chinese operator said in stock filing on Monday.",
        "date": "07272015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta to buy 3.55 pct stake of China Eastern for $450 mln "
    },
    {
        "content": "WASHINGTON/NEW YORK The U.S. Transportation Department is investigating possible price gouging by the five biggest U.S. airlines while train service was disabled between New York and Washington following a deadly Amtrak crash in May  it said on Friday.",
        "date": "07242015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "U.S. probing possible price-gouging by airlines after rail crash "
    },
    {
        "content": "* Says Delta Air Lines agrees to acquire 465.91 million new H-shares for HK$3.49 billion ($450.30 million)",
        "date": "07272015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "BRIEF-Delta Air agrees to acquire China Eastern's new H-shares "
    },
    {
        "content": "HONG KONG  July 28 Hong Kong blue chip stocks rose on Tuesday  bucking falls for mainland shares  on hopes for a stabilising China market as Beijing hinted at further monetary easing.",
        "date": "07282015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Hong Kong blue chips rise on hopes for China monetary easing "
    },
    {
        "content": "* China Eastern Airlines falls after Delta agrees to buy stake",
        "date": "07282015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "China stocks fall as Beijing renews support  Hong Kong up "
    },
    {
        "content": "SAO PAULO  July 23 Brazil's antitrust watchdog Cade approved with no restrictions a $446 million agreement between U.S. carrier Delta Air Lines Inc and Brazil's Gol Linhas Aereas Inteligentes SA to expand their alliance.",
        "date": "07232015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Brazil regulator approves Delta Air Lines  Gol deal "
    },
    {
        "content": "The leader of the Delta Air Lines Inc pilots' union  Mike Donatelli  said on Wednesday he will resign on Sept. 15  less than two weeks after pilots rejected a tentative contract deal that he had backed.",
        "date": "07222015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta pilots' union chief to resign after contract deal rejected "
    },
    {
        "content": "July 22 Command Security Corp employees who work at New York's John F. Kennedy International Airport and LaGuardia Airport have suspended plans to strike on Wednesday  the 32BJ SEIU service workers union said.",
        "date": "07222015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "LaGuardia  JFK workers suspend plans to strike Wednesday - union "
    },
    {
        "content": "July 22 Command Security Corp employees who work at New York's John F. Kennedy International Airport and LaGuardia Airport have called off plans to strike on Wednesday  the 32BJ SEIU service workers union said.",
        "date": "07222015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-LaGuardia  JFK workers suspend plans to strike Wednesday - union "
    },
    {
        "content": "Command Security Corp  employees who work at New York's John F. Kennedy International Airport and LaGuardia Airport have suspended plans to strike on Wednesday  the 32BJ SEIU service workers union said.",
        "date": "07222015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "LaGuardia  JFK workers suspend plans to strike Wednesday: union "
    },
    {
        "content": "Delta Air Lines Inc on Wednesday reported that second-quarter profit jumped 85 percent  topping expectations  but forecast a third-quarter drop in unit revenue as the carrier continued to see weaker demand abroad due to the strong U.S. dollar.",
        "date": "07152015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air beats second-quarter profit estimates  expects unit revenue drop "
    },
    {
        "content": "SEATTLE  July 16 A Delta Air Lines Inc  plane flying from Alaska to Atlanta made an emergency landing at Seattle's main airport early Thursday after what an airport spokesman said was an engine fire.",
        "date": "07162015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta plane makes emergency landing in Seattle "
    },
    {
        "content": "Delta Air Lines Inc's  chief executive stressed multiple times on Wednesday that his company decides on its own how many flights it operates and how many seats it puts up for sale in the face of a regulatory probe into possible airline collusion.",
        "date": "07152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines determines capacity 'unilaterally': CEO "
    },
    {
        "content": "July 15 Delta Air Lines Inc's chief executive stressed multiple times on Wednesday that his company decides on its own how many flights it operates and how many seats it puts up for sale in the face of a regulatory probe into possible airline collusion.",
        "date": "07152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta Air Lines determines capacity 'unilaterally' - CEO "
    },
    {
        "content": "* Indexes up: Dow 0.17 pct  S&P 0.2 pct  Nasdaq 0.36 pct   (Adds details  changes comment  updates prices)",
        "date": "07152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "US STOCKS-Wall St up as Fed says on track to raise rates in 2015 "
    },
    {
        "content": "July 15 Delta Air Lines Inc decides how many flights it operates and how many seats it sells \"unilaterally \" Chief Executive Richard Anderson said Wednesday on an investor call  in a nod to a regulatory investigation into alleged airline collusion.",
        "date": "07152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines determines capacity 'unilaterally' - CEO "
    },
    {
        "content": "* Dow down 0.06 pct  S&P down 0.01 pct  Nasdaq up 0.28 pct   (Updates to open)",
        "date": "07152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "US STOCKS-Wall St little changed; Celgene leads healthcare rally "
    },
    {
        "content": "July 15 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Wednesday:",
        "date": "07152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "July 15 Delta Air Lines Inc on Wednesday reported that second-quarter profit jumped 85 percent  topping expectations  but forecast a third-quarter drop in unit revenue as the carrier continued to see weaker demand abroad due to the strong U.S. dollar.",
        "date": "07152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-Delta Air beats 2nd-qtr profit estimates  expects unit rev drop "
    },
    {
        "content": "* Futures up: Dow 2 pts  S&P 0.5 pts  Nasdaq 8 pts   (Adds details  comment  updates prices)",
        "date": "07152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "US STOCKS-Futures flat as Fed stays on course for 2015 rate hike "
    },
    {
        "content": "TOKYO Delta Air Lines has been proposed as a sponsor to rehabilitate Skymark Airlines Inc [SKALF.PK] by the bankrupt Japanese carrier's biggest creditor - a plan that challenges a separate proposal that has put forward ANA Holdings as a sponsor.",
        "date": "07152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta proposed as a sponsor for Japan's Skymark Airlines "
    },
    {
        "content": "MIAMI Delta Air Lines Inc  is hoping to strengthen partnerships with carriers in South Korea  Mexico and Brazil  and it has been approached about investing in Japan's bankrupt Skymark Airlines  Delta's president Ed Bastian told reporters Monday.",
        "date": "07092015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air Lines looks to strengthen global partnerships "
    },
    {
        "content": "MIAMI  June 8 Delta Air Lines Inc is hoping to strengthen partnerships with carriers in South Korea  Mexico and Brazil  and it has been approached about investing in Japan's bankrupt Skymark Airlines  Delta's president Ed Bastian told reporters Monday.",
        "date": "07092015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "CORRECTED-UPDATE 1-Delta Air Lines looks to strengthen global partnerships "
    },
    {
        "content": "Delta Air Lines Inc  has offered to invest in Japan's bankrupt Skymark Airlines Inc  as part of a restructuring plan for the budget carrier  according to a Japanese media report.",
        "date": "07132015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta offers to invest in Japan's bankrupt Skymark Airlines: media "
    },
    {
        "content": "July 13 Delta Air Lines Inc has offered to invest in Japan's bankrupt Skymark Airlines Inc as part of a restructuring plan for the budget carrier  according to a Japanese media report.",
        "date": "07132015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta offers to invest in Japan's bankrupt Skymark Airlines- media "
    },
    {
        "content": "SAO PAULO  July 10 U.S. carrier Delta Air Lines Inc will expand its alliance with Brazil's Gol Linhas Aereas Intelligentes SA  under a $446 million stock and loan agreement  Gol said on Friday in a statement.",
        "date": "07112015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "UPDATE 3-Delta  Gol boost air accord in $446 mln stock  debt deal "
    },
    {
        "content": "SAO PAULO U.S. carrier Delta Air Lines Inc  will expand its alliance with Brazil's Gol Linhas Aereas Intelligentes SA   under a $446 million stock and loan agreement  Gol said on Friday in a statement.",
        "date": "07102015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta  Gol boost air accord in $446 million stock  debt deal "
    },
    {
        "content": "SAO PAULO  July 10 U.S. carrier Delta Air Lines Inc will expand its alliance with Brazil's Gol Linhas Aereas Intelligentes SA  under a $446 million stock and loan agreement  Gol said on Friday in a statement.",
        "date": "07102015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-Delta  Gol boost air accord in $446 mln stock  debt deal "
    },
    {
        "content": "Delta Air Lines Inc  pilots have rejected a tentative contract agreement  casting in doubt both the labor deal and the airline's plans to order extra planes from the Boeing Co .",
        "date": "07102015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines pilots reject tentative contract: union "
    },
    {
        "content": "July 10 Delta Air Lines Inc pilots have rejected a tentative contract agreement  casting in doubt both the labor deal and the airline's plans to order extra planes from the Boeing Co.",
        "date": "07102015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 3-Delta Air Lines pilots reject tentative contract - union "
    },
    {
        "content": "SAO PAULO  July 10 U.S. carrier Delta Air Lines Inc will expand its alliance with Brazil's Gol Linhas Aereas Intelligentes SA  under a $446 million stock and loan agreement  Gol said on Friday in a statement.",
        "date": "07102015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta in $446 mln stock  loan deal to increase stake in Brazil's Gol "
    },
    {
        "content": "July 10 Delta Air Lines Inc's pilots have voted against a tentative agreement approved by their union and the airline's management  leaving the company without a new contract  the pilots union said Friday.",
        "date": "07102015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines pilots reject tentative contract - union "
    },
    {
        "content": "Southwest Airlines Co  has agreed to make room for rival Delta Air Lines Inc  in its gates at Dallas Love Field Airport while the carriers await a long-term resolution of their dispute in court  the airlines said Wednesday.",
        "date": "06242015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Southwest grants Delta temporary right to keep Dallas flights "
    },
    {
        "content": "June 24 Southwest Airlines Co has agreed to make room for rival Delta Air Lines Inc in its gates at Dallas Love Field Airport while the carriers await a long-term resolution of their dispute in court  the airlines said Wednesday.",
        "date": "06242015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-Southwest grants Delta temporary right to keep Dallas flights "
    },
    {
        "content": "Shares for the top four airline carriers in the United States could rise 15 percent to 50 percent due to less competition and falling fuel costs  according to the June 22 edition of Barron's.",
        "date": "06212015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Stocks of top U.S. airlines ready to soar: Barron's "
    },
    {
        "content": "WASHINGTON  June 15 The U.S. Transportation Department said on Monday it had finalized a decision to let Delta Air Lines keep a route between Seattle and Tokyo's Haneda airport.",
        "date": "06152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "U.S. lets Delta Air Lines keep Seattle-Haneda route "
    },
    {
        "content": "Delta Air Lines Inc has reached a tentative deal with its union to pay pilots more than competitors  while making its profit-sharing plan less generous in some cases.",
        "date": "06112015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta deal raises pilot wages above competitors  trims profit-sharing "
    },
    {
        "content": "June 11 Leaders of Delta Air Lines Inc's  pilot union approved a tentative labor deal that provides for base pay increases and a revision in the airline's profit sharing formula.",
        "date": "06112015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta pilot union leaders approve tentative labor deal "
    },
    {
        "content": "MIAMI Delta Air Lines Inc  is hoping to strengthen partnerships with carriers in South Korea  Mexico and Brazil  and it has been approached about investing in Japan's bankrupt Skymark Airlines  Delta's president Ed Bastian told reporters Monday.",
        "date": "06082015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air Lines looks to strengthen global partnerships "
    },
    {
        "content": "MIAMI  June 8 Delta Air Lines Inc is hoping to strengthen partnerships with carriers in South Korea  Mexico and Brazil  and it has been approached about investing in Japan's bankrupt Skymark Airlines  Delta's president Ed Bastian told reporters Monday.",
        "date": "06082015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta Air Lines looks to strengthen global partnerships "
    },
    {
        "content": "June 8 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "06082015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "MIAMI  June 8 Airlines have $3.7 billion of cash from ticket sales trapped in Venezuela because of currency controls in the South American country  the International Air Transport Association said on Monday.",
        "date": "06082015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Airlines have $3.7 bln ticket sales cash trapped in Venezuela -IATA "
    },
    {
        "content": "June 4 Delta Air Lines Inc on Thursday said its operating profit margin this quarter could be lower than it expected as the U.S. airline industry wrestles with slightly weaker U.S. demand and with oil prices inching up.",
        "date": "06042015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta cuts 2nd-qtr margin guidance as U.S. airlines face weaker demand "
    },
    {
        "content": "Delta Air Lines Inc  on Tuesday lowered its forecast for unit revenue this quarter as U.S. domestic business tickets booked near customer travel dates yielded less per mile than the carrier expected.",
        "date": "06022015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta lowers unit revenue forecast on last-minute U.S. business travel "
    },
    {
        "content": "TOULOUSE  France Delta Air Lines  is interested in forging alliances with carriers in Asia  the airline's president said on Thursday.",
        "date": "05282015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta eyes Asia alliances  sees limited U.S. consolidation "
    },
    {
        "content": "May 26 Delta Air Lines Inc on Tuesday announced new flights from Seattle to five destinations in its latest move to strip market share from Alaska Air Group Inc   which is based in that city.",
        "date": "05262015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines ramps up Seattle competition with new routes "
    },
    {
        "content": "TOULOUSE  France  May 28 Delta Air Lines  is interested in forging alliances with carriers in Asia  the airline's president said on Thursday.",
        "date": "05282015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "REFILE-UPDATE 1-Delta eyes Asia alliances  sees limited U.S. consolidation "
    },
    {
        "content": "May 15 Delta Air Lines Inc said on Friday that Amtrak customers whose tickets were canceled because of Tuesday's train crash in Philadelphia can fly between New York and Boston or Washington for free on Delta's shuttle service for the next four days.",
        "date": "05152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines offers free flights for stranded Amtrak passengers "
    },
    {
        "content": "May 14 Delta Air Lines Inc's refinery Monroe Energy has stopped importing crude oil from West Africa  the airline's Chief Financial Officer Paul Jacobson said Thursday during a transportation conference that was webcast.",
        "date": "05142015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air Lines' refinery has stopped importing West African oil - CFO "
    },
    {
        "content": "Delta Air Lines Inc  expects to see some \"choppiness\" in its monthly revenue per available seat mile  which measures sales relative to planes' carrying capacity  Chief Financial Officer Paul Jacobson said Thursday during a transportation conference that was webcast.",
        "date": "05142015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines expects choppy unit revenue this quarter: CFO "
    },
    {
        "content": "BRUSSELS  May 12 Air France-KLM  Delta Air Lines and Alitalia secured EU antitrust approval on Tuesday for their profit-sharing pact after offering to help rivals enter the market for certain routes.",
        "date": "05122015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "EU regulators clear Air France-KLM  Delta  Alitalia tie-up "
    },
    {
        "content": "* To raise dividend to 13.5 cents/shr from 9 cents from 3rd qtr   (Adds financial targets  analyst comments  industry background)",
        "date": "05132015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "UPDATE 3-Delta Air Lines approves $5 bln buyback plan  to hike dividend "
    },
    {
        "content": "May 14 Delta Air Lines Inc expects to see some \"choppiness\" in its monthly revenue per available seat mile  which measures sales relative to planes' carrying capacity  Chief Financial Officer Paul Jacobson said Thursday during a transportation conference that was webcast.",
        "date": "05142015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines expects choppy unit revenue this quarter - CFO "
    },
    {
        "content": "Thomson Reuters May 13  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.             ** For",
        "date": "05132015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "* Futures: Dow down 6 pts  S&P up 2.50 pts  Nasdaq up 11 pts   (Adds details  comment  updates prices)",
        "date": "05132015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "US STOCKS-Wall St set to open mixed on tepid data "
    },
    {
        "content": "May 13 Delta Air Lines Inc said its board approved a new $5 billion share buyback program and raised its quarterly dividend to 13.5 cents per share from 9 cents.",
        "date": "05132015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines approves $5 bln share buyback program "
    },
    {
        "content": "Delta Air Lines Inc  reported a drop in passenger unit revenue for April as lower surcharges abroad and the falling value of foreign currency in U.S. dollar terms offset stable domestic unit revenues.",
        "date": "05042015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air Lines reports April passenger unit revenue drop "
    },
    {
        "content": "April 15 U.S. stocks closed higher on Wednesday  fueled by gains in oil companies and speculation that upcoming first-quarter earnings reports might not be quite as weak as previously thought.",
        "date": "04152015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "US STOCKS-Wall St ends higher as jitters about earnings and oil recede "
    },
    {
        "content": "April 15 U.S. stocks rose on Wednesday  fueled by gains in the energy sector and speculation that upcoming first-quarter earnings reports might not be quite as bad as previously thought.",
        "date": "04152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "US STOCKS-Wall St rallies as earnings jitters recede and oil rebounds "
    },
    {
        "content": "April 15 U.S. stocks rose on Wednesday  fueled by gains in the energy sector and speculation that upcoming first-quarter earnings reports might not be quite as bad as previously thought.",
        "date": "04152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "REFILE-US STOCKS-Wall St rises as earnings jitters recede and oil rebounds "
    },
    {
        "content": "Delta Air Lines Inc  on Wednesday reported first-quarter profit that topped analysts' expectations and pleased investors with plans to reduce international capacity in the fourth quarter where a strong U.S. dollar has weakened demand.",
        "date": "04152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines first-quarter profit beats expectations "
    },
    {
        "content": "* Q4 international capacity forecast down 3 percent   (Widens to include expectations on industry peers)",
        "date": "04152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-Delta Air Lines first-quarter profit beats expectations "
    },
    {
        "content": "Potential changes to U.S. Open Skies pacts with Qatar and the United Arab Emirates could involve new rules on price-lowering and capacity-dumping  Delta Air Lines Inc  Chief Executive Officer Richard Anderson said on Wednesday.",
        "date": "04152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Changes to Gulf Open Skies pacts could involve price  capacity dumping rules: Delta CEO "
    },
    {
        "content": "* Indexes up: Dow 0.3 pct  S&P 0.4 pct  Nasdaq 0.4 pct   (Updates to midday)",
        "date": "04152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "US STOCKS-Wall St up as earnings worries recede  oil jumps "
    },
    {
        "content": "April 15 Potential changes to U.S. Open Skies pacts with Qatar and the United Arab Emirates could involve new rules on price-lowering and capacity-dumping  Delta Air Lines Inc Chief Executive Officer Richard Anderson said on Wednesday.",
        "date": "04152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Changes to Gulf Open Skies pacts could involve price  capacity dumping rules -Delta CEO "
    },
    {
        "content": "April 15 Potential changes to U.S. Open Skies pacts with Qatar and the United Arab Emirates could involve new rules on price-lowering and capacity-dumping  Delta Air Lines Inc Chief Executive Officer Richard Anderson said on Wednesday.",
        "date": "04152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Changes to Gulf Open Skies pacts could involve price  capacity dumping rules -Delta CEO "
    },
    {
        "content": "April 15 U.S. stocks rose higher on Wednesday as earnings from major companies beat lowered expectations and investors' worries about a poor quarterly season receded.",
        "date": "04152015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "REFILE-US STOCKS-Wall St edges higher as earnings worries recede "
    },
    {
        "content": "NEW YORK The International Association of Machinists and Aerospace Workers said on Monday it had temporarily withdrawn its application to organize flight attendants at Delta Air Lines.",
        "date": "04062015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Machinists withdraw bid to unionize Delta flight attendants "
    },
    {
        "content": "NEW YORK  April 6 The International Association of Machinists and Aerospace Workers said on Monday it had temporarily withdrawn its application to organize flight attendants at Delta Air Lines.",
        "date": "04062015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Machinists withdraw bid to unionize Delta flight attendants "
    },
    {
        "content": "Delta Air Lines Inc  said Thursday that first-quarter unit revenue dropped as a stronger dollar hurt international demand and domestic bookings fell short of its expectations.",
        "date": "04022015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air Lines unit revenue fell 1.5 percent in first quarter "
    },
    {
        "content": "April 2 Delta Air Lines Inc said Thursday that first-quarter unit revenue dropped as a stronger dollar hurt international demand and domestic bookings fell short of its expectations.",
        "date": "04022015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-Delta Air Lines unit revenue fell 1.5 pct in 1st qtr "
    },
    {
        "content": "SAN FRANCISCO  April 1 Delta Air Lines Inc  has become the first U.S. airline to accept payments via Alipay  the PayPal-like service run by an Alibaba Group Holding Ltd affiliate that is used by hundreds of millions of Chinese consumers.",
        "date": "04012015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta Air to take payments via Alipay from Chinese travelers "
    },
    {
        "content": "A U.S. regulator tentatively said Friday that Delta Air Lines Inc can keep a slot at Tokyo's Haneda Airport if it flies there from Seattle daily  upsetting competitors that had asked for Delta's slot to grow their presence in Asia.",
        "date": "03272015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "U.S. regulator proposes letting Delta keep contested Tokyo airport slot "
    },
    {
        "content": "March 27 A U.S. regulator tentatively said Friday that Delta Air Lines Inc can keep a slot at Tokyo's Haneda Airport if it flies there from Seattle daily  upsetting competitors that had asked for Delta's slot to grow their presence in Asia.",
        "date": "03272015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-U.S. regulator proposes letting Delta keep contested Tokyo airport slot "
    },
    {
        "content": "A federal mediator has been called in to revive stalled labor negotiations at Delta Airlines Inc's  Philadelphia-area refinery  as both sides seek to prevent the nation's largest U.S. refinery strike in 35 years from spreading to the East Coast.",
        "date": "03032015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Federal mediator tapped for Delta refinery talks "
    },
    {
        "content": "NEW YORK A Delta Air Lines Inc jet landing during a snowstorm at New York's LaGuardia Airport on Thursday slid off the runway and struck a fence before coming to rest on a snow-covered embankment just feet from the frigid waters of Flushing Bay. | Video ",
        "date": "03052015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta jet skids off runway during snowstorm at NY airport "
    },
    {
        "content": "NEW YORK  March 5 A Delta Air Lines Inc  jet landing during a snowstorm at New York's LaGuardia Airport on Thursday slid off the runway and struck a fence before coming to rest on a snow-covered embankment just feet from the frigid waters of Flushing Bay.",
        "date": "03052015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 7-Delta jet skids off runway during snowstorm at NY airport "
    },
    {
        "content": "New York's LaGuardia Airport reopened on Thursday afternoon   after a Delta Air Lines aircraft skidded off a runaway during a snowstorm  forcing the closure of the facility for more than three hours  city officials said.",
        "date": "03052015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "New York's LaGuardia Airport reopens after Delta plane skid mishap "
    },
    {
        "content": "American Airlines Group Inc and Delta Air Lines Inc have no plans to rescue Japan's bankrupt Skymark Airlines Inc  the two companies said separately on Monday following a media report on their alleged interest in the budget carrier.",
        "date": "02232015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "American and Delta not interested in Skymark Airlines tie-up "
    },
    {
        "content": "Feb 23 American Airlines Group Inc and Delta Air Lines Inc have no plans to rescue Japan's bankrupt Skymark Airlines Inc  the two companies said separately on Monday following a media report on their alleged interest in the budget carrier.",
        "date": "02232015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 1-American and Delta not interested in Skymark Airlines tie-up "
    },
    {
        "content": "DUBAI/NEW YORK  Feb 19 An increasingly bitter trade row between U.S. and Gulf airlines deepened on Thursday when Dubai's Emirates rejected a Delta Air Lines apology for remarks perceived as linking Gulf carriers with the Sept. 11 attacks on the United States in 2001.",
        "date": "02192015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Dubai airline Emirates rejects Delta apology over 9/11 comments "
    },
    {
        "content": "Feb 3 Delta Air Lines will serve Starbucks brand coffee on all of its flights  growing its existing partnership with the world's biggest coffee chain  the companies plan to announce on Wednesday.",
        "date": "02042015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines expands partnership with Starbucks "
    },
    {
        "content": "With plummeting oil prices expected to cut airlines' costs by billions of dollars  Delta Air Lines Inc  said Tuesday that it will channel the savings toward debt reduction and returning more cash to shareholders.",
        "date": "01202015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "Delta to use fuel drop to cut debt  return cash to investors "
    },
    {
        "content": "Jan 20 With plummeting oil prices expected to cut airlines' costs by billions of dollars  Delta Air Lines Inc  said Tuesday that it will channel the savings toward debt reduction and returning more cash to shareholders.",
        "date": "01202015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "UPDATE 2-Delta to use fuel drop to cut debt  return cash to investors "
    },
    {
        "content": "Jan 20 Delta Air Lines expects to pay on average $2.25 to $2.35 per gallon of jet fuel for 2015  Chief Financial Officer Paul Jacobson said during the company's earnings call Tuesday.",
        "date": "01202015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines sees fuel costs at $2.25 to $2.35 per gallon for 2015 "
    },
    {
        "content": "Jan 20 Delta Air Lines Inc said on Tuesday it lost $712 million last quarter largely due to fuel hedge settlements  although the carrier topped analysts' estimates.",
        "date": "01202015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta Air Lines posts 4th-qtr loss after fuel hedging "
    },
    {
        "content": "Jan 13 About 60 percent of Delta Air Lines  flight attendants have demanded a vote on whether they should unionize  the first step toward an election supervised by a federal agency.",
        "date": "01132015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Delta flight attendants demand vote on whether to unionize "
    },
    {
        "content": "* Announces additional business renewal with Delta Air Lines",
        "date": "01072015",
        "name": "Delta Air Lines Inc",
        "news_type": "topStory",
        "symbol": "DAL",
        "title": "BRIEF-Gategroup Holding announces additional business renewal with Delta Air Lines "
    },
    {
        "content": "Jan 5 American Airlines and Hawaiian Airlines formally launched bids Monday to wrest control of a key slot in Tokyo's Haneda Airport from Delta Air Lines  as part of a fight among the carriers to stake out a greater presence in Asia.",
        "date": "01062015",
        "name": "Delta Air Lines Inc",
        "news_type": "normal",
        "symbol": "DAL",
        "title": "Airlines bid to take Tokyo airport slot from Delta Air Lines "
    }
]