[
    {
        "content": "* Says ‍NTT Docomo ceases to hold shares in Tata Teleservices Ltd Source text - http://bit.ly/2iPm7fB Further company coverage:",
        "date": "11012017",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-Tata Teleservices (Maharashtra) says ‍NTT Docomo ceases to hold shares in Tata Teleservices "
    },
    {
        "content": "* Says it plans to repurchase up to 120 million shares  representing 3.2 percent of outstanding",
        "date": "10262017",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF- NTT Docomo to repurchase shares "
    },
    {
        "content": "* NTT Docomo's operating profit likely slumped 5% on the year to just under 550 billion yen for six months through September - Nikkei‍​ Source text: (http://s.nikkei.com/2izaj0P) Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "10242017",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo's operating profit likely slumped 5 pct for six months through Sept - Nikkei‍​ "
    },
    {
        "content": "* NTT Docomo's Group operating profit probably sank nearly 10 percent on year to around $2.51 billion for April-June quarter",
        "date": "07242017",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo's group operating profit probably sank nearly 10 percent for April-June quarter - Nikkei "
    },
    {
        "content": "* CCI approves Tata Companies' acquisition of 21.63 percent shareholding in Tata Teleservices from NTT Docomo Source text: (http://bit.ly/2qnod4t) Further company coverage:",
        "date": "05252017",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-CCI approves Tata Companies' buying of of 21.63 pct shareholding in Tata Teleservices from NTT Docomo "
    },
    {
        "content": "* Says the company and NTT Docomo Inc will cooperate on planning and production of d job  which is a platform for job hunting",
        "date": "05242017",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF- ZIGExN announces business alliance with NTT DOCOMO "
    },
    {
        "content": "NEW DELHI The Delhi High Court has approved a settlement of the $1.18 billion dispute between Tata Sons and NTT DoCoMo  allowing the Indian firm to buy out the Japanese firm's stake in the telecoms joint venture  TV news channels reported on Friday.",
        "date": "04282017",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "India court approves $1.18 bln settlement of Tata-DoCoMo dispute: TV "
    },
    {
        "content": "NEW DELHI  April 28 The Delhi High Court has approved a settlement of the $1.18 billion dispute between Tata Sons and NTT DoCoMo  allowing the Indian firm to buy out the Japanese firm's stake in the telecoms joint venture  TV news channels reported on Friday.",
        "date": "04282017",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "UPDATE 1-India court approves $1.18 bln settlement of Tata-DoCoMo dispute - TV "
    },
    {
        "content": "NEW DELHI  April 28 The Delhi High Court has approved a settlement of the $1.18 billion dispute between Tata Sons and NTT DoCoMo  allowing the Indian firm to buy out the Japanese firm's stake in the telecoms joint venture  TV news channels reported on Friday.",
        "date": "04282017",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "India court approves $1.18 bln settlement of Tata-DoCoMo dispute - TV "
    },
    {
        "content": "* NTT Docomo's group operating profit is seen edging up to around 950 billion yen ($8.63 billion) in the year ending March 2018 - Nikkei",
        "date": "04242017",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo's group operating profit is seen edging up to around 950 bln yen in the year ending march 2018 - Nikkei "
    },
    {
        "content": "* Says it will retire 58 980 000 shares (1.49 pct stake) of its common stock on March 31",
        "date": "03242017",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo to retire 58 980 000 treasury shares "
    },
    {
        "content": "NEW DELHI India's Tata Sons will split a dispute settlement payment of $1.18 billion owed to NTT DoCoMo over the Japanese firm's exit from a telecoms joint venture  leaving it with about two-thirds of the amount to invest in India  a source said.",
        "date": "03032017",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "Tata-DoCoMo truce may leave Japanese firm with $790 million to invest in India: source "
    },
    {
        "content": "NEW DELHI  March 3 India's Tata Sons will split a dispute settlement payment of $1.18 billion owed to NTT DoCoMo  over the Japanese firm's exit from a telecoms joint venture  leaving it with about two-thirds of the amount to invest in India  a source said.",
        "date": "03032017",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "Tata-DoCoMo truce may leave Japanese firm with $790 mln to invest in India - source "
    },
    {
        "content": "MUMBAI India's Tata Sons has agreed to pay NTT DoCoMo  $1.18 billion to buy out the Japanese firm's stake in a telecoms joint venture  paving the way for the settlement of a long-standing dispute days after a new chairman took charge at the Indian conglomerate.",
        "date": "02282017",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "Tata Sons moves to settle $1.18 billion legal dispute with DoCoMo "
    },
    {
        "content": "Feb 28 India's Tata Sons Ltd has agreed to pay Japan's NTT DoCoMo about $1.17 billion in connection with the termination of a joint venture in the South Asian nation  the Nikkei daily reported  without citing its sources.",
        "date": "02272017",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "Tata Sons  DoCoMo to settle $1.17 bln legal dispute - Nikkei "
    },
    {
        "content": "* Settlement comes days after new chairman starts at Tata Sons",
        "date": "02282017",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "UPDATE 1-Tata Sons moves to settle $1.18 bln legal dispute with DoCoMo "
    },
    {
        "content": "* Tata sons and Docomo reach agreement in principle on payment of LCIA arbitration award",
        "date": "02282017",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "BRIEF-Tata Sons  Docomo reach deal in principle on payment of LCIA arbitration award "
    },
    {
        "content": "* India's Tata Group has agreed to pay Japan's NTT Docomo $1.17 billion in connection with end of a tie-up in the South Asian nation - Nikkei",
        "date": "02272017",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "BRIEF-Tata Group agreed to pay NTT Docomo $1.17 billion - Nikkei "
    },
    {
        "content": "* NTT Docomo's group operating profit for the nine months through December likely climbed 20% on the year to around 840 billion yen - Nikkei",
        "date": "01252017",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo's group operating profit for nine months through December likely rose 20 pct "
    },
    {
        "content": "* Rating and Investment Information  Inc. (R&I) affirmed the company's rating at \"AA+\" -R&I",
        "date": "01232017",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-R&I affirms NTT DOCOMO Inc's rating at \"AA+\" and changes outlook to stable -R&I "
    },
    {
        "content": "* NTT Docomo has identified additional 20 billion yen ($176 million) in cost cuts for second fiscal half  primarily in area of customer service - Nikkei",
        "date": "11292016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo identifies additional 20 billion yen in cost cuts for second fiscal half - Nikkei "
    },
    {
        "content": "* Says it repurchased 2 million shares for 5.1 billion yen in total in October",
        "date": "11042016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo repurchase 2 mln shares in October "
    },
    {
        "content": "* Dispute with DoCoMo still under litigation   (Adds lawyer comment  details on dispute)",
        "date": "11012016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "UPDATE 2-Ousted Tata chairman denies mishandling DoCoMo dispute "
    },
    {
        "content": "MUMBAI Ousted Tata Sons Chairman Cyrus Mistry said on Tuesday any \"insinuations\" he mis-handled a dispute with Japanese telecoms firm NTT DoCoMo Inc were baseless  ratcheting up a war of words with the Tata Sons board. | Video ",
        "date": "11012016",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "Ousted Tata Sons chairman denies mishandling DoCoMo dispute "
    },
    {
        "content": "MUMBAI  Nov 1 Tata Sons ousted Chairman Cyrus Mistry said on Tuesday that any insinuation that he had mis-handled a drawn out dispute with its Japanese telecom partner NTT DoCoMo Inc were baseless  ratcheting up the war of words between the two feuding sides.",
        "date": "11012016",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "Former Tata chairman says allegations of Docomo issue mishandling baseless "
    },
    {
        "content": "* Announces close of business and capital alliance with NTT Docomo Inc on Oct. 28",
        "date": "10282016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-Aplix IP Holdings announces close of business and capital alliance with NTT Docomo Inc "
    },
    {
        "content": "* NTT Docomo's group operating profit appears to have risen 25 percent on year to 580 billion yen ($5.54 billion) for first half ended in September - Nikkei  Source text: http://s.nikkei.com/2e7zTTx Further company coverage:",
        "date": "10252016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo's group operating profit seen up 25 pct for H1 - Nikkei "
    },
    {
        "content": "* Mistry's Shapoorji Pallonji family may contest move - CNBC   (Adds comments from source on group executive council)",
        "date": "10242016",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "UPDATE 3-Patriarch steps in at India's Tata Sons after board ousts chairman "
    },
    {
        "content": "MUMBAI/DELHI  Oct 24 Indian salt-to-software conglomerate Tata Sons has ousted Cyrus Mistry as chairman and restored Ratan Tata to the position while it seeks a permanent replacement.",
        "date": "10242016",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "REFILE-UPDATE 1-Tata Sons ousts Mistry and names Ratan Tata interim chairman "
    },
    {
        "content": "* says it formed a business alliance with NTT DOCOMO INC  on Oct. 12",
        "date": "10122016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-Nousouken says business alliance with NTT DOCOMO "
    },
    {
        "content": "* Says it repurchased 7 785 700 shares for 20 414 916 800 yen in total from Sep. 1 to Sep. 30",
        "date": "10072016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo repurchase 7 785 700 shares in September "
    },
    {
        "content": "* Said on Tuesday that its unit NTT Technology Sp. z o.o.  in a consortium with MAXTO Sp. o.o. S.K.A. and  SUNTAR Sp. z o.o.  signs delivery agreement",
        "date": "10052016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT System unit signs deal to deliver PCs for 12.7 mln zlotys "
    },
    {
        "content": "* NTT Docomo will slash service charge for basic feature cellular phones by about 30 percent - Nikkei  Source text for Eikon:  Further company coverage:",
        "date": "10042016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo will slash service charge for basic feature cellular phones - Nikkei "
    },
    {
        "content": "* Said on Saturday that its unit  NTT Technology Sp. z o.o.  in a consortium with Helica Sp. z o.o.  signs a delivery agreement",
        "date": "10032016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT System unit signs agreement to deliver PCs  screens and laptops "
    },
    {
        "content": "* Says it bought back 9 million shares for 24.3 billion yen in August",
        "date": "09072016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo buys 9 mln shares back in August "
    },
    {
        "content": "* NTT Docomo will lower costs by around 50 billion yen in the current fiscal year through march  by streamlining maintenance of network hardware - Nikkei",
        "date": "09062016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo to lower costs by around 50 bln yen in current FY through March - Nikkei "
    },
    {
        "content": "NEW DELHI  Sept 5 Tata Sons Ltd said on Monday it had made an application to set aside an order obtained by NTT DoCoMo from a London court that would allow the Japanese company to lay claim to Tata's overseas assets to settle a dispute over Tata Teleservices.",
        "date": "09052016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "Tata applies to set aside DoCoMo court order on asset claims "
    },
    {
        "content": "* Says it bought back 3.5 million shares for 9.86 billion yen in July",
        "date": "08042016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo buys back 3.5 mln shares in July "
    },
    {
        "content": " ",
        "date": "08012016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "Tata to deposit $1.2 bln DoCoMo arbitration award with Delhi court "
    },
    {
        "content": "* NTT Docomo's first-quarter operating profit likely rose by a fifth on the year to around 280 billion yen - Nikkei",
        "date": "07272016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo is expected to maintain its full-year earnings guidance - Nikkei "
    },
    {
        "content": "* NTT Docomo is preparing to offer new  low-cost contracts for users of mobile phones without touchscreens - Nikkei  Source text (http://s.nikkei.com/29q3sQx) Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780; )",
        "date": "07072016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo preparing to offer new  low-cost contracts for users of mobile phones without touchscreens - Nikkei "
    },
    {
        "content": "* Says it repurchased 10.1 million shares for 27.43 billion yen in total in June",
        "date": "07062016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo updates share repurchase status "
    },
    {
        "content": "TOKYO India's Tata Sons Ltd has been ordered to pay NTT DoCoMo Inc  $1.2 billion to buy DoCoMo's stake in its mobile phone joint venture  the Japanese firm said  citing an international arbitration court ruling.",
        "date": "06242016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "Tata ordered to pay NTT DoCoMo $1.2 billion in arbitration award for JV stake "
    },
    {
        "content": "* India's central bank had rejected Tata's offer to buy stake",
        "date": "06242016",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "CORRECTED-UPDATE 2-Tata ordered to pay NTT DoCoMo $1.2 bln in arbitration award for JV stake "
    },
    {
        "content": "TOKYO  June 24 NTT DoCoMo Inc said on Friday it had received an award from an international arbitration court ordering Tata Sons Ltd to pay it about $1.17 billion  upon DoCoMo's tender of its entire stake in their joint venture Tata Teleservices to Tata Sons or a designee.",
        "date": "06242016",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "NTT DoCoMo says got arbitration award on Tata Teleservices stake "
    },
    {
        "content": "* Says the company repurchases 10 million shares for 27.21 billion yen in total from May 2 to May 31",
        "date": "06072016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo updates share repurchase status "
    },
    {
        "content": "* NTT says to buy back up to 3.24 percent of own shares worth 350 billion yen ($3.2 billion)  Source text for Eikon:  Further company coverage:   ($1 = 108.7300 yen)",
        "date": "05132016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT announces $3.2 bln stock buyback plan "
    },
    {
        "content": "* NTT Docomo has decided to appoint a senior executive vice president  Kazuhiro Yoshizawa  as its president - Nikkei",
        "date": "05022016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo decided to appoint senior executive vice president  Kazuhiro Yoshizawa  as its president - Nikkei "
    },
    {
        "content": "* Said on Friday DOCOMO Digital GmbH has given notice to net mobile AG that it has determined the amount of the reasonable cash settlement for squeeze out demand by",
        "date": "05022016",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "BRIEF- net mobile: cash settlement determined for squeeze out demand by DOCOMO "
    },
    {
        "content": "* NTT Docomo apparently saw group operating profit jump 17 percent to just over 750 billion yen ($6.75 billion) in fiscal 2015 - Nikkei",
        "date": "04262016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo FY 2015 operating profit expected to be up 17 pct - Nikkei "
    },
    {
        "content": "* Says to cancel treasury stock worth 3.11 percent of shares outstanding",
        "date": "03252016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT DoCoMo to cancel treasury stock "
    },
    {
        "content": "* Registers for issuance of 1 trln yen in straight bonds in 2-year period from April 3 - DealWatchFurther company coverage:",
        "date": "03252016",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "BRIEF-NTT DoCoMo registers for issuance of 1 trln yen in bonds "
    },
    {
        "content": "* NTT DoCoMo says to buy back up to 500 billion yen of own shares",
        "date": "02052016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT DoCoMo says to buy back up to 500 billion yen of own shares "
    },
    {
        "content": "* Says establishes framework to buy back up to 500 billion yen of own shares",
        "date": "01292016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo establishes framework to buy back up to 500 bln yen of own shares "
    },
    {
        "content": "* \u007fDocomo Digital GmbH has decided to launch a public tender offer with aim to acquire all outstanding shares in Net Mobile AG \u007f",
        "date": "01082016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-DOCOMO Digital GmbH: Public offer for acquisition of shares of Net Mobile AG "
    },
    {
        "content": "* Is to deploy its IP core/edge routing platform for Japan's largest mobile operator  NTT Docomo  Inc.   Source text: http://bit.ly/1OzrF53 Further company coverage:    (Gdynia Newsroom)",
        "date": "01062016",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-Alcatel-Lucent wins deal with Japanese telco NTT Docomo "
    },
    {
        "content": "RESULTS             RESULT          FORECAST   Revenues        1.08 trln           1.08 trln        4.51 trln",
        "date": "07292015",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "REFILE-TABLE-NTT DoCoMo -Q1 group results (SEC) "
    },
    {
        "content": "* Says Nokia Networks has partnered with NTT Docomo  Inc. to explore the potential of Nokia Networks' 5G radio technology below 6 GHz frequencies.",
        "date": "07222015",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-Nokia Networks and NTT Docomo partner on 5G trials "
    },
    {
        "content": "* NTT Docomo selects Gemalto for IoT applications in Japan  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom:)",
        "date": "07022015",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "BRIEF-Gemalto selected by NTT Docomo for IoT applications in Japan "
    },
    {
        "content": "* Amount of share buyback by firms rose for 3rd year in April-May - Nomura     * NTT Docomo soars to over 10-year high on report for higher ROE     * Japan Tobacco falls after Canadian court orders to pay C$2 bln      By Ayai Tomisawa     TOKYO  June 2 Japan's Nikkei share average rose for a 13th day on Tuesday as expectations for better shareholder returns continued to support the market  while the weak yen lifted exporters such as Toyota Motor Corp.     The Nikkei 225 gained 0.2 pe",
        "date": "06022015",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "Nikkei rises for 13th day helped by better shareholder returns "
    },
    {
        "content": "* Nikkei  Topix post biggest loss in almost 4 months     * Speculators lock in gains after market's rally     * Honda  NTT Docomo  Oriental Land hit by earning disappointment     * Nikkei extends losses after BOJ refrains from easing      By Hideyuki Sano     TOKYO  April 30 Japanese shares suffered their biggest loss in four months on Thursday on weak U.S. growth figures and lacklustre earnings from Japanese companies including Honda Motor.     The Nikkei share average fell 2.7 perc",
        "date": "04302015",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "Nikkei posts biggest loss in 4 months on weak U.S. GDP  lacklustre earnings "
    },
    {
        "content": "* Speculators lock in gains after market's rally     * Soft U.S. data  fall in European shares trigger selling     * Honda  NTT Docomo  Oriental Land hit by earning disappointment      By Hideyuki Sano     TOKYO  April 30 Japanese shares tumbled on Thursday as traders locked in profits from recent gains  discouraged by weak U.S. growth figures  a retreat in overseas shares and disappointing earnings from Honda Motor and a few other companies.     The Nikkei share average fell 1.9 per",
        "date": "04302015",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "Nikkei tumbles on weak U.S. GDP  earnings disappointment "
    },
    {
        "content": "* Securities firms Nomura and Daiwa rally     * NTT Docomo hits 11-year high      By Thomas Wilson     TOKYO  Apr 23Japanese stocks rose on Thursday as investors sought to pick up stock seen as undervalued and presenting positive earnings prospects  with the likes of Nomura Holdings and large cap Japan Tobacco surging on strong demand.      The Nikkei benchmark climbed 0.3 percent to 20 190.22 after opening at a fresh 15-year high of 20 252.12.     \"Investors are expecting big gains ",
        "date": "04232015",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "Nikkei touches new 15-year high as securities  large-cap shares shine "
    },
    {
        "content": "MUMBAI  March 24 Indian conglomerate Tata Sons Ltd on Tuesday said the country's central bank has rejected its request to buy Japanese group NTT DoCoMo Inc's  stake in their Indian telecom joint venture at a premium to its current fair value.",
        "date": "03242015",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "India's central bank rejects Tata offer for DoCoMo's Teleservices stake "
    },
    {
        "content": "TOKYO  Feb 17 Japan's biggest mobile phone service provider NTT DoCoMo Inc may not profit from subscribers paying its new flat rate until the business year ending March 2017  its chief executive officer told Reuters in an interview on Tuesday.",
        "date": "02172015",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "Japan's NTT DoCoMo says may not profit from flat-rate subscribers until FY2016 "
    },
    {
        "content": "* may not profit from flat-rate fee mobile subscribers until FY2016  Further company coverage:    (Reporting by Teppei Kasai)",
        "date": "02172015",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "BRIEF-NTT DoCoMo aims to profit from fibre optic service in FY2016 -CEO "
    },
    {
        "content": "(Adds Q4 Dividend figure of company forecast) Jan 29 (Reuters)-            NTT DoCoMo Inc            CONSOLIDATED FINANCIAL HIGHLIGHTS       (in billions of yen unless specified)                   9 months ended      9 months ended       Year to                  Dec 31  2014        Dec 31  2013     Mar 31  2015                     LATEST             YEAR-AGO          COMPANY                       RESULTS             RESULT          FORECAST      Revenues        3.33 trln           3.36 trln     ",
        "date": "01292015",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "REFILE-TABLE-NTT DoCoMo -9-MTH group results (SEC) "
    },
    {
        "content": "NEW YORK  Jan 20 Bitcoin payment processor Coinbase said on Tuesday it has raised $75 million from several major financial institutions  including the New York Stock Exchange  USAA Bank  and Spanish banking group BBVA.",
        "date": "01202015",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "Bitcoin payment processor Coinbase says raises $75 million "
    },
    {
        "content": "TOKYO/MUMBAI NTT DoCoMo Inc on Monday said it has asked a London court to ensure Tata Sons Ltd [TATAS.UL] finds a buyer willing to pay at least $1.1 billion for the Japanese carrier's stake in a struggling Indian joint venture.",
        "date": "01052015",
        "name": "NTT DOCOMO Inc",
        "news_type": "topStory",
        "symbol": "DCM",
        "title": "NTT DoCoMo files arbitration request to sell $1 bilion Tata Teleservices stake "
    },
    {
        "content": "* DoCoMo files arbitration request in London court on Jan 3",
        "date": "01052015",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "UPDATE 1-NTT DoCoMo files arbitration request to sell $1 bln Tata Teleservices stake "
    },
    {
        "content": "MUMBAI  Jan 14 India's central bank has allowed conglomerate Tata Sons Ltd to buy Japanese telecom firm NTT DoCoMo Inc's stake in their struggling Indian venture  paving the way for the completion of the long-delayed $1.1 billion deal.",
        "date": "01142015",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "Tata wins central bank approval to buy DoCoMo stake in India JV "
    },
    {
        "content": "TOKYO  Jan 5 NTT DoCoMo Inc on Monday said it has asked a London court to ensure Tata Sons Ltd  finds a buyer for the Japanese carrier's stake in an Indian joint venture for $1 billion  after Tata failed to do so by an agreed date.",
        "date": "01052015",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "NTT DoCoMo files arbitration request to sell $1 bln Tata Teleservices stake "
    },
    {
        "content": "* Says has filed arbitration request regarding stake in Tata Teleservices",
        "date": "01052015",
        "name": "NTT DOCOMO Inc",
        "news_type": "normal",
        "symbol": "DCM",
        "title": "BRIEF-NTT Docomo files arbitration request regarding Tata Teleservices stake "
    }
]