[
    {
        "content": "* ‍LAUNCHES AND PRICES 0.000% 3 YEAR AND 0.500% LONG 6 YEAR FIXED RATE EURO DENOMINATED BONDS​",
        "date": "11142017",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "BRIEF-Diageo ‍launches fixed rate euro denominated bonds​ "
    },
    {
        "content": "(The following statement was released by the rating agency) MOSCOW/LONDON  October 23 (Fitch) Fitch Ratings has affirmed Diageo plc's Long-Term Issuer Default Rating (IDR) and senior unsecured rating at 'A-'/'F2' and its Short-Term IDR at 'F2'. The Outlook is Stable. Fitch also affirmed the senior unsecured ratings on Diageo's subsidiaries  Diageo Finance BV  Diageo Finance plc  Diageo Capital plc and Diageo Investment Corporation  at 'A-'/'F2'. The rating affirmation reflects Diageo's improved ",
        "date": "10232017",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Fitch Affirms Diageo at 'A-'; Outlook Stable "
    },
    {
        "content": "JOHANNESBURG  Oct 13 Klippies and coke. Ricky Louw. Karate Water.",
        "date": "10132017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "INSIGHT-Brandy chases whisky in South African spirit wars "
    },
    {
        "content": "* PORT ELLEN AND BRORA ‍WILL BE BROUGHT BACK INTO PRODUCTION THROUGH A £35 MILLION INVESTMENT BY DIAGEO​",
        "date": "10092017",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "BRIEF-Diageo to invest 35 mln stg in Port Ellen And Brora distilleries "
    },
    {
        "content": "Diageo   the maker of Johnnie Walker whisky and Smirnoff vodka  forecast stronger sales and profit growth in the second half of its financial year after a first half affected by negative factors in China and India and higher spending.    The world's biggest spirits maker said earlier on Wednesday that its first-half sales growth would be hurt both by the Chinese New Year falling later than in 2017 and a ban on selling alcohol near Indian highways.",
        "date": "09202017",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Diageo expects second half to drive full-year growth "
    },
    {
        "content": "Sept 20 Diageo  the maker of Johnnie Walker whisky and Smirnoff vodka  forecast stronger sales and profit growth in the second half of its financial year after a first half affected by negative factors in China and India and higher spending.",
        "date": "09202017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "UPDATE 2-Diageo expects second half to drive full-year growth "
    },
    {
        "content": "Sept 20 Britain's Diageo  the maker of Johnnie Walker whisky and Smirnoff vodka  said it expects its organic first-half sales growth to be impacted by the timing of Chinese New Year and a ban on selling alcohol along highways in India.",
        "date": "09202017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo sees impact on sales from Indian highway liquor ban "
    },
    {
        "content": "* ‍ON 26 JULY 2017  BOARD OF DIAGEO PLC APPROVED A SHARE BUY-BACK PROGRAMME TO RETURN UP TO £1.5 BILLION TO SHAREHOLDERS DURING FISCAL YEAR ENDING 30 JUNE 2018​",
        "date": "09082017",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "BRIEF-Diageo updates on 1.5 bln pound share repurchase programme "
    },
    {
        "content": "LONDON  Aug 11 One of Diageo's largest shareholders has questioned its decision to sell one of its oldest whiskey brands while buying a tequila company founded by actor George Clooney.",
        "date": "08112017",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Top Diageo shareholder questions company's M&A strategy "
    },
    {
        "content": "NAIROBI  July 27 Kenya's East African Breweries said net profit for the year through June rose 6 percent to 8.5 billion Kenyan shillings ($81.89 million)  helped by reduced operating costs and a slight rise in sales.",
        "date": "07272017",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Kenya's East African Breweries full year after tax profit up 6 pct "
    },
    {
        "content": "* Shares jump more than 6 pct to record high (Adds analyst comment  background)",
        "date": "07272017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "UPDATE 2-Britain's Diageo shares jump on higher margin target  buyback plan "
    },
    {
        "content": "LONDON  July 27 A punishing fall in AstraZeneca's shares after the failure of a key lung cancer study for the pharma company offset the impact  of earnings-led gains for drinks giant Diageo on Britain's top share index.",
        "date": "07272017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "AstraZeneca pain weighs on FTSE  Diageo makes merry after results "
    },
    {
        "content": "* But Nestle results disappoint (Adds details  updates prices)",
        "date": "07272017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "AstraZeneca slump dominates European shares on busy earnings day "
    },
    {
        "content": "July 27 Britain's FTSE 100 futures were up 0.3 percent ahead of the cash market open.",
        "date": "07272017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "UPDATE 1-UK Stocks-Factors to watch on July 27 "
    },
    {
        "content": "* Diageo cfo says to manage leverage ratio in range of 2.5 to 3 times",
        "date": "07272017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-Diageo cfo says encouraged that us year on year results improved but still work to do in vodka "
    },
    {
        "content": "LONDON  July 27 Britain's Diageo reported higher full-year sales and profits on Thursday  and raised its margin growth target  saying productivity initiatives were delivering ahead of expectations.",
        "date": "07272017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Britain's Diageo raises margin growth forecast "
    },
    {
        "content": "LONDON Diageo Plc  has agreed to buy George Clooney's high-end tequila brand Casamigos for up to $1 billion  as the world's largest spirits maker seeks to lift its presence in a high-growth market. | Video ",
        "date": "06222017",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Diageo to buy George Clooney's Casamigos tequila for up to $1 billion "
    },
    {
        "content": "LONDON  June 21 Diageo PLC has agreed to buy George Clooney's high-end tequila brand Casamigos in a deal that values it at up to $1 billion  as the world's largest spirits company seeks to boost its presence in a high-growth market.",
        "date": "06212017",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Diageo to buy George Clooney's tequila brand Casamigos for $1 bln "
    },
    {
        "content": "* Analysts question if Casamigos can sustain pace of growth (Adds analyst comments  Diageo shares)",
        "date": "06222017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "UPDATE 3-Diageo to buy George Clooney's Casamigos tequila for up to $1 bln "
    },
    {
        "content": "LONDON  May 9 Diageo  the world's largest spirits company  is stepping up its marketing in the United States  starting in the second half of this year and again next year  armed with a new programme of data analysis that lets it spend more smartly.",
        "date": "05092017",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Emboldened by new data  Diageo steps up marketing spend "
    },
    {
        "content": "LONDON  May 8 Diageo  the world's largest spirits company  stood by its medium-term sales and profit targets on Monday  saying the year has progressed well.",
        "date": "05082017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo sticks to medium-term outlook  year progressing well "
    },
    {
        "content": "LAGOS  May 8 Lafarge Africa wants to raise 140 billion naira ($445.9 million) in fresh equity and convert some loans into shares as part of a planned rights issue after it reported losses last year.",
        "date": "05082017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "UPDATE 1-Lafarge Africa plans to raise equity after 2016 losses "
    },
    {
        "content": "LONDON  April 21 HSBC said Paul Walsh  the former chief executive of drinks maker Diageo  is to step down from its board with immediate effect in order to focus on his other commitments.",
        "date": "04212017",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "HSBC says former Diageo chief Walsh to leave its board "
    },
    {
        "content": "LONDON  April 20 Alcoholic drinks giant Diageo plans to cut roughly 100 jobs in Scotland  at a time when Britain's workforce is facing uncertainty over the nation's impending exit from the European Union.",
        "date": "04202017",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Diageo cutting jobs in Scotland ahead of Brexit-union "
    },
    {
        "content": "* Diageo says has reviewed spirits bottling footprint  and that some jobs in european bottling plants may be impacted toward end of year",
        "date": "04202017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-Diageo says  now entering consultation period w/ employees and their representatives to discuss proposals in more detail "
    },
    {
        "content": "* GMB Scotland Union says Diageo to cut 105 jobs in Scotland due to brexit concerns",
        "date": "04202017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-GMB Scotland Union says Diageo to cut 105 jobs in Scotland due to brexit concerns "
    },
    {
        "content": "LONDON  March 31 Diageo  the world's largest spirits maker  spotted in 2015 that drinkers in the emerging middle class in Ghana and Cameroon were keen to show off their new status by buying their own bottles of Johnnie Walker rather than shots.",
        "date": "03312017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Changes at Diageo put focus back on Scotch "
    },
    {
        "content": "LONDON Diageo  plans to open a new Guinness brewery in the U.S. state of Maryland where it will make new Guinness beers for the U.S. market  the company said in a statement on Tuesday.",
        "date": "01312017",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Diageo to make new Guinness beers for U.S. market "
    },
    {
        "content": "LONDON  Jan 31 Diageo plans to open a new Guinness brewery in the U.S. state of Maryland where it will make new Guinness beers for the U.S. market  the company said in a statement on Tuesday.",
        "date": "01312017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo to make new Guinness beers for US market "
    },
    {
        "content": "Jan 31 Diageo will launch a new blended Irish whiskey called Roe & Co  the world's largest distiller said on Tuesday.",
        "date": "01312017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo returns to Irish whiskey market with Roe & Co "
    },
    {
        "content": "NAIROBI  Jan 27 East African Breweries Ltd (EABL)  controlled by Britain's  Diageo  blamed a jump in Kenyan tax on beer for its flat sales in the six months to Dec. 31 but expects a recovery in the next half-year period.",
        "date": "01272017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "East African Breweries says tax-induced drop in beer demand only temporary "
    },
    {
        "content": "LAGOS  Jan 23 Guinness Nigeria said on Monday it was seeking shareholder approval for a share issue to raise 40 billion naira ($127 million) which it needs to strengthen its balance sheet following recent losses.",
        "date": "01232017",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "UPDATE 2-Guinness Nigeria set to launch $127 mln rights issue "
    },
    {
        "content": "* Diageo ceo says  prudent to assume environment in brazil is not getting better in near term",
        "date": "01262017",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "BRIEF-Diageo ceo says no major impact if united states were to revert to wto trade arrangements "
    },
    {
        "content": "Jan 27 Britain's FTSE 100 futures were up 0.3 percent ahead of the cash market open on Friday.",
        "date": "01272017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "UPDATE 3-UK Stocks-Factors to watch on Jan 27 "
    },
    {
        "content": "Jan 27 Britain's FTSE 100 index is seen opening down 5 points at 7 156 on Friday  according to financial bookmakers.          * The UK blue chip index closed down 0.04 percent at 7161.49 points on Thursday as earning updates provided a mixed picture with Diageo surging after strong sales data but Daily Mail and Unilever hit by disappointing numbers.      * BATS: British American Tobacco (BAT) has reached a principle agreement to acquire the tobacco assets of Bosnian holding firm Fabr",
        "date": "01272017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "UK Stocks-Factors to watch on Jan 27 "
    },
    {
        "content": "LONDON  Jan 26 Diageo  the world's largest distilled drinks company  reported on Thursday better than expected sales growth in the last six months  helped by improvements in its U.S. business and the strong U.S. dollar.",
        "date": "01262017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo reports better than expected half-year sales growth "
    },
    {
        "content": "* Reported net sales (£6 421 million) and operating profit (£2 065 million) were up 14.5% and 28.0%",
        "date": "01262017",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-Diageo says expectations unchanged after H1 profit gain "
    },
    {
        "content": "* Clarifies on news item  \"diageo mulls raising stake in united spirits via open offer\"",
        "date": "01182017",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "BRIEF-United Spirits says not aware if Diageo plans on raising stake in co via open offer "
    },
    {
        "content": "ABUJA/LONDON  Oct 5 Diageo has scrapped plans to lift its stake in Guinness Nigeria due to tough conditions in one of its biggest markets for the world-famous stout  the drinks company said on Wednesday.",
        "date": "10052016",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "UPDATE 2-Diageo scraps plan to raise Guinness Nigeria stake in tough market "
    },
    {
        "content": "ABUJA/LONDON  Oct 5 Diageo has scrapped plans to lift its stake in Guinness Nigeria due to tough market conditions there  the drinks company said on Wednesday.",
        "date": "10052016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo scraps plan to lift Guinness Nigeria stake in tough market "
    },
    {
        "content": "* Says the Co has taken decision not to proceed with Diageo Plc's offer",
        "date": "10052016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-Guinness Nigeria says Diageo Plc will not proceed with offer "
    },
    {
        "content": "LAGOS Guinness Nigeria said on Wednesday that it had received a $95 million loan from parent Diageo to help it cope with dollar shortages in the West African country caused by a slump in crude prices.",
        "date": "09212016",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Guinness Nigeria gets Diageo loan to help with currency shortages "
    },
    {
        "content": "LAGOS  Sept 21 Guinness Nigeria  said on Wednesday that it had received a $95 million loan from parent Diageo to help it cope with dollar shortages in the West African country caused by a slump in crude prices.",
        "date": "09212016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "UPDATE 1-Guinness Nigeria gets Diageo loan to help with currency shortages "
    },
    {
        "content": "LAGOS  Sept 21 Guinness Nigeria  said on Wednesday that is parent Diageo had given it a $95 million term loan to support its dollar needs through foreign currency shortages caused by the West African country's floating of the naira.",
        "date": "09212016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Guinness Nigeria gets $95 mln Diageo loan due to currency shortage "
    },
    {
        "content": "LONDON  Sept 21 Drinks maker Diageo said on Wednesday its 2017 fiscal year had started well  with the key drivers of improved top line growth being scotch whisky  U.S. spirits and India.",
        "date": "09212016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo makes good start to new financial year "
    },
    {
        "content": "(The following statement was released by the rating agency) MOSCOW/MILAN/LONDON  August 02 (Fitch) Fitch Ratings-Moscow/Milan/London-2  August 2016: Fitch Ratings has revised Diageo plc's Outlook to Stable from  Negative. Its Long-Term Issuer Default Rating (IDR) and senior unsecured rating  have been affirmed at 'A-'/'F2' and its Short-Term IDR at 'F2'. Diageo's  subsidiaries' (Diageo Finance BV  Diageo Finance plc  Diageo Capital plc and  Diageo Investment Corporation) senior unsecured ratings",
        "date": "08022016",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Fitch Revises Diageo's Outlook to Stable from Negative; Affirms at 'A-' "
    },
    {
        "content": "* Diageo CFO says it's important for company that UK continues to benefit from open access to EU",
        "date": "07282016",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "BRIEF-Diageo CFO says too early to comment on business impact of Brexit "
    },
    {
        "content": "* Board recommended a final dividend increase of 5% bringing full year dividend to 59.2 pence per share",
        "date": "07282016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-Diageo we are confident of achieving our objective of mid-single digit top line growth  and in three years ending f19 delivering 100bps of organic operating margin improvement.\" "
    },
    {
        "content": "* Anna Manz will leave at end of September and her successor will be subject of a future announcement",
        "date": "07142016",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "BRIEF-Diageo says strategy director Manz to join Johnson Matthey "
    },
    {
        "content": "LONDON  July 4 Britain's Diageo  maker of Johnnie Walker whisky and Smirnoff vodka  has invested for the first time in a non-alcoholic spirits brand.",
        "date": "07042016",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "CORRECTED-Diageo invests in non-alcoholic spirit brand "
    },
    {
        "content": "May 18 Spirits maker Diageo Plc said industry veteran Javier Ferrán  a partner at consumer-focused private equity firm Lion Capital  will succeed Franz Humer as chairman on Jan. 1.",
        "date": "05182016",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "UPDATE 1-Diageo names Lion Capital partner Javier Ferrán chairman "
    },
    {
        "content": "May 18 Spirits maker Diageo Plc said SABMiller Plc director Javier Ferrán will succeed Franz Humer as chairman.",
        "date": "05182016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo names SABMiller director Javier Ferrán as chairman "
    },
    {
        "content": "* Nick Blazquez is to leave Diageo in order to pursue new opportunities and challenges",
        "date": "05112016",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "BRIEF-Diageo's Blazquez to step down from executive committee "
    },
    {
        "content": "BENGALURU  India An Indian tribunal  heeding a call from a group of creditor banks  has blocked a $75 million settlement agreed between Diageo Plc  and liquor baron Vijay Mallya  after he was ousted from the spirits giant's local unit last month.",
        "date": "03072016",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Indian tribunal halts Diageo's $75 million payment to liquor baron Mallya "
    },
    {
        "content": "BENGALURU  India An Indian tribunal  heeding a call from a group of creditor banks  has blocked a $75 million settlement agreed between Diageo Plc and liquor baron Vijay Mallya  after he was ousted from the spirits giant's local unit last month.",
        "date": "03072016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Tribunal halts Diageo's $75 million payment to liquor baron Vijay Mallya "
    },
    {
        "content": "* Mallya's defunct Kingfisher Airlines owes more than $1 bln   (Recasts with tribunal verdict)",
        "date": "03072016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "UPDATE 2-Indian tribunal halts Diageo's $75 mln payment to liquor baron Mallya "
    },
    {
        "content": "BENGALURU  March 7 An Indian tribunal has temporarily halted a $75 million settlement due to be paid by spirits giant Diageo Plc to liquor baron Vijay Mallya  after he resigned as chairman of Diageo unit United Spirits .",
        "date": "03072016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "REFILE-India tribunal halts Diageo's $75 mln payment to liquor baron Mallya "
    },
    {
        "content": "* India tribunal says former United Spirits Chairman Vijay Mallya cannot withdraw money received in Diageo  settlement for now",
        "date": "03072016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-India tribunal halts Diageo's $75 mln payment to Vijay Mallya "
    },
    {
        "content": "MUMBAI/BENGALURU Liquor baron Vijay Mallya said he was in talks with banks for a one-time settlement of debt that his now-defunct Kingfisher Airlines owes  adding that he had no plans to run away from his creditors.",
        "date": "03072016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Liquor baron Mallya says in talks with banks to settle debt "
    },
    {
        "content": "MUMBAI  March 7 Indian liquor baron Vijay Mallya said he has been in talks to enter into a one-time settlement with state-run banks  to which his now-defunct carrier Kingfisher Airlines owes more than $1 billion.",
        "date": "03072016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Indian liquor baron Mallya says in talks to settle debt with lenders "
    },
    {
        "content": "Feb 26 The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "02262016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "PRESS DIGEST- Financial Times - Feb 26 "
    },
    {
        "content": "MUMBAI Liquor baron Vijay Mallya has agreed to give up his chairmanship and board position at India's top spirits company United Spirits Ltd  ending months of acrimony with the company's new owner Britain's Diageo Plc.",
        "date": "02252016",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Vijay Mallya steps down from Diageo-owned firm "
    },
    {
        "content": "* Mallya agrees to 5-year global  excluding UK  non-compete pact   (Adds details from Mallya and Diageo statement  background)",
        "date": "02252016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "UPDATE 1-Indian liquor baron Mallya steps down from Diageo-owned firm "
    },
    {
        "content": "MUMBAI  Feb 25 Liquor baron Vijay Mallya has agreed to resign from his post of chairman and non-executive director of India's largest spirits company United Spirits Ltd   the local arm of Britain's Diageo Plc.",
        "date": "02252016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Indian liquor baron Mallya steps down from United Spirits "
    },
    {
        "content": "* USL board will appoint Mahendra Kumar Sharma as chairman of USL",
        "date": "02252016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-Diageo reaches deal with Vijay Mallya for resignation as USL chairman\u007f "
    },
    {
        "content": "LONDON  Jan 28 Diageo  the world's largest maker of Scotch whisky  supports Britain staying in the European Union but its chief executive said he sees no dramatic immediate effect on its business from a possible \"Brexit\".",
        "date": "01282016",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Whisky maker Diageo toasts Britain's EU membership "
    },
    {
        "content": "LONDON  Jan 28 Diageo reported a 1.8 percent rise in half-year sales on Thursday  weighed down by foreign exchange rates and the sale of assets including its wine business.",
        "date": "01282016",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo posts 1.8 percent rise in first-half sales "
    },
    {
        "content": "LONDON  Dec 16 Distill Ventures  part of spirits giant Diageo  on Wednesday said it has invested in Starward whisky  to help the Australian start-up boost its production and expand into new export markets.",
        "date": "12162015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "RPT-Diageo's Distill Ventures invests in Australia's Starward Whisky "
    },
    {
        "content": "* Has decided not to refer completed acquisition by Heineken N.V. Of some assets associated with Diageo Plc's beer business to a phase 2 investigation\u007f",
        "date": "12182015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "BRIEF-CMA says not to refer completed acquisition by Heineken of some assets of Diageo's beer business to phase 2 investigation "
    },
    {
        "content": "Dec 16 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Wednesday:",
        "date": "12162015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Says agreed acquisition of distribution rights to Diageo PLC's International Premium Spirits (IPS) brands in Nigeria",
        "date": "12142015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "BRIEF-Guinness Nigeria says agreed acquisition of distribution rights to Diageo Plc's IPS brands in Nigeria "
    },
    {
        "content": "* \u007fAppointment of Guinness Nigeria as exclusive distributor of its international premium spirits brands\u007f",
        "date": "12142015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-Guinness Nigeria to distribute Diageo's international premium spirits "
    },
    {
        "content": "* Received a total net cash consideration of c. Zar 2.5 billion (c. 117 million stg) for equity and debt positions sold in Sedibeng  DHN and NBL  Source text for Eikon:  Further company coverage:",
        "date": "12012015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "BRIEF-Diageo completes restructuring of South African operations "
    },
    {
        "content": "* Heineken completes restructuring of South African and Namibian operations",
        "date": "12012015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-Heineken completes restructuring of South African and Namibian operations "
    },
    {
        "content": "Dec 1 - The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "12012015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "PRESS DIGEST- British Business - Dec 1 "
    },
    {
        "content": "JOHANNESBURG  Nov 25 South Africa's Competition Tribunal on Wednesday approved a merger between London-based spirit maker Diageo and local firm Brandhouse Beverages.",
        "date": "11252015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "South Africa's competition watchdog approves Diageo  Brandhouse merger "
    },
    {
        "content": "JOHANNESBURG  Nov 25 South Africa's Competition Tribunal on Wednesday approved the purchase by London-based spirit maker Diageo of the 50 percent stake it did not have in local firm Brandhouse Beverages from beer maker Heineken .",
        "date": "11262015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "CORRECTED-South Africa's competition watchdog approves Diageo's acquisition of Brandhouse "
    },
    {
        "content": "NEW YORK  Nov 11 Diageo Plc is content with its portfolio following recent changes such as the sale of most of its wine business to Australia's Treasury Wine Estates and its brand swap for full control of Don Julio tequila  the company's chief executive officer said on Wednesday.",
        "date": "11122015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Diageo CEO pleased with portfolio in spirits and beer "
    },
    {
        "content": "LONDON  Nov 10 Diageo  the world's largest spirits company  reiterated its performance targets on Tuesday  ahead of a investor conference in New York.",
        "date": "11102015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo stands by outlook ahead of investor presentation "
    },
    {
        "content": "Diageo Plc   the world's largest spirits company  said on Thursday it had sold its wine interests in Argentina to Grupo Peñaflor for an undisclosed amount.",
        "date": "11052015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Diageo sells Argentina wine business to Grupo Peñaflor "
    },
    {
        "content": "Nov 5 Diageo Plc  the world's largest spirits company  said on Thursday it had sold its wine interests in Argentina to Grupo Peñaflor for an undisclosed amount.",
        "date": "11052015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "UPDATE 1-Diageo sells Argentina wine business to Grupo Peñaflor "
    },
    {
        "content": "Nov 5 Diageo Plc  the world's largest spirits company  said on Thursday it had sold its wine interests in Argentina to Grupo Peñaflor for an undisclosed amount.",
        "date": "11052015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo sells wine business in Argentina to Grupo Peñaflor "
    },
    {
        "content": "* Sells Argentinian wine interests to Grupo Peñaflor and appoints them as dedicated distributor for Diageo's spirits brands",
        "date": "11052015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-Diageo says to sell Argentinian wine interests to Grupo Peñaflor "
    },
    {
        "content": "MUMBAI India's largest spirits company United Spirits Ltd  the local arm of Britain's Diageo Plc  swung to profit in its fiscal second quarter helped by a one-off gain from a share sale  which also helped it reduce its debt.",
        "date": "11022015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "United Spirits swings to profit in Q2 after one-off gain "
    },
    {
        "content": "MUMBAI  Nov 2 India's largest spirits company United Spirits Ltd  the local arm of Britain's Diageo Plc  swung to profit in its fiscal second quarter helped by a one-off gain from a share sale  which also helped it reduce its debt.",
        "date": "11022015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "India's United Spirits swings to profit in Q2 after one-off gain "
    },
    {
        "content": "MUMBAI  Oct 28 India's United Spirits Ltd  will scale back its roster of more than 150 brands and focus on the faster-growing top end  hoping to bolster its fortunes in a market dominated by cheaper  local names.",
        "date": "10292015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "RPT-Diageo's India unit eyes high-end spirits to reverse market share loss "
    },
    {
        "content": "MUMBAI  Oct 28 India's United Spirits Ltd  will scale back its roster of more than 150 brands and focus on the faster-growing top end  hoping to bolster its fortunes in a market dominated by cheaper  local names.",
        "date": "10282015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo's India unit eyes high-end spirits to reverse market share loss "
    },
    {
        "content": "SYDNEY  Oct 19 Shares in Australia's Treasury Wine Estates Ltd jumped to a record on Monday as investors cheered its $552 million purchase of most of Diageo Plc's U.S. and British wine operations  along with plans to issue shares to fund the offer.",
        "date": "10192015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "UPDATE 1-Treasury Wine shares climb to record after deal to buy Diageo US  British assets "
    },
    {
        "content": "Oct 19 The following bids  mergers  acquisitions and disposals were reported by 1500 GMT on Monday:",
        "date": "10192015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "SYDNEY Australia's Treasury Wine Estates   the world's biggest standalone wine maker  said on Wednesday it had agreed to buy the majority of Diageo Plc's  U.S. and British wine operations for $552 million.",
        "date": "10132015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Treasury Wine to buy bulk of Diageo's UK  U.S. wine assets for $552 million "
    },
    {
        "content": "SYDNEY  Oct 14 Australia's Treasury Wine Estates   the world's biggest standalone wine maker  said on Wednesday it had agreed to buy the majority of Diageo Plc's  U.S. and British wine operations for $552 million.",
        "date": "10132015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "CORRECTED-UPDATE 1-Treasury Wine to buy bulk of Diageo's UK  U.S. wine assets for $552 mln "
    },
    {
        "content": "SYDNEY Australia's Treasury Wine Estates   the world's top standalone winemaker  will buy most of Diageo Plc's  U.S. and British wine unit for $552 million  making a second tilt at the U.S. market after its disastrous retreat two years ago.",
        "date": "10142015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Australia's Treasury Wine begins second U.S. tilt with Diageo buy-up "
    },
    {
        "content": "SYDNEY  Oct 14 Australian shares were poised to fall for a third straight session on Wednesday on worries about slowing growth in China and nerves ahead of U.S. earnings season.     The share price index futures fell 0.6 percent overnight to 5 161 points  sitting at a 41.9-point discount to the underlying S&P/ASX 200 index. The benchmark dropped 0.6 percent on Tuesday  receding further away from a recent six-week high.     Investors will watch Treasury Wines after it agreed to buy th",
        "date": "10132015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Australia shares set to fall for third straight day "
    },
    {
        "content": "LONDON Drinks group Diageo  has agreed the $552 million sale of its major wine interests to Treasury Wine Estates  it said on Wednesday  as part of its drive to shed non-core assets.",
        "date": "10142015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo sells U.S.  UK wine interests for $552 million "
    },
    {
        "content": "SYDNEY  Oct 14 Australia's Treasury Wine Estates   the world's biggest standalone wine maker  said on Wednesday it had agreed to buy the majority of Diageo Plc's  U.S. and British wine operations for $552 million.",
        "date": "10132015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Treasury Wine to buy bulk of Diageo's UK  U.S. assets for $552 mln "
    },
    {
        "content": "SYDNEY  Oct 14 Listed pub owner Australian Leisure and Entertainment Property Management Ltd said it plans to rebuff a A$773 million ($560 million) takeover approach from a private investment firm after receiving the informal bid on Wednesday.",
        "date": "10142015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Australian pub owner ALE knocks back $560 mln private equity approach "
    },
    {
        "content": "* Says order is scheduled for delivery during Q4 and continuing in H1 2016",
        "date": "10142015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-Thin Film Electronics receives pilot order from Diageo "
    },
    {
        "content": "LONDON  Oct 14 Drinks group Diageo has agreed the $552 million sale of its major wine interests to Treasury Wine Estates  it said on Wednesday  as part of its drive to shed non-core assets.",
        "date": "10142015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo sells US  UK wine interests for $552 million "
    },
    {
        "content": "LONDON  Oct 14 Britain's FTSE 100 index is seen opening down 54 to 62 points  or as much as 1 percent lower on Wednesday  according to financial bookmakers. For more on the factors affecting European stocks  please click on           * The blue-chip FTSE 100 index  was down 0.5 percent at 6 342.28 points at the close on Tuesday  weighed down by mining stocks following mixed Chinese economic data.           * CHINA - China's economy is set to remain in focus after consumer inflation i",
        "date": "10142015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "UK Stocks-Factors to watch on Wednesday October 14 "
    },
    {
        "content": "* Treasury shares in trading halt   (Recasts  updates quotes)",
        "date": "10142015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "UPDATE 2-Australia's Treasury Wine begins 2nd U.S. tilt with Diageo buy-up "
    },
    {
        "content": "LONDON  Oct 5 Diageo has hired Kathryn Mikells from Xerox as its new chief financial officer  it said on Monday  as the world's largest spirits company navigates its way through a downturn.",
        "date": "10052015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Xerox CFO Mikells moves to Diageo "
    },
    {
        "content": "* Mikells joins from Xerox Corporation  where she is currently CFO  a position she has held since May 2013  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom + 91 80 6749 1136)",
        "date": "10052015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-Diageo names Xerox's Kathryn Mikells as CFO "
    },
    {
        "content": "Diageo Plc   the world's largest spirits company  said it had sold its stakes in Jamaican brewer Desnoes & Geddes Ltd  and GAPL Pte Ltd  the majority owner of Malaysia's Guinness Anchor Berhad   to Heineken NV  for $780.5 million.",
        "date": "10072015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Diageo sells stakes in two brewers to Heineken for $780.5 million "
    },
    {
        "content": "Oct 7 Diageo Plc  the world's largest spirits company  said it had sold its stakes in Jamaican brewer Desnoes & Geddes Ltd and GAPL Pte Ltd  the majority owner of Malaysia's Guinness Anchor Berhad  to Heineken NV for $780.5 million.",
        "date": "10072015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "UPDATE 1-Diageo sells stakes in two brewers to Heineken for $780.5 mln "
    },
    {
        "content": "* Acquisition by Diageo of Heineken's 20 pct shareholding in Guinness Ghana Breweries Limited (GGBL) which will increase Diageo's shareholding in GGBL to 72.42 pct",
        "date": "10072015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "CORRECTED-BRIEF-Diageo buys interest in GGBL from Heineken "
    },
    {
        "content": "Oct 7 Diageo Plc  the world's largest spirits company  said it had sold its stakes in Jamaican brewer Desnoes & Geddes Ltd (D&G) and Malaysian beer producer Guinness Anchor Bhd to Heineken NV.",
        "date": "10072015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo sells stakes in Jamaican  Malaysian brewers to Heineken "
    },
    {
        "content": "* Heineken realigns ownership interests in Jamaica  Malaysia  Singapore and Ghana",
        "date": "10072015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-Heineken realigns ownership interests in Jamaica  Malaysia  Singapore and Ghana "
    },
    {
        "content": "NAIROBI  Oct 1 East African Breweries Limited (EABL) said on Thursday it had concluded the sale of one its subsidiaries  Central Glass Industries  to South Africa's Consol Glass Africa Proprietary.",
        "date": "10012015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "East African Breweries sells glass subsidiary "
    },
    {
        "content": "** Spirits stocks up between 2-20 pct after Anheuser-Busch InBev announces planned offer for SABMiller",
        "date": "09162015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "BUZZ-European beverage sector: in high spirits "
    },
    {
        "content": "* Year has started well and performance is in line with our expectations.",
        "date": "09232015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "BRIEF-Diageo says performing in line with expectations "
    },
    {
        "content": "* Calls FY '16 \"transition year\" followed by growth through FY '19",
        "date": "07302015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "UPDATE 1-Diageo signals turnaround after another flat year "
    },
    {
        "content": "Shell to axe 6 500 jobs  cut spending to cope with lower oil prices",
        "date": "07302015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Reuters Business News Schedule at 0830 GMT/0430 AM ET "
    },
    {
        "content": "LONDON  July 30 Diageo  the world's largest spirits company  posted flat full-year sales and weaker-than-expected earnings on Thursday  after grappling for months with problems such as wholesaler destocking and pricing pressure in vodka.",
        "date": "07302015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo full-year sales flat "
    },
    {
        "content": "LONDON/BRUSSELS  July 28 Diageo and Heineken have agreed to dissolve their joint ventures in South Africa and Namibia  so the British spirits maker and Dutch brewer can pursue their own growth strategies in the countries.",
        "date": "07282015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "UPDATE 1-Heineken  Diageo end joint ventures in South Africa  Namibia "
    },
    {
        "content": "BRUSSELS  July 28 Dutch brewer Heineken  and spirits maker Diageo have agreed to end their 11-year cooperation in South Africa and Namibia in a series of deals to disentangle joint ventures.",
        "date": "07282015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Heineken  Diageo end joint ventures in South Africa  Namibia "
    },
    {
        "content": "* Announces restructuring of South African and Namibian operations",
        "date": "07282015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-Heineken announces restructuring of South African and Namibian operations "
    },
    {
        "content": "* To sell its 42.25 pct equity stake in DHN Drinks (proprietary) Limited and transfer associated shareholder loan to Heineken",
        "date": "07282015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-Diageo says restructuring S.African and Namibian operations "
    },
    {
        "content": "LONDON  July 24 British spirits maker Diageo  is under scrutiny in the United States  where the U.S. Securities and Exchange Commission (SEC) has asked for information to see whether it shipped excess inventory to U.S. distributors  a practice known as \"channel stuffing\".",
        "date": "07242015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "UPDATE 2-U.S. watchdog questions Smirnoff maker Diageo's U.S. distribution "
    },
    {
        "content": "The U.S. Securities and Exchange Commission is investigating if liquor company Diageo Plc has been shipping excess inventory to distributors to boost its results  the Wall Street Journal reported  citing people familiar with the inquiry.",
        "date": "07232015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "SEC investigating Smirnoff maker Diageo's U.S. distribution: WSJ "
    },
    {
        "content": "July 23 The U.S. Securities and Exchange Commission is investigating if liquor company Diageo Plc   has been shipping excess inventory to distributors to boost its results  the Wall Street Journal reported  citing people familiar with the inquiry.",
        "date": "07232015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "UPDATE 1-SEC investigating Smirnoff maker Diageo's U.S. distribution - WSJ "
    },
    {
        "content": "July 23 The U.S. Securities and Exchange Commission is investigating if liquor company Diageo Plc  has been shipping excess inventory to distributors to boost its results  the Wall Street Journal reported  citing people familiar with the inquiry.",
        "date": "07232015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "SEC investigating Smirnoff maker Diageo's U.S. distribution - WSJ "
    },
    {
        "content": "* Has sold Gleneagles hotel limited to a private investment group led by Ennismore for an undisclosed amount",
        "date": "07012015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "BRIEF-Diageo sells Gleneagles Hotel to Ennismore-led group "
    },
    {
        "content": "* Diageo announces that Deirdre Mahlan is to be appointed President  Diageo North America",
        "date": "06302015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "BRIEF-Diageo appoints CFO Mahlan as president of North America ops "
    },
    {
        "content": "* Announced that Larry Schwartz  President Diageo North America  will retire by end of calendar year",
        "date": "06152015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "BRIEF-Diageo says Larry Schwartz to retire "
    },
    {
        "content": "LONDON  June 8 Britain's top share index edged lower and finished near the previous session's two-week low  with sharp gains in Diageo on a reported takeover interest offset by weaker firms like Shire and GKN",
        "date": "06082015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Britain's FTSE edges lower at close  Diageo surges "
    },
    {
        "content": "LONDON  June 8 Britain's top share index steadied on Monday  with gains in Diageo on a reported takeover interest offset by weaker firms like Shire  which fell on another report saying it was considering an $18 billion takeover of Actelion.",
        "date": "06082015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "FTSE steadies around 2-month low  Diageo shares surge "
    },
    {
        "content": "MONTREAL  June 7 Former Diageo boss Paul Walsh has not joined the Formula One Group as a non-executive director despite the appointment being announced last year  Bernie Ecclestone said on Sunday.",
        "date": "06072015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Motor racing-Walsh was not offered F1 role  says Ecclestone "
    },
    {
        "content": "LONDON  June 8 Britain's top share index steadied on Monday  with gains in Diageo on a reported takeover interest offset by weaker firms like Shire that fell on another report saying it was considering a $18 billion takeover of Actelion.",
        "date": "06082015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Britain's FTSE steadies near 2-month low  Diageo surges "
    },
    {
        "content": "LONDON  June 8 Shares in Diageo Plc  the world's largest spirits maker  rose about 7 percent on Monday following a report in the Brazilian press saying private equity firm 3G Capital was considering a bid for it.",
        "date": "06082015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo shares surge on report of possible takeover interest "
    },
    {
        "content": "* Shire dips after Sunday Times says considering Actelion bid",
        "date": "06082015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "CORRECTED-UK FTSE rises from two-month low on Diageo M&A talk "
    },
    {
        "content": "LONDON  June 8 European shares fell on Monday  weighed down by a drop in agrochemicals group Syngenta  although Deutsche Bank outperformed to surge higher after boardroom changes.",
        "date": "06082015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Deutsche Bank and Diageo outperform weaker European stock markets "
    },
    {
        "content": "BRASILIA Brazilian billionaire Jorge Paulo Lemann and his partners in private equity firm 3G Capital are considering a potential bid for Diageo PLC  the world's largest producer of spirits  the Brazilian newsweekly Veja reported on Friday.",
        "date": "06052015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Brazil billionaire Lemann studies bid for Diageo: report "
    },
    {
        "content": "(The following statement was released by the rating agency) MOSCOW/MILAN/LONDON  May 18 (Fitch) Fitch Ratings has revised Diageo plc's  (Diageo) Outlook to Negative from Stable. Its Long-term Issuer Default Rating  (IDR) and senior unsecured rating have been affirmed at 'A-' and its Short-term  IDR at 'F2'. Diageo's subsidiaries'  Diageo Finance BV  Diageo Finance plc   Diageo Capital plc and Diageo Investment Corporation  senior unsecured ratings  have also been affirmed at 'A-'/'F2'. The revis",
        "date": "05182015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Fitch Revises Diageo's Outlook to Negative; Affirms at 'A-' "
    },
    {
        "content": "MUMBAI  April 27 The board of Indian spirits maker United Spirits Ltd  majority-owned by Britain's Diageo Plc  has begun a procedure to remove its chairman and former owner Vijay Mallya due to alleged financial irregularities in the company.",
        "date": "04272015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo-owned India firm moves to oust chairman after audit "
    },
    {
        "content": "* Diageo will now consider its position under its agreements with Dr Mallya and United Breweries (Holdings) Limited",
        "date": "04272015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-Diageo to consider its position on United Spirits chairman Vijay Mallya "
    },
    {
        "content": "LONDON Diageo Plc   the world's largest spirits maker  reported a drop in quarterly sales on Thursday despite an improvement North America  hurt by challenges in several emerging markets.",
        "date": "04162015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Diageo shares drop after quarterly sales decline "
    },
    {
        "content": "* Shares down more than 2 pct   (Adds analyst comment  details  byline)",
        "date": "04162015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "UPDATE 2-Diageo shares drop after quarterly sales decline "
    },
    {
        "content": "LONDON  April 16 European equities retreated from a 14-year high on Thursday  with media stocks leading the market lower after Pearson fell sharply following troubles with one of its educational technology projects.",
        "date": "04162015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Media stocks drag down European equities from highs "
    },
    {
        "content": "LONDON  April 16 Britain's top share index touched a record high  then retreated on Thursday  as mixed results at consumer-goods companies led to a pause in the market's rally.",
        "date": "04162015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo and BAE fall as UK's FTSE backs off from record high "
    },
    {
        "content": "LONDON  April 16 Britain's top share index touched a new record high before turning lower on Thursday  with mixed corporate earnings in the consumer staple sector prompting a pause in an impressive year-to-date rally.",
        "date": "04162015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Britain's FTSE pauses at new record high "
    },
    {
        "content": "PARIS  April 16 European stocks slipped in early trading on Thursday  halting their recent sharp rally  with shares in Diageo dropping after it posted a fall in sales.",
        "date": "04162015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "European shares halt rally; Diageo dips after sales fall "
    },
    {
        "content": "LONDON  April 16 Diageo  the world's largest spirits maker  reported  slower quarterly trading on Thursday  hurt by tough comparisons in Britain and retailers reducing inventory in Southeast Asia.",
        "date": "04162015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo quarterly sales fall "
    },
    {
        "content": "* Andy Fennell  currently president  Diageo Africa and a member of executive committee since 2008  is leaving Diageo at end of current fiscal year",
        "date": "04162015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "BRIEF-Diageo appoints John O'Keeffe president of Diageo Africa "
    },
    {
        "content": "April 2 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Thursday:",
        "date": "04022015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "LONDON  April 2 Diageo  the world's largest spirits maker  said on Thursday it had agreed to acquire control of United National Breweries beer business in South Africa  buying the remaining 50 percent stake it did not already own.",
        "date": "04022015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo snaps up rest of United National Breweries beer business "
    },
    {
        "content": "LONDON  March 25 Britain's leading share index rose towards its record high on Wednesday  with tour firm TUI Group gaining on expectations of meeting its profit growth target and companies including Diageo and Next rising on positive broker comments.",
        "date": "03252015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "FTSE edges up towards record high  strong growth outlook boosts TUI "
    },
    {
        "content": "LONDON  March 13 Britain's top share index slipped on Friday to suffer its biggest weekly fall so far this year  after a drop in utility stocks compounded weakness in energy shares.",
        "date": "03132015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "UK's FTSE 100 falls and has worst week in 2015 "
    },
    {
        "content": "LONDON  March 13 Britain's top share index slipped on Friday and looked set for its biggest weekly fall so far this year after a drop in utility stocks compounded weakness in energy shares.",
        "date": "03132015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Britain's FTSE falls  on track for biggest weekly loss of 2015 "
    },
    {
        "content": "LONDON  March 13 Britain's top share index edged lower on Friday and looked headed for its biggest weekly fall so far this year after a drop in utility stocks compounded weakness in commodity-related shares.",
        "date": "03132015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Britain's FTSE dips  on track for biggest weekly loss of 2015 "
    },
    {
        "content": "LONDON  Jan 29 Diageo  the world's largest spirits maker  reported lower-than-expected sales for the six months to December  hurt  by foreign exchange rate moves and discounting on vodka in the United States  its biggest and most profitable market.",
        "date": "01292015",
        "name": "Diageo plc",
        "news_type": "topStory",
        "symbol": "DEO",
        "title": "UPDATE 1-Diageo posts lower-than-expected sales "
    },
    {
        "content": "LONDON  Jan 29 Diageo  the world's largest spirits maker  reported lower-than-expected sales for the six months to December  hurt  by foreign exchange rates and intensified discounting on vodka in the United States  its biggest and most profitable market.",
        "date": "01292015",
        "name": "Diageo plc",
        "news_type": "normal",
        "symbol": "DEO",
        "title": "Diageo posts lower-than-expected sales "
    }
]