[
    {
        "content": "* Clinical Genomics and Quest Diagnostics announce FDA 510(k) clearance of Insure® One™",
        "date": "11132017",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-FDA approves Clinical Genomics  Quest Diagnostics Insure One "
    },
    {
        "content": "* Quest Diagnostics acquires California Laboratory Associates",
        "date": "10302017",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics acquires certain assets of California Laboratory Associates "
    },
    {
        "content": "* Advantage Capital Portfolio company Cleveland Heartlab  Inc acquired by Quest Diagnostics",
        "date": "10192017",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Advantage Capital Portfolio company Cleveland Heartlab acquired by Quest Diagnostics "
    },
    {
        "content": "* Quest Diagnostics reports third quarter 2017 financial results  updates 2017 financial guidance and reaffirms long term outlook",
        "date": "10192017",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "normal",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics reports Q3 diluted eps of $1.15 "
    },
    {
        "content": "* Deal to generate modest book gain for Fresenius Medical Care",
        "date": "09282017",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Fresenius Medical Care says divests Shiel Medical Laboratory to Quest Diagnostics "
    },
    {
        "content": "* Quest Diagnostics provides update on impact to third quarter financial results from hurricanes",
        "date": "09272017",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics provides update on impact to 3rd quarter financial results from hurricanes "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 27 (Fitch) Fitch Ratings has affirmed the ratings of Quest Diagnostics Incorporated (NYSE: DGX) including the Issuer Default Rating (IDR) at 'BBB'. The Rating Outlook is Stable. A full list of ratings can be found at the end of the release. KEY RATING DRIVERS Leading Market Position: Quest is the largest independent player as measured by segment revenues in the relatively fragmented and highly competitive U.S. clinic",
        "date": "09272017",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "normal",
        "symbol": "DGX",
        "title": "Fitch Affirms Quest Diagnostics at 'BBB'; Outlook Stable "
    },
    {
        "content": "Sept 7 Quest Diagnostics Inc said on Thursday it will begin using a more precise method of calculating levels of \"bad\" LDL cholesterol that no longer requires fasting prior to blood draw  a development likely to delight patients who previously had to refrain from eating for up to 12 hours before testing.",
        "date": "09072017",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "normal",
        "symbol": "DGX",
        "title": "Quest to offer cholesterol testing without fasting requirement "
    },
    {
        "content": "* Quest Diagnostics announces intent to acquire Cape Cod Healthcare outreach laboratory business in Massachusetts",
        "date": "06272017",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics to acquire Cape Cod Healthcare outreach laboratory business "
    },
    {
        "content": "* FY2017 earnings per share view $5.46 -- Thomson Reuters I/B/E/S",
        "date": "04202017",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics reports Q1 revenue of $1.9 bln "
    },
    {
        "content": "* Vermillion -  co  unit entered amendment no. 2 to testing and services agreement with quest diagnostics incorporated effective March 11  2017",
        "date": "03132017",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Vermillion say co  unit entered amendment No. 2 to testing  services agreement with Quest Diagnostics effective March 11  2017 "
    },
    {
        "content": "* QUEST DIAGNOSTICS AND PEACEHEALTH FORMED TWO-PART ARRANGEMENT TO ENHANCE DELIVERY OF LABORATORY SERVICES TO COMMUNITIES IN OREGON  WASHINGTON  ALASKA",
        "date": "02152017",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-QUEST DIAGNOSTICS SAYS WILL ACQUIRE OUTREACH LABORATORY SERVICES OPERATIONS OF PEACEHEALTH LABORATORIES "
    },
    {
        "content": "* Quest Diagnostics Partners with Montefiore Health System to deliver high-value  innovative laboratory services",
        "date": "01262017",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics Partners with Montefiore Health System to deliver high-value  innovative laboratory services "
    },
    {
        "content": "* Launches hepatitis b virus quantitative test to help assess response to antiviral therapy  Source text for Eikon:  Further company coverage:",
        "date": "01182017",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics launches hepatitis b virus quantitative test "
    },
    {
        "content": "* Quest Diagnostics has raised its common stock dividend by 12.5 pct to an annual rate of $1.80 per share",
        "date": "11112016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest diagnostics raises revenue growth outlook and increases dividend "
    },
    {
        "content": "* Presents The Initial Results Of The Pilot Study Undertaken With Quest Diagnostics In Spinal Muscular Atrophy (SMA) At The Ashg 2016 Annual Meeting In Vancouver   Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "10202016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Genomic Vision presents initial results of the pilot study undertaken with Quest Diagnostics in SMA "
    },
    {
        "content": "* Quest Diagnostics launches zika antibody test service  based on CDC MAC-ELISA antibody test",
        "date": "09212016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics launches zika antibody test service based on CDC MAC-ELISA antibody test "
    },
    {
        "content": "NEW YORK  Sept 13 UnitedHealth Group Inc.  will fold most of Quest Diagnostics Inc's  customer billing into its Optum unit  including taking on 2 400 of the lab company's employees  increasing Optum's business for such services by 20 percent.",
        "date": "09132016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "normal",
        "symbol": "DGX",
        "title": "UnitedHealth unit signs deal to take over most Quest billing "
    },
    {
        "content": "* Optum and Quest Diagnostics partner to help make the health system work better for patients  physicians  health plans and employers",
        "date": "09132016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "normal",
        "symbol": "DGX",
        "title": "BRIEF-Optum and Quest Diagnostics partner to help make health system work better "
    },
    {
        "content": "* Oxford Immunotec announces favorable recommendation by the magistrate judge in patent infringement litigation",
        "date": "09012016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Oxford Immunotec announces favorable recommendation by the magistrate judge "
    },
    {
        "content": "* Quest Diagnostics approved to use electronic drug test process for federally-mandated workforce by U.S. Health and Human Services",
        "date": "08182016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics approved to use electronic drug test process for federally-mandated workforce by U.S. Health and Human Services "
    },
    {
        "content": "* Co and ancestrydna collaborate to expand consumer dna testing; additional terms of deal were not disclosed  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "08032016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics  AncestryDNA collaborate on consumer DNA testing "
    },
    {
        "content": "* Quest diagnostics reports second quarter 2016 financial results",
        "date": "07212016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics Q2 earnings $1.37/ share "
    },
    {
        "content": "* Quest diagnostics to relocate headquarters to 500 plaza drive in Secaucus  NJ  Source text for Eikon:  Further company coverage:",
        "date": "06202016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest diagnostics quest to relocate headquarters to 500 plaza drive in Secaucus  NJ "
    },
    {
        "content": "* Quest Diagnostics to relocate corporate headquarters  consolidate office facilities  in New Jersey",
        "date": "06062016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics to relocate headquarters to New Jersey "
    },
    {
        "content": "* Says if takeover offer by QIAGEN N.V fails  Exiqon risks short-term profitability and plans for a capital increase to accelerate Life Sciences strategy",
        "date": "05242016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Exiqon says if QIAGEN takeover offer fails  co risks short-term profitability "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  May 23 (Fitch) Fitch Ratings has assigned a 'BBB' rating to Quest  Diagnostics Inc.'s (Quest; NYSE: DGX) USD500 million 10-year senior notes  offering. Fitch expects that the net proceeds from the offering will be used to  repay outstanding indebtedness under the company's senior unsecured revolving  credit facility and its secured receivables credit facility and for general  corporate purposes. The Rating Outlook is Stable. K",
        "date": "05232016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "Fitch Rates Quest's Senior Notes 'BBB'; Outlook Stable "
    },
    {
        "content": "* Entered into an accelerated share repurchase agreement to repurchase approximately $250 million of company's common stock",
        "date": "05202016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics entered into an accelerated share repurchase agreement to repurchase about  $250 mln common stock "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  May 20 (Fitch) Fitch Ratings has affirmed the ratings of Quest  Diagnostics Inc. (Quest; NYSE: DGX) at 'BBB'. The Rating Outlook is Stable. KEY RATING DRIVERS --Quest is the largest independent player in the relatively fragmented and  highly competitive U.S. clinical laboratory market. Such scale affords the  opportunity for comparatively efficient operations and supplies sourcing and the  ability to drive associated margin im",
        "date": "05202016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "normal",
        "symbol": "DGX",
        "title": "Fitch Affirms Quest Diagnostics' Ratings at 'BBB'; Outlook Stable "
    },
    {
        "content": "* Files for potential debt shelf  size undisclosed - SEC filing  Source text http://1.usa.gov/1TC6FsZ Further company coverage:",
        "date": "05132016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics files for potential debt shelf offering - SEC filing "
    },
    {
        "content": "* Received U.S. FDA emergency use authorization (EUA) for the Zika virus RNA qualitative real-time RT-PCR test",
        "date": "04282016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics gets FDA emergency use authorization for Zika test "
    },
    {
        "content": "* Quest diagnostics reports first quarter 2016 financial results",
        "date": "04212016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics reports Q1 adjusted earnings per share $1.12 "
    },
    {
        "content": "* CEO Stephen H. Rusckowski's FY 2015 total compensation was $9.7 million versus $9.3 million in FY 2014 - SEC Filing",
        "date": "04072016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics CEO's 2015 total compensation was $9.7 mln vs $9.3 mln in 2014 - SEC Filing "
    },
    {
        "content": "* Quest Diagnostics announces pricing of cash tender offers for up to $200 million combined aggregate principal amount of certain of its outstanding notes",
        "date": "03282016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-Quest Diagnostics announces pricing of cash tender offers for up to $200 mln "
    },
    {
        "content": "* Enters agreement with Quest Diagnostics (Quest) to buy its Focus Diagnostics  Inc. immunodiagnostic and molecular diagnostic products business",
        "date": "03302016",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "BRIEF-DiaSorin to buy Focus Diagnostics immunodiagnostic and molecular diagnostic products business "
    },
    {
        "content": "NEW YORK  May 22 Quest Diagnostics Inc  shares jumped to a record high on heavy volume on Friday following chatter on Twitter and elsewhere that the lab testing company may be trying to sell itself.",
        "date": "05222015",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "UPDATE 1-Quest Diagnostics shares hit record high on takeover speculation "
    },
    {
        "content": "NEW YORK  May 22 Quest Diagnostics Inc  shares jumped on heavy volume on Friday following chatter on Twitter and elsewhere that the lab testing company may be trying to sell itself.",
        "date": "05222015",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "normal",
        "symbol": "DGX",
        "title": "Quest Diagnostics shares up on takeover speculation "
    },
    {
        "content": "Thomson Reuters May 15  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.             ** For",
        "date": "05152015",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "normal",
        "symbol": "DGX",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "NEW YORK  April 21 Quest Diagnostics Inc   the world's largest provider of diagnostic testing services  is working with France's national health agency to build an expanded database for BRCA1 and BRCA2 gene mutations to better determine patient hereditary risks of breast and ovarian cancer.",
        "date": "04212015",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "normal",
        "symbol": "DGX",
        "title": "Quest Diagnostics  French agency seek to expand breast cancer gene database "
    },
    {
        "content": "Medical tests maker Quest Diagnostics Inc and contract research company Quintiles Transnational Holdings Inc said they were combining their clinical trial laboratory operations in a joint venture.",
        "date": "03312015",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "Quintiles  Quest to combine clinical trial lab operations "
    },
    {
        "content": "March 31 Medical tests maker Quest Diagnostics Inc and contract research company Quintiles Transnational Holdings Inc said they were combining their clinical trial laboratory operations in a joint venture.",
        "date": "03312015",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "normal",
        "symbol": "DGX",
        "title": "UPDATE 1-Quintiles  Quest to combine clinical trial lab operations "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 05 (Fitch) Fitch Ratings has assigned a 'BBB' rating to the $1.2  billion bond offering by Quest Diagnostics Inc. (Quest; NYSE: DGX). The Rating  Outlook is Stable. A full list of ratings follows at the end of this release. Fitch expects the bond proceeds  as well as internal liquidity sources  to be  used to repay up to $1 275 million of outstanding debt and associated fees  during 2015  including: --$500 million of 5.45",
        "date": "03052015",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "Fitch Rates Quest Diagnostics' Bond Offering 'BBB'; Outlook Stable "
    },
    {
        "content": "Quest Diagnostics and Myriad Genetics have settled their patent dispute over genetic testing technology used to detect breast cancer.",
        "date": "02092015",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "Myriad  Quest settle dispute over genetic cancer test "
    },
    {
        "content": "Laboratory testing company Quest Diagnostics Inc said on Tuesday it had signed a $520 000 agreement with the Centers for Disease Control and Prevention to identify trends in screening  diagnosis and treatment of four strains of viral hepatitis.",
        "date": "01272015",
        "name": "Quest Diagnostics Incorporated",
        "news_type": "topStory",
        "symbol": "DGX",
        "title": "Quest in broad deal with CDC for hepatitis analysis "
    }
]