[
    {
        "content": "Twenty-First Century Fox Inc shares were up 3 percent in trading on Friday after sources said both Comcast Corp and Verizon Communications Inc were interested in buying parts of its studio and TV operations. | Video ",
        "date": "11172017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Fox shares rise on signs of more takeover interest "
    },
    {
        "content": "Nov 17 Twenty-First Century Fox Inc shares were up 3 percent in trading on Friday after sources said both Comcast Corp and Verizon Communications Inc were interested in buying parts of its studio and TV operations.",
        "date": "11172017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Fox shares rise on signs of more takeover interest "
    },
    {
        "content": "Nov 17 Twenty-First Century Fox Inc shares jumped 8 percent in premarket trading on Friday after sources said both Comcast Corp and Verizon Communications Inc were also interested in buying parts of its studio and TV operations.",
        "date": "11172017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Fox shares jump on signs of more takeover interest "
    },
    {
        "content": "* Comcast is interested in same set of assets that Disney approached Fox about - CNBC  citing sources‍​ Source text: http://cnb.cx/2zO4KQW Further company coverage:",
        "date": "11162017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Comcast interested in same set of assets that Disney approached Fox about - CNBC "
    },
    {
        "content": "* AlarmForce and BCE update terms of arrangement to facilitate transfer of shares through a Holdco alternative",
        "date": "11152017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-AlarmForce and BCE update terms of arrangement to facilitate transfer of shares "
    },
    {
        "content": "LOS ANGELES  Nov 9 The galaxy far  far away is expanding further on screen with a new trilogy of \"Star Wars\" films outside of the ongoing Skywalker saga  Walt Disney Co said Thursday  to be overseen by Rian Johnson  the director of the franchise's upcoming film \"The Last Jedi.\"",
        "date": "11092017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "UPDATE 1-'Last Jedi' director Rian Johnson to oversee new 'Star Wars' trilogy "
    },
    {
        "content": "Wall Street stocks dropped on Thursday  weighed down by losses in Microsoft and other technology issues  as investors turned their attention to a U.S. Senate Republican plan that would delay expected corporate tax cuts. | Video ",
        "date": "11092017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Tech stocks tug Wall Street lower; investors fret about U.S. tax cut delays "
    },
    {
        "content": "LOS ANGELES If Walt Disney Co  buys some Twenty-First Century Fox  businesses  it could provide a quick path for the traditional media giant to create a substantial competitor to Netflix Inc  in the battle for TV and movie viewers.",
        "date": "11082017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Fox in the Mouse House could give Disney an edge in streaming wars "
    },
    {
        "content": "LOS ANGELES  Nov 9 The galaxy far  far away is expanding further on screen with a new trilogy of \"Star Wars\" films outside of the ongoing Skywalker saga  Walt Disney Co said Thursday  to be overseen by Rian Johnson  the director of the franchise's upcoming film \"The Last Jedi.\"",
        "date": "11092017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "'Last Jedi' director Rian Johnson to oversee new 'Star Wars' trilogy "
    },
    {
        "content": "Nov 8 Twenty-First Century Fox Inc's quarterly revenue topped market estimates on Wednesday as higher sales from traditional and online distributors boosted its cable business.",
        "date": "11082017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-Twenty-First Century Fox's quarterly revenue beats Street "
    },
    {
        "content": "* The Walt Disney Company reports fourth quarter and full year earnings for fiscal 2017",
        "date": "11092017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney Co posts Q4 adj. earnings per share $1.07 "
    },
    {
        "content": "Nov 8 Rupert Murdoch's Twenty-First Century Fox Inc reported a 7.6 percent rise first-quarter revenue on Wednesday  as higher advertising sales boosted its cable business.",
        "date": "11082017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Twenty-First Century Fox's first-quarter revenue rises "
    },
    {
        "content": "Nov 9 Walt Disney Co reported a 2.8 percent drop in quarterly revenue on Thursday  weighed down by the lack of any major box office releases  sending the company's shares down about 3 percent in extended trading.",
        "date": "11092017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney reports 2.8 percent fall in quarterly revenue "
    },
    {
        "content": "* Unit China Re Finance entered into a Holdco contribution and subscription agreement​",
        "date": "11092017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-China Reinsurance Group says unit China Re Finance entered into a Holdco contribution and subscription agreement​ "
    },
    {
        "content": "LONDON Investor Crispin Odey said he opposed Twenty-First Century Fox's  $15 billion bid for Sky  after a report of separate talks between Rupert Murdoch and Walt Disney Co  added more uncertainty to a takeover facing regulatory hurdles. | Video ",
        "date": "11072017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Sky investor Odey opposes Fox bid as Disney talks fuel uncertainty "
    },
    {
        "content": "* Fox bid for Sky undergoing regulatory review (Writes through with comments from investor Odey)",
        "date": "11072017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Sky investor Odey opposes Fox bid as Disney talks fuel uncertainty "
    },
    {
        "content": "LONDON  Nov 7 A report that Rupert Murdoch held talks about selling film and television assets to Walt Disney Co added another layer of uncertainty to his $14.5 billion bid to buy all of Britain's Sky.",
        "date": "11072017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Sky falls as report of Disney-Fox talks increase deal uncertainty "
    },
    {
        "content": "Nov 7 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "11072017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "PRESS DIGEST- Wall Street Journal - Nov 7 "
    },
    {
        "content": "Nov 7 The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "11072017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "PRESS DIGEST- Financial Times - Nov 7 "
    },
    {
        "content": "Rupert Murdoch's Twenty-First Century Fox has held talks to sell most of its film and television assets to Walt Disney Co  which would gain new programming and expand its international reach  CNBC reported on Monday.",
        "date": "11062017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Fox held talks to sell most of company to Disney: CNBC "
    },
    {
        "content": "Nov 6 Rupert Murdoch's Twenty-First Century Fox has held talks to sell most of its film and television assets to Walt Disney Co  which would gain new programming and expand its international reach  CNBC reported on Monday.",
        "date": "11062017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 5-Fox held talks to sell most of company to Disney -CNBC "
    },
    {
        "content": "Nov 10 Walt Disney's shares rose 3 percent on Friday  as Wall Street shrugged off poor financial results and focused instead on the media giant's commitment to build a service that will compete aggressively with video streaming pioneer Netflix.",
        "date": "11102017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney shares rise as focus turns to streaming commitment "
    },
    {
        "content": "* Rag & Bone announces new collaboration with Disney and Lucasfilm Source text for Eikon: Further company coverage:",
        "date": "11062017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Rag & Bone announces new collaboration with Disney and Lucasfilm "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Netflix is pushing over-the-top thinking. Walt Disney may be mulling a bid for Rupert Murdoch’s film studio and cable networks. A deal would reduce Twenty-First Century Fox to news and sports assets while helping the Magic Kingdom bulk up to fight the video-streaming network.",
        "date": "11062017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Breakingviews - Disney-Fox mashup would truly be over the top "
    },
    {
        "content": "Nov 6 Twenty-First Century Fox has held talks to sell most of the company to Walt Disney Co  CNBC reported on Monday  citing people familiar with the matter.",
        "date": "11062017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Fox held talks to sell most of company to Disney - CNBC "
    },
    {
        "content": "LOS ANGELES The galaxy far  far away is expanding further on screen with a new trilogy of \"Star Wars\" films outside of the ongoing Skywalker saga  Walt Disney Co said Thursday  to be overseen by Rian Johnson  the director of the franchise's upcoming film \"The Last Jedi.\" | Video ",
        "date": "11102017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "'Last Jedi' director Rian Johnson to oversee new 'Star Wars' trilogy "
    },
    {
        "content": "* 21st Ccentury Fox has been holding talks to sell most of the company to Disney- CNBC  citing sources Source text : http://cnb.cx/2izdPoq",
        "date": "11062017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-21St Century Fox holding talks to sell most of company to Disney- CNBC "
    },
    {
        "content": "* Indexes down: Dow 0.19 pct  S&P 0.24 pct  Nasdaq 0.22 pct (Adds details  changes comment  updates prices)",
        "date": "11102017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St falls on tax bill worries; media stocks climb "
    },
    {
        "content": "Nov 10 The S&P and the Nasdaq were lower at the open on Friday as investors worried about a delay in corporate tax cuts  while losses on the Dow were limited by a rise in Walt Disney's shares.",
        "date": "11102017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS SNAPSHOT-Wall St opens lower on worries over delay in tax cuts "
    },
    {
        "content": "The force of \"Star Wars\" lifted Walt Disney Co  shares on Thursday as the promise of a new film trilogy overshadowed disappointing quarterly results and struggles at the media company's television business. | Video ",
        "date": "11102017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "New 'Star Wars' trilogy raises hopes after Disney results miss target "
    },
    {
        "content": "Nov 9 The force of \"Star Wars\" lifted Walt Disney Co shares on Thursday as the promise of a new film trilogy overshadowed disappointing quarterly results and struggles at the media company's television business.",
        "date": "11102017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 4-New 'Star Wars' trilogy raises hopes after Disney results miss target "
    },
    {
        "content": "NEW YORK  Oct 26 American International Group Inc on Thursday sued Walt Disney Co to avoid having to reimburse the parent of ABC News for part of a settlement of a meat producer's defamation lawsuit over a product that critics call \"pink slime.\"",
        "date": "10262017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "AIG sues Disney to avoid paying 'pink slime' settlement costs "
    },
    {
        "content": "Oct 16 Netflix Inc added more subscribers than expected around the world in the third quarter and projected growth in line with Wall Street forecasts  saying it had a head start on rivals as internet television explodes globally.",
        "date": "10172017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 3-Netflix adds more subscribers than expected  shares hit record "
    },
    {
        "content": "Walt Disney Co  plans to cut about 200 jobs at unit ABC and other cable networks  according to a source familiar with the matter.",
        "date": "10122017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney to cut about 200 jobs at its TV networks: source "
    },
    {
        "content": "Oct 12 Walt Disney Co plans to cut about 200 jobs at unit ABC and other cable networks  according to a source familiar with the matter.",
        "date": "10122017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney to cut about 200 jobs at its TV networks - source "
    },
    {
        "content": "LOS ANGELES  Oct 11 Five Hollywood film studios have joined together to offer a new service designed to make it easier for consumers to collect digital movies that they can watch at home or on mobile devices  the studios said in a statement on Wednesday.",
        "date": "10122017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Movie studios join Disney-led service to link digital purchases "
    },
    {
        "content": "* ‍ZENITH DIRECTORS  BIDCO REACHED AGREEMENT ON RECOMMENDED FINAL CASH OFFERS FOR ENTIRE ISSUED AND TO BE ISSUED SHARE CAPITAL OF ZENITH​",
        "date": "10102017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Bain Capital funds make final offer Zenith Hygiene Group "
    },
    {
        "content": "LOS ANGELES Marvel's big green Hulk may not be getting his own standalone movie but actor Mark Ruffalo  who plays the current iteration of the superhero  said the character will get a mini arc within three upcoming Marvel movies. | Video ",
        "date": "10122017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Battle with Thor kicks off three-movie arc for Marvel's Hulk "
    },
    {
        "content": "LOS ANGELES  Oct 1 Walt Disney Co and cable operator Altice USA reached a programming deal that keeps ESPN and other channels on the air as the two companies finalize details on a new contract  both sides said in a statement on Sunday.",
        "date": "10012017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney  Altice reach tentative programming deal "
    },
    {
        "content": "TORONTO Walt Disney Co  sold C$1.25 billion of seven-year senior unsecured Maple notes on Tuesday  the company's first issue in the Canadian-dollar denominated Maple bond market  which has seen a number of high profile deals in recent months.",
        "date": "10032017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Walt Disney makes Maple bond debut with C$1.25 billion deal "
    },
    {
        "content": "TORONTO  Oct 3 Walt Disney Co sold C$1.25 billion of seven-year senior unsecured Maple notes  the company's first issue in the Canadian-dollar denominated Maple bond market  Thomson Reuters IFR reported on Tuesday.",
        "date": "10032017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Walt Disney sells C$1.25 bln of 7-year senior unsecured Maple notes "
    },
    {
        "content": "LOS ANGELES  Oct 5 Walt Disney Co and cable operator Altice USA have finalized a new multiyear programming agreement that keeps ESPN and other networks in millions of New York-area households  the companies said on Thursday.",
        "date": "10052017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney  Altice finalize new programming agreement "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  October 03 (Fitch) Fitch Ratings has assigned an 'A' rating to The Walt Disney Company's (Disney) offering of benchmarked-sized senior unsecured notes due 2024. The notes are being offered in Canada by private placement. Proceeds from the offering are expected to be used for general corporate purposes including the repayment of outstanding debt. Fitch currently rates Disney's Issuer Default Rating (IDR) 'A'. The notes will rank",
        "date": "10032017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Fitch Rates Disney's Senior Unsecured Note Offering 'A' ; Outlook Stable "
    },
    {
        "content": "LOS ANGELES Walt Disney Co  and cable operator Altice USA  reached a tentative programing deal that keeps ESPN and other networks in the homes of millions of New York-area pay TV customers  the companies said in a statement on Sunday. | Video ",
        "date": "10022017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney  Altice reach deal that avoids ESPN blackout "
    },
    {
        "content": "TORONTO  Oct 3 Walt Disney Co is seeking to raise at least C$750 million in its first issue of maple bonds  a term sheet seen by Reuters showed  becoming the latest large U.S. corporation to tap this market in recent months.",
        "date": "10032017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Walt Disney seeks to raise at least C$750 mln in first maple bond issue "
    },
    {
        "content": "* The walt disney company and altice usa announce comprehensive distribution agreement",
        "date": "10052017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-The Walt Disney Company and Altice USA announce comprehensive distribution agreement "
    },
    {
        "content": "Oct 2 Shares of Walt Disney Co were the biggest gainers on the Dow Jones Industrial Average on Monday after the company reached a tentative deal that kept ESPN and other networks in the homes of millions of New York-area pay TV customers.",
        "date": "10022017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney  Altice shares gain after deal avoids blackout "
    },
    {
        "content": "Oct 2 Shares in Walt Disney Co were the biggest gainers on the Dow Jones Industrial Average on Monday after the company reached a tentative deal with cable operator Altice USA that prevented a Disney network programming blackout.",
        "date": "10022017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Disney  Altice shares gain after deal avoids blackout "
    },
    {
        "content": "* Files preliminary prospectus supplement related to a potential offering of notes due 2024 - SEC filing‍​ Source text : (http://bit.ly/2yFfzmE) Further company coverage:",
        "date": "10032017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney files preliminary prospectus supplement related to a potential offering of notes due 2024 "
    },
    {
        "content": "LOS ANGELES  Oct 1 Walt Disney Co and cable operator Altice USA reached a tentative programming deal that keeps ESPN and other networks in the homes of millions of New York-area pay TV customers  the companies said in a statement on Sunday.",
        "date": "10022017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 4-Disney  Altice reach deal that avoids ESPN blackout "
    },
    {
        "content": "LOS ANGELES The deadline for an agreement on what cable operator Altice USA pays to carry Walt Disney Co's ESPN  ABC  the Disney Channel and other networks has been extended to Sunday from Saturday due to the Yom Kippur holiday  a person familiar with the situation said.",
        "date": "09292017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney  Altice extend deadline to resolve programing dispute "
    },
    {
        "content": "LOS ANGELES  Sept 29 The deadline for an agreement on what cable operator Altice USA pays to carry Walt Disney Co's ESPN  ABC  the Disney Channel and other networks has been extended to Sunday from Saturday due to the Yom Kippur holiday  a person familiar with the situation said.",
        "date": "09292017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney  Altice extend deadline to resolve programming dispute "
    },
    {
        "content": "LOS ANGELES  Sept 26 Walt Disney Co is testing the first major redesign of its retail stores in seven years  adding interactive experiences and live streams of theme park parades to lure consumers tempted by online shopping.",
        "date": "09262017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney tests new store design as shoppers go online "
    },
    {
        "content": "* Disney reimagines retail with new e-commerce destination and prototype store design",
        "date": "09262017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Disney introduces new e-commerce destination and prototype store design "
    },
    {
        "content": "NEW YORK  Sept 24 Walt Disney Co has threatened to pull its programming from the fourth largest U.S. cable distributor  Altice USA  if the two parties cannot reach a deal before the end of the month  the cable company said on Sunday.",
        "date": "09252017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Walt Disney threatens to pull ESPN  ABC from Optimum "
    },
    {
        "content": "NEW YORK  Sept 24 Walt Disney Co has threatened to pull its programming from the fourth largest U.S. cable distributor  Altice USA  if the two parties cannot reach a deal before the end of the month  the cable company said on Sunday.",
        "date": "09252017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Walt Disney threatens to pull ESPN  ABC from Optimum "
    },
    {
        "content": "* ‍Playbuzz says has raised $35 million in Series C funding  led by Viola Growth with participation from existing investors including Disney Source text for Eikon: Further company coverage:",
        "date": "09272017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Playbuzz says has raised $35 mln in Series C funding "
    },
    {
        "content": "TEL AVIV  Sept 27 Playbuzz  a U.S.-Israeli platform for distributing online content  has raised $35 million in funding led by Viola Growth with participation from existing investors including Walt Disney Co  Saban Ventures  83North  Carmel Ventures and Firstime.",
        "date": "09272017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-U.S.-Israeli digital content firm Playbuzz raises $35 mln "
    },
    {
        "content": "TEL AVIV  Sept 27 Playbuzz  a U.S.-Israeli platform for distributing online content  has raised $35 million in funding led by Viola Growth with participation from existing investors including Walt Disney Co  Saban Ventures  83North and Carmel Ventures.",
        "date": "09272017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "U.S.-Israeli digital content firm Playbuzz raises $35 mln "
    },
    {
        "content": "* JAKKS Pacific signs global master toy agreement for Disney•Pixar's ‘Incredibles 2’",
        "date": "09272017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-JAKKS Pacific signs global master toy agreement for Disney Pixar's ‘Incredibles 2’ "
    },
    {
        "content": "* Says it  Walt Disney Co extended multi-year Disney Visa card  Disney Premier Visa card and Disney Visa debit card programs Source text for Eikon:",
        "date": "09192017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Disney  Chase renew co-brand card relationship "
    },
    {
        "content": "* Says Rebecca Campbell will assume role of president  Walt Disney Company Europe  Middle East and Africa effective January 1  2018​ Source text for Eikon: Further company coverage:",
        "date": "09212017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Disney announces new president for Europe  Middle East  Africa organization "
    },
    {
        "content": "* ‍contentguard Holdings - co entered patent license agreement with Walt Disney Company effective September 13 - sec filing​",
        "date": "09152017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Contentguard Holdings says entered patent license agreement with Walt Disney Company "
    },
    {
        "content": "* We're seeing the momentum of shift to internet entertainment pick up steam   that's helping drive our growth - CFO  Conf call",
        "date": "09122017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Netflix CFO says the momentum of shift to internet entertainment pick up steam   helping drive our growth "
    },
    {
        "content": "Sept 7 Shares of Walt Disney Co and Comcast Corp tumbled on Thursday after Disney warned of stagnant earnings and No. 1 cable operator Comcast forecast more subscriber losses.",
        "date": "09072017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "UPDATE 3-Disney   Comcast shares fall on disappointing forecasts "
    },
    {
        "content": "* U.S. jobless claims at more than two-year high after Harvey",
        "date": "09072017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St lower as Apple  Disney weigh "
    },
    {
        "content": "Sept 8 Walt Disney World said its theme park in Florida would remained closed on Sunday and Monday  joining a growing list of top Orlando attractions that are bracing for Hurricane Irma  which is poised to strike the state on Sunday.",
        "date": "09082017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Orlando theme parks brace for Hurricane Irma "
    },
    {
        "content": "* Marvel  Star Wars will go exclusively to Disney's streaming service  says CEO Bob Iger - CNBC Further company coverage:",
        "date": "09072017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Marvel  Star Wars will go exclusively to Disney's streaming service - CNBC "
    },
    {
        "content": "Sept 8 The NFL kickoff game broadcast on Thursday night on NBC  a win by the Kansas City Chiefs over the New England Patriots  attracted 21.8 million TV viewers  down more than 13 percent from last year's opening game  data from NBC and Nielsen showed.",
        "date": "09082017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-TV viewership drops for NBC'S first NFL game "
    },
    {
        "content": "Sept 7 Walt Disney Co Chief Executive Bob Iger said the company's earnings per share for this year will roughly be in line with what it reported last year  CNBC reported  sending its shares down 3 percent.",
        "date": "09072017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney CEO says EPS to be in line with last year - CNBC "
    },
    {
        "content": "* Disney CEO Bob Iger warns on co's EPS growth this year - CNBC",
        "date": "09072017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Disney CEO Iger warns on co's EPS growth this year - CNBC "
    },
    {
        "content": "* Walt Disney says Walt Disney World Resort will remain closed through Sept 11; hope to resume normal operations on Sept 12 Source text : http://bit.ly/2xbB5ls Further company coverage: (Reporting by Philip  George)",
        "date": "09082017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney says Disney World Resort will remain closed through Sept 11 "
    },
    {
        "content": "* Walt Disney world in Orlando  Florida to close for at least 2 days due to hurricane Irma- CNBC Further company coverage: (Reporting by Philip  George)",
        "date": "09082017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney World in Orlando  Florida to close for at least 2 days due to hurricane Irma- CNBC "
    },
    {
        "content": "* Spotify picks Courtney Holt from Disney to lead its efforts around original video and podcast programming- source Source",
        "date": "09062017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Spotify picks Courtney Holt from Disney to lead its efforts around original video and podcast programming- source "
    },
    {
        "content": "Shares of Walt Disney Co  and Comcast Corp  tumbled on Thursday after Disney warned of stagnant earnings and No. 1 cable operator Comcast forecast more subscriber losses. | Video ",
        "date": "09082017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney  Comcast shares fall on disappointing forecasts "
    },
    {
        "content": "* Disney preparing significant budget cuts at ABC TV Group unit  including cutting upto 10% of unit's annual costs- WSJ  citing sources",
        "date": "08302017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Disney preparing significant budget cuts at ABC TV group unit- WSJ "
    },
    {
        "content": "* Mary t. Barra  General Motors Co Chairman & CEO  elected to The Walt Disney Company board of directors",
        "date": "08242017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-GM's Chairman & CEO Mary T. Barra elected to The Walt Disney's board "
    },
    {
        "content": "Aug 14 \"Grey's Anatomy\" creator Shonda Rhimes is taking her Shondaland production house away from Walt Disney Co's ABC network to Netflix Inc to produce new content  the video streaming company said on Sunday.",
        "date": "08142017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "'Grey's Anatomy' creator Shonda Rhimes leaves ABC for Netflix "
    },
    {
        "content": "* Takes share stake of 2.5 million shares in Altaba - SEC filing",
        "date": "08142017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Soros Fund Management dissolves share stake in Chevron  Citi  Disney "
    },
    {
        "content": "LOS ANGELES Netflix Inc is in \"active discussions\" with Walt Disney Co about keeping Marvel and \"Star Wars\" films after 2019  when new Disney and Pixar movies will stop appearing on the streaming service  a senior executive said late on Thursday.",
        "date": "08112017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Netflix discussing keeping Disney's Marvel  'Star Wars' films "
    },
    {
        "content": "Walt Disney Co's  plan to launch its own digital movie and sports services means the world's largest entertainment company must learn how to attract streaming video subscribers and keep them hooked in a highly competitive market. | Video ",
        "date": "08092017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney shares drop as investors weigh risks of new streaming plans "
    },
    {
        "content": "By Daniel Wiessner A federal judge in Florida has dismissed a proposed discrimination class action by former Disney World employees who say they were forced to train foreign replacements before being laid off.",
        "date": "08112017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Judge tosses former Disney workers' lawsuit over hiring of Indian nationals "
    },
    {
        "content": "LOS ANGELES  Aug 11 Netflix Inc is in \"active discussions\" with Walt Disney Co about keeping Marvel and \"Star Wars\" films after 2019  when new Disney and Pixar movies will stop appearing on the streaming service  a senior executive said late on Thursday.",
        "date": "08112017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Netflix discussing keeping Disney's Marvel  'Star Wars' films "
    },
    {
        "content": "Walt Disney Co  will stop providing new movies to Netflix Inc  starting in 2019 and launch its own streaming service as the world's biggest entertainment company tries to capture digital viewers who are dumping traditional television. | Video ",
        "date": "08082017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney to pull movies from Netflix  plans own streaming service "
    },
    {
        "content": "* Indexes down: Dow 0.17 pct  S&P 0.04 pct  Nasdaq 0.28 pct (Updates to close  adds commentary)",
        "date": "08092017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-S&P closes barely lower despite N. Korea tensions "
    },
    {
        "content": "Aug 9 Walt Disney Co's plan to launch its own digital movie and sports services means the world's largest entertainment company must learn how to attract streaming video subscribers and keep them hooked in a highly competitive market.",
        "date": "08092017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-Disney shares drop as investors weigh risks of new streaming plans "
    },
    {
        "content": "LOS ANGELES  Aug 11 Netflix Inc is in \"active discussions\" with Walt Disney Co about keeping Marvel and \"Star Wars\" films after 2019 when new Disney and Pixar movies will stop appearing on the streaming service  a senior Netflix executive said on Thursday.",
        "date": "08112017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Netflix says in discussions with Disney over Marvel  'Star Wars' films "
    },
    {
        "content": "Aug 8 Walt Disney Co will stop providing new movies to Netflix Inc starting in 2019 and launch its own streaming service as the world's biggest entertainment company tries to capture digital viewers who are dumping traditional television.",
        "date": "08082017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 4-Disney to pull movies from Netflix  plans own streaming service "
    },
    {
        "content": "* Walt Disney Co says new direct ESPN service will be available to consumers in early 2018 - conf call",
        "date": "08082017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney CEO calls end of distribution agreement with Netflix \"major strategic shift\" "
    },
    {
        "content": "* The Walt Disney Company reports third quarter and nine months earnings for fiscal 2017",
        "date": "08082017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney Co Q3 earnings per share $1.51 "
    },
    {
        "content": "* Indexes down: Dow 0.24 pct  S&P 0.21 pct  Nasdaq 0.48 pct (Adds details  changes comment  updates prices)",
        "date": "08092017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St slips as rising N.Korea tensions rattle investors "
    },
    {
        "content": "Aug 9 Walt Disney Co's plan to plunge into a crowded streaming services market  dominated by pioneer Netflix Inc  could bring some initial pain  but the strength of the company's content is expected to help it pull through in the long run.",
        "date": "08092017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney's streaming push seen paying off in the long run "
    },
    {
        "content": "* The Walt Disney Company to acquire majority ownership of BAMTech",
        "date": "08082017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-The Walt Disney Company to acquire majority ownership of BAMTech "
    },
    {
        "content": "Aug 8 Walt Disney Co reported a near 9 percent fall in quarterly profit  pulled down by higher programming costs and declining subscribers at its flagship sports channel ESPN.",
        "date": "08082017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney posts profit drop  to take bigger stake in streaming firm BAMTech "
    },
    {
        "content": "Aug 9 Walt Disney Co paid $177 million  in addition to insurance recoveries  to settle the closely watched \"pink slime\" defamation case against its ABC network by Beef Products Inc.  a quarterly financial report shows.",
        "date": "08092017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney pays at least $177 million to settle 'pink slime' case - filing "
    },
    {
        "content": "Walt Disney Co paid $177 million  in addition to insurance recoveries  to settle the closely watched \"pink slime\" defamation case against its ABC network by Beef Products Inc.  a quarterly financial report shows.",
        "date": "08092017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney pays at least $177 million to settle 'pink slime' case: filing "
    },
    {
        "content": "To access the newsletter  click on the link:    http://share.thomsonreuters.com/assets/newsletters/Indiamorning/MNC_IN_08092017.pdf           If you would like to receive this newsletter via email  please register at: https://forms.thomsonreuters.com/india-morning/               FACTORS TO WATCH     11:00 am: Monsoon session of parliament continues in New Delhi.     11:00 am: Zee Media annual general meeting in Mumbai.     11:15 am: Thermax earnings conference call in Mumbai.     12:00 pm: Minis",
        "date": "08092017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Morning News Call - India  August 9 "
    },
    {
        "content": "July 25 Walt Disney Co's ABC News launched a partnership on Tuesday with ATTN:  a video news site focused on younger audiences  to co-produce videos for social media including Facebook Inc's Instagram and for Twitter Inc.",
        "date": "07252017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-ABC News to target millennials with social video partnership "
    },
    {
        "content": "July 25 Walt Disney Co's ABC News on Tuesday launched a partnership with millennial-focused video news site ATTN: to co-produce videos for social media including Facebook Inc's Instagram and for Twitter Inc.",
        "date": "07252017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "ABC News to target millennials with social video partnership "
    },
    {
        "content": "ANAHEIM  Calif.  July 15 An immersive \"Star Wars\" hotel  a new \"Ratatouille\" attraction and the first ever Mickey Mouse ride are just some of the high-profile features coming soon to Walt Disney Co's theme parks revealed on Saturday.",
        "date": "07162017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "'Star Wars' hotel  Epcot upgrades coming to Disney theme parks "
    },
    {
        "content": "LOS ANGELES  July 14 The man who voiced Kermit the Frog for 27 years wrote an emotional letter about being fired  saying he was \"devastated to have failed in my duty to my hero.\"",
        "date": "07142017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Fired Kermit the Frog puppeteer 'devastated' for failing his hero "
    },
    {
        "content": "NEW YORK  July 13 CBS Corp's CBS News division said on Thursday it has signed a new editorial and newsgathering partnership with BBC News to share video  editorial content and other resources across the globe.",
        "date": "07132017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-CBS News forms partnership with BBC  replacing Sky "
    },
    {
        "content": "* Walt Disney Co - files for offering of $250 million  2.950% notes due 2027 - sec filing‍​‍​",
        "date": "06302017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney Co files for offering of $250 million  2.950% notes due 2027 - SEC filing‍​‍​ "
    },
    {
        "content": "* The Walt Disney company declares semi-annual cash dividend of $0.78 per share Source text for Eikon: Further company coverage:",
        "date": "06282017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney Company declares semi-annual cash dividend of $0.78/share "
    },
    {
        "content": "The U.S. ABC television network  owned by Walt Disney Co   has settled its closely watched defamation lawsuit with Beef Products Inc over news reports on a processed beef product that critics dubbed \"pink slime \" both companies said on Wednesday.",
        "date": "06282017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "ABC TV settles with beef product maker in 'pink slime' defamation case "
    },
    {
        "content": "SHANGHAI Walt Disney celebrates the first anniversary of its $5.5 billion theme park in Shanghai on Friday  a key plank of the entertainment giant's push into the world's second-largest economy through everything from English schools to films. | Video ",
        "date": "06172017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "As Shanghai's Magic Kingdom turns one  Disney pushes further into China "
    },
    {
        "content": "June 16 Walt Disney Co's ESPN has reorganized its top executives  promoting Connor Schell to oversee all of its content creation across digital  TV and print  ESPN President John Skipper said on Friday.",
        "date": "06162017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "ESPN announces executive reorganization "
    },
    {
        "content": "* Alliance Data's BrandLoyalty and Disney EMEA announce new partnership to launch in 2018",
        "date": "06162017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Alliance Data's BrandLoyalty  Disney EMEA announce new partnership to launch in 2018 "
    },
    {
        "content": "SHANGHAI  June 16 Walt Disney celebrates the first anniversary of its $5.5 billion theme park in Shanghai on Friday  a key plank of the entertainment giant's push into the world's second-largest economy through everything from English schools to films.",
        "date": "06162017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-As Shanghai's Magic Kingdom turns one  Disney pushes further into China "
    },
    {
        "content": "SHANGHAI  June 16 Walt Disney celebrates the one-year anniversary of its $5.5 billion theme park in Shanghai on Friday  a key plank of the entertainment giant's push into the world's second-largest economy through everything from English schools to films.",
        "date": "06162017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "As Shanghai's Magic Kingdom turns one  Disney pushes further into China "
    },
    {
        "content": "* Files for 3-part notes offering of up to $2.0 billion - sec filing",
        "date": "06052017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney files for 3-part notes offering of up to $2.0 Bln "
    },
    {
        "content": "* Walt Disney CEO says as a matter of principle  I've resigned from the president's council over the Paris agreement withdrawal - tweet Source text for Eikon: http://bit.ly/2qLKkSo",
        "date": "06012017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney CEO Robert Iger resigns from president's council - tweet "
    },
    {
        "content": "* Immediately prior to consummation of merger  Bendon and Holdco will consummate a reorganization",
        "date": "05252017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Naked Brand Group says Bendon and Holdco will consummate a reorganization  immediately prior to consummation of merger "
    },
    {
        "content": "Walt Disney Co  Chief Executive Bob Iger has revealed that hackers claimed to have access to an unnamed upcoming movie and have demanded a ransom  the Hollywood Reporter said on Monday.",
        "date": "05152017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney's Iger says hackers claim to have stolen upcoming movie - Hollywood Reporter "
    },
    {
        "content": "* Disney chief Bob Iger says hackers claim to have stolen upcoming movie - The Hollywood Reporter",
        "date": "05152017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Disney Chief Iger says hackers claim to have stolen upcoming movie - The Hollywood Reporter "
    },
    {
        "content": "May 9 A decline in subscribers and higher programming costs at cash-cow ESPN weighed on shares of Walt Disney Co on Tuesday  overshadowing a quarterly profit that topped Wall Street estimates.",
        "date": "05092017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "UPDATE 4-ESPN concerns drag on Disney  shares dip "
    },
    {
        "content": "* Walt Disney Co says currently expects fiscal 2017 capital expenditures will be about $0.2 billion lower than fiscal 2016 capital expenditures of $4.8 billion",
        "date": "05092017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney Co says 2017 capital expenditures to drop "
    },
    {
        "content": "* The Walt Disney Company reports second quarter and six months earnings for fiscal 2017",
        "date": "05092017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-The Walt Disney Co reports qtrly revenue $13 336 million "
    },
    {
        "content": "May 9 Walt Disney Co reported an 11.4 percent rise in quarterly profit on Tuesday  helped by the success of its latest fairy tale adaptation \"Beauty and the Beast\" and strength in the company's theme park business.",
        "date": "05092017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Walt Disney profit rises 11.4 percent "
    },
    {
        "content": "* Indexes down: Dow 0.25 pct  S&P 0.11 pct  Nasdaq 0.1 pct (Updates to open)",
        "date": "05102017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "US STOCKS-Disney results  Comey sacking weigh on Wall Street "
    },
    {
        "content": "A decline in subscribers and higher programming costs at cash-cow ESPN weighed on shares of Walt Disney Co  on Tuesday  overshadowing a quarterly profit that topped Wall Street estimates.",
        "date": "05102017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "ESPN concerns drag on Disney  shares dip "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  May 02 (Fitch) Fitch Ratings has affirmed Symetra Life Insurance Company's (Symetra Life) Insurer Financial Strength (IFS) rating at 'A'. Fitch has also affirmed the Issuer Default Rating (IDR) of Symetra Financial Corporation (Symetra) at 'A-' and the ratings of all outstanding debt. The Rating Outlook is Stable. A complete list of rating actions follows at the end of this release. KEY RATING DRIVERS The affirmation follows t",
        "date": "05022017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Fitch Affirms Symetra Life's IFS at 'A' and Holdco's IDR at 'A-'; Outlook Stable "
    },
    {
        "content": "NEW YORK  April 27 Comcast Corp's quarterly profit topped estimates on strong growth in cable and internet subscribers and hits such as \"Fifty Shades Darker\" and \"Get Out\" boosted movie revenue  the No. 1 U.S. cable operator said on Thursday.",
        "date": "04272017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 4-Comcast profit tops views on subscriber growth  movie hits "
    },
    {
        "content": "* Shares jump as much as 8.5 pct to $104.14 in morning trading (Adds details  updates shares)",
        "date": "04242017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 3-Hasbro profit beats on gaming demand  shares hit record high "
    },
    {
        "content": "* CIAM says 2 euros per share buyout offer for Euro Disney's minority shareholders is not fair",
        "date": "04182017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Activist hedge fund CIAM says Euro Disney's buyout offer not fair for minority investors "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 03 (Fitch) Fitch Ratings has affirmed the Issuer Default Rating (IDR) assigned to The Walt Disney Company (Disney) and its subsidiaries at 'A'. The Rating Outlook remains Stable. A full list of ratings follows at the end of this release. Approximately $21.5 billion of pro forma debt outstanding as of Dec. 31  2016 is affected by this action. KEY RATING DRIVERS Significant Financial Flexibility: Disney's operating profile ",
        "date": "04032017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Fitch Affirms Disney's IDR at 'A'; Outlook Stable "
    },
    {
        "content": "LOS ANGELES Walt Disney Co's board  extended the term of Chairman and Chief Executive Officer Bob Iger by one year as it continues searching for a successor to a long-serving leader who is popular on Wall Street  the company said on Thursday.",
        "date": "03232017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney board extends CEO Iger's contract by one year "
    },
    {
        "content": "LOS ANGELES  March 23 Walt Disney Co's board  extended the term of Chairman and Chief Executive Officer Bob Iger by one year as it continues searching for a successor to a long-serving leader who is popular on Wall Street  the company said on Thursday.",
        "date": "03232017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 3-Disney board extends CEO Iger's contract by one year "
    },
    {
        "content": "* Robert Iger would remain employed with company and serve as chairman and chief executive officer from June 30  2018 to July 2  2019",
        "date": "03232017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney extends Robert Iger's employment term as chairman  CEO to July 2  2019 "
    },
    {
        "content": "March 23 Walt Disney Co said on Thursday it extended Chief Executive Bob Iger's term by more than a year to July 2  2019.",
        "date": "03232017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney extends CEO Iger's contract to July 2019 "
    },
    {
        "content": "* The Walt Disney company board of directors extends Robert A. Iger's contract as chairman and CEO to july 2  2019  Source text for Eikon:  Further company coverage:",
        "date": "03232017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney Company extends Robert Iger's contract as chairman and CEO to July 2  2019 "
    },
    {
        "content": "Two Florida subsidiaries of Walt Disney Co have agreed to provide $3.8 million in back wages to comply with federal law  the U.S. Labor Department said on Friday.",
        "date": "03172017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "U.S. says Walt Disney subsidiaries to pay $3.8 million in back wages "
    },
    {
        "content": "March 17 Two Florida subsidiaries of Walt Disney Co have agreed to provide $3.8 million in back wages to comply with federal law  the U.S. Labor Department said on Friday.",
        "date": "03172017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-U.S. says Walt Disney subsidiaries to pay $3.8 mln in back wages "
    },
    {
        "content": "WASHINGTON  March 17 Two Florida subsidiaries of Walt Disney Co have agreed to provide $3.8 million in back wages to comply with federal law  the U.S. Labor Department said in a statement on Friday.",
        "date": "03172017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "U.S. says Walt Disney subsidiaries to pay $3.8 mln in back wages "
    },
    {
        "content": "LONDON/PARIS An activist hedge fund has criticized plans by Walt Disney  to take full control of debt-laden Paris theme park operator Euro Disney   according to a letter seen by Reuters.",
        "date": "03152017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Activist hedge fund critical of Walt Disney's move on Disneyland Paris "
    },
    {
        "content": "LONDON/PARIS An activist hedge fund has criticised plans by Walt Disney to take full control of debt-laden Paris theme park operator Euro Disney  according to a letter seen by Reuters.",
        "date": "03142017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Activist hedge fund critical of Walt Disney's move on Disneyland Paris "
    },
    {
        "content": "* Disneyland Paris has struggled with losses and debts   (Adds comment from source familiar with the matter)",
        "date": "03142017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 3-Activist hedge fund critical of Walt Disney's move on Disneyland Paris "
    },
    {
        "content": "LONDON/PARIS  March 14 An activist hedge fund has clubbed together with other minority shareholders to object to plans by Walt Disney to take full control of the debt-laden Paris theme park operator  Euro Disney  according to a letter seen by Reuters.",
        "date": "03142017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Activist hedge fund opposes Walt Disney's move on Disneyland Paris "
    },
    {
        "content": "LONDON  March 14 Activist investor CIAM has written to the board of Euro Disney objecting to plans by Walt Disney Co to take over the company  a letter seen with Reuters showed.",
        "date": "03142017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Activist CIAM pens fresh letter to Euro Disney board "
    },
    {
        "content": "* Walt disney co says on march 10  2017  entered into a new $2.5 billion 364-day credit agreement with a syndicate of lenders - sec filing",
        "date": "03132017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney Co says on March 10  2017  entered into new $2.5 bln 364-day credit agreement "
    },
    {
        "content": "LOS ANGELES Walt Disney Co  Chief Executive Bob Iger on Wednesday defended his seat on President Trump's business advisory council as an opportunity to voice opinions that will benefit the company and its shareholders.",
        "date": "03082017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney CEO says staying on Trump advisory council "
    },
    {
        "content": "LOS ANGELES  March 8 Walt Disney Co Chief Executive Bob Iger on Wednesday said his seat on President Trump's business advisory council provides an opportunity to voice opinions that will benefit the company and its shareholders.",
        "date": "03082017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney CEO Iger defends role on Trump advisory council "
    },
    {
        "content": "COPENHAGEN Lego is counting on capturing the imagination of Chinese children with its colorful plastic bricks while keeping kids in its core markets engaged with programmable robots  its new chief executive said on Thursday. | Video ",
        "date": "03092017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Toymaker Lego looks to China and programmable robots for growth "
    },
    {
        "content": "COPENHAGEN  March 9 Lego is counting on capturing the imagination of Chinese children with its colourful plastic bricks while keeping kids in its core markets engaged with programmable robots  its new chief executive said on Thursday.",
        "date": "03092017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Toymaker Lego looks to China and programmable robots for growth "
    },
    {
        "content": "* Walt Disney -on March 1  2017   entered a terms agreement with  underwriters  with respect to offer and sale of $400 million of floating rate notes due 2020",
        "date": "03032017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney enters agreement to offer  sell $400 mln of floating rate notes "
    },
    {
        "content": "* Jakks Pacific renews licensing agreement with Disney consumer products for several entertainment properties in China",
        "date": "03062017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Jakks Pacific renews licensing agreement with Disney consumer products "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 01 (Fitch) Fitch Ratings has assigned an 'A' rating to The Walt  Disney Company's (Disney) proposed offering of benchmark-sized three- and five-  year fixed- and floating-rate senior unsecured notes. The Rating Outlook is  Stable. The proceeds from the offering are expected to be used for general  corporate purposes including the repayment of outstanding debt.  Fitch currently rates Disney's Issuer Default Rating (IDR) 'A",
        "date": "03012017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Fitch Rates Disney's Senior Unsecured Note Offering 'A'; Outlook Stable "
    },
    {
        "content": "* MTG and Disney reinforce long term strategic collaboration   Source text for Eikon:  Further company coverage:   (Stockholm Newsroom)",
        "date": "03012017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-MTG and Disney reinforce long term strategic collaboration "
    },
    {
        "content": "Feb 27 ABC's Sunday night broadcast of the Academy Awards hosted by comic Jimmy Kimmel drew the smallest audience since 2008 despite a memorable ending that will go down in history.",
        "date": "02272017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "UPDATE 3-Oscars draw lowest U.S. audience since 2008 with 32.9 mln viewers "
    },
    {
        "content": "LOS ANGELES Animal cartoon \"Zootopia \" an exploration of bias through the comedic story of a bunny who becomes a police officer  won the Academy Award on Sunday for best animated feature film.",
        "date": "02272017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney's 'Zootopia' wins Oscar for best animated film "
    },
    {
        "content": "* Walt Disney Co - co  IMAX have extended agreement with a new multi-picture deal beginning this year and extending through 2019  Source text for Eikon:  Further company coverage:",
        "date": "02222017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney and IMAX extend agreement with a new multi-picture deal "
    },
    {
        "content": "LOS ANGELES Walt Disney Co and major retailers will release the galaxy's newest \"Star Wars\" toys at a Sept. 1 midnight event ahead of the holiday debut of the next film in the saga  \"The Last Jedi \" company executives told Reuters. | Video ",
        "date": "02172017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney plans midnight 'Star Wars' event to unveil 'Last Jedi' toys "
    },
    {
        "content": "* Files for resale by selling security holder of 1.4 million shares of Walt Disney Company common stock - SEC filing  Source text: (http://bit.ly/2kpIHva) Further company coverage:    (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "02152017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney files for resale of 1.4 mln shares of co by selling security holder "
    },
    {
        "content": "DUBAI  Feb 12 Here are some factors that may affect Middle East stock markets on Sunday. Reuters has not verified the press reports and does not vouch for their accuracy.",
        "date": "02122017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "MIDEAST STOCKS - Factors to watch - Feb 12 "
    },
    {
        "content": "LOS ANGELES  Feb 16 Walt Disney Co and major retailers will release the galaxy's newest \"Star Wars\" toys at a Sept. 1 midnight event ahead of the holiday debut of the next film in the saga  \"The Last Jedi \" company executives told Reuters.",
        "date": "02172017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Disney plans midnight 'Star Wars' event to unveil 'Last Jedi' toys "
    },
    {
        "content": "LOS ANGELES Walt Disney Co  is raising the admission price for its U.S. theme parks by as much as $5 for some single-day tickets starting on Sunday.",
        "date": "02112017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney hikes some U.S. park ticket prices up to 4.9 percent "
    },
    {
        "content": "LOS ANGELES  Feb 11 Walt Disney Co is raising the admission price for its U.S. theme parks by as much as $5 for some single-day tickets starting on Sunday.",
        "date": "02112017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney hikes some US park ticket prices up to 4.9 pct "
    },
    {
        "content": "Feb 10 The following bids  mergers  acquisitions and disposals were reported by 1430 GMT on Friday:",
        "date": "02102017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "DOHA/PARIS Walt Disney Co  is to seek full control of Euro Disney  after raising its stake in the underperforming operator of Disneyland Paris through a deal with Saudi billionaire Prince Alwaleed bin Talal.",
        "date": "02102017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Walt Disney seeks control of troubled offspring Euro Disney "
    },
    {
        "content": "DOHA/PARIS  Feb 10 Walt Disney Co is to seek full control of Euro Disney after raising its stake in the underperforming operator of Disneyland Paris through a deal with Saudi billionaire Prince Alwaleed bin Talal.",
        "date": "02102017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Walt Disney seeks control of troubled offspring Euro Disney "
    },
    {
        "content": "* Walt Disney CEO Bob Iger on CNBC says firmly believe that \"we cannot shut our borders to immigrants\"",
        "date": "02072017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney CEO on CNBC says \"we cannot shut our borders to immigrants\" "
    },
    {
        "content": "* Disney CEO Robert Iger may extend tenure again- WSJ  citing sources  Source http://on.wsj.com/2kEpSUG",
        "date": "02062017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Disney CEO Robert Iger may extend tenure again- WSJ  citing sources "
    },
    {
        "content": "Walt Disney Co  said it would raise its holding in Euro Disney SCA  to 85.7 percent by acquiring most of Saudi Prince Alwaleed Bin Talal's Kingdom Holding Co's  stake in the Paris Disneyland operator.",
        "date": "02102017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Walt Disney raises stake in Paris Disneyland operator to 85.7 percent "
    },
    {
        "content": "* Walt Disney Co - Q1 revenue $14 784 million versus $15 244 million",
        "date": "02072017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-The Walt Disney Company reports Q1 earnings per share $1.55 "
    },
    {
        "content": "Feb 7 Walt Disney Co's quarterly revenue fell 3 percent  hurt by a drop in advertising revenue at ESPN and a lack of hit movie releases compared with a year earlier.",
        "date": "02072017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney revenue falls 3 pct  weighed by ESPN and studio business "
    },
    {
        "content": "* Shares rise 16.6 pct to record high of $96.34   (Adds CEO comment)",
        "date": "02062017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 4-Hasbro's record holiday quarter lifts shares to all-time high "
    },
    {
        "content": "Feb 10 Walt Disney Co said it would raise its holding in Euro Disney SCA to 85.7 percent by acquiring most of Saudi Prince Alwaleed Bin Talal's Kingdom Holding Co's stake in the Paris Disneyland operator.",
        "date": "02102017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Walt Disney raises stake in Paris Disneyland operator to 85.7 pct "
    },
    {
        "content": "Chief Executive Bob Iger said on Tuesday he is open to extending his term as the head of Walt Disney Co   offering investors a sign of potential stability at the media company as it reported a dip in quarterly advertising at ESPN.",
        "date": "02082017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney CEO Iger says he is open to extending his term "
    },
    {
        "content": "Fox Television's broadcast of Super Bowl LI on Sunday night drew 111.3 million viewers  according to Nielsen data released by the network on Monday  the smallest audience for the National Football League's title game in four years.",
        "date": "02072017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Despite overtime finish  NFL Super Bowl draws lower TV ratings "
    },
    {
        "content": "* Walt Disney company announces an increase in its interest in Euro Disney",
        "date": "02102017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney company announces an increase in interest in Euro Disney "
    },
    {
        "content": "Feb 7 Chief Executive Bob Iger said on Tuesday he is open to extending his term as the head of Walt Disney Co   offering investors a sign of potential stability at the media company as it reported a dip in quarterly advertising at ESPN.",
        "date": "02082017",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 3-Disney CEO Iger says he is open to extending his term "
    },
    {
        "content": "* Disney CEO Bob Iger will miss Trump meeting because of previously scheduled Disney board meeting - Disney spokeswoman  Further company coverage:",
        "date": "02022017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Disney CEO Iger will miss Trump meeting -spokeswoman "
    },
    {
        "content": "* CEO Robert A. Iger's 2016 total compensation was $43.9 million versus $44.9 million in 2015 - SEC filing",
        "date": "01132017",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney says CEO's 2016 total compensation was $43.9 mln - SEC filing "
    },
    {
        "content": "LOS ANGELES (Variety.com) - Tyrus Wong  whose paintings served as visual inspiration for Disney's animated classic \"Bambi \" died Friday  Dec. 30. He was 106.",
        "date": "12312016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Tyrus Wong  pioneer 'Bambi' artist  dies at 106 "
    },
    {
        "content": "The Walt Disney Company’s U.S. television arm will create shows for Snap Inc’s Snapchat  Disney announced on Wednesday  in Snapchat's latest deal with a major U.S. media company.",
        "date": "12212016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney will create shows for Snapchat "
    },
    {
        "content": "* Twitter announces live streaming event with Disney and people for Rogue One: a star wars story  Source text for Eikon:  Further company coverage:",
        "date": "11292016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Twitter announces live streaming event with Disney and people for Rogue One: a star wars story "
    },
    {
        "content": "HONG KONG Walt Disney  will expand its loss-making Hong Kong Disneyland theme park with a $1.4 billion investment to try to attract more visitors  the U.S. entertainment company and its local government partner said on Tuesday.",
        "date": "11222016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Hong Kong Disneyland to expand with $1.4 billion investment "
    },
    {
        "content": "* To show Walt Disney films and programmes on Canal Plus Africa channels",
        "date": "11232016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Canal Plus strikes Africa deals with Walt Disney Co "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 15 (Fitch) Fitch Ratings has affirmed Symetra Life Insurance  Company's (Symetra Life) Insurer Financial Strength (IFS) rating at 'A'. Fitch  has also affirmed the Issuer Default Rating (IDR) of Symetra Financial  Corporation (Symetra) at 'A-' and the ratings of all outstanding debt. The  Rating Outlook is Stable. A complete list of rating actions follows at the end  of this release. KEY RATING DRIVERS Symetra's ratin",
        "date": "11152016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Fitch Affirms Symetra Life's IFS at 'A' and Holdco's IDR at 'A-'; Outlook Stable "
    },
    {
        "content": "Walt Disney Co  executives promised earnings growth for the next two years  easing investor concerns over a quarterly drop in ad sales and subscribers at its ESPN sports network  sending the media company's shares up in after-hours trading.",
        "date": "11112016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney promises earnings growth next two years  shares rise "
    },
    {
        "content": "Nov 10 Walt Disney Co executives promised earnings growth for the next two years  easing investor concerns over a quarterly drop in ad sales and subscribers at its ESPN sports network  sending the media company's shares up in after-hours trading.",
        "date": "11112016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 4-Disney promises earnings growth next two years  shares rise "
    },
    {
        "content": "* Expects to deliver modest eps growth in fiscal 2017 - conf call",
        "date": "11102016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney expects to return to \"more robust growth\" in fiscal 2018 "
    },
    {
        "content": "Nov 10 Walt Disney Co reported a 2.7 percent fall in quarterly revenue  reflecting lower advertising revenue from sports network ESPN as well as an extra week last year.",
        "date": "11102016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "REFILE-Disney revenue falls 2.7 pct "
    },
    {
        "content": "SAN FRANCISCO  Nov 9 Twitter Inc said on Wednesday that Chief Operating Officer Adam Bain  widely credited with building a robust advertising business at the company even as it struggled with user growth  is leaving to explore other opportunities.",
        "date": "11092016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-Twitter says COO Adam Bain to leave  Noto to take his place "
    },
    {
        "content": "* Walt Disney Co quarterly media networks revenue $5 658 million versus $5 826 million",
        "date": "11102016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney reports Q4 earnings per share $1.10 "
    },
    {
        "content": "NEW YORK A California movie producer who heads a private equity firm was arrested on Wednesday on charges that he and another man defrauded investors in hedge funds overseen by a New York-based investment adviser out of $26 million  prosecutors said.",
        "date": "11092016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "U.S. arrests head of Cyrano Group on fraud charges "
    },
    {
        "content": "NEW YORK  Nov 9 A California movie producer who heads a private equity firm was arrested on Wednesday on charges that he and another man defrauded investors in hedge funds overseen by a New York-based investment adviser out of $26 million  prosecutors said.",
        "date": "11092016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-U.S. arrests head of Cyrano Group on fraud charges "
    },
    {
        "content": "LOS ANGELES The Nielsen ratings agency on Friday reaffirmed a report about U.S. pay-television customers that was challenged by Walt Disney Co's ESPN sports network.",
        "date": "11052016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Nielsen sticks with subscriber report challenged by ESPN "
    },
    {
        "content": "LOS ANGELES  Nov 4 The Nielsen ratings agency  on Friday reaffirmed a report about U.S. pay-television customers that was challenged by Walt Disney Co's ESPN sports network.",
        "date": "11052016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Nielsen sticks with subscriber report challenged by ESPN "
    },
    {
        "content": "LOS ANGELES  Nov 4 The Nielsen ratings agency  on Friday reaffirmed a report about U.S. pay television customers that was challenged by Walt Disney Co's ESPN sports network.",
        "date": "11042016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Nielsen sticks with subscriber report challenged by ESPN "
    },
    {
        "content": "NEW YORK  Nov 1 Video website Hulu on Tuesday announced deals to add programming from Twenty-first Century Fox  and Walt Disney Co to a streaming TV service that it plans to offer in early 2017.",
        "date": "11012016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Hulu signs deals with Disney  Fox for new streaming TV service "
    },
    {
        "content": "* Hulu-says inks new affiliate agreements with 21st Century Fox and the Walt Disney Company",
        "date": "11012016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Hulu inks deal with 21st Century Fox and Walt Disney "
    },
    {
        "content": "NEW YORK  Oct 25 AT&T Inc's upcoming DirecTV Now online video service will cost $35 per month  including mobile streaming costs  and target viewers who shun pay-television subscriptions  Chief Executive Randall Stephenson said on Tuesday.",
        "date": "10252016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-AT&T's DirecTV Now online video service to cost $35 per month "
    },
    {
        "content": "* First full reporting period since Brexit shows weak profits",
        "date": "10182016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Foreign firms say UK profits hit by Brexit vote  weak sterling "
    },
    {
        "content": "* Broadcaster's interim management limits spending   (Adds Mediaset statement  recasts lead)",
        "date": "10202016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-Mediaset says Vivendi ends interim management accord over pay-TV unit "
    },
    {
        "content": "Alphabet Inc's  Google has reached an agreement with CBS Corp  to carry the network on its planned web TV service and is in advanced talks with 21st Century Fox   Walt Disney Co  and Viacom Inc  to distribute their channels  people with knowledge of the talks told Reuters on Wednesday.",
        "date": "10202016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Google signs CBS  in talks with others on web TV: sources "
    },
    {
        "content": "Hasbro Inc reported better-than-expected quarterly revenue and profit  helped by strong demand for Disney Princess  Frozen and Trolls dolls  and said it was seeing \"strong sales trends\" heading into the holiday shopping season. | Video ",
        "date": "10172016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Hasbro revenue  profit beat as Disney Princess dolls dazzle "
    },
    {
        "content": "Oct 19 Alphabet Inc's Google has reached an agreement with CBS Corp to carry the network on its planned web TV service and is in advanced talks with 21st Century Fox  Walt Disney Co and Viacom Inc  to distribute their channels  people with knowledge of the talks told Reuters on Wednesday.",
        "date": "10202016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 3-Google signs CBS  in talks with others on web TV -sources "
    },
    {
        "content": "* Q3 profit $2.03/shr vs est of $1.74/shr   (Adds details from conference call  updates shares)",
        "date": "10172016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-Hasbro revenue  profit beat as Disney Princess dolls dazzle "
    },
    {
        "content": "SHANGHAI Chinese conglomerate Dalian Wanda has hired a senior former Walt Disney Co executive to lead its theme park business  a person with direct knowledge of the matter told Reuters on Monday  ramping up the rivalry between the two firms.",
        "date": "10172016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "China's Wanda hires ex-Disney exec to lead theme park drive: source "
    },
    {
        "content": "SHANGHAI  Oct 17 Chinese conglomerate Dalian Wanda has hired a senior former Walt Disney Co executive to lead its theme park business  a person with direct knowledge of the matter told Reuters on Monday  ramping up the rivalry between the two firms.",
        "date": "10172016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "China's Wanda hires ex-Disney exec to lead theme park drive -source "
    },
    {
        "content": "Seeking to lure American children to the healthy delights of fruit and vegetables  Walt Disney Co.'s  consumer products unit and Dole Food Company Inc [DFCI.UL] are launching co-branded fresh produce featuring Disney  Pixar  Star Wars and Marvel characters.",
        "date": "10142016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney  Dole Food strike marketing deal on fresh produce "
    },
    {
        "content": "Oct 14 Seeking to lure American children to the healthy delights of fruit and vegetables  Walt Disney Co.'s  consumer products unit and Dole Food Company Inc  are launching co-branded fresh produce featuring Disney  Pixar  Star Wars and Marvel characters.",
        "date": "10142016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Disney  Dole Food strike marketing deal on fresh produce "
    },
    {
        "content": "* Disney and Dole Food Co to launch co-branded produce assortment featuring Disney  Pixar  Star Wars and Marvel characters  Source text for Eikon:  Further company coverage:",
        "date": "10142016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Disney and Dole Food to launch co-branded fresh produce "
    },
    {
        "content": "Oct 10 Shares of Twitter Inc slumped more than 13 percent in premarket trading on Monday after a weekend Bloomberg report that the social media company was unlikely to receive any bids.",
        "date": "10102016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Twitter's shares slump on report that bids are unlikely "
    },
    {
        "content": "* Based On Forecasts For Hurricane Matthew  Walt Disney World Theme Parks To Remain Closed From Thursday By 5 P.M. To Oct. 7  Source (http://bit.ly/1kUZvUS) Further company coverage:",
        "date": "10062016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney closes world theme parks based on Hurricane Matthew forecasts "
    },
    {
        "content": "Oct 6 Twitter Inc shares plunged on Thursday as fears mounted that a much-anticipated auction of the social media company will draw minimal interest from potential buyers.",
        "date": "10062016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 3-Twitter shares plunge on report bidders are scarce "
    },
    {
        "content": "* Dow down 0.07 pct  S&P up 0.05 pct  Nasdaq down 0.17 pct   (Updates to early afternoon)",
        "date": "10062016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St ends flat with eyes on payrolls "
    },
    {
        "content": "Oct 6 Twitter Inc's shares plunged more than 19 percent in early trading on Thursday after technology website Recode reported that Alphabet Inc's Google does not \"currently\" plan to make a bid for the company.",
        "date": "10062016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Twitter shares plunge on report Google has no plan to make bid "
    },
    {
        "content": "Oct 6 U.S. stock index futures were lower on Thursday as improving economic data and comments from Federal Reserve officials suggested monetary policy could be tightened by the end of the year.",
        "date": "10062016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Futures fall as investors weigh rate-hike chances "
    },
    {
        "content": "SAN FRANCISCO  Oct 5 Shares of Twitter  slumped 9 percent late on Wednesday after Recode reported that Google  owned by Alphabet  would not move forward with a bid to acquire the social network.",
        "date": "10062016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Twitter drops 9 percent after report that Google won't bid "
    },
    {
        "content": "Twitter Inc has told potential acquirers it is seeking to conclude negotiations about selling itself by the time it reports third-quarter earnings on Oct. 27  according to people familiar with the matter.",
        "date": "10062016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Exclusive: Twitter to conclude sale deliberations this month - sources "
    },
    {
        "content": "SAN FRANCISCO  Sept 27 With speculation mounting that Twitter Inc will soon have a new corporate owner  the 10-year-old social networking service - which has long struggled to define its core purpose -may end up heading in one of several distinctly different directions depending on who ends up paying for it.",
        "date": "09272016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "RPT-Twitter could take many forms  depending on new owner "
    },
    {
        "content": "Sept 27 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "09272016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "PRESS DIGEST - Wall Street Journal - Sept 27 "
    },
    {
        "content": "SAN FRANCISCO  Sept 26 With speculation mounting that Twitter Inc will soon have a new corporate owner  the 10-year-old social networking service - which has long struggled to define its core purpose -may end up heading in one of several distinctly different directions depending on who ends up paying for it.",
        "date": "09272016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Twitter could take many forms  depending on new owner "
    },
    {
        "content": "* On Theme Parks -See a relatively healthy consumer in the u.s.  -  Goldman Sachs conf",
        "date": "09212016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney CEO Iger says probably in 2017 with BAMTech will launch a branded ESPN service "
    },
    {
        "content": "LOS ANGELES Walt Disney Co  has hired former Warner Bros. executive Bruce Rosenblum as president of business operations for the Disney/ABC Television Group  the company said on Friday.",
        "date": "09162016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney names ex-Warner Bros executive to TV business post "
    },
    {
        "content": "* A portion of new layoffs at Walt Disney have hit video game workers - NYT  Source text - (http://nyti.ms/2cv9Zti) Further company coverage:    (Bengaluru Newsroom)",
        "date": "09152016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Disney is cutting 250 jobs at animation unit - NYT "
    },
    {
        "content": "LOS ANGELES  Sept 16 Walt Disney Co has hired former Warner Bros. executive Bruce Rosenblum as president of business operations for the Disney/ABC Television Group  the company said on Friday.",
        "date": "09162016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-Disney names ex-Warner Bros executive to TV business post "
    },
    {
        "content": "LOS ANGELES  Sept 16 Walt Disney Co has hired former Warner Bros. executive Bruce Rosenblum as president of business operations for the Disney/ABC Television Group  the company said in a statement on Friday.",
        "date": "09162016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney names ex-Warner Bros. executive Rosenblum to TV business post "
    },
    {
        "content": "Walt Disney Co's quarterly profit and revenue on Tuesday beat analysts' estimates fueled by movie studio hits  and the media company said it was taking a stake in a streaming video technology company to sell more content directly to consumers.",
        "date": "08092016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney beats estimates  buys video streaming stake to lure web viewers "
    },
    {
        "content": "Aug 9 Walt Disney Co's quarterly profit and revenue on Tuesday beat analysts' estimates fueled by movie studio hits  and the media company said it was taking a stake in a streaming video technology company to sell more content directly to consumers.",
        "date": "08092016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 4-Disney beats estimates  buys video streaming stake to lure web viewers "
    },
    {
        "content": "* The walt disney company reports third quarter and nine months earnings for fiscal 2016",
        "date": "08092016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-The Walt Disney Co Q3 earnings per share $1.62 excluding items "
    },
    {
        "content": "* Under terms of transaction  disney will pay $1 billion in two installments",
        "date": "08092016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-The Walt Disney Company acquires minority stake in Bamtech "
    },
    {
        "content": "Aug 9 Walt Disney Co reported a 9 percent rise in quarterly revenue  fueled by the box-office success of \"The Jungle Book\".",
        "date": "08092016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney revenue jumps 9 pct "
    },
    {
        "content": "* Announced \"Destination: Disney Style\"  a new Youtube series  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "08022016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney announces new Youtube series \"Destination: Disney Style\" "
    },
    {
        "content": "* Time warner joins Hulu as equity owner and signs affiliate agreement for new Hulu live-streaming service to carry turner networks",
        "date": "08032016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Time Warner signs affiliate agreement for new Hulu Live-Streaming Service to Carry Turner Networks "
    },
    {
        "content": "Time Warner Inc  disclosed a 10 percent stake in video streaming site Hulu on Wednesday  setting its sights on the web TV market  and it raised its 2016 forecast on expectations of sustained growth in its traditional media business. | Video ",
        "date": "08032016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Time Warner takes stake in Hulu  lifts profit forecast "
    },
    {
        "content": "Aug 3 Time Warner Inc disclosed a 10 percent stake in video streaming site Hulu on Wednesday  setting its sights on the web TV market  and it raised its 2016 forecast on expectations of sustained growth in its traditional media business.",
        "date": "08032016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 5-Time Warner takes stake in Hulu  lifts profit forecast "
    },
    {
        "content": "* Says it has filed for a debt shelf; size undisclosed - SEC Filing  Source - http://bit.ly/29W7RIz Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "07202016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney says it has filed for a debt shelf  size undisclosed "
    },
    {
        "content": "* Shares fall as much as 7.6 pct   (Adds details  analyst comments; updates shares)",
        "date": "07182016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 3-Hasbro beats estimates on strong demand for Disney Princess dolls "
    },
    {
        "content": "* Holdco lowered threshold needed for acceptances under exchange offer from 75 pct to 60 pct of Deutsche Börse shares",
        "date": "07132016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-LSE Group says share exchange bar lowered for Deutsche Börse deal "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  July 07 (Fitch) Fitch Ratings has assigned an 'A' rating to The Walt  Disney Company's (Disney) offering of benchmark-sized three-  10  and 30-year  senior unsecured notes.  The Rating Outlook is Stable. The proceeds from the  offering are expected to be used for general corporate purpose including the  repayment of outstanding debt.   Fitch currently rates Disney's Issuer Default Rating (IDR) 'A'.  Approximately  $21.1 billion",
        "date": "07072016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Fitch Rates Disney's Offering 'A'; Outlook Stable "
    },
    {
        "content": "* The Walt Disney Co's proposed senior unsecured notes rated 'A'  Source text (http://bit.ly/29lzjj9) Further company coverage:",
        "date": "07072016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-S&P rates The Walt Disney Co's proposed senior unsecured notes 'A' "
    },
    {
        "content": "July 3 The distraught father of a 2-year-old boy dragged off and killed by an alligator at the Walt Disney World Resort in Florida last month has said he was attacked by a second alligator as he fought to save his son.",
        "date": "07042016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Father of toddler killed at Disney resort says two alligators were involved "
    },
    {
        "content": " ",
        "date": "06302016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Disney to buy one-third stake in MLB video unit for $3.5 bln - TheFly  citing Bloomberg "
    },
    {
        "content": "* Says declares semi-annual cash dividend of $0.71 per share  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "06292016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney says declares semi-annual cash dividend of $0.71 per share "
    },
    {
        "content": "SHANGHAI Walt Disney Co has taken three Chinese firms to court over concerns local animation \"The Autobots\" copied elements from Disney's own hit movie \"Cars\"  as the U.S. firm looks to protect its drive into the world's second-largest economy. | Video ",
        "date": "06222016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Cars vs. Autobots: Disney sues China firms in copyright dispute "
    },
    {
        "content": "SHANGHAI  June 22 Walt Disney Co has taken three Chinese firms to court over concerns local animation \"The Autobots\" copied elements from Disney's own hit movie \"Cars\"  as the U.S. firm looks to protect its drive into the world's second-largest economy.",
        "date": "06222016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Cars vs Autobots: Disney sues China firms in copyright dispute "
    },
    {
        "content": "SHANGHAI Walt Disney Co has opened the gates to its first theme park in China  prompting a rush from thousands of gathered Mickey Mouse enthusiasts to be the first to storm Treasure Cove  ride the Roaring Rapids or visit Disney's tallest castle. | Video ",
        "date": "06162016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney's China fairytale begins with $5.5 billion park opening "
    },
    {
        "content": "June 16 The investigation into the death of a two-year-old boy likely drowned by an alligator at Walt Disney World Resort in Florida is ongoing but is not a criminal case  a spokeswoman for the local sheriff's office said on Thursday.",
        "date": "06162016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Sheriff probe 'not criminal' in Florida Disney resort alligator death "
    },
    {
        "content": "LOS ANGELES/NEW YORK  June 16 June was supposed to have been a triumphant month for Walt Disney Co theme parks  with the flashy opening of a long-planned resort in Shanghai and a new Florida attraction based on its wildly popular animated movie \"Frozen.\"",
        "date": "06172016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney faces PR crisis  risk of legal action after gator attack "
    },
    {
        "content": "June 14 Corporate and individual donors have given more than $5.3 million to help victims of Sunday's mass shooting at a gay nightclub in Florida by a gunman who killed 49 people and wounded 53  organizers of fundraising drives said on Tuesday.",
        "date": "06142016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Over $5.3 million raised for Orlando club shooting victims "
    },
    {
        "content": "ORLANDO  Fla. Walt Disney World Resort in Orlando  Florida  plans to install signs warning of alligators in the area where a 2-year-old boy was killed by one of the reptiles  a source familiar with the matter told Reuters on Thursday. | Video ",
        "date": "06172016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney to post alligator warning signs after boy's death "
    },
    {
        "content": "* Out goes American Main Street  in comes Chinese zodiac garden",
        "date": "06122016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "RPT-Mickey takes on the locals with Disney's $5.5 bln Shanghai bet "
    },
    {
        "content": "SHANGHAI As the opening of the $5.5 billion Shanghai Disneyland draws near  Walt Disney Co has a challenge. The hold of rival Asian characters such as China’s homegrown Boonie Bears or Big Big Wolf means seven-year-olds like Li Yixuan have less time for Mickey Mouse and Friends.",
        "date": "06122016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Mickey takes on the locals with Disney's $5.5 billion Shanghai bet "
    },
    {
        "content": "* Out goes American Main Street  in comes Chinese zodiac garden",
        "date": "06122016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Mickey takes on the locals with Disney's $5.5 bln Shanghai bet "
    },
    {
        "content": "LOS ANGELES  May 23 From Walt Disney's hand-signed Mickey Mouse doll to his animator's desk and chairs  a trove of the late animation entrepreneur's memorabilia will go up for auction next month and offers a glimpse into the origins of the \"mouse house.\"",
        "date": "05232016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Walt Disney's Mickey Mouse  animation trove up for auction "
    },
    {
        "content": "* Says it has signed an agreement with Disney in China to allow the company to use Disney's characters and logo on some of its products",
        "date": "05232016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Hailun Piano signs agreement for use of Disney characters on its products "
    },
    {
        "content": "SHANGHAI  May 23 The billionaire head of China's Wanda Group said rival Walt Disney faces high costs and other hurdles at its first mainland theme park opening in June  a rare public criticism that underlines rising tension as firms vie for the fast-growing entertainment market.",
        "date": "05232016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Wanda's Wang aims barbs at Disney ahead of Shanghai park opening "
    },
    {
        "content": "* Abc says network has extended contract with Jimmy Kimmel through fall 2019  Source text for Eikon:  Further company coverage:    (Reporting by Lisa Richwine)",
        "date": "05172016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney Co's ABC extends contract with Jimmy Kimmel through fall 2019 "
    },
    {
        "content": "Walt Disney Co  an investor favorite for consistently beating Wall Street earnings targets  reported a rare miss on Tuesday as advertising and subscriptions declined at sports channel ESPN and theme park revenue came in weaker than expected.",
        "date": "05102016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney reports rare earnings miss  shares sink "
    },
    {
        "content": "NEW YORK  May 11 U.S. stock indexes dropped about 1 percent on Wednesday as feeble quarterly reports from Walt Disney  Macy's and Fossil undermined confidence across the consumer sector.",
        "date": "05112016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "US STOCKS SNAPSHOT-Wall St ends down sharply with retailers  Disney "
    },
    {
        "content": "May 10 Walt Disney Co  an investor favorite for consistently beating Wall Street earnings targets  reported a rare miss on Tuesday as advertising and subscriptions declined at sports channel ESPN and theme park revenue came in weaker than expected.",
        "date": "05102016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 3-Disney reports rare earnings miss  shares sink "
    },
    {
        "content": "* CEO Iger says no plans currently to extend his contract beyond June 2018 - Conf call",
        "date": "05102016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney CEO says no plans currently to extend his contract beyond June 2018- Conf call "
    },
    {
        "content": "* U.S. Treasuries extend price gains after 10-year auction   (Updates with afternoon trading)",
        "date": "05112016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "GLOBAL MARKETS-Stocks stumble  oil surges  dollar rally stalls "
    },
    {
        "content": "LOS ANGELES (Variety.com) - Marvel-Disney's \"Captain America: Civil War\" has opened the summer spectacularly with a dominant $181.8 million weekend at 4 266 U.S. locations. | Video ",
        "date": "05082016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Box Office - 'Captain America: Civil War' starts summer with sizzling $181.8 million "
    },
    {
        "content": "May 10 Walt Disney Co's reported a 4.1 percent rise in quarterly revenue  helped by the box-office success of \"Star Wars: The Force Awakens\" and animated movie \"Zootopia\".",
        "date": "05102016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney's 2nd-qtr revenue rises 4.1 pct "
    },
    {
        "content": "* Indexes down: Dow 0.66 pct  S&P 0.47 pct  Nasdaq 0.43 pct   (Adds details  changes comment  updates shares)",
        "date": "05112016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St drops as Disney  Macy's lead rout in consumer stocks "
    },
    {
        "content": "For Walt Disney's Peter Pan  flying was \"all a matter of faith and trust.\" Investors in Walt Disney Co showed a lack of both in the company's stock on Wednesday.",
        "date": "05112016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney shares stumble as expectations outpace reality "
    },
    {
        "content": "* Indexes down: Dow 0.48 pct  S&P 0.35 pct  Nasdaq 0.41 pct   (Updates to open)",
        "date": "05112016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St drops as Disney  Macy's weigh on consumer stocks "
    },
    {
        "content": "May 11 U.S. stocks opened lower on Wednesday as oil prices surrendered early gains and poor results from Walt Disney and Macy's weighed on investor sentiment.",
        "date": "05112016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS SNAPSHOT-U.S. stocks open lower as Disney  Macy's drag "
    },
    {
        "content": "* Futures down: Dow 30 pts  S&P 2 pts  Nasdaq 1.75 pts   (Adds details  comments  updates prices)",
        "date": "05112016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St set to open flat after Tuesday's rally; Disney weighs "
    },
    {
        "content": "NEW YORK More than 30 New York City businesses  including Whole Foods Market Inc  Walt Disney Co's ABC and Anheuser Busch  have agreed to cut the trash they send to landfills by half by June  the mayor's office said on Monday.",
        "date": "05022016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "New York businesses to cut trash by half in 'Zero Waste' plan "
    },
    {
        "content": "April 29 Comcast Corp's planned purchase of DreamWorks Animation would increase the media giant's foothold in Asia  particularly China  as it competes in an increasingly global battle for entertainment dollars.",
        "date": "04292016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Comcast buy of 'Kung Fu Panda' producer aids Asia strategy "
    },
    {
        "content": "April 26 Turner Communications is expected to announce Tuesday that it is launching its own streaming video-on-demand service for film buffs this fall  according to a company statement reviewed by Reuters",
        "date": "04262016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Turner to launch streaming video service for film buffs "
    },
    {
        "content": "April 20 Toymaker Mattel Inc reported a smaller-than-expected drop in quarterly net sales  as strong demand for its Hot Wheels and Fisher-Price toys helped offset the loss of a lucrative Disney license.",
        "date": "04202016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Fisher-Price  Hot Wheels help Mattel beat sales estimates "
    },
    {
        "content": "* Disney's ABC says it reached agreement to end joint ownership of fusion with Univison becoming the sole owner- Cnbc  Further company coverage:    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "04212016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Disney's ABC says it reached agreement to end joint ownership of fusion with Univison becoming the sole owner- CNBC "
    },
    {
        "content": "* Shares up 4.2 pct   (Adds comment from conference call; updates share move)",
        "date": "04182016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "UPDATE 3-Disney princesses  Star Wars propel Hasbro results "
    },
    {
        "content": "NEW YORK Oil prices edged lower on Monday after producers failed to agree on a plan to curb global supply at a meeting in Qatar  while world stock markets rose and the Dow Jones industrial average closed above 18 000 for the first time since July. | Video ",
        "date": "04182016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Oil falls on failed output freeze; Dow above 18 000 "
    },
    {
        "content": "LOS ANGELES (Variety.com) - \"The Jungle Book\" dominated the weekend box office  grossing a massive $103.6 million  and extending the Walt Disney Company's success in making live action versions of its classic animated features.",
        "date": "04172016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Box Office: 'Jungle Book' opens to smashing $103.6 million "
    },
    {
        "content": "Hasbro Inc   the No. 2 U.S. toymaker  reported better-than-expected quarterly profit and revenue  driven by strong demand for \"Star Wars\" action figures and the addition of Disney Princess dolls to its basket of toys.",
        "date": "04182016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney princesses  Star Wars propel Hasbro results "
    },
    {
        "content": "LOS ANGELES (Variety.com) - \"The Jungle Book\" dominated the weekend box office  grossing a massive $103.6 million  and extending the Walt Disney Company's success in making live action versions of its classic animated features.",
        "date": "04172016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Box Office: 'Jungle Book' Opens to Smashing $103.6 Million "
    },
    {
        "content": "* Walt Disney Co says Thomas Staggs will leave his current position as chief operating officer of the walt disney company  effective May 6  2016",
        "date": "04042016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Walt Disney says Thomas Staggs will leave his current position "
    },
    {
        "content": "April 4 Walt Disney Co said on Monday Chief Operating Officer Thomas Staggs will step down effective May 6.",
        "date": "04042016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney COO Thomas Staggs to step down "
    },
    {
        "content": "LOS ANGELES Walt Disney Co  Chief Executive Bob Iger could be asked to postpone his retirement a third time to help smooth the transition to a new leader of the storied media company  analysts suggested after Monday's surprise resignation of Chief Operating Officer Tom Staggs.",
        "date": "04052016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney executive search may mean longer stay for CEO Iger: analysts "
    },
    {
        "content": "LOS ANGELES  April 5 Walt Disney Co  Chief Executive Bob Iger could be asked to postpone his retirement a third time to help smooth the transition to a new leader of the storied media company  analysts suggested after Monday's surprise resignation of Chief Operating Officer Tom Staggs.",
        "date": "04052016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Disney exec search may mean longer stay for CEO Iger - analysts "
    },
    {
        "content": "LOS ANGELES Tom Staggs  the veteran Walt Disney Co executive who had been widely seen as the media company's next CEO  will step down on May 6 as the board expands its search for a successor to Bob Iger  Disney said on Monday.",
        "date": "04052016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney expands search for new CEO  COO Staggs leaving "
    },
    {
        "content": "Walt Disney Co Chief Executive Bob Iger could end up extending his term for a third time  analysts said on Tuesday  following the surprise announcement that Chief Operating Officer Tom Staggs  a potential successor  will step down in May.",
        "date": "04052016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney COO's exit may see CEO Iger extending term again: analysts "
    },
    {
        "content": "April 5 Walt Disney Co Chief Executive Bob Iger could end up extending his term for a third time  analysts said on Tuesday  following the surprise announcement that Chief Operating Officer Tom Staggs  a potential successor  will step down in May.",
        "date": "04052016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney COO's exit may see CEO Iger extending term again-analysts "
    },
    {
        "content": "LOS ANGELES  April 4 Tom Staggs  the veteran Walt Disney Co executive who had been widely seen as the media company's next CEO  will step down on May 6 as the board expands its search for a successor to Bob Iger  Disney said on Monday.",
        "date": "04052016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 4-Disney expands search for new CEO  COO Staggs leaving "
    },
    {
        "content": "TEL AVIV  March 31 Playbuzz  a U.S.-Israeli platform for distributing online content  has raised $15 million in funding led by Saban Ventures  with participation from Walt Disney Co.",
        "date": "03312016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Saban  Disney invest in digital content firm Playbuzz "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 30 (Fitch) Fitch Ratings has affirmed the 'A' Issuer Default  Rating (IDR) assigned to The Walt Disney Company (Disney) and its subsidiaries.  The Rating Outlook remains Stable. A full list of ratings follows at the end of  this release. Approximately $18.9 billion of debt outstanding as of Jan. 2  2016  is affected by Fitch's action. KEY RATING DRIVERS Significant Financial Flexibility: Disney's operating profile positio",
        "date": "03302016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Fitch Affirms Disney's IDR at 'A'; Outlook Stable "
    },
    {
        "content": "LOS ANGELES  March 15 Harrison Ford and director Steven Spielberg are teaming up to make a fifth \"Indiana Jones\" action-adventure movie  due for release in July 2019  Walt Disney Co said Tuesday.",
        "date": "03152016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "UPDATE 2-Harrison Ford returns for 5th 'Indiana Jones' movie "
    },
    {
        "content": "LOS ANGELES Harrison Ford and director Steven Spielberg are teaming up to make a fifth \"Indiana Jones\" action-adventure movie  due for release in July 2019  Walt Disney Co said Tuesday. | Video ",
        "date": "03162016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Harrison Ford returns for 5th 'Indiana Jones' movie "
    },
    {
        "content": "* Says in collaboration with disney  launched Disney magic kingdoms for iPhone  iPad  iPod touch  Android and Windows phone  Source text for Eikon:  Further company coverage:",
        "date": "03172016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Gameloft SE says in collaboration with Disney  launched Disney Magic Kingdoms for iPhone  iPad  iPod touch  Android and Windows phone "
    },
    {
        "content": "LOS ANGELES (Variety.com) - Disney’s “Zootopia” scored the fourth biggest March opening ever  debuting to $73.7 million over the weekend. | Video ",
        "date": "03062016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney's 'Zootopia' opens big with $73.7 million debut "
    },
    {
        "content": "March 3 Walt Disney Co said it signed an agreement to build two cruise ships for its Disney Cruise Line business.",
        "date": "03032016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney plans to add two more ships to cruise line "
    },
    {
        "content": "March 2 Qatar's BeIn Media Group said it would buy film studio Miramax  the producer behind cult movies such as \"Pulp Fiction\".",
        "date": "03022016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Qatar's BeIn Media buys U.S. film studio Miramax "
    },
    {
        "content": "LOS ANGELES  Feb 27 Walt Disney Co  unveiled new single-day ticket prices on Saturday for the company's U.S. theme parks  switching to a three-tiered system that charges visitors more on the year's busiest days and less during typically slower periods.",
        "date": "02272016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney resets theme park ticket prices for slow  busy times "
    },
    {
        "content": "Feb 25 Having captivated boys with its Star Wars figures  Hasbro Inc is turning to Disney Princesses and the launch of its first animated movie to arrest a five-quarter slump in sales of its toys for girls.",
        "date": "02252016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Ponies and princesses: Hasbro launches charm offensive for girls "
    },
    {
        "content": "Feb 22 Walt Disney Co has named James Pitaro head of its consumer products and interactive media division  the company said in a statement on Monday.",
        "date": "02222016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney names Pitaro chair of consumer products  interactive media "
    },
    {
        "content": "SHANGHAI  Feb 15 Walt Disney Co's Hong Kong theme park posted its first net loss in four years in 2015 as Chinese visitor numbers slumped  a potential headache for the U.S. firm as it prepares to open its first mainland Chinese park in June.",
        "date": "02152016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney's Hong Kong park posts loss as Chinese visitor numbers skid "
    },
    {
        "content": "* Indexes: Dow down 0.6 pct  S&P down 0.02 pct  Nasdaq up 0.4 pct   (Updates to close)",
        "date": "02102016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "US STOCKS-S&P 500 flat; Yellen sees no reason to reverse hike plan "
    },
    {
        "content": "* Indexes up: Dow 0.34 pct  S&P 1 pct  Nasdaq 1.70 pct   (Updates to early afternoon)",
        "date": "02102016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St up as Yellen eases concerns about economy "
    },
    {
        "content": "Feb 9 Media company Walt Disney Co  reported a 13.8 percent jump in quarterly revenue  driven by the blockbuster release of \"Star Wars: The Force Awakens\".",
        "date": "02092016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "\"Star Wars\" lends force to Disney's revenue "
    },
    {
        "content": "Walt Disney Co's ESPN sports network posted a decline in quarterly profit  overshadowing the blockbuster success of \"Star Wars: The Force Awakens \" which lifted the company to record income and topped Wall Street expectations.",
        "date": "02102016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "ESPN casts shadow over 'Star Wars' success at Disney "
    },
    {
        "content": "Feb 9 Walt Disney Co's ESPN sports network posted a decline in quarterly profit  overshadowing the blockbuster success of \"Star Wars: The Force Awakens \" which lifted the company to record income and topped Wall Street expectations.",
        "date": "02102016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 3-ESPN casts shadow over 'Star Wars' success at Disney "
    },
    {
        "content": "LOS ANGELES Global ticket sales for blockbuster movie \"Star Wars: The Force Awakens\" are expected to reach $2 billion on Saturday  the Walt Disney Co said.",
        "date": "02052016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "'Star Wars' film to hit $2 billion in global sales on Saturday  Disney says "
    },
    {
        "content": "LOS ANGELES  Feb 5 Global ticket sales for blockbuster movie \"Star Wars: The Force Awakens\" are expected to reach $2 billion on Saturday  the Walt Disney Co said.",
        "date": "02052016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "'Star Wars' film to hit $2 bln in global sales on Saturday  Disney says "
    },
    {
        "content": "U.S. toymakers Mattel Inc  and Hasbro Inc  have held talks about a possible merger  Bloomberg reported on Thursday  citing people familiar with the matter. | Video ",
        "date": "02052016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Toymakers Mattel  Hasbro held talks on possible merger: Bloomberg "
    },
    {
        "content": "Walt Disney Co's mass layoffs of information technology employees  who were replaced by foreign workers  led to a lot of negative publicity  and even some political backlash  but recent lawsuits attacking the entertainment giant for the firings face significant legal hurdles.",
        "date": "01292016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Lawsuits claim Disney  consulting firms conspired to push out U.S. workers "
    },
    {
        "content": "LOS ANGELES Fans of the blockbuster \"Star Wars: The Force Awakens\" will have to wait two more years for the next installment as Walt Disney Co. on Wednesday pushed back the release of \"Star Wars: Episode VIII\" by seven months. | Video ",
        "date": "01212016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney pushes next 'Star Wars' movie release to December 2017 "
    },
    {
        "content": "Jan 20 \"Star Wars\" toys generated sales of more than $700 million in the United States in 2015  making them the No.1 property in the toy industry during the year  a retail research group said.",
        "date": "01202016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "UPDATE 1-'Star Wars' toys generate more than $700 mln in sales in 2015 "
    },
    {
        "content": "LOS ANGELES  Jan 20 Fans of the blockbuster \"Star Wars: The Force Awakens\" will have to wait two more years for the next installment as Walt Disney Co. on Wednesday pushed back the release of \"Star Wars: Episode VIII\" by seven months.",
        "date": "01202016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney pushes next 'Star Wars' movie release to December 2017 "
    },
    {
        "content": "Jan 20 Walt Disney Studios said on Wednesday \"Star Wars: Episode VIII\" will be released on Dec. 15  2017  seven months later than originally scheduled.",
        "date": "01202016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Disney postpones 'Star Wars: Episode VIII' to Dec 2017 "
    },
    {
        "content": "Jan 20 Star Wars toys generated sales of more than $700 million in the United States in 2015  making them \"the number-one property\" in the toy industry during the year  a retail research group said.",
        "date": "01202016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Star Wars toys generate more than $700 mln in sales in 2015 "
    },
    {
        "content": "Jan 12 Walt Disney Co's theme park in Shanghai is slated to open on June 16  the company said on Tuesday.",
        "date": "01122016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Shanghai Disneyland set to open in June "
    },
    {
        "content": "\"Star Wars: The Force Awakens\" broke records in China with $53 million in ticket sales on its first weekend  propelling the movie to become the third highest-grossing film globally in history  Walt Disney Co said on Sunday. | Video ",
        "date": "01112016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "'Force Awakens' grosses $53 million in China  now third biggest movie ever "
    },
    {
        "content": "\"Star Wars: The Force Awakens\" broke records in China with $53 million in ticket sales on its first weekend  propelling the movie to become the third highest-grossing film globally in history  Walt Disney Co said on Sunday.",
        "date": "01102016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "'Force Awakens' grosses $53 million in China  now 3rd biggest movie ever "
    },
    {
        "content": "\"Star Wars: The Force Awakens\" broke records in China with $53 million in ticket sales on its first weekend  propelling the movie to become the third highest-grossing film globally in history  Walt Disney Co said on Sunday.",
        "date": "01102016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "'Force Awakens' grosses $53 million in China  now third biggest movie ever "
    },
    {
        "content": "Jan 10 \"Star Wars: The Force Awakens\" broke records in China with $53 million in ticket sales on its first weekend  propelling the movie to become the third highest-grossing film globally in history  Walt Disney Co  said on Sunday.",
        "date": "01102016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "'Force Awakens' grosses $53 mln in China  now 3rd biggest movie ever "
    },
    {
        "content": "LOS ANGELES Global blockbuster movie \"Star Wars: The Force Awakens\" broke records in China with an estimated $33 million in ticket sales on its first day in the world's second-largest film market  Walt Disney Co said on Saturday. | Video ",
        "date": "01102016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "'Star Wars' opens at record pace in China  Disney says "
    },
    {
        "content": "LOS ANGELES Global blockbuster movie \"Star Wars: The Force Awakens\" broke records in China with an estimated $33 million in ticket sales on its first day in the world's second-largest film market  Walt Disney Co  said on Saturday.",
        "date": "01092016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "'Star Wars' opens at record pace in China  Disney says "
    },
    {
        "content": "LOS ANGELES  Jan 9 Global blockbuster movie \"Star Wars: The Force Awakens\" broke records in China with an estimated $33 million in ticket sales on its first day in the world's second-largest film market  Walt Disney Co said on Saturday.",
        "date": "01092016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-'Star Wars' opens at record pace in China  Disney says "
    },
    {
        "content": "Blockbuster movie \"Star Wars: The Force Awakens\" has become the highest grossing film of all time in the United States and Canada  Walt Disney Co  said  and crossed the $800 million mark at overseas box offices on Tuesday. | Video ",
        "date": "01072016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "New 'Star Wars' film shatters N. American box office record "
    },
    {
        "content": "Blockbuster movie \"Star Wars: The Force Awakens\" has become the highest grossing film of all time in the United States and Canada  Walt Disney Co  said  and crossed the $800 million mark at overseas box offices on Tuesday.",
        "date": "01062016",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "New 'Star Wars' film shatters N. American box office record "
    },
    {
        "content": "LOS ANGELES  Jan 9 Global blockbuster movie \"Star Wars: The Force Awakens\" sold an estimated $33 million in tickets on its first day in China  the world's second-largest film market  Walt Disney Co said on Saturday.",
        "date": "01092016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "New 'Star Wars' film sets records in China  Disney estimates "
    },
    {
        "content": "Blockbuster movie \"Star Wars: The Force Awakens\" has become the highest grossing film of all time in the United States and Canada  Walt Disney Co said  and crossed the $800 million mark at overseas box offices on Tuesday. | Video ",
        "date": "01072016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "New 'Star Wars' film shatters North American box office record "
    },
    {
        "content": "Jan 6 Blockbuster movie \"Star Wars: The Force Awakens\" has become the highest grossing film of all time in the United States and Canada  Walt Disney Co said  and crossed the $800 million mark at overseas box offices on Tuesday.",
        "date": "01072016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-New 'Star Wars' film shatters N. American box office record "
    },
    {
        "content": "Blockbuster movie \"Star Wars: The Force Awakens\" will pass \"Avatar\" on Wednesday to become the top-selling film of all time in the United States and Canada  Walt Disney Co said.",
        "date": "01062016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "New 'Star Wars' film to set all-time North American box office record "
    },
    {
        "content": "Jan 6 Blockbuster movie \"Star Wars: The Force Awakens\" will pass \"Avatar\" on Wednesday to become the top-selling film of all time in the United States and Canada  Walt Disney Co said.",
        "date": "01062016",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-New 'Star Wars' film to set all-time N. American box office record "
    },
    {
        "content": "SHANGHAI/LOS ANGELES After a mammoth marketing campaign  growing online chatter in China around \"Star Wars: The Force Awakens\" suggests the latest installment of the hit franchise has a shot at breaking box office records in the world's second-largest movie market. | Video ",
        "date": "12242015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "'Star Wars' takes Chinese social media by storm  flirts with record release "
    },
    {
        "content": "* Disney marketing blitz featured Great Wall  China pop star   (Adds link to Reuters TV video)",
        "date": "12242015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-'Star Wars' takes Chinese social media by storm  flirts with record release "
    },
    {
        "content": "Walt Disney Co is in talks to sell its stake in cable and digital network Fusion to partner Univision Communications Inc  the Wall Street Journal reported.",
        "date": "12222015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney in talks with Univision to exit Fusion joint venture: WSJ "
    },
    {
        "content": "SHANGHAI/LOS ANGELES  Dec 23 After a mammoth marketing campaign  growing online chatter in China around \"Star Wars: The Force Awakens\" suggests the latest installment of the hit franchise has a shot at breaking box office records in the world's second-largest movie market.",
        "date": "12232015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "'Star Wars' takes Chinese social media by storm  flirts with record release "
    },
    {
        "content": "LOS ANGELES \"Star Wars: The Force Awakens\" shattered box office records with an estimated $517 million in worldwide ticket sales through Sunday  a staggering debut that re-established the celebrated space saga as a global phenomenon under Walt Disney Co. | Video ",
        "date": "12202015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Historic 'Star Wars' debut hands Disney another hit franchise "
    },
    {
        "content": "LOS ANGELES  Dec 19 \"Star Wars: The Force Awakens\" pulled in an estimated $250 million at worldwide box offices through Friday and was on track to finish its opening weekend with record U.S. and Canadian sales  Walt Disney Co  said on Saturday.",
        "date": "12192015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "'Star Wars' movie's global sales reach massive $250 mln "
    },
    {
        "content": "LOS ANGELES  Dec 20 \"Star Wars: The Force Awakens\" shattered box office records with an estimated $517 million in worldwide ticket sales through Sunday  a staggering debut that re-established the celebrated space saga as a global phenomenon under Walt Disney Co.",
        "date": "12202015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 3-Historic 'Star Wars' debut hands Disney another hit franchise "
    },
    {
        "content": "LOS ANGELES \"Star Wars: The Force Awakens\" hauled in an estimated $250 million at global movie box offices through Friday and was on track to finish its opening weekend with record U.S. and Canadian ticket sales  Walt Disney Co said on Saturday.",
        "date": "12192015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "'Star Wars' movie's global sales reach massive $250 million "
    },
    {
        "content": "LOS ANGELES \"Star Wars: The Force Awakens\" generated a record $238 million in U.S. and Canadian ticket sales over the weekend as fans of the space saga packed theaters  according to Walt Disney Co estimates on Sunday.",
        "date": "12202015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "New 'Star Wars' film smashes box office record "
    },
    {
        "content": "Walt Disney Co's \"Star Wars: The Force Awakens \" billed as the biggest movie release of the year  raked in $14.1 million in ticket sales on its opening day in some international markets.",
        "date": "12172015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney's 'Star Wars' rakes in $14.1 million in opening day sales "
    },
    {
        "content": "LOS ANGELES  Dec 19 \"Star Wars: The Force Awakens\" hauled in an estimated $250 million at global movie box offices through Friday and was on track to finish its opening weekend with record U.S. and Canadian ticket sales  Walt Disney Co said on Saturday.",
        "date": "12192015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-'Star Wars' movie's global sales reach massive $250 mln "
    },
    {
        "content": "Dec 17 Walt Disney Co's \"Star Wars: The Force Awakens \" billed as the biggest movie release of the year  raked in $14.1 million in ticket sales on its opening day in some international markets.",
        "date": "12172015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney's \"Star Wars\" rakes in $14.1 mln in opening day sales "
    },
    {
        "content": "LOS ANGELES  Dec 21 \"Star Wars: The Force Awakens\" opened with a record-breaking $248 million at the U.S. and Canadian box office  and $529 million globally over its opening weekend  Walt Disney Co said on Monday.",
        "date": "12212015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "UPDATE 2-'Star Wars: The Force Awakens' opens to record $248 mln in North America "
    },
    {
        "content": "LOS ANGELES \"Star Wars: The Force Awakens\" opened with a record-breaking $248 million at the North American box office  and $529 million globally over its opening weekend  Walt Disney Co said on Monday.",
        "date": "12212015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "'Star Wars: The Force Awakens' opens to record $248 million in North America "
    },
    {
        "content": "\"Star Wars: The Force Awakens\" may rake in $528 million in worldwide ticket sales over the weekend  Walt Disney Co Chief Executive Bob Iger said on Bloomberg TV.",
        "date": "12212015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney CEO says 'Star Wars' global sales may reach $528 mln - Bbg "
    },
    {
        "content": "\"Star Wars: The Force Awakens\" may rake in $528 million in worldwide ticket sales over the weekend  Walt Disney Co Chief Executive Bob Iger said on Bloomberg TV.",
        "date": "12212015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney CEO says 'Star Wars' global sales may reach $528 million: Bloomberg "
    },
    {
        "content": "Walt Disney Co's shares slumped after BTIG analyst Richard Greenfield cuts his rating to \"sell\" from \"neutral\"  saying the likely success of the latest Star Wars movie would not be enough to offset the impact of subscriber losses at ESPN.",
        "date": "12182015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney shares fall after BTIG cuts to 'sell' on ESPN woes "
    },
    {
        "content": "LOS ANGELES \"Star Wars: The Force Awakens\" shattered box office records with an estimated $517 million in worldwide ticket sales through Sunday  a staggering debut that re-established the celebrated space saga as a global phenomenon under Walt Disney Co.",
        "date": "12212015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Historic 'Star Wars' debut hands Disney another hit franchise "
    },
    {
        "content": "Dec 18 Walt Disney Co's shares slumped after BTIG analyst Richard Greenfield cuts his rating to \"sell\" from \"neutral\"  saying the likely success of the latest Star Wars movie would not be enough to offset the impact of subscriber losses at ESPN.",
        "date": "12182015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney shares fall after BTIG cuts to \"sell\" on ESPN woes "
    },
    {
        "content": "SAN FRANCISCO  Dec 15 Early praise for the newest installment of \"Star Wars\" gave a boost to shares of Walt Disney and Electronic Arts  which recently launched a videogame based on the hugely popular space opera.",
        "date": "12152015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Early praise for Star Wars awakens the Force in shares of Disney  EA "
    },
    {
        "content": "Walt Disney Co  is doubling its stake in youth-focused digital media company Vice Media to $400 million  a source familiar with the matter said.",
        "date": "12082015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney doubles stake in Vice to $400 million: source "
    },
    {
        "content": "Dec 8 Walt Disney Co is doubling its stake in youth-focused digital media company Vice Media to $400 million  a source familiar with the matter said.",
        "date": "12082015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney doubles stake in Vice to $400 mln - source "
    },
    {
        "content": "Nov 27 U.S. media stocks fell on Friday after Walt Disney Co's disclosure of a drop in subscribers at ESPN spooked investors  underscoring concerns that viewers are increasingly opting for online streaming over pay TV.",
        "date": "11272015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Media stocks dip as Disney reveals subscriber losses at ESPN "
    },
    {
        "content": "SHANGHAI China has fined five knock-off Disney hotels for infringing on the iconic U.S. entertainment company's trademarks  state-run Xinhua news agency said on Wednesday in the run-up to the opening of a Walt Disney Co theme park in Shanghai.",
        "date": "11252015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "China fines five phony Disney hotels: Xinhua "
    },
    {
        "content": "* Indexes: Dow down 0.05 pct  S&P up 0.08  Nasdaq up 0.2 pct   (updates to afternoon  changes byline)",
        "date": "11272015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St flat as Disney weighs; retailers off on sales worries "
    },
    {
        "content": "SHANGHAI  Nov 25 China has fined five knock-off Disney hotels for infringing on the iconic U.S. entertainment company's trademarks  state-run Xinhua news agency said on Wednesday in the run-up to the opening of a Walt Disney Co  theme park in Shanghai.",
        "date": "11252015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "China fines five phony Disney hotels - Xinhua "
    },
    {
        "content": "* Indexes: Dow down 0.15 pct  S&P flat  Nasdaq up 0.12 pct   (Adds details  changes comment  updates prices)",
        "date": "11272015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St flat as Disney weighs; holiday sales in focus "
    },
    {
        "content": "Walt Disney Co's sports network ESPN saw a 3.2 percent fall in subscribers from the previous fiscal year  in a market where viewers are migrating to newer forms of sports coverage.",
        "date": "11262015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney's ESPN subscribers fall over 3 percent "
    },
    {
        "content": "* Indexes: Dow down 0.13 pct  S&P down 0.5 pct  Nasdaq up 0.03 pct   (Updates to open)",
        "date": "11272015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St slips as Disney weighs; holiday sales in focus "
    },
    {
        "content": "Nov 26 Walt Disney Co's sports network ESPN saw a 3.2 percent fall in subscribers from the previous fiscal year  in a market where viewers are migrating to newer forms of sports coverage.",
        "date": "11262015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney's ESPN subscribers fall over 3 pct "
    },
    {
        "content": "LOS ANGELES Walt Disney Co CEO Bob Iger has teamed up with the National Football League's Oakland Raiders and San Diego Chargers to try to build them a stadium in a Los Angeles suburb  backers of the project said in a statement on Wednesday.",
        "date": "11112015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Raiders and Chargers tap Disney's Iger for new NFL stadium "
    },
    {
        "content": "LOS ANGELES  Nov 11 Walt Disney Co CEO Bob Iger has teamed up with the National Football League's Oakland Raiders and San Diego Chargers to try to build them a stadium in a Los Angeles suburb  backers of the project said in a statement on Wednesday.",
        "date": "11112015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "NFL's Raiders  Chargers  seeking L.A. stadium  tap Disney's Iger "
    },
    {
        "content": "Walt Disney Co reported higher quarterly profit that beat Wall Street forecasts as cable networks including ESPN brought in higher advertising revenue and collected more fees from pay TV distributors.",
        "date": "11062015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney profit rises with gains at cable networks "
    },
    {
        "content": "Walt Disney Co reported a rise in quarterly profit that beat Wall Street forecasts as cable networks including ESPN brought in higher advertising revenue and collected more fees from pay TV distributors.",
        "date": "11052015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney profit rises with gains at cable networks "
    },
    {
        "content": "Nov 5 Walt Disney Co reported a rise in quarterly profit that beat Wall Street forecasts as cable networks including ESPN brought in higher advertising revenue and collected more fees from pay TV distributors.",
        "date": "11052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-Disney profit rises with gains at cable networks "
    },
    {
        "content": "Nov 5 Media company Walt Disney Co  reported a 9 percent rise in quarterly revenue as it earned more from ads on its cable TV networks including ESPN and as more people visited its U.S. theme parks.",
        "date": "11052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney revenue rises 9 pct as ad sales rise "
    },
    {
        "content": "Nov 5 Users of PlayStation Vue  Sony Corp's  cloud-based TV service in the United States  will soon be able to stream content from channels owned by Walt Disney Co   including ESPN  ABC Family and the Disney Channel.",
        "date": "11052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney-owned channels coming to PlayStation Vue "
    },
    {
        "content": "SHANGHAI  Nov 5 China will give special trademark protection to Walt Disney Co as the iconic U.S. firm prepares to open its first theme park in mainland China next year  a regulator said on Thursday.",
        "date": "11052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "China says Disney to get special trademark protection "
    },
    {
        "content": "* Shares fall more than 10 pct   (Adds details  comments from conference call)",
        "date": "11042015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 4-Time Warner warns on ad revenue as ratings fall  shares plunge "
    },
    {
        "content": "Nov 3 Walt Disney Co will invest $200 million in edgy video maker Vice Media  known for its coverage of current affairs for the Millennial generation  a person familiar with the matter told Reuters.",
        "date": "11032015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Walt Disney to invest $200 mln in Vice Media "
    },
    {
        "content": "FRANKFURT  Oct 29 German broadcaster ProSiebenSat.1 signed a new long-term deal with Disney  underpinning its popular offering that lifted its audience share to 30.1 percent  the highest it has achieved in a third quarter for 15 years.",
        "date": "10292015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Pro7 signs new deal with Disney  ups sales outlook "
    },
    {
        "content": "* To sell 13 mln \"Star Wars: Battlefront\" units in fiscal 2016",
        "date": "10292015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-Electronic Arts raises sales forecast for Star Wars' videogame "
    },
    {
        "content": "Oct 23 Walt Disney Co's sports network ESPN said it will not make its content available on YouTube  due to the recently announced ad-free subscription-based offering coined YouTube Red.",
        "date": "10232015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney's ESPN withdraws content from YouTube "
    },
    {
        "content": "Walt Disney Co's sports network ESPN is reorganizing and eliminating over 300 positions  according to a person familiar with the situation.",
        "date": "10212015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney's ESPN to eliminate over 300 positions: source "
    },
    {
        "content": "Oct 21 Walt Disney Co's sports network ESPN is reorganizing and eliminating over 300 positions  according to a person familiar with the situation.",
        "date": "10212015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Disney's ESPN to eliminate over 300 positions - source "
    },
    {
        "content": "* Says expands strategic alliance with Disney to include Asia-Pacific",
        "date": "10122015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Pandora expands strategic alliance with Disney "
    },
    {
        "content": "* Shares fall as much as 10 pct after market   (Adds CEO comment  background)",
        "date": "10152015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-Mattel sales miss estimates as Barbie slips  dollar weighs "
    },
    {
        "content": "MUMBAI Sports fans in the Indian subcontinent will be spoilt for choice after Indian Premier League (IPL) rights holder Multi Screen Media (MSM) and sports broadcaster ESPN announced plans on Wednesday to launch new channels and foray into digital market.",
        "date": "10072015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "ESPN joins hands with India's MSM to launch channels "
    },
    {
        "content": "LOS ANGELES Disney cruises can be expensive  but you do not have to choose between sailing with Mickey and sending your children to college someday.",
        "date": "09142015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "How to find a Disney cruise for less "
    },
    {
        "content": "LOS ANGELES  Sept 14 Disney cruises can be expensive  but you do not have to choose between sailing with Mickey and sending your children to college someday.",
        "date": "09142015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "CORRECTED-COLUMN-How to find a Disney cruise for less "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  September 14 (Fitch) Fitch Ratings has assigned an 'A' rating to The  Walt Disney Company's (Disney) offering of benchmark-sized three-  five-  and  10-year senior unsecured notes.  The Rating Outlook is Stable. Approximately  $15.3 billion of debt was outstanding as of June 27  2015 including $2.4 billion  of commercial paper (CP). A full list of ratings follows at the end of this  release. KEY RATING DRIVERS --Disney's operat",
        "date": "09142015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Fitch Rates Disney's Notes Offering 'A'; Outlook Stable "
    },
    {
        "content": "NEW YORK  Sept 14 This fall  Boston-based fund giant Fidelity plans to celebrate the 25-year tenure of William Danoff  head of the biggest fund run by a single manager in the U.S. and arguably the best-performing large cap manager of his time.",
        "date": "09142015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "RPT-Fidelity's Danoff is face of key man risk as he hits 25-year mark "
    },
    {
        "content": "NEW YORK  Sept 14 This fall  Boston-based fund giant Fidelity plans to celebrate the 25-year tenure of William Danoff  head of the biggest fund run by a single manager in the U.S. and arguably the best-performing large cap manager of his time.",
        "date": "09142015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Fidelity's Danoff is face of key man risk as he hits 25-year mark "
    },
    {
        "content": "Sept 15 The Walt Disney Co on Tuesday named two executives to newly created positions in its Disney/ABC Television Group to focus on digital media and consumer experience at a time when TV viewing habits are rapidly changing.",
        "date": "09152015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney hires digital  consumer executives for new TV roles "
    },
    {
        "content": "WASHINGTON  Sept 8The U.S. Labor Department has cleared Infosys Ltd of any wrongdoing and closed its investigation after American technology workers at Southern California Edison complained their jobs were wrongfully outsourced to foreigners working on H-1B visas  Infosys has confirmed.",
        "date": "09092015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Infosys says cleared in U.S. visa probe by Labor Department "
    },
    {
        "content": "Sept 8 Walt Disney Co's studio unit said customers of Amazon.com Inc and Microsoft Corp's  video services will get access to the collection on its cloud-based movie storage service from Tuesday.",
        "date": "09082015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Microsoft  Amazon video to join Disney's cloud movie service "
    },
    {
        "content": "* Says signs agreement with the Walt Disney Co (China) to use Disney characters and labels in products",
        "date": "09072015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Wuxi Little Swan in agreement with Walt Disney to use Disney characters and labels on products "
    },
    {
        "content": "DreamWorks Studios  the film company co-founded by Steven Spielberg  will split from Walt Disney Co after the release of his film  \"The BFG \" the Hollywood Reporter said  citing people familiar with the matter.",
        "date": "09022015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Spielberg's DreamWorks to split from Disney: Hollywood Reporter "
    },
    {
        "content": "* Split to happen post the release of Spielberg's \"The BFG\"   (Adds Disney response  background about deal  companies)",
        "date": "09022015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-Spielberg's DreamWorks to split from Disney - Hollywood Reporter "
    },
    {
        "content": "DreamWorks Studios  the film company co-founded by Steven Spielberg  will split from Walt Disney Co after the release of his film  \"The BFG \" the Hollywood Reporter said  citing people familiar with the matter. | Video ",
        "date": "09032015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Spielberg's DreamWorks to split from Disney: Hollywood Reporter "
    },
    {
        "content": "Sept 2 DreamWorks Studios  the film company headed by director Steven Spielberg  will split from Walt Disney Co after the release of his upcoming film  \"The BFG \" the Hollywood Reporter said  citing people familiar with the matter.",
        "date": "09022015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Spielberg's DreamWorks to split from Disney - Hollywood Reporter "
    },
    {
        "content": "Aug 27 CBS Radio and Walt Disney's  ESPN are joining a handful of companies that will promote podcasts to advertisers at the Interactive Advertising Bureau's first podcast upfronts next month  executives told Reuters.",
        "date": "08272015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "ESPN  CBS Radio to promote podcasts at industry ad event "
    },
    {
        "content": "LOS ANGELES \"Star Wars\" producers on Wednesday announced a marathon  worldwide roll-out of toys next week for its upcoming \"The Force Awakens\" movie in a promotional push that seeks to capture the  excitement that once greeted new \"Harry Potter\" book releases. | Video ",
        "date": "08272015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "'Star Wars' toys get marathon roll-out in Disney merchandising push "
    },
    {
        "content": "LOS ANGELES \"Star Wars\" producers on Wednesday announced a marathon  worldwide roll-out of toys next week for its upcoming \"The Force Awakens\" movie in a promotional push that seeks to capture the  excitement that once greeted new \"Harry Potter\" book releases.",
        "date": "08262015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "'Star Wars' toys get marathon roll-out in Disney merchandising push "
    },
    {
        "content": "LOS ANGELES  Aug 26 \"Star Wars\" producers on Wednesday announced a marathon  worldwide roll-out of toys next week for its upcoming \"The Force Awakens\" movie in a promotional push that seeks to capture the  excitement that once greeted new \"Harry Potter\" book releases.",
        "date": "08262015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-\"Star Wars\" toys get marathon roll-out in Disney merchandising push "
    },
    {
        "content": "LOS ANGELES  Aug 26 \"Star Wars\" fans eagerly anticipating the December release of \"The Force Awakens\" won't have to wait to get their hands on toys and memorabilia tied to the movie - Walt Disney Co. on Wednesday will hold a global online event to roll them out.",
        "date": "08262015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "RPT-Disney will awaken new 'Star Wars' toys in global livestream event "
    },
    {
        "content": "U.S. stocks rose on Monday after strong economic data boosted the housing sector and as investors bought recently battered shares in biotech and media.",
        "date": "08172015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Wall St. up on housing data; Disney boosts media stocks "
    },
    {
        "content": "* Disney shines as Star Wars will make its way to theme parks",
        "date": "08172015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St up on housing data; Disney boosts media stocks "
    },
    {
        "content": "Anaheim  Calif. \"Star Wars\" is being transported from a galaxy far  far away to | Video ",
        "date": "08162015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "'Star Wars' land coming to Disney's California  Florida parks "
    },
    {
        "content": "Anaheim  Calif. \"Star Wars\" is being transported from a galaxy far  far away to",
        "date": "08152015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "'Star Wars' land coming to Disney's California  Florida parks "
    },
    {
        "content": "Anaheim  Calif.  Aug 15 \"Star Wars\" is being transported from a galaxy far  far away to  California and Florida after Walt Disney Co announced plans for two theme park expansions that will bring the celebrated film franchise to life.",
        "date": "08162015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 3-'Star Wars' land coming to Disney's California  Florida parks "
    },
    {
        "content": "Anaheim  Calif.  Aug 15 \"Star Wars\" is being transported from a galaxy far  far away to  California and Florida after Walt Disney Co announced on Saturday it was developing two new expansions at its theme parks that will bring the celebrated film franchise to life.",
        "date": "08152015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-'Star Wars' land coming to Disney's California  Florida parks "
    },
    {
        "content": "LOS ANGELES  Aug 15 Walt Disney Co said on Saturday that it is developing two 14-acre \"Star Wars\" lands with rides and attractions at its Anaheim  California and Orlando  Florida theme parks.",
        "date": "08152015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "'Star Wars' land coming to Disney's California  Florida theme parks "
    },
    {
        "content": "** Cruise operator Carnival and Merlin  the world's second largest theme park operator behind Walt Disney  down 1-2 pct as companies seen likely to be hurt by a weaker Chinese yuan currency",
        "date": "08112015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BUZZ-Cruise & theme park operators: Yuan devaluation takes a toll "
    },
    {
        "content": "Aug 6 U.S. media stocks have taken an indiscriminate beating this week  but many big fund managers still like entertainment conglomerate Walt Disney Co  while turning negative for the long term on Discovery Communications  owner of several niche television franchises.",
        "date": "08062015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Despite media stock beat down  Disney stands tall with U.S. funds "
    },
    {
        "content": " ",
        "date": "08052015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "WRAPUP 2-U.S. cable TV companies' shares crushed after Disney disappoints "
    },
    {
        "content": "* Indexes finish down: Dow 0.69 pct  S&P 0.78 pct  Nasdaq 1.62 pct   (Updates to close  adds detail on Zynga)",
        "date": "08062015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Media stock selloff leaves Wall Street bruised "
    },
    {
        "content": "LOS ANGELES Walt Disney Co has acknowledged that even powerhouse network ESPN and its live sports programming are not insulated from the massive changes shaking up the television landscape  confirming warnings from skeptics.",
        "date": "08052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "ESPN customer losses show even sports vulnerable as TV shifts "
    },
    {
        "content": "* Indexes down: Dow 0.7 pct  S&P 0.75 pct  Nasdaq 1.53 pct   (Updates to mid-afternoon)",
        "date": "08062015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St slumps as media stocks hemorrhage "
    },
    {
        "content": "* Indexes down: Dow 0.72 pct  S&P 0.82 pct  Nasdaq 1.61 pct   (Updates to early afternoon)",
        "date": "08062015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St slumps as media stocks bleed "
    },
    {
        "content": "AMC Networks Inc's  shares fell as much as 14 percent despite the company's strong results  continuing a slide triggered by Walt Disney Co's  forecast that suggested that more customers were deserting paid TV than expected.",
        "date": "08062015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney warning eclipses AMC Networks' sales rise "
    },
    {
        "content": "Aug 5 Nagging investor concerns over viewers cutting the cord on cable television and moving online turned into a rout in the sector's shares on Wednesday after Walt Disney Co reported a dip in subscribers for its cornerstone sports channel ESPN and rivals produced a mixed batch of earnings.",
        "date": "08052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "RPT-WRAPUP 2-U.S. cable TV companies' shares crushed after Disney disappoints "
    },
    {
        "content": "* Shares fall as much as 14 pct   (Adds analyst comments  details; updates shares)",
        "date": "08062015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-Disney warning eclipses AMC Networks' sales rise "
    },
    {
        "content": "* Indexes down: Dow 0.70 pct  S&P 0.86 pct  Nasdaq 1.68 pct   (Adds details  changes comment  updates prices)",
        "date": "08062015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St falls as media stocks slump; jobs data awaited "
    },
    {
        "content": "Nagging investor concerns over viewers cutting the cord on cable television and moving online turned into a rout in the sector's shares on Wednesday after Walt Disney Co  reported a dip in subscribers for its cornerstone sports channel ESPN and rivals produced a mixed batch of earnings.",
        "date": "08052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "U.S. cable TV companies' shares crushed after Disney disappoints "
    },
    {
        "content": "* Indexes down: Dow 0.40 pct  S&P 0.24 pct  Nasdaq 0.32 pct   (Updates to open)",
        "date": "08062015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St lower as earnings in focus  media stocks slump "
    },
    {
        "content": "* Dow flat  S&P up 0.4 percent  Nasdaq up 0.8 percent   (Updates to early afternoon)",
        "date": "08052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Tech leads Nasdaq  S&P 500; Disney sparks media selloff "
    },
    {
        "content": "TOKYO  Aug 3 Fast Retailing Co Ltd's  Uniqlo clothing chain said on Monday that it was expanding its collaboration with Walt Disney Co to offer a wider range of products and that it would open a flagship store at the Florida Disney World's shopping complex next spring.",
        "date": "08032015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Star Wars meets Uniqlo as Fast Retailing  Disney expand product tie-up "
    },
    {
        "content": "LONDON  Aug 6 European equity futures fell on Thursday  with media shares expected to come in the spotlight after an overnight fall in the shares of Disney after Disney cut profit forecasts for its cable networks unit.",
        "date": "08062015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "European Factors to Watch-Equity futures slip lower "
    },
    {
        "content": "Aug 4 Walt Disney Co lowered profit guidance for its cable networks unit and reported quarterly revenue slightly below Wall Street forecasts  sending its shares down 6 percent on Tuesday.",
        "date": "08042015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "UPDATE 3-Disney shares drop after company lowers cable outlook "
    },
    {
        "content": "NEW YORK  Aug 5 The S&P 500 and Nasdaq Composite rose on Wednesday following three days of losses as tech shares advanced  while the blue-chip Dow index ended flat  weighed by Disney's largest daily drop in almost seven years.",
        "date": "08052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS SNAPSHOT-Nasdaq  S&P 500 up on tech; Disney leads media selloff "
    },
    {
        "content": "* Indexes finish down: Dow 0.27 pct  S&P 0.22 pct  Nasdaq 0.19 pct   (Updates to close)",
        "date": "08042015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall Street moves lower on Apple  interest rate worries "
    },
    {
        "content": "* Time Warner shares fall as much as 9 pct   (Updates shares)",
        "date": "08052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 4-Time Warner falls as Disney's cable warning spooks sector "
    },
    {
        "content": "Aug 4 Media company Walt Disney Co's  revenue rose 5.1 percent in the third quarter as its TV networks pulled in higher fees and theme parks attracted more visitors.",
        "date": "08042015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney revenue rises 5.1 percent "
    },
    {
        "content": " ",
        "date": "08052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "CORRECTED-UPDATE 3-Disney shares drop after company lowers cable outlook "
    },
    {
        "content": "* Indexes down: Dow 0.51 pct  S&P 0.43 pct  Nasdaq 0.41 pct   (Updates to afternoon)",
        "date": "08042015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Apple and interest rate jitters weigh on Wall Street "
    },
    {
        "content": "* Indexes down: Dow 0.21 pct  S&P 0.16 pct  Nasdaq 0.22 pct   (Updates to early afternoon)",
        "date": "08042015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St lower as Apple slips to 6-month low "
    },
    {
        "content": "* Indexes down: Dow 0.07 pct  S&P 0.08 pct  Nasdaq 0.23 pct   (Adds details  comment  updates prices)",
        "date": "08042015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St falls as Apple slips to 6-month low "
    },
    {
        "content": "* Indexes up: Dow 0.02 pct  S&P 0.04 pct  Nasdaq 0.05 pct   (Updates to open)",
        "date": "08042015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St flat amid slew of earnings  Apple weighs "
    },
    {
        "content": "Aug 4 U.S. stock index futures were lower on Tuesday as investors awaited earnings reports from a batch of companies that includes Walt Disney Co and Kellogg .",
        "date": "08042015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Futures lower as investors await earnings  data "
    },
    {
        "content": "* Sorin shareholders to buy all 53 246 sorin shares  for which cash exit rights were exercised  at offer price of 2.2043 euros ($2.42) per share",
        "date": "07242015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Pre-emptive offer of Sorin shares for which cash exit rights have been exercised fully subscribed "
    },
    {
        "content": "July 14 Walt Disney Co said its new Shanghai Disneyland theme park will include six themed lands  and offer attractions based on the Star Wars and Marvel Universe movie series.",
        "date": "07152015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Shanghai Disneyland plans Star Wars  Marvel attractions "
    },
    {
        "content": "SHANGHAI  July 15 Mickey Mouse  Peter Pan and Han Solo will beckon visitors to Shanghai when Walt Disney Co  opens its first theme park in China in the spring of next year.",
        "date": "07152015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "REFILE-UPDATE 1-Shanghai Disneyland plans Star Wars  Marvel attractions "
    },
    {
        "content": "ANAHEIM  Calif.  July 7 The Walt Disney Co  has won a 30-year renewal of a special tax exemption for visitors to its attractions in Anaheim  California  as part of a planned $1 billion-plus expansion of the famed theme park complex there.",
        "date": "07082015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney wins extension of tax break in Anaheim  California "
    },
    {
        "content": "LOS ANGELES  July 6 The \"happiest place on Earth\" will keep a special tax exemption in Anaheim  California  for 30 more years if the City Council approves the Walt Disney Co's plan for a $1 billion-plus expansion of its theme park complex in the city.",
        "date": "07062015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney seeks continued tax exemption from Anaheim  California "
    },
    {
        "content": "June 30 Walt Disney Co said it named Christine McCarthy as its chief financial officer.",
        "date": "06302015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney names treasurer Christine McCarthy as CFO "
    },
    {
        "content": "ORLANDO  Fla. Walt Disney Co will ban selfie sticks starting next week at its theme parks around the world  the company said on Friday  joining a growing list of attractions that restrict the camera accessories for safety reasons.",
        "date": "06262015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney bans selfie sticks at theme parks over safety concerns "
    },
    {
        "content": "NEW YORK  June 26 Investors who have the most to win if Amazon  Disney and other consumer discretionary companies continue to push the sector higher are getting increasingly nervous  judging by their options activity.",
        "date": "06262015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Consumer Discretionary hedging activity up ahead of earnings "
    },
    {
        "content": "June 23 Lexibook Linguistic Electronic System SA  :",
        "date": "06232015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Lexibook announces strategic partnership with Walt Disney "
    },
    {
        "content": "LOS ANGELES Walt Disney Co's interactive unit is considering bringing Disney Infinity or other video games into the world of virtual reality.",
        "date": "06182015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney exploring virtual reality for video games "
    },
    {
        "content": "LOS ANGELES  June 15 Wendy Wright is a home-schooling mother of two  a prolific blogger and a self-described \"Disney Nut.\" Her cats are named Mickey and Minnie  and her blog is filled with advice for visiting Disneyland  tips for holding Disney-themed parties and reviews of Disney movies.",
        "date": "06152015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "RPT-INSIGHT-Disney's powerful marketing force: social media moms "
    },
    {
        "content": "LOS ANGELES Wendy Wright is a home-schooling mother of two  a prolific blogger and a self-described \"Disney Nut.\" Her cats are named Mickey and Minnie  and her blog is filled with advice for visiting Disneyland  tips for holding Disney-themed parties and reviews of Disney movies.",
        "date": "06152015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney's powerful marketing force: social media moms "
    },
    {
        "content": "LOS ANGELES  June 15 Wendy Wright is a home-schooling mother of two  a prolific blogger and a self-described \"Disney Nut.\" Her cats are named Mickey and Minnie  and her blog is filled with advice for visiting Disneyland  tips for holding Disney-themed parties and reviews of Disney movies.",
        "date": "06152015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "INSIGHT-Disney's powerful marketing force: social media moms "
    },
    {
        "content": "June 9 Fuhu Inc  creator of kid-friendly computer tablets  said it will launch a new tablet that includes content from Walt Disney Co  Dreamworks Animation SKG Inc  Discovery Communications Inc and others.",
        "date": "06092015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Tablet maker Fuhu launches new content subscription service "
    },
    {
        "content": "* Says signs deal with Disney in Shanghai that allows unit to use Disney characters in its products",
        "date": "06092015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Haers signs deal with Disney in Shanghai to use Disney characters in products "
    },
    {
        "content": "NEW YORK Walt Disney Co could climb 50 percent over the next three years on its uncanny ability to generate profits from its businesses including movies  merchandise and parks and cruise lines  Barron's said in its latest edition published on Sunday.",
        "date": "05312015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney shares may rise 50 percent in three years: Barron's "
    },
    {
        "content": "Walt Disney Co  said James Rasulo  a 29-year veteran of the media company  would step down as chief financial officer at the end of the month.",
        "date": "06012015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney CFO James Rasulo to step down "
    },
    {
        "content": "June 1 Walt Disney Co said James Rasulo  a 29-year veteran of the media company  would step down as chief financial officer at the end of the month.",
        "date": "06012015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Disney CFO James Rasulo to step down "
    },
    {
        "content": "June 1 Walt Disney Co said James Rasulo has stepped down as chief financial officer  effective June 30.",
        "date": "06012015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney CFO James Rasulo steps down "
    },
    {
        "content": "ANAHEIM  California The mobile technology that helps Walt Disney Co theme park guests beat lines and pay for Mickey Mouse ears at the company's flagship resort in Florida will expand in some form to other Disney resorts  Chief Operating Officer Tom Staggs said.",
        "date": "05222015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney to bring mobile technology to more parks "
    },
    {
        "content": "* Says unit signs deal with Disney in Shanghai that allows unit to use Disney characters in its products",
        "date": "05192015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Feitian's unit signs deal with Disney in Shanghai to use Disney characters in products "
    },
    {
        "content": "Walt Disney Co on Thursday named its parks and resorts' executive vice president of marketing  Leslie Ferraro  as president of its fast-growing consumer products division.",
        "date": "05082015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney names Leslie Ferraro president of consumer products unit "
    },
    {
        "content": "May 7 Walt Disney Co on Thursday named its parks and resorts' executive vice president of marketing  Leslie Ferraro  as president of its fast-growing consumer products division.",
        "date": "05072015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney names Leslie Ferraro president of consumer products unit "
    },
    {
        "content": "May 4 Samsung and Walt Disney's  Marvel introduced a marketing campaign that for the first time promotes a movie using short virtual reality films.",
        "date": "05042015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Samsung  Marvel use virtual reality for 'Avenger' movie ads "
    },
    {
        "content": "May 4 Samsung and Walt Disney's  Marvel introduced a marketing campaign that uses virtual reality to promote \"Avengers: Age of Ultron\" as more studios look to the new technology to push movies.",
        "date": "05042015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Samsung  Marvel use virtual reality for 'Avenger' movie ads "
    },
    {
        "content": "* Indexes off: Dow 0.6 pct  S&P 0.9 pct  Nasdaq 1.4 pct   (Updates to early afternoon)",
        "date": "05052015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St falls on weak trade data; energy stocks turn lower "
    },
    {
        "content": "Walt Disney Co's  quarterly revenue beat analysts' expectations  helped by increased spending by visitors at its theme parks and strength in the company's TV networks business. | Video ",
        "date": "05052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney revenue gets lift from theme parks  TV networks "
    },
    {
        "content": "May 5 Walt Disney Co's quarterly revenue beat analysts' expectations  helped by increased spending by visitors at its theme parks and strength in the company's TV networks business.",
        "date": "05052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-Disney revenue gets lift from theme parks  TV networks "
    },
    {
        "content": "* Indexes off: Dow 0.5 pct  S&P 0.8 pct  Nasdaq 1.3 pct   (Adds details  changes comment  updates prices)",
        "date": "05052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St lower as weak trade data offsets rally in oil prices "
    },
    {
        "content": "* Futures off: Dow 61 pts  S&P 7.25 pts  Nasdaq 23.25 pts   (Adds details  comment  updates prices)",
        "date": "05052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St set for lower open as trade data suggests GDP contraction "
    },
    {
        "content": "May 5 Walt Disney Co reported a 7 percent rise in quarterly revenue  helped by higher ad sales and affiliate fees in its media networks business and an increase in spending by visitors at its theme parks.",
        "date": "05052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney revenue rises with lift from media networks  theme parks "
    },
    {
        "content": "ESPN sued Verizon Communications  on Monday for breach of contract involving a new pay TV offering  as the cable sports network fired the latest volley in a mounting battle with the telecommunications company.",
        "date": "04272015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "ESPN sues Verizon  escalates battle over new pay TV offering "
    },
    {
        "content": "* Kudelski Group and Walt Disney Company sign patent license agreement",
        "date": "04282015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "BRIEF-Kudelski and Walt Disney Company sign patent license agreement "
    },
    {
        "content": "NEW YORK Verizon Communications Inc said on Thursday that Walt Disney Co and Twenty-First Century Fox are not running ads promoting the wireless carrier's recently launched FiOS Custom TV service on its channels in the New York market.",
        "date": "04232015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Verizon says Disney  Fox pull ads promoting Custom TV in N.Y. "
    },
    {
        "content": "April 22 Verizon Communications Inc acted on its own when the company decided how to offer ESPN and other Walt Disney Co channels in smaller custom TV packages  a spokeswoman for ESPN said on Wednesday.",
        "date": "04222015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "UPDATE 1-ESPN says Verizon made unilateral decision on custom TV offerings "
    },
    {
        "content": "NEW YORK  April 23 Verizon Communications Inc  said on Thursday that Walt Disney Co is not running ads promoting the wireless carrier's recently launched Fios Custom TV service on its channels in the New York market.",
        "date": "04232015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney not running ads promoting FiOS Custom TV in NY "
    },
    {
        "content": "April 22 Verizon Communications Inc acted on its own when the company decided how to offer ESPN and other Walt Disney Co channels in smaller custom TV packages  a spokeswoman for ESPN said on Wednesday.",
        "date": "04232015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "CORRECTED-UPDATE 1-ESPN says Verizon made unilateral decision on custom TV offerings "
    },
    {
        "content": "April 16 Mattel Inc's quarterly net sales topped analysts' estimates for the first time in six quarters as new Chief Executive Christopher Sinclair focuses on turning around the business in the face of flagging sales of Barbie dolls.",
        "date": "04162015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 3-Mattel's sales beat estimates  shares rise "
    },
    {
        "content": "ORLANDO  Fla. A passenger killed in a crash at a Walt Disney World Speedway race-car attraction has been identified as an instructor who was riding in a Lamborghini that hit a guardrail after the driver lost control  according to the Florida Highway Patrol.",
        "date": "04132015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Driving instructor killed in Disney World race car crash "
    },
    {
        "content": "ORLANDO  Fla.  April 13 The passenger killed in a crash at a Walt Disney World Speedway race-car attraction has been identified as an instructor who was riding in a Lamborghini that hit a guardrail after the driver lost control  according to the Florida Highway Patrol.",
        "date": "04132015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Driving instructor killed in Disney World \"exotic\" car experience "
    },
    {
        "content": "Walt Disney Co CEO Bob Iger learned that Steve Jobs' cancer had returned less than an hour before Disney announced it was buying Jobs' Pixar studio in 2006  and Iger kept the Apple co-founder's condition a secret for three years  according to Bloomberg  citing a new biography of Jobs.",
        "date": "03212015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Steve Jobs bio says Disney CEO kept Jobs' condition a secret: Bloomberg "
    },
    {
        "content": "March 21 Walt Disney Co CEO Bob Iger learned that Steve Jobs' cancer had returned less than an hour before Disney announced it was buying Jobs' Pixar studio in 2006  and Iger kept the Apple co-founder's condition a secret for three years  according to Bloomberg  citing a new biography of Jobs.",
        "date": "03212015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Steve Jobs bio says Disney CEO kept Jobs' condition a secret -Bloomberg "
    },
    {
        "content": "Fuhu Inc  which makes kid-friendly computer tablets  said it signed deals with Walt Disney Co and Discovery Communications Inc to add their content to monthly subscription offers on its nabi tablets.",
        "date": "03112015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Fuhu's nabi tablet to offer content from Disney  Discovery "
    },
    {
        "content": "March 11 Fuhu Inc  which makes kid-friendly computer tablets  said it signed deals with Walt Disney Co  and Discovery Communications Inc to add their content to monthly subscription offers on its nabi tablets.",
        "date": "03112015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "REFILE-Fuhu's nabi tablet to offer content from Disney  Discovery "
    },
    {
        "content": "Thomson Reuters March 11  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  now click on Related Co Data  now click on Co Events.                ",
        "date": "03112015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "March 12 Walt Disney Co will release the eighth installment in the \"Star Wars\" sci-fi film series on May 26  2017  Chief Executive Bob Iger said on Thursday.",
        "date": "03122015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney to release 'Star Wars: Episode VIII' in May 2017 "
    },
    {
        "content": "LOS ANGELES The Walt Disney Co has started work on a sequel to \"Frozen \" the best-selling animated movie of all time and a global merchandising phenomenon that helped push the media giant to record profits. | Video ",
        "date": "03122015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney feeds 'Frozen' frenzy with news of sequel "
    },
    {
        "content": "* Indexes up: Dow 1.5 pct  S&P 1.3 pct  Nasdaq 0.9 pct   (Updates close with latest volume  Disney  Mattel shares up)",
        "date": "03122015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St bounces back in broad rally; bank shares gain "
    },
    {
        "content": "LOS ANGELES  March 12 The Walt Disney Co  has started work on a sequel to \"Frozen \" the best-selling animated movie of all time and a global merchandising phenomenon that helped push the media giant to record profits.",
        "date": "03122015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Disney feeds 'Frozen' frenzy with news of sequel "
    },
    {
        "content": "* Disney CEO Iger says changes to net neutrality rules will not have a material impact on the company  Source text for Eikon:  Further company coverage:    (Reporting By Lisa Richwine)",
        "date": "03122015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Disney CEO sees no material impact from net neutrality changes "
    },
    {
        "content": "March 12 Walt Disney Co shareholders re-elected Chief Executive Officer Bob Iger and nine other directors and defeated a proposal to split the chairman and CEO roles at the media giant  according to preliminary vote tallies released on Thursday.",
        "date": "03122015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney shareholders re-elect board  reject chair/CEO split "
    },
    {
        "content": "Thomson Reuters March 12  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  now click on Related Co Data  now click on Co Events.                ",
        "date": "03122015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  February 27 (Fitch) Fitch Ratings has published its new Rating  Navigators for the following North American diversified Media companies: --CBS Corporation --Cox Enterprises  Inc. --Discovery Communications LLC --NBCUniversal Media LLC --Time Warner Inc. --Twenty-First Century Fox  Inc. --Viacom  Inc. --The Walt Disney Company  Inc.  These Rating Navigators should be read in tandem with its companion report  entitled 'Media:  R",
        "date": "02272015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Fitch Publishes Rating Navigators for U.S. Diversified Media Companies "
    },
    {
        "content": "ORLANDO  Fla.  Feb 22 A one-day ticket to the Magic Kingdom at Walt Disney World in Orlando jumped on Sunday to $105 from $99  an increase that likely makes the Florida family attraction the first in the industry to breach the $100 psychological barrier.",
        "date": "02222015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney's Magic Kingdom one-day passes breach $100 mark "
    },
    {
        "content": "LOS ANGELES  Feb 23 Walt Disney Co named Bob Chapek chairman of its parks and resorts division  the company said in a statement on Monday.",
        "date": "02232015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney names Chapek chairman of parks and resorts "
    },
    {
        "content": "LOS ANGELES  Feb 23 Walt Disney Co named consumer products chief Bob Chapek the new chairman of its parks and resorts division  the company said in a statement on Monday.",
        "date": "02232015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Disney names Chapek chairman of parks and resorts "
    },
    {
        "content": "LOS ANGELES  Feb 22 Disney Animation's \"Big Hero 6 \" a comic book-inspired tale of a teen science genius who befriends a huggable robot and forms a superhero team  won the Academy Award for best animated feature film on Sunday.",
        "date": "02232015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-'Big Hero 6' wins best animated feature Oscar "
    },
    {
        "content": "Feb 10 The following corporate finance-related stories were reported by media:",
        "date": "02102015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "UPDATE 1-Market Chatter-Corporate finance press digest "
    },
    {
        "content": "SEATTLE A century-old Seattle house that was featured in a marketing stunt to publicize Walt Disney Co's balloon adventure movie \"Up\" because it is wedged in the middle of a modern development could be sold at auction next month  media reported on Friday.",
        "date": "02062015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Sell out: Seattle home tied to Disney's 'Up' movie to be auctioned "
    },
    {
        "content": "LOS ANGELES Walt Disney Co named Thomas Staggs  the head of its theme parks and resorts unit  as chief operating officer of the company on Thursday  putting him in the lead to succeed Chief Executive Officer Bob Iger in 2018.",
        "date": "02052015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney promotes parks chief Staggs  seen in lead to succeed Iger "
    },
    {
        "content": "LOS ANGELES  Feb 5 Walt Disney Co named Thomas Staggs  the head of its theme parks and resorts unit  as chief operating officer of the company on Thursday  putting him in the lead to succeed Chief Executive Officer Bob Iger in 2018.",
        "date": "02052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-Disney promotes parks chief Staggs  seen in lead to succeed Iger "
    },
    {
        "content": "* Indexes: Dow up 0.04 pct  S&P down 0.4 pct  Nasdaq down 0.2 pct   (Updates to close)",
        "date": "02042015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St ends lower with oil prices  renewed Greece worries "
    },
    {
        "content": "LOS ANGELES  Feb 5 Walt Disney Co named parks division chief Thomas Staggs as chief operating officer of the media and theme park company  making him the likely successor to Chief Executive Bob Iger.",
        "date": "02052015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney parks chief Staggs named chief operating officer "
    },
    {
        "content": "* Indexes: Dow up 0.1 pct  S&P off 0.3 pct  Nasdaq down 0.1 pct   (Updates to afternoon)",
        "date": "02042015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-S&P  Nasdaq slip after 2-day run up; energy drops with oil "
    },
    {
        "content": "Walt Disney Co's  quarterly revenue and profit topped Wall Street estimates as visits to its theme parks rose and last year's animated film hit \"Frozen\" drove home video and toy sales.",
        "date": "02032015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "Disney profit boosted by theme park visitors  'Frozen' toys "
    },
    {
        "content": "* Indexes: Dow up 0.1 pct  S&P off 0.4 pct  Nasdaq down 0.2 pct   (Updates to midday  changes byline)",
        "date": "02042015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-S&P  Nasdaq down after 2-day run up; biotechs  energy fall "
    },
    {
        "content": "Feb 3 Walt Disney Co's quarterly revenue and profit topped Wall Street estimates as visits to its theme parks rose and last year's animated film hit \"Frozen\" drove home video and toy sales.",
        "date": "02032015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 2-Disney profit boosted by theme park visitors  'Frozen' toys "
    },
    {
        "content": "* Plans to open Shanghai theme park in spring 2016  CEO Iger says",
        "date": "02032015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Disney plans to open Shanghai park in spring 2016 "
    },
    {
        "content": "* Indexes off: Dow 0.2 pct  S&P 0.47 pct  Nasdaq 0.59 pct   (Updates to market open)",
        "date": "02042015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St down after 2-day run after ADP as energy drags "
    },
    {
        "content": "* Disney's Iger says 'it's a time to be careful' about taking young children to theme parks  public places -CNBC",
        "date": "02032015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BRIEF-Disney CEO says no discernable impact from measles outbreak "
    },
    {
        "content": "* Futures off: Dow 18 pts  S&P 6.25 pts  Nasdaq 14.5 pts   (Adds ADP data  quote)",
        "date": "02042015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "US STOCKS-Wall St to open lower after 2-day run  ADP data "
    },
    {
        "content": "Walt Disney Co's  quarterly profit topped Wall Street's  estimates as its blockbuster animated film \"Frozen\" heated up home entertainment and toy sales  and visitors flocked to the company's U.S. theme parks. | Video ",
        "date": "02042015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "'Frozen' still hot as Disney profit beats forecasts "
    },
    {
        "content": "Feb 3 Walt Disney Co's quarterly revenue rose 8.8 percent  helped by an increase in visitors to its theme parks in the holiday quarter and higher sales of toys and merchandise based on its hit movie \"Frozen\".",
        "date": "02032015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney first-quarter revenue rises 9 pct "
    },
    {
        "content": "Walt Disney Co will push back the opening of Shanghai Disneyland until the first half of 2016 from a scheduled start at the end of this year due to an expansion of its plans for the theme park  said a person familiar with the matter.",
        "date": "02032015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Shanghai Disneyland opening delayed to first half of 2016: source "
    },
    {
        "content": "Jan 30 Mattel Inc needs to move with a \"sense of urgency\" to create toys that connect with young customers  its interim CEO said  as dolls based on Disney's blockbuster film \"Frozen\" stole the show from its Barbie dolls in the holiday quarter.",
        "date": "01302015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "UPDATE 3-Mattel CEO feels \"sense of urgency\" for new toys as Barbie ages "
    },
    {
        "content": "Feb 2 Walt Disney Co will push back the opening of Shanghai Disneyland until the first half of 2016 from a scheduled start at the end of this year due to an expansion of its plans for the theme park  said a person familiar with the matter.",
        "date": "02032015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "RPT-UPDATE 1-Shanghai Disneyland opening delayed to first half of 2016 -source "
    },
    {
        "content": "Feb 2 Walt Disney Co will push back the opening of Shanghai Disneyland until the first half of 2016 from a scheduled start at the end of this year due to an expansion of its plans for the theme park  said a person familiar with the matter.",
        "date": "02032015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "UPDATE 1-Shanghai Disneyland opening delayed to first half of 2016 -source "
    },
    {
        "content": "Feb 2 Walt Disney Co's theme park in Shanghai  which was previously slated to open at the end of the year  has been pushed to the first half of 2016  the Wall Street Journal reported  citing people close to the project.",
        "date": "02032015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Shanghai Disneyland opening moved to first half of 2016 -WSJ "
    },
    {
        "content": "Jan 16 Walt Disney Co hiked Chief Executive Robert Iger's total compensation by 36 percent in 2014  a regulatory filing showed.",
        "date": "01162015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney hikes Bob Iger's compensation by 36 percent in 2014 "
    },
    {
        "content": "LOS ANGELES  Jan 15 Stars of Walt Disney Co's  multichannel network Maker Studios will produce content that will debut exclusively on the global online video platform  Vimeo On Demand  the companies announced on Thursday.",
        "date": "01152015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Stars of Disney's Maker Studios to produce content for Vimeo "
    },
    {
        "content": "** Walt Disney continues steady ascent as company spawns content  broadens global brand & as equity investors warm to bluechips in choppy markets",
        "date": "01152015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "BUZZ-Walt Disney Co: A happy place for investors "
    },
    {
        "content": "Jan 12 Walt Disney Co  Sony Corp  and DreamWorks Animation SKG Inc urged a federal judge to throw out a antitrust lawsuit accusing them of conspiring not to poach each other's animators in order to keep wages down.",
        "date": "01122015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "Disney  Sony  DreamWorks seek to throw out anti-poaching lawsuit "
    },
    {
        "content": "ANAHEIM  California  Jan 7 At 5 a.m. on a Sunday  thousands of people stream down Disneyland Drive dressed in a mix of running gear  homemade costumes and face paint as Captain America  Thor or The Hulk.",
        "date": "01072015",
        "name": "Walt Disney Company (The)",
        "news_type": "topStory",
        "symbol": "DIS",
        "title": "FEATURE-Off to the races! Disney park runs mix fitness  fantasy "
    },
    {
        "content": "LOS ANGELES  Jan 2 The inaugural College Football Playoff drew more than 28 million television viewers to both semifinal games  sports network ESPN said on Friday  touting that number as the two largest cable television audiences ever.",
        "date": "01022015",
        "name": "Walt Disney Company (The)",
        "news_type": "normal",
        "symbol": "DIS",
        "title": "College football's Rose  Sugar Bowls each top 28 mln TV viewers "
    }
]