[
    {
        "content": "* DISCOVERY COMMUNICATIONS SAYS STOCKHOLDERS APPROVED SERIES C COMMON STOCK ISSUANCE TO SCRIPPS NETWORKS SHAREHOLDERS AS CONSIDERATION FOR MERGER Source text: (http://bit.ly/2mC5OUT) Further company coverage:",
        "date": "11172017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-DISCOVERY STOCKHOLDERS APPROVES SERIES C COMMON STOCK ISSUANCE TO SCRIPPS NETWORKS "
    },
    {
        "content": "* Tivo and Discovery Communications sign multi-year product agreement",
        "date": "11012017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Tivo and Discovery Communications sign multi-year product agreement "
    },
    {
        "content": "* Discovery Communications reports third quarter 2017 results",
        "date": "11022017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications Q3 earnings per share $0.38 "
    },
    {
        "content": "Discovery Communications Inc  the owner of the Discovery Channel and Animal Planet  reported a 6.1 percent increase in quarterly revenue on Thursday  helped by higher advertising income from its U.S. networks.",
        "date": "11022017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Discovery's revenue rises 6.1 percent "
    },
    {
        "content": "Nov 2 Discovery Communications Inc  the owner of the Discovery Channel and Animal Planet  reported a 6.1 percent increase in quarterly revenue on Thursday  helped by higher advertising income from its U.S. networks.",
        "date": "11022017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Discovery's revenue rises 6.1 pct "
    },
    {
        "content": "* co's ‍ Nelvana  Discovery Communications form venture to produce content for kids' market in Canada  Latin America  around world​‍​ Source text for Eikon: Further company coverage: (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "10172017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Corus  Discovery announce venture to produce kids content "
    },
    {
        "content": "MANCHESTER  England  Oct 18 Social media platform Snapchat will present Winter Olympics content at next year's event in Pyeongchang after striking a deal with Discovery communications' Eurosport  a move which could help the Games reach the younger demographic it craves.",
        "date": "10182017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Snapchat signs Olympic deal with Eurosport "
    },
    {
        "content": "* TF1 PUBLICITE NEW ADVERTISING CONTRACT WITH DISCOVERY COMMUNICATIONS  EFFECTIVE AS OF JANUARY  1 2018‍​ Source text: http://bit.ly/2g54gga Further company coverage: (Gdynia Newsroom)",
        "date": "10122017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-TF1 announces TF1 Publicite's new contract with Discovery Communications "
    },
    {
        "content": "* PARQUES REUNIDOS AND DISCOVERY COMMUNICATIONS TO DEVELOP TEN THEMATIC LEISURE CENTERS IN US  EUROPE AND ASIA-PACIFIC REGION Source text: http://bit.ly/2yGtgl7 Further company coverage: (Gdynia Newsroom)",
        "date": "10032017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Parques Reunidos to develop leisure centers with Discovery Communications "
    },
    {
        "content": "* Discovery Communications - commenced an underwritten public offering of one or more series of senior fixed rate notes and senior floating rate notes​",
        "date": "09072017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications announces debt offering "
    },
    {
        "content": "* Discovery Communications Inc - ‍Notes were priced at 99.875% of their principal amount to yield 2.504% to maturity​",
        "date": "09082017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications announces pricing of Senior Notes "
    },
    {
        "content": "* Discovery Communications announces debt offering Source text for Eikon: Further company coverage:",
        "date": "09082017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications announces debt offering "
    },
    {
        "content": "* Discovery Communications  LLC priced offering of $400 million floating rate senior notes due 2019",
        "date": "09082017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications announces pricing of senior notes "
    },
    {
        "content": "FRANKFURT German state broadcasters ARD and ZDF have struck a deal with Discovery Communications for the right to show the Olympic Games from 2018 to 2024  after months of tough talks.",
        "date": "08112017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "German broadcasters clinch Olympics rights deal with Discovery "
    },
    {
        "content": "FRANKFURT  Aug 11 German state broadcasters ARD and ZDF have struck a deal with Discovery Communications for the right to show the Olympic Games from 2018 to 2024  after months of tough talks.",
        "date": "08112017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Olympics-German broadcasters clinch Olympics rights deal with Discovery "
    },
    {
        "content": "* Says ARD  ZDF strike deal with Discovery Communications to broadcast Olympic Games from 2018-2024 Further company coverage:",
        "date": "08112017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "BRIEF-Germany's ARD  ZDF sub-license Olympics right from Discovery "
    },
    {
        "content": "NEW YORK  Aug 3 A bridge loan of nearly US$10bn backing Discovery Communications Inc’s US$14.6 purchase of Scripps Networks Interactive is setting this year up to be one of the biggest ever for loans backing mergers in the telecommunications  media and technology (TMT) sector.",
        "date": "08032017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "LPC: Discovery to boost US technology  media and telecom lending "
    },
    {
        "content": "NEW YORK  Aug 1 Discovery Communications Inc   whose nature and science TV channels attract mostly male viewers  will reach more women and diversify its advertising revenue through its acquisition of Scripps Networks Interactive Inc  advertisers said on Tuesday.",
        "date": "08012017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Discovery gains female advertising audience with Scripps deal "
    },
    {
        "content": "NEW YORK Discovery Communications Inc is acquiring Scripps Networks Interactive Inc for $11.9 billion in a deal expected to boost the company's negotiating leverage as it seeks new audiences. | Video ",
        "date": "07312017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "Discovery aims for content clout with Scripps Network bid "
    },
    {
        "content": "* Discovery Communications says agrees to form automotive media company through consolidated joint venture with TEN: The Enthusiast Network",
        "date": "08032017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery agrees to form automotive media company through consolidated JV with TEN "
    },
    {
        "content": "NEW YORK  July 31 Discovery Communications Inc is acquiring Scripps Networks Interactive Inc for $11.9 billion in a deal expected to boost the company's negotiating leverage as it seeks new audiences.",
        "date": "07312017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "UPDATE 4-Discovery aims for content clout with Scripps Network bid "
    },
    {
        "content": "* Discovery Communications - Goldman Sachs committed to provide up to $9.6 billion under 364-day senior unsecured bridge facility to finance Scripps Networks deal Source text for Eikon: (http://bit.ly/2hgJBcg) Further company coverage:",
        "date": "07312017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications says Goldman Sachs to provide up to $9.6 bln for Scripps Deal "
    },
    {
        "content": "* Scripps Networks Interactive - under merger agreement  Discovery would pay termination fee of $356 million to co under certain circumstances",
        "date": "07312017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "BRIEF-Scripps Networks says Discovery would pay termination fee of $356 million to co under certain circumstances "
    },
    {
        "content": "* Discovery Communications reports second quarter 2017 results",
        "date": "07312017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications reports Q2 earnings per share $0.64 "
    },
    {
        "content": "July 31 Discovery Communications Inc is acquiring Scripps Networks Interactive for $14.6 billion in a deal that is expected to boost the combined company's negotiating leverage with pay TV operators at a time when more people watch video online  the companies said on Monday.",
        "date": "07312017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Discovery to acquire Scripps Networks Interactive "
    },
    {
        "content": "* Discovery Communications and Universal Pictures join with producer Will Packer to form Will Packer Media",
        "date": "07252017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications  Universal Pictures join with producer Will Packer to form Will Packer Media "
    },
    {
        "content": "U.S. media company Discovery Communications Inc is in the lead to acquire U.S. cable TV network owner Scripps Networks Interactive Inc  people familiar with the matter said on Wednesday  in a deal likely to top $12 billion.",
        "date": "07262017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "Exclusive: Discovery in the lead to acquire Scripps Networks - sources "
    },
    {
        "content": "Viacom Inc has informed Scripps Networks Interactive it is willing to pay all cash to acquire the U.S. TV network operator  sources familiar with the matter said on Tuesday. | Video ",
        "date": "07262017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Exclusive: Viacom willing to make an all-cash deal to buy Scripps Networks - sources "
    },
    {
        "content": "Viacom Inc has informed Scripps Networks Interactive it is willing to pay all cash to acquire the U.S. TV network operator  sources familiar with the matter said on Tuesday.",
        "date": "07262017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Viacom willing to make an all-cash deal to buy Scripps Networks - sources "
    },
    {
        "content": "July 19 U.S. Spanish-language broadcaster Univision Communications Inc held early-stage talks with John Malone's Liberty Media Corp  after he expressed interest in an acquisition or significant investment  a person familiar with the matter said on Wednesday.",
        "date": "07202017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Liberty Media discusses potential deal with Univision -source "
    },
    {
        "content": "* German paper had reported talks focused on Winter Olympics (Adds ARD comment)",
        "date": "07182017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "Olympics-Discovery resumes Olympics rights talks with German broadcasters "
    },
    {
        "content": "* Discovery Communications Inc - CEO David M. Zaslav's 2016 total compensation $37.2 million versus $32.4 million in 2015 - SEC Filing Source text: [http://bit.ly/2nFgMEv] Further company coverage:",
        "date": "04052017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications' CEO David Zaslav's 2016 total compensation $37.2 mln - SEC Filing "
    },
    {
        "content": "* Discovery communications announces the pricing terms of its cash tender offer for certain outstanding debt securities of discovery communications  llc",
        "date": "03142017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications announces the pricing terms of its cash tender offer for certain outstanding debt securities of Discovery Communications LLC "
    },
    {
        "content": "* Discovery Communications Inc says its unit has commenced an underwritten public offering of a new series of senior notes due 2024",
        "date": "02282017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications announces debt offering "
    },
    {
        "content": "* Discovery Communications announces new deal to create shows for Snapchat",
        "date": "02162017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications announces new deal to create shows for Snapchat "
    },
    {
        "content": "* Discovery Communications Inc - expect U.S. affiliate revenue to grow at least mid single-digits in 2017 - Conf Call",
        "date": "02142017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications expects constant currency adj. EPS to \"grow strongly\" in low to midteen range in 2017 "
    },
    {
        "content": "* Discovery Communications reports full year and fourth quarter 2016 results",
        "date": "02142017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications reports Q4 EPS $0.52 "
    },
    {
        "content": "Jan 25 Discovery Communications Inc's  UK unit said on Wednesday negotiations with Sky Plc for a new carriage deal reached an impasse over a price dispute  threatening a blackout of Discovery channels from Sky's platform.",
        "date": "01252017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Discovery in price dispute with Sky  signals full blackout "
    },
    {
        "content": "Discovery Communication Inc's   UK unit on Tuesday said it had reached a new carriage deal with Sky Plc   ending an impasse over pricing that had risked a blackout of all Discovery channels from Sky's platform.",
        "date": "01312017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "Discovery and Sky reach deal in the UK  ending blackout risk "
    },
    {
        "content": "Jan 31 Discovery Communication Inc's   UK unit on Tuesday said it had reached a new carriage deal with Sky Plc  ending an impasse over pricing that had risked a blackout of all Discovery channels from Sky's platform.",
        "date": "01312017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "UPDATE 1-Discovery and Sky reach deal in the UK  ending blackout risk "
    },
    {
        "content": "Jan 31 Discovery Communication Inc's   UK unit said on Tuesday it had reached a multi-year deal with Sky Plc to ensure its channels will still be broadcast on Sky's Platform.",
        "date": "01312017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Discovery reaches deal with Sky  ending blackout threat "
    },
    {
        "content": "* Agreement also includes Discovery's 4 pay-tv channels in Germany",
        "date": "01312017",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery's portfolio of 12 channels will continue to be available on Sky "
    },
    {
        "content": "* Discovery Communications Inc - Discovery Communications Llc entered amendment to employment agreement with CFO Andrew Warren  dated Sept 18  2014",
        "date": "01232017",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications entered amendment to employment agreement with CFO Andrew Warren "
    },
    {
        "content": "NEW YORK  Nov 1 Discovery Communications Inc  and video-streaming firm BAMTech will form a joint venture to provide back-end technology for content owners  broadcasters and other platforms throughout Europe  the companies said on Tuesday.",
        "date": "11012016",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Discovery signs partnership with streaming service BAMTech "
    },
    {
        "content": "* Discovery Communications reports third quarter 2016 results",
        "date": "11012016",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications reports Q3 loss per share $0.35 "
    },
    {
        "content": "* Increased number of directors serving on board from 10 to 11  appoints Susan M. Swain to board  effective Dec. 7 -sec filing  Source text: [http://bit.ly/2eeV1Nk] Further company coverage:",
        "date": "10212016",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications increases number of directors serving on board "
    },
    {
        "content": "Oct 17 Eurosport  Discovery Communications Inc's  European sports broadcaster  announced on Monday it has signed a deal to broadcast drone races  joining a number of networks to televise the fledgling sport in which pilots navigate remote-controlled aircrafts at high speeds through aerial obstacle courses.",
        "date": "10172016",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Discovery's Eurosport signs on for televised drone racing "
    },
    {
        "content": "Oct 13 Discovery Communications  which owns networks like the Discovery Channel and Animal Planet  on Thursday became the latest TV company to invest in digital content in an effort to reach mobile viewers.",
        "date": "10132016",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "Discovery invests $100 mln in digital media venture "
    },
    {
        "content": "* Discovery Communications announces $100 million investment and strategic partnership with newly formed digital content holding company: Group Nine Media",
        "date": "10132016",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications partners with Group Nine Media  announces $100 mln investment "
    },
    {
        "content": "* Liberty Global and Discovery Communications renew long-term  comprehensive distribution partnership",
        "date": "08022016",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications and Liberty Global renew distribution partnership "
    },
    {
        "content": "* Q2 revenue rose 3 percent to $1.708 billion  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "08022016",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications reported Q2 EPS $0.66 "
    },
    {
        "content": "* In short-term and medium-term  currency hedging program to minimize foreign exchange impact of Brexit on financial performance  Source text for Eikon:  Further company coverage:",
        "date": "06242016",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications' hedging program to minimize forex impact from Brexit "
    },
    {
        "content": "* For full year ending december 31  2016   expects adjusted eps excluding currency effects to grow at least high teens",
        "date": "05052016",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Q1 earnings per share $0.42 "
    },
    {
        "content": "Discovery Communications Inc   the owner of the Discovery Channel and Animal Planet  reported a 2 percent rise in quarterly revenue as advertising and distribution revenue improved at its U.S. networks.",
        "date": "05052016",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Discovery Communications revenue rises as U.S. networks perform "
    },
    {
        "content": "* On April 28  2016  company committed to a cost-savings plan that encompasses a series of actions",
        "date": "05042016",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery communications says committed to cost-savings plan that encompasses a series of actions "
    },
    {
        "content": "* Ctw investment group asks discovery shareholders to withhold support from directors paul gould and m. Lavoy robison at annual meeting   Source text [http://1.usa.gov/1VEs62F]  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04212016",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-CTW Investment Group asks Discovery shareholders to withhold support from Paul Gould and Lavoy Robison at annual meeting "
    },
    {
        "content": "* CEO David M. Zaslav's FY 2015 total compensation was $32.4 million compared to $156.1 million in FY 2014",
        "date": "03302016",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Discovery Communications CEO David M. Zaslav's FY 2015 total compensation $32.4 mln "
    },
    {
        "content": "Dec 1 Discovery Communications Inc  launched its own streaming service on Tuesday to offer more options for cable and satellite TV subscribers.",
        "date": "12012015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Discovery launches streaming service for pay TV subscribers "
    },
    {
        "content": "BOSTON  Aug 25 Popular consumer brands Discovery Communications  Chipotle Mexican Grill and CVS Health Corp pay their chief executive officers more than a thousand times what they pay their typical worker  giving them the biggest internal pay gaps among S&P 500 companies  according to a study released on Tuesday.",
        "date": "08252015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Three big US consumer companies have highest CEO pay gaps -study "
    },
    {
        "content": "BOSTON  Aug 26 Investors in Discovery Communications Inc  including Manning & Napier Inc  and BlackRock Inc  withheld support for a member of the company's compensation committee  recent securities filings show  after the cable network operator gave its CEO the richest pay package in the S&P 500.",
        "date": "08262015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Funds snub Discovery director after rich CEO pay package "
    },
    {
        "content": "BOSTON  Aug 26 Investors in Discovery Communications Inc  including Manning & Napier Inc  and BlackRock Inc  withheld support for a member of the company's compensation committee  recent securities filings show  after the cable network operator gave its CEO the richest pay package in the S&P 500.",
        "date": "08272015",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "RPT-Funds snub Discovery director after rich CEO pay package "
    },
    {
        "content": "Aug 6 U.S. media stocks have taken an indiscriminate beating this week  but many big fund managers still like entertainment conglomerate Walt Disney Co  while turning negative for the long term on Discovery Communications  owner of several niche television franchises.",
        "date": "08062015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Despite media stock beat down  Disney stands tall with U.S. funds "
    },
    {
        "content": "Discovery Communications Inc said it was unlikely to buy back any more shares this year as it looks to save cash and retain its credit rating  sending its shares down about 9 percent.",
        "date": "08052015",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "Discovery unlikely to buy back shares this year "
    },
    {
        "content": "* Shares down about 9 pct   (Adds CFO comments from conference call; updates shares)",
        "date": "08052015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "UPDATE 2-Discovery unlikely to buy back shares this year "
    },
    {
        "content": "Aug 5 Discovery Communications Inc  the owner of the Discovery Channel and Animal Planet  reported a 2.7 percent rise in quarterly revenue  helped by growth in distribution revenue.",
        "date": "08052015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Discovery Communications revenue rises on distribution growth "
    },
    {
        "content": "July 22 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Wednesday:",
        "date": "07222015",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Discovery Communications Inc  said on Wednesday it would take full ownership of sports broadcaster Eurosport for 491 million euros ($534 million) from French media group TF1 Group.",
        "date": "07222015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Discovery takes full ownership of Eurosport from TF1 Group "
    },
    {
        "content": "July 22 Discovery Communications Inc  said on Wednesday it would take full ownership of sports broadcaster Eurosport for 491 million euros ($534 million) from French media group TF1 Group.",
        "date": "07222015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Discovery takes full ownership of Eurosport "
    },
    {
        "content": "* Decides by mutual agreement with Discovery Communications  to exercise its put option over its 49 percent equity interest in Eurosport for an amount of 491 million euros ($534.01 million)",
        "date": "07222015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "BRIEF-TF 1 to exercise put option over 49% stake in Eurospor\u007ft "
    },
    {
        "content": "PARIS  June 29 Discovery Communications  has agreed to pay 1.3 billion euros ($1.4 billion) to screen the Olympic Games from 2018 to 2024 across Europe  beating national public broadcasters that have traditionally shown the event.",
        "date": "06292015",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "UPDATE 3-Olympics-Discovery buys European broadcast rights to Games from 2018-2024 "
    },
    {
        "content": "PARIS  June 29 Discovery Communications  has agreed to pay 1.3 billion euros ($1.4 billion) to screen the Olympic Games from 2018 to 2024 across Europe  beating national public broadcasters that have traditionally shown the event.",
        "date": "06292015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "CORRECTED-UPDATE 2-Olympics-Discovery buys European broadcast rights to Games from 2018-2024 "
    },
    {
        "content": "PARIS  June 29 Discovery Communications   the parent of television channel Eurosport  has agreed to pay 1.3 billion euros  ($1.4 billion) to screen the Olympic Games from 2018 to 2024 across Europe  beating out national public broadcasters who have traditionally shown the event.",
        "date": "06292015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "CORRECTED-Olympics- Discovery wins European broadcast rights to Games from 2018-2024 "
    },
    {
        "content": "June 9 Fuhu Inc  creator of kid-friendly computer tablets  said it will launch a new tablet that includes content from Walt Disney Co  Dreamworks Animation SKG Inc  Discovery Communications Inc and others.",
        "date": "06092015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Tablet maker Fuhu launches new content subscription service "
    },
    {
        "content": "Discovery Communications Inc   the owner of Animal Planet and the Discovery Channel  warned of a bigger hit from a strengthening dollar and said costs would increase in the coming quarters.",
        "date": "05052015",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "Discovery forecasts bigger hit to 2015 revenue from dollar "
    },
    {
        "content": "* Costs rise 8 pct   (Adds comment from CFO  analyst  cost details; updates share move)",
        "date": "05052015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "UPDATE 2-Discovery forecasts bigger hit to 2015 revenue from dollar "
    },
    {
        "content": "May 5 Discovery Communications Inc  the owner of Animal Planet and the Discovery Channel  reported a 9 percent rise in quarterly revenue  helped by growth in distribution revenue at its U.S. and international networks.",
        "date": "05052015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Discovery Communications revenue rises 9 pct "
    },
    {
        "content": "MEXICO CITY  April 20 The president and chief executive of U.S. cable network operator Discovery Communications  David Zaslav  will be nominated to join the board of directors at broadcaster Televisa   the Mexican company said on Monday.",
        "date": "04212015",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "Mexico's Televisa to nominate Discovery Communications CEO to board "
    },
    {
        "content": "SEOUL  April 8 Discovery Communications Inc  and private equity firm Providence Equity Partners were among four U.S. bidders expressing interest in South Korean cable TV firm C&M Co  a newspaper reported on Wednesday.",
        "date": "04082015",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "Discovery  Providence Equity eye S.Korean pay-TV firm- Korea Economic Daily "
    },
    {
        "content": "Discovery Communications Chief Executive David Zaslav said he expects its Eurosport Group's player app to reach one million subscribers in two years and that it will bring an additional $100 million in revenue.",
        "date": "03312015",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "Discovery expects Eurosport app to reach one million subs in two years "
    },
    {
        "content": "March 31 Discovery Communications  Chief Executive David Zaslav said he expects its Eurosport Group's player app to reach one million subscribers in two years and that it will bring an additional $100 million in revenue.",
        "date": "03312015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "CORRECTED-Discovery expects Eurosport app to reach 1 mln subs in 2 years "
    },
    {
        "content": "Fuhu Inc  which makes kid-friendly computer tablets  said it signed deals with Walt Disney Co and Discovery Communications Inc to add their content to monthly subscription offers on its nabi tablets.",
        "date": "03112015",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "Fuhu's nabi tablet to offer content from Disney  Discovery "
    },
    {
        "content": "March 11 Fuhu Inc  which makes kid-friendly computer tablets  said it signed deals with Walt Disney Co  and Discovery Communications Inc to add their content to monthly subscription offers on its nabi tablets.",
        "date": "03112015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "REFILE-Fuhu's nabi tablet to offer content from Disney  Discovery "
    },
    {
        "content": "LONDON John Malone's Liberty Global and Discovery Communications  who have been linked in the past with Formula One  have become shareholders in the new Formula E electric series.",
        "date": "03102015",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "Liberty Global buys into Formula E "
    },
    {
        "content": "LONDON  March 10 John Malone's Liberty Global and Discovery Communications  who have been linked in the past with Formula One  have become shareholders in the new Formula E electric series.",
        "date": "03102015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Motor racing-Liberty Global buys into Formula E "
    },
    {
        "content": "* Spokesman says no truth in report company held takeover talks with discovery communications    Further company coverage:",
        "date": "02232015",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "BRIEF-Twenty-First Century Fox spokesman says no truth in report company held takeover talks with Discovery Communications "
    },
    {
        "content": "Discovery Communications Inc  the owner of Animal Planet and the Discovery Channel  said better pricing would help its U.S. advertising revenue improve in 2015  and forecast continuing strong growth in its international networks.",
        "date": "02192015",
        "name": "Discovery Communications Inc",
        "news_type": "topStory",
        "symbol": "DISCB",
        "title": "Discovery forecasts growth in U.S. advertising revenue; shares rise "
    },
    {
        "content": "* Forecasts 2015 rev  adj profit growth in \"high-single to low-double digits\"",
        "date": "02192015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "UPDATE 2-Discovery forecasts growth in U.S. advertising revenue; shares rise "
    },
    {
        "content": "Feb 19 Discovery Communications Inc  the owner of Animal Planet and the Discovery Channel  reported a 9 percent rise in quarterly revenue  helped by growth in advertising and distribution revenue at its international networks.",
        "date": "02192015",
        "name": "Discovery Communications Inc",
        "news_type": "normal",
        "symbol": "DISCB",
        "title": "Discovery revenue rises helped by international business "
    }
]