[
    {
        "content": "* Paulson & Co Inc dissolves share stake in Facebook Inc ‍​- SEC filing",
        "date": "11142017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Paulson & Co dissolves share stake in Facebook  cuts share stake in Allergan "
    },
    {
        "content": "AT&T Inc's  proposed acquisition of Time Warner Inc   which is being scrutinized by the U.S. Department of Justice  may not be dead yet  Dish Network Corp  Chief Executive Charlie Ergen said.",
        "date": "11092017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "AT&T-Time Warner deal not dead yet: Dish CEO Ergen "
    },
    {
        "content": "Nov 9 AT&T Inc's proposed acquisition of Time Warner Inc  which is being scrutinized by the U.S. Department of Justice  may not be dead yet  Dish Network Corp Chief Executive Charlie Ergen said.",
        "date": "11092017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "AT&T-Time Warner deal not dead yet - Dish CEO Ergen "
    },
    {
        "content": "* Dish CEO on AT&T/Time Warner deal - \"I think by no means is it dead and I think there's certainly maybe ways they can work it out\" - Conf call‍​",
        "date": "11092017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "BRIEF-Dish CEO says partnership with Sprint or T-Mobile may be an option "
    },
    {
        "content": "Dish Network Corp lost fewer-than-expected subscribers in the third quarter as its internet-based service Sling TV attracted more customers  offsetting a temporary hit from Hurricane Maria.",
        "date": "11092017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Sling TV gains help Dish ride out Maria losses "
    },
    {
        "content": "* Shares rise 4 pct (Recasts lead  subscriber comparison  adds details on Sling TV)",
        "date": "11092017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 4-Sling TV gains help Dish ride out Maria losses "
    },
    {
        "content": "WASHINGTON  Nov 3 Four state attorneys general urged the Federal Communications Commission to reject Sinclair Broadcast Group Inc's proposed $3.9 billion acquisition of Tribune Media Co  marking the latest hurdle for the controversial tie-up.",
        "date": "11032017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Four U.S. states urge regulator to reject Sinclair Tribune deal "
    },
    {
        "content": "* Dish Network Corp - ‍Dish expands Amazon Alexa voice control support to hopper 'Joey' clients for whole-home  hands-free TV​ Source text for Eikon: Further company coverage:",
        "date": "10252017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Dish Network expands Amazon Alexa voice control support to hopper 'Joey' clients "
    },
    {
        "content": "* DISH names Tim Messner general counsel; R. Stanton dodge to join DraftKings as chief legal officer Source text for Eikon: Further company coverage:",
        "date": "10172017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-DISH names Tim Messner general counsel "
    },
    {
        "content": "WASHINGTON/NEW YORK Two companies largely owned by Dish Network will have an opportunity to nullify about $500 million in fines and be eligible once again for $3.3 billion in credits for a wireless spectrum auction  if they can demonstrate that they are independent entities  a U.S. appeals court ruled on Tuesday.",
        "date": "08292017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "U.S. court grants Dish affiliates new chance to win $3 billion in auction credits "
    },
    {
        "content": "WASHINGTON/NEW YORK  Aug 29 Two companies largely owned by Dish Network will have an opportunity to nullify about $500 million in fines and be eligible once again for $3.3 billion in credits for a wireless spectrum auction  if they can demonstrate that they are independent entities  a U.S. appeals court ruled on Tuesday.",
        "date": "08292017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "U.S. court grants Dish affiliates new chance to win $3 bln in auction credits "
    },
    {
        "content": "Aug 17 Alphabet Inc's Google has expanded its YouTube TV streaming service into 14 new U.S. markets to reach half of American households  with an additional 17 markets to launch in the next few weeks  the company said on Thursday.",
        "date": "08172017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "YouTube TV expands to 14 new markets  partners with Sinclair stations "
    },
    {
        "content": "* Dish Network Corp - ‍will shift leadership of its over--top service  Sling TV  into Dish president and chief operating officer Erik Carlson's portfolio​ Source text for Eikon: Further company coverage:",
        "date": "08142017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Dish announces new leadership structure for Sling TV "
    },
    {
        "content": "* CSG Systems International Inc - ‍will extend its agreement with pay-tv company  Dish   through december 31  2021​",
        "date": "08162017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-CSG extends long-term relationship with Dish "
    },
    {
        "content": "* Federal Communications Commission denies motion for extension and additional information in Sinclair-Tribune merger",
        "date": "08072017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Sinclair says FCC denies motion for extension  additional information in Sinclair-Tribune merger "
    },
    {
        "content": "WASHINGTON  Aug 7 Dish Network Corp has joined forces with conservative media  trade and liberal advocacy groups in urging U.S. authorities to reject Sinclair Broadcast Group's proposed $3.9 billion acquisition of Tribune Media.",
        "date": "08082017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish Network  trade groups and others oppose Sinclair Tribune deal "
    },
    {
        "content": "Dish Network Corp's  shares declined on Thursday after the satellite television provider's quarterly results missed analysts' estimates  and its chief executive declined to give specifics on merger discussions  saying that the company was focused on building its new wireless network. | Video ",
        "date": "08032017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish misses profit expectations but limits subscriber losses "
    },
    {
        "content": "Aug 3 Dish Network Corp's shares declined on Thursday after the satellite television provider's quarterly results missed analysts' estimates  and its chief executive declined to give specifics on merger discussions  saying that the company was focused on building its new wireless network.",
        "date": "08032017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 5-Dish misses profit expectations but limits subscriber losses "
    },
    {
        "content": "Aug 3 Dish Network Corp reported a 90 percent drop in quarterly profit on Thursday  hurt by litigation expenses.",
        "date": "08032017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish Network profit plunges 90 pct on litigation expenses "
    },
    {
        "content": "Dish Network Corp  Chief Executive Charlie Ergen and Amazon.com Inc  head Jeff Bezos have discussed a partnership to enter the wireless business  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "07062017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish  Amazon chiefs discuss wireless partnership: WSJ "
    },
    {
        "content": "July 6 Dish Network Corp Chief Executive Charlie Ergen and Amazon.com Inc head Jeff Bezos have discussed a partnership to enter the wireless business  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "07062017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 1-Dish  Amazon chiefs discuss wireless partnership - WSJ "
    },
    {
        "content": "July 6 Dish Network Corp Chief Executive Charlie Ergen and Amazon.com Inc head Jeff Bezos have discussed a partnership to enter the wireless business  the Wall Street Journal reported  citing people familiar with the matter.",
        "date": "07062017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish  Amazon chiefs discuss wireless partnership - WSJ "
    },
    {
        "content": "WASHINGTON/NEW YORK A federal judge in Illinois on Monday ordered Dish Network Corp to pay $280 million in penalties to the U.S. government and four states in an eight-year-old \"robocall\" telemarketing lawsuit.",
        "date": "06052017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "U.S. judge orders Dish to pay $280 million fines  damages in telemarketing lawsuit "
    },
    {
        "content": "WASHINGTON/NEW YORK  June 5 A federal judge in Illinois on Monday ordered Dish Network Corp to pay $280 million in penalties to the U.S. government and four states in an eight-year-old \"robocall\" telemarketing lawsuit.",
        "date": "06052017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 2-US judge orders Dish to pay $280 mln fines  damages in telemarketing lawsuit "
    },
    {
        "content": "WASHINGTON/NEW YORK A federal judge in Illinois ordered Dish Network Corp to pay $280 million in penalties to the U.S. government and four states in an eight-year-old \"robocall\" telemarketing lawsuit.",
        "date": "06052017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "US judge orders Dish to pay $280 mln fines  damages in telemarketing lawsuit "
    },
    {
        "content": "June 5 U.S. DISTRICT JUDGE SUE MYERSCOUGH IN SPRINGFIELD  ILLINOIS ORDERS DISH TO PAY $168 MLN CIVIL PENALTY TO U.S. JUDGE ALSO ORDERS DISH TO PAY $28 MLN CIVIL PENALTIES TO THE FOUR STATES  FOR A TOTAL AWARD OF $280 MLN JUDGE SAYS AWARD REPRESENTS ABOUT ONE-FIFTH OF DISH'S 2016 AFTER-TAX PROFIT U.S. JUDGE ORDERS DISH NETWORK TO PAY $252 MLN IN ROBOCALL CASE -- COURT RULING JUDGE ALSO ORDERS DISH TO PAY $84 MLN DAMAGES TO CALIFORNIA  ILLINOIS  NORTH CAROLINA  OHIO JUDGE CHARACTERIZES",
        "date": "06052017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "BRIEF-US judge orders Dish to pay $280 mln fines  damages in robocall lawsuit "
    },
    {
        "content": "* Dish Network Corp - Dish Now will available today at no additional cost to new and current Dish customers Source text for Eikon: Further company coverage:",
        "date": "05222017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Dish Now on Amazon Fire TV "
    },
    {
        "content": "* Paulson & Co Inc takes share stake of 3.5 million shares in Dish Network Corp",
        "date": "05152017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Paulson & Co Inc takes share stake in Dish Network  Monsanto "
    },
    {
        "content": "* Omega Advisors Inc takes share stake in Alcoa Corp of 200 000 shares - SEC filing",
        "date": "05152017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "BRIEF-Omega Advisors Inc takes share stake in Alcoa  Netflix "
    },
    {
        "content": "Dish Network Corp  would consider various options for its wireless airwaves  its chief executive said on Monday  after the U.S. satellite TV provider reported quarterly revenue that missed analysts' estimates as it lost more subscribers than expected.",
        "date": "05012017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish revenue misses estimates  loses more subscribers than expected "
    },
    {
        "content": "* Shares down 2.3 pct (Adds Breakingviews link  updates share prices)",
        "date": "05012017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 5-Dish revenue misses estimates  loses more subscribers than expected "
    },
    {
        "content": "* Pay-TV ARPU for q1 totaled $86.55  compared to year-ago period's pay-tv ARPU of $87.94",
        "date": "05012017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "BRIEF-Dish network reports Q1 EPS $0.76 "
    },
    {
        "content": "May 1 Dish Network Corp reported a 6 percent drop in quarterly profit on Monday as the U.S. satellite TV provider added fewer-than-expected pay-TV subscribers.",
        "date": "05012017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish reports 6 pct fall in quarterly profit "
    },
    {
        "content": "April 24 T-Mobile US Inc is open to merger talks after a federal ban expires this week  the No. 3 U.S. wireless carrier said on Monday  as it reported stronger-than-expected subscriber growth in the first quarter.",
        "date": "04242017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 3-T-Mobile open to merger talks  new subscribers top estimates "
    },
    {
        "content": "NEW YORK  April 13 The U.S. Federal Communications Commission said on Thursday that T-Mobile US Inc   Comcast Corp  Dish Network Corp and U.S. Cellular Corp were among the largest buyers of spectrum in an $19.8 billion broadcast airwaves auction.",
        "date": "04132017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "REFILE-T-Mobile  Comcast  Dish acquire spectrum in airwaves auction -FCC "
    },
    {
        "content": "NEW YORK  March 27 Comcast Corp is planning to rebrand and expand a streaming video option for broadband subscribers who do not want to pay for a traditional cable package  sources told Reuters on Monday.",
        "date": "03282017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "CORRECTED-Comcast to expand streaming service amid cord-cutting trend "
    },
    {
        "content": "* Dish Network Corp - interest on notes will be paid on March 15 and September 15 of each year  commencing on September 15  2017",
        "date": "03132017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Dish Network places $1 billion in convertible notes "
    },
    {
        "content": "* Dish network corp- plans to issue and sell $1 billion aggregate principal amount of convertible notes",
        "date": "03102017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Dish Network says plans to issue and sell $1 bln aggregate principal amount of convertible notes "
    },
    {
        "content": "* Says announced consummation on February 28  2017 of share exchange agreement executed in January with Dish Network Corporation",
        "date": "03012017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Echostar says announced consummation on February 28  2017 of share exchange agreement executed in January with Dish Network Corporation "
    },
    {
        "content": "U.S. satellite TV provider Dish Network Corp  reported a better-than-expected profit and added pay-TV subscribers in the fourth quarter as more customers signed up for its lower-priced Sling TV streaming service. | Video ",
        "date": "02222017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish Network profit tops estimates on surprise subscriber additions "
    },
    {
        "content": "Feb 22 U.S. satellite TV provider Dish Network Corp reported a better-than-expected profit and added pay-TV subscribers in the fourth quarter as more customers signed up for its lower-priced Sling TV streaming service.",
        "date": "02222017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 3-Dish Network profit tops estimates on surprise subscriber additions "
    },
    {
        "content": "* EchoStar Corp - Executed agreement with Dish Network to exchange EchoStar Technologies businesses for Hughes Retail Group (HRG)tracking stock  Source text for Eikon:  Further company coverage:",
        "date": "01312017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-EchoStar announces exchange agreement for tracking stock "
    },
    {
        "content": "* Dish Network Corp - transaction also transfers to dish 10 percent stake in Sling TV held by Echostar",
        "date": "01312017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "BRIEF-Dish acquires DBS and OTT assets from Echostar "
    },
    {
        "content": "* Gray television inc-Dish Network decided to stop carrying all television stations owned and/or operated by gray television at 7:00 pm eastern on tuesday",
        "date": "01162017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Dish Network decides to drop Gray Television stations "
    },
    {
        "content": "* No viewers will lose access to any of Gray's Television stations on Dish's platform",
        "date": "01182017",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Gray Television reaches long-term agreement with Dish "
    },
    {
        "content": "Jan 18 Comcast Corp's NBCUniversal is shutting down its Esquire Network cable channel  one month after it was dropped by DirecTV  and will re-launch it this spring as a digital-only brand  the company said on Wednesday.",
        "date": "01182017",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "NBCU shutting cable's Esquire Network  re-launching as digital "
    },
    {
        "content": "U.S. satellite TV operator Dish Network Corp  reported a lower-than-expected quarterly profit on Wednesday as it lost more pay-TV subscribers due to stiff competition from online video services.",
        "date": "11092016",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish Network posts lower-than-expected profit  loses subscribers "
    },
    {
        "content": "Nov 9 U.S. satellite TV operator Dish Network Corp reported a lower-than-expected quarterly profit on Wednesday as it lost more pay-TV subscribers due to stiff competition from online video services.",
        "date": "11092016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 2-Dish Network posts lower-than-expected profit  loses subscribers "
    },
    {
        "content": "* Dish network corp  closed Q3 with 13.643 million Pay-tv subscribers  compared to 13.909 million Pay-tv subscribers at end of Q3 2015",
        "date": "11092016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "BRIEF-Dish Network reports Q3 EPS $0.64 "
    },
    {
        "content": "Nov 9 Satellite TV operator Dish Network Corp  reported a 56.6 percent jump in quarterly profit as revenue per user rose in its core pay-TV business.",
        "date": "11092016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish Network profit jumps 56.6 pct "
    },
    {
        "content": "* Rovi signs 10-year intellectual property license agreement with dish",
        "date": "08222016",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Rovi signs 10-year intellectual property license agreement with Dish "
    },
    {
        "content": "* Flex pack consisting of more than 50 channels and choice of one of eight themed channel packs",
        "date": "08042016",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Dish network launches Flex Pack Skinny bundle at $39.99 per month "
    },
    {
        "content": "NEW YORK  Aug 3 Dish Network Corp  struck a new carriage agreement with the National Football League's NFL Network and NFL Redzone channels  ending a dispute over distribution fees  the satellite TV operator said on Wednesday.",
        "date": "08032016",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "UPDATE 1-NFL  Dish reach new carriage deal  ending fee dispute "
    },
    {
        "content": "NEW YORK  Aug 3 Satellite TV operator Dish Network Corp said on Wednesday that it has struck a new carriage agreement with the National Football League's NFL Network and NFL Redzone channels  ending a disagreement over distribution fees.",
        "date": "08032016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "NFL Network  Dish reach new carriage deal  ending fee dispute "
    },
    {
        "content": "* Plans to offer $2 billion aggregate principal amount of convertible notes",
        "date": "08022016",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Dish Network announces convertible notes offering "
    },
    {
        "content": "U.S. satellite TV provider Dish Network Corp  reported better-than-expected earnings on Thursday but posted its biggest-ever decline in pay-TV subscribers amid fierce competition from online video services.",
        "date": "07212016",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish posts record pay-TV subscriber drop  earnings beat estimates "
    },
    {
        "content": "July 21 U.S. satellite TV provider Dish Network Corp reported better-than-expected earnings on Thursday but posted its biggest-ever decline in pay-TV subscribers amid fierce competition from online video services.",
        "date": "07212016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 4-Dish posts record pay-TV subscriber drop  earnings beat estimates "
    },
    {
        "content": "* Q2 earnings per share view $0.72 -- Thomson Reuters I/B/E/S",
        "date": "07212016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "BRIEF-Dish Network posts Q2 earnings of $0.88/share "
    },
    {
        "content": "July 21 U.S. satellite TV provider Dish Network Corp reported a 26.5 percent jump in quarterly earnings as the company raised prices of its pay-TV services.",
        "date": "07212016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish reports 26.5 pct jump in quarterly profit "
    },
    {
        "content": "* Roth will assume his role within Dish's marketing organization later this summer  Source text for Eikon:  Further company coverage:",
        "date": "07062016",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Dish appoints Jay Roth as chief marketing officer "
    },
    {
        "content": "* Tribune Media Co says  issued statement regarding a lawsuit filed against company by Dish Network",
        "date": "06212016",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Tribune Media issues statement on lawsuit by Dish Network "
    },
    {
        "content": "Satellite TV operator Dish Network Corp blacked out the National Football League-owned sports channels  NFL Network and NFL RedZone  the first time the league has been dropped by a TV services provider  the NFL said.",
        "date": "06172016",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish drops NFL Network  NFL RedZone amid fee dispute "
    },
    {
        "content": "* Dish network has been \"totally unresponsive\" in negotiating a new contract between two companies",
        "date": "06152016",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Tribune Media says Dish Network has been \"totally unresponsive\" in negotiating a new contract "
    },
    {
        "content": "June 17 Satellite TV operator Dish Network Corp  blacked out the National Football League-owned sports channels  NFL Network and NFL RedZone  the first time the league has been dropped by a TV services provider  the NFL said.",
        "date": "06172016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 1-Dish drops NFL Network  NFL RedZone amid fee dispute "
    },
    {
        "content": "June 13 Tribune Media Co chose to take off its television channels from Dish Network Corp's  distribution systems across the United States on Sunday night after they failed to renew their contract  the companies said.",
        "date": "06132016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Tribune channels taken off Dish network after failure to reach deal "
    },
    {
        "content": "June 17 Dish Network Corp has dropped the National Football League-owned sports channels  NFL Network and NFL RedZone  from its programming lineup.",
        "date": "06172016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish blacks out NFL network "
    },
    {
        "content": "* Tribune broadcasting company blacks out dish customers in 33 markets; dish offers free over-the-air antennas to affected customers",
        "date": "06132016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "BRIEF-Dish network tribune broadcasting company blacks out dish customers in 33 markets "
    },
    {
        "content": "* Plans to offer  subject to market and other conditions  approximately $750 million aggregate principal amount of its senior notes",
        "date": "06082016",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "BRIEF-Dish Network announces debt offering "
    },
    {
        "content": "NEW YORK Hedge fund Kerrisdale Capital Management has taken a short position in the stock of direct broadcast service provider DISH Network Co  betting that the stock price will fall because its wireless spectrum is overvalued  a source familiar with the matter said on Thursday.",
        "date": "05052016",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Kerrisdale betting against DISH in newly raised fund: source "
    },
    {
        "content": "Viacom Inc  on Tuesday began alerting Dish Network Corp's  satellite TV subscribers that they might soon lose its networks  including Comedy Central  Nickelodeon and MTV  as an agreement between the companies is set to expire Wednesday night.",
        "date": "04192016",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Viacom warns Dish TV viewers of blackout if contract not renewed "
    },
    {
        "content": "April 19 Viacom Inc on Tuesday began alerting Dish Network Corp's satellite TV subscribers that they might soon lose its networks  including Comedy Central  Nickelodeon and MTV  as an agreement between the companies is set to expire Wednesday night.",
        "date": "04192016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 3-Viacom warns Dish TV viewers of blackout if contract not renewed "
    },
    {
        "content": "April 19 Viacom Inc's carriage deal with Dish Network Corp is scheduled to expire at the end of the day Wednesday and there is no agreement in sight  a Viacom spokesman told Reuters Tuesday.",
        "date": "04192016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Viacom carriage deal with Dish to expire Wednesday night "
    },
    {
        "content": "April 21 Viacom Inc said it reached an agreement with Dish Network Corp  averting a blackout of its programs on the satellite TV network.",
        "date": "04212016",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Viacom  Dish agree to renew contract "
    },
    {
        "content": "* Select Viacom live and video-on-demand content to join Sling TV single- and multi-stream services",
        "date": "04212016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "BRIEF-Viacom and Dish agree to multi-year renewal "
    },
    {
        "content": "Dish Network Corp Chief Executive Charlie Ergen said on Wednesday that talks to renew the satellite TV provider's contract to carry Viacom Inc programs have turned positive  though a deal remains uncertain ahead of a midnight deadline.",
        "date": "04202016",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish CEO says talks to renew Viacom deal have turned productive "
    },
    {
        "content": "NEW YORK  April 21 A midnight deadline has passed without the announcement of a programming deal between Viacom Inc and Dish Network Corp.",
        "date": "04212016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish  Viacom deadline passes with no programming deal announced "
    },
    {
        "content": "U.S. satellite TV provider Dish Network Corp reported quarterly profit on Wednesday that surpassed analysts' estimates  helped by price increases in its TV service  even as it lost subscribers.",
        "date": "04202016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish profit tops forecast helped by rate increases "
    },
    {
        "content": "April 20 U.S. satellite TV provider Dish Network Corp reported quarterly profit on Wednesday that surpassed analysts' estimates  helped by price increases in its TV service  even as it lost subscribers.",
        "date": "04202016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 2-Dish profit tops forecast helped by rate increases "
    },
    {
        "content": "* Q1 earnings per share view $0.62 -- Thomson Reuters I/B/E/S",
        "date": "04202016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "BRIEF-Dish Network reports Q1 earnings per share $0.84 "
    },
    {
        "content": "April 20 U.S. satellite TV provider Dish Network Corp posted a 2 percent rise in quarterly revenue  helped by higher subscription rates in its core pay-TV business.",
        "date": "04202016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish Network revenue rises 2 pct "
    },
    {
        "content": "April 4 Nielsen Holdings Plc said it signed a multi-year agreement with Dish Network Corp to use anonymized data from Dish households to improve its understanding of viewing habits.",
        "date": "04042016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Nielsen signs deal with Dish for viewing data "
    },
    {
        "content": "April 4 U.S.-based advertising tracking company Nielsen Holdings Plc said it signed a multi-year agreement with Dish Network Corp to use data from Dish households to improve its understanding of viewing habits.",
        "date": "04042016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 1-Nielsen signs deal with Dish for viewing data "
    },
    {
        "content": "WASHINGTON/NEW YORK  March 29 The U.S. Federal Communications Commission on Tuesday kicked off an auction of low-frequency spectrum relinquished by television  broadcasters to wireless companies and other bidders that are seeking new airwaves to build and improve wireless networks.",
        "date": "03292016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "U.S. FCC begins first phase of airwaves auction "
    },
    {
        "content": "LOS ANGELES  March 18 Satellite TV provider Dish Network Corp said on Friday it would request arbitration to determine the terms of a renewed distribution agreement with Comcast Corp's NBCUniversal networks.",
        "date": "03182016",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "UPDATE 2-Dish to request arbitration in NBCUniversal distribution talks "
    },
    {
        "content": "LOS ANGELES  March 18 Satellite TV provider Dish Network Corp said on Friday it will request arbitration to determine the terms of a renewed distribution agreement with Comcast Corp's NBCUniversal networks.",
        "date": "03182016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish to request arbitration in NBCUniversal distribution talks "
    },
    {
        "content": "March 16 NBCUniversal said it would participate in any arbitration Dish Network Corp could potentially file as the satellite TV company pursues its plan to stop NBC from blacking out channels such as CNBC and USA.",
        "date": "03162016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "NBCUniversal says will participate in potential Dish arbitration "
    },
    {
        "content": "NEW YORK  March 20 A quiet decision by private equity firm Blackstone Group LP to recently sell three TV stations may foreshadow uncertain returns for some selling TV airwaves and lower wireless demand in the U.S. government's upcoming spectrum auction  industry watchers say.",
        "date": "03202016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Blackstone makes quiet sale ahead of FCC airwaves auction "
    },
    {
        "content": "March 15 Dish Network Corp said it is suing Comcast Corp's NBCUniversal for breach of contract and expects to file for arbitration to block NBC from blacking out its channels such as CNBC and Bravo.",
        "date": "03152016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish sues NBC over breach of contract "
    },
    {
        "content": "* \u007fissued statement regarding current distribution renewal negotiations with nbcuniversal\u007f",
        "date": "03152016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "BRIEF-Dish network \u007fissues statement on distribution renewal negotiations with NBCuniversal\u007f "
    },
    {
        "content": "March 7 Viacom CEO Philippe Dauman said on Monday that he expects to renew its contract with Dish Network Corp next quarter.",
        "date": "03072016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Viacom CEO says he expects to renew deal with Dish next quarter "
    },
    {
        "content": "Dish Network Corp  reported lower net income in 2015 from a year earlier amid a drop in pay-TV subscriptions and a wireless airwaves auction-related expense  sending its shares down more than 4 percent on Thursday.",
        "date": "02182016",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish net income tumbles in 2015 as subscribers drop; shares slump "
    },
    {
        "content": "* Exited 2015 with about 13.9 mln pay-TV subscribers   (Adds executive comments  updates Craig Moffett's subscriber estimates in ninth paragraph.)",
        "date": "02182016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 5-Dish net income tumbles in 2015 as subscribers drop; shares slump "
    },
    {
        "content": "Feb 18 Satellite TV company Dish Network Corp's  earnings dropped in 2015  hurt by a decline in pay-TV subscribers and a wireless airwaves auction-related expense  sending its shares down more than 3 percent in early trading on Thursday.",
        "date": "02182016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "CORRECTED-UPDATE 3-Dish 2015 earnings fall as subscribers decline; shares drop "
    },
    {
        "content": "Feb 18 Dish Network Corp reported a 3.4 percent rise in full-year revenue  helped by higher revenue per user in its core pay-TV business.",
        "date": "02182016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Satellite TV company Dish's revenue rises 3.4 pct in 2015 "
    },
    {
        "content": "Jan 5 The U.S. Federal Communications Commission said it is delaying its informal deadline by 15 days to review the proposed $56 billion merger of cable rivals Charter Communications Inc and Time Warner Cable Inc.",
        "date": "01052016",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "U.S. FCC delays Charter-Time Warner Cable merger review by two weeks "
    },
    {
        "content": "Dec 11 Dish Network Corp  the No. 2 U.S. satellite TV company by revenue  said CEO and co-founder Charlie Ergen will be relinquishing his post as president of the company.",
        "date": "12112015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish CEO Charlie Ergen steps down as president "
    },
    {
        "content": "By Ross Kerber     BOSTON  Nov 9 Mutual fund Sequoia's loss on Valeant Pharmaceuticals International underscores the danger of placing a big bet on an individual stock. But while Sequoia is an extreme example  it is not the only mutual fund doing it.     Some 13 other domestic U.S. equity funds that manage more than $1 billion in assets have placed 10 percent or more of their portfolio in a single company  according to data from Thomson Reuters' Lipper unit  with three of them holdin",
        "date": "11102015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Valeant meltdown puts spotlight on big mutual fund bets "
    },
    {
        "content": "Dish Network Corp  said its pay-TV subscriber losses accelerated and reported lower-than-expected quarterly revenue  reigniting questions around what the satellite-TV provider will do with its trove of wireless airwaves. | Video ",
        "date": "11092015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish misses revenue estimates as more subscribers ditch pay-TV "
    },
    {
        "content": "* Shares down 1.6 pct   (Recasts paragraph 1 with wireless plans  updates stock price  adds CEO comments)",
        "date": "11092015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 5-Dish misses revenue estimates as more subscribers ditch pay-TV "
    },
    {
        "content": "Nov 9 Dish Network Corp reported a 34.2 percent rise in quarterly profit  helped by higher revenue per user from its core pay-TV business.",
        "date": "11092015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish Network reports 34.2 percent rise in profit "
    },
    {
        "content": "* Time Warner Cable shares up 2 pct   (Adds analysts' comments  updates share prices)",
        "date": "10292015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 4-Time Warner Cable  Charter expect deal closing in Q1 2016  not 2015 "
    },
    {
        "content": "NEW YORK  Oct 26 Dish Network Corp will begin experimenting with automated ad sales  moving away from the pay-TV industry's years-old way of selling ads through phone calls  paperwork and in-person deal-making.",
        "date": "10262015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish to test automated TV ad sales "
    },
    {
        "content": "NEW YORK  Oct 26 Dish Network Corp will begin experimenting with automated ad sales  moving away from the pay-TV industry's years-old way of selling ads through phone calls  paperwork and in-person deal-making.",
        "date": "10262015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 1-Dish to test automated TV ad sales "
    },
    {
        "content": "Fire safety and security systems maker Tyco International Plc appointed Robert Olson  the chief financial officer of Dish Network Corp  in the same position.",
        "date": "10132015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Tyco hires Dish CFO Robert Olson as finance head "
    },
    {
        "content": "Oct 13 Fire safety and security systems maker Tyco International Plc appointed Robert Olson  the chief financial officer of Dish Network Corp  in the same position.",
        "date": "10132015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 1-Tyco hires Dish CFO Robert Olson as finance head "
    },
    {
        "content": "Dish Network Corp's affiliates on Thursday surrendered 197 spectrum licenses to the U.S. government after they were held ineligible for $3.3 billion in small-business discounts earlier this year  according to a senior U.S Federal Communications Commission official.",
        "date": "10022015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish affiliates surrender some spectrum licenses: FCC official "
    },
    {
        "content": "Dish Network Corp's affiliates on Thursday surrendered 197 spectrum licenses to the U.S. government after they were held ineligible for $3.3 billion in small-business discounts earlier this year  according to a senior U.S Federal Communications Commission official.",
        "date": "10022015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish affiliates surrender some spectrum licenses -FCC official "
    },
    {
        "content": "Oct 1 Dish Network Corp's affiliates on Thursday surrendered 197 spectrum licenses to the U.S. government after they were held ineligible for $3.3 billion in small-business discounts earlier this year  according to a senior U.S Federal Communications Commission official.",
        "date": "10022015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 2-Dish affiliates surrender some spectrum licenses -FCC official "
    },
    {
        "content": "WASHINGTON U.S. Federal Communications Commission Chairman Tom Wheeler on Wednesday called for an emergency meeting with Dish Network Corp and Sinclair Broadcast Group Inc over the continuing blackout affecting 129 TV stations.",
        "date": "08262015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "FCC calls emergency meeting with Dish  Sinclair on TV blackout "
    },
    {
        "content": "WASHINGTON  Aug 26 U.S. Federal Communications Commission Chairman Tom Wheeler on Wednesday called for an emergency meeting with Dish Network Corp and Sinclair Broadcast Group Inc over the continuing blackout affecting 129 TV stations.",
        "date": "08262015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "U.S. FCC calls emergency meeting with Dish  Sinclair on TV blackout "
    },
    {
        "content": "Aug 26 Dish Network Corp said subscribers have lost access to more than 100 local stations due to a distribution dispute with Sinclair Broadcast Group Inc   affecting viewers of a string of ABC  CBS  Fox  and NBC channels.",
        "date": "08262015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Local channels blacked out on Dish across 36 states "
    },
    {
        "content": "WASHINGTON The U.S. Federal Communications Commission on Monday voted to declare two companies affiliated with Dish Network Corp ineligible for $3.3 billion in small-business discounts for their bidding in a recent government auction of airwaves.",
        "date": "08172015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "FCC denies airwaves auction discounts for Dish Network partners "
    },
    {
        "content": "WASHINGTON  Aug 17 The U.S. Federal Communications Commission on Monday voted to declare two companies affiliated with Dish Network Corp ineligible for $3.3 billion in small-business discounts for their bidding in a recent government auction of airwaves.",
        "date": "08172015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "U.S. FCC denies airwaves auction discounts for Dish Network partners "
    },
    {
        "content": "Dish Network Corp  is figuring out next steps as it awaits a decision by U.S. regulators on its eligibility for a discount in a recent airwaves auction  executives said on Wednesday  after the company posted a significantly higher-than-expected quarterly profit.",
        "date": "08052015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish exploring next steps as it awaits airwaves discount decision "
    },
    {
        "content": "* Avg. revenue $87.91/pay-TV user vs $84.15 year ago   (Recasts with Dish's options ahead of FCC decision on discounts  adds CEO quotes and details throughout)",
        "date": "08052015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 3-Dish exploring next steps as it awaits airwaves discount decision "
    },
    {
        "content": "Aug 5 Dish Network Corp reported a 3.8 percent rise in quarterly revenue  helped by higher revenue per user from its core pay-TV business.",
        "date": "08052015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Satellite TV company Dish's revenue rises 3.8 pct "
    },
    {
        "content": "WASHINGTON U.S. Federal Communications Commission officials on Wednesday told Dish Network Corp that the staff review of the recent airwaves auction found Dish's two affiliates ineligible for $3.3 billion in small-business discounts.",
        "date": "07222015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "FCC tells Dish no go on discounts in recent airwaves auction "
    },
    {
        "content": "NEW YORK Harbinger Capital Partners  the hedge fund firm run by Philip Falcone  filed a new lawsuit accusing satellite TV company Dish Network Corp and its chairman  Charles Ergen  of illegally trying to strip it of control of wireless company LightSquared during its bankruptcy.",
        "date": "07212015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Harbinger sues Dish  Ergen over LightSquared  seeks $1.5 bln "
    },
    {
        "content": "WASHINGTON  July 22 Dish Network Corp  on Wednesday confirmed the U.S. Federal Communications Commission's plan to declare its two partner companies ineligible for $3.3 billion in small-business discounts they sought in a recent auction of airwaves.",
        "date": "07222015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish responds to FCC's push against discounts in recent airwaves auction "
    },
    {
        "content": "NEW YORK Harbinger Capital Partners  the hedge fund firm run by Philip Falcone  filed a new lawsuit accusing satellite TV company Dish Network Corp and its chairman  Charles Ergen  of illegally trying to strip it of control of wireless company LightSquared during its bankruptcy.",
        "date": "07212015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Harbinger sues Dish  Ergen over LightSquared  seeks $1.5 billion "
    },
    {
        "content": "NEW YORK  July 21 Harbinger Capital Partners  the hedge fund firm run by Philip Falcone  filed a new lawsuit accusing satellite TV company Dish Network Corp and its chairman  Charles Ergen  of illegally trying to strip it of control of wireless company LightSquared during its bankruptcy.",
        "date": "07212015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 1-Harbinger sues Dish  Ergen over LightSquared  seeks $1.5 bln "
    },
    {
        "content": "NEW YORK  July 21 Harbinger Capital Partners  the hedge fund firm run by Philip Falcone  has filed a new lawsuit accusing satellite TV company Dish Network Corp  and its chairman  Charles Ergen  of illegally trying to strip it of control of the bankrupt wireless company LightSquared.",
        "date": "07212015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Harbinger sues Dish  Ergen over LightSquared "
    },
    {
        "content": "The U.S. Federal Communications Commission is set to reject $3.3 billion worth of discounts requested by partners of Dish Network Corp  SNR Wireless and NorthStar Wireless  in the government's $45 billion airwave auction earlier this year  the Wall Street Journal reported  citing sources.",
        "date": "07162015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "U.S. FCC set to reject Dish entities' $3.3 billion auction discounts: WSJ "
    },
    {
        "content": "WASHINGTON The Federal Communications Commission is considering capping bidding discounts that small businesses can receive in U.S. auctions of airwaves  after Dish Network Corp partners sought $3 billion in discounts under current rules.",
        "date": "06252015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "U.S. FCC may cap small-business discount in airwaves auctions "
    },
    {
        "content": "WASHINGTON  June 25 The Federal Communications Commission is considering capping bidding discounts that small businesses can receive in U.S. auctions of airwaves  after Dish Network Corp partners sought $3 billion in discounts under current rules.",
        "date": "06252015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 1-U.S. FCC may cap small-business discount in airwaves auctions "
    },
    {
        "content": "Dish Network Corp is in talks to hire banks that will provide between $10 billion and $15 billion in debt to finance the cash portion of its bid for T-Mobile US Inc  three people familiar with the matter said on Thursday.",
        "date": "06112015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish seeks $10-15 billion in financing for T-Mobile: sources "
    },
    {
        "content": "June 11 Dish Network Corp is in talks to hire banks that will provide between $10 billion and $15 billion in debt to finance the cash portion of its bid for T-Mobile US Inc  three people familiar with the matter said on Thursday.",
        "date": "06112015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 1-Dish seeks $10-15 bln in financing for T-Mobile -sources "
    },
    {
        "content": "June 11 Dish Network Corp is in talks with banks over funding a bid for T-Mobile US Inc  the Wall Street Journal reported on Thursday.",
        "date": "06112015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish in talks with banks about funding T-Mobile deal - WSJ "
    },
    {
        "content": "NEW YORK  June 4 A merger of T-Mobile US Inc  and satellite TV company Dish Network Corp  could force Sprint Corp to pursue a deal or partnership itself.",
        "date": "06052015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "RPT-Deal between T-Mobile and Dish could spell trouble for Sprint "
    },
    {
        "content": "* Deutsche Telekom shares top German blue-chips   (Adds Sprint's strategic options)",
        "date": "06042015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "UPDATE 8-Dish  T-Mobile US talk merger  wireless spectrum a key factor "
    },
    {
        "content": "NEW YORK  June 4 A merger of T-Mobile US Inc  and satellite TV company Dish Network Corp  could force Sprint Corp to pursue a deal or partnership itself.",
        "date": "06042015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Deal between T-Mobile and Dish could spell trouble for Sprint "
    },
    {
        "content": "NEW YORK/WASHINGTON Just four months ago  T-Mobile US Inc Chief Executive John Legere warned consumers that results of a U.S. airwaves auction \"should scare the hell out of you\" because winning bids by Dish Network Corp and bigger phone companies threatened competition. | Video ",
        "date": "06042015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish  T-Mobile US talk merger  wireless spectrum a key factor "
    },
    {
        "content": "NEW YORK/WASHINGTON  June 4 Just four months ago  T-Mobile US Inc Chief Executive John Legere warned consumers that results of a U.S. airwaves auction \"should scare the hell out of you\" because winning bids by Dish Network Corp and bigger phone companies threatened competition.",
        "date": "06042015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "RPT-UPDATE 7-Dish  T-Mobile US talk merger  wireless spectrum a key factor "
    },
    {
        "content": "* Indexes down: Dow 0.65 pct  S&P 0.55 pct  Nasdaq 0.45 pct   (Updates to early afternoon)",
        "date": "06042015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "US STOCKS-Wall St slips as US productivity falls  bond rout eases "
    },
    {
        "content": "* Indexes down: Dow 0.48 pct  S&P 0.43 pct  Nasdaq 0.28 pct   (Adds details  changes comment  updates prices)",
        "date": "06042015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "US STOCKS-U.S. stocks edge lower as nonfarm productivity slips "
    },
    {
        "content": "* Indexes down: Dow 0.02 pct  S&P 0.12 pct  Nasdaq 0.07 pct   (Updates to open)",
        "date": "06042015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "US STOCKS-Wall St pares losses after IMF urges delay in rate hike "
    },
    {
        "content": "* Futures down: Dow 65 pts  S&P 8 pts  Nasdaq 25 pts   (Adds details  comment  updates prices)",
        "date": "06042015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "US STOCKS-Futures cut some losses after weekly jobs data "
    },
    {
        "content": "WASHINGTON  May 13 Dish Network Corp  Cogent Communications Holdings Inc and advocacy groups are asking U.S. regulators to restrict AT&T Inc's power over online video and other content as part of its proposed purchase of DirecTV.",
        "date": "05132015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish  Cogent specify demands for concessions in AT&T-DirecTV merger "
    },
    {
        "content": "Dish Network Corp  reported a 3.6 percent rise in quarterly revenue as it earned more per user in its core pay-TV business  making up for a fall in subscribers.",
        "date": "05112015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish revenue rises as it earns more per pay-TV user "
    },
    {
        "content": "* Spectrum strategy to remain the focus - Analysts   (Adds analyst comment  details  shares)",
        "date": "05112015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 2-Dish revenue rises as it earns more per pay-TV user "
    },
    {
        "content": "May 11 Dish Network Corp reported a 3.6 percent rise in quarterly revenue as more revenue per user in its core pay-TV business made up for a fall in total number of subscribers.",
        "date": "05112015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish revenue jumps 3.6 pct as pay-TV revenue per user rises "
    },
    {
        "content": "WASHINGTON  May 5 Netflix Inc has urged the U.S. Federal Communications Commission to reject the pending $48 billion merger of AT&T Inc and DirecTV unless its concerns about the deal are addressed.",
        "date": "05052015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 2-Netflix asks U.S. FCC to reject AT&T-DirecTV merger unless changes made "
    },
    {
        "content": "WASHINGTON  April 29 The U.S. Senate Commerce Committee is investigating what it called a concern about collusion in a recent Federal Communications Commission auction of airwaves  the panel's chairman said on Wednesday.",
        "date": "04292015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "UPDATE 2-U.S. Senate panel probes 'collusion concern' in FCC spectrum auction "
    },
    {
        "content": "WASHINGTON  April 29 U.S. Federal Communications Commission on Wednesday began allowing critics to formally voice opposition to awarding $3 billion in discounts to partners of Dish Network Corp that emerged as winning bidders in the recent auction of airwaves.",
        "date": "04292015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "U.S. FCC begins collecting petitions from opponents to Dish discounts "
    },
    {
        "content": "A federal judge on Tuesday dismissed a lawsuit by Philip Falcone's Harbinger Capital Partners that accused satellite TV company Dish Network Corp and its chairman  Charles Ergen  of illegally trying to strip the hedge fund of control of the bankrupt wireless company LightSquared.",
        "date": "04282015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Harbinger racketeering lawsuit vs Dish  Ergen is dismissed "
    },
    {
        "content": "April 28 A federal judge on Tuesday dismissed a lawsuit by Philip Falcone's Harbinger Capital Partners that accused satellite TV company Dish Network Corp and its chairman  Charles Ergen  of illegally trying to strip the hedge fund of control of the bankrupt wireless company LightSquared.",
        "date": "04282015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 1-Harbinger racketeering lawsuit vs Dish  Ergen is dismissed "
    },
    {
        "content": "April 28 A Colorado federal judge on Tuesday dismissed a lawsuit in which Harbinger Capital Partners accused Dish Network Corp and its chairman Charles Ergen of violating a federal racketeering law  and sought at least $1.5 billion of damages.",
        "date": "04282015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Harbinger racketeering lawsuit against Dish  Ergen is dismissed "
    },
    {
        "content": "April 9 Dish Network Corp's Sling TV said it has added Time Warner Inc's HBO to its programming lineup.",
        "date": "04092015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish Network's Sling TV adds HBO "
    },
    {
        "content": "Dish Network Corp and Time Warner reached a new agreement on Wednesday that will allow Dish subscribers continued access to Turner Broadcasting and HBO programming.",
        "date": "04012015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish  Time Warner come to new agreement; Sling TV gets HBO "
    },
    {
        "content": "April 1 Dish Network Corp and Time Warner reached a new agreement on Wednesday that will allow Dish subscribers continued access to Turner Broadcasting and HBO programming.",
        "date": "04012015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 1-Dish  Time Warner come to new agreement; Sling TV gets HBO "
    },
    {
        "content": "April 1 Dish Network Corp and Time Warner settled on a new agreement Wednesday that will allow Dish subscribers continued access to Turner Broadcasting and HBO programming.",
        "date": "04012015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish  Time Warner come to new agreement "
    },
    {
        "content": "NEW YORK Wireless venture LightSquared on Thursday concluded three years of litigation with creditors  securing U.S. Bankruptcy Court approval of a plan to end its Chapter 11 case and repay in full its largest creditor  Dish Network Corp  Chairman Charles Ergen.",
        "date": "03262015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "LightSquared bankruptcy exit plan earns court approval "
    },
    {
        "content": "NEW YORK  March 26 Wireless venture LightSquared on Thursday concluded three years of litigation with creditors  securing U.S. Bankruptcy Court approval of a plan to end its Chapter 11 case and repay in full its largest creditor  Dish Network Corp Chairman Charles Ergen.",
        "date": "03262015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 1-LightSquared bankruptcy exit plan earns court approval "
    },
    {
        "content": "March 26 A U.S. bankruptcy judge said on Thursday she will approve wireless venture LightSquared's plan to exit bankruptcy and repay its largest creditor  Dish Network Corp Chairman Charles Ergen  in full.",
        "date": "03262015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "REFILE-Bankruptcy judge says to approve LightSquared bankruptcy exit plan "
    },
    {
        "content": "NEW YORK  March 26 Bankrupt LightSquared  after three years of litigation with creditors  on Thursday will seek U.S. court approval of a mostly consensual plan to end its bankruptcy and repay in full its largest creditor  Dish Network Corp Chairman Charles Ergen.",
        "date": "03262015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "LightSquared plan to repay Dish chairman goes before U.S. judge "
    },
    {
        "content": "NEW YORK Bankrupt U.S. wireless venture LightSquared filed a new restructuring plan on Wednesday that would pay the full $1.5 billion claim to its largest creditor  Dish Network Corp Chairman Charles Ergen  in cash  with interest.",
        "date": "03182015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "LightSquared plans to repay Dish Network chairman in full "
    },
    {
        "content": "NEW YORK  March 18 Bankrupt U.S. wireless venture LightSquared filed a new restructuring plan on Wednesday that would pay the full $1.5 billion claim to its largest creditor  Dish Network Corp Chairman Charles Ergen  in cash  with interest.",
        "date": "03182015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 3-LightSquared plans to repay Dish Network chairman in full "
    },
    {
        "content": "A lawyer for LightSquared on Monday said the company will set aside $400 million to give certain bankruptcy lenders  including Dish Network Corp Chairman Charles Ergen  the option to take a portion of their repayment in cash  instead of notes.",
        "date": "03092015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "LightSquared to set aside some cash for Ergen  lenders "
    },
    {
        "content": "NEW YORK  March 9 A lawyer for LightSquared on Monday said the company will set aside $400 million to give certain bankruptcy lenders  including Dish Network Corp  Chairman Charles Ergen  the option to take a portion of their repayment in cash instead of notes.",
        "date": "03092015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 2-LightSquared to set aside some cash for Ergen  lenders "
    },
    {
        "content": "FRANKFURT T-Mobile US  chief executive said on Friday it made sense to team up with U.S. satellite TV company Dish .",
        "date": "02272015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "T-Mobile U.S. CEO says makes sense to team up with Dish "
    },
    {
        "content": "Co-founder and Chairman Charlie Ergen will return to the helm of Dish Network Corp  which is struggling to stanch subscriber losses  when the incumbent chief executive steps down next month. | Video ",
        "date": "02232015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Ergen to reclaim Dish CEO title as Clayton retires "
    },
    {
        "content": "Feb 23 Co-founder and Chairman Charlie Ergen will return to the helm of Dish Network Corp  which is struggling to stanch subscriber losses  when the incumbent chief executive steps down next month.",
        "date": "02232015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 3-Ergen to reclaim Dish CEO title as Clayton retires "
    },
    {
        "content": "Feb 23 Dish Network Corp said Chief Executive Joe Clayton would retire effective March 31 and be replaced by founder Charlie Ergen.",
        "date": "02232015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish Network CEO Joe Clayton to retire "
    },
    {
        "content": "Feb 20 AT&T Inc has urged the U.S. Federal Communications Commission to relook into bidding rules for spectrum  saying licenses should not go to \"speculators or stockpilers\".",
        "date": "02202015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "AT&T urges FCC to revisit spectrum bidding rules "
    },
    {
        "content": "WASHINGTON  Feb 18 T-Mobile's chief executive on Wednesday called the recent U.S. auction of airwaves \"a disaster\" for American consumers as he took aim at rules that allowed Dish Network Corp to partner with companies that may qualify for some $3 billion in discounts.",
        "date": "02192015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "CORRECTED-T-Mobile presses U.S. to change rules for sale of airwaves "
    },
    {
        "content": "WASHINGTON  Feb 18 T-Mobile's chief executive on Wednesday called the recent U.S. auction of airwaves \"a disaster\" for American consumers as he took aim at rules that allowed Dish Network Corp to partner with companies that may qualify for some $13 billion in discounts.",
        "date": "02182015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "T-Mobile presses U.S. to change rules for sale of airwaves "
    },
    {
        "content": "A member of the U.S. Federal Communications Commission on Monday called for an investigation of a $3 billion discount granted to partners of Dish Network Corp in the government's recent auction of wireless licenses.",
        "date": "02022015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "FCC member seeks investigation of Dish auction discount "
    },
    {
        "content": "Feb 2 A member of the U.S. Federal Communications Commission on Monday called for an investigation of a $3 billion discount granted to partners of Dish Network Corp in the government's recent auction of wireless licenses.",
        "date": "02022015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 1-FCC member seeks investigation of Dish auction discount "
    },
    {
        "content": "Feb 2 A member of the Federal Communications Commission (FCC) is objecting to Dish Network Corp's  claim on more than $3 billion in discounts aimed at small business in the government's auction of wireless licenses  the Wall Street Journal reported.",
        "date": "02022015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "FCC member objects to Dish's wireless deal - WSJ "
    },
    {
        "content": "WASHINGTON U.S. regulators will review a $3 billion discount claimed by Dish Network Corp and partners including investment management company BlackRock Inc during a U.S. government wireless spectrum auction that ended this week.",
        "date": "01312015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish's $3 billion wireless auction discount up for U.S. regulator review "
    },
    {
        "content": "WASHINGTON/SAN FRANCISCO AT&T Inc  spent close to half the total in the record-setting U.S. sale of airwaves for mobile data  with Dish Network Corp  spending heavily to manage a surprise win at No.2 ahead of Verizon  results showed on Friday.",
        "date": "01302015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "AT&T top buyer at U.S. airwaves auction; Dish spends big "
    },
    {
        "content": "WASHINGTON  Jan 30 U.S. regulators will review a $3 billion discount claimed by Dish Network Corp and partners including investment management company BlackRock Inc  during a U.S. government wireless spectrum auction that ended this week.",
        "date": "01312015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish's $3 bln wireless auction discount up for U.S. regulator review "
    },
    {
        "content": "WASHINGTON  Jan 29 The U.S. Federal Communications Commission raised a record $44.9 billion in the auction of so-called AWS-3 airwaves that closed on Thursday  marking the highest point yet in the wireless industry's appetite for more spectrum.",
        "date": "01292015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 3-U.S. wireless spectrum auction raises record $44.9 billion "
    },
    {
        "content": "WASHINGTON/SAN FRANCISCO  Jan 30 AT&T Inc  spent close to half the total in the record-setting U.S. sale of airwaves for mobile data  with Dish Network Corp  spending heavily to manage a surprise win at No.2 ahead of Verizon  results showed on Friday.",
        "date": "01302015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 3-AT&T top buyer at U.S. airwaves auction; Dish spends big "
    },
    {
        "content": "WASHINGTON  Jan 30 AT&T Inc  Verizon Communications Inc and bidding partners of Dish Network Corp spent the most on the record-setting U.S. sale of wireless airwaves for mobile data  known as AWS-3  according to auction results released on Friday.",
        "date": "01302015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "AT&T  Verizon  Dish bid the most in U.S. airwaves auction "
    },
    {
        "content": "LOS ANGELES The Fox News and Fox Business channels returned on Thursday to satellite TV provider Dish Network Corp's  lineup after both sides agreed to a multiyear deal.",
        "date": "01162015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "Dish reaches deal that brings back Fox news  business channels "
    },
    {
        "content": "LOS ANGELES  Jan 15 The Fox News and Fox Business channels returned on Thursday to satellite TV provider Dish Network Corp's lineup after both sides agreed to a multiyear deal.",
        "date": "01162015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 2-Dish reaches deal that brings back Fox news  business channels "
    },
    {
        "content": "LOS ANGELES  Jan 15 Dish Network Corp  said the Fox News and Fox Business channels will return soon to the satellite TV provider's lineup after both sides agreed on Thursday to the major terms of a multi-year deal.",
        "date": "01152015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish agrees on terms to bring back Fox news  business channels "
    },
    {
        "content": "NEW YORK/LAS VEGAS Jan 8 Media companies that are starting to allow their programs onto Internet-delivered TV and mobile devices are putting limits on digital rights as a safety hatch if problems arise with the new distribution systems  executives say.",
        "date": "01082015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Media embracing digital TV with strings attached "
    },
    {
        "content": "Jan 5 Dish Network Corp on Monday took the wraps off its long-anticipated video streaming service  named Sling TV  targeted to younger consumers who shun pricey cable and satellite subscriptions.",
        "date": "01052015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "Dish unveils Sling TV video streaming service "
    },
    {
        "content": "Jan 7 Dish Network Corp is not averse to buying traditional TV ads to woo young viewers away from their cable or satellite subscriptions to its less costly Sling TV streaming service.",
        "date": "01072015",
        "name": "DISH Network Corporation",
        "news_type": "topStory",
        "symbol": "DISH",
        "title": "REFILE-Dish Network aims Sling TV ads at young viewers who shun cable bills "
    },
    {
        "content": "(Adds details on launch date  ESPN and competing services)",
        "date": "01052015",
        "name": "DISH Network Corporation",
        "news_type": "normal",
        "symbol": "DISH",
        "title": "UPDATE 1-Dish unveils Sling TV video streaming service "
    }
]