[
    {
        "content": "* Delphi board of directors approves delphi technologies spin-off",
        "date": "11132017",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi board of directors approves Delphi Technologies spin-off "
    },
    {
        "content": "DETROIT Delphi Automotive Plc  reported a higher-than-expected third-quarter profit on Thursday on growing demand for electrification and advanced fuel technologies  but the automotive supplier's fourth-quarter outlook disappointed investors.",
        "date": "11022017",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Delphi profit beats estimates  but outlook disppoints "
    },
    {
        "content": "DETROIT  Nov 2 Delphi Automotive Plc reported a higher-than-expected third-quarter profit on Thursday on growing demand for electrification and advanced fuel technologies  but the automotive supplier's fourth-quarter outlook disappointed investors.",
        "date": "11022017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 1-Delphi profit beats estimates  but outlook disppoints "
    },
    {
        "content": "DETROIT  Nov 2 Delphi Automotive Plc reported a higher-than-expected third-quarter profit on Thursday on growing demand for electrification and advanced fuel technologies  and the parts supplier raised its full-year revenue and earnings outlooks.",
        "date": "11022017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi profit beats estimates; full-year outlook raised "
    },
    {
        "content": "* Delphi reports third quarter 2017 financial results; raises fourth quarter and full year 2017 outlook",
        "date": "11022017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi reports Q3 revenue $4.3 billion "
    },
    {
        "content": "Delphi Automotive Plc said on Tuesday it will buy self-driving car software startup nuTonomy for $450 million  helping to put automated vehicles using its technology into commercial use in 2019  a year earlier than planned.",
        "date": "10242017",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Delphi to buy self-driving tech startup nuTonomy for $450 million "
    },
    {
        "content": "Oct 24 Delphi Automotive Plc said on Tuesday it will buy self-driving car software startup nuTonomy for $450 million  helping to put automated vehicles using its technology into commercial use in 2019  a year earlier than planned.",
        "date": "10242017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 2-Delphi to buy self-driving tech startup nuTonomy for $450 mln "
    },
    {
        "content": "Oct 24 Delphi Automotive Plc will buy self-driving software startup nuTonomy for $450 million  it said on Tuesday  helping the auto supplier put automated vehicles into commercial use in 2019  a year earlier than planned.",
        "date": "10242017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi buys self-driving technology firm nuTonomy for $450 mln "
    },
    {
        "content": "* Delphi Automotive Plc - ‍signed an agreement to acquire nuTonomy  Inc. for an upfront purchase price of $400 million​",
        "date": "10242017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi to acquire nuTonomy for $400 million​ "
    },
    {
        "content": "* Conglomerate to spin off two business after corporate rethink",
        "date": "10102017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 5-Honeywell seeks M&A as it keeps aero  spins off 2 units "
    },
    {
        "content": "TORONTO  Sept 28 A Canadian investment fund will launch the world's first \"future car\" exchange-traded fund on Friday  giving investors one-stop access to companies involved in electric  autonomous and connected car supply chains  senior fund executives said.",
        "date": "09282017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Upstart fund to launch 'future car' ETF in Canada "
    },
    {
        "content": "DETROIT Delphi Automotive Plc  Chief Executive Kevin Clark said on Wednesday the company's two post split-up parts  to be called Aptiv and Delphi Technologies  can thrive on their own and that there was no strategy to seek buyers.",
        "date": "09272017",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Delphi CEO says Aptiv  Delphi Tech can thrive on their own "
    },
    {
        "content": "DETROIT  Sept 27 Delphi Automotive Plc Chief Executive Kevin Clark said on Wednesday the company's two post split-up parts  to be called Aptiv and Delphi Technologies  can thrive on their own and that there was no strategy to seek buyers.",
        "date": "09272017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 1-Delphi CEO says Aptiv  Delphi Tech can thrive on their own "
    },
    {
        "content": "* Expects its powertrain business Delphi Tech's operating cash flow to be about $700 million by 2020  up from pro forma $400 million in 2017",
        "date": "09272017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi says powertrain business to generate $6 bln in sales by 2022 - investor conf "
    },
    {
        "content": "Auto suppliers Delphi Automotive Plc and BlackBerry Ltd will partner on a software operating system for self-driving cars  the companies said on Wednesday.",
        "date": "09202017",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Delphi  BlackBerry partner on self-driving software system "
    },
    {
        "content": "FRANKFURT  Sept 22 Carmakers squeezed between carbon emissions cuts and falling sales of fuel-efficient diesels have used the Frankfurt auto show to spotlight a future generation of electric cars that will largely come too late to help them out of their bind.",
        "date": "09222017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Diesel's disgrace brings hybrids-for-all in race to electrify "
    },
    {
        "content": "* Delphi automotive plc - on track to achieve 2017 outlook - conference",
        "date": "09272017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi Automotive on track to achieve 2017 outlook "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  September 27 (Fitch) Fitch Ratings has affirmed BorgWarner Inc.'s (BWA) Long-Term Issuer Default Rating (IDR) at 'BBB+' and Short-Term IDR at 'F2'. Fitch has also affirmed BWA's unsecured credit facility and senior unsecured notes ratings at 'BBB+' and Commercial Paper (CP) program rating at 'F2'. A complete list of ratings follows at the end of this release. BWA's ratings apply to a $1.2 billion unsecured revolving credit faci",
        "date": "09272017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Fitch Affirms BorgWarner's IDR at 'BBB+'; Outlook Stable "
    },
    {
        "content": "Sept 20 Auto suppliers Delphi Automotive Plc and BlackBerry Ltd  will partner on a software operating system for self-driving cars  the companies said on Wednesday.",
        "date": "09202017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 3-Delphi  BlackBerry partner on self-driving software system "
    },
    {
        "content": "DETROIT  Sept 27 Delphi Automotive Plc said Aptiv PLC will be the name of the electronics company left after its automotive powertrain operations are spun off.",
        "date": "09272017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi names spin-off firms Aptiv  Delphi Technologies "
    },
    {
        "content": "* Delphi teams with Blackberry QNX for autonomous driving operating system platform‍​",
        "date": "09202017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi  Blackberry partner for autonomous driving operating system platform‍​ "
    },
    {
        "content": "* Delphi achieves major milestone towards completing Powertrain Systems spin-off",
        "date": "09152017",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi announces pricing of private offering of notes by DPS "
    },
    {
        "content": "* Delphi partners with LeddarTech to provide LIDAR for autonomous vehicles",
        "date": "09142017",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi partners with LeddarTech to provide LIDAR for autonomous vehicles "
    },
    {
        "content": "FRANKFURT  Sept 14 South Korea's Samsung Electronics Co Ltd plans to become a major player in autonomous driving  building on its recent $8 billion acquisition of audio and auto parts supplier Harman and its pole position in mobile communications markets.",
        "date": "09142017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 1-Samsung enters autonomous driving race with new business  funding "
    },
    {
        "content": "FRANKFURT  Sept 14 South Korea's Samsung Electronics Co Ltd plans to become a major player in autonomous driving  building on its recent $8 billion acquisition of audio and auto parts supplier Harman and its pole position in mobile communications markets.",
        "date": "09142017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Samsung enters autonomous driving race with new business  funding "
    },
    {
        "content": "* Delphi announces $750 million private offering of senior notes by its powertrain systems spin-off subsidiary  Delphi Jersey Holdings Plc",
        "date": "09082017",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi announces $750 mln private offering of senior notes "
    },
    {
        "content": "Aug 18 Delphi Automotive Plc said on Friday it has partnered with laser-based sensor maker Innoviz Technologies to improve vehicle safety for self-driving cars  after making a minority investment in the Israel-based company.",
        "date": "08182017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi partners with Innoviz for self-driving technology "
    },
    {
        "content": "* Has signed a commercial partnership agreement with Innoviz Technologies for mass commercialization of autonomous vehicles",
        "date": "08182017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi Automotive signs agreement with Innoviz Technologies for mass commercialization of autonomous vehicles "
    },
    {
        "content": "Vehicle component maker Delphi Automotive Plc  raised its full-year forecasts  driven by a strong second quarter and growth prospects in electrification and safety systems  including those being developed for self-driving vehicles.",
        "date": "08022017",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Delphi Automotive raises full-year profit  revenue forecasts "
    },
    {
        "content": "Aug 2 Vehicle component maker Delphi Automotive Plc raised its full-year forecasts  driven by a strong second quarter and growth prospects in electrification and safety systems  including those being developed for self-driving vehicles.",
        "date": "08022017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 3-Delphi Automotive raises full-year profit  revenue forecasts "
    },
    {
        "content": "Aug 2 Vehicle component maker Delphi Automotive Plc reported a 43 percent rise in quarterly profit  benefiting from continued automaker interest as it helps develop technology for self-driving vehicles.",
        "date": "08022017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi Automotive profit jumps 43 pct "
    },
    {
        "content": "DETROIT Delphi Automotive PLC  will partner with Paris-based Transdev Group  a public transport service controlled by the French government  to develop an automated on-demand shuttle service in Europe  the companies said on Wednesday.",
        "date": "06072017",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Delphi  Transdev to develop self-driving transport service in Europe "
    },
    {
        "content": "DETROIT  June 7 Delphi Automotive PLC will partner with Paris-based Transdev Group  a public transport service controlled by the French government  to develop an automated on-demand shuttle service in Europe  the companies said on Wednesday.",
        "date": "06072017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 2-Delphi  Transdev to develop self-driving transport service in Europe "
    },
    {
        "content": "* Transdev and Delphi announce commercial partnership for autonomous transportation",
        "date": "06072017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "BRIEF-Transdev  Delphi announce commercial partnership for autonomous transportation "
    },
    {
        "content": "DETROIT  June 7 Delphi Automotive PLC will partner with Paris-based Transdev Group  a public transport service controlled by the French government  to develop an automated on-demand shuttle service in Europe  the companies said on Wednesday.",
        "date": "06072017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi  Transdev to develop self-driving shuttle service in Europe "
    },
    {
        "content": "DETROIT  May 16 German automaker BMW AG   U.S. chipmaker Intel Corp and parts maker Delphi Automotive PLC on Tuesday said they would collaborate on development of a highly-automated self-driving platform for BMW  with Delphi handling integration of components and software.",
        "date": "05162017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi joins self-driving alliance with BMW  Intel "
    },
    {
        "content": "* BMW Group  Intel and Mobileye announce Delphi as a development partner and system integrator for their autonomous driving platform",
        "date": "05162017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "BRIEF-BMW Group  Intel and Mobileye announce Delphi as development partner for autonomous driving platform "
    },
    {
        "content": "SAN FRANCISCO  May 8 Dell Technologies Inc said on Monday it has combined the venture capital operations from its two predecessor companies  computer maker Dell Inc and data storage firm EMC Corp  and said it plans to invest about $100 million a year in startups.",
        "date": "05082017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Dell combines venture capital units after EMC merger "
    },
    {
        "content": "DETROIT Automotive supplier Delphi Automotive Plc  on Wednesday said it plans to spin off operations tied to internal combustion engines and focus on technology for electrically powered and self-driving vehicles  boosting its share price and highlighting the challenges for legacy auto industry players.",
        "date": "05032017",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Investors cheer Delphi's bet on electric  connected cars "
    },
    {
        "content": "DETROIT  May 3 Automotive supplier Delphi Automotive Plc on Wednesday said it plans to spin off operations tied to internal combustion engines and focus on technology for electrically powered and self-driving vehicles  boosting its share price and highlighting the challenges for legacy auto industry players.",
        "date": "05032017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 6-Investors cheer Delphi's bet on electric  connected cars "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Delphi is going where carmakers can only dream of driving. The $23 billion parts maker is spinning off its powertrain unit to focus on connected and autonomous vehicle technology. These fast-growing  higher-margin businesses will sport a top-tier multiple even if car sales slow. The likes of Ford and General Motors don’t have the luxury of following Delphi’s lead.",
        "date": "05032017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Breakingviews -Delphi goes where carmakers only dream of driving "
    },
    {
        "content": "DETROIT  May 3 Automotive supplier Delphi Automotive Plc on Wednesday reported a higher quarterly net profit due to higher revenue in all regions and announced it would spin off its powertrain unit into a separate company.",
        "date": "05032017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "REFILE-Delphi profit rises  to spin off of powertrain business "
    },
    {
        "content": "FRANKFURT/DETROIT  April 13 The race to develop and exploit autonomous vehicle technology is reshaping the hierarchy of the automotive industry  replacing traditional top-down manufacturing relationships with complex webs of alliances and acquisitions.",
        "date": "04132017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Self-driving 'arms race' complicates supplier alliances "
    },
    {
        "content": "* Delphi Automotive Plc - has made a strategic investment in an israel-based leader in signal processing capability Source text for Eikon: Further company coverage:",
        "date": "04062017",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi Automotive makes strategic investment in an Israel-based leader in signal processing capability "
    },
    {
        "content": "SAN FRANCISCO  April 6 Car parts supplier and integrator Delphi Automotive on Thursday announced investments and partnerships in three privately held companies to help carmakers profit from the increasing amount of data produced by the growing number of vehicles connected to the internet.",
        "date": "04062017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi takes stake in companies to profit from data in connected cars "
    },
    {
        "content": "DETROIT  March 10 California  the largest U.S. car market  plans to allow testing on public roads of self-driving vehicles without human backup drivers by the end of the year  state officials said Friday.",
        "date": "03102017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "California paves way to self-driving car tests without humans "
    },
    {
        "content": "* CEO Kevin Clark's FY 2016 total compensation $10.4 million versus $12.2 million in FY 2015 - SEC filing  Source text for Eikon: (http://bit.ly/2ngQI6Z) Further company coverage:",
        "date": "03132017",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi CEO Kevin Clark's FY 2016 total compensation $10.4 mln vs $12.2 mln in FY 2015 "
    },
    {
        "content": "DETROIT Delphi Automotive Plc  said on Thursday that if it brings any manufacturing to the United States from Mexico  it is likely to be automated work  which has fewer jobs attached to it  as the company issued fourth-quarter earnings that surpassed Wall Street expectations  sending shares higher.",
        "date": "02022017",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Delphi says automated work may come to U.S. from Mexico "
    },
    {
        "content": "DETROIT  Feb 2 Delphi Automotive Plc  said on Thursday that if it brings any manufacturing to the United States from Mexico  it is likely to be automated work  which has fewer jobs attached to it  as the company issued fourth-quarter earnings that surpassed Wall Street expectations  sending shares higher.",
        "date": "02022017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 2-Delphi says automated work may come to U.S. from Mexico "
    },
    {
        "content": "* Delphi reports fourth quarter and full year 2016 financial results",
        "date": "02022017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi Q4 EPS $1.83 from continuing operations excluding items "
    },
    {
        "content": "DETROIT  Feb 2 Delphi Automotive Plc's  fourth-quarter earnings widely beat Wall Street expectations  as the automotive supplier continued to benefit from automaker interest as it helps develop technology in the evolution toward self-driving vehicles.",
        "date": "02022017",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi Automotive earnings widely beat Wall Street estimates "
    },
    {
        "content": "* Says expects 2016 adjusted operating income to be about $2.2 billion",
        "date": "01112017",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi expects to grow operating margins 30-40 basis points in 2017 - Deutsche Bank Conf "
    },
    {
        "content": "Nov 29 Auto parts maker Delphi Automotive Plc  and Israeli technology firm Mobileye NV will put an Intel Corp chip at the heart of their joint effort to produce self-driving vehicles by 2019  the companies said on Tuesday.",
        "date": "11292016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi  Mobileye to use Intel chip for self-driving car system "
    },
    {
        "content": "* FY2016 earnings per share view $5.98  revenue view $16.43 billion -- Thomson Reuters I/B/E/S",
        "date": "11022016",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi reports Q3 earnings per share $1.07 from continuing operations "
    },
    {
        "content": "DETROIT  Oct 25 Investors dumped General Motors Co shares on Tuesday  despite record third-quarter results  highlighting the disconnect between Detroit and Wall Street as the long U.S. vehicle sales boom cools off.",
        "date": "10252016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 5-General Motors beats earnings expectations; investor fears linger "
    },
    {
        "content": "MOUNTAIN VIEW  Calif.  Oct 5 Google's self-driving vehicles are mastering complex situations on public roads  from cars going the wrong way to bicycles darting in front of traffic  as the technology company strives to win the high-profile race to achieve full vehicle automation  executives said on Wednesday.",
        "date": "10052016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Google makes progress on self-driving cars  hits 2 million mile mark "
    },
    {
        "content": "* Co supplied sensors and related control modules for airbags in affected vehicles in compliance with GM's product specifications and validation criteria",
        "date": "09092016",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi Automotive says fully cooperating with GM's implementation efforts surrounding recall "
    },
    {
        "content": "* Intends to redeem for cash entire $800 million aggregate principal amount outstanding of co's 5.00 percent senior notes due 2023",
        "date": "08312016",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi to redeem $800 mln aggregate principal amount outstanding of co's 5.00 pct senior notes "
    },
    {
        "content": "* Delphi Automotive Plc Says Priced Eur 500 Million Aggregate Principal Amount Of Its 1.600% Senior Notes Due 2028",
        "date": "08312016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi announces pricing of senior notes offering "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  August 31 (Fitch) Fitch Ratings has assigned a rating of 'BBB' to  Delphi Automotive PLC's (DLPH) proposed issuance of EUR500 million in senior  unsecured notes. The Issuer Default Rating (IDR) for DLPH is 'BBB'  with a  Stable Outlook. The proposed notes will be fully guaranteed on a senior unsecured basis by the  same subsidiaries that guarantee the senior unsecured notes and unsecured credit  facility of DLPH's Delphi Corpor",
        "date": "08312016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Fitch Rates Delphi Automotive's Proposed Notes 'BBB' "
    },
    {
        "content": "Aug 23 Israeli driving assistant software maker Mobileye NV said on Tuesday it was developing a self-driving system with Delphi Automotive Plc that will be ready for production by 2019.",
        "date": "08232016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Mobileye  Delphi to develop self-driving system "
    },
    {
        "content": "* On August 17  2016  co  wholly-owned U.S. subsidiary Delphi Corporation entered into a restatement agreement - SEC filing",
        "date": "08182016",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi Automotive says co unit entered restatement agreement "
    },
    {
        "content": "* Mobileye and delphi to establish partnership for sae level 4/5 automated driving solution for 2019  Source text for Eikon:  Further company coverage:",
        "date": "08232016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "BRIEF-Mobileye and Delphi to establish partnership for automated driving solution "
    },
    {
        "content": "August 1 Delphi Automotive Plc will launch a small test fleet of automated taxis in Singapore next year  aiming to ferry passengers around a city district in one of the first real-world tests of automated rides on demand  the company said on Monday.",
        "date": "08012016",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Delphi  Singapore launch test of self-driving taxis "
    },
    {
        "content": "DETROIT Delphi Automotive Plc   a global vehicle components supplier  on Wednesday reported quarterly earnings that narrowly beat expectations as its revenues rose 9 percent  led by growth in automotive electronics  which accounted for more than half of revenue.",
        "date": "08032016",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Delphi Automotive narrowly beats second-quarter profit estimates "
    },
    {
        "content": "August 1 Delphi Automotive Plc will launch a small test fleet of automated taxis in Singapore next year  aiming to ferry passengers around a city district in one of the first real-world tests of automated rides on demand  the company said on Monday.",
        "date": "08012016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "CORRECTED-Delphi  Singapore launch test of self-driving taxis "
    },
    {
        "content": "DETROIT  Aug 3 Delphi Automotive Plc  a global vehicle components supplier  on Wednesday reported quarterly earnings that narrowly beat expectations as its revenues rose 9 percent  led by growth in automotive electronics  which accounted for more than half of revenue.",
        "date": "08032016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 2-Delphi Automotive narrowly beats 2nd-quarter profit estimates "
    },
    {
        "content": " ",
        "date": "08032016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "RPT-UPDATE 1-Delphi Automotive narrowly beats profit estimates for quarter "
    },
    {
        "content": "* Q2 earnings per share $1.59 from continuing operations excluding items",
        "date": "08032016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi Automotive Q2 EPS $1.59 from continuing operations excluding items "
    },
    {
        "content": "DETROIT  Aug 3 Delphi Automotive  a global vehicle components supplier  on Wednesday reported second-quarter earnings that narrowly beat Wall Street expectations as its revenue grew in North America  Europe and Asia but fell in South America.",
        "date": "08032016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi Automotive narrowly beats profit estimates for quarter "
    },
    {
        "content": "CASABLANCA Canada's Linamar Corp will build a 2.7 billion dirhams ($280 million) plant in Morocco to make engine parts  Morocco's industry minister said on Monday.",
        "date": "07042016",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Delphi  Linamar to build new plants in Morocco: minister "
    },
    {
        "content": "CASABLANCA  July 4 Canada's Linamar Corp  will build a 2.7 billion dirhams ($280 million) plant in Morocco to make engine parts  Morocco's industry minister said on Monday.",
        "date": "07042016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 1-Delphi  Linamar to build new plants in Morocco -minister "
    },
    {
        "content": "CASABLANCA  July 4 Canada's Linamar Corp  will build a 2.7 billion dirhams ($280 million) plant in Morocco to make engines' parts  Moroccan industry minister said on Monday.",
        "date": "07042016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi  Linamar to build new plants in Morocco-minister "
    },
    {
        "content": "BEIJING  May 16 Mobileye NV expects its China sales to increase \"exponentially\" after the country moves to require advanced driver assistance systems (ADAS) in all buses and trucks  an executive said on Monday.",
        "date": "05162016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Mobileye China sees boom in sales as gov't moves on automated driving systems "
    },
    {
        "content": "DETROIT Delphi Automotive  a global vehicle components supplier  on Wednesday reported first-quarter earnings that narrowly beat Wall Street expectations as its revenue grew 7 percent on strong vehicle production in all of its global regions  the company said.",
        "date": "05042016",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Delphi Automotive narrowly beats Street  sales up 7 percent "
    },
    {
        "content": "DETROIT  April 28 U.S. consumers who are under 40 are more open than older people to self-driving cars and their underlying systems  according to a survey released on Thursday by J.D. Power.",
        "date": "04282016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 1-Younger U.S. buyers more open to self-driving cars  -J.D. Power "
    },
    {
        "content": "* Q1 earnings per share $1.36 from continuing operations excluding items",
        "date": "05042016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi posts Q1 adj. earnings $1.36/shr from continuing operations "
    },
    {
        "content": "DETROIT  April 28 U.S. consumers who are under 40 are more open than older people to self-driving cars and their underlying systems  according to a survey released on Thursday by J.D. Power.",
        "date": "04282016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Younger buyers more open to self-driving cars  -J.D. Power "
    },
    {
        "content": "April 13 Delphi Automotive Plc has won an appeal with the U.S. Internal Revenue Service  allowing it to be treated as a British company for tax purposes after it reincorporated in the UK  the auto-parts supplier said on Wednesday.",
        "date": "04132016",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "UPDATE 2-Delphi ruled a British company for U.S. tax purposes -filing "
    },
    {
        "content": "April 13 Delphi Automotive Plc has won an appeal with the U.S. Internal Revenue Service and can be considered a British company  the automotive supplier said in a filing with U.S. securities regulators on Wednesday.",
        "date": "04132016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi Automotive wins appeal with IRS  which says it's British company -filing "
    },
    {
        "content": "* Delphi automotive plc says has authorized a new share repurchase program of up to $1.5 billion",
        "date": "04132016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi Automotive authorizez new share repurchase program of up to $1.5 billion "
    },
    {
        "content": "* Board approved compensation arrangements for CFO Massaro of annual base salary of $550 000\u007f  Source text - http://1.usa.gov/1TOMKdL Further company coverage:",
        "date": "03012016",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi Automotive \u007fboard approves CFO Massaro's annual base salary of $550 000\u007f "
    },
    {
        "content": "Auto parts maker Delphi Automotive Plc  reported a 3 percent rise in quarterly revenue  helped by strength in its Asian  European and North American markets.",
        "date": "02042016",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Delphi Automotive's quarterly revenue rises 3 percent "
    },
    {
        "content": "Feb 4 Auto parts maker Delphi Automotive Plc  reported a 3 percent rise in quarterly revenue  helped by strength in its Asian  European and North American markets.",
        "date": "02042016",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi Automotive's quarterly revenue rises 3 pct "
    },
    {
        "content": "Oct 19 Shanghai Aerospace Automobile Electromechanical",
        "date": "10192015",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "BRIEF-Shanghai Aerospace Auto to buy stake in Delphi Automotive System Singapore's unit "
    },
    {
        "content": "* Received non-binding letters of intent with respect to 13.8 million Hellermanntyton shares",
        "date": "08242015",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "BRIEF-Delphi received non-binding letters of intent from about 6.4 pct of Hellermanntyton shares "
    },
    {
        "content": "U.S.-listed auto parts supplier Delphi Automotive  is buying British cable equipment maker HellermannTyton Group  for about 1.1 billion pounds ($1.7 billion) as it seeks to capitalize on the growing connected-car market.",
        "date": "07302015",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Delphi to buy HellermannTyton for $1.7 billion in connected-car drive "
    },
    {
        "content": "July 30 U.S.-listed auto parts supplier Delphi Automotive is buying British cable equipment maker HellermannTyton Group for about 1.1 billion pounds ($1.7 billion) as it seeks to capitalise on the growing connected-car market.",
        "date": "07302015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 3-Delphi to buy HellermannTyton for $1.7 billion in connected-car drive "
    },
    {
        "content": "DETROIT Auto parts supplier Delphi Automotive Plc  announced several key transactions on Thursday that will beef up its expertise and capability in the fast-growing fields of connected cars and automated driving.",
        "date": "07302015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi beefs up portfolio in connected  automated cars "
    },
    {
        "content": "DETROIT  July 30 Auto parts supplier Delphi Automotive Plc announced several key transactions on Thursday that will beef up its expertise and capability in the fast-growing fields of connected cars and automated driving.",
        "date": "07302015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 2-Delphi beefs up portfolio in connected  automated cars "
    },
    {
        "content": "DETROIT  July 30 Auto parts supplier Delphi Automotive Plc said on Thursday that second-quarter net income rose but revenue fell as a stronger dollar hurt overseas results.",
        "date": "07302015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi net income rises in second quarter  revenue falls "
    },
    {
        "content": "July 30 Auto supplier Delphi Automotive Plc  said it will acquire HellermannTyton Group for about 1.07 billion pounds ($1.67 billion) to expand its electrical architecture global business.",
        "date": "07302015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi Automotive to buy HellermannTyton Group for about $1.67 bln "
    },
    {
        "content": "BRUSSELS  June 25 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "06252015",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "EU mergers and takeovers (June 25) "
    },
    {
        "content": "BRUSSELS  June 24 The European Commission said on Wednesday it had approved Germany's Mahle Behr's  proposed acquisition of the thermal systems business of U.S. auto supplier Delphi.",
        "date": "06242015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "EU clears Mahle purchase of Delphi's air conditioning business "
    },
    {
        "content": "A U.S. appeals court on Thursday upheld the dismissal of a lawsuit by the United Auto Workers union claiming that General Motors Co  was required to pay $450 million to cover medical benefits for an affiliate's retirees.",
        "date": "05142015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "GM wins dismissal of UAW retiree benefit lawsuit appeal "
    },
    {
        "content": "May 14 A U.S. appeals court on Thursday upheld the dismissal of a lawsuit by the United Auto Workers union claiming that General Motors Co was required to pay $450 million to cover medical benefits for an affiliate's retirees.",
        "date": "05142015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 1-GM wins dismissal of UAW retiree benefit lawsuit appeal "
    },
    {
        "content": "May 14 A U.S. appeals court on Thursday upheld the dismissal of a lawsuit by the United Auto Workers union claiming that General Motors Co was required to pay $450 million to cover medical benefits for an affiliate's retirees.",
        "date": "05142015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "GM wins dismissal of UAW retiree benefit suit appeal "
    },
    {
        "content": "DETROIT Delphi Automotive Plc  Chief Executive Kevin Clark said the company could spend $1 billion to $3 billion this year on a large acquisition related to its traditional \"hardware\" business and will make smaller investments in software.",
        "date": "04302015",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Could spend $3 billion on acquisition in 2015: Delphi Automotive CEO "
    },
    {
        "content": "DETROIT  April 30 Delphi Automotive Plc  Chief Executive Kevin Clark said the company could spend $1 billion to $3 billion this year on a large acquisition related to its traditional \"hardware\" business and will make smaller investments in software.",
        "date": "04302015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "CORRECTED-UPDATE 2-Delphi Automotive CEO-Could spend $3 bln on acquisition in 2015 "
    },
    {
        "content": "DETROIT  April 30 Auto supplier Delphi Automotive Plc on Thursday posted first quarter profit and revenue results that beat analyst expectations.",
        "date": "04302015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi Automotive beats quarterly profit expectations "
    },
    {
        "content": "DETROIT  March 13 Delphi Automotive PLC  aims to demonstrate its growing prowess in self-driving cars with what it bills as the \"longest automated drive ever attempted in North America\" - a 3 500-mile coast-to-coast excursion in a specially rigged Audi SQ5 that will mostly drive itself.",
        "date": "03132015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi plans coast-to-coast demo of its self-driving car "
    },
    {
        "content": "where assigned  and hit the newskey (F9 on Reuters terminals)",
        "date": "03022015",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "New Issue-Delphi Automotive prices 700 mln euro 2025 bond "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO/NEW YORK  March 02 (Fitch) Fitch Ratings has assigned Delphi Automotive  PLC's (DLPH) proposed euro-denominated issuance of 10-year senior unsecured  notes a rating of 'BBB'. The note's rating is in line with DLPH's Issuer Default  Rating (IDR) of 'BBB'  which has a Stable Outlook. The proposed notes will be issued by DLPH  whereas the company's existing senior  unsecured notes have been issued by Delphi Corporation (Delphi)  a ",
        "date": "03022015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Fitch Rates Delphi Automotive's Proposed Notes 'BBB' "
    },
    {
        "content": "FRANKFURT German auto supplier Mahle [BEHR.UL] on Thursday said it agreed to buy rival Delphi's  air conditioning business  to expand its thermal management expertise as cars make greater use of electric motors and batteries which need special cooling.",
        "date": "02192015",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Mahle buys Delphi's air conditioning business for $727 million "
    },
    {
        "content": "FRANKFURT  Feb 19 German auto supplier Mahle  on Thursday said it agreed to buy rival Delphi's  air conditioning business  to expand its thermal management expertise as cars make greater use of electric motors and batteries which need special cooling.",
        "date": "02192015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Mahle buys Delphi's air conditioning business for $727 mln "
    },
    {
        "content": "Feb 19 The following corporate finance-related stories were reported by media:",
        "date": "02192015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 1-Market Chatter-Corporate finance press digest "
    },
    {
        "content": "DETROIT Delphi Automotive Plc  said sales of advanced vehicle-safety systems would jump 50 percent annually for the next several years  sending the auto supplier's shares up to a record high Thursday.",
        "date": "02052015",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Delphi expects vehicle safety system sales to jump 50 percent for years "
    },
    {
        "content": "DETROIT  Feb 5 Delphi Automotive Plc  said sales of advanced vehicle-safety systems would jump 50 percent annually for the next several years  sending the auto supplier's shares up to a record high Thursday.",
        "date": "02052015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "UPDATE 1-Delphi expects vehicle safety system sales to jump 50 pct for years "
    },
    {
        "content": "DETROIT Delphi Automotive Plc's  incoming chief executive said sales of advanced safety systems related to autonomous driving development will rise 50 percent annually for the next several years.",
        "date": "02052015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi sees advanced safety sales rising 50 percent sales next few years "
    },
    {
        "content": "DETROIT  Feb 5 Delphi Automotive Plc's  incoming chief exective said sales of advanced safety systems related to autonomous driving development will rise 50 percent annually for the next several years.",
        "date": "02052015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi sees advanced safety sales rising 50 pct sales next few years "
    },
    {
        "content": "DETROIT Kevin Clark  who will become Delphi Automotive Plc's chief executive on March 1  said the company's active safety systems business will grow by 50 percent this year  from $160 million in 2014.",
        "date": "02052015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi Automotive 2015 active safety sales to rise 50 percent: executive "
    },
    {
        "content": "DETROIT  Feb 5 Kevin Clark  who will become Delphi Automotive Plc's chief executive on March 1  said the company's active safety systems business will grow by 50 percent this year  from $160 million in 2014.",
        "date": "02052015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Delphi Automotive 2015 active safety sales to rise 50 pct - exec "
    },
    {
        "content": "DETROIT  Feb 5 Delphi Automotive Plc  late Wednesday night reported earnings that slightly beat Wall Street expectations on strong performance of its electronics and safety systems as well as powertrain businesses.",
        "date": "02052015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "CORRECTED-Delphi Automotive quarterly earnings beat expectations "
    },
    {
        "content": "FRANKFURT Germany's Mahle has launched a takeover bid for the air conditioning business of U.S. car parts maker Delphi   business daily Handelsblatt said on Thursday without citing sources.",
        "date": "01292015",
        "name": "Delphi Automotive plc",
        "news_type": "topStory",
        "symbol": "DLPH",
        "title": "Germany's Mahle seeks to buy Delphi's Thermal business: paper "
    },
    {
        "content": "FRANKFURT  Jan 29 Germany's Mahle has launched a takeover bid for the air conditioning business of U.S. car parts maker Delphi  business daily Handelsblatt said on Thursday without citing sources.",
        "date": "01292015",
        "name": "Delphi Automotive plc",
        "news_type": "normal",
        "symbol": "DLPH",
        "title": "Germany's Mahle seeks to buy Delphi's Thermal business -paper "
    }
]