[
    {
        "content": "There’s a landmine buried in a footnote on the last page of Digital Realty’s newly filed reply brief in the U.S. Supreme Court case that will determine the scope of Dodd-Frank anti-retaliation protections for corporate whistleblowers. And if the justices step on it  they could blow up administrative law as it’s currently practiced.",
        "date": "11092017",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "Chevron deference landmine lurks in new brief in SCOTUS whistleblower case "
    },
    {
        "content": "TOKYO Japanese trading house Mitsubishi Corp  plans to set up a joint venture with U.S. data center operator Digital Realty Trust  and build around 10 data centers in Japan by 2022 for 200 billion yen ($1.8 billion)  the Nikkei said on Saturday.",
        "date": "10212017",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "Japan's Mitsubishi  U.S. partner to invest $1.8 billion in data centers: media "
    },
    {
        "content": "TOKYO  Oct 21 Japanese trading house Mitsubishi Corp plans to set up a joint venture with U.S. data centre operator Digital Realty Trust and build around 10 data centres in Japan by 2022 for 200 billion yen ($1.8 billion)  the Nikkei said on Saturday.",
        "date": "10212017",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "Japan's Mitsubishi  U.S. partner to invest $1.8 bln in data centres -media "
    },
    {
        "content": "* Digital Realty and Mitsubishi Corporation announce joint venture in Japan",
        "date": "10232017",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty and Mitsubishi Corp announce joint venture in Japan "
    },
    {
        "content": "* Digital realty trust inc files for offering of upto 6.11 million shares of co's common stock in exchange for lp interests or common units ‍​- sec filing Source text for Eikon: (http://bit.ly/2hAkrCG) Further company coverage:",
        "date": "10102017",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty Trust Inc files for offering "
    },
    {
        "content": "* Digital Realty announces tender offer and consent solicitation for 5.875 pct senior notes due 2021 issued by Dupont Fabros Technology  L.P.",
        "date": "08312017",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty reports tender offer and consent solicitation for 5.875 pct senior notes "
    },
    {
        "content": "* Digital Realty commences offering of senior notes and preferred stock",
        "date": "08022017",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty Trust commences offering of senior notes and preferred stock "
    },
    {
        "content": "* Says are no longer giving guidance due to pending merger with Digital Realty Trust Source text for Eikon: Further company coverage:",
        "date": "07272017",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Dupont Fabros reports Q2 FFO per share $0.70 "
    },
    {
        "content": "* Digital realty names Sherri Liebo as senior vice president  marketing Source text for Eikon: Further company coverage:",
        "date": "07112017",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital realty names Sherri Liebo as senior vice president  marketing "
    },
    {
        "content": "* Digital Realty announces pricing of pounds sterling-denominated Guaranteed Notes",
        "date": "07122017",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty announces pricing of pounds sterling-denominated Guaranteed Notes "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  July 12 (Fitch) Fitch Ratings has assigned a 'BBB' rating to the guaranteed notes issued by Digital Stout Holding  LLC a subsidiary of Digital Realty Trust  Inc. (NYSE: DLR). The notes will be fully and unconditionally guaranteed by Digital Realty Trust  Inc. and Digital Realty Trust  L.P. The Rating Outlook is Stable. A full list of rating actions follows at the end of this release. KEY RATING DRIVERS On June 9  2017  Digital",
        "date": "07122017",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "Fitch Rates Digital Realty's Sr. Unsecured Notes 'BBB'; Outlook Stable "
    },
    {
        "content": "* INAP strategically expands with Digital Realty in Greater Phoenix",
        "date": "07062017",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-INAP strategically expands with Digital Realty in Greater Phoenix "
    },
    {
        "content": "June 9 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "06092017",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Digital Realty Trust Inc  said it would buy fellow data center operator DuPont Fabros Technology Inc  for an enterprise value of about $7.6 billion  its biggest-ever deal   to help expand in high-demand markets in the United States amid a rapid shift to the cloud by technology companies.",
        "date": "06092017",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "Digital Realty expands data center reach with DuPont Fabros buy "
    },
    {
        "content": "* DuPont Fabros shareholders to get 0.545 Digital Realty shares",
        "date": "06092017",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "UPDATE 3-Digital Realty expands data center reach with DuPont Fabros buy "
    },
    {
        "content": "* Implied per share value for digital realty deal is $64.32/share - Presentation",
        "date": "06092017",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "BRIEF-Dupont Fabros says implied value for Digital Realty deal is $64.32/share "
    },
    {
        "content": "* Dupont Fabros Technology- ‍upon termination of deal  under certain circumstances co to pay termination fee to digital realty of $150 million - SEC filing​",
        "date": "06092017",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "BRIEF-Dupont Fabros to pay $150 mln termination fee to Digital Realty in case of deal termination "
    },
    {
        "content": "June 9 Data center company Digital Realty Trust Inc said it would buy DuPont Fabros Technology Inc for an enterprise value of about $7.6 billion.",
        "date": "06092017",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "Data center company Digital Realty to buy DuPont Fabros in $7.6 bln deal "
    },
    {
        "content": "* Digital Realty Trust Inc - deal for transaction valued at approximately $7.6 billion in enterprise value",
        "date": "06092017",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty to merge with Dupont Fabros "
    },
    {
        "content": "April 28 Shaw Communications is looking for a buyer for ViaWest  the U.S. data center company it bought three years ago  according to people familiar with the matter  as the Canadian cable company continues to shed assets it considers non-core.",
        "date": "04282017",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "Shaw Communications explores selling ViaWest-sources "
    },
    {
        "content": "* To appoint Mary Hogan Preusse to board of directors Source text for Eikon: Further company coverage: (Bangalore.newsroom@thomsonreuters.com)",
        "date": "04272017",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty to appoint Mary Hogan Preusse to board "
    },
    {
        "content": "* Raised 2017 core FFO per share outlook from $5.90 - $6.10 to $5.95 - $6.10",
        "date": "04272017",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty Trust Q1 Core FFO per share $1.52 "
    },
    {
        "content": "* Digital realty announces redemption of 6.625 pct series F preferred stock",
        "date": "03062017",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty announces redemption of 6.625 pct series F preferred stock "
    },
    {
        "content": "* Digital Realty reports fourth quarter and full-year 2016 results",
        "date": "02162017",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty Q4 FFO per share $1.58 "
    },
    {
        "content": "Jan 26 Digital Bridge Holdings LLC  a firm that invests in data centers  has agreed to acquire Vantage Data Centers Management Co LLC from buyout firm Silver Lake Partners for well over $1 billion  including debt  people familiar with the matter said on Thursday.",
        "date": "01272017",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "Digital Bridge to acquire Vantage Data Centers for $1 bln -sources "
    },
    {
        "content": "* Digital Realty declares quarterly cash dividends for common and preferred stock",
        "date": "11102016",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty declares quarterly cash dividends for common and preferred stock "
    },
    {
        "content": "* FY 2016 FFO per share view $5.70 -- Thomson Reuters I/B/E/S  Source text for Eikon:  Further company coverage:",
        "date": "10272016",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty Q3 FFO per share $1.31 "
    },
    {
        "content": "* Digital Realty names daniel papes senior vice president of global sales and marketing  Source text for Eikon:  Further company coverage:",
        "date": "10272016",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty names Daniel Papes SVP of global sales and marketing "
    },
    {
        "content": "Oct 10 Private equity firm Silver Lake Partners LP is exploring a sale of Vantage Data Centers Management Co LLC that it hopes will value the U.S. company at well in excess of $1 billion  including debt  people familiar with the matter said on Monday.",
        "date": "10102016",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "Silver Lake explores sale of Vantage Data Centers -sources "
    },
    {
        "content": "* On Sept 27  settled portion of forward sale agreements by issuing 12 million shares to forward counterparties for about $1.1 billion",
        "date": "09282016",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty settled portion of forward sale agreements by issuing 12 million shares to forward counterparties for about $1.1 billion "
    },
    {
        "content": "* Says intends to redeem all 11.5 million outstanding shares of its 7.000% Series E cumulative redeemable preferred stock  Source text for Eikon:  Further company coverage:",
        "date": "08152016",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty to redeem 11.5 mln shares of its 7.000 pct Series E cumulative redeemable preferred stock "
    },
    {
        "content": "* Raised 2016 \"constant-currency\" core ffo per share outlook from $5.60 - $5.75 to $5.70 - $5.90  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "07282016",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital realty Q2 core FFO per share $1.42 "
    },
    {
        "content": "* Says public offering of 12.5 million common shares priced at $96.00 per share",
        "date": "05172016",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty prices common stock offering at $96.00 per share "
    },
    {
        "content": "* Digital realty announces common stock offering  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05162016",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty says offering 11.5 million common shares "
    },
    {
        "content": "* Granted equinix option to acquire facility at 114 rue ambroise croizat in paris associated business  for $215 million",
        "date": "05162016",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty to buy eight European data centers from Equinix for $874 mln "
    },
    {
        "content": "* Raised 2016 core ffo per share outlook from $5.45 - $5.60 to $5.55 - $5.65",
        "date": "04282016",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty Q1 FFO per share $1.39 "
    },
    {
        "content": "Digital Realty Trust Inc  said it would buy private equity owned Telx Group Inc in a deal valued at about $1.89 billion to double its footprint in the rapidly growing business of renting out space to companies to run their data centers.",
        "date": "07142015",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "Data center company Digital Realty to buy Telx in $1.89 billion deal "
    },
    {
        "content": "July 13 Digital Realty Trust Inc said it would buy private equity owned Telx Group Inc in a deal valued at about $1.89 billion to double its footprint in the rapidly growing business of renting out space to companies to run their data centers.",
        "date": "07142015",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "UPDATE 1-Data center company Digital Realty to buy Telx in $1.89 bln deal "
    },
    {
        "content": "July 13 Digital Realty Trust Inc  a real estate investment trust that rents out space to companies for setting up data centers  said it would buy Telx Group Inc from its private equity owners in a deal valued at about $1.89 billion.",
        "date": "07142015",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "Digital Realty to buy Telx in $1.89 bln deal "
    },
    {
        "content": "July 13 Fitch Ratings on Monday retracted a rating report on Digital Realty Trust Inc that said the company had bought privately owned data center peer Telx Group Inc.",
        "date": "07132015",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "UPDATE 1-Fitch retracts report on Digital Realty buying Telx "
    },
    {
        "content": "July 13 Fitch Ratings on Monday retracted a rating report on Digital Realty Trust Inc that said the company had bought privately owned data center peer Telx Group Inc.",
        "date": "07132015",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "Fitch retracts report on Digital Realty buying Telx "
    },
    {
        "content": "June 10 The following bids  mergers  acquisitions and disposals were reported by 2020 GMT on Wednesday:",
        "date": "06102015",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Digital Realty Trust Inc is working on a bid to acquire private equity-owned data center peer Telx Group Inc for more than $2 billion  in a deal that would diversify its business  according to people familiar with the matter.",
        "date": "06102015",
        "name": "Digital Realty Trust Inc",
        "news_type": "normal",
        "symbol": "DLR",
        "title": "Exclusive: Digital Realty seeking to acquire Telx "
    },
    {
        "content": "* Notes recent speculation regarding a potential transaction involving Telecity Group Plc",
        "date": "05142015",
        "name": "Digital Realty Trust Inc",
        "news_type": "topStory",
        "symbol": "DLR",
        "title": "BRIEF-Digital Realty Trust says not to make offer for Telecity "
    }
]