[
    {
        "content": "* CEO on conf call- \"consumer is demanding higher-quality products more quickly and at lower prices  a phenomenon known as the amazon effect\"",
        "date": "05042017",
        "name": "Dunkin&#39; Brands Group Inc",
        "news_type": "topStory",
        "symbol": "DNKN",
        "title": "BRIEF-Dunkin' Brands on conf call- Will roll out streamlined menu to 800 more restaurants this year "
    },
    {
        "content": "* Futures up: Dow 51 pts  S&P 6.25 pts  Nasdaq 18.5 pts (Adds details  comment  updates prices)",
        "date": "05042017",
        "name": "Dunkin&#39; Brands Group Inc",
        "news_type": "normal",
        "symbol": "DNKN",
        "title": "US STOCKS-Wall St set to open higher as Fed downplays economic weakness "
    },
    {
        "content": "May 4 U.S. stock index futures were higher on Thursday  a day after the Federal Reserve left interest rates unchanged and expressed confidence in the strength of the economy.",
        "date": "05042017",
        "name": "Dunkin&#39; Brands Group Inc",
        "news_type": "normal",
        "symbol": "DNKN",
        "title": "US STOCKS-Futures rises as Fed downplays economic weakness "
    },
    {
        "content": "Sept 22 Dunkin' Brands Group Inc on Thursday said it hired David Hoffmann  the McDonald's Corp  executive in charge of high-growth markets  including China and Russia  to lead its U.S. and Canadian business.",
        "date": "09222016",
        "name": "Dunkin&#39; Brands Group Inc",
        "news_type": "normal",
        "symbol": "DNKN",
        "title": "Dunkin' Brands hires McDonald's international executive "
    },
    {
        "content": "April 28 Dunkin' Brands Group Sees 2016 Donuts U.S. Comparable Store Sales Growth Of 0 To 2%  And Baskin",
        "date": "04282016",
        "name": "Dunkin&#39; Brands Group Inc",
        "news_type": "topStory",
        "symbol": "DNKN",
        "title": "BRIEF-Dunkin' Brands Q1 adjusted earnings per share $0.44 "
    },
    {
        "content": "* \u007fGrand Parade Investments Limited signs exclusive licence with Dunkin' Brands International\u007f",
        "date": "01222016",
        "name": "Dunkin&#39; Brands Group Inc",
        "news_type": "topStory",
        "symbol": "DNKN",
        "title": "BRIEF-Grand Parade signs exclusive licence with Dunkin' Brands "
    },
    {
        "content": "NEW YORK Dunkin' Donuts is a favorite of Bostonians and New Yorkers  but its regional popularity may have worked against it in the first quarter  when many of its customers may have been too cold and snowbound to make it to their stores.",
        "date": "04132015",
        "name": "Dunkin&#39; Brands Group Inc",
        "news_type": "topStory",
        "symbol": "DNKN",
        "title": "Frozen assets? Weather issue looms for Dunkin' Donuts in first quarter "
    }
]