[
    {
        "content": "* Domino's Pizza Inc - ‍has opened its first store in Austria​ Source text for Eikon: Further company coverage:",
        "date": "11132017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza ‍has opened its first store in Austria​ "
    },
    {
        "content": "* Says same store growth for Domino's at 5.5 percent in quarter ‍​ Source text - http://bit.ly/2yONg6A Further company coverage:",
        "date": "10262017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Jubilant Foodworks says same store growth for Domino's 5.5 pct in qtr "
    },
    {
        "content": "NEW YORK  Oct 26 Can you make serious money by capitalizing on human foibles?",
        "date": "10262017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Oh  behave: How to make sense of behavioral ETFs "
    },
    {
        "content": "Oct 10 Shares in Domino's Pizza jumped more than 10 percent on Tuesday after Britain's biggest pizza delivery firm reported a pick up in third-quarter sales  driven by online orders.",
        "date": "10102017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "UPDATE 1-Pick up in UK trading boosts Domino's Pizza shares "
    },
    {
        "content": "Domino's Pizza Inc's  same-store sales growth cooled in the latest quarter  dashing the expectations of bullish investors and sending shares in the pizza delivery chain down almost 5 percent on Thursday.",
        "date": "10122017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "Domino's same-store sales cool off  derailing stock rally "
    },
    {
        "content": "* LIEFERANDO.DE SIGNS DEAL WITH DOMINO'S IN GERMANY Source text - http://bit.ly/2wIqL10 Further company coverage: (Gdynia Newsroom)",
        "date": "10092017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Takeaway.com's lieferando.de signs deal with Domino's in Germany "
    },
    {
        "content": "Oct 12 Domino's Pizza Inc's same-store sales growth cooled in the latest quarter  dashing the expectations of bullish investors and sending shares in the pizza delivery chain down almost 5 percent on Thursday.",
        "date": "10122017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "UPDATE 3-Domino's same-store sales cool off  derailing stock rally "
    },
    {
        "content": "* Domino's Pizza announces third quarter 2017 financial results",
        "date": "10122017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza says Q3 EPS $1.18 "
    },
    {
        "content": "Oct 12 Domino's Pizza Inc  the biggest U.S. pizza delivery chain  reported a better-than-expected quarterly profit on Thursday as the company benefited from higher demand in the United States.",
        "date": "10122017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Domino's delivers profit beat as demand rises in U.S. "
    },
    {
        "content": "Sept 19 DP Eurasia  which operates the Domino's Pizza brand in Turkey and Russia  served up a 26 percent growth in its first-half core earnings  driven by an increase in like-for-like sales and expansion of store networks in its key markets.",
        "date": "09192017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "DP Eurasia delivers 26 percent core profit growth in first half "
    },
    {
        "content": "ANN ARBOR  Mich.  Aug 29 Ford Motor Co and Domino's Pizza Inc in September will begin testing Michigan consumers' reactions to having their pies delivered by self-driving vehicles  the companies said on  Tuesday.",
        "date": "08292017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Ford teams with Domino's on self-driving pizza delivery test "
    },
    {
        "content": "* Domino's and Ford begin consumer research of pizza delivery using self-driving vehicles Source text for Eikon: Further company coverage:",
        "date": "08292017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's and Ford begin consumer research of pizza delivery using self-driving vehicles "
    },
    {
        "content": "MOSCOW  July 21 Global pizza brands Domino's and Papa John's are preparing an assault on Russia's provinces  betting they can turn a profit far from Moscow as online card payments become more widespread and consumers get to know foreign brands better.",
        "date": "07232017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "RPT-Global pizza brands battle for Russia's far-flung regions "
    },
    {
        "content": "Domino's Pizza Inc  reported quarterly international same-restaurant sales that fell short of analysts' estimates  overshadowing strength in the United States and sending its shares down almost 10 percent in morning trading on Tuesday.",
        "date": "07252017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "Domino's international sales miss estimates  shares slide "
    },
    {
        "content": "MOSCOW  July 21 Global pizza brands Domino's and Papa John's are preparing an assault on Russia's provinces  betting they can turn a profit far from Moscow as online card payments become more widespread and consumers get to know foreign brands better.",
        "date": "07212017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Global pizza brands battle for Russia's far-flung regions "
    },
    {
        "content": "* Q2 earnings per share $1.32; q2 total revenue $628.6 million versus $547.3 million",
        "date": "07252017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza quarterly results "
    },
    {
        "content": "July 25 Domino's Pizza Inc reported better-than-expected quarterly revenue and profit  boosted by store openings  lower food costs and higher supply chain revenues from franchises.",
        "date": "07252017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Domino's delivers Street-beating sales and profit "
    },
    {
        "content": "* Commenced a strategic cooperation with Domino's Pizza Israel Source text for Eikon: Further company coverage:",
        "date": "07172017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Dragontail Systems commences strategic cooperation with Domino's Pizza Israel "
    },
    {
        "content": "* Domino's pizza inc - on june 12  units  co  domino's inc  domino's pizza llc entered into a purchase agreement dated june 12  2017 - sec filing",
        "date": "06142017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza says Domino's Inc  Domino's Pizza LLC entered into purchase agreement dated June 12  2017 "
    },
    {
        "content": "LONDON  June 15 DP Eurasia  the Domino's Pizza franchise holder in Russia and Turkey  has set a price range of between 200 and 230 pence a share for its initial public offer on the London Stock Exchange  implying a market capitalisation of up to 331 million pounds ($422 million).",
        "date": "06152017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "CORRECTED-Domino's Pizza in Turkey  Russia aims for $422 mln share market valuation "
    },
    {
        "content": "LONDON DP Eurasia  the Domino's Pizza  franchise holder in Russia and Turkey  has set a price range of between 200 and 230 pence a share for its initial public offer on the London Stock Exchange  implying a market capitalization of up to 331 million pounds ($422 million).",
        "date": "06152017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Dominos Pizza in Turkey  Russia aims for $422 million share market valuation "
    },
    {
        "content": "* DP Eurasia says expects to have free float of not less than 50 percent",
        "date": "06052017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "CORRECTED-BRIEF-Domino's Pizza Turkey  Russia franchisee plans London IPO "
    },
    {
        "content": "* Domino's Pizza Inc - ‍certain of its subsidiaries intend to complete a recapitalization transaction",
        "date": "05312017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza ‍says certain of its subsidiaries intend to complete recapitalization transaction "
    },
    {
        "content": "MEXICO CITY  May 30 Mexican restaurant operator Alsea said on Tuesday it had reached an agreement with U.S. investment firm General Atlantic to sell its minority stake in Grupo Axo  a company that operates fashion brands.",
        "date": "05302017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Mexico's Alsea agrees to sell Grupo Axo stake to General Atlantic "
    },
    {
        "content": "* Tiger Global Management takes share stake of 23.3 million Class A shares in Apollo Global Management - SEC filing",
        "date": "05152017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Tiger Global Management takes share stake in Apollo Global Management  raises share stake in Domino's Pizza "
    },
    {
        "content": "Domino's Pizza Inc  reported better-than-expected quarterly revenue and profit  helped by higher demand in the United States and more revenue from franchisees.",
        "date": "04272017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "Domino's dishes up profit beat on higher U.S. demand "
    },
    {
        "content": "April 27 Domino's Pizza Inc reported better-than-expected quarterly revenue and profit  helped by higher demand in the United States and more revenue from franchisees.",
        "date": "04272017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "UPDATE 1-Domino's dishes up profit beat on higher U.S. demand "
    },
    {
        "content": "April 27 Domino's Pizza Inc's reported a 37.4 percent rise in quarterly profit  helped by higher demand in the United States and more revenue from franchisees.",
        "date": "04272017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Domino's Pizza quarterly profit jumps 37.4 pct "
    },
    {
        "content": "* Domino's pizza® announces first quarter 2017 financial results",
        "date": "04272017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza Q1 EPS $1.26 "
    },
    {
        "content": "April 3 Shares of Panera Bread Co rose 8 percent to a record high on Monday on a report that the bakery cafe chain was considering strategic options  including a sale  after receiving takeover interest.",
        "date": "04032017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "UPDATE 2-Panera Bread shares jump on report of possible sale "
    },
    {
        "content": "* Domino's Pizza Inc - CEO J. PATRICK DOYLE'S 2016 total compensation was $8.6 million versus $9 million in 2015 - SEC filing  Source text for Eikon: Further company coverage:",
        "date": "03162017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza Inc says CEO J. Patrick Doyle's 2016 total compensation was $8.6 million "
    },
    {
        "content": "March 9 Britain's biggest pizza delivery firm Domino's Pizza said full-year operating profit rose 17.1 percent as online and mobile orders surged.",
        "date": "03092017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "Domino's Pizza FY profit rises 17 pct on more online  mobile orders "
    },
    {
        "content": "* Says ‍​domestic same store sales grew 12.2 percent during Q4",
        "date": "02282017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza Inc reports Q4 earnings per share $1.48 "
    },
    {
        "content": "Feb 28 Domino's Pizza inc on Tuesday reported better-than-expected rise in revenue for the fourth quarter  helped by strong sales in the United States and international markets  and by a higher store count.",
        "date": "02282017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Domino's revenue rises more than expected on strong U.S. sales "
    },
    {
        "content": "* Tiger global management takes share stake of 612 289 shares in dominos pizza inc - sec filing",
        "date": "02142017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Tiger Global Management takes share stake in Dominos Pizza "
    },
    {
        "content": "* For FY17  target would be to open around 110-115 new Domino's pizza restaurants and around 15 new Dunkin' Donuts restaurants",
        "date": "02062017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Jubilant Foodworks aims to open 110-115 new Domino's pizza restaurants in FY17 "
    },
    {
        "content": "* Says Domino's adds full ordering on Facebook messenger  Source text for Eikon:  Further company coverage:",
        "date": "02012017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza to add full ordering on Facebook messenger "
    },
    {
        "content": "* Says Domino's locations throughout New York City to hire 200 new team members  Source text for Eikon:  Further company coverage:",
        "date": "01192017",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza to hire 200 new team members "
    },
    {
        "content": "* Domino's Pizza Inc - offering 50 percent off on all menu-priced pizza orders placed online from Nov. 25 through Dec. 4  Source text for Eikon:  Further company coverage:",
        "date": "11252016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza offering 50 pct off "
    },
    {
        "content": "LONDON  Nov 24 Britain's biggest pizza delivery firm Domino's Pizza plans to increase its presence across the UK to 1 600 stores after seeing a strong performance from new outlets and a positive market outlook  it said on Thursday.",
        "date": "11242016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "UPDATE 1-Domino's Pizza steps up UK expansion plans with 1 600 store target "
    },
    {
        "content": "LONDON  Nov 24 European shares edged up on Thursday  remaining within a recent range  as a boost from chemical and insurance companies was partly offset by weak telecoms and utilities.",
        "date": "11242016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "European shares edge up  with chemicals in demand "
    },
    {
        "content": "Nov 24 Britain's FTSE 100 index is seen opening up  on Thursday  with futures up 0.19 percent ahead of the cash market open.",
        "date": "11242016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "UPDATE 2-UK Stocks-Factors to watch on Nov 24 "
    },
    {
        "content": "Domino's Pizza Inc  on Tuesday said share buybacks and a greater flow of customers helped deliver a large quarterly profit jump  despite intense competition that is pressuring its leading rivals. | Video ",
        "date": "10182016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "Domino's delivers growth as restaurant industry struggles "
    },
    {
        "content": "Oct 18 Domino's Pizza Inc on Tuesday said share buybacks and a greater flow of customers helped deliver a large quarterly profit jump  despite intense competition that is pressuring its leading rivals.",
        "date": "10182016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "UPDATE 1-Domino's delivers growth as restaurant industry struggles "
    },
    {
        "content": "Oct 18 Domino's Pizza Inc on Tuesday reported a bigger-than-expected 17 percent jump in quarterly revenue as its U.S. division overcame intense competition that is taking a bite out of industry sales.",
        "date": "10182016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Domino's revenue jumps more than expected "
    },
    {
        "content": "* \u007f\u007fQ3 earnings per share $0.96; Q3 total revenue $566.7 million versus $484.7 million",
        "date": "10182016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza posts Q3 earnings per share of $0.96 "
    },
    {
        "content": "* Customers can now order via facebook messenger  using bot technology  Source text for Eikon:  Further company coverage:",
        "date": "09152016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza launches messenger ordering in U.S. "
    },
    {
        "content": "* Said on Monday has reached an agreement to buy 22 stores of Domino's Pizza which have exclusive rights to Domino's brand in some areas on Mexico state  Mexico city and Hidalgo state",
        "date": "08092016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Alsea buys 22 stores of Domino's Pizza in Mexico "
    },
    {
        "content": "** Domino's Pizza hits a record high on Tuesday whilst fellow food delivery focused outfit Just Eat at its highest levels since January",
        "date": "07262016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BUZZ-Domino's Pizza  Just Eat: defying post-Brexit gloom "
    },
    {
        "content": "Domino's Pizza Inc's  shares hit a record high after the company reported better-than-expected quarterly sales and profit  helped by store openings and a jump in revenue from the services and products it provides to franchisees.",
        "date": "07212016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "Domino's shares hit record high after sales and profit beat "
    },
    {
        "content": "July 21 Domino's Pizza Inc's shares hit a record high after the company reported better-than-expected quarterly sales and profit  helped by store openings and a jump in revenue from the services and products it provides to franchisees.",
        "date": "07212016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "UPDATE 1-Domino's shares hit record high after sales and profit beat "
    },
    {
        "content": "* Q2 earnings per share view $0.94  revenue view $533.4 million -- Thomson Reuters I/B/E/S",
        "date": "07212016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza Inc Q2 shr $0.98 "
    },
    {
        "content": "July 21 Domino's Pizza Inc reported better-than-expected quarterly sales on Thursday  helped by increased revenue from the services and products it provides to franchisees and the addition of stores in markets outside the United States.",
        "date": "07212016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Domino's beats estimates as franchisees boost demand "
    },
    {
        "content": "June 6 T-Mobile US Inc  the No. 3 U.S. wireless provider  wants to turn its monthly subscribers into shareholders by offering them a share in the company's stock for free  it said on Monday.",
        "date": "06062016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "UPDATE 2-T-Mobile offers a share of itself to customers  launches gift app "
    },
    {
        "content": "June 6 T-Mobile US Inc said on Monday it will give a share of the wireless company's stock to customers who hold a postpaid or monthly account for free to turn its customers into shareholders.",
        "date": "06062016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "CORRECTED-UPDATE 1-T-Mobile offers a share of itself to customers  launches gift app "
    },
    {
        "content": "The New York attorney general's office on Tuesday sued Domino's Pizza Inc  claiming it is liable for wage theft by franchisees because the company used a computer system that it knew under-calculated workers' pay.",
        "date": "05242016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "Domino's sued by N.Y. attorney general over alleged wage theft by franchisees "
    },
    {
        "content": "May 24 The New York attorney general's office on Tuesday sued Domino's Pizza Inc  claiming it is liable for wage theft by franchisees because the company used a computer system that it knew under-calculated workers' pay.",
        "date": "05242016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "UPDATE 1-N.Y. official sues Domino's over alleged wage theft "
    },
    {
        "content": "The New York attorney general's office on Tuesday sued Domino's Pizza Inc   claiming it is liable for wage theft by franchisees because the company used a computer system that it knew under-calculated workers' pay. | Video ",
        "date": "05252016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "Domino's sued by N.Y. attorney general over alleged wage theft by franchisees "
    },
    {
        "content": "May 24 The New York attorney general's office on Tuesday filed a lawsuit claiming Domino's Pizza Inc is liable for alleged wage theft by franchisees because the company used a computer system that it knew under-calculated workers' pay.",
        "date": "05242016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Domino's sued over alleged wage theft by New York franchisees "
    },
    {
        "content": "* Authorized an increase to company's open market repurchase program",
        "date": "05252016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza says authorized increase to open market repurchase program "
    },
    {
        "content": "* Net of approximate $0.02 negative impact on Q1 earnings from New Year's calendar shift - conf call",
        "date": "04282016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's says about $0.02 negative impact on Q1 profit from New Year's calendar shift - conf call "
    },
    {
        "content": "April 28 Domino's Pizza Inc's quarterly profit and revenue missed estimates  hurt by weaker-than-expected U.S. sales and a strong dollar.",
        "date": "04282016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "UPDATE 1-Domino's Pizza profit disappoints as strong dollar bites "
    },
    {
        "content": "* Domino'S Pizza Inc Q1 earnings per share $0.89; Q1 revenue $539.2 million versus. $502 million",
        "date": "04282016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza reports Q1 earnings of $0.89/share "
    },
    {
        "content": "Domino's Pizza Inc  reported a 1.8 percent fall in quarterly profit  hurt by a strong U.S. dollar and expenses related to its recapitalization program.",
        "date": "04282016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Domino's Pizza first-quarter profit falls as strong dollar bites "
    },
    {
        "content": "April 28 Domino's Pizza Inc reported a 1.8 percent fall in quarterly profit  hurt by a strong U.S. dollar and expenses related to its recapitalization program.",
        "date": "04282016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Domino's Pizza 1st-qtr profit falls as strong dollar bites "
    },
    {
        "content": "By Daniel Wiessner A former Domino's Pizza Inc worker has filed a proposed class action claiming the company is a joint employer of workers at more than two dozen New York franchises whose owner has been targeted in state probes and other lawsuits over alleged wage violations.",
        "date": "04052016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "Lawsuit says Domino's a joint employer of franchise workers "
    },
    {
        "content": "Domino's Pizza Inc  reported a higher-than-expected quarterly profit as cheese prices fell and as demand in the United States held up despite heavy promotions from rivals such as Pizza Hut and Papa John's.",
        "date": "02252016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "Domino's profit boosted as demand holds up in U.S. pizza price war "
    },
    {
        "content": "* Shares jump 10.4 pct to hit record high   (Adds details  CEO  analyst comments; updates shares)",
        "date": "02252016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "UPDATE 2-Domino's profit boosted as demand holds up in U.S. pizza price war "
    },
    {
        "content": "Feb 25 Domino's Pizza Inc reported a 31 percent jump in quarterly profit as strong growth in the United States offset the drag from a strong U.S. dollar and expenses related to a recapitalization program that included early retirement of debt.",
        "date": "02252016",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Domino's Pizza profit rises 31 pct on strong U.S. sales "
    },
    {
        "content": "** Domino's Pizza up 4 pct  top FTSE midcap  riser after Citi raises stock to \"buy\"  lifts PT to 1170p from 760p",
        "date": "10202015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BUZZ-Domino's Pizza: top midcap gainer on Citi upgrade "
    },
    {
        "content": "* Domino's Pizza Enterprises Ltd says: initial cash consideration of 31.5 million euros  with a further 3.5 million euros in cash in instalments",
        "date": "10142015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "CORRECTED-Brief-Dominos Pizza Enterprises enters agreement to acquire Pizza Sprint chain in France "
    },
    {
        "content": "Domino's Pizza Inc's revenue fell below analysts average estimate for the second quarter in a row and the company said the strong dollar would eat into full-year results more than it had forecast.",
        "date": "10082015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "Domino's revenue misses estimates for second quarter in a row "
    },
    {
        "content": "Oct 8 Domino's Pizza Inc on Thursday reported quarterly revenue below analysts' estimates for the second straight quarter as the company struggles with a strong dollar.",
        "date": "10082015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "UPDATE 1-Domino's revenue misses estimates for second straight quarter "
    },
    {
        "content": "* Q3 total revenue $484.7 million versus $446.6 million; Q3 earnings per share $0.67",
        "date": "10082015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza reports Q3 EPS of $0.67 "
    },
    {
        "content": "Oct 8 Domino's Pizza Inc on Thursday reported higher third-quarter net income amid ongoing pressure from strong foreign currency exchange rates.",
        "date": "10082015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Domino's Pizza quarterly profit rises  strong dollar weighs "
    },
    {
        "content": "Domino's Pizza Inc  reported quarterly revenue that missed analysts estimates for the first time in two years due to a strong dollar  and said Chief Financial Officer Michael Lawton will retire at the end of August.",
        "date": "07162015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "Domino's revenue misses estimates for first time in two years "
    },
    {
        "content": "July 16 Domino's Pizza Inc reported quarterly revenue that missed analysts estimates for the first time in two years due to a strong dollar  and said Chief Financial Officer Michael Lawton will retire at the end of August.",
        "date": "07162015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "UPDATE 3-Domino's revenue misses estimates for first time in 2 yrs "
    },
    {
        "content": "July 16 Domino's Pizza Inc reported a better-than-expected rise in U.S. same-store sales for the second quarter  boosted by strong demand.",
        "date": "07162015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Domino's U.S. same-store sales beat estimates on higher demand "
    },
    {
        "content": "A federal judge in Brooklyn has awarded $574 000 in fees and costs to the lawyers who obtained a $1.5 million settlement on behalf of delivery drivers at Domino's Pizza-owned stores in New York state.",
        "date": "06252015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "Attorneys get $547K in fees for Domino's N.Y. drivers wage case "
    },
    {
        "content": "* Has implemented a new equipment and supply online ordering system for Domino's Pizza Inc franchisees",
        "date": "05052015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "BRIEF-Capgemini implements online ordering system for Domino's Pizza "
    },
    {
        "content": "April 6 Domino's Pizza Inc will need to raise the minimum wage to get the \"right people\" to stay competitive  the pizza chain's chief executive said on Monday  less than a week after McDonald's Corp said it plans to raise the minimum wage for its U.S. workers.",
        "date": "04062015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Domino's Pizza will have to raise wages to stay competitive - CEO "
    },
    {
        "content": "* Domino shares jumps to record high of 956 pence   (Adds details  analyst comments  share movement)",
        "date": "03112015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "UPDATE 2-Japan's Brother Industries to buy UK's Domino Printing for $1.55 bln "
    },
    {
        "content": "LONDON Bundle promotions and an increasingly popular app used by its army of teenage to 30-something fans helped Domino's Pizza  serve up over 1.4 million pizzas a week in Britain and Ireland in 2014  helping send profits up 15 percent.",
        "date": "02262015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "Online demand helps profits jump at UK's Domino's Pizza "
    },
    {
        "content": "LONDON  Feb 26 Bundle promotions and an increasingly popular app used by its army of teenage to 30-something fans helped Domino's Pizza serve up over 1.4 million pizzas a week in Britain and Ireland in 2014  helping send profits up 15 percent.",
        "date": "02262015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "UPDATE 1-Online demand helps profits jump at UK's Domino's Pizza "
    },
    {
        "content": "LONDON  Feb 26 Britain's biggest pizza delivery firm Domino's Pizza said it had made a strong start to its new financial year after posting a 15.1 percent rise in 2014 profit  helped by popular bundle promotions and rising online orders.",
        "date": "02262015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Domino's starts new year well as 2014 profit rises 15 pct "
    },
    {
        "content": "Domino's Pizza Inc  on Tuesday reported quarterly profit that fell short of Wall Street's estimate  as higher costs took some of the shine off better-than-expected sales at established restaurants.",
        "date": "02242015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "Domino's shares down on higher costs  wage hike worries "
    },
    {
        "content": "Feb 24  Domino's Pizza Inc on Tuesday reported quarterly profit that fell short of Wall Street's estimate  as higher costs took some of the shine off better-than-expected sales at established restaurants.",
        "date": "02242015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "UPDATE 1-Domino's shares down on higher costs  wage hike worries "
    },
    {
        "content": "* Q4 global retail sales (excluding foreign currency impact) up 13.7 percent",
        "date": "02242015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "BRIEF-Domino's Pizza Q4 reported basis earnings per share $0.85 "
    },
    {
        "content": "Feb 24  Domino's Pizza Inc's quarterly revenue jumped 14 percent  helped by strong demand in the United States and an increase in prices for ingredients it sells to franchisees.",
        "date": "02242015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "normal",
        "symbol": "DPZ",
        "title": "Strong U.S. demand boosts Domino's revenue "
    },
    {
        "content": "LONDON  Jan 21 Britain's biggest pizza delivery company Domino's Pizza said on Wednesday full-year pretax profit could come in slightly ahead of consensus  as it announced its finance chief had quit.",
        "date": "01212015",
        "name": "Domino&#39;s Pizza Inc",
        "news_type": "topStory",
        "symbol": "DPZ",
        "title": "Domino's Pizza finance chief quits "
    }
]