[
    {
        "content": "* David Stockert  former CEO of Post Properties  joins Duke Realty Board of Directors Source text for Eikon: Further company coverage:",
        "date": "10302017",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "BRIEF-David Stockert joins Duke Realty Board of Directors "
    },
    {
        "content": "* Sees FY 2017 core FFO per share $1.21 to $1.25 Source text for Eikon: Further company coverage:",
        "date": "10252017",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "BRIEF-Duke Realty reports Q3 FFO per share of $0.26 "
    },
    {
        "content": "* Duke Realty Corp - ‍board amended and restated its bylaws to implement \"proxy access\" and has adopted a board diversity policy​ Source text for Eikon: Further company coverage:",
        "date": "10272017",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "BRIEF-Duke Realty Corp's board of directors adopts proxy access and a board diversity policy "
    },
    {
        "content": "* Says ‍on October 25  board increased the size of the board from eleven members to twelve members ​- SEC filing Source text: (http://bit.ly/2yOdf0p) Further company coverage:",
        "date": "10262017",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "BRIEF-Duke Realty increases size of board "
    },
    {
        "content": "* Capstone Development CEO Norman Jenkins joins Duke Realty board of directors Source text for Eikon: Further company coverage:",
        "date": "08072017",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "BRIEF-Capstone Development CEO Norman Jenkins joins Duke Realty board of directors "
    },
    {
        "content": "* Duke realty corp - on July 26  2017  company's board of directors increased size of board from ten members to eleven members - SEC filing",
        "date": "07272017",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "BRIEF-Duke realty corp says on July 26  board increased size of board from 10 members to 11 members - SEC filing "
    },
    {
        "content": "* Healthcare Trust of America - in case of deal termination due to Duke's default under agreements  co would get a refund of the earnest money - SEC filing",
        "date": "05012017",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "BRIEF-Healthcare Trust of America to get refund of the earnest money in case of deal termination - SEC filing "
    },
    {
        "content": "* Duke Realty Corp- revised its guidance for ffo  as defined by nareit  to $1.23 to $1.33 per diluted share for 2017",
        "date": "04262017",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "BRIEF-Duke Realty reports Q1 FFO per share $0.32 "
    },
    {
        "content": "U.S. real estate investment trust Duke Realty Corp  said on Monday it would sell its medical office building assets to Healthcare Trust of America Inc   an owner and operator of medical offices  for $2.8 billion in cash.",
        "date": "05012017",
        "name": "Duke Realty Corporation",
        "news_type": "normal",
        "symbol": "DRE",
        "title": "Duke Realty to sell medical office assets to HTA for $2.8 billion "
    },
    {
        "content": "* Duke realty to sell medical office business to Healthcare Trust of America for $2.8 billion",
        "date": "05012017",
        "name": "Duke Realty Corporation",
        "news_type": "normal",
        "symbol": "DRE",
        "title": "BRIEF-Duke realty to sell medical office business to Healthcare Trust of America "
    },
    {
        "content": "May 1 U.S. real estate investment trust Duke Realty Corp said on Monday it would sell its medical office building assets to Healthcare Trust of America Inc   an owner and operator of medical offices  for $2.8 billion in cash.",
        "date": "05012017",
        "name": "Duke Realty Corporation",
        "news_type": "normal",
        "symbol": "DRE",
        "title": "UPDATE 1-Duke Realty to sell medical office assets to HTA for $2.8 bln "
    },
    {
        "content": "* Healthcare Trust of America to acquire Duke Realty's medical office portfolio for $2.75 billion",
        "date": "05012017",
        "name": "Duke Realty Corporation",
        "news_type": "normal",
        "symbol": "DRE",
        "title": "BRIEF-Healthcare Trust of America to acquire Duke Realty's medical office portfolio "
    },
    {
        "content": "May 1 Healthcare Trust of America Inc said on Monday it would buy the medical office building assets of Duke Realty Corp for $2.75 billion in cash.",
        "date": "05012017",
        "name": "Duke Realty Corporation",
        "news_type": "normal",
        "symbol": "DRE",
        "title": "Healthcare Trust of America to buy medical offices for $2.8 bln "
    },
    {
        "content": "Real estate investment trust Duke Realty Corp  is exploring the sale of its medical office buildings that could be worth as much as $3 billion  as it seeks to focus on its warehouse portfolio  people familiar with the matter said.",
        "date": "03022017",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "Exclusive: Duke Realty mulls sale of medical office buildings - sources "
    },
    {
        "content": "* Duke realty reports fourth quarter and full year 2016 results",
        "date": "01252017",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "BRIEF-Duke realty reports Q4 core FFO per share $0.31 "
    },
    {
        "content": "* Duke Realty Corp says total in-service occupancy at September 30  2016 of 97.3 percent compared to 96.7 percent at June 30  2016",
        "date": "10262016",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "BRIEF-Duke Realty posts Q3 FFO per share $0.31 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 07 (Fitch) Fitch Ratings has upgraded the ratings of Duke  Realty Corp. (NYSE: DRE) and its operating partnership Duke Realty Limited  Partnership (collectively Duke)  including the Issuer Default Rating (IDR)  to  'BBB+' from 'BBB'. The Rating Outlook is Stable. A full list of rating actions  follows at the end of this release. KEY RATING DRIVERS The upgraded ratings take into account Duke's achievement and commitment",
        "date": "10072016",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "Fitch Upgrades Duke Realty's IDR to 'BBB+'; Outlook Stable "
    },
    {
        "content": "DURHAM  N.C. -- Daniel Jones' college debut was a big success as the quarterback threw two touchdown passes and ran for a score as Duke demolished cross-city opponent North Carolina Central  49-6  on Saturday night at Wallace Wade Stadium.",
        "date": "09042016",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "Jones propels Duke to rout of North Carolina Central "
    },
    {
        "content": "* As of expiration time  $72 million aggregate principal amount of notes had been validly tendered and not validly withdrawn",
        "date": "06232016",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "BRIEF-Duke Realty announces results of tender offer for 5.95% senior notes due 2017 "
    },
    {
        "content": "* Duke Realty Corporation announces offering of $375 million of senior unsecured notes",
        "date": "06162016",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "BRIEF-Duke Realty says offering $375 mln of senior unsecured notes "
    },
    {
        "content": "* Duke realty commences tender offer for 5.95% senior notes due 2017",
        "date": "06162016",
        "name": "Duke Realty Corporation",
        "news_type": "normal",
        "symbol": "DRE",
        "title": "BRIEF-Duke Realty commences tender offer for 5.95 pct senior notes due 2017 "
    },
    {
        "content": "* Duke realty corp qtrly core funds from operations  per diluted share was $0.28",
        "date": "04272016",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "BRIEF-Duke Realty reports Q1 adjusted FFO per share $0.26 "
    },
    {
        "content": "CHAPEL HILL  N.C. -- Quarterback Marquise Williams passed for a school-record 494 yards and four touchdowns as North Carolina took another step toward a divisional title by whipping Duke 66-31 on Saturday at Kenan Stadium.",
        "date": "11072015",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "North Carolina 66  Duke 31 "
    },
    {
        "content": "Quarterback Thomas Sirk threw for 289 yards and two touchdowns in his starting debut  and DeVon Edwards returned a kickoff 95 yards for a touchdown as Duke opened the season by defeating Tulane 37-7 Thursday night in New Orleans.",
        "date": "09042015",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "Duke 37  Tulane 7 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  May 29 (Fitch) Fitch Ratings has affirmed its 'BBB' Issuer Default  Rating (IDR) for Duke Realty Corp. (NYSE: DRE) and its operating partnership  Duke Realty Limited Partnership (collectively Duke). A full list of Fitch's  ratings for Duke is available at the end of this release. The Rating Outlook is Stable. KEY RATING DRIVERS The ratings take into account Duke's large  high quality and diversified  portfolio of predominantly",
        "date": "05292015",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "Fitch Affirms Duke Realty Corp.'s IDR at 'BBB'; Outlook Stable "
    },
    {
        "content": "For No. 2 Duke  its first 13 games have resulted in 13 double-digit victories. However  Wednesday's game against Wake Forest will present the first ACC road contest for the Blue Devils' impressive group of freshmen. The leader of the bunch is Jahlil Okafor  who tops the nation in field-goal percentage (68.2) and averages team highs of 19.5 points and 8.7 rebounds.",
        "date": "01072015",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "Preview: Duke at Wake Forest "
    },
    {
        "content": "DURHAM  N.C. -- Maybe Duke's heralded freshmen can raise their performances for Atlantic Coast Conference games.",
        "date": "01032015",
        "name": "Duke Realty Corporation",
        "news_type": "topStory",
        "symbol": "DRE",
        "title": "Freshmen pace Duke in ACC opener "
    }
]