[
    {
        "content": "A federal judge in Florida has ruled that a Darden Restaurants Inc subsidiary wrongly destroyed emails  job applications and records of job interviews during an age bias investigation by the Equal Employment Opportunity Commission.",
        "date": "11032017",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "Judge sanctions Darden unit for spoiling evidence during EEOC probe "
    },
    {
        "content": "LOS ANGELES Olive Garden parent Darden Restaurants Inc  said on Tuesday it expects the negative effects on sales and earnings per share from Hurricane Irma to be about double that of Hurricane Harvey.",
        "date": "09262017",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "Darden expects business hit from Hurricane Irma to double Harvey's "
    },
    {
        "content": "LOS ANGELES  Sept 26 Olive Garden parent Darden Restaurants Inc said on Tuesday it expects the negative effects on sales and earnings per share from Hurricane Irma to be about double that of Hurricane Harvey.",
        "date": "09262017",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "UPDATE 2-Darden expects business hit from Hurricane Irma to double Harvey's "
    },
    {
        "content": "LOS ANGELES  Sept 26 Olive Garden parent Darden Restaurants Inc on Tuesday said it expects the hit to its sales and earnings per share from Hurricane Irma to be about double that of Hurricane Harvey.",
        "date": "09262017",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "Darden expects Hurricane Irma business hit to double Harvey's "
    },
    {
        "content": "* Darden Restaurants reports fiscal 2018 first quarter results and reaffirms financial outlook for the full fiscal year",
        "date": "09262017",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "BRIEF-Darden Restaurants reports Q1 adj EPS of $0.99 from continuing operations "
    },
    {
        "content": "* FCPT announces disposition of darden-leased restaurant property for $5.9 million",
        "date": "09132017",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "BRIEF-FCPT announces disposition of Darden-leased restaurant property for $5.9 mln "
    },
    {
        "content": "July 24 Department store operator J.C. Penney Co Inc named Jeffrey Davis as its chief financial officer  effective Monday.",
        "date": "07242017",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "J.C. Penney names former Darden CFO as finance chief "
    },
    {
        "content": "* Darden Restaurants reports fiscal 2017 fourth quarter and full year results; fourth quarter same-restaurant sales growth of 3.3%; and increases quarterly dividend 12.5%",
        "date": "06272017",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "BRIEF-Darden Restaurants reports Q4 same-restaurant sales growth of 3.3% "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  March 28 (Fitch) Fitch Ratings has affirmed the Long-Term Issuer  Default Rating (IDR) of Darden Restaurants  Inc. at 'BBB' and the Short-Term IDR  at 'F2' following the company's definitive agreement to acquire Cheddar's  Scratch Kitchen (Cheddar's) for $780 million. The Rating Outlook is Stable. A  full list of rating actions follows at the end of this release.  Cheddar's is a regional casual dining restaurant chain with 165 ",
        "date": "03282017",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "Fitch Affirms Darden's IDRS at 'BBB/F2'; Outlook Stable "
    },
    {
        "content": "Olive Garden owner Darden Restaurants Inc  said on  Monday it would buy Cheddar's Scratch Kitchen for $780 million in an all-cash transaction.",
        "date": "03272017",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "Darden Restaurants to buy Cheddar's Scratch Kitchen for $780 million "
    },
    {
        "content": "March 27 Olive Garden owner Darden Restaurants Inc said on  Monday it would buy Cheddar's Scratch Kitchen for $780 million in an all-cash transaction.",
        "date": "03272017",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "UPDATE 1-Darden Restaurants to buy Cheddar's Scratch Kitchen for $780 mln "
    },
    {
        "content": "* Darden restaurants reports fiscal 2017 third quarter results and increases earnings outlook for the full fiscal year",
        "date": "03272017",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "BRIEF-Darden Restaurants reports Q3 results "
    },
    {
        "content": "March 27 Olive Garden owner Darden Restaurants Inc said on  Monday it would buy Cheddar's Scratch Kitchen for $780 million in an all-cash transaction.",
        "date": "03272017",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "Darden Restaurants to buy Cheddar's Scratch Kitchen for $780 mln "
    },
    {
        "content": "* Board of directors has appointed Nana Mensah to company's board  effective immediately",
        "date": "11142016",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "BRIEF-Darden Restaurants announces new board member "
    },
    {
        "content": "Starboard Value LP's quarterly filing on Monday showed more companies in its portfolio under takeover pressure from other activist investors.",
        "date": "11142016",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "Starboard stock picks show rise in bets made by other activists "
    },
    {
        "content": "Nov 14 Starboard Value LP's quarterly filing on Monday showed more companies in its portfolio under takeover pressure from other activist investors.",
        "date": "11142016",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "UPDATE 2-Starboard stock picks show rise in bets made by other activists "
    },
    {
        "content": "* Darden Restaurants Inc files for shelf offering of debt securities; size not disclosed - SEC filing  Source text (http://bit.ly/2dvsDpJ) Further company coverage:",
        "date": "10062016",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "BRIEF-Darden Restaurants files for shelf offering of debt securities - SEC filing "
    },
    {
        "content": "* Proposal for Co to adopt policy to phase out non-therapeutic use of antibiotics in meat supply chain not approved at annual meeting  Source text for Eikon:  Further company coverage:    ;))",
        "date": "10042016",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "BRIEF-Proposal to phase out non-therapeutic use of antibiotics not approved at Darden annual meeting "
    },
    {
        "content": "* Darden Restaurants reports fiscal 2017 first quarter results; increases earnings outlook for the full fiscal year; and announces new share repurchase authorization",
        "date": "10042016",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "BRIEF-Darden Restaurants reports Q1 net EPS from cont ops of $0.88 "
    },
    {
        "content": "* Jean M. Birch resigned as a member of board of directors of Darden Restaurants Inc",
        "date": "09282016",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "BRIEF-Darden Restaurants says Jean Birch resigned as a member of board of directors "
    },
    {
        "content": "Darden Restaurants Inc  reported lower-than-expected quarterly sales as fewer customers visited its flagship Olive Garden restaurants  and shares tumbled as much as 5 percent.",
        "date": "06302016",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "Darden Restaurants quarterly sales disappoint  shares slide "
    },
    {
        "content": "June 30 Darden Restaurants Inc reported lower-than-expected quarterly sales as fewer customers visited its flagship Olive Garden restaurants  and shares tumbled as much as 5 percent.",
        "date": "06302016",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "UPDATE 2-Darden Restaurants quarterly sales disappoint  shares slide "
    },
    {
        "content": "June 30 Darden Restaurants Inc reported lower-than-expected quarterly sales as fewer customers visited its Olive Garden restaurants.",
        "date": "06302016",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "Olive Garden owner Darden's sales miss estimates "
    },
    {
        "content": "* Starboard Value Lp reports 4.8 pct stake in Darden Restaurants Inc as of May 20  2016;  Starboard had previously reported a 5.2 pct stake in co - SEC filing    Source text for Eikon:    Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05242016",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "BRIEF-Starboard Value cuts stake in Darden Restaurants to 4.8 pct from 5.2 pct "
    },
    {
        "content": "NEW YORK  May 19 U.S. authorities on Thursday charged a former chairman of Dean Foods Co and a professional Las Vegas gambler with engaging in an insider trading scheme that netted more than $40 million and included a tip that benefited professional golfer Phil Mickelson.",
        "date": "05202016",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "CORRECTED-UPDATE 5-Ex-Dean Foods chairman  gambler charged for insider trading; Mickelson settles "
    },
    {
        "content": "LOS ANGELES  May 12 Dozens of activist groups  emboldened by recent policy shifts at major U.S. restaurants  are demanding that Olive Garden owner Darden Restaurants Inc  change its food and labor practices.",
        "date": "05122016",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "Activists call on Darden to limit antibiotics  boost worker pay "
    },
    {
        "content": "April 27 Yahoo Inc on Wednesday agreed to add four new independent directors to its board  bowing to pressure from activist hedge fund Starboard Value LP and averting a proxy fight ahead of its upcoming annual meeting.",
        "date": "04272016",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "UPDATE 4-Yahoo to add four directors to board in deal with Starboard "
    },
    {
        "content": "April 5 Darden Restaurants Inc  owner of the Olive Garden chain    said Chairman Jeffrey Smith  head of activist investor Starboard Value LP  has resigned from the company's board.",
        "date": "04052016",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "Starboard's Jeff Smith resigns as Darden chairman "
    },
    {
        "content": "* Shares down 3.4 pct   (Adds analysts comments  details; updates shares)",
        "date": "04052016",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "UPDATE 2-Starboard's Jeff Smith resigns as Darden chairman "
    },
    {
        "content": "* Board approved new compensation arrangements for Ricardo Cardenas  senior vice president and chief financial officer",
        "date": "04052016",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "BRIEF-Darden Restaurants says board approved new compensation arrangements for CFO Ricardo Cardenas "
    },
    {
        "content": "* Darden announces resignation of Jeffrey Smith from board of directors; Charles Sonsteby elected chairman",
        "date": "04052016",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "BRIEF-Darden Restaurant says Jeffrey Smith to resign from board of directors "
    },
    {
        "content": "* Sets regular quarterly cash dividend of $0.50per share    Source text for Eikon:    Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "03312016",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "BRIEF-Darden Restaurants sets quarterly cash dividend of $0.50 per share "
    },
    {
        "content": "March 22 Macy's Inc appointed William Lenehan  an expert in real estate investments  to its board amid investor pressure to monetize its real estate assets.",
        "date": "03222016",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "Macy's appoints real estate expert to board "
    },
    {
        "content": "NEW YORK Early in August  a call came into Sysco Corp from Trian Fund Management LP  warning the food distributor that the activist hedge fund was about to disclose a large stake in the company.",
        "date": "09252015",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "US companies quicker to give board seats to activists "
    },
    {
        "content": "NEW YORK  Sept 25 Early in August  a call came into Sysco Corp from Trian Fund Management LP  warning the food distributor that the activist hedge fund was about to disclose a large stake in the company.",
        "date": "09252015",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "RPT - INSIGHT-US companies quicker to give board seats to activists "
    },
    {
        "content": "Sept 22 Darden Restaurants Inc reported quarterly profit that topped Wall Street estimates as menu changes and improved service at its Olive Garden restaurants helped lure more diners through its doors.",
        "date": "09222015",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "UPDATE 2-Darden sales  profit beat as Olive Garden revamp pays off "
    },
    {
        "content": "NEW YORK  Sept 25 Early in August  a call came into Sysco Corp from Trian Fund Management LP  warning the food distributor that the activist hedge fund was about to disclose a large stake in the company.",
        "date": "09252015",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "INSIGHT-US companies quicker to give board seats to activists "
    },
    {
        "content": "Sept 22 Darden Restaurants Inc's sales rose for the sixth straight quarter as changes to the menu at its Olive Garden restaurants attracted more customers.",
        "date": "09222015",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "Olive Garden owner Darden's sales rise for 6th straight qtr "
    },
    {
        "content": "NEW YORK Darden Restaurant Inc's plans unveiled this week to spin off some of its holdings into a real estate investment trust points to a gold mine others can tap  but a recent statement by the U.S. tax authority raises cautionary flags.",
        "date": "06252015",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "Darden's REIT play offers path to gold  but beware IRS "
    },
    {
        "content": "Darden Restaurants Inc  said it plans to separate some of its restaurants into a publicly traded real estate investment trust as part of changes engineered by activist investor Starboard Value LP. | Video ",
        "date": "06232015",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "Olive Garden owner Darden to spin off some restaurants into REIT "
    },
    {
        "content": "June 23 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "06232015",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Shares hit record high of $73.40   (Adds details from conference call  updates shares)",
        "date": "06232015",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "UPDATE 2-Olive Garden owner Darden to spin off some restaurants into REIT "
    },
    {
        "content": "June 23 Darden Restaurants Inc said it intends to separate part of its real estate assets into a real estate investment trust (REIT) as part of a plan to pay down about $1 billion of debt.",
        "date": "06232015",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "Olive Garden owner Darden to set up REIT to pay down debt "
    },
    {
        "content": "BOSTON  May 22 Barington Capital Group won its proxy contest by scoring two board seats at Eastern Co  this week as shareholders widely backed the activist hedge fund's call to add new blood at the industrial hardware maker.",
        "date": "05222015",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "Hedge fund Barington wins fight for 2 Eastern Co board seats "
    },
    {
        "content": "* Sarvary  2 directors to tender resignation as board members",
        "date": "05082015",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "UPDATE 2-Tempur Sealy shareholders vote to remove CEO  chairman from board "
    },
    {
        "content": "March 20 Darden Restaurants Inc said on Friday it was seeking to  \"create value\" from its real estate  as management installed after last year's activist investor-led coup reported continued traffic declines at its flagship Olive Garden chain.",
        "date": "03202015",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "UPDATE 4-Darden seeks property deals  Olive Garden turnaround "
    },
    {
        "content": "March 20 Darden Restaurants Inc said on Friday it was looking for ways to \"create value\" from its real estate  as management installed after last year's activist investor-led coup reported continued traffic declines at its flagship Olive Garden chain.",
        "date": "03202015",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "CORRECTED-UPDATE 3-Darden seeks property deals  Olive Garden turnaround "
    },
    {
        "content": "LOS ANGELES  March 20 * Darden Restaurants Inc  exploring options for real estate  including sale and leaseback deals * Darden says has secured letters of intent or contracts on the majority of 31 listed properties at cap rates well below 6 percent * Darden has listed its Orlando  Florida  headquarters  options include sale and leaseback * Darden says real estate proceeds will be used to repay debt and improve credit profile * Darden says has identified $90-$100 mln of potential cost",
        "date": "03202015",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "BRIEF-Olive Garden parent Darden says exploring all real estate options "
    },
    {
        "content": "Darden Restaurants Inc  the parent of Olive Garden and LongHorn Steakhouse chains  said interim Chief Executive Eugene Lee would take over the job permanently  effective immediately.",
        "date": "02232015",
        "name": "Darden Restaurants Inc",
        "news_type": "topStory",
        "symbol": "DRI",
        "title": "Darden interim CEO Eugene Lee to take over top job "
    },
    {
        "content": "Feb 23 Darden Restaurants Inc  the parent of Olive Garden and LongHorn Steakhouse chains  said interim Chief Executive Eugene Lee would take over the job permanently  effective immediately.",
        "date": "02232015",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "UPDATE 1-Darden interim CEO Eugene Lee to take over top job "
    },
    {
        "content": "Feb 23 Darden Restaurants Inc  the parent of Olive Garden and LongHorn Steakhouse chains  said interim Chief Executive Eugene Lee would take over the job permanently  effective immediately.",
        "date": "02232015",
        "name": "Darden Restaurants Inc",
        "news_type": "normal",
        "symbol": "DRI",
        "title": "Darden Restaurants names Eugene Lee as CEO "
    }
]