[
    {
        "content": "* Dell Technologies says ‍to invest $1 billion in IOT research and development over next three years​",
        "date": "10102017",
        "name": "Dell Technologies Inc",
        "news_type": "topStory",
        "symbol": "DVMT",
        "title": "BRIEF-Dell Technologies ‍to invest $1 bln in Iot R&D over next 3 years​ "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  September 19 (Fitch) Fitch Ratings believes the ratings for Dell Technologies Inc.  including the 'BB+' Long-Term Issuer Default Rating (IDR) and Stable Outlook  will be unaffected by the company's repricing of certain of its outstanding term loans and revolving credit facility (RCF). Dell is proposing a 25-bp margin reduction on up to $3.78 billion of replacement Term Loan A-2 due Sept. 7  2021  $1.80 billion of replacement Te",
        "date": "09192017",
        "name": "Dell Technologies Inc",
        "news_type": "topStory",
        "symbol": "DVMT",
        "title": "Fitch: Dell Technologies' Ratings Unaffected by Credit Facility Repricing "
    },
    {
        "content": "* Under agreement  Dell becomes primary it infrastructure supplier for GE",
        "date": "09072017",
        "name": "Dell Technologies Inc",
        "news_type": "topStory",
        "symbol": "DVMT",
        "title": "BRIEF-Dell Technologies announces multi-year agreement with GE "
    },
    {
        "content": "* Dell Technologies reports fiscal year 2018 second quarter financial results",
        "date": "09072017",
        "name": "Dell Technologies Inc",
        "news_type": "normal",
        "symbol": "DVMT",
        "title": "BRIEF-Dell Technologies reports Q2 EPS from continuing operations of 82 cents "
    },
    {
        "content": "* ‍Dell Technologies Inc​ - on Aug 23  co and its affiliates entered into purchase commitment supplement to stock purchase agreement with VMWare - SEC filing",
        "date": "08242017",
        "name": "Dell Technologies Inc",
        "news_type": "topStory",
        "symbol": "DVMT",
        "title": "BRIEF-‍Dell Technologies says co and its affiliates entered into purchase commitment supplement to stock purchase agreement with VMWare "
    },
    {
        "content": "* Salesforce announces strategic agreement with dell technologies Source text for Eikon: Further company coverage:",
        "date": "05242017",
        "name": "Dell Technologies Inc",
        "news_type": "topStory",
        "symbol": "DVMT",
        "title": "BRIEF-Salesforce signs strategic agreement with Dell Technologies "
    },
    {
        "content": "SAN FRANCISCO  May 8 Dell Technologies Inc said on Monday it has combined the venture capital operations from its two predecessor companies  computer maker Dell Inc and data storage firm EMC Corp  and said it plans to invest about $100 million a year in startups.",
        "date": "05082017",
        "name": "Dell Technologies Inc",
        "news_type": "normal",
        "symbol": "DVMT",
        "title": "Dell combines venture capital units after EMC merger "
    },
    {
        "content": "April 27 Microsoft Corp's lineup of Surface tablets  laptops and desktop computers has always been a paradox.",
        "date": "04282017",
        "name": "Dell Technologies Inc",
        "news_type": "normal",
        "symbol": "DVMT",
        "title": "Microsoft's silver lining: Surface loses  but Windows wins "
    },
    {
        "content": "* VMware-On April 7 Dell technologies  controlling stockholder of co provided approval of its unit EMC Corp to proposed acquisition by VMware of Wavefront Source text:(http://bit.ly/2o7skk8) Further company coverage:",
        "date": "04122017",
        "name": "Dell Technologies Inc",
        "news_type": "topStory",
        "symbol": "DVMT",
        "title": "BRIEF-Dell  stockholder of co provided approval of its unit EMC Corp to proposed acquisition by VMware of Wavefront "
    },
    {
        "content": "* VMware announces $300 million stock purchase agreement with Dell",
        "date": "03302017",
        "name": "Dell Technologies Inc",
        "news_type": "topStory",
        "symbol": "DVMT",
        "title": "BRIEF-VMware announces $300 mln stock purchase agreement with Dell "
    },
    {
        "content": "* Dell technologies reports fiscal year 2017 fourth quarter and full year financial results",
        "date": "03302017",
        "name": "Dell Technologies Inc",
        "news_type": "normal",
        "symbol": "DVMT",
        "title": "BRIEF-Dell Technologies approves amendment to class V group repurchase program "
    },
    {
        "content": "* On March 8  credit parties entered refinancing amendment to refinance original term b facility  with new term loan B facility",
        "date": "03092017",
        "name": "Dell Technologies Inc",
        "news_type": "topStory",
        "symbol": "DVMT",
        "title": "BRIEF-Dell Technologies and credit parties enters refinancing amendment "
    },
    {
        "content": "* Dell Technologies - CEO Michael Dell reports open market purchase of 14 807 shares of co's common stock at average price of $28.84 per share on Jan 19 - filing  Source text: (http://bit.ly/2jjqsFM) Further company coverage:",
        "date": "01232017",
        "name": "Dell Technologies Inc",
        "news_type": "topStory",
        "symbol": "DVMT",
        "title": "BRIEF-Dell CEO reports purchase of 14 807 shares of co's common stock "
    },
    {
        "content": "Amit Yoran is stepping down as president of Dell Technologies Inc's  cyber security unit to run Tenable Network Security Inc  a well-financed private cyber security company that is looking to boost revenue growth.",
        "date": "12152016",
        "name": "Dell Technologies Inc",
        "news_type": "topStory",
        "symbol": "DVMT",
        "title": "Amit Yoran leaves Dell RSA unit to head Tenable Network Security "
    },
    {
        "content": "NEW YORK Dan Loeb's Third Point hedge fund took a new share stake in Apple Inc  Visa Inc and Dell Technologies Inc during the third quarter  according to regulatory filings late on Thursday.",
        "date": "11102016",
        "name": "Dell Technologies Inc",
        "news_type": "topStory",
        "symbol": "DVMT",
        "title": "Loeb's Third Point takes share stake in Apple  Visa and Dell "
    },
    {
        "content": "NEW YORK  Nov 10 Dan Loeb's Third Point hedge fund took a new share stake in Apple Inc  Visa Inc  and Dell Technologies Inc during the third quarter  according to regulatory filings late on Thursday.",
        "date": "11102016",
        "name": "Dell Technologies Inc",
        "news_type": "normal",
        "symbol": "DVMT",
        "title": "CORRECTED-Loeb's Third Point takes share stake in Apple  Visa and Dell "
    },
    {
        "content": "NEW YORK  Nov 10 Dan Loeb's Third Point hedge fund took new share stakes in Apple Inc  Visa Inc  and Dell Technologies Inc during the third quarter  according to regulatory filings late on Thursday.",
        "date": "11102016",
        "name": "Dell Technologies Inc",
        "news_type": "normal",
        "symbol": "DVMT",
        "title": "UPDATE 1-Loeb's Third Point takes share stakes in Apple  Visa and Dell "
    },
    {
        "content": "* Takes 2.3 mln shares stake in Dell Technologies - SEC filing",
        "date": "11102016",
        "name": "Dell Technologies Inc",
        "news_type": "normal",
        "symbol": "DVMT",
        "title": "BRIEF-Third Point LLC takes stake in Visa  Dell Technologies - SEC filing "
    }
]