[
    {
        "content": "* Dowdupont declares quarterly dividend of 38 cents per share  announces initial $4 billion share repurchase program",
        "date": "11022017",
        "name": "DowDuPont Inc",
        "news_type": "topStory",
        "symbol": "DWDP",
        "title": "BRIEF-Dowdupont declares quarterly dividend of 38 cents per share  announces initial $4 billion share repurchase program "
    },
    {
        "content": "* Dupont - for restructuring actions under Dowdupont cost synergy program  Dupont expects to record pre-tax restructuring charges of about $850 million Source text: (http://bit.ly/2z7cMnv) Further company coverage:",
        "date": "11022017",
        "name": "DowDuPont Inc",
        "news_type": "normal",
        "symbol": "DWDP",
        "title": "BRIEF-Dupont says for restructuring actions under Dowdupont cost synergy program  Dupont expects to record pre-tax restructuring charges of about $850 mln "
    },
    {
        "content": "* Dowdupont- sees fy agriculture pro forma sales to increase low-single-digits percent due to new product introductions resulting in price  volume gains‍​",
        "date": "11022017",
        "name": "DowDuPont Inc",
        "news_type": "normal",
        "symbol": "DWDP",
        "title": "BRIEF-Dowdupont sees Q4 net sales of $19 bln-$19.5 bln vs q4 2016 "
    },
    {
        "content": "* DowDuPont - Total pretax restructuring charges to be recorded include about $875 million-$975 million severance and related benefits costs  among others",
        "date": "11022017",
        "name": "DowDuPont Inc",
        "news_type": "normal",
        "symbol": "DWDP",
        "title": "BRIEF-DowDuPont total pretax restructuring charges to be recorded include about $875 mln to $975 mln severance and related benefits costs "
    },
    {
        "content": "* Q3 earnings per share view $0.42 -- Thomson Reuters I/B/E/S",
        "date": "11022017",
        "name": "DowDuPont Inc",
        "news_type": "normal",
        "symbol": "DWDP",
        "title": "BRIEF-DowDuPont says Q3 GAAP earnings per share $0.32 "
    },
    {
        "content": "Oct 30 LyondellBasell Industries NV has approached Brazil's Braskem SA  for a potential takeover  valuing the petrochemicals company at more than $10 billion  the Wall Street Journal reported on Monday.",
        "date": "10302017",
        "name": "DowDuPont Inc",
        "news_type": "normal",
        "symbol": "DWDP",
        "title": "UPDATE 1-LyondellBasell approaches Brazil's Braskem for takeover-WSJ "
    },
    {
        "content": "DowDuPont   formed by the merger of chemical giants Dow Chemical and DuPont  revealed third-quarter profit estimates on Thursday that were much higher than Wall Street's expectations ahead of the combined company's first earnings report next week.",
        "date": "10262017",
        "name": "DowDuPont Inc",
        "news_type": "topStory",
        "symbol": "DWDP",
        "title": "DowDuPont set to beat quarterly estimates as new company "
    },
    {
        "content": "Oct 26 DowDuPont  formed by the merger of chemical giants Dow Chemical and DuPont  revealed third-quarter profit estimates on Thursday that were much higher than Wall Street's expectations ahead of the combined company's first earnings report next week.",
        "date": "10262017",
        "name": "DowDuPont Inc",
        "news_type": "normal",
        "symbol": "DWDP",
        "title": "UPDATE 3-DowDuPont set to beat quarterly estimates as new company "
    },
    {
        "content": "* Dowdupont provides expected third quarter 2017 financial results  files historical pro forma financial statements",
        "date": "10262017",
        "name": "DowDuPont Inc",
        "news_type": "normal",
        "symbol": "DWDP",
        "title": "BRIEF-Dowdupont says sees Q3 ‍pro forma adjusted earnings per share of $0.55 "
    },
    {
        "content": "Oct 26 DowDuPont  formed through the merger of chemical giants Dow Chemical and DuPont  said it expects third-quarter net sales of $15.4 billion when it reports results as a new company next week.",
        "date": "10262017",
        "name": "DowDuPont Inc",
        "news_type": "normal",
        "symbol": "DWDP",
        "title": "DowDuPont sees Q3 earnings  sales rise as new company "
    },
    {
        "content": "DowDuPont  formed through the merger of chemical giants Dow Chemical and DuPont  is shifting some operations in the three units it plans to create  potentially averting a prolonged fight with activist investors over its post-merger plans. | Video ",
        "date": "09122017",
        "name": "DowDuPont Inc",
        "news_type": "topStory",
        "symbol": "DWDP",
        "title": "DowDuPont alters post-merger breakup plans amid investor pressure "
    },
    {
        "content": "Sept 12 DowDuPont  formed through the merger of chemical giants Dow Chemical and DuPont  is shifting some operations in the three units it plans to create  potentially averting a prolonged fight with activist investors over its post-merger plans.",
        "date": "09122017",
        "name": "DowDuPont Inc",
        "news_type": "normal",
        "symbol": "DWDP",
        "title": "UPDATE 4-DowDuPont alters post-merger breakup plans amid investor pressure "
    },
    {
        "content": "* Glenview Capital Management supports improvements in DowDupont spin-off plans",
        "date": "09122017",
        "name": "DowDuPont Inc",
        "news_type": "normal",
        "symbol": "DWDP",
        "title": "BRIEF-Glenview Capital supports improvements in DowDupont spin-off plans "
    },
    {
        "content": "* DowDuPont announces results of comprehensive portfolio review",
        "date": "09122017",
        "name": "DowDuPont Inc",
        "news_type": "normal",
        "symbol": "DWDP",
        "title": "BRIEF-DowDuPont announces results of comprehensive portfolio review "
    },
    {
        "content": "Sept 12 DowDuPont  which was formed when chemical giants Dow Chemical and DuPont merged  is making changes to its initial plans of splitting the company into three units  the company said on Tuesday.",
        "date": "09122017",
        "name": "DowDuPont Inc",
        "news_type": "normal",
        "symbol": "DWDP",
        "title": "DowDuPont alters post-merger breakup plan "
    }
]