[
    {
        "content": "* DXC Technology delivers strong second quarter results with growth in earnings per share  margins  and cash flow",
        "date": "11072017",
        "name": "DXC Technology Company",
        "news_type": "topStory",
        "symbol": "DXC",
        "title": "BRIEF-DXC Technology Q2 earnings per share $0.88 "
    },
    {
        "content": "* Termination fee of $50 million may be payable by DXC to Vencore & Keypoint upon termination of merger agreement  under some conditions​ Source text: (http://bit.ly/2gDhv8E) Further company coverage:",
        "date": "10132017",
        "name": "DXC Technology Company",
        "news_type": "topStory",
        "symbol": "DXC",
        "title": "BRIEF-DXC Technology says $50 mln may be payable to Vencore  KeyPoint if deal terminates  under some conditions​ "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  October 13 (Fitch) According to Fitch Ratings  DXC Technology Company's (DXC) 'BBB+' Long-Term Issuer Default Rating (IDR) and senior unsecured ratings are presently unaffected by the company's plans to spin off its public sector business. DXC announced it plans to combine its U.S. Public Sector (USPS) business with Vencore Holding Corporation and KeyPoint Government Solutions to form a separate  independent publically traded ",
        "date": "10132017",
        "name": "DXC Technology Company",
        "news_type": "normal",
        "symbol": "DXC",
        "title": "Fitch: DXC Technology's Ratings Presently Unaffected by Public Sector Business Spinoff "
    },
    {
        "content": "* Says ‍discontinuation of joint venture arrangement with DXC Technology​",
        "date": "10132017",
        "name": "DXC Technology Company",
        "news_type": "normal",
        "symbol": "DXC",
        "title": "BRIEF-HCL Technologies announces IP partnership with DXC Technology "
    },
    {
        "content": "* DXC Technology to combine its U.S. public sector business with Vencore Holding Corporation and Keypoint Government Solutions to create an independent  publicly traded company serving U.S. government clients",
        "date": "10112017",
        "name": "DXC Technology Company",
        "news_type": "topStory",
        "symbol": "DXC",
        "title": "BRIEF-DXC Technology to create independent U.S. public sector business "
    },
    {
        "content": "* DXC Technology Co- on September 26  2017  co received commitments to extend the maturity date  of the co’s existing revolving credit agreement",
        "date": "10022017",
        "name": "DXC Technology Company",
        "news_type": "topStory",
        "symbol": "DXC",
        "title": "BRIEF-DXC Technology Co - on Sep 26 co received commitments to extend maturity date of  existing revolving credit agreement "
    },
    {
        "content": "* DXC Technology announces service offerings for Microsoft Azure to enable digital transformation in a hybrid cloud environment",
        "date": "09272017",
        "name": "DXC Technology Company",
        "news_type": "topStory",
        "symbol": "DXC",
        "title": "BRIEF-DXC Technology announces service offerings for Microsoft Azure "
    },
    {
        "content": "* DXC Technology Co -  On September 14  unit entered into a term loan credit agreement in an aggregate principal amount of €400 million - SEC Filing",
        "date": "09182017",
        "name": "DXC Technology Company",
        "news_type": "topStory",
        "symbol": "DXC",
        "title": "BRIEF-DXC Technology Co says unit entered into a term loan credit agreement in an aggregate principal amount of €400 mln - SEC Filing "
    },
    {
        "content": "Sept 5 Hewlett Packard Enterprise Co reported a surprise rise in quarterly revenue  largely helped by higher sales of its networking equipment  sending its shares up more than 4 percent in extended trading on Tuesday.",
        "date": "09052017",
        "name": "DXC Technology Company",
        "news_type": "normal",
        "symbol": "DXC",
        "title": "UPDATE 2-HP Enterprise posts surprise revenue rise on networking demand "
    },
    {
        "content": "Sept 5 Hewlett Packard Enterprise Co reported a 2.5 percent rise in quarterly revenue on Tuesday  helped by strong growth in the company's enterprises and financial services businesses.",
        "date": "09052017",
        "name": "DXC Technology Company",
        "news_type": "normal",
        "symbol": "DXC",
        "title": "HP Enterprise's quarterly revenue rises 2.5 pct "
    },
    {
        "content": "* DXC Technology-‍pricing of offering of $650 million of its senior floating rate notes due 2021   priced at 100% of aggregate principal amount​",
        "date": "08142017",
        "name": "DXC Technology Company",
        "news_type": "topStory",
        "symbol": "DXC",
        "title": "BRIEF-DXC Technology prices senior floating rates notes offering "
    },
    {
        "content": "* DXC Technology files for potential debt shelf offering; size undisclosed - SEC filing‍​ Source text -  (http://bit.ly/2wY7E2N) Further company coverage:",
        "date": "08142017",
        "name": "DXC Technology Company",
        "news_type": "normal",
        "symbol": "DXC",
        "title": "BRIEF-DXC Technology files for potential debt shelf offering size undisclosed - SEC filing‍​ "
    },
    {
        "content": "* Dxc technology acquires tribridge to solidify its position as a leading systems integrator for microsoft dynamics 365",
        "date": "07052017",
        "name": "DXC Technology Company",
        "news_type": "topStory",
        "symbol": "DXC",
        "title": "BRIEF-DXC Technology acquires Tribridge "
    },
    {
        "content": "* DXC Technology and Mphasis collaborate to accelerate application transformation and modernization solutions for enterprise clients Source text for Eikon: Further company coverage:",
        "date": "05252017",
        "name": "DXC Technology Company",
        "news_type": "topStory",
        "symbol": "DXC",
        "title": "BRIEF-DXC Technology and Mphasis collaborate to accelerate application transformation "
    },
    {
        "content": "* Dxc technology and at&t to deliver new services to businesses globally",
        "date": "05232017",
        "name": "DXC Technology Company",
        "news_type": "topStory",
        "symbol": "DXC",
        "title": "BRIEF-DXC Technology  AT&T to deliver new services to businesses globally "
    },
    {
        "content": "* Says parent company Everett SpinCo  Inc. merged with Computer Sciences Corporation  and changed name to DXC Technology Company on April 3",
        "date": "04102017",
        "name": "DXC Technology Company",
        "news_type": "topStory",
        "symbol": "DXC",
        "title": "BRIEF-Japan Systems says change of parent company "
    },
    {
        "content": "* DXC Technology - On April 3  2017  DXC  incremental lenders providing such incremental commitments exercised an option under revolving credit agreement",
        "date": "04062017",
        "name": "DXC Technology Company",
        "news_type": "topStory",
        "symbol": "DXC",
        "title": "BRIEF-DXC Technology says incremental lenders providing such incremental commitments exercised an option under revolving credit agreement "
    }
]