[
    {
        "content": "ROME Italy's Treasury has sent a letter to Cassa Depositi e Prestiti (CDP) to formally start the sale to the state lender of stakes in air traffic controller ENAV  and energy group ENI   a source with knowledge of the matter said on Thursday.",
        "date": "11162017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Italy Treasury kicks off sale of stakes in ENAV  Eni with letter to CDP: source "
    },
    {
        "content": "MILAN  Nov 14 Italian energy firm Eni signed a deal on Tuesday to explore an area off the southern coast of Oman for oil and gas and inked an agreement for Qatar Petroleum (QP) to take a stake in the block.",
        "date": "11142017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni signs Oman oil and gas exploration deal  Qatari firm to take stake "
    },
    {
        "content": "ROME  Nov 6 Italy's Treasury is in talks over selling its stake in oil firm Eni to state lender Cassa Depositi e Prestiti (CDP) as part of a bid to cut the country's sky-high public debt  a source familiar with the matter said on Monday.",
        "date": "11062017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Italy's Treasury in talks to sell stake in oil major Eni to state lender CDP - source "
    },
    {
        "content": "MILAN  Oct 31 An Italian judge is expected to decide on December 20 whether to send oil majors Eni and Shell to trial over alleged corruption in Nigeria  two legal sources said on Tuesday.",
        "date": "10312017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "CORRECTED-UPDATE 1-Italy judge expected to rule on Eni  Shell indictment over Nigeria on Dec. 20 - source "
    },
    {
        "content": "MILAN  Oct 27 Italian oil major Eni could sell stakes in its oil and gas fields in Mexico and Indonesia in the next stage of its asset sale strategy  the company said on Friday.",
        "date": "10272017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "REFILE-UPDATE 2-Mexico and Indonesia could be next up for Eni's asset sales "
    },
    {
        "content": "VERONA  Italy  Oct 19 Italian oil and gas group Eni is keen to strengthen ties with Russia's Rosneft and could forge a partnership in the liquefied natural gas (LNG) sector  its chairwoman said on Thursday.",
        "date": "10192017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni looks to strengthen ties with Rosneft  maybe in LNG "
    },
    {
        "content": "LONDON Total   Eni  and Statoil  are seeking buyers for their stake in the Teesside oil terminal in northern England  which receives crude from the Norwegian Ekofisk fields  part of the global Brent benchmark  banking sources said.",
        "date": "10092017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Total  Eni  Statoil seek buyers for North Sea Teesside terminal: sources "
    },
    {
        "content": "LONDON  Oct 9 Total  Eni and Statoil are seeking buyers for their stake in the Teesside oil terminal in northern England  which receives crude from the Norwegian Ekofisk fields  part of the global Brent benchmark  banking sources said.",
        "date": "10092017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Total  Eni  Statoil seek buyers for N. Sea Teesside terminal -sources "
    },
    {
        "content": "MILAN Italian oil major Eni  is betting billions on Luca Bertelli being able to achieve something he's been doing since he was nine years old: spotting things others overlook.",
        "date": "10062017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni bets big on Zohr explorer finding new treasure "
    },
    {
        "content": "* Statoil and Eni have awarded bristow contract for one SAR helicopter  and one transport helicopter in Hammerfest",
        "date": "09182017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "BRIEF-Statoil and Eni award Hammerfest helicopter contract to Bristow "
    },
    {
        "content": "MILAN Eni  signed a cooperation agreement with China National Petroleum Corporation (CNPC) on Wednesday in a move that could give the Italian oil major greater access to the Chinese market.",
        "date": "09132017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni inks cooperation deal with China's CNPC "
    },
    {
        "content": "MILAN  Sept 13 Eni signed a cooperation agreement with China National Petroleum Corporation (CNPC) on Wednesday in a move that could give the Italian oil major greater access to the Chinese market.",
        "date": "09132017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 1-Eni inks cooperation deal with China's CNPC "
    },
    {
        "content": "ASTANA Kazakhstan wants oil majors led by Shell and ENI to improve their offer for ending a dispute over profit sharing in the Karachaganak gas project  Kazakh Energy Minister Kanat Bozumbayev said on Friday.",
        "date": "09082017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Kazakhstan seeks better offer from oil majors to end Karachaganak gas row "
    },
    {
        "content": "The following factors could affect Italian markets on Monday.",
        "date": "09082017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Italy - Factors to watch on Sept. 8 "
    },
    {
        "content": "MAPUTO  Aug 29 Mozambique will charge Italian energy company ENI $350 million in capital gains tax for its sale of a stake in the Coral South natural gas field to ExxonMobil  the nation's finance minister said on local television on Tuesday.",
        "date": "08292017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Mozambique sets sights on capital gains tax from ENI  Exxon deal "
    },
    {
        "content": "* 2017 interim dividend of 0.4 euros (Recasts lead  adds CEO comments  analyst)",
        "date": "07282017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 2-Italy's Eni confident of dividend even with lower oil prices "
    },
    {
        "content": "* Industry concerned about wide-ranging impact (Quotes from EU document  details of Commissioner's meeting)",
        "date": "07262017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 3-EU warns U.S. it may respond swiftly to counter new sanctions on Russia "
    },
    {
        "content": "ROME Energy markets might need to be regulated to put a brake on widespread financial speculation that is distorting crude prices  the head of Italian oil major Eni told Il Sole 24 Ore newspaper.",
        "date": "07232017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Oil markets need regulator in face of speculators: Eni CEO "
    },
    {
        "content": "ACCRA Italian oil company ENI started oil production from the 45 000 barrel-per-day Sankofa field offshore Ghana on Thursday  giving a boost to the West African country's plans to use its oil resources to revive its economy.",
        "date": "07062017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "ENI pumps first oil from Ghana's Sankofa field "
    },
    {
        "content": "* Sankofa is Ghana's 3rd major field since oil startup in 2010 (Adds president's comments  context)",
        "date": "07062017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 2-ENI pumps first oil from Ghana's Sankofa field "
    },
    {
        "content": "LONDON  July 6 Urals crude differentials were unchanged on Thursday after rising to a two year high earlier in the week due to strong refinery margins  clearing Urals cargoes and a general shortage of sour barrels following OPEC production cuts. * Traders said Vitol offered to sell a July 25-29 Urals cargo in the Baltic at dated Brent minus 65 cents a barrel  but found no buyers in the Platts window as the asking price was seen as too strong. * Eni bid for a Urals Aframax cargo in th",
        "date": "07062017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Med Crude-Urals sticks near two-year highs on sour crude shortage  strong margins "
    },
    {
        "content": "* General Electric- signs agreements with Kazakhstan Railways on digital cooperation and with Eni SpA on partnering on renewable energy in Kazakhstan Source text: (http://bit.ly/2sA2p8x) Further company coverage:",
        "date": "06212017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "BRIEF-GE signs agreements with Kazakhstan Railways  Eni SpA "
    },
    {
        "content": "LONDON/MILAN Italian oil major Eni signed an agreement with Iran on Tuesday for feasibility studies to develop an oil field and a gas field  signaling a possible return to Iran's upstream sector.",
        "date": "06202017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Italy's Eni signs deal with Iran on oil and gas field studies "
    },
    {
        "content": "MEXICO CITY  June 19 A consortium comprising Italy's Eni and Citla Energy made the winning bid for the 14th shallow water oil and gas block put up for auction on Monday  Mexico's oil regulator said.",
        "date": "06192017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Eni and Citla win block in Mexican shallow water oil auction "
    },
    {
        "content": "LONDON/MILAN  June 20 Italian oil major Eni signed an agreement with Iran on Tuesday for feasibility studies to develop an oil field and a gas field  signalling a possible return to Iran's upstream sector.",
        "date": "06202017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 1-Italy's Eni signs deal with Iran on oil and gas field studies "
    },
    {
        "content": "MEXICO CITY  June 19 Mexico on Monday auctioned two-thirds of the shallow water oil and gas blocks up for grabs in the latest round of its energy market opening  surpassing the cautious estimates officials made last week.",
        "date": "06192017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 2-Mexico auctions two-thirds of blocks in shallow water oil tender "
    },
    {
        "content": "The following factors could affect Italian markets on Tuesday.",
        "date": "06202017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Italy - Factors to watch on June 20 "
    },
    {
        "content": "MEXICO CITY  June 19 Italy's Eni made the winning bid for the tenth shallow water oil and gas block put up for auction on Monday  Mexico's oil regulator said.",
        "date": "06192017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Eni wins block in Mexico shallow water oil auction "
    },
    {
        "content": "MEXICO CITY  June 19 A consortium comprising Italy's Eni  Capricorn Energy Ltd and Citla Energy have won the seventh block in a shallow water oil and gas auction on Monday  the Mexican oil regulator said.",
        "date": "06192017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Eni-led consortium wins block in Mexico shallow water oil auction "
    },
    {
        "content": "ACCRA  June 9 Italy's ENI will start commercial oil and gas production at its Sankofa field off the coast of Ghana in July  three months ahead of schedule  project partners said on Friday.",
        "date": "06092017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "ENI says to open Ghana oil and gas field three months early "
    },
    {
        "content": "OSLO About 150 oil platform workers would go on strike  potentially disrupting output from several Norwegian fields  if they fail to get a pay deal by midnight on Friday  their union said on Tuesday.",
        "date": "06062017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Norwegian union threatens strike at Statoil  Shell  Eni platforms "
    },
    {
        "content": "LONDON  June 5 Oil majors BP and Eni are deepening their foray into blockchain technology  starting to run blockchain trades in parallel with their live trading systems  according to developer BTL Group.",
        "date": "06052017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "BP  Eni deepen blockchain trading in European gas "
    },
    {
        "content": "MAPUTO Italian energy company Eni signed an $8 billion deal on Thursday to develop a gas field off the coast of Mozambique  the first of a series of projects that could transform the poor African nation into a major energy supplier to Asia.",
        "date": "06012017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Italy's Eni signs LNG deal in Mozambique  raising hopes of gas boom "
    },
    {
        "content": "* Mozambique well positioned to supply Asia (Adds value of the project in paragraph 3)",
        "date": "06012017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 2-Italy's Eni signs LNG deal in Mozambique  raising hopes of gas boom "
    },
    {
        "content": "MAPUTO  June 1 Italian energy company Eni signed a deal on Thursday to develop a huge gas field offshore Mozambique  the first of a series of projects that could transform the poor African nation into a major energy supplier to Asia.",
        "date": "06012017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Eni LNG deal raises hopes of Mozambique gas boom "
    },
    {
        "content": "MAPUTO  June 7 Global oil traders Vitol and Gunvor are interested in buying Mozambique's struggling state-owned fuel distributor Petromac  local media reported on Wednesday.",
        "date": "06072017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Vitol  Gunvor eye Mozambique fuel distributor privatisation -report "
    },
    {
        "content": "ABUJA  May 30 Nigeria's upper chamber of parliament voted on Tuesday to halt a concession agreement with the local division of Italian oil company Eni to repair  operate and maintain Port Harcourt refinery  saying the deal lacked transparency.",
        "date": "05302017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 1-Nigerian Senate votes to halt Eni's Port Harcourt refinery deal "
    },
    {
        "content": "* Basra Oil director general Hayyan Abdul Ghani tells Reuters",
        "date": "05282017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "BRIEF-Iraq's Basra oil Co. takes over Oxy's stake in Zubair oilfield - Basra Oil "
    },
    {
        "content": "ABUJA  May 30 Nigeria's Senate voted on Tuesday to halt a concession agreement with the local unit of Italian oil firm Eni to repair  operate and maintain Port Harcourt refinery  saying the deal lacked transparency.",
        "date": "05302017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Nigerian Senate votes to halt Eni's Port Harcourt refinery deal "
    },
    {
        "content": "MILAN Italian energy company Eni reported its best quarterly profits in two years on Wednesday buoyed by higher oil prices and production and confirmed its full-year targets.",
        "date": "05102017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni confirms full-year targets after best quarter in two years "
    },
    {
        "content": "MILAN  May 10 Italian energy company Eni reported its best quarterly profits in two years on Wednesday buoyed by higher oil prices and production and confirmed its full-year targets.",
        "date": "05102017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 1-Eni confirms full-year targets after best quarter in two years "
    },
    {
        "content": "MILAN A Nigerian village has filed a lawsuit in Milan against Italian oil company Eni demanding compensation for damage caused by an oil pipeline explosion in 2010  an Italian lawyer representing the village said on Thursday.",
        "date": "05042017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Nigerian village sues Eni for damages from pipe explosion "
    },
    {
        "content": "AMSTERDAM  May 8 British oil and gas explorer Ophir Energy plans to borrow $1.2 billion from Chinese banks to back the development of its Fortuna floating liquefied natural gas (FLNG) export project in Equatorial Guinea.",
        "date": "05082017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "CORRECTED-UPDATE 1-Ophir to borrow $1.2 bln from Chinese banks for Fortuna floating LNG "
    },
    {
        "content": "* Fund to engage Eni  Saipem in \"active ownership\" (Adds details from statement)",
        "date": "05052017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 1-Norway's wealth fund to focus on corruption risk at four firms "
    },
    {
        "content": "LONDON  April 11 Royal Dutch Shell was aware that some of the payments it made to Nigeria for rights to an oilfield under a 2011 deal would go to a company associated with former Nigerian oil minister and convicted money launderer Dan Etete  it said in a statement to Reuters.",
        "date": "04112017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 1-Shell says it knew some payments for Nigeria oilfield would go to Malabu "
    },
    {
        "content": "AMSTERDAM  March 31 Dutch publicly owned utility Eneco said on Friday it would buy the Belgian gas and power retail operations of Italian oil and gas company Eni  the Dutch company's second regional renewable energy related deal this year.",
        "date": "03312017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 1-Eneco boosts renewables business with Eni Belgium purchase "
    },
    {
        "content": "RAVENNA  Italy  March 29 Italy's Eni said on Wednesday it expected that its recent discovery off the coast of Mexico would hold more than the 800 million barrels of oil it originally estimated.",
        "date": "03292017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 1-Eni CEO says Mexico oil find likely bigger than estimates "
    },
    {
        "content": "* EDF still has 86 pct electricity market share   (Adds Eni comment on competition  detail on other players)",
        "date": "03282017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 1-Eni launches French power retail sales  targets 1 mln clients by year-end "
    },
    {
        "content": "PARIS Italy's Eni  already France's second-biggest gas retailer  said on Tuesday that it will launch an electricity retail offer and is targeting 1 million French customers by the year-end.",
        "date": "03282017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Eni launches French power retail sales  targets 1 million clients by year-end "
    },
    {
        "content": "ROME  March 18 The Italian Treasury on Saturday proposed that veteran banker Alessandro Profumo be named the new chief executive of defence and aerospace company Leonardo   in a round of new appointments at state-controlled firms.",
        "date": "03182017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Italy proposes Profumo as new Leonardo CEO  confirms Eni  Enel chiefs "
    },
    {
        "content": "ABUJA A Nigerian court on Friday overturned a request by Nigeria's financial crimes agency to seize an oilfield from Royal Dutch Shell and Eni.",
        "date": "03172017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Nigerian court overturns seizure of oilfield from Shell and Eni "
    },
    {
        "content": "MAPUTO  March 21 Mozambique will get $350 million in capital gains tax from Eni after the Italian oil and gas company agreed to sell a stake in a gas field to Exxon Mobil Corp  senior tax official Anibal Mbalango said on Tuesday.",
        "date": "03212017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Mozambique to get $350 mln in tax from Eni-Exxon deal "
    },
    {
        "content": "ROME  March 20 The Italian government has no plans to sell a stake in oil and gas group Eni  an Italian Treasury source said on Monday  denying a report in Italian media.",
        "date": "03202017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Italy has no intention of selling stake in ENI- Treasury source "
    },
    {
        "content": "ABUJA  March 17 A Nigerian court on Friday overturned a request by Nigeria's financial crimes agency to seize an oilfield from Royal Dutch Shell and Eni .",
        "date": "03172017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 3-Nigerian court overturns seizure of oilfield from Shell and Eni "
    },
    {
        "content": "The following factors could affect Italian markets on Tuesday.",
        "date": "03212017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Italy - Factors to watch on March 21 "
    },
    {
        "content": "Exxon Mobil Corp   the world's biggest publicly traded oil producer  has agreed to pay Italy's Eni  $2.8 billion for a 25 percent stake in a giant Mozambique gas field to strengthen its position supplying rich Asian markets.",
        "date": "03102017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Exxon stumps up $2.8 billion for Mozambique gas gateway to Asia "
    },
    {
        "content": "March 9 Exxon Mobil Corp  the world's biggest publicly traded oil producer  has agreed to pay Italy's Eni $2.8 billion for a 25 percent stake in a giant Mozambique gas field to strengthen its position supplying rich Asian markets.",
        "date": "03092017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "REFILE-UPDATE 2-Exxon stumps up $2.8 bln for Mozambique gas gateway to Asia "
    },
    {
        "content": "HOUSTON  March 8 Financially strapped oil producers are spending billions to boost production before it's clear that recent crude price gains brought on by OPEC output cuts can be sustained.",
        "date": "03082017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "CERAWEEK-Oil majors still years from repairing balance sheets after price war "
    },
    {
        "content": "ABUJA  March 2 Nigeria's financial crime watchdog has filed new corruption charges against Royal Dutch Shell  Eni and others regarding the $1.3 billion purchase of a long-disputed oilfield in 2011  according to court documents released on Thursday.",
        "date": "03022017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 2-Nigeria files new charges against Shell  Eni  others over 2011 oilfield purchase -court documents "
    },
    {
        "content": "ABUJA  March 2 Nigeria's financial crime watchdog has filed new corruption charges against Royal Dutch Shell PLC  Eni SpA and others regarding the $1.3 billion purchase of a long-disputed oilfield in 2011  according to court documents released on Thursday.",
        "date": "03022017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Nigeria files new charges against Shell  Eni  others over 2011 oilfield purchase - court documents "
    },
    {
        "content": "MILAN/LONDON Italy's Eni  reported its first quarterly profit in 18 months and said it expects oil and gas production to rise 3 percent per year over the next four years after a string of high profile discoveries.",
        "date": "03012017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni looks to strong project pipeline to boost growth "
    },
    {
        "content": "* Shares up  outperform sector peers   (Recasts lead with plan  adds CEO comments  shares  analyst)",
        "date": "03012017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 2-Eni looks to strong project pipeline to boost growth "
    },
    {
        "content": "ALGIERS Algeria's Sonatrach wants to start offshore oil drilling and has begun discussions with U.S. operators Exxon Mobil Corp  and Anadarko  as well as Italy's Eni   a source at the state energy company told Reuters on Sunday.",
        "date": "02262017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Exclusive: Algeria's Sonatrach in talks to begin offshore drilling - source "
    },
    {
        "content": "CAIRO Major international oil companies say they plan to step up their investments in Egypt  expecting to find more oil and gas now that ENI's giant Zohr gas discovery has put its Mediterranean waters on the map.",
        "date": "02142017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Oil companies bullish on Egypt  eyeing more investment  discoveries "
    },
    {
        "content": "MILAN Italian oil major Eni has backed CEO Claudio Descalzi after sources said on Wednesday prosecutors had asked for him to be sent to trial over alleged corruption in Nigeria.",
        "date": "02082017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni backs CEO after prosecutors ask for trial over Nigeria "
    },
    {
        "content": "* Descalzi could be reappointed   (Adds Eni statement  Shell no comment  shares)",
        "date": "02082017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 2-Eni backs CEO after prosecutors ask for trial over Nigeria "
    },
    {
        "content": "MILAN  Feb 8 Italian prosecutors have asked for the CEO of oil and gas group Eni Claudio Descalzi to be sent to trial over alleged corruption in Nigeria  judicial sources said on Wednesday.",
        "date": "02082017",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Italy prosecutors ask for Eni CEO to be sent to trial over Nigeria - sources "
    },
    {
        "content": "ASTANA Kazakhstan has agreed to continue talks about a tax dispute with the Karachaganak consortium of oil majors led by Shell  and Eni  despite beginning arbitration proceedings  the Kazakh Energy Ministry said on Thursday.",
        "date": "01262017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Kazakhstan  Shell-Eni group continue talks over tax dispute "
    },
    {
        "content": "ISLAMABAD  Jan 19 Commodity trader Gunvor has won a major tender to supply about 60 liquefied natural gas (LNG) shipments to Pakistan over a five year period while Italy's Eni will supply the country with LNG over a 15-year period  a Pakistani energy official told Reuters.",
        "date": "01192017",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 1-Gunvor wins 5-year deal to supply LNG to Pakistan- energy official "
    },
    {
        "content": "BEIRUT National Iranian Oil Company (NIOC) has signed a short-term contract with Eni to sell crude  an Iranian official said on Monday  as it seeks to revive the agreement it had with the Italian oil major prior to sanctions on Tehran.",
        "date": "12192016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Iran starts selling oil to Italy's Eni "
    },
    {
        "content": "MILAN Italian energy company Eni will sell a 30 percent stake in its giant Egyptian offshore gas field Zohr to Russia's Rosneft for $1.575 billion  pressing ahead with asset sales to fund investments and offset weak oil prices.",
        "date": "12122016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni spreads Egypt gas field risk with Rosneft stake sale "
    },
    {
        "content": "Nov 28 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Monday:",
        "date": "11282016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "MILAN  Nov 28 Italian oil and gas company Eni  is in talks with various parties to cut its stake in the giant Zohr gas field offshore Egypt to 50 percent  Chief Executive Claudio Descalzi said on Monday.",
        "date": "11282016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 1-Eni aiming to cut stake in Egypt's Zohr offshore gas find to 50 pct "
    },
    {
        "content": "MILAN/LONDON BP  has agreed to buy 10 percent of Eni's  Shorouk concession offshore Egypt  which includes the giant Zohr gas field  for $375 million  joining other oil majors in increasing bets on the growing gas market.",
        "date": "11252016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "BP buys stake in Eni's giant Zohr gas field offshore Egypt "
    },
    {
        "content": "* Wants to become number one wind operator in Italy   (Adds CEO's comments about opportunities in Italian market)",
        "date": "11282016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 2-EDF's Edison says could buy Eni's Italian energy retail business "
    },
    {
        "content": "PARIS  Nov 28 Italian energy group Edison   a unit of French utility EDF  wants to triple its Italian customer base and would be ready to buy Italian energy group Eni's retail base  said Edison chief executive Marc Benayoun.",
        "date": "11282016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "EDF unit seeks to triple retail base in Italy  eyes ENI portfolio "
    },
    {
        "content": "MILAN  Nov 18 Eni on Friday finalised plans to develop Mozambique's Coral South offshore gas project  part of a larger scheme that will see Italy's top energy company and partners spend an estimated $50 billion.",
        "date": "11182016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Eni signs off on plans for Mozambique gas development "
    },
    {
        "content": "MAPUTO  Nov 8 Mozambique's finance minister has a plan to deal with a debt crisis that threatens to derail one of Africa's most promising frontier economies but investors are far from convinced.",
        "date": "11082016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Mozambique upbeat on debt crisis  investors not so sure "
    },
    {
        "content": "MAPUTO  Nov 2 Italy's Eni should make a final investment decision on its first offshore deep-water Liquefied Natural Gas project in Mozambique by the end of this year  Energy Minister Lleticia da Silva Klemens said on Wednesday.",
        "date": "11022016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Mozambique expects Eni decision on LNG investment this year "
    },
    {
        "content": "MILAN  Oct 20 Italian oil and gas group Eni  confirmed on Thursday it was in talks with a buyer for a stake in its Area 4 gas field in Mozambique but said a deal had not yet been reached.",
        "date": "10202016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni talking to Mozambique gas field buyer but no deal yet "
    },
    {
        "content": "** Production from the giant Kashagan oilfield in Kazakhstan is expected to average more than 150 000 barrels per day in 2017 and 230 000 bpd in 2018  according to consultancy Wood Mackenzie",
        "date": "10072016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "BUZZ-Kashagan oil output to average 150 000 bpd in 2017 -WoodMac "
    },
    {
        "content": "MAPUTO Mozambique Energy Minister Pedro Couto has been sacked  the presidency said on Thursday  a month before Italy's Eni is due to finalize an offshore gas project worth tens of billions of dollars.",
        "date": "09292016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Mozambique energy minister sacked ahead of huge gas deals "
    },
    {
        "content": "MAPUTO  Sept 29 Mozambique Energy Minister Pedro Couto has been sacked  the presidency said on Thursday  a month before Italy's Eni is due to finalise an offshore gas project worth tens of billions of dollars.",
        "date": "09292016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 2-Mozambique energy minister sacked ahead of huge gas deals "
    },
    {
        "content": "* Italian oil major Eni has agreed a common strategy with Egypt to build renewable energy projects in the country  the company said on Thursday.",
        "date": "09292016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Eni agrees renewables energy deal with Egypt "
    },
    {
        "content": "JOHANNESBURG  Sept 27 Italian oil firm Eni  has approached banks for billions of dollars to finance a huge offshore gas development in Mozambique  a significant step in getting a long-delayed project off the ground  the company and sources said.",
        "date": "09272016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni asks banks for billions to finance Mozambique gas project "
    },
    {
        "content": "PODGORICA Montenegro on Wednesday signed a contract with a consortium of Italy's Eni and Russian No. 2 gas firm Novatek  awarding it a 30-year concession for oil and gas exploration in the Adriatic sea.",
        "date": "09142016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Montenegro signs 30-year oil concession deal with Eni  Novatek "
    },
    {
        "content": "OSLO  Sept 13 Italian oil company Eni  acknowledged its staff needed a better grasp of the potential risks at its Goliat field in Norway's Arctic waters more than a month before a power failure that halted production.",
        "date": "09132016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni acknowledges risk management at Arctic field needs improving "
    },
    {
        "content": "LONDON/DOHA  Sept 12 Qatar Petroleum is interested in the Mozambique gas business of Italian energy group Eni and could opt to join Exxon Mobil in buying a multibillion-dollar stake  sources familiar with the matter said.",
        "date": "09122016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Qatar considers joining Exxon's Mozambique gas move "
    },
    {
        "content": "OSLO Norwegian Petroleum Safety Authority (PSA) asked Italy's oil firm ENI on Monday to present plans on how to avoid power disruptions at its Goliat oil platform in the Barents Sea.",
        "date": "08292016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Norway asks ENI to prevent future disruptions at Arctic field "
    },
    {
        "content": "MILAN  Aug 5 Italian oil firm Eni has wrapped up long-running talks to sell a multi-billion dollar stake in its planned Mozambique liquefied natural gas (LNG) development to Exxon Mobil  two sources with knowledge of the matter said.",
        "date": "08052016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni reaches deal with Exxon on Mozambique gas project-sources "
    },
    {
        "content": "* Sees no reason to change 7 bln euro asset sale plan   (Adds management  analyst comments  updates shares)",
        "date": "07292016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 2-Eni's confidence on exploration  production offsets loss "
    },
    {
        "content": "* Aims to increase returns on deepwater projects to 25 pct   (Adds quotes  details of projects)",
        "date": "07292016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 1-Indonesia to start natural gas output from two deepwater fields "
    },
    {
        "content": "* Exxon said in advanced talks with Eni over Mozambique gas stake- Bloomberg  citing sources  Source text : http://bloom.bg/2asCU15   (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "07282016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "BRIEF-Exxon said in advanced talks with Eni over Mozambique gas stake - Bloomberg "
    },
    {
        "content": "JOHANNESBURG  July 25 Mozambique's long-delayed offshore gas project with Italy's Eni could be approved within months  sources close to the deal said  sparking investments with the potential to transform one of the world's poorest countries into a major energy player.",
        "date": "07252016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Mozambique closes in on huge gas deal after years of delays "
    },
    {
        "content": "AMSTERDAM  July 21 Dutch gas wholesaler GasTerra said on Thursday it would seek an arbitration ruling against Eni  to recover 918 million euros ($1.01 billion) in back payments it said it was owed after the Italian oil and gas group lost a price review arbitration.",
        "date": "07212016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "GasTerra seeks $1 bln in back payments from Eni via arbitration "
    },
    {
        "content": "SEOUL  July 21 Samsung Heavy Industries  expects to receive an order this year from Eni  to build a floating LNG platform to process huge gas reserves in Mozambique  a spokesman said on Thursday  a sign a long-delayed project is moving ahead.",
        "date": "07212016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "REFILE-UPDATE 1-Samsung Heavy in talks with Eni to build Mozambique LNG platform "
    },
    {
        "content": "YENAGOA  Nigeria Militants launched a fresh round of attacks on oil pipelines in Nigeria's southern Niger Delta energy hub belonging to Italy's Eni and Aiteo  Nigerian security forces  Eni and a militant group said.",
        "date": "07082016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Militants blow up oil pipelines in Nigeria's southern Niger Delta "
    },
    {
        "content": "* Kachikwu says Forcados repairs completed by end July   (Adds quotes  details  bullet points)",
        "date": "07082016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 2-Militants blow up oil pipelines in Nigeria's southern Niger Delta "
    },
    {
        "content": "YENAGOA  Nigeria  July 8 Attackers blew up an oil pipeline in Nigeria's southern Bayelsa state operated by a subsidiary of Italy's Eni on Friday  the Nigeria Security and Civil Defence Corps (NSDC) said.",
        "date": "07082016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Militants blow up Eni oil pipeline in Nigeria -security agency "
    },
    {
        "content": "ONITSHA  Nigeria  June 10 A Nigerian militant group attacked a pipeline operated by Italy's ENI in the Niger Delta region early on Friday   the militants and a security official said.",
        "date": "06102016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 1-Nigerian official confirms attack on ENI pipeline in Niger Delta "
    },
    {
        "content": "LONDON  June 9 Energy majors BP and Eni  on Thursday announced a significant natural gas discovery off the Egyptian coast.",
        "date": "06092016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 1-BP  Eni announce new gas discovery off Egyptian coast "
    },
    {
        "content": "The following factors could affect Italian markets on Monday.",
        "date": "06062016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Italy - Factors to watch on June 6 "
    },
    {
        "content": "YENAGOA  Nigeria A crude oil pipeline in Nigeria's southern state of Bayelsa operated by the local subsidiary of Italy's Eni was attacked on Sunday  the Nigeria Security and Civil Defence Corps (NSDC) said.",
        "date": "05222016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Militants attack Agip pipeline in Nigeria's Bayelsa state "
    },
    {
        "content": "YENAGOA  Nigeria  May 22 A crude oil pipeline in Nigeria's southern state of Bayelsa operated by the local subsidiary of Italy's Eni was attacked on Sunday  the Nigeria Security and Civil Defence Corps (NSDC) said.",
        "date": "05222016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 1-Militants attack Agip pipeline in Nigeria's Bayelsa state "
    },
    {
        "content": "YENAGOA  Nigeria  May 22 A crude oil pipeline in Nigeria's southern state of Bayelsa operated by the local subsidiary of Italy's Eni was attacked on Sunday  the Nigeria Security and Civil Defence Corps (NSDC) said.",
        "date": "05222016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Militants attack Agip oil pipeline in Nigeria's Bayelsa state- security agency "
    },
    {
        "content": "* Q1 operating profits beat expectations   (Recasts lead  adds Venezuela  CFO comments)",
        "date": "04292016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 2-Eni makes progress on $8 bln asset sales goal "
    },
    {
        "content": "LONDON - The yen hit an 18-month high as investors wager the Bank of Japan might be done adding fresh stimulus to the economy  culminating in a sharp rise on the week that dragged stocks around the world lower. (GLOBAL-MARKETS/ (WRAPUP 5)  moved  by Jamie McGeever  710 words)",
        "date": "04292016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Reuters Business News Schedule at 1230 GMT/0830 AM ET "
    },
    {
        "content": "April 5 Kazakhstan has filed a $1.6 billion claim against a group led by BG Group Plc and Eni SpA  which is developing the Karachaganak gas condensate field  Russia's Lukoil  also a consortium member  said.",
        "date": "04052016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 2-Kazakhstan files $1.6 bln claim against BG-Eni venture -Lukoil "
    },
    {
        "content": "MILAN  April 4 The head of Italy's Eni  said on Monday the oil major had no ties with Unaoil  the Monaco-based energy services company caught up in an investigation into alleged corruption.",
        "date": "04042016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni CEO says has no ties with Unaoil "
    },
    {
        "content": "* terms of the deal aren't clear  but Exxon is in talks to buy a stake of around 20 pct from Eni  which owns 50 pct of the development - WSJ",
        "date": "03242016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "BRIEF-Exxon Mobil in talks to buy stake in big Mozambique gas project from Eni SpA - WSJ "
    },
    {
        "content": "LONDON Iranian oil flows to Europe have begun to pick up from a slow start after sanctions were lifted in January  but trading sources say a lack of access to storage part-owned by Tehran's Gulf Arab rivals now looms large on a list of obstacles.",
        "date": "03242016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Iran's oil storage struggle holds back exports to Europe "
    },
    {
        "content": "LONDON/MILAN Italy's Eni is cutting investments and selling down stakes in oil and gas fields to help it prop up dividends and become a leaner exploration-driven player focusing on gas.",
        "date": "03182016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni cranks up spending cuts  asset sales to fund transformation "
    },
    {
        "content": "* To raise 7 billion euros from asset sales   (Adds CEO comments  fund manager)",
        "date": "03182016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 2-Eni cranks up spending cuts  asset sales to fund transformation "
    },
    {
        "content": "ROME  March 4 Two Italian civilians held hostage in Libya since last July have been freed  a source close to the matter said on Friday  a day after two other captives were reported to have been killed in the north African state.",
        "date": "03042016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Two Italian hostages freed in Libya -source close to matter "
    },
    {
        "content": "* Confirms 0.8 euro dividend for 2015   (Recasts lead  adds CEO comments  analyst  shares)",
        "date": "02262016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 3-Eni slashes investment after hefty fourth-quarter loss "
    },
    {
        "content": "* Eni up after in-line dividend   (Updates prices  adds details)",
        "date": "02262016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Mining rally pushes European shares to three-week highs "
    },
    {
        "content": "MILAN  Feb 24 Italy's Eni said on Wednesday it has won approval from the Mozambique government to build its planned Coral floating liquefied natural gas plant.",
        "date": "02242016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 1-Eni steals march on East African LNG rivals with Mozambique plant approval "
    },
    {
        "content": "MAPUTO  Jan 28 Mozambican gas projects being developed by Italy's Eni and U.S. energy firm Anadarko  will be given the final go-ahead by the end of this year  the state-run National Hydrocarbon Company (ENH) said on Thursday.",
        "date": "01282016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Mozambique says final gas decisions to be made this year "
    },
    {
        "content": "ROME Iran's emergence from economic sanctions will help Europe to diversify its energy supplies  but the Islamic Republic will need to invest at least $150 billion in infrastructure to become a major producer  the head of Italy's Eni SpA  said on Sunday.",
        "date": "01172016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni CEO says Iran needs $150 billion of energy investment "
    },
    {
        "content": "ROME  Jan 17 The lifting of economic sanctions against Iran will help Europe to diversify its energy supply  the head of Italy's oil producer Eni said on Sunday.",
        "date": "01172016",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Eni CEO says end of Iran sanctions good for Europe's energy supply "
    },
    {
        "content": "BRUSSELS  Jan 12 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "01122016",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "EU mergers and takeovers (Jan 12) "
    },
    {
        "content": "ROME  Dec 29 Italian Prime Minister Matteo Renzi said on Tuesday he doesn't  see scope for many more privatisations in the country  adding the government would not cut its stake in energy group Eni.",
        "date": "12292015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Italy's Renzi doesn't see scope for lots more privatisations "
    },
    {
        "content": "* SK Capital talks with Eni over Versalis - trade unions   (Recasts lead  adds CEO comments  analyst estimate)",
        "date": "12172015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 2-Italy's Eni in talks with potential buyer for Versalis "
    },
    {
        "content": "MILAN  Dec 14 European shares were seen opening slightly higher on Monday  as a sell-off triggered by worries over China and tumbling oil prices runs out of steam before an expected increase in U.S. interest rates this week.",
        "date": "12142015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "European Factors to Watch-Shares seen opening slightly higher "
    },
    {
        "content": "* Leviathan is potentially Israel's largest natural gas field",
        "date": "12172015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 1-Israeli PM sets aside anti-trust ruling  gives go-ahead for Leviathan gas field "
    },
    {
        "content": "MILAN  Dec 3 Italy's Eni has agreed with Anadarko Petroleum to start development of adjoining Mozambique offshore gas fields as the East African country strives to become a key global supplier of liquefied natural gas (LNG).",
        "date": "12032015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni and Anadarko join forces on Mozambique gas projects "
    },
    {
        "content": "MILAN  Nov 27 An international arbitration court has cut by around 1 billion euros ($1.06 billion) the cost of Libyan gas that Italian oil group Eni has sold to rival Edison under a long-term supply contract.",
        "date": "11272015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "REFILE-Court cuts cost of gas Eni sold to Edison by 1 bln euros "
    },
    {
        "content": "MILAN  Nov 11 The sale of a stake in Italian oil contractor Saipem by main owner Eni to a state-owned investment fund does not constitute a change of control and so is exempt from rules triggering a mandatory bid  Italian watchdog Consob said on Wednesday.",
        "date": "11112015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni sale of Saipem stake does not trigger mandatory bid "
    },
    {
        "content": "LUANDA  Nov 5 Italy's ENI and Angola's state oil company Sonangol have agreed to finalise the evaluation of a gas field project that could generate up to 1.5 gigawatts (GW) of electricity for the southern African nation.",
        "date": "11052015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Italy's ENI  Sonangol to finalise evaluation of Angola gas fields "
    },
    {
        "content": "MAPUTO  Oct 29 Mozambique's state oil company awarded lucrative exploration rights for fossil fuels off its Indian Ocean coastline on Thursday  with energy giants Exxon Mobil  Italy's Eni and South Africa's Sasol  among the winners.",
        "date": "10292015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 1-Exxon  Eni  Sasol win rights to explore Mozambique's oil and gas reserves "
    },
    {
        "content": "MAPUTO  Oct 29 Exxon Mobil  Italy's Eni  and South Africa's Sasol have won bids to explore new blocks for fossil fuels in Mozambique and off its Indian Ocean coastline  a source told Reuters on Thursday.",
        "date": "10282015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Exxon  Eni  Sasol win rights to explore Mozambique's oil and gas reserves "
    },
    {
        "content": "Oct 27 Kazakhstan is considering levying a fine of as much as $2 billion on a gas project led by BG Group Plc  and Eni SpA for failing to fulfil certain contractual obligations  Bloomberg reported.",
        "date": "10272015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Kazakhstan considering $2 bln fine on BG-Eni venture - Bloomberg "
    },
    {
        "content": "MILAN  Oct 29 Italy's national oil company Eni  has reported it made a net loss in the third quarter due mainly to sharply weaker oil prices but has raised its oil and gas production targets for the full year ",
        "date": "10292015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 2-Eni lifts production targets after falling to Q3 loss "
    },
    {
        "content": "MILAN Italian oil contractor Saipem said on Wednesday it will ask investors for up to 3.5 billion euros ($3.86 billion) of fresh capital to help it weather the oil service recession and plot a path to recovery as main investor Eni SpA  takes a step back.",
        "date": "10282015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Saipem launches 3.5 billion euro cash call as Eni steps back "
    },
    {
        "content": "MEXICO CITY  Sept 30 Mexico awarded three out of five offshore production-sharing contracts on Wednesday in the second phase of its historic oil sector opening  comfortably beating the disappointing results of the first phase and giving a boost to the peso.",
        "date": "10012015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 3-Mexico gets stronger demand in second oil auction  Eni among winners "
    },
    {
        "content": "MEXICO CITY  Sept 30 Mexico awarded three out of five offshore production-sharing contracts on Wednesday in the second phase of its historic oil sector opening  comfortably beating the disappointing results of the first phase and giving a boost to the peso.",
        "date": "09302015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 2-Mexico gets stronger demand in second oil auction  Eni among winners "
    },
    {
        "content": "MILAN  Sept 15 Braving all the political risks of the region  Italy's Eni aims to pull together its east Mediterranean gas empire headed by a giant Egypt find  into a major hub to supply Europe.",
        "date": "09152015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni plans to hold the keys for east Mediterranean gas exports "
    },
    {
        "content": "ROME  Sept 9 Italian energy group Eni  said two people had been killed in an accident at a Sicilian plant operated by its Versalis chemical unit  prompting trade union calls for a strike to protest over working conditions.",
        "date": "09092015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Accident at Eni chemical plant in Sicily kills two "
    },
    {
        "content": "* Italy's Eni has full rights to develop the site   (Adds background)",
        "date": "08302015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 2-Italy's Eni makes mega gas discovery off Egyptian coast "
    },
    {
        "content": "MILAN Eni's \"supergiant\" gas find off the coast of Egypt bolsters its top-flight exploration credentials and gives the Italian energy group access to easy reserves that fit its strategy of seeking growth without sacrificing dividends.",
        "date": "08312015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni's credentials boosted by giant gas find in Egypt "
    },
    {
        "content": "ROME  Aug 30 Italian energy group Eni  said on Sunday it had discovered potentially one of the world's largest natural-gas fields off the Egyptian coast  predicting that the find could help meet Egypt's gas needs for decades to come.",
        "date": "08302015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Italy's Eni makes mega gas discovery off Egyptian coast "
    },
    {
        "content": "LONDON  Aug 31 European shares suffered their worst monthly performance in four years on Monday  as concerns over a Chinese economic slowdown and a possible U.S. interest rate rise hit the region's stock markets.",
        "date": "08312015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "European shares slide to worst monthly performance since August 2011 "
    },
    {
        "content": "* Israeli energy stocks plunge on Egypt find   (Adds detail  analysts  background)",
        "date": "08312015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 2-Eni's credentials boosted by giant gas find in Egypt "
    },
    {
        "content": "ROME/MILAN  Aug 30 Italian energy group Eni  said on Sunday it had discovered the largest known gas field in the Mediterranean off the Egyptian coast  predicting the find could help meet Egypt's gas needs for decades to come.",
        "date": "08312015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "CORRECTED-UPDATE 2-Italy's Eni makes mega gas discovery off Egyptian coast "
    },
    {
        "content": "MILAN  Aug 31 Italy's Eni is open to selling a stake in its \"supergiant\" Zohr gas field discovery off of Egypt  its chief executive said  as the state-controlled energy company looks for funds to bankroll development without sacrificing dividends.",
        "date": "08312015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "CORRECTED-UPDATE 1-Eni open to selling stake in supergiant Egypt gas find "
    },
    {
        "content": "LONDON  Aug 31 European shares fell on Monday  with Germany's DAX and France's CAC on track for their weakest month for four years  hit by sliding Chinese stocks and prospects of a near-term U.S. interest rate increase.",
        "date": "08312015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "European shares drop lower  set for weakest month since August 2011 "
    },
    {
        "content": "CAIRO Egypt said that the initial investment in a mega gas field discovered off its coast by Italian energy group Eni will amount to about $3.5 billion.",
        "date": "08312015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Initial investment in Eni mega gas field in Egypt about $3.5 billion: EGAS "
    },
    {
        "content": "LONDON  Aug 31 European shares fell on Monday  with Germany's DAX and France's CAC on track for their weakest month for four years  hit by sliding Chinese stocks and prospects of a near-term U.S. interest rate increase.",
        "date": "08312015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "European shares dip  set for weakest month since August 2011 "
    },
    {
        "content": "LONDON Britain on Monday awarded 41 licenses to drill for oil and gas in the North Sea  the government said  with oil majors Shell and ENI among the successful bidders.",
        "date": "07272015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Britain awards oil and gas licenses in bid to boost exploration "
    },
    {
        "content": "MAPUTO  July 30 Exxon Mobil  Italy's Eni  and South Africa's Sasol are among the firms that submitted bids to explore new blocks for fossil fuels in Mozambique and off its Indian Ocean coastline  a senior official said on Thursday.",
        "date": "07302015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Exxon  Eni  Sasol bid for Mozambique's unexplored fossil fuel bounty "
    },
    {
        "content": "MILAN  July 30 Italian oil and gas group Eni  raised its production targets for the year on Thursday  boosting its shares after second-quarter net profit slumped due to lower oil prices and a heavy loss at subsidiary Saipem .",
        "date": "07302015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 2-Eni production growth takes sting out of Saipem writedown "
    },
    {
        "content": "MILAN  July 30 Italian oil and gas group Eni  raised its production targets for the year on Thursday as second-quarter net profit slumped due to lower oil prices and a heavy loss at oil contractor subsidiary Saipem.",
        "date": "07302015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 1-Eni raises output target as Q2 profits slump on Saipem "
    },
    {
        "content": "The following factors could affect Italian markets on Tuesday.",
        "date": "07142015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Italy - Factors to watch on July 14 "
    },
    {
        "content": "LONDON  July 14 European stocks were set to pause on Tuesday after a strong four day rally  with investors unsure whether Greece would be able to get the support of its parliament behind a bailout deal designed to avert bankruptcy.     Just hours after agreeing to an austerity package in return for agreeing to talks on an 86 billion euro bailout  doubts were already emerging about whether Tsipras would be able to hold his government together.         The pan-European FTSEurofirst 300",
        "date": "07142015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "European Factors to Watch-Shares to pause after Greek deal rally "
    },
    {
        "content": "CAIRO  July 5 Egypt has raised the prices it pays Eni and Edison for the natural gas they produce in the country  an official with state-owned gas company EGAS said on Sunday.",
        "date": "07052015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 1-Egypt raises gas price paid to Italy's Eni and Edison -EGAS official "
    },
    {
        "content": "* Finalises accord with KazMunayGas to jointly explore the Isatay offshore oil block in the Caspian sea  Source text for Eikon: ] Further company coverage:    (Reporting by Milan Newsroom)",
        "date": "06272015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "BRIEF-Eni  KazMunayGas finalise deal to jointly explore Isatay offshore block "
    },
    {
        "content": "MILAN  June 9 Saipem shares fell on Tuesday after a report  state lender CDP was considering buying a stake in the oil contractor revived ongoing concerns about the company's capital.",
        "date": "06092015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 1-Saipem shares slide as cash call jitters return "
    },
    {
        "content": "CAIRO  June 1 Egypt's oil ministry said on Monday it had signed an energy exploration deal with Italy's Eni  worth $2 billion following an MOU signed in March during an investment conference.",
        "date": "06012015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 1-Egypt signs exploration deal with Italy's Eni worth $2 bln "
    },
    {
        "content": "May 29 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "05292015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "* Shares end down 13.5 pct  hit lowest in over 2 months   (Rewrites first paragraph  adds Saipem statement  banker comment  updates shares)",
        "date": "06042015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 2-Saipem shares dive on cash call talk "
    },
    {
        "content": "MILAN Italian oil company Eni is not experiencing any major production problems in Nigeria  the CEO said on Thursday.",
        "date": "05282015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni CEO says no problems in Nigeria "
    },
    {
        "content": "MILAN  May 29 Talks between Eni and suitors including Chinese state utility Huadian for a stake of around 15 percent in the Italian oil major's prized Mozambique gas field are dragging on due to differences over price  industry and banking sources said.",
        "date": "05292015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Eni talks on Mozambique sale sticking in oil slide "
    },
    {
        "content": "Here are some of the major events scheduled in U.S. Bankruptcy Courts this week. All times are local.",
        "date": "04272015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Week Ahead in Bankruptcy: April 27  2015 "
    },
    {
        "content": "MILAN  April 23 Stefano Cao has been brought back by Eni to turn around the oil service subsidiary Saipem that he spent nearly 25 years working for and prepare it for a sale  according to people familiar with the plan.",
        "date": "04232015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni CEO drafts in former boss to pave way for Saipem sale "
    },
    {
        "content": "MILAN U.S. investment company Dodge & Cox has increased its stake in Italy's Saipem   strengthening its position as the oil contractor's second-largest shareholder at a time when main owner Eni  is looking to sell down its holding.",
        "date": "04132015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Dodge & Cox increases stake in Italy's Saipem "
    },
    {
        "content": "* Eni still plans to cut stake in Saipem   (Recasts lead  adds source  shares  detail)",
        "date": "04132015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 1-Dodge & Cox increases stake in Italy's Saipem "
    },
    {
        "content": "MILAN  March 30 Italian oil and gas major Eni  said on Monday it had started production at its Hadrian South gas field in the Gulf of Mexico.",
        "date": "03302015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni starts production at Hadrian South field in Gulf of Mexico "
    },
    {
        "content": "* FTSEurofirst 300 ends up 0.3 pct  posts 6th weekly gain in row",
        "date": "03132015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Sinking euro keeps Europe stock rally alive "
    },
    {
        "content": "* Targets annual output growth of 3.5 percent   (Adds fund manager  details  shares)",
        "date": "03132015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 3-Eni becomes first oil major to cut dividend as seeks to fund growth "
    },
    {
        "content": "* Shares in Eni drop 5.4 pct after dividend cut  capex slashed",
        "date": "03132015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Europe's stock rally pauses as euro steadies "
    },
    {
        "content": "* Shares outperform sector   (Recasts lead  adds management comments  fund manager)",
        "date": "02182015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 3-Eni reassures on dividend as it cuts back spending "
    },
    {
        "content": "MILAN  Feb 17 Italy's Eni said on Tuesday it had reduced the number of expatriates working in Libya but was continuing to produce oil and gas in a regular way in the country.",
        "date": "02172015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 1-Eni says has cut expat workers in Libya  production continues "
    },
    {
        "content": "* Strong refining profits offset slump in oil production revenue",
        "date": "02132015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "CORRECTED-European \"refining spring\" won't save plants from the axe "
    },
    {
        "content": "MILAN  Feb 12 Italian prosecutors have asked for oil major Eni and its subsidiary Saipem to be put on trial on charges Saipem paid bribes to win contracts in Algeria  a judicial source said on Thursday.",
        "date": "02122015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "REFILE-Prosecutors request trial for Eni and Saipem on Algeria corruption "
    },
    {
        "content": "* Eni seeking to sell assets to bolster cash flow   (Adds source comments  background)",
        "date": "02052015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 1-Eni working with Goldman Sachs on gas and power spinoff -sources "
    },
    {
        "content": "Feb 5 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Thursday:",
        "date": "02052015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "MILAN  Feb 5 Italian oil and gas group Eni  is working with Goldman Sachs on the possible spinoff of its power and gas unit  two sources with knowledge of the matter said on Thursday.",
        "date": "02052015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Eni working with Goldman Sachs on gas and power spinoff - sources "
    },
    {
        "content": "Jan 28 The following bids  mergers  acquisitions and disposals were reported by 2330 GMT on Wednesday:",
        "date": "01282015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "PEDUASE  Ghana  Jan 27 Ghana National Petroleum Corporation (GNPC) is assessing the commercial potential of a new gas discovery made in partnership with Italian energy group Eni and oil trader Vitol  GNPC chief executive Alex Mould said on Tuesday.",
        "date": "01272015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "UPDATE 2-Ghana assessing commercial potential of new offshore gas discovery "
    },
    {
        "content": "MILAN  Jan 28 Eni is not interested in selling its entire stake in oil contractor Saipem but wants to get the subsidiary's debt off its books  Eni's CEO said on Wednesday.",
        "date": "01282015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 1-Eni aims to shed Saipem debt by selling part of its stake- CEO "
    },
    {
        "content": "* Eni  Total warn lower investments could lead to supply shortage",
        "date": "01212015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "CORRECTED-WRAPUP 1-OPEC  oil companies clash at Davos over price collapse "
    },
    {
        "content": "DAVOS  Switzerland The head of Italian energy company Eni Spa urged OPEC on Wednesday to act to restore stability in oil prices  which he warned could overshoot to $200 per barrel several years down the road because of low investment now.",
        "date": "01212015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "Eni CEO urges OPEC to act now  warns of oil spike to $200 per barrel "
    },
    {
        "content": "MILAN  Jan 20 Italian oil and gas group Eni  said on Tuesday it had won two exploration licenses in the Barents sea and in the North Sea in Norway.",
        "date": "01202015",
        "name": "ENI SpA",
        "news_type": "topStory",
        "symbol": "E",
        "title": "Eni wins two exploration licenses in Norway "
    },
    {
        "content": "* Oil sector to cut spending by 10-13 pct in 2015   (Adds details  quotes  background)",
        "date": "01212015",
        "name": "ENI SpA",
        "news_type": "normal",
        "symbol": "E",
        "title": "UPDATE 1-Eni CEO urges OPEC to act now  warns of oil spike to $200/bbl "
    }
]