[
    {
        "content": "* Electronic Arts Inc files for potential mixed shelf  size not disclosed - SEC filing ‍​ Source text: (http://bit.ly/2Axfi6L) Further company coverage:",
        "date": "11092017",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "BRIEF-Electronic Arts files for potential mixed shelf  size not disclosed - SEC filing ‍​ "
    },
    {
        "content": "* Electronic Arts - ‍under agreement  co will pay $151 million in cash  and up to $164 million in long-term equity in form of restricted stock units to employees​",
        "date": "11092017",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "BRIEF-EA to acquire Respawn Entertainment "
    },
    {
        "content": "* Qtrly loss per share $0.07; Qtrly total net revenue $959 million versus $898 million",
        "date": "10312017",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "BRIEF-Electronic Arts reports qtrly loss per share of $0.07 "
    },
    {
        "content": "Electronic Arts Inc's  revenue forecast for the holiday quarter narrowly missed estimates on Tuesday as the game developer gears to face tough competition from rivals such as Activision.",
        "date": "10312017",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "Game publisher EA's holiday-quarter sales forecast misses estimates "
    },
    {
        "content": "Oct 31 Electronic Arts Inc's revenue forecast for the holiday quarter narrowly missed estimates on Tuesday as the game developer gears to face tough competition from rivals such as Activision.",
        "date": "10312017",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "UPDATE 1-Game publisher EA's holiday-quarter sales forecast misses estimates "
    },
    {
        "content": "Oct 31 Electronic Arts Inc's revenue forecast for the keenly watched holiday quarter narrowly missed estimates on Tuesday amid expectations of tough competition from other games that are likely to release around the same time.",
        "date": "10312017",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "Videogame publisher EA's holiday-qtr sales forecast misses estimates "
    },
    {
        "content": "* Electronic Arts Inc director Lawrence Probst reports open market sale of 55 850 shares of co's common stock on Aug 30  - SEC filing‍​‍​ Source text: [http://bit.ly/2ewhaGH] Further company coverage:",
        "date": "09012017",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "BRIEF-Electronic Arts Inc director Lawrence Probst reports open market sale of 55 850 shares of co's common stock on Aug 30  - SEC filing‍​‍​ "
    },
    {
        "content": "* Electronic Arts and NFL launch first Madden NFL club championship Source text for Eikon: Further company coverage:",
        "date": "08212017",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "BRIEF-Electronic Arts and NFL launch first Madden NFL club championship "
    },
    {
        "content": "July 27 Electronic Arts Inc beat first-quarter revenue estimates as demand rose for its popular titles including \"Battlefield 1\" and \"The Sims\"  but forecast current-quarter revenue slightly below expectations.",
        "date": "07272017",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "UPDATE 1-EA beats revenue estimates  misses forecast "
    },
    {
        "content": "* Electronic Arts - Q1 earnings per share $2.06; Q1 total net revenue $1 449 million versus $1 271 million last year",
        "date": "07272017",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "BRIEF-Electronic Arts reports Q1 earnings per share of $2.06 "
    },
    {
        "content": "July 27 Electronic Arts Inc forecast revenue slightly below analysts' estimates for the current quarter  when the video-game publisher is expected to launch the latest franchises of its popular sports titles such as \"Madden NFL\" and \"FIFA\".",
        "date": "07272017",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "EA forecasts current-quarter revenue below estimates "
    },
    {
        "content": "* Electronic Arts Inc - ‍bonus formula addendum for fiscal year ending march 31  2018 was approved by board for ceo on july 10  2017​",
        "date": "07112017",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "BRIEF-Electronic Arts ‍bonus formula addendum for fiscal year ending March 31  2018 was approved by board for CEO "
    },
    {
        "content": "May 9 Video-game publisher Electronic Arts Inc forecast current-quarter revenue below analysts' estimates on Tuesday  and announced a new $1.2 billion buyback program.",
        "date": "05092017",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "EA forecasts current-quarter revenue below estimates "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  February 21 (Fitch) Fitch Ratings has affirmed Electronic Arts Inc.'s  (EA) Issuer Default Rating (IDR) at 'BBB'. Fitch has also affirmed the issue  specific ratings for EA's unsecured credit facility and unsecured notes at  'BBB'. The Rating Outlook is Stable. A full list of ratings follows at the end  of this release.  The affirmation takes into account EA's solid credit metrics and conservative  balance sheet  robust free c",
        "date": "02212017",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "Fitch Affirms Electronic Arts' IDR at 'BBB'; Outlook Stable "
    },
    {
        "content": "* Electronic arts inc says Q3 change in deferred net revenue was $921 million",
        "date": "01312017",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "BRIEF-Electronic Arts reports Q3 total net revenue of $1.15 bln "
    },
    {
        "content": "Jan 31 Video-game publisher Electronic Arts Inc  reported a 7.4 percent rise in third-quarter revenue  helped by strong sales of first-person shooter games \"Battlefield 1\" and \"Titanfall 2\".",
        "date": "01312017",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "Electronic Arts revenue rises 7.4 pct "
    },
    {
        "content": "* Omega Advisors dissolves share stake in Netflix - SEC filing",
        "date": "11142016",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "BRIEF-Omega Advisors dissolves share stake in Netflix  cuts in Facebook - SEC filing "
    },
    {
        "content": "Electronic Arts Inc's  second-quarter revenue edged past analysts' estimates and the videogame publisher raised its full-year revenue and profit forecast  indicating strong interest for its recently launched games.",
        "date": "11012016",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "'FIFA' publisher EA hikes full-year revenue  profit forecast "
    },
    {
        "content": "Nov 1 Electronic Arts Inc's  second-quarter revenue edged past analysts' estimates and the videogame publisher raised its full-year revenue and profit forecast  indicating strong interest for its recently launched games.",
        "date": "11012016",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "UPDATE 1-\"FIFA\" publisher EA hikes full-year revenue  profit forecast "
    },
    {
        "content": "* Q2 GAAP loss per share $0.13; Q2 GAAP net revenue $898 million versus $815 million",
        "date": "11012016",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "BRIEF-Electronic Arts reports Q2 GAAP loss per share of $0.13 "
    },
    {
        "content": "SAN FRANCISCO  Sept 29 Shares of video game maker Activision Blizzard and rival Electronic Arts  extended months-long Wall Street rallies in September as investors eyed new versions of high-profile franchises such as \"FIFA\" and \"Call of Duty \" analysts said.",
        "date": "09292016",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "Video game makers extend months-long rally with new titles on tap "
    },
    {
        "content": "\"Farmville\" creator Zynga Inc on Thursday appointed Gerard Griffin as its chief financial officer  adding another Electronic Arts Inc executive to its top ranks.",
        "date": "09292016",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "'Farmville' creator Zynga names former EA executive CFO "
    },
    {
        "content": "Sept 29 \"Farmville\" creator Zynga Inc  on Thursday appointed Gerard Griffin as its chief financial officer  adding another Electronic Arts Inc executive to its top ranks.",
        "date": "09292016",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "\"Farmville\" creator Zynga names former EA executive CFO "
    },
    {
        "content": "STOCKHOLM The Iceland team that grabbed headlines at Euro 2016 has been left out of Electronic Arts's highly-anticipated FIFA 17 video game due to a dispute over image rights  the country's soccer chiefs said.",
        "date": "09212016",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "Iceland says dropped from FIFA 17 game after rights dispute "
    },
    {
        "content": "STOCKHOLM  Sept 21 The Iceland team that grabbed headlines at Euro 2016 has been left out of Electronic Arts's highly-anticipated FIFA 17 video game due to a dispute over image rights  the country's soccer chiefs said.",
        "date": "09212016",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "Soccer-Iceland says dropped from FIFA 17 game after rights dispute "
    },
    {
        "content": "A California company can sue gamemaker Electronic Arts for joint ownership of the copyright on a promotional item that was included in a special edition of EA's virtual neighborhood game The Sims  a U.S. appeals court held Tuesday.",
        "date": "09072016",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "9th Circuit hits 'restart' on copyright case against Electronic Arts  tosses trade secrets claim "
    },
    {
        "content": "* Ups share stake in Electronic Arts Inc by 66 pct to 521 300 shares - SEC filing",
        "date": "08152016",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "BRIEF-Omega Advisors raises share stake in Electronic Arts by 66 pct - SEC filing "
    },
    {
        "content": "* EA Sports has today been confirmed as Manchester United's  official football video games partner",
        "date": "08102016",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "BRIEF-EA Sports confirmed as Man Utd's official video games partner "
    },
    {
        "content": "Video-game publisher Electronic Arts Inc  known for titles such as \"FIFA\" and \"Star Wars Battlefront\"  reported an unexpected first-quarter profit  helped by higher downloads of its games.",
        "date": "08022016",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "EA posts unexpected profit on higher game downloads "
    },
    {
        "content": "Aug 3 U.S. stock index futures were lower ahead of a raft of corporate results and data  including a report on private-sector hiring.",
        "date": "08032016",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "US STOCKS-Futures lower ahead of economic data "
    },
    {
        "content": "Aug 2 Video-game publisher Electronic Arts Inc   known for titles such as \"FIFA\" and \"Star Wars Battlefront\"  reported an unexpected first-quarter profit  helped by higher downloads of its games.",
        "date": "08022016",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "UPDATE 1-EA posts unexpected profit on higher game downloads "
    },
    {
        "content": "* Q1 non-gaap earnings per share $0.07; q1 non-gaap revenue $682 million versus. $693 million last year",
        "date": "08022016",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "BRIEF-Electronic Arts Q1 GAAP shr $1.40 "
    },
    {
        "content": "Aug 2 Video-game publisher Electronic Arts Inc   known for titles such as \"FIFA\" and \"Star Wars Battlefront\"  reported first-quarter revenue that beat analysts' estimates  helped by higher downloads of its games.",
        "date": "08022016",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "EA revenue beats estimates on higher game downloads "
    },
    {
        "content": "* 2016 total compensation for CEO Andrew Wilson of $16.7 million versus $11.6 million in 2015",
        "date": "06102016",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "BRIEF-Electronic Arts 2016 total compensation for CEO was $16.7 mln "
    },
    {
        "content": "* Roche has also been appointed to EA's compensation committee.",
        "date": "06092016",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "BRIEF-Electronic Arts appoints Talbott Roche to board of directors "
    },
    {
        "content": "* Says Electronic Arts Inc and Coldwood Interactive  Stillfront's subsidiary  announce  development of sequel to Unravel",
        "date": "05182016",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "BRIEF-Stillfront says Coldwood develops sequel to Unravel "
    },
    {
        "content": "* Gaap earnings per share $0.50; q4 gaap earnings per share $2.79; q4 non-gaap revenue $924 million versus. $896 million; q4 gaap revenue $1.31 billion versus. $1.19 billion",
        "date": "05102016",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "BRIEF-Electronic Arts qtrly adj shr $0.50 "
    },
    {
        "content": "* Q4 non-GAAP earnings per share $0.50  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05102016",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "BRIEF-Electronic Arts Q4 non-GAAP earnings per share $0.50 "
    },
    {
        "content": "May 10 Video game publisher Electronic Arts Inc   known for titles such as \"FIFA\" and \"Battlefield\"  reported quarterly revenue and profit above estimates  driven in part by its \"Star Wars Battlefront\" game.",
        "date": "05102016",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "Electronic Arts profit  revenue beat estimates "
    },
    {
        "content": "SAN FRANCISCO  April 12 Fresh off a two-year stock rally and a win with its \"Star Wars: Battlefront\" title  Electronic Arts Inc is attracting sizeable buy-in from institutional investors who expect the company to keep doing well with shooter videogames.",
        "date": "04122016",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "Electronic Arts attracts more investors even as stock fizzles "
    },
    {
        "content": "WASHINGTON  March 21 The U.S. Supreme Court on Monday rejected Electronic Arts Inc's bid to revive its free speech defense in a lawsuit filed by former NFL players who accused the videogame maker of using their likenesses in the popular Madden NFL series without permission or proper compensation.",
        "date": "03212016",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "U.S. top court rejects EA Sports' appeal over Madden videogame "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  February 17 (Fitch) Fitch Ratings has assigned a 'BBB' rating to  Electronic Arts Inc.'s (EA) announced benchmark-sized senior unsecured notes and  published a 'BBB' rating for EA's existing senior unsecured revolver. A full  list of ratings follows at the end of this release.  Proceeds from the offering are expected to be used for general corporate  purposes  including the payments of amounts due on EA's existing convertible ",
        "date": "02172016",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "Fitch Rates Electronic Arts' Sr Unsecured Notes & Existing Sr Unsecured Revolver 'BBB' "
    },
    {
        "content": "Electronic Arts Inc's quarterly revenue missed analysts' estimates and the company did not raise its full-year forecasts as much as expected as the strong sales of the newly launched \"Star Wars: Battlefront\" proved to be bittersweet.",
        "date": "01282016",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "EA forecast disappoints as Star Wars' game success proves bittersweet "
    },
    {
        "content": "* Shares fall 8 pct in extended trading   (Adds details  CFO quote)",
        "date": "01282016",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "UPDATE 2-EA forecast disappoints as Star Wars' game success proves bittersweet "
    },
    {
        "content": "* Q3 GAAP total net revenue $1.07 billion versus $1.13 billion last year; Q3 non-GAAP total net revenue $1.8 billion versus $1.43 billion last year",
        "date": "01282016",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "BRIEF-Electronic Arts reports 3rd-qtr non-GAAP EPS of $1.83 "
    },
    {
        "content": "Jan 28 Electronic Arts Inc posted an 26.3 percent rise in revenue for the holiday quarter and raised its full-year profit and sales forecasts slightly  boosted by strong sales of \"Star Wars: Battlefront\".",
        "date": "01282016",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "Electronic Arts posts higher revenue  raises full-year forecast "
    },
    {
        "content": "SAN FRANCISCO  Dec 15 Early praise for the newest installment of \"Star Wars\" gave a boost to shares of Walt Disney and Electronic Arts  which recently launched a videogame based on the hugely popular space opera.",
        "date": "12152015",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "Early praise for Star Wars awakens the Force in shares of Disney  EA "
    },
    {
        "content": "Nov 23 Electronic Arts Inc has little to fear from retailer GameStop Corp's warning about weak sales for EA's just-released \"Star Wars\" title  with analysts agreeing it was too early to predict its success or failure.",
        "date": "11242015",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "GameStop's warning on EA's Star Wars game seen premature "
    },
    {
        "content": "Electronic Arts Inc raised its sales forecast for its highly anticipated videogame \"Star Wars: Battlefront\" as the company looks to tap into the loyal fan base of the iconic movie franchise.",
        "date": "10292015",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "Electronic Arts raises sales forecast for Star Wars' videogame "
    },
    {
        "content": "* To sell 13 mln \"Star Wars: Battlefront\" units in fiscal 2016",
        "date": "10292015",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "UPDATE 2-Electronic Arts raises sales forecast for Star Wars' videogame "
    },
    {
        "content": "July 31 Electronic Arts Inc is back from the \"dark side\".",
        "date": "07312015",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "With Star Wars relaunch  the Force is with Electronic Arts "
    },
    {
        "content": "Electronic Arts Inc  raised its full-year profit and sales forecasts  counting on the highly-anticipated launches of \"Star Wars: Battlefront\" and \"Need for Speed\" titles  but the forecast fell short of analysts' estimate.",
        "date": "07302015",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "EA forecast 'conservative'  despite upcoming Star Wars launch "
    },
    {
        "content": "July 30 Electronic Arts Inc raised its full-year profit and sales forecasts  counting on the highly-anticipated launches of \"Star Wars: Battlefront\" and \"Need for Speed\" titles  but the forecast fell short of analysts' estimate.",
        "date": "07302015",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "UPDATE 2-EA forecast \"conservative\"  despite upcoming Star Wars launch "
    },
    {
        "content": "* Q1 earnings per share view $0.03  revenue view $652.0 million -- Thomson Reuters I/B/E/S",
        "date": "07302015",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "BRIEF-Electronic Arts Q1 GAAP earnings $1.32 per share "
    },
    {
        "content": "July 30 Electronic Arts Inc  publisher of the \"FIFA\" and \"Madden NFL\" video games  posted a 10.6 percent fall in first-quarter adjusted revenue in the absence of major releases in the period.",
        "date": "07302015",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "Video game publisher Electronic Arts' revenue falls 10.6 pct "
    },
    {
        "content": "SAO PAULO Brazilian soccer legend Pelé has undergone back surgery  a close aide told Reuters on Saturday  the latest in a series of recent health problems afflicting the 74-year-old former player.",
        "date": "07182015",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "Soccer legend Pelé undergoes back surgery in latest health scare "
    },
    {
        "content": "May 6 U.S. stocks turned negative on Wednesday  after opening slightly higher  as disappointing data  including weaker-than-expected private jobs numbers  fueled concerns about the economy's potential to rebound from a first-quarter slump.",
        "date": "05062015",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "REFILE-US STOCKS-Wall St gives up initial gains as weak private job data weighs "
    },
    {
        "content": "* Futures up: Dow 52 pts  S&P 4.5 pts  Nasdaq 0.5 pts   (Adds details  comment  updates prices)",
        "date": "05062015",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "US STOCKS-Wall St set to open up as investors shrug off weak jobs data "
    },
    {
        "content": "Video game publisher Electronic Arts Inc  known for titles such as \"FIFA\" and \"Madden NFL\"  posted better-than-expected quarterly earnings and revenue on Tuesday  helped by strong digital sales and the release of \"Battlefield Hardline\".",
        "date": "05052015",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "Game publisher EA's profit  revenue trump estimates "
    },
    {
        "content": "A federal judge has dismissed a securities fraud lawsuit accusing videogame-maker Electronic Arts of misleading investors about the prospects for its \"Battlefield 4\" game  which was beset with glitches during its 2013 launch.",
        "date": "05042015",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "Citing 'puffery'  judge tosses Battlefield 4 game glitches case "
    },
    {
        "content": "* Forecasts full-year adj profit $2.75/shr vs est $2.64   (Adds CFO  analyst comments)",
        "date": "05052015",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "UPDATE 2-Game publisher EA's profit  revenue trump estimates "
    },
    {
        "content": "* Q4 earnings per share $1.19; Q4 adjusted earnings per share $0.39; Q4 total GAAP revenue $1.19 billion versus $1.12 billion; Q4 non-GAAP total revenue $896 million versus $914 million",
        "date": "05052015",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "BRIEF-Electronic Arts Inc reports Q4 adjusted earnings per share of $0.39 "
    },
    {
        "content": "May 5 Video game publisher Electronic Arts Inc   known for titles such as \"FIFA\" and \"Madden NFL\"  posted a 5.5 percent rise in quarterly revenue  helped by growth in its digital business  which includes software distributed through direct downloads.",
        "date": "05052015",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "Video game publisher Electronic Arts' revenue rises 5.5 pct "
    },
    {
        "content": "Feb 3 Take-Two Interactive Software Inc   the publisher of video games such as \"Grand Theft Auto\"  said it expects a slate of unreleased games to drive sales and raised its revenue and profit forecast for the full year.",
        "date": "02042015",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "CORRECTED-UPDATE 2-'Grand Theft Auto' publisher Take-Two ups full-year profit forecast "
    },
    {
        "content": "** Video games retailer Game Digital rises as much as 5 pct  top riser on FTSE 250",
        "date": "01282015",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "BUZZ-Game Digital: taking cues from EA results "
    },
    {
        "content": "Electronic Arts Inc   publisher of the \"FIFA\" and \"Madden NFL\" video games  posted better-than-expected quarterly profit and revenue  helped by growth in digital revenue and strong sales of its sports titles.",
        "date": "01272015",
        "name": "Electronic Arts Inc",
        "news_type": "topStory",
        "symbol": "EA",
        "title": "Strong console sales boosts demand for Electronic Arts games "
    },
    {
        "content": "Jan 27 Electronic Arts Inc  publisher of the \"FIFA\" and \"Madden NFL\" video games  posted better-than-expected quarterly profit and revenue  helped by growth in digital revenue and strong sales of its sports titles.",
        "date": "01272015",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "UPDATE 2-Strong console sales boosts demand for Electronic Arts games "
    },
    {
        "content": "* Q3 GAAP total net revenue $1.13 billion versus $808 million last year; Q3 non-GAAP total net revenue $1.43 billion versus $1.57 billion last year; Q3 GAAP earnings per share $0.44; Q3 non-GAAP earnings per share $1.22",
        "date": "01272015",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "BRIEF-Electronic Arts reports Q3 non-GAAP earnings per share $1.22 "
    },
    {
        "content": "Jan 27 Electronic Arts Inc  publisher of the \"FIFA\" and \"Madden NFL\" video games  posted a near 40 percent rise in quarterly revenue  helped by strong sales of its sports titles.",
        "date": "01272015",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "Games publisher Electronic Arts' revenue rises almost 40 pct "
    },
    {
        "content": "Jan 6 A federal appeals court on Tuesday said Electronic Arts Inc must face a lawsuit by former National Football League players that accuses the video game maker of using their likenesses in the Madden NFL series without permission or proper compensation.",
        "date": "01062015",
        "name": "Electronic Arts Inc",
        "news_type": "normal",
        "symbol": "EA",
        "title": "Electronic Arts must face ex-NFL players' lawsuit over video games "
    }
]