[
    {
        "content": "* ‍BEGINNING MONDAY  EBAY WILL MATCH PRICES ON SOME BLACK FRIDAY DEALS FROM OTHER MAJOR RETAILERS​ Source text for Eikon: Further company coverage:",
        "date": "11132017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-EBAY SAYS TO MATCH PRICES ON SOME BLACK FRIDAY DEALS FROM OTHER MAJOR RETAILERS​ "
    },
    {
        "content": "EBay Inc warned Wall Street on Wednesday that profit this quarter could fall below analysts' estimates as it invests in marketing and a revamped website to attract more shoppers  sending shares down more than 5 percent in after-hours trade.",
        "date": "10182017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "EBay's profit forecast disappoints  shares fall "
    },
    {
        "content": "Oct 18 EBay Inc warned Wall Street on Wednesday that profit this quarter could fall below analysts' estimates as it invests in marketing and a revamped website to attract more shoppers  sending shares down more than 5 percent in after-hours trade.",
        "date": "10182017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 3-EBay's profit forecast disappoints  shares fall "
    },
    {
        "content": "* Sees FY 2017 non-GAAP earnings per share $1.99 to $2.01 from continuing operations",
        "date": "10182017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "BRIEF-EBay reports Q3 non-GAAP EPS of $0.48 from continuing operations "
    },
    {
        "content": "* EBay Inc-apppointment of Adriane Brown and Diana Farrell to board on Sept 19 increases size of co's board of directors from 12 to 14 - SEC filing Source text: (http://bit.ly/2xm7L9M) Further company coverage:",
        "date": "09212017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-EBay appoints Adriane Brown and Diana Farrell to board "
    },
    {
        "content": "* Agritek Holdings Inc announces acquisition of Performance Nutrition California retail location with eBay and Amazon online stores adding in excess of $500 000 in additional gross revenue and product sales for company Source text for Eikon: Further company coverage:",
        "date": "09202017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Agritek Holdings acquires Performance Nutrition California retail location "
    },
    {
        "content": "* eBay appoints Adriane Brown and Diana Farrell to its board of directors",
        "date": "09192017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-eBay appoints Adriane Brown  Diana Farrell to board "
    },
    {
        "content": "* eBay Inc - ‍Appointed Scott Cutler  Jay Lee and Jooman Park to new regional leadership roles​ Source text for Eikon: Further company coverage:",
        "date": "08212017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-eBay announces changes to its regional leadership team "
    },
    {
        "content": "* Paulson & Co dissolves share stake in Ebay inc - sec filing",
        "date": "08142017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Paulson & Co dissolves share stake in eBay  ups share stake in Monsanto "
    },
    {
        "content": "NEW YORK  Aug 10 Payments firm PayPal Holdings Inc has agreed to acquire online lending company Swift Financial in a bid to expand its business that provides working capital to merchants.",
        "date": "08102017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "PayPal to expand lending offering with acquisition "
    },
    {
        "content": "North Korea examines plans for a missile strike on Guam  authorities investigate whether a pesticide made by Monsanto and BASF has led to the damage of thousands of acres of U.S. farmland  and Fidelity allows clients to view their holdings of bitcoin and other cryptocurrencies.",
        "date": "08092017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Wednesday Morning Briefing "
    },
    {
        "content": "* Announced Image Search and Find It On eBay  for shoppers to use pictures instead of words to search eBay's catalog​",
        "date": "07262017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-eBay ‍announces Image Search and Find It On eBay features "
    },
    {
        "content": "July 26 Digital payments company PayPal Holdings Inc raised its earnings outlook on Wednesday after reporting better-than-expected quarterly results  driven by growth in users and transaction volumes.",
        "date": "07262017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 2-PayPal raises 2017 forecasts on growth in users  payment volumes "
    },
    {
        "content": "EBay Inc  warned on Thursday that adjusted profit this quarter could fall below analysts' estimates  as it continues to invest in marketing and revamping its platforms to attract more shoppers  sending its shares down more than 5 percent.",
        "date": "07202017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "EBay shares fall on tepid adjusted profit forecast "
    },
    {
        "content": "July 20 EBay Inc warned on Thursday that adjusted profit this quarter could fall below analysts' estimates  as it continues to invest in marketing and revamping its platforms to attract more shoppers  sending its shares down more than 5 percent.",
        "date": "07202017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 3-EBay shares fall on tepid adjusted profit forecast "
    },
    {
        "content": "* Q2 non-GAAP earnings per share $0.45 from continuing operations",
        "date": "07202017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "BRIEF-Ebay reports Q2 non-GAAP earnings of $0.45/shr from continuing operations "
    },
    {
        "content": "July 20 EBay Inc on Thursday reported a nearly 94 percent fall in quarterly profit  hurt by higher expenses as well as income tax provisions.",
        "date": "07202017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Ebay's profit plunges 94 pct "
    },
    {
        "content": "* Ebay and Shopify extend merchant reach with new sales channel",
        "date": "07132017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Ebay  Shopify extend merchant reach with new sales channel "
    },
    {
        "content": "FRANKFURT \"Millionaire\" online businesses selling on ecommerce site eBay have jumped 50 percent in key international markets Britain and Germany in the last four years  despite currency swings that have slowed growth outside the United States.",
        "date": "07112017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "eBay 'millionaire' sellers in Germany and UK grow 50 percent in four years "
    },
    {
        "content": "FRANKFURT  July 11 \"Millionaire\" online businesses selling on ecommerce site eBay have jumped 50 percent in key international markets Britain and Germany in the last four years  despite currency swings that have slowed growth outside the United States.",
        "date": "07112017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "RPT-eBay 'millionaire' sellers in Germany and UK grow 50 pct in 4 years "
    },
    {
        "content": "June 21 EBay Inc on Wednesday said it would match top competitors' prices for a number of popular products in an effort to lure customers.",
        "date": "06212017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "EBay to match some rivals' prices in bid to attract shoppers "
    },
    {
        "content": "    By Jonathan Stempel     June 10 An anonymous fan of Warren Buffett agreed to pay $2 679 001 at an online charity auction to have lunch with the billionaire chairman of Berkshire Hathaway Inc         .     The winning bid came in the closing seconds of the five-day eBay          auction  which drew 41 bids before ending on Friday night. It was lower than the record $3 456 789 bid in similar auctions in 2012 and 2016.     Money will go to Glide  a San Francisco charity that provide",
        "date": "06102017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Warren Buffett charity lunch sells for $2.68 million "
    },
    {
        "content": "* Ebay inc. Prices $2.5 billion senior unsecured notes offering",
        "date": "05302017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-eBay prices $2.5 bln senior unsecured notes offering "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  May 30 (Fitch) Fitch Ratings has assigned a 'BBB' rating to eBay  Inc.'s (eBay) issuance of benchmark-size multi-tranche senior notes with three- to 10-year maturities. eBay intends to use the proceeds for repayment of existing notes due 2017  and general corporate purposes which could include M&A and share buybacks. Fitch's action affects $11 billion of total debt including the $2 billion undrawn revolving credit facility (RCF",
        "date": "05302017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Fitch Rates eBay's Senior Notes 'BBB'; Outlook Stable "
    },
    {
        "content": "* EBay Inc files preliminary prospectus supplement with U.S. SEC related to potential 5-part notes offering - SEC filing Source text: (http://bit.ly/2qCaiI8) Further company coverage:",
        "date": "05302017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "BRIEF-EBay files preliminary prospectus supplement related to potential 5-part notes offering "
    },
    {
        "content": "* Soros Fund Management takes share stake of 3 900 shares in Eli Lilly & Co",
        "date": "05152017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Soros Fund Management dissolves share stake in Ebay Inc "
    },
    {
        "content": "* Truecar partners with eBay motors to launch a new car buying program",
        "date": "05102017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Truecar partners with eBay Motors to launch a new car buying program "
    },
    {
        "content": "* ChannelAdvisor corp - announced a new strategic partnership with eBay Source text for Eikon: Further company coverage:",
        "date": "04252017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Channeladvisor Corp announces strategic partnership with eBay "
    },
    {
        "content": "April 26 PayPal Holdings Inc raised its earnings outlook on Wednesday after reporting higher-than-expected quarterly profit resulting from an increase in payment processing volumes and user growth.",
        "date": "04262017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "REFILE-UPDATE 2-PayPal offers positive outlook  beats expectations "
    },
    {
        "content": "EBay Inc  on Wednesday forecast second-quarter profit that fell short of analysts' estimates  as it spends heavily on revamping and marketing its e-commerce platform amid stiff competition from much larger rival Amazon.com Inc .",
        "date": "04192017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "EBay's second-quarter profit forecast falls short of estimates "
    },
    {
        "content": "April 19 EBay Inc on Wednesday forecast second-quarter profit that fell short of analysts' estimates  as it spends heavily on revamping and marketing its e-commerce platform amid stiff competition from much larger rival Amazon.com Inc.",
        "date": "04192017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 3-EBay's 2nd-qtr profit forecast falls short of estimates "
    },
    {
        "content": "* Q1 non-gaap earnings per share $0.49 from continuing operations",
        "date": "04192017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "BRIEF-Ebay reports Q1 earnings per diluted share from continuing operations $0.94 "
    },
    {
        "content": "April 19 Ebay Inc reported a 3.7 percent increase in quarterly revenue on Wednesday as more shoppers visited its e-commerce websites and efforts to revamp its platform paid off.",
        "date": "04192017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Ebay's revenue rises 3.7 pct "
    },
    {
        "content": "MUMBAI  April 10 India's top e-commerce firm Flipkart  has raised $1.4 billion from Tencent Holdings Ltd  Microsoft Corp and eBay Inc   the company said in a statement on Monday.",
        "date": "04102017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "RPT-India's Flipkart raises $1.4 bln from Tencent  eBay  Microsoft "
    },
    {
        "content": "MUMBAI  April 10 India's top e-commerce firm Flipkart  has raised $1.4 billion from Tencent Holdings Ltd  Microsoft Corp and eBay Inc   the company said in a statement on Monday.",
        "date": "04102017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "India's Flipkart raises $1.4 bln from Tencent  eBay  Microsoft "
    },
    {
        "content": "* Flipkart announces investment of $1.4 billion from consortium of global blue chip tech companies",
        "date": "04102017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "BRIEF-India's Flipkart raises $1.4 bln in its biggest ever funding round "
    },
    {
        "content": "* eBay and Flipkart sign exclusive agreement to jointly address the eCommerce market opportunity in India",
        "date": "04102017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "BRIEF-eBay to invest $500 mln in Flipkart  sell eBay.in business "
    },
    {
        "content": "* Ebay Inc- CEO Devin N. Wenig's 2016 total compensation $15.9 million versus $14.5 million in 2015 - sec filing",
        "date": "03312017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Ebay Inc- CEO Devin N. Wenig's 2016 total compensation $15.9 mln vs $14.5 mln in 2015 "
    },
    {
        "content": "* \"At launch  eBay will guarantee delivery in 3 days or less on 20 million eligible items\"  Source text: (http://prn.to/2ml8fKW) Further company coverage:   (Bengaluru Newsroom: +91 806 749 1136)",
        "date": "03202017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-EBay says to roll out guaranteed delivery for 20 mln items "
    },
    {
        "content": "* Ebay Advertising - announcing a shift in advertising strategy to focus on first-party data and offerings",
        "date": "03162017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Ebay Advertising says announcing a shift in advertising strategy "
    },
    {
        "content": "SAN FRANCISCO  Feb 27 ServiceNow Inc said it had hired former eBay Inc executive John Donahoe to be chief executive  replacing longtime CEO Frank Slootman starting in April  a surprise move that sent shares of the enterprise software lower on Monday.",
        "date": "02272017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "ServiceNow appoints former eBay executive as CEO "
    },
    {
        "content": "HARARE  Feb 24 When Kelvin Tarumbwa pulled out a wad of $20 notes at a Harare furniture retailer this week to pay for an office chair  the shop assistant was quick to offer a discount on the advertised price.",
        "date": "02242017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "In Zimbabwe  king dollar drives backdoor devaluation "
    },
    {
        "content": "* aeropost.com  ebay partner to provide shoppers in Latin America access to eBay.com listings by purchasing them on aeropost.com  Source text for Eikon:  Further company coverage:",
        "date": "02132017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-eBay and aeropost.com enter expanded partnership "
    },
    {
        "content": " (This version of the February 6 story corrects paragraph 1 to drop reference to improper tax accounting)",
        "date": "02072017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "EBay finds 'material weakness' in controls over accounting for tax "
    },
    {
        "content": "* Ebay Inc files for potential mixed shelf offering; size undisclosed   Source text:(http://bit.ly/2kLHn4U) Further company coverage:",
        "date": "02062017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Ebay Inc files for potential mixed shelf offering "
    },
    {
        "content": "EBay Inc  reported a 3.1 percent rise in revenue for the fourth-quarter holiday period  offering signs of improvement at the company's traditional marketplace business and sending shares up more than 8 percent in extended trading on Wednesday.",
        "date": "01262017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "EBay holiday-quarter revenue up 3.1 percent  shares jump "
    },
    {
        "content": "Jan 25 EBay Inc reported a 3.1 percent rise in revenue for the fourth-quarter holiday period  offering signs of improvement at the company's traditional marketplace business and sending shares up more than 8 percent in extended trading on Wednesday.",
        "date": "01262017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 3-EBay holiday-quarter revenue up 3.1 pct  shares jump "
    },
    {
        "content": "* Sees full year 2017 net revenue between $9.3 billion and $9.5 billion",
        "date": "01252017",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-eBay reports fourth quarter and full year 2016 results "
    },
    {
        "content": "Jan 25 EBay Inc reported 3.1 percent rise in quarterly revenue for the holiday period  offering a bright spot for investors as the company's revamped online marketplace attracted more buyers and helped sell more products.",
        "date": "01252017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "EBay holiday quarter revenue rises 3.1 pct "
    },
    {
        "content": "Jan 20 Diary of U.S. (.SPX) corporate earnings for the week ahead.          ** Please note - All times given are in U.S. EST unless otherwise stated **         U.S. EARNINGS    Start Date     Start Time   RIC       Company                          Event Name  23-Jan-2017    BMO          MCD.N     McDonald's Corp                  Q4 2016 McDonald's Corp Earnings Release  23-Jan-2017    BMO          HAL.N     Halliburton Co                   Q4 2016 Halliburton Co Earnings Release  23-",
        "date": "01252017",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "RPT-DIARY-U.S. EARNINGS WEEK AHEAD "
    },
    {
        "content": "* Soros Fund Management dissolves share stake in General Motors - SEC filing",
        "date": "11142016",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Soros Fund Management takes share stake in Alphabet  dissolves stake in GM - SEC filing "
    },
    {
        "content": "* Executed a co-marketing agreement with ebay mexico to release a new digital auto-classifieds product in mexico",
        "date": "11092016",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Latam Autos executes agreement with Ebay Mexico "
    },
    {
        "content": "* Ebay Inc - for Q4  company expects GAAP earnings per diluted share from continuing operations in the range of $1.15 - $1.25 -  SEC filing",
        "date": "11032016",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Ebay says expects Q4 EPS from continuing operations between $1.150-$1.25 - SEC filing "
    },
    {
        "content": "* Ebay Inc recommends shareholders reject \"mini-tender\" offer by TRC capital corporation",
        "date": "11022016",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Ebay recommends shareholders reject \"mini-tender\" offer by TRC capital corporation "
    },
    {
        "content": "* Fedex office and eBay have teamed up to bring ebay valet drop-off program to more than 1 600 fedex office retail stores  Source text for Eikon:  Further company coverage: [EBAY.O FDX.N]",
        "date": "10202016",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Fedex Office and eBay team up to help consumers sell items online  make money "
    },
    {
        "content": "EBay Inc  forecast quarterly revenue and profit for the crucial holiday shopping season largely below market estimates  sending its shares down 8 percent in extended trading.",
        "date": "10192016",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "Ebay's holiday-quarter forecast disappoints; shares slump "
    },
    {
        "content": "Oct 19 EBay Inc forecast quarterly revenue and profit for the crucial holiday shopping season largely below market estimates  sending its shares down 8 percent in extended trading.",
        "date": "10192016",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 2-Ebay's holiday-quarter forecast disappoints; shares slump "
    },
    {
        "content": "* Q3 non-GAAP earnings per share $0.45 from continuing operations",
        "date": "10192016",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "BRIEF-eBay Q3 GAAP earnings per share $0.36 from continuing operations "
    },
    {
        "content": "Oct 19 Ebay Inc reported a 5.6 percent rise in quarterly revenue on Wednesday as changes to its platform attracted more buyers.",
        "date": "10192016",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Ebay revenue rises 5.6 pct "
    },
    {
        "content": "* Partners with CaribShopper and expands into Caribbean  Source text for Eikon:  Further company coverage:",
        "date": "08162016",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Ebay partners with CaribShopper and expands into Caribbean "
    },
    {
        "content": "July 21 PayPal Holdings Inc moved to extend the reach of its online payments business through a deal with Visa Inc that is expected to boost the revenue and number of users of the money-transfer service.",
        "date": "07222016",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 3-PayPal seeks to extend reach with Visa tie-up "
    },
    {
        "content": "Online retailer eBay Inc reported better-than-expected quarterly revenue and raised its sales forecast for the year as efforts to revamp its online marketplace start to pay off.",
        "date": "07202016",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "EBay beats revenue estimate  bumps up forecasts "
    },
    {
        "content": "* Shares up 8.2 pct after market   (Adds details from conference call)",
        "date": "07202016",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 2-EBay beats revenue estimate  bumps up forecasts "
    },
    {
        "content": "* Board approves additional $2.5 billion stock repurchase authorization",
        "date": "07202016",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "BRIEF-Ebay reports quarterly GAAP earnings per share $0.38 "
    },
    {
        "content": "July 20 EBay Inc reported a 5.7 percent increase in quarterly revenue as its efforts to revamp its online marketplace start to pay off.",
        "date": "07202016",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "EBay revenue rises 5.7 pct "
    },
    {
        "content": "* Separate proposal seeks to make postage more affordable   (Adds eBay  music industry comments)",
        "date": "05252016",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 2-EU seeks to make it easier to buy online from other countries "
    },
    {
        "content": "* Acquisition of ticketbis is not expected to impact q2 2016 or full year 2016 guidance that ebay provided most recently",
        "date": "05242016",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Ebay announced an agreement to acquire Ticketbis "
    },
    {
        "content": "* EU to ban online discrimination based on country of residence",
        "date": "05252016",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "EU seeks to make buying online abroad easier  postage cheaper "
    },
    {
        "content": "* Third Point Llc  Takes Share Stake Of 1.5 Mln Shares In Twenty First Centy Fox Inc - Sec filing",
        "date": "05132016",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Third Point dissolves share stake in eBay  cuts in Time Warner "
    },
    {
        "content": "EBay Inc reported better-than-expected quarterly earnings on Tuesday and raised its full-year revenue forecast as a revamped shopping platform attracted more buyers  mitigating growth concerns following its spinoff of PayPal Holdings Inc.",
        "date": "04262016",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "EBay attracts more shoppers  earnings beat expectations "
    },
    {
        "content": "April 26 EBay Inc reported better-than-expected quarterly earnings on Tuesday and raised its full-year revenue forecast as a revamped shopping platform attracted more buyers  mitigating growth concerns following its spinoff of PayPal Holdings Inc.",
        "date": "04262016",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 2-EBay attracts more shoppers  earnings beat expectations "
    },
    {
        "content": "April 26 EBay Inc reported a 3.7 percent increase in quarterly revenue as strong demand more than made up for the impact of a strong dollar.",
        "date": "04262016",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "EBay's revenue rises 3.7 pct "
    },
    {
        "content": "* Store to  feature ebay branded quality boxes  envelopes and tape; more items to be added over time",
        "date": "04052016",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Ebay to launch new shipping supplies store "
    },
    {
        "content": "* Cto stephen fisher's  2015 total compensation was $7.2 million",
        "date": "03232016",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-EBay CEO Wenig's 2015 total compensation $14.5 mln "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  February 23 (Fitch) Fitch Ratings has affirmed the ratings for eBay   Inc. (eBay)  including the long-term Issuer Default Rating (IDR) at 'BBB' and  short-term IDR at 'F2'. Fitch has also assigned a 'BBB' rating to eBay's $750  million 40-year senior unsecured notes issuance. Pro forma for the issuance   Fitch's actions affect $9.5 billion of total debt including the $2 billion  undrawn revolving credit facility (RCF). The Rati",
        "date": "02232016",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "Fitch Affirms eBay at 'BBB'; Outlook Stable "
    },
    {
        "content": "Jan 28 EBay Inc stock plunged 14 percent in premarket trading after a disappointing showing in the holiday quarter and a weak forecast suggested that overwhelming competition from Amazon.com Inc was gutting the one-time Wall Street favorite.",
        "date": "01282016",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "EBay shares sink as strong dollar  competition hit forecast "
    },
    {
        "content": "Jan 28 EBay Inc's shares plunged 13 percent on Thursday  after a disappointing holiday-quarter performance and a weak forecast suggested that overwhelming competition from Amazon.com Inc was gutting the one-time Wall Street favorite.",
        "date": "01282016",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 1-EBay shares sink as strong dollar  competition hit forecast "
    },
    {
        "content": "Jan 27 EBay Inc reported no growth in revenue in the holiday quarter  during which it faced intense competition from bigger e-commerce rival Amazon.com Inc  as well as traditional retailers.",
        "date": "01272016",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "REFILE-EBay fails to post revenue growth in holiday quarter "
    },
    {
        "content": "EBay Inc forecast weaker-than-expected revenue and profit for the current quarter and full year  as the e-commerce company struggles against a strong dollar while trying to revamp its core marketplace business.",
        "date": "01282016",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "EBay's disappointing forecast fuels stock decline "
    },
    {
        "content": "Jan 27 EBay Inc forecast weaker-than-expected revenue and profit for the current quarter and full year  as the e-commerce company struggles against a strong dollar while trying to revamp its core marketplace business.",
        "date": "01282016",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 3-EBay's disappointing forecast fuels stock decline "
    },
    {
        "content": "Jan 22 Diary of U.S. corporate earnings for the week ahead.    ** This Diary does not provide the EPS estimate figures. EPS figures can be retrieved from Eikon.      Steps in Eikon to retrieve the EPS estimate:-     Eikon Indicator-> Equities Guide-> Top Indices-> S&P 500-> Events-> Select Event types-> Select the company-> Estimates              ** Please Note - All times given are in U.S. EST unless otherwise stated **            U.S. EARNINGS    -   Start Date",
        "date": "01222016",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "DIARY-U.S. EARNINGS WEEK AHEAD "
    },
    {
        "content": "NEW YORK  Dec 17 Electronic payment company PayPal Holdings Inc said on Thursday it will increase its paid maternity and sick leave programs and offer time off for U.S. employees to volunteer and care for ill family members.",
        "date": "12172015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "PayPal boosts maternity leave  sick time for U.S. employees "
    },
    {
        "content": "* Sohn Conference: Bodenholm Capital Co-founder Per Johansson Says likes Ebay for spin-off potential",
        "date": "12032015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-Bodenholm Capital's Johansson says backs Ebay "
    },
    {
        "content": "* Sohn Conference: Bodenholm Capital Co-founder Per Johansson Says Likes Ebay for spin-off potential",
        "date": "12032015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "BRIEF-Bodenholm Capital's Johansson says backs Ebay  short ACS "
    },
    {
        "content": "Nov 23 Activist investor Carl Icahn disclosed a stake in Xerox Corp and called the printer and copier maker's shares \"undervalued \" sending the stock up 7.6 percent in extended trade.",
        "date": "11242015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 3-Icahn takes stake in Xerox  calls shares 'undervalued' "
    },
    {
        "content": "NEW YORK  Nov 16 Billionaire activist investor Carl Icahn swapped his entire equity stake in eBay Inc  for the same number of shares in PayPal Holdings Inc in the third quarter  regulatory filings showed on Monday.",
        "date": "11162015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "Icahn exits eBay stake  opts for PayPal after spinoff "
    },
    {
        "content": "NEW YORK Billionaire activist investor Carl Icahn swapped his entire equity stake in eBay Inc  for the same number of shares in PayPal Holdings Inc in the third quarter  regulatory filings showed on Monday.",
        "date": "11172015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "Icahn exits eBay stake  opts for PayPal after spinoff "
    },
    {
        "content": "* Shares fall 5.6 pct after market   (Adds details  forecast  analyst comments; updates shares)",
        "date": "10282015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "UPDATE 2-PayPal's China  Europe transaction volumes hit by strong dollar "
    },
    {
        "content": "EBay Inc reported a stronger-than-expected quarterly profit and raised its full-year adjusted profit forecast  helping to allay concerns about the company's prospects following the spinoff of PayPal  its main engine of growth. | Video ",
        "date": "10212015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "EBay's profit beat shows there's life after PayPal "
    },
    {
        "content": "* Shares up 8.5 pct after-hours   (Adds details and comments from conference call)",
        "date": "10212015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 3-EBay's profit beat shows there's life after PayPal "
    },
    {
        "content": "Oct 21 EBay Inc  facing intensifying competition from Amazon.com Inc as well as from traditional retailers  reported a 2.4 percent fall in revenue in its first quarterly results since the spinoff of its PayPal payments business.",
        "date": "10212015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Ebay quarterly revenue falls 2.4 pct "
    },
    {
        "content": "SEOUL Kakao Corp  the operator of South Korea's largest mobile messaging app  said Tencent Holdings Ltd and eBay Inc have joined its bid for a new South Korean Internet bank license.",
        "date": "10012015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "Tencent  eBay join Kakao bid for new South Korean Internet bank "
    },
    {
        "content": "SEOUL  Oct 1 Kakao Corp  the operator of South Korea's largest mobile messaging app  said Tencent Holdings Ltd and eBay Inc have joined its bid for a new South Korean Internet bank license.",
        "date": "10012015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Tencent  eBay join Kakao bid for new S.Korean Internet bank "
    },
    {
        "content": "Sept 8 Ebay Inc released an upgrade to its mobile app for iOS and Android that provides more information to first-time sellers and includes a new dashboard for frequent sellers.",
        "date": "09082015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Ebay upgrades app for iOS and Android "
    },
    {
        "content": "MUMBAI/TAIPEI  Aug 18 E-commerce company eBay Inc has sold a portion of its stake in Indian online marketplace Snapdeal and will focus on boosting its own business in the country  it said on Tuesday.",
        "date": "08182015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "eBay cuts stake in India's Snapdeal; Foxconn unit invests $200 mln "
    },
    {
        "content": "Aug 17 Luxury hotel owner Strategic Hotels & Resorts Inc said it was exploring strategic alternatives  including a sale  sending its shares up 4.5 percent in premarket trading.",
        "date": "08172015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Luxury hotel owner Strategic Hotels to explore sale "
    },
    {
        "content": "NEW YORK (IFR) - Standard & Poor's said on Monday it had lowered its credit rating on internet giant eBay Inc. by two notches to 'BBB+' from 'A' following its split from PayPal.",
        "date": "07202015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "S&P cuts eBay rating after PayPal spin-off "
    },
    {
        "content": "PayPal Holdings Inc  shares jumped as much as 11 percent in their highly anticipated return to the Nasdaq after more than a decade in eBay Inc's  fold  valuing the digital payment processor at about $52 billion.",
        "date": "07202015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "PayPal returns to market with $52 billion valuation "
    },
    {
        "content": "July 20 PayPal Holdings Inc shares jumped as much as 11 percent in their highly anticipated return to the Nasdaq after more than a decade in eBay Inc's  fold  valuing the digital payment processor at about $52 billion.",
        "date": "07202015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 2-PayPal returns to market with $52 bln valuation "
    },
    {
        "content": "E-commerce company eBay Inc  reported a 7 percent jump in net revenue  boosted by higher demand in the PayPal Holdings Inc  payments business it plans to spin off on Friday. | Video ",
        "date": "07172015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "Ebay revenue jumps 7 percent in last push from PayPal "
    },
    {
        "content": "NEW YORK - Wall Street ended stronger on Thursday  with the Nasdaq up more than 1 percent at a record high after earnings reports from eBay and Netflix boosted optimism.",
        "date": "07172015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "India Morning Call-Global Markets "
    },
    {
        "content": "E-commerce company eBay Inc  said it was selling its enterprise business to a consortium led by private equity firm Permira for $925 million  as it streamlines its operations ahead of the separation from PayPal Holdings Inc . | Video ",
        "date": "07162015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "EBay sells enterprise unit ahead of PayPal split "
    },
    {
        "content": "E-commerce company eBay Inc  reported a 7 percent jump in net revenue  boosted by higher demand in the PayPal Holdings Inc  payments business it plans to spin off on Friday. | Video ",
        "date": "07162015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Ebay revenue jumps 7 percent in last push from PayPal "
    },
    {
        "content": "* Indexes up: Dow 0.39 pct  S&P 0.8 pct  Nasdaq 1.26 pct   (Updates to close  adds detail)",
        "date": "07162015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "US STOCKS-Wall St rises; eBay  Netflix push Nasdaq to record high "
    },
    {
        "content": "* Indexes up: Dow 0.23 pct  S&P 0.64 pct  Nasdaq 1.03 pct   (Updates to mid-afternoon)",
        "date": "07162015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "US STOCKS-Wall St rises as eBay  Netflix push Nasdaq toward record "
    },
    {
        "content": "* Indexes up: Dow 0.23 pct  S&P 0.64 pct  Nasdaq 1 pct   (Updates to early afternoon)",
        "date": "07162015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "US STOCKS-Wall St gains as bellwethers post strong earnings reports "
    },
    {
        "content": "* Indexes up: Dow 0.2 pct  S&P 0.66 pct  Nasdaq 1.05 pct   (Adds details  comment  updates prices)",
        "date": "07162015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "US STOCKS-Wall St jumps on strong earnings report "
    },
    {
        "content": "* Indexes up: Dow 0.25 pct  S&P 0.56 pct  Nasdaq 0.65 pct   (Updates to open)",
        "date": "07162015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "US STOCKS-Wall St opens higher on strong quarterly reports "
    },
    {
        "content": "July 16 E-commerce company eBay Inc  said it was selling its enterprise business to a consortium led by private equity firm Permira for $925 million  as it streamlines its operations ahead of the separation from PayPal Holdings Inc.",
        "date": "07162015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 3-EBay sells enterprise unit ahead of PayPal split "
    },
    {
        "content": "* Futures up: Dow 44 pts  S&P 8 pts  Nasdaq 18 pts   (Adds details  comment  updates prices)",
        "date": "07162015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "US STOCKS-Wall St set to open up on strong quarterly reports "
    },
    {
        "content": "Private equity firm Thomas H. Lee Partners LP is in advanced talks to acquire the enterprise business of eBay Inc  for close to $1 billion  according to people familiar with the matter.",
        "date": "07092015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "Thomas H. Lee in the lead to buy eBay's enterprise unit: sources "
    },
    {
        "content": "July 9 Private equity firm Thomas H. Lee Partners LP is in advanced talks to acquire the enterprise business of eBay Inc for close to $1 billion  according to people familiar with the matter.",
        "date": "07092015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 1-Thomas H. Lee in the lead to buy eBay's enterprise unit -sources "
    },
    {
        "content": "July 9 Private equity firm Thomas H. Lee Partners LP is in advanced talks to acquire the enterprise business of eBay Inc for close to $1 billion  according to people familiar with the matter.",
        "date": "07092015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Thomas H. Lee in the lead to buy eBay's enterprise unit -sources "
    },
    {
        "content": "PayPal Inc said it would buy digital money transfer provider Xoom Corp for about $890 million in enterprise value as it tries to expand in markets such as Latin America  India and China ahead of a spinoff from eBay Inc .",
        "date": "07012015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "PayPal to buy digital money transfer provider Xoom "
    },
    {
        "content": "SAN FRANCISCO  July 1 PayPal Inc said it would buy digital money transfer provider Xoom Corp for $890 million as it muscles into a growing international remittance market and expand in countries like Mexico  India and China ahead of a spinoff from eBay Inc.",
        "date": "07012015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "CORRECTED-UPDATE 2-PayPal to buy digital money transfer provider Xoom "
    },
    {
        "content": "July 1 PayPal Inc  the electronic payments division of eBay Inc  said it would buy digital money transfer provider Xoom Corp for about $890 million in enterprise value.",
        "date": "07012015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Paypal to buy digital money transfer provider Xoom "
    },
    {
        "content": "SAN FRANCISCO  June 24 Amazon.com Inc  and eBay Inc sharply cut the number of Confederate flag products on their sites a day after vowing to remove them  but in a sign of the difficulty of removing controversial content  Nazi-era memorabilia are listed on both sites.",
        "date": "06242015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "As Amazon  eBay remove Confederate flags  Nazi items on sale "
    },
    {
        "content": "SAN FRANCISCO Google Inc joined Amazon.com Inc and eBay Inc on Tuesday in pulling Confederate flag merchandise from their shopping site  following brick and mortar retailers in reacting to last week's racially motivated mass shooting at a historic black South Carolina church. | Video ",
        "date": "06232015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "Amazon  Google join retailers in banning Confederate flag "
    },
    {
        "content": "SAN FRANCISCO  June 23 Google Inc  joined Amazon.com Inc and eBay Inc on Tuesday in pulling Confederate flag merchandise from their shopping site  following brick and mortar retailers in reacting to last week's racially motivated mass shooting at a historic black South Carolina church.",
        "date": "06232015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 4-Amazon  Google join retailers in banning Confederate flag "
    },
    {
        "content": "SAN FRANCISCO  June 23 EBay Inc said on Tuesday it will ban Confederate flags and related items containing the flag's image from its website calling the flag a \"symbol of divisiveness and racism.\"",
        "date": "06232015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Ebay to ban listings of Confederate flags "
    },
    {
        "content": "June 19 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "06192015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "EBay Inc  said it has sold its 28.4 percent stake in Craigslist Inc back to the online classified advertising company.",
        "date": "06192015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Ebay sells Craigslist stake back to Craigslist "
    },
    {
        "content": "June 19 EBay Inc said it has sold its 28.4 percent stake in Craigslist Inc back to the online classified advertising company.",
        "date": "06192015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Ebay sells its 28.4 pct Craigslist stake back to company "
    },
    {
        "content": "HARARE On online auction site eBay  a 100 trillion Zimbabwean dollar note is a collector's item fetching up to $35  a small fortune  compared with the 40 U.S. cents on offer from the central bank as it seeks to officially bury the worthless currency.",
        "date": "06122015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "Zimbabwe's old quadrillions worth more online and on streets "
    },
    {
        "content": "New York law enforcement officials have written to eBay Inc  and PayPal Inc this week  saying the companies' revised user policies \"raise issues\" under consumer protection laws. | Video ",
        "date": "06112015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "New York AG questions eBay  PayPal on revised user agreements "
    },
    {
        "content": "June 11 New York law enforcement officials have written to eBay Inc and PayPal Inc this week  saying the companies' revised user policies \"raise issues\" under consumer protection laws.",
        "date": "06112015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 1-New York AG questions eBay  PayPal on revised user agreements "
    },
    {
        "content": "LONDON Scotland-based investment strategist Russell Napier gave up his high-powered finance job as a star analyst bankrolled by a big-name broker in order to go it alone last year.",
        "date": "06052015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "eBay for stock-pickers: trading tips for sale online "
    },
    {
        "content": "* Special audit regarding business relationship with eBay completed without complaint",
        "date": "06112015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "BRIEF-Intershop Communications: special audit regarding business relationship with eBay completed "
    },
    {
        "content": "June 11 New York law enforcement officials have written to eBay Inc and PayPal Inc this week  saying the companies' revised user policies \"raise issues\" under consumer protection laws  the New York Times reported.",
        "date": "06112015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "New York AG questions eBay  PayPal on revised user agreements - NYT "
    },
    {
        "content": "EBay Inc plans to launch a new shipping service  eBay plus  in Germany in the second half of this year  the Wall Street Journal reported.",
        "date": "05212015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "eBay to roll out Amazon Prime-like service in Germany: WSJ "
    },
    {
        "content": "May 21 EBay Inc plans to launch a new shipping service  eBay plus  in Germany in the second half of this year  the Wall Street Journal reported.",
        "date": "05212015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "eBay to roll out Amazon Prime-like service in Germany - WSJ "
    },
    {
        "content": "NEW YORK  May 15 Top U.S. hedge fund management firms  including Dan Loeb's Third Point LLC and Farallon Capital Management  trimmed some of their equity exposure in eBay Inc   but kept high positions in the e-commerce company's shares during the first quarter  according to regulatory filings.",
        "date": "05152015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "HIGHLIGHTS-Hedge funds cut eBay  Leonard Green hot on Shake Shack "
    },
    {
        "content": "NEW YORK  May 15 Top U.S. hedge fund management firms  including Dan Loeb's Third Point LLC and Farallon Capital Management  trimmed some of their equity exposure in eBay Inc  but kept high stake positions in the e-commerce company's shares during the first quarter  according to regulatory filings.",
        "date": "05152015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "HIGHLIGHTS-U.S. hedge funds trim eBay  Leonard Green hot on Shake Shack "
    },
    {
        "content": "CHICAGO  April 28 PayPal  eBay Inc's  electronic payments division  said on Tuesday it will extend its single-touch payment service from mobile devices to online transactions to try to reduce the $4 trillion in merchandise abandoned in retailers' online shopping carts every year due to complicated checkout procedures.",
        "date": "04282015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "PayPal extends One Touch payment to online transactions "
    },
    {
        "content": "EBay Inc Chief Executive John Donahoe has added weight to Google Inc's defense in an antitrust case  saying the two companies are direct competitors in online shopping  the Financial Times reported.",
        "date": "04272015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "EBay adds weight to Google's Brussels antitrust defense: FT "
    },
    {
        "content": "April 27 EBay Inc Chief Executive John Donahoe has added weight to Google Inc's defense in an antitrust case  saying the two companies are direct competitors in online shopping  the Financial Times reported.",
        "date": "04272015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 1-EBay adds weight to Google's Brussels antitrust defense - FT "
    },
    {
        "content": "Thomson Reuters April 27  2015 - Corporate Meetings for US companies for Week ahead.         S&P 500 Earnings - MONTH AHEAD     Dividends                            Non S&P 500 - Weekly             Federal Reserve events               ConferenceCall/Webcast - Weekly  Meetings - Weekly                                Xtra users can see more details on conference calls & webcasts by hovering your mouse  over the RIC  right click  no click on Related Co Data  now click on Co Events.                 ",
        "date": "04272015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "DIARY-U.S. MEETINGS/WEEK AHEAD "
    },
    {
        "content": "E-commerce company eBay Inc reported a higher-than-expected quarterly profit as revenue surged from its payments business that includes PayPal  which the company said would be spun off in the third quarter.",
        "date": "04222015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "eBay profit beats as revenue surges from PayPal business "
    },
    {
        "content": "* Shares up 5 pct after market   (Adds forecast  details  analyst comments; updates shares)",
        "date": "04222015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 2- EBay profit beats as revenue surges from PayPal business "
    },
    {
        "content": "April 22 E-commerce company eBay Inc  reported a 4.4 percent rise in quarterly revenue  helped by higher revenue in its payments business  which includes PayPal.",
        "date": "04222015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "EBay's quarterly revenue rises about 4 pct "
    },
    {
        "content": "BEIJING  April 15 JD.com Inc  China's No. 2 e-commerce player  on Wednesday launched its JD Worldwide cross-border online shopping platform  a challenger to Alibaba Group Holding Ltd's Tmall Global service.",
        "date": "04152015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "China's JD.com sets up cross-border e-commerce platform in challenge to Alibaba "
    },
    {
        "content": "PayPal  eBay Inc's electronic payments division  said the two firms had agreed that eBay would not reduce the volume of transactions it channels through PayPal  while continuing to get better rates for its merchants for five years after the two split.",
        "date": "04092015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "PayPal  eBay to stay interdependent for five years after split "
    },
    {
        "content": "April 9 PayPal  eBay Inc's electronic payments division  said the two firms had agreed that eBay would not reduce the volume of transactions it channels through PayPal  while continuing to get better rates for its merchants for five years after the two split.",
        "date": "04092015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "PayPal  eBay to stay interdependent for 5 years after split "
    },
    {
        "content": "BOSTON  April 9 Tactics that activist investors say will benefit a company's shareholders may also raise the risk for the firm's  creditors  a leading credit rating agency warned on Thursday.",
        "date": "04092015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Investor activism may be hard on corporate creditors -Moody's "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  April 01 (Fitch) Fitch Ratings has maintained the 'A-' long-term  ratings for eBay  Inc. (eBay) on Rating Watch Negative in anticipation of the  PayPal separation in the form of a tax-free spin-off in the second half of 2015.  Fitch also has affirmed the short-term ratings at 'F2'.  The ratings affect approximately $10.5 billion of debt  including the $3 billion  revolving credit facility (RCF). A full list of current ratings f",
        "date": "04012015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "Fitch Maintains eBay's 'A-' Long-Term Ratings on Negative Watch "
    },
    {
        "content": "EBay Inc said it added two independent directors to its board ahead of the planned split of its marketplace division from its payments division  PayPal  later this year.",
        "date": "03232015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "EBay adds two independent directors to board ahead of PayPal split "
    },
    {
        "content": "March 23 EBay Inc said it added two independent directors to its board ahead of the planned split of its marketplace division from its payments division  PayPal  later this year.",
        "date": "03232015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "EBay adds 2 independent directors to board ahead of PayPal split "
    },
    {
        "content": "NEW YORK  March 17 Going  going  gone! Sold to the highest bidder at the auction  on the phone or on a new eBay platform that will stream Sotheby's New York auctions live beginning next month.",
        "date": "03172015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "eBay  Sotheby's launch new online auctions platform "
    },
    {
        "content": "TEL AVIV Online payments company PayPal  a unit of eBay   is establishing a cyber security center in Israel and has bought local start-up CyActive to help launch the development.",
        "date": "03112015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "PayPal sets up Israeli security center  buys CyActive "
    },
    {
        "content": "TEL AVIV  March 11 Online payments company PayPal  a unit of eBay  is establishing a cyber security centre in Israel and has bought local start-up CyActive to help launch the development.",
        "date": "03112015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "PayPal sets up Israeli security centre  buys CyActive "
    },
    {
        "content": "TEL AVIV Online payments company PayPal  a unit of eBay   will buy Israeli cyber security company CyActive for $60 million  Israeli media reported.",
        "date": "03082015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "PayPal to buy Israeli cyber security firm CyActive: media "
    },
    {
        "content": "TEL AVIV  March 8 Online payments company PayPal  a unit of eBay  will buy Israeli cyber security company CyActive for $60 million  Israeli media reported.",
        "date": "03082015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "PayPal to buy Israeli cyber security firm CyActive -media "
    },
    {
        "content": "NEW YORK Billionaire activist Carl Icahn slightly boosted his exposure to  eBay Inc by roughly $25 million in the fourth quarter  according to a regulatory filing on Tuesday.",
        "date": "02182015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "Billionaire Carl Icahn added 446 000 eBay shares in fourth quarter "
    },
    {
        "content": "NEW YORK  Feb 17 Billionaire activist Carl Icahn slightly boosted his exposure to  eBay Inc by roughly $25 million in the fourth quarter  according to a regulatory filing on Tuesday.",
        "date": "02182015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Billionaire Carl Icahn added 446 000 eBay shares in 4th qtr "
    },
    {
        "content": "NEW YORK  Feb 17 Top U.S. hedge fund management firms  including David Einhorn's Greenlight Capital and Philippe Laffont's Coatue Management  reduced their stakes in Apple Inc  during the fourth quarter  ahead of the iPhone maker's strong rally in 2015  according to regulatory filings.",
        "date": "02172015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "HIGHLIGHTS-Top U.S. hedge funds cut Apple stakes ahead of all-time high "
    },
    {
        "content": "Feb 6 EBay Inc raised its reported fourth-quarter net income by $87 million to reflect a reduction in income tax expense.",
        "date": "02062015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "EBay restates quarterly profit to reflect lower income tax "
    },
    {
        "content": "SAN FRANCISCO  Feb 4 Paypal executive Don Kingsborough  who helped orchestrate the payments company's move into physical retail stores  stepped down in January  the company said on Wednesday.",
        "date": "02052015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "UPDATE 1-Paypal's retail chief quits ahead of eBay split "
    },
    {
        "content": "SAN FRANCISCO  Jan 21 EBay Inc's plans to break up into three different companies could accommodate would-be suitors  signaling a potential merger fight after the breakup.",
        "date": "01222015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "EBay's breakup plans may open door for e-commerce M&A "
    },
    {
        "content": "* EBay says exploring full or partial sale of enterprise unit or IPO",
        "date": "01212015",
        "name": "eBay Inc",
        "news_type": "topStory",
        "symbol": "EBAY",
        "title": "BRIEF-EBay to take $100 mln charge in Q1 related to job cuts "
    },
    {
        "content": "SAN FRANCISCO E-commerce company eEbay Inc on Wednesday announced an agreement with activist investor Carl Icahn that will give investors a greater say in its PayPal payments unit once it is spun off and said it exploring a sale or public offering of its enterprise unit.",
        "date": "01212015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "EBay may sell enterprise unit ahead of PayPal split "
    },
    {
        "content": "SAN FRANCISCO  Jan 21 E-commerce company eEbay Inc on Wednesday announced an agreement with activist investor Carl Icahn that will give investors a greater say in its PayPal payments unit once it is spun off and said it exploring a sale or public offering of its enterprise unit.",
        "date": "01212015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "UPDATE 2-EBay may sell enterprise unit ahead of PayPal split "
    },
    {
        "content": "Jan 21 Online retailer Ebay Inc said it plans to cut about 2 400 positions  or 7 percent of its workforce across eBay marketplaces  PayPal  and eBay enterprise in the current quarter to simplify its organizational structure.",
        "date": "01212015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "Ebay to cut about 2 400 positions in current quarter "
    },
    {
        "content": "HONG KONG  Jan 14 China has allowed foreign investors to fully own e-commerce companies in Shanghai's free trade zone as part of a pilot scheme  the official Xinhua news agency said on Wednesday  citing the Ministry of Industry and Information Technology.",
        "date": "01142015",
        "name": "eBay Inc",
        "news_type": "normal",
        "symbol": "EBAY",
        "title": "China allows full foreign ownership of e-commerce firms in Shanghai FTZ -Xinhua "
    }
]