[
    {
        "content": "BOGOTA Colombia's state-run oil company Ecopetrol   in partnership with Spain's Repsol   has acquired four new blocks in the Gulf of Mexico for deep water oil exploration  Ecopetrol said on Friday.",
        "date": "11172017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol  Spain's Repsol acquire four blocks in Gulf of Mexico "
    },
    {
        "content": "BOGOTA Colombia's state-controlled oil producer Ecopetrol on Tuesday reported net income rose more than fourfold to 1 trillion pesos ($328.5 million) for the third quarter due to cost reductions and as global prices for crude oil improved.",
        "date": "11072017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol third-quarter net income rises to $328.5 million "
    },
    {
        "content": "* Ecopetrol Business Group presents third quarter and year-to-date 2017 results",
        "date": "11072017",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "BRIEF-Ecopetrol Business Group presents third quarter results "
    },
    {
        "content": "* Termination of program for the disposal of ecopetrol shareholder interest in Empresa De Energía De Bogotá S.A. E.S.P (EEB). Source text for Eikon: Further company coverage:",
        "date": "10202017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "BRIEF-Termination of program for the disposal of ecopetrol shareholder interest in Empresa De Energía De Bogotá S.A. E.S.P (EEB). "
    },
    {
        "content": "Sept 18 Shippers are sending oil cargoes originally bound for Venezuela to other spots in Latin America and the Caribbean  in advance of coming hurricanes that threaten to further disrupt oil flows in the region  according to traders and Reuters data.",
        "date": "09182017",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "Oil cargoes shift away Venezuela as hurricanes extend disruptions "
    },
    {
        "content": "BOGOTA A bomb attack by Colombia's leftist ELN rebel group has halted pumping operations along the country's second-largest oil pipeline  the Cano-Limon Covenas  sources from the military and state oil company Ecopetrol said on Monday.",
        "date": "08292017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia halts Cano-Limon pipeline after rebel attack: sources "
    },
    {
        "content": "BOGOTA  Aug 28 A bomb attack by Colombia's leftist ELN rebel group has halted pumping operations along the country's second-largest oil pipeline  the Cano-Limon Covenas  sources from the military and state oil company Ecopetrol said on Monday.",
        "date": "08292017",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "Colombia halts Cano-Limon pipeline after rebel attack -sources "
    },
    {
        "content": "BOGOTA Colombian state-run oil company Ecopetrol said on Thursday its current vice-president  Felipe Bayon  will take over as chief executive  replacing Juan Carlos Echeverry.",
        "date": "08172017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol names new CEO  Echeverry resigns "
    },
    {
        "content": "BOGOTA Colombia's state oil company Ecopetrol SA will focus exploration efforts in the next few years on unconventional deposits in the center and north of the country in a bid to increase reserves  its chief executive said.",
        "date": "08152017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol bets on non-conventional deposits to boost reserves "
    },
    {
        "content": "* Ecopetrol Business Group presents its second quarter and first half 2017 results",
        "date": "08092017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "BRIEF-Ecopetrol Business Group presents Q2 and first half 2017 results "
    },
    {
        "content": "KUALA LUMPUR Malaysian state energy firm Petronas [PETR.UL] said on Wednesday it has been awarded a shallow-water oil and gas exploration block that it will jointly operate with Colombia's Ecopetrol in the Mexican portion of the Gulf of Mexico.",
        "date": "08022017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Malaysia's Petronas says awarded shallow-water oil and gas block in Mexico "
    },
    {
        "content": "* Ecopetrol approves creation of subsidiary in Mexico Source text for Eikon: Further company coverage:",
        "date": "07132017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "BRIEF-Ecopetrol approves creation of subsidiary in Mexico "
    },
    {
        "content": "BOGOTA  June 29 Colombia's Ecopetrol will pay $1.925 billion of a syndicated loan with international banks ahead of the loan's maturity  the state oil company said on Thursday.",
        "date": "06292017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol to pay $1.925 bln loan ahead of maturity "
    },
    {
        "content": "NEW YORK  June 16 Colombia's state-run oil company Ecopetrol SA is paying particular attention to an upcoming wave of public referendums on crude production  the company's chief operating officer  Felipe Bayon  said Friday.",
        "date": "06162017",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "Public oil drilling referendums causing 'apprehension ' says Ecopetrol exec "
    },
    {
        "content": "MEXICO CITY  June 19 A consortium of Mexican state oil firm Pemex and Colombia's Ecopetrol made the winning bid for the eighth shallow water oil and gas block put up for auction on Monday  Mexico's oil regulator said.",
        "date": "06192017",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "Pemex and Ecopetrol win eighth block in Mexico shallow water auction "
    },
    {
        "content": "MEXICO CITY  June 19 A consortium of Malaysia's PC Carigali and Colombia's Ecopetrol made the winning bid for the sixth shallow water oil and gas block put up for auction on Monday  Mexico's oil regulator said.",
        "date": "06192017",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "Carigali and Ecopetrol win block in Mexico shallow water oil auction "
    },
    {
        "content": "BOGOTA Crude production at Colombia's La Cira-Infantas oilfield has fallen more than 80 percent during the last week  state-run oil company Ecopetrol said on Wednesday  due to protests by local residents over hiring practices.",
        "date": "05242017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia protest cuts Ecopetrol oilfield's output by 80 percent "
    },
    {
        "content": "* Ecopetrol announces non-filing of its annual report on form 20-f for year ended December 31  2016",
        "date": "05172017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "BRIEF-Ecopetrol announces non-filing of annual report on form 20-f for year-end 2016 "
    },
    {
        "content": "BOGOTA  May 15 Colombia's state oil company Ecopetrol on Monday said it reduced output in one of its key production areas due to protests by residents who reject changes to the company's hiring policy for local labor.",
        "date": "05152017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol output falls at big oil field amid protests "
    },
    {
        "content": "* Q1 total sales 13.37 trillion COP versus 10.49 trillion COP",
        "date": "05122017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "BRIEF-Ecopetrol Q1 total sales COP 13.37 tln vs. COP 10.49 tln "
    },
    {
        "content": "BOGOTA Colombian state oil company Ecopetrol said on Wednesday it has  discovered gas at an exploratory well it shares with U.S.-based Anadarko Petroleum Corp in deep waters in the Caribbean Sea  creating the possibility of developing a production cluster.",
        "date": "05032017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol  Anadarko make biggest gas find in 28 years "
    },
    {
        "content": "BOGOTA  May 3 Colombian state oil company Ecopetrol said on Wednesday it has  discovered gas at an exploratory well it shares with U.S.-based Anadarko Petroleum Corp in deep waters in the Caribbean Sea  creating the possibility of developing a production cluster.",
        "date": "05032017",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "UPDATE 1-Colombia's Ecopetrol  Anadarko make biggest gas find in 28 years "
    },
    {
        "content": "BOGOTA  May 3 Colombian state oil company Ecopetrol said on Wednesday it has  discovered gas at an exploratory well it shares with U.S.-based Anadarko Petroleum Corp in deep waters in the Caribbean Sea  creating the possibility of developing a production cluster.",
        "date": "05032017",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol  Anadarko find gas in deep Caribbean waters "
    },
    {
        "content": "BOGOTA  April 27 A bomb attack early Thursday morning has caused an oil spill and halted the flow of crude along Colombia's second largest oil pipeline  the Cano-Limon Covenas  state oil company Ecopetrol said.",
        "date": "04272017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol halts Cano Limon pipeline after attack "
    },
    {
        "content": "BOGOTA  April 5 Colombian state oil company Ecopetrol has restarted the country's second-largest oil pipeline  the Cano-Limon Covenas  after a series of bomb attacks halted movement of crude for seven weeks.",
        "date": "04052017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol restarts Cano-Limon oil pipeline after attacks "
    },
    {
        "content": "* Finding occurred at Boranda-1 well  at a depth of 3.6 kilometers",
        "date": "03302017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "BRIEF-Ecopetrol announces oil discovery at Santander "
    },
    {
        "content": "BOGOTA Colombia has lost 893 000 barrels of oil production  more than a day's worth of total national output  this year due to rebel attacks on the Cano Limon-Covenas pipeline  state oil company Ecopetrol  said on Tuesday.",
        "date": "03222017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol says rebel attacks cut output 893 000 barrels "
    },
    {
        "content": "HOUSTON  March 7 Colombia's state-run Ecopetrol  expects to resume normal exports of Vasconia Norte crude in April  after completing repairs to a pipeline that has been attacked by rebels more than a dozen times this year  said the firm's president on Tuesday.",
        "date": "03072017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "UPDATE 1-CERAWEEK-Ecopetrol expects regular deliveries of Vasconia crude in April "
    },
    {
        "content": "HOUSTON  March 7 Colombia's state-run Ecopetrol  expects to resume normal exports of Vasconia Norte crude in April  after completing repairs to a pipeline that has been attacked by rebels more than a dozen times this year  said the firm's president on Tuesday.",
        "date": "03072017",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "CERAWEEK-Ecopetrol expects regular deliveries of Vasconia crude in April "
    },
    {
        "content": "Feb 23 A force majeure declared by Colombian state-run oil company Ecopetrol SA on some shipments of Vasconia crude has been extended to March deliveries  affecting at least seven cargoes of the medium grade  traders said on Thursday.",
        "date": "02232017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Ecopetrol extends force majeure on Vasconia crude to March exports -trade "
    },
    {
        "content": "BOGOTA Bomb attacks last week halted pumping operations along Colombia's second most important oil pipeline  the Cano-Limon Covenas  state oil company Ecopetrol said on Sunday.",
        "date": "01222017",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Bombings halted pumping at Colombia's Cano-Limon oil pipeline "
    },
    {
        "content": "* Gran Tierra Energy announces two successful strategic acquisitions in the Ecopetrol 2016 bidding round in the Putumayo Basin",
        "date": "11282016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "BRIEF-Gran Tierra Energy announces two acquisitions in the Putumayo Basin "
    },
    {
        "content": "* Average production for Q3 of 2016 rose to 723 mboed  an increase of 3.9% compared to Q2 of 2016",
        "date": "11152016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "BRIEF-Ecopetrol SA reports Q3 results "
    },
    {
        "content": "* By 2020  at an average price of $50 USD/BL  estimated production would reach 760 mboed  equivalent to a 6% growth vis a vis 2016",
        "date": "09302016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "BRIEF-Ecopetrol updates its 2020 business plan "
    },
    {
        "content": "BOGOTA  Sept 5 A leftist rebel bomb attack has halted pumping operations along Colombia's second most important oil pipeline  the Cano-Limon Covenas  state oil company Ecopetrol said on Monday.",
        "date": "09052016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Cano Limon pipeline hit by leftist ELN rebel attack "
    },
    {
        "content": "BOGOTA Members of Colombia's largest oil workers union will vote on whether to strike in protest of privatizations at state-run oil company Ecopetrol  the union's president said on Tuesday.",
        "date": "09062016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's largest oil union to vote on possible strike "
    },
    {
        "content": "* Files for potential mixed shelf offering size not disclosed - SEC filing  Source: http://bit.ly/2bg5Ubu Further company coverage:",
        "date": "08092016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "BRIEF-Ecopetrol SA files for potential mixed shelf offering "
    },
    {
        "content": "* Minority shareholders have nominated Juan José Echavarría Soto as an independent member of board of directors of company",
        "date": "08042016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "BRIEF-Ecopetrol says minority shareholders nominated Juan José Echavarría Soto to board "
    },
    {
        "content": "BOGOTA  July 1 Colombia's state-owned oil company Ecopetrol SA will drill hundreds of new wells in the Rubiales oilfield  depending on crude prices  in a bid to keep the area's output at 135 000 barrels per day  the company's president said on Friday.",
        "date": "07012016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol to open new wells in Rubiales  keep output steady "
    },
    {
        "content": "BOGOTA  June 23 Colombia's state oil company Ecopetrol offered 20 oil and gas blocks for auction on Thursday  part of a company plan to cut back amid low global crude prices.",
        "date": "06232016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol offers 20 blocks in auction launch "
    },
    {
        "content": "* On June  second auction was held to divest and sell 278.2 million of its shares of company Empresa De Energía De Bogotá S.A. E.S.P.",
        "date": "06022016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "BRIEF-Results of second auction for Ecopetrol's equity divestment plan for its shares in Empresa De Energía De Bogotá "
    },
    {
        "content": "BOGOTA  May 18 Colombian state-run oil company Ecopetrol has halted pumping on the country's second-biggest oil pipeline after a bombing attributed to the ELN rebel group sent crude spilling into a river late on Tuesday afternoon.",
        "date": "05182016",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol halts major pipeline after rebel bomb attack "
    },
    {
        "content": "NEW YORK  May 13 (IFR) - Colombia's Ecopetrol will look to raise at least another US$1bn this year as the state-owned oil company seeks to meet financing needs of anywhere between US$1.5bn-US$1.9bn for 2016  CFO Maria Fernanda Saurez told IFR on Friday.",
        "date": "05132016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Ecopetrol eyes loans  bonds to cover 2016 funding needs: CFO "
    },
    {
        "content": "* Q1 total sales cop$10.48 billion versus cop$12.30 billion last year",
        "date": "05032016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "BRIEF-Ecopetrol SA reports Q1 net income attributable to shareholders COP$363 bln "
    },
    {
        "content": "BOGOTA Colombian state-run oil company Ecopetrol has halted pumping on the country's No. 2 oil pipeline after a rebel bombing that sent crude spilling into a nearby river  a source at the company told Reuters on Friday.",
        "date": "04302016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol halts No.2 pipeline after rebel attack "
    },
    {
        "content": "* Says in 2016  capital expenditures will be between US$3.0 and US$3.4 billion",
        "date": "04272016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "BRIEF-Ecopetrol adjusts 2016 investment plan "
    },
    {
        "content": "April 19 Pacific Exploration and Production Corp  said it reached a deal with debtholders  including Catalyst Capital Group Inc  to convert almost all of its debt to equity as it looks to fight a prolonged slump in oil prices.",
        "date": "04192016",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "UPDATE 1-Pacific Exploration in restructuring deal with Catalyst Capital "
    },
    {
        "content": "BOGOTA  March 29 Colombia's state oil company Ecopetrol will seek $2 billion in damages from contractor Chicago Bridge & Iron Company for additional costs during the renovation of Colombia's Reficar refinery  Ecopetrol said late on Monday.",
        "date": "03292016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol seeks $2 bln from CB&I on refinery costs "
    },
    {
        "content": "* First bidding session was held for second stage of program to divest and sell 589 million of co's shares Empresa Interconexión Eléctrica S.A. E.S.P.",
        "date": "03142016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "BRIEF-Ecopetrol S.A announces results for second stage of equity divestment plan "
    },
    {
        "content": "BOGOTA  March 6 Colombia's state-controlled oil producer Ecopetrol on Sunday reported a loss of $1.26 billion during 2015  due to the global plunge in oil prices  rebel attacks and new accounting standards.",
        "date": "03062016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol reports $1.26 bln loss in 2015 "
    },
    {
        "content": "HOUSTON  Feb 23 Colombia's Ecopetrol is selling some non-oil related assets  expecting to collect $1.4 billion at the end of 2017  and cutting 10 percent of staff as part of a cost reduction plan due to low oil prices  the state-run oil firm's chief executive said on Tuesday.",
        "date": "02232016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "CERAWEEK-Colombia's Ecopetrol to sell assets  cut staff amid low oil prices "
    },
    {
        "content": "NEW YORK  Feb 10 Investment firm EIG Pacific Holdings Ltd said on Wednesday it had extended the deadline and changed some terms for its offer to buy nearly all the debt of Colombia's largest private oil producer  Pacific Exploration & Production Corp..",
        "date": "02112016",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "EIG Pacific Holdings extends deadline for Pacific E&P tender offer "
    },
    {
        "content": "BOGOTA  Feb 9 Pumping of crude on Colombia's Cano Limon pipeline has been halted after two bomb attacks late on Monday  state-run oil company Ecopetrol said.",
        "date": "02092016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Bombings halt pumping of crude on Colombia's No. 2 oil pipeline "
    },
    {
        "content": "NEW YORK  Jan 19 (IFR) - Ecopetrol bonds were underperforming in a stronger Latin American credit market on Tuesday after Moody's downgraded the Colombian oil name to just a notch above junk.",
        "date": "01192016",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Ecopetrol bonds slip on Moody's downgrade "
    },
    {
        "content": "BOGOTA  Nov 23 The U.S. affiliate of Colombian state-run oil company Ecopetrol will explore for oil in four blocks in the Gulf of Mexico  the company said in a statement on Monday  partially in partnership with Anadarko U.S. Offshore Corp.",
        "date": "11232015",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol to explore in four Gulf of Mexico blocks "
    },
    {
        "content": "BOGOTA  Nov 17 Colombia's state-controlled oil producer Ecopetrol on Tuesday reported a 62.2 percent drop in quarterly profit due to the global plunge in oil prices and costs incurred because of rebel attacks.",
        "date": "11172015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol profit falls 62 pct on oil price drop "
    },
    {
        "content": "BOGOTA  Oct 15 Colombian state-run oil producer Ecopetrol will restart  operation of its Cartagena refinery on Nov. 10  Finance Minister Mauricio Cardenas said on Thursday.",
        "date": "10152015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Ecopetrol Cartagena refinery to resume operation Nov. 10 -finance min "
    },
    {
        "content": "BOGOTA  Sept 30 Colombia's state-owned oil company Ecopetrol said on Wednesday it signed an agreement with Canada's Parex Resources to boost reserves and production at a field in the country's central Santander province  a project that could require up to $700 million.",
        "date": "09302015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Ecopetrol  Canada's Parex agree to boost reserves at Colombia field "
    },
    {
        "content": "BOGOTA  Sept 16 Colombia's state-run oil company Ecopetrol and U.S.-based Occidental Petroleum Co  will invest up to $2 billion over 10 years to increase production at the La Cira-Infantas oil field  in a bid to reach output of 50 000 barrels per day  Ecopetrol said on Wednesday.",
        "date": "09162015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Ecopetrol and Occidental to increase output at Colombia's La Cira field "
    },
    {
        "content": "BOGOTA  Sept 9 Colombia's Cano Limon pipeline has been halted for repairs  a source at state-run Ecopetrol  said on Wednesday  but production in the Cano Limon and Caricare oil fields is normal.",
        "date": "09092015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's No.2 pipeline halted  production normal "
    },
    {
        "content": "July 27 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "07272015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "BOGOTA Crude oil has spilled into another Colombian river  state-run oil company Ecopetrol said on Monday  in the latest of a slew of bomb attacks on the company's pipelines that the army has blamed on leftist rebel groups.",
        "date": "06222015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Ecopetrol pipeline bombing spills more oil into Colombian river "
    },
    {
        "content": "NEW YORK  June 23 (IFR) - A recovery in LatAm debt spreads opened a window for Colombia's Ecopetrol on Tuesday when it printed a US$1.5bn 11-year bond - the state-owned oil company's first debt issue in nine months.",
        "date": "06232015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Ecopetrol breaks silence in risk-on day for LatAm markets "
    },
    {
        "content": "BOGOTA  June 17 Colombia's Cano Limon-Covenas oil pipeline  the country's second biggest by volume  has been shut due to damage from bomb attacks by leftist FARC rebels which caused a significant spill that has  contaminated two rivers  the army said on Wednesday.",
        "date": "06172015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "UPDATE 1-Colombia's No. 2 oil pipeline shut after rebel bombings "
    },
    {
        "content": "BOGOTA Several thousand barrels of crude oil have spilled into a river in southwest Colombia after insurgents bombed a pipeline  state-run oil company Ecopetrol said on Wednesday  describing the damage as an \"environmental tragedy.\"",
        "date": "06102015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Bombing of Colombian pipeline causes 'environmental tragedy ' Ecopetrol says "
    },
    {
        "content": "BOGOTA  May 26 Colombia's Ecopetrol SA  expects its annual investment budgets to be around $6 billion through 2020  it said in a strategic plan published on Tuesday  down from recent years as it pursues a structural savings target of $1 billion a year.",
        "date": "05262015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol foresees $6 bln/yr investment budgets through 2020 "
    },
    {
        "content": "BOGOTA  May 13 Ecopetrol's Cartagena refinery on Colombia's north coast will return to operation around October or November but could take up to five months to reach its normal production speed  a director at the state-run company said on Wednesday.",
        "date": "05132015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "CORRECTED-Ecopetrol's Cartagena refinery to restart later in year "
    },
    {
        "content": "BOGOTA  May 12 Net profit at Colombia's state-controlled oil producer Ecopetrol tumbled 96 percent in the first quarter from the same period last year  largely due to the sharp drop in crude oil prices since the middle of last year.",
        "date": "05132015",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "UPDATE 1-Colombia's Ecopetrol profit tumbles 96 pct on lower oil prices "
    },
    {
        "content": "BOGOTA  May 12 Net profit at Colombia's state-controlled oil producer Ecopetrol tumbled 96 percent in the first quarter from the same period last year  largely due to the sharp drop in crude oil prices since the middle of last year.",
        "date": "05132015",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol profit tumbles 96 pct on lower oil prices "
    },
    {
        "content": "NEW YORK  April 17 Colombia's state-run oil company Ecopetrol is offering to buy three cargoes totaling 170 000 barrels to 180 000 barrels of diluent naphtha to be received between May 7 and 25.               For spot crude tender news stories please click: CRU-O/TEND-O     For tenders on oil products please click:     Naphtha......NAP/TENDA       Gasoline...MOG/TENDA     Jet/Diesel...MDIS/TENDA      Fuel Oil...FUEL/TENDA          Below is a table of recent tenders:  COUNTRY     COMP",
        "date": "04172015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Latam Products Tenders Summary-Ecopetrol tenders to buy diluent naphtha "
    },
    {
        "content": "BOGOTA  April 7 Colombia's public credit director  who manages the nation's sovereign debt sales  will leave his post at the finance ministry on Tuesday to join a unit of state-run Ecopetrol  four government sources told Reuters.",
        "date": "04072015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's public credit director Janna to join Ecopetrol unit "
    },
    {
        "content": "NEW YORK  April 3 Peru's state-run oil company Petroperu is offering to buy a 200 000 barrels cargo combining cracked naphtha and high octane gasoline blend stock (HOGBS) to be received between May 6 and 10.               For spot crude tender news stories please click: CRU-O/TEND-O     For tenders on oil products please click:     Naphtha......NAP/TENDA       Gasoline...MOG/TENDA     Jet/Diesel...MDIS/TENDA      Fuel Oil...FUEL/TENDA          Below is a table of recent tenders:  COU",
        "date": "04032015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Latam Products Tenders Summary-Peru's Petroperu to buy cracked naphtha  HOGBS "
    },
    {
        "content": "BOGOTA  April 7 Colombian state-owned oil company Ecopetrol will cope with falling oil prices by bolstering exploration offshore  as well as focusing on production of high-yield wells  the company's new president said on Tuesday.",
        "date": "04072015",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol to focus on offshore exploration  key fields "
    },
    {
        "content": "BOGOTA  March 26 Gone were the party balloons emblazoned with Ecopetrol's logo at the shareholder meeting of Colombia's state oil company on Thursday. The usual keychains  posh puzzles  glossy books and toy iguana mascot gifts were also conspicuous by their absence.",
        "date": "03262015",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "Flimsy goodie bags augur gloom for Ecopetrol shareholders "
    },
    {
        "content": "BOGOTA  March 17 Colombia will examine the best financial and production options for running the nation's largest oil field after state-owned Ecopetrol declined to extend Canada-based Pacific Rubiales' contract to operate the field  a government official said on  Tuesday.",
        "date": "03172015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Ecopetrol will examine options for Campo Rubiales field - minister "
    },
    {
        "content": "BOGOTA  March 13 Colombia's state-run oil company Ecopetrol will not extend its contract with Toronto-listed Pacific Rubiales to operate the country's highest-producing oilfield  the company said on Friday.",
        "date": "03132015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "UPDATE 2-Colombia's Ecopetrol says will not extend Pacific Rubiales oilfield contract "
    },
    {
        "content": "BOGOTA  March 13 Colombia's state-run oil company Ecopetrol will not extend the contract Toronto-listed Pacific Rubiales has to operate Campo Rubiales  the country's highest-producing oilfield  an Ecopetrol source said Friday.",
        "date": "03132015",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol will not extend Pacific Rubiales oilfield contract: source "
    },
    {
        "content": "BOGOTA  March 16 A decision by Colombia's state-run Ecopetrol to reclaim control of the Rubiales oil field will imply heavier investment for it to sustain output and raises pressure on Canada's Pacific Rubiales to replace the future loss of nearly half its production  analysts say.",
        "date": "03162015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "UPDATE 1-Colombia oilfield move challenges Ecopetrol  Canada's Pacific Rubiales "
    },
    {
        "content": "BOGOTA  March 16 Ecopetrol's decision to take back control of the Rubiales field will imply heavier investment for it to sustain output and now raises the pressure on Canada's Pacific Rubiales to replace the future loss of nearly half its production  analysts say.",
        "date": "03162015",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "Colombia oilfield move seen challenging Ecopetrol  Canada's Pacific Rubiales "
    },
    {
        "content": "HOUSTON  Mar 6 Costa Rica's refining company Recope is offering to buy 6-12 cargoes  32 000 barrels each  of asphalt to be received from April 2015 to April 2016  while Colombia's state-run oil company Ecopetrol is looking for a diluent naphtha cargo and two gasoline cargoes.              For spot crude tender news stories please click: CRU-O/TEND-O     For tenders on oil products please click:     Naphtha......NAP/TENDA       Gasoline...MOG/TENDA     Jet/Diesel...MDIS/TENDA      Fue",
        "date": "03062015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Latam Products Tenders Summary-Costa Rica's Recope to buy asphalt "
    },
    {
        "content": "BOGOTA  March 9 Colombia's largest oil producer  state-run Ecopetrol  has prepared a contingency workforce to maintain output should strike action by the main oil sector union go ahead and foresees no disruption to oil flows  a senior official told Reuters.",
        "date": "03092015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Colombia's Ecopetrol says it can keep oil flowing if strike starts "
    },
    {
        "content": "BOGOTA  March 3 Colombia's state-controlled oil company Ecopetrol will propose distributing 70 percent of its 2014 net profit of 7.5 trillion pesos ($3 billion) as an ordinary dividend at its upcoming shareholder meeting  the company said on Tuesday.",
        "date": "03032015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Ecopetrol proposes shareholder payout of 70 pct of 2014 profits "
    },
    {
        "content": "NEW YORK  March 3 (IFR) - Latin American sovereigns were on a weaker footing Tuesday morning but Petrobras bonds rallied on news the highly leveraged Brazilian oil entity plans to shed US$13.7bn of assets.",
        "date": "03032015",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "Petrobras tightens as Brazilian sovereign slips "
    },
    {
        "content": "BOGOTA  Feb 13 Colombia's state-run oil producer Ecopetrol will drill three offshore wells this year  two off its Caribbean Coast and a third in the Gulf of Mexico  after slashing its offshore exploration budget to $200 million down from $632 million last year  the company said.",
        "date": "02132015",
        "name": "Ecopetrol SA",
        "news_type": "topStory",
        "symbol": "EC",
        "title": "Ecopetrol to drill 3 wells after cutting offshore drilling budget "
    },
    {
        "content": "BOGOTA  Feb 11 Colombia produced an average 1 034 500 barrels of crude per day (bpd) in January  a 2.7 percent increase over December and up 2 percent from the same month a year earlier  the Mines and Energy Ministry said on Wednesday.     January's increase  marking the fourth straight month with output above 1 million barrels  was due mainly to increased volumes at large fields controlled by state-run oil company Ecopetrol. Ecopetrol and its operating partners accounted for 841 000",
        "date": "02112015",
        "name": "Ecopetrol SA",
        "news_type": "normal",
        "symbol": "EC",
        "title": "TABLE-Colombia oil output above 1 mln barrels for fourth month "
    }
]