[
    {
        "content": "Canadian oil and gas producer Encana Corp on Wednesday posted a third-quarter profit above analysts' estimates but 7.3 percent below the same period last year as a result of lower production.",
        "date": "11082017",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "Encana's quarterly profit down 7 percent as production slips "
    },
    {
        "content": "Nov 8 Canadian oil and gas producer Encana Corp on Wednesday posted a third-quarter profit above analysts' estimates but 7.3 percent below the same period last year as a result of lower production.",
        "date": "11082017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "UPDATE 2-Encana's quarterly profit down 7 pct as production slips "
    },
    {
        "content": "* Encana reports third quarter results; company firmly on track to meet or beat 2017 deliverables in a transformational year",
        "date": "11082017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "BRIEF-Encana reports Q3 EPS $0.30 "
    },
    {
        "content": "Nov 8 Canadian oil and gas producer Encana Corp's  profit fell 7.3 percent in the third quarter  hurt by lower oil and gas production.",
        "date": "11082017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Encana's profit slips 7 pct as production falls "
    },
    {
        "content": "* Encana to update five-year plan during Investor Day; company expects to deliver leading corporate returns  strong cash flow growth and substantial free cash flow",
        "date": "10182017",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Encana to update five-year plan during Investor Day "
    },
    {
        "content": "Oct 18 Canada's main stock index rose modestly on Wednesday as energy shares were boosted by higher oil prices and as Canadian Pacific Railway jumped after better-than-expected quarterly earnings.",
        "date": "10182017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "CANADA STOCKS-CP Rail  energy shares help TSX edge higher "
    },
    {
        "content": "* Encana Corp - ‍Encana successfully started up Sunrise processing plant on September 27  under budget and more than one month ahead of original schedule​",
        "date": "10052017",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Encana successfully starts Sunrise processing plant on Sept 27 "
    },
    {
        "content": "* Encana delivers new Montney plant ahead of schedule; company continues to outperform five-year plan",
        "date": "09272017",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Encana delivers new Montney plant ahead of schedule "
    },
    {
        "content": "* Encana completes sale of its Piceance natural gas assets Source text for Eikon: Further company coverage:",
        "date": "07262017",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Encana completes sale of its Piceance natural gas assets "
    },
    {
        "content": "* Chief executive says company can continue to grow within cash flow with oil prices below $50",
        "date": "07212017",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Encana can grow within cash flow with oil below $50 - CEO "
    },
    {
        "content": "Encana Corp    Canada's No. 2 oil and gas producer  posted a quarterly profit that handily beat analysts' estimates and raised its full-year core asset production growth forecast.",
        "date": "07212017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Canada's Encana smashes profit estimates  shares rise "
    },
    {
        "content": "July 21 Encana Corp   Canada's No. 2 oil and gas producer  posted a quarterly profit that handily beat analysts' estimates and raised its full-year core asset production growth forecast.",
        "date": "07212017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "UPDATE 3-Canada's Encana smashes profit estimates  shares rise "
    },
    {
        "content": "* Encana delivers strong second quarter results; company expands margins  exceeds type curves  grows premium well inventory and updates guidance",
        "date": "07212017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "BRIEF-Encana reports qtrly ‍net earnings of $331 million "
    },
    {
        "content": "July 21 Canadian oil and gas producer Encana Corp on Friday posted a quarterly profit compared with a loss a year earlier  when it took impairment and hedging charges of about $641 million.",
        "date": "07212017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Canadian oil producer Encana posts quarterly profit "
    },
    {
        "content": "* Encana Corp - Encana expects it will develop less than 30 percent of its Permian premium inventory through 2021 Source text for Eikon: Further company coverage:",
        "date": "06202017",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Encana expects to develop less than 30 pct of Permian premium inventory through 2021 "
    },
    {
        "content": "* H2O Midstream acquires Permian Basin produced water assets from Encana Oil & Gas",
        "date": "06142017",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-H2O Midstream acquires Permian Basin produced water assets from Encana Oil & Gas "
    },
    {
        "content": "Oil and gas producer Encana Corp said on Friday it would sell its Piceance natural gas assets in northwestern Colorado to privately held Caerus Oil and Gas LLC for $735 million.",
        "date": "06092017",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "Encana to sell natgas assets to Caerus Oil for $735 million "
    },
    {
        "content": "June 9 Oil and gas producer Encana Corp said on Friday it would sell its Piceance natural gas assets in northwestern Colorado to privately held Caerus Oil and Gas LLC for $735 million.",
        "date": "06092017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "UPDATE 1-Encana to sell natgas assets to Caerus Oil for $735 mln "
    },
    {
        "content": "June 9 Oil and gas producer Encana Corp said on Friday it would sell its Piceance natural gas assets in northwestern Colorado to privately held Caerus Oil and Gas LLC for $735 million.",
        "date": "06092017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Encana to sell natgas assets to Caerus Oil and Gas for $735 mln "
    },
    {
        "content": "* Encana announces agreement to sell its Piceance natural gas assets",
        "date": "06092017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "BRIEF-Encana to sell its Piceance natural gas assets for $735 mln "
    },
    {
        "content": "Encana Corp  will likely benefit if the United States imposes a potential border tax  Chief Executive Douglas Suttles said on Tuesday as Canada's No. 2 oil and natural gas producer reported better-than-expected operating profits for the first quarter.",
        "date": "05022017",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "Encana sees possible benefit from U.S. border tax; operating profit up "
    },
    {
        "content": "May 2 Encana Corp will likely benefit if the United States imposes a potential border tax  Chief Executive Douglas Suttles said on Tuesday as Canada's No. 2 oil and natural gas producer reported better-than-expected operating profits for the first quarter.",
        "date": "05022017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "UPDATE 2-Encana sees possible benefit from U.S. border tax; operating profit up "
    },
    {
        "content": "TORONTO  May 2 Canada's main stock index see-sawed in early trade on Tuesday as financial stocks weighed  offsetting rises for several stocks whose earnings reports produced positive surprises  including energy company Encana Corp and e-commerce company Shopify.",
        "date": "05022017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "CANADA STOCKS-TSX makes small gain  earnings beats boost Encana  Shopify "
    },
    {
        "content": "* Encana delivers strong first quarter results; company's multi-basin advantage drives growth and value",
        "date": "05022017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "BRIEF-Encana reports Q1 earnings per share $0.44 "
    },
    {
        "content": "May 2 Canadian oil and gas producer Encana Corp reported a quarterly profit  compared with a year-ago loss  as the rebound in oil and gas prices boosted margins and its production of oil and natural gas liquids rose.",
        "date": "05022017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Encana posts profit vs year-ago loss as oil prices climb "
    },
    {
        "content": "* Encana corp - ceo doug suttles's 2016 total compensation was $13.3 million versus $8.5 million in 2015 - sec filing",
        "date": "03232017",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Encana CEO Doug Suttles's 2016 compensation was $13.3 mln vs $8.5 mln in 2015 "
    },
    {
        "content": "* Secured new  multi-year contract to provide helicopter services to support Exxonmobil Canada  Encana Corp's activities offshore Nova Scotia  Canada",
        "date": "03092017",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-HNZ Group agrees helicopter services deal with Exxonmobil Canada  Encana "
    },
    {
        "content": "* Encana Corp files for potential mixed shelf offering  size not disclosed - Sec Filing  Source text (http://bit.ly/2meLjvG) Further company coverage:",
        "date": "03022017",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Encana Corp files for potential mixed shelf offering  size not disclosed "
    },
    {
        "content": "CALGARY  Alberta Encana Corp   Canada's No. 2 oil and natural gas producer  reported a better-than-expected quarterly operating profit on Thursday  helped by a cash tax recovery.",
        "date": "02162017",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "Encana posts better-than-expected operating profit "
    },
    {
        "content": "* Soros Fund Management takes share stake in facebook inc of 353 686 shares",
        "date": "02142017",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Soros Fund Management takes in Facebook  ups in T Mobile and Alphabet "
    },
    {
        "content": "CALGARY  Alberta  Feb 16 Encana Corp  Canada's No. 2 oil and natural gas producer  reported a better-than-expected quarterly operating profit on Thursday  helped by a cash tax recovery.",
        "date": "02162017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "UPDATE 2-Encana posts better-than-expected operating profit "
    },
    {
        "content": "* CEO says western Canadian gas producers in talks with TransCanada Corp about pipeline tolling agreement on natural gas mainline system",
        "date": "02162017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "BRIEF-Encana says hopeful on TransCanada natural gas mainline toll talks "
    },
    {
        "content": "* Encana delivers strong fourth quarter and full-year 2016 results; company on track to grow corporate margin and crude and condensate production in 2017",
        "date": "02162017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "BRIEF-Encana Reports Q4 loss of $0.29/shr "
    },
    {
        "content": "Feb 16 Canadian oil and natural gas producer Encana Corp reported a smaller quarterly loss from a year ago  when the company took an impairment charge of $805 million.",
        "date": "02162017",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Oil and gas producer Encana posts smaller loss "
    },
    {
        "content": "* Morgan Stanley reports 5.0 percent passive stake in Encana Corp as of october 26 - sec filing  Source text: (http://bit.ly/2fnJuaF) Further company coverage:",
        "date": "11042016",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Morgan Stanley reports 5 pct passive stake in Encana Corp as of October 26 - SEC filing "
    },
    {
        "content": "CALGARY  Alberta  Nov 3 Pipeline company TransCanada Corp and shippers on the Canadian gas mainline system are closer to reaching an agreement on a new toll structure  the chief executives of Canada's two biggest natural gas producers said on Thursday.",
        "date": "11032016",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "TransCanada gas toll talks making progress -CNRL  Encana "
    },
    {
        "content": "Nov 3 Canadian oil and natural gas producer Encana Corp posted a quarterly profit  on an operating basis  as a steep fall in costs helped offset the impact of weak commodity prices.",
        "date": "11032016",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "UPDATE 2-Oil and gas producer Encana posts surprise operating profit "
    },
    {
        "content": "Nov 3 Canadian oil and gas producer Encana Corp  swung to a quarterly net profit  compared with a year-earlier loss  when the company took an impairment charge of more than $1 billion.",
        "date": "11032016",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Oil and gas producer Encana swings to net profit "
    },
    {
        "content": "* Encana - in quarter  lowered its operating expense and transportation and processing costs by around five percent on a boe basis compared to previous quarter",
        "date": "11032016",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "BRIEF-Encana Q3 operating EPS $0.04 "
    },
    {
        "content": "* Purchased 49% of Encana's leasehold interest covering approximately 54 000 acres in south Piceance basin",
        "date": "10042016",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Nucor sold 50 pct equity interest in Hunter Ridge Energy Services to Encana "
    },
    {
        "content": "CALGARY  Alberta  Oct 5 Encana Corp  said on Wednesday it has made $50 million in cost savings in 2016  continuing a trend of Canadian oil and gas producers squeezing spending in response to the prolonged downturn in global crude prices.",
        "date": "10052016",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "Encana says 2016 costs down by $50 million "
    },
    {
        "content": "* To outline five-year growth potential during investor day  company updates 2016 guidance to reflect lower costs",
        "date": "10052016",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "BRIEF-Encana to outline five-year growth potential during investor day "
    },
    {
        "content": "Sept 30 Futures on Canada's main stock index were little changed on Friday as investors awaited GDP data for July.",
        "date": "09302016",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "CANADA STOCKS-Futures flat as investors await GDP data "
    },
    {
        "content": "* Intends to use approximately half of net proceeds received from sale of shares to fund a portion of its 2017 capital program",
        "date": "09192016",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Encana reports public offering of common shares "
    },
    {
        "content": "* CPPIB  Broe Group complete acquisition of DJ Basin oil & gas assets from Encana  Further company coverage:    (Reporting by Matt Scuffham)",
        "date": "07292016",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-CPPIB  Broe Group complete DJ Basin purchase from Encana "
    },
    {
        "content": "* Intends use net proceeds from sale of securities to finance capital expenditures  to reduce outstanding indebtedness  Source text : http://bit.ly/29ZYyqD] Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "07252016",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Encana Corp files for mixed shelf of up to $6 bln "
    },
    {
        "content": "CALGARY  Alberta  July 21 The Canadian oil and gas earnings season kicked off on Thursday with signs of an industry recovery as Encana Corp and Precision Drilling Corp outlined plans to boost activity.",
        "date": "07212016",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "Canadian energy earnings hint at brighter outlook for oil "
    },
    {
        "content": "TORONTO  July 21 Canada's main stock index gained in morning trading on Thursday  boosted by strong earnings reports from Rogers Communications Inc and Encana Corp and a rebound in some materials stocks.",
        "date": "07212016",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "CANADA STOCKS-TSX rises  buoyed by results from Rogers and Encana "
    },
    {
        "content": "July 21 Canadian oil and gas producer Encana Corp reported an unexpected quarterly operating profit  helped by a cost-cutting drive  and said it would raise its 2016 capital expenditure program.",
        "date": "07212016",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "UPDATE 1-Encana posts unexpected operating profit  hikes 2016 capital budget "
    },
    {
        "content": "July 21 Canadian oil and gas producer Encana Corp  reported a smaller quarterly loss  helped by its ongoing cost-cutting drive  and said it would raise its 2016 capital expenditure program by $200 million.",
        "date": "07212016",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Canada's Encana posts smaller loss  raises 2016 capital spend plan "
    },
    {
        "content": "CALGARY Encana Corp  said on Tuesday it reached an agreement to sell its Gordondale oil and gas assets in northwestern Alberta to Birchcliff Energy Ltd  for C$625 million ($487.98 million).",
        "date": "06212016",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "Encana sells Gordondale oil and gas assets to Birchcliff for C$625 million "
    },
    {
        "content": "CALGARY  June 21 Encana Corp said on Tuesday it reached an agreement to sell its Gordondale oil and gas assets in northwestern Alberta to Birchcliff Energy Ltd  for C$625 million ($487.98 million).",
        "date": "06212016",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Encana sells Gordondale oil and gas assets to Birchcliff for C$625m "
    },
    {
        "content": "* Encana reaches agreement to sell Gordondale assets for C$625 million",
        "date": "06212016",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "BRIEF-Encana to sell Gordondale assets for C$625 million "
    },
    {
        "content": "* Will purchase encana's gas from its substantial acreage position in Howard county   Texas -",
        "date": "05162016",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Navitas Midstream announces agreement with Encana Oil & Gas "
    },
    {
        "content": "* Says has hedged approximately 75 percent of expected May to December oil and condensate production  a stronger hedge position than usual  Source text for Eikon:  Further company coverage:    (Reporting By Nia Williams)",
        "date": "05032016",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Encana beefs up hedging position for 2016 "
    },
    {
        "content": "Canadian oil and gas producer Encana Corp   posted a bigger-than-expected quarterly loss due to lower production amid a steep fall in oil prices.",
        "date": "05032016",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Encana posts bigger-than-expected loss as production falls "
    },
    {
        "content": "* Company on track to meet or beat 2016 guidance announced in february",
        "date": "05032016",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "BRIEF-Encana Q1 operating loss of $0.15 per share "
    },
    {
        "content": "* Says increased amount holders of notes entitled to receive in tender offers  excluding accrued and unpaid interest  from $250 million to $400 million",
        "date": "03302016",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Encana announces increase in aggregate maximum tender amount "
    },
    {
        "content": "* Tender offers will expire at 12:00 midnight  New York City time  on April 12  2016  Source text for Eikon:  Further company coverage:",
        "date": "03162016",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Encana announces tender offers "
    },
    {
        "content": "* Assigns 'BBB-' first-time ratings to Encana; outlook negative  Source text for Eikon:  Further company coverage:    ;))",
        "date": "03142016",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Fitch assigns 'BBB-' first-time ratings to Encana; outlook negative "
    },
    {
        "content": "TORONTO Canadian oil and natural gas producer Encana Corp    looking to further trim its debt load  is exploring the sale of more non-core assets in the United States and Canada that could be worth about $1 billion  two sources familiar with the matter said.",
        "date": "03082016",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "Exclusive: Encana exploring sale of $1 billion in non-core assets - sources "
    },
    {
        "content": "* Says expecting to see a 10 percent production decline in oil and gas from Q4 2015 to Q4 2016  Source text for Eikon:  Further company coverage:    (Reporting By Nia Williams)",
        "date": "02242016",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "BRIEF-Encana expects 10 pct oil and gas production decline this year "
    },
    {
        "content": "* 4th-qtr operating profit $0.13/shr vs est. $0.01   (Adds details  CEO comment  shares)",
        "date": "02242016",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "UPDATE 2-Canada's Encana cuts 2016 capex  to lay off 20 pct of workforce "
    },
    {
        "content": "Feb 24 Canada's Encana Corp   reported a quarterly loss  compared with a year-earlier profit  and the company cut its 2016 capital spending target.",
        "date": "02242016",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Canada's Encana posts loss  cuts 2016 capex "
    },
    {
        "content": "Canadian oil and natural gas producer Encana Corp  responding to a sharp drop in oil prices  has slashed its dividend by about 79 percent and its 2016 capital budget by more than a quarter.",
        "date": "12142015",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "Canada's Encana slashes dividend  cuts capex "
    },
    {
        "content": " ",
        "date": "12142015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "UPDATE 3-Canada's Encana slashes dividend  cuts capex "
    },
    {
        "content": "Dec 14 Canadian oil and natural gas producer Encana Corp   responding to a sharp drop in oil prices  has cut its 2016 capital budget by $600 million compared with 2015.",
        "date": "12142015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Canada's Encana says expects capex to drop $600 mln 2016 "
    },
    {
        "content": "* Q3 oil and gas-liquids output up 35 pct   (Adds comment  Deep Panuke details)",
        "date": "11122015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Encana posts loss  accelerates activity in U.S. Permian basin "
    },
    {
        "content": "CALGARY  Alberta Canadian oil and gas producer Encana Corp said on Thursday it will defer the start of its next gas plant in the Duvernay play until it sees the results of the Alberta government's ongoing reviews.",
        "date": "11122015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Encana defers next Duvernay gas plant  awaits Alberta government reviews "
    },
    {
        "content": "CALGARY  Alberta  Nov 12 Canadian oil and gas producer Encana Corp said on Thursday it will defer the start of its next gas plant in the Duvernay play until it sees the results of the Alberta government's ongoing reviews.",
        "date": "11122015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Encana defers next Duvernay gas plant  awaits Alberta govt reviews "
    },
    {
        "content": "* Encana CEO says company restarted Deep Panuke oil and gas platform offshore Atlantic Canada in last two weeks  Source text for Eikon:  Further company coverage:    (Reporting By Nia Williams)",
        "date": "11122015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "BRIEF-Encana says company has restarted Deep Panuke oil and gas platform "
    },
    {
        "content": "Nov 12 Canadian natural gas producer Encana Corp   reported a third-quarter loss  compared with a year-ago profit  hurt by an impairment charge of about $1.07 billion.",
        "date": "11122015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Encana posts quarterly loss due to impairment charge "
    },
    {
        "content": "Oct 8 Encana Corp  said it would sell its Denver Julesburg basin assets in Colorado for $900 million  the latest divestitures by the Canadian oil and gas producer as it focuses on its high-value gas liquids and oil properties.",
        "date": "10082015",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "UPDATE 1-Encana to sell Denver Julesburg basin assets for $900 mln "
    },
    {
        "content": "Oct 8 Canadian oil and gas producer Encana Corp   said it would sell its Denver Julesberg basin assets in Colorado to a joint venture owned by Canada Pension Plan Investment Board and Broe Group for $900 million.",
        "date": "10082015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Encana to sell its Denver Julesberg basin assets for $900 mln "
    },
    {
        "content": "CALGARY  Alberta  Sept 9 Canadian Oil Sands Ltd   the largest stakeholder in the Syncrude oil sands project  said on Wednesday it had reviewed selling a small portion of its future production but decided against the option for now.",
        "date": "09092015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Canadian Oil Sands says no plan to sell future production "
    },
    {
        "content": "Aug 25 The following bids  mergers  acquisitions and disposals were reported by 1335 GMT on Tuesday:",
        "date": "08252015",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Aug 25 Canadian oil and gas producer Encana Corp   said it would sell its Haynesville natural gas assets in northern Louisiana for $850 million to GEP Haynesville LLC  a joint venture between GeoSouthern Haynesville and funds managed by GSO Capital Partners LP.",
        "date": "08252015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Canada's Encana to sell Haynesville natgas assets for $850 mln "
    },
    {
        "content": "Aug 25 Canadian oil and gas producer Encana Corp   said on Tuesday it will sell its Haynesville natural gas assets in northern Louisiana for $850 million to GEP Haynesville LLC.",
        "date": "08252015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "UPDATE 1-Canada's Encana to sell Haynesville natgas assets for $850 mln "
    },
    {
        "content": "* Says cut 1 400 jobs since 2013   (Adds analyst  CEO comments; updates shares)",
        "date": "07242015",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "UPDATE 3-Canada's Encana lays off 200 employees in July amid oil slump "
    },
    {
        "content": "July 24 Encana Corp   Canada's largest natural gas producer  posted a second-quarter loss  compared with a year-ago profit  hurt by an impairment charge of about $1.3 billion.",
        "date": "07242015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Canada's Encana posts quarterly loss due to $1.3 bln charge "
    },
    {
        "content": "CALGARY  Alberta  June 23 Pipeline company TransCanada Corp and oil and gas producer Encana Corp  both said on Tuesday they were cutting jobs  joining other Canadian energy firms that have laid off staff since global oil prices slumped.",
        "date": "06232015",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "UPDATE 2-Canadian energy companies TransCanada and Encana cut jobs "
    },
    {
        "content": "CALGARY  Alberta  June 23 Canadian oil and gas producer Encana Corp is in the process of making changes to the company's organizational structure and is expecting some reductions in staffing  a company spokesman said on Tuesday.",
        "date": "06232015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Canada's Encana Corp says expecting to cut staffing levels "
    },
    {
        "content": "May 12 Encana Corp   Canada's largest natural gas producer  posted a surprise quarterly operating profit as investments in technology to lower well costs and increase production begin paying off.",
        "date": "05122015",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "UPDATE 1-Encana posts surprise operating profit as costs fall "
    },
    {
        "content": "May 12 Encana Corp   Canada's largest natural gas producer  reported an 98 percent drop in quarterly operating profit  hurt mainly by a steep drop in oil and natural gas prices.",
        "date": "05122015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Canada's Encana posts 98 pct drop in operating profit "
    },
    {
        "content": "April 20 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "04202015",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "April 20 Encana Corp   Canada's largest natural gas producer  is considering selling its natural gas properties in its Haynesville Shale basin acreage in Louisiana  Bloomberg reported  citing sources.",
        "date": "04202015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Encana considering sale of Haynesville gas assets - Bloomberg "
    },
    {
        "content": "CALGARY  Alberta  March 4 Encana Corp  Canada's largest natural gas producer  said on Wednesday it plans to raise up to C$1.44 billion ($1.16 billion) through a secondary share issue as the company looks to bolster a balance sheet weakened by low oil and natural gas prices.",
        "date": "03042015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Canada's Encana plans share issue amid energy price slump "
    },
    {
        "content": "CALGARY  Alberta Encana Corp   Canada's largest natural gas producer  slashed its 2015 capital budget by a quarter on Wednesday in response to a slump in global crude oil prices.",
        "date": "02252015",
        "name": "Encana Corporation",
        "news_type": "topStory",
        "symbol": "ECA",
        "title": "Encana cuts 2015 budget after 85 percent fall in operating profit "
    },
    {
        "content": "CALGARY  Alberta  Feb 25 Encana Corp  Canada's largest natural gas producer  slashed its 2015 capital budget by a quarter on Wednesday in response to a slump in global crude oil prices.",
        "date": "02252015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "UPDATE 2-Encana cuts 2015 budget after 85 pct fall in operating profit "
    },
    {
        "content": "CALGARY  Alberta  Feb 25 Canada's largest natural gas producer Encana Corp is prepared to respond if the right opportunities to sell assets come along  Chief Executive Doug Suttles told a fourth quarter earnings call on Wednesday.",
        "date": "02252015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Encana CEO says ready to respond if right asset sale opportunities arise "
    },
    {
        "content": "Feb 25 Encana Corp   Canada's largest natural gas producer  reported an 84.5 percent drop in operating profit for the fourth quarter  hurt by a fall in natural gas production and weak oil prices.",
        "date": "02252015",
        "name": "Encana Corporation",
        "news_type": "normal",
        "symbol": "ECA",
        "title": "Encana operating profit falls on low gas volumes  oil prices "
    }
]