[
    {
        "content": "* EURONET WORLDWIDE REPORTS THIRD QUARTER 2017 FINANCIAL RESULTS",
        "date": "10202017",
        "name": "Euronet Worldwide Inc",
        "news_type": "topStory",
        "symbol": "EEFT",
        "title": "BRIEF-EURONET WORLDWIDE REPORTS Q3 ADJUSTED EARNINGS PER SHARE $1.61 "
    },
    {
        "content": "* Issues statement regarding MoneyGram International and review of its agreement to merge with Ant Financial Services",
        "date": "07132017",
        "name": "Euronet Worldwide Inc",
        "news_type": "topStory",
        "symbol": "EEFT",
        "title": "BRIEF-Euronet Worldwide comments on MoneyGram review of Ant Financial agreement "
    },
    {
        "content": "* Euronet Worldwide reports first quarter 2017 financial results",
        "date": "04262017",
        "name": "Euronet Worldwide Inc",
        "news_type": "topStory",
        "symbol": "EEFT",
        "title": "BRIEF-Euronet Worldwide Q1 adjusted earnings per share $0.73 "
    },
    {
        "content": "* MoneyGram shares hit 3-year high of $17.83 (Refiles to add dropped word to headline)",
        "date": "04182017",
        "name": "Euronet Worldwide Inc",
        "news_type": "topStory",
        "symbol": "EEFT",
        "title": "REFILE-UPDATE 4-China's Ant hikes MoneyGram bid by over a third  beats rival U.S. offer "
    },
    {
        "content": "* Euronet Worldwide - acknowledges it submitted a binding offer to acquire MoneyGram International to MoneyGram's board of directors on April 14  2017",
        "date": "04172017",
        "name": "Euronet Worldwide Inc",
        "news_type": "topStory",
        "symbol": "EEFT",
        "title": "BRIEF-Euronet Worldwide intends to review amended merger agreement "
    },
    {
        "content": "BEIJING  April 6 China's Ant Financial tried to soothe security concerns about its proposed $880 million takeover MoneyGram International Inc on Thursday  saying it intends to store U.S. user data locally once the deal closes.",
        "date": "04062017",
        "name": "Euronet Worldwide Inc",
        "news_type": "topStory",
        "symbol": "EEFT",
        "title": "UPDATE 1-China's Ant seeks to allay MoneyGram security fears "
    },
    {
        "content": "WASHINGTON  March 28 Euronet Worldwide Inc  ramped up its fight against China's Ant Financial Services Group in trying to acquire MoneyGram International Inc   urging the U.S. government to closely scrutinize the rival Chinese bid saying it raises \"significant national security risks.\"",
        "date": "03282017",
        "name": "Euronet Worldwide Inc",
        "news_type": "normal",
        "symbol": "EEFT",
        "title": "MoneyGram bidder Euronet ramps up fight to stop Chinese rival's bid "
    },
    {
        "content": "March 19 U.S. electronic payments company MoneyGram International Inc will share confidential information with peer Euronet Worldwide Inc  after the latter made a $1 billion acquisition offer  according to people familiar with the matter.",
        "date": "03192017",
        "name": "Euronet Worldwide Inc",
        "news_type": "topStory",
        "symbol": "EEFT",
        "title": "MoneyGram to give Euronet confidential info to firm up bid-sources "
    },
    {
        "content": "March 20 U.S. electronic payments company MoneyGram International Inc said on Monday that peer Euronet Worldwide Inc's offer could result in a superior proposal compared to the one from China's Ant Financial Services Group.",
        "date": "03202017",
        "name": "Euronet Worldwide Inc",
        "news_type": "normal",
        "symbol": "EEFT",
        "title": "MoneyGram board says Euronet offer could result in superior proposal "
    },
    {
        "content": "* Moneygram board of directors determines unsolicited proposal from Euronet Worldwide could reasonably be expected to result in a \"company superior proposal\"",
        "date": "03202017",
        "name": "Euronet Worldwide Inc",
        "news_type": "normal",
        "symbol": "EEFT",
        "title": "BRIEF-Moneygram board says Euronet's proposal could be \"company superior proposal\" "
    },
    {
        "content": "March 19 U.S. electronic payments company MoneyGram International Inc has offered to share confidential information with peer Euronet Worldwide Inc   after the latter made a $1 billion acquisition offer  people familiar with the matter said.",
        "date": "03202017",
        "name": "Euronet Worldwide Inc",
        "news_type": "normal",
        "symbol": "EEFT",
        "title": "RPT-CORRECTED-UPDATE 1-MoneyGram offers to give Euronet confidential info to firm up bid-sources "
    },
    {
        "content": "U.S. electronic payments company MoneyGram International Inc  has offered to share confidential information with peer Euronet Worldwide Inc   after the latter made a $1 billion acquisition offer  people familiar with the matter said.",
        "date": "03202017",
        "name": "Euronet Worldwide Inc",
        "news_type": "normal",
        "symbol": "EEFT",
        "title": "MoneyGram offers to give Euronet confidential info to firm up bid: sources "
    },
    {
        "content": "March 19 U.S. electronic payments company MoneyGram International Inc has offered to share confidential information with peer Euronet Worldwide Inc   after the latter made a $1 billion acquisition offer  people familiar with the matter said.",
        "date": "03202017",
        "name": "Euronet Worldwide Inc",
        "news_type": "normal",
        "symbol": "EEFT",
        "title": "CORRECTED-UPDATE 1-MoneyGram offers to give Euronet confidential info to firm up bid-sources "
    },
    {
        "content": "U.S. electronic payments company Euronet Worldwide Inc  launched a $1 billion bid for rival MoneyGram International Inc  on Tuesday  arguing that its all-American deal would face less regulatory scrutiny than a lower bid by China's Ant Financial Services Group.",
        "date": "03152017",
        "name": "Euronet Worldwide Inc",
        "news_type": "topStory",
        "symbol": "EEFT",
        "title": "Euronet Worldwide trumps Ant Financial's offer to buy MoneyGram "
    },
    {
        "content": "March 14 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "03142017",
        "name": "Euronet Worldwide Inc",
        "news_type": "topStory",
        "symbol": "EEFT",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "* Euronet deal would not require CFIUS clearance   (Adds MoneyGram comment)",
        "date": "03152017",
        "name": "Euronet Worldwide Inc",
        "news_type": "normal",
        "symbol": "EEFT",
        "title": "UPDATE 6-Euronet Worldwide trumps Ant Financial's offer to buy MoneyGram "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Ant Financial's march may be worth slowing down. A $1 billion offer for MoneyGram from Euronet Worldwide improves on the deal it agreed earlier this year with the payments arm of Jack Ma's e-commerce colossus Alibaba. The interloper is in the rare position of having a couple of important advantages over the deep-pocketed Chinese entrepreneur.",
        "date": "03142017",
        "name": "Euronet Worldwide Inc",
        "news_type": "normal",
        "symbol": "EEFT",
        "title": "Jack Ma's Ant march may be worth slowing "
    },
    {
        "content": "* Moneygram confirms receipt of unsolicited proposal from Euronet Worldwide",
        "date": "03152017",
        "name": "Euronet Worldwide Inc",
        "news_type": "normal",
        "symbol": "EEFT",
        "title": "BRIEF-Moneygram confirms receipt of unsolicited proposal from Euronet Worldwide "
    },
    {
        "content": "March 14 U.S. electronics payments provider Euronet Worldwide Inc said on Tuesday it offered to buy money-transfer company MoneyGram International Inc for $15.20 per share  trumping Ant Financial's bid of $13.25 per share.",
        "date": "03142017",
        "name": "Euronet Worldwide Inc",
        "news_type": "normal",
        "symbol": "EEFT",
        "title": "Euronet Worldwide trumps Ant Financial's offer to buy MoneyGram "
    },
    {
        "content": "* Euronet worldwide proposes to acquire moneygram for $15.20 per share",
        "date": "03142017",
        "name": "Euronet Worldwide Inc",
        "news_type": "normal",
        "symbol": "EEFT",
        "title": "BRIEF-Euronet Worldwide proposes to acquire Moneygram for $15.20 per share "
    },
    {
        "content": "March 14 Ant Financial Services Group  the financial services affiliate of China's Alibaba Group Holding Ltd  said on Tuesday it remained committed to the consummation of its merger with U.S. money-transfer company MoneyGram International Inc  after Euronet Worldwide Inc  trumped its offer.",
        "date": "03152017",
        "name": "Euronet Worldwide Inc",
        "news_type": "normal",
        "symbol": "EEFT",
        "title": "Ant Financial says it is committed to merger with MoneyGram "
    },
    {
        "content": "* Euronet Worldwide reports fourth quarter and full year 2016 financial results",
        "date": "02082017",
        "name": "Euronet Worldwide Inc",
        "news_type": "topStory",
        "symbol": "EEFT",
        "title": "BRIEF-Euronet Worldwide Q4 adjusted earnings per share $0.99 "
    },
    {
        "content": "* Euronet Worldwide updates fourth quarter 2016 guidance due to cash supply shortage in india and changes in foreign currency exchange rates",
        "date": "11302016",
        "name": "Euronet Worldwide Inc",
        "news_type": "topStory",
        "symbol": "EEFT",
        "title": "BRIEF-Euronet Worldwide sees Q4 adj earnings $0.98-$1.00 per share "
    },
    {
        "content": "* Euronet Worldwide reports third quarter 2016 financial results",
        "date": "10212016",
        "name": "Euronet Worldwide Inc",
        "news_type": "topStory",
        "symbol": "EEFT",
        "title": "BRIEF-Euronet Worldwide Q3 earnings per share $1.11 "
    },
    {
        "content": "* Euronet worldwide reports first quarter 2016 financial results",
        "date": "04272016",
        "name": "Euronet Worldwide Inc",
        "news_type": "topStory",
        "symbol": "EEFT",
        "title": "BRIEF-Euronet Worldwide Q1 adj cash earnings per share $0.69 "
    },
    {
        "content": "NEW YORK  Jan 19 HiFX  a UK-based foreign currency provider owned by Nasdaq-listed Euronet Worldwide   is going on an aggressive expansion in the United States and Canada over the next two years  Jeff Matheson  the company's managing director for North America  said in an interview late Friday.",
        "date": "01192016",
        "name": "Euronet Worldwide Inc",
        "news_type": "normal",
        "symbol": "EEFT",
        "title": "UK-based payments provider HiFX goes on aggressive U.S.  Canada push "
    }
]