[
    {
        "content": "* Says ‍executives will discuss company's Q3 2017 performance as well as strategic outlook for 2017​",
        "date": "11172017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "BRIEF-Equifax to meet investors in Boston and Baltimore "
    },
    {
        "content": "Nov 15  Profits at Experian Plc rose 6 percent in the first half as the world's biggest credit checker reported some initial gains from a data breach at U.S. rival Equifax and broader growth across its operations.",
        "date": "11152017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "UPDATE 1-Experian profit rises 6 pct  eyes Equifax breach "
    },
    {
        "content": "Equifax Inc on Friday issued a fourth-quarter profit outlook that fell short of Wall Street expectations  saying the massive breach of its consumer data earlier this year would hurt sales and result in costs of $60 million to $75 million during the period.",
        "date": "11102017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "Equifax warns on post-breach costs  revenue hit "
    },
    {
        "content": "Nov 9 Equifax Inc on Thursday reported lower quarterly profit  and quarterly revenue missed estimates  as the credit bureau warned that its massive data breach had prompted some customers to hold back business.",
        "date": "11092017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "UPDATE 3-Equifax profit falls as hacking costs take toll "
    },
    {
        "content": "Nov 8 Equifax Inc said it will release quarterly earnings on Thursday afternoon  its first earnings release since the September disclosure of a massive breach that prompted multiple government probes and the departure of its chief executive.",
        "date": "11082017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax  reeling from breach  to release earnings Thursday "
    },
    {
        "content": "Nov 10 Equifax Inc on Friday issued a fourth-quarter profit outlook that fell short of Wall Street expectations  saying the massive breach of its consumer data earlier this year would hurt sales and result in costs of $60 million to $75 million during the period.",
        "date": "11102017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 3-Equifax warns on post-breach costs  revenue hit "
    },
    {
        "content": "* Q3 revenue $834.8 million versus I/B/E/S view $845.9 million",
        "date": "11092017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "BRIEF-Equifax Inc posts third quarter EPS of $0.79 "
    },
    {
        "content": "Nov 9 Equifax Inc on Thursday reported a lower third-quarter profit as costs from the credit reporting bureau's recently disclosed data breach that exposed deeply sensitive information on 145.5 million people began to mount.",
        "date": "11092017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax reports lower 3rd-quarter earnings after data breach "
    },
    {
        "content": "Nov 10 Equifax Inc on Friday warned that this year's massive data breach will harm future sales  saying it will reduce revenue in the current fourth quarter by 3 percent to 4 percent.",
        "date": "11102017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax warns data breach will harm future sales "
    },
    {
        "content": "NEW YORK  Nov 9 Equifax Inc reports quarterly financial results on Thursday  after the market close  for the first time since disclosing it was the target of a massive data breach that exposed deeply sensitive information on 145.5 million people.",
        "date": "11092017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax to report post-hack financial results after market close "
    },
    {
        "content": "Equifax Inc  on Thursday reported lower quarterly profit  and quarterly revenue missed estimates  as the credit bureau warned that its massive data breach had prompted some customers to hold back business.",
        "date": "11102017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax profit falls as hacking costs take toll "
    },
    {
        "content": "Equifax Inc  said on Friday four of its executives who sold shares before the credit-reporting firm disclosed a massive data breach that wiped out billions from its market value were not aware of the incident when they made the trades.",
        "date": "11032017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "Equifax clears executives who sold shares after hack "
    },
    {
        "content": "WASHINGTON Former Yahoo Chief Executive Marissa Mayer and the current and former CEOs of Equifax Inc  will testify before a U.S. Senate panel on Nov. 8 on two massive data breaches  the committee said Wednesday.",
        "date": "11012017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "Former Yahoo CEO  Equifax CEO to testify at Senate hearing "
    },
    {
        "content": "An special committee of Equifax Inc's board is investigating the role the credit reporting company's chief legal officer played in approving share sales by four executives days after suspicious activity was discovered in its systems  according to The Wall Street Journal.",
        "date": "11062017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "Equifax probes legal officer's role in post-breach share sales: WSJ "
    },
    {
        "content": "Nov 3 Equifax Inc said on Friday four of its executives who sold shares before the credit-reporting firm disclosed a massive data breach that wiped out billions from its market value were not aware of the incident when they made the trades.",
        "date": "11032017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 2-Equifax clears executives who sold shares after hack "
    },
    {
        "content": "Nov 1 Cybersecurity firm FireEye Inc  which probed the Equifax breach in September  reported a narrowed quarterly loss  helped by lower costs and as sales got a boost from its shift to a subscription-based business.",
        "date": "11012017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "FireEye posts narrower loss as costs drop  sales increase "
    },
    {
        "content": "Nov 6 An special committee of Equifax Inc's board is investigating the role the credit reporting company's chief legal officer played in approving share sales by four executives days after suspicious activity was discovered in its systems  according to The Wall Street Journal.",
        "date": "11062017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax probes legal officer's role in post-breach share sales -WSJ "
    },
    {
        "content": "NEW YORK  Oct 25 Equifax Inc is running out of time to schedule its first quarterly results report since the massive breach that exposed sensitive data on 145.5 million people and erased more than $4 billion of the credit reporting firm's market value.",
        "date": "10252017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax  reeling from hack  still has no earnings report date "
    },
    {
        "content": "* Equifax Inc - ‍equifax Board now consists of 11 directors  all of whom are independent​",
        "date": "10262017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "BRIEF-Equifax names Scott McGregor as new independent director "
    },
    {
        "content": "NEW YORK  Oct 26 American International Group Inc said it would include cyber coverage to its commercial casualty insurance during the first quarter of 2018  a move that would boost rates but make it clearer how customers are covered if they are the victim of a security breach.",
        "date": "10262017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "CORRECTED-UPDATE 2-AIG to include cyber coverage to commercial casualty insurance "
    },
    {
        "content": "NEW YORK  Oct 12 Equifax Inc said on Thursday that one of its third-party vendors had been running malicious code on one its web pages  but that the credit reporting agency was not the subject of another cyber attack and its systems were not compromised.",
        "date": "10122017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "UPDATE 3-Equifax says systems not compromised in latest cyber scare "
    },
    {
        "content": "* Driver’s license data for around 10.9 million Americans were compromised during the breach of Equifax Inc’s systems - WSJ​  citing sources Source text: http://on.wsj.com/2hAqMxG Further company coverage:",
        "date": "10102017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "BRIEF-Driver’s license data for around 10.9 mln Americans were compromised during Equifax Inc's system breach - WSJ‍​  citing sources "
    },
    {
        "content": "* Says its systems were not compromised on Thursday  issue was with 3rd party vendor‍​ - CNBC Source text for Eikon: Further company coverage:",
        "date": "10122017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "BRIEF-Equifax says systems were not compromised on Thursday  issue was with 3rd party vendor‍​ - CNBC "
    },
    {
        "content": "* Equifax Ltd UK -can confirm that file containing 15.2m UK records dating from between 2011 and 2016 was attacked in cyber security incident‍​ Source text: http://bit.ly/2y7XwZy Further company coverage:",
        "date": "10102017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "BRIEF-Equifax UK confirms 15.2 mln UK records between 2011 and 2016 was attacked in cyber security incident‍​ "
    },
    {
        "content": "NEW YORK  Oct 13 The U.S. Internal Revenue Service has temporarily suspended a contract worth more than $7 million it recently awarded to Equifax Inc following a security issue with the beleaguered credit reporting agency's website on Thursday.",
        "date": "10132017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "IRS puts Equifax contract on hold during security review "
    },
    {
        "content": "NEW YORK  Oct 12 Equifax Inc has taken one of its web pages offline as its security team looks into reports of another potential cyber breach  the credit reporting company  which recently disclosed a hack that compromised the sensitive information of 145.5 million people  said on Thursday.",
        "date": "10122017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax takes web page offline after reports of new cyber attack "
    },
    {
        "content": "NEW YORK Equifax Inc said on Thursday that one of its third-party vendors had been running malicious code on one its web pages  but that the credit reporting agency was not the subject of another cyber attack and its systems were not compromised. | Video ",
        "date": "10132017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax says systems not compromised in latest cyber scare "
    },
    {
        "content": "Oct 1 Equifax Inc is reviewing its Chief Legal Officer John Kelly's involvement in stock sales by company executives made weeks before the credit-reporting service disclosed a massive data breach  the Wall Street Journal reported on Sunday.",
        "date": "10012017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "Equifax reviews its top lawyer's role in executive stock sales - WSJ "
    },
    {
        "content": "WASHINGTON The chairman of the U.S. Senate Commerce Committee said on Tuesday he plans to hold a hearing later this month over massive data breaches at Equifax Inc  and Yahoo  which is now owned by Verizon Communications Inc .",
        "date": "10042017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "Senate panel to hold hearing on Yahoo  Equifax breaches "
    },
    {
        "content": "WASHINGTON The former head of Equifax Inc  apologized repeatedly on Tuesday at a congressional hearing for the theft of millions of people's personal data in a hacking breach  saying it took weeks for the credit bureau to understand the extent of the intrusion. | Video ",
        "date": "10032017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "Former Equifax chief apologizes to Congress over hack "
    },
    {
        "content": "Oct 4 U.S. fast-food chain operator Sonic Corp said on Wednesday a malware attack at some of its drive-in outlets may have allowed hackers to access customers' debit and credit card information  the latest in a string of data breaches.",
        "date": "10042017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 1-Drive-in chain Sonic says payment cards possibly hacked "
    },
    {
        "content": "WASHINGTON  Oct 3 The chairman of the U.S. Senate Commerce Committee said on Tuesday he plans to hold a hearing later this month over massive data breaches at Equifax Inc and Yahoo  which is now owned by Verizon Communications Inc.",
        "date": "10032017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "U.S. Senate panel to hold hearing on Yahoo  Equifax breaches "
    },
    {
        "content": "Sept 29 U.S. lenders are concerned their consumer loan and credit card businesses could be stymied if large numbers of people lock or freeze their credit reports to protect themselves in the wake of the Equifax Inc hack.",
        "date": "09292017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Bankers anxious over consumer reactions to Equifax breach "
    },
    {
        "content": "WASHINGTON U.S. Senator Elizabeth Warren criticized Equifax Inc  on Wednesday  saying it failed to protect customers adequately  after a massive data breach and stood to gain financially from a hack that exposed information on more than 140 million people.",
        "date": "10042017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Senator Warren criticizes Equifax potential to profit from breach "
    },
    {
        "content": "WASHINGTON  Oct 3 The former head of Equifax Inc apologized repeatedly on Tuesday at a congressional hearing for the theft of millions of people's personal data in a hacking breach  saying it took weeks for the credit bureau to understand the extent of the intrusion.",
        "date": "10032017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 1-Former Equifax chief apologizes to Congress over hack "
    },
    {
        "content": "WASHINGTON Equifax Inc told the U.S. House of Representatives in a letter made public on Friday that its board of directors has formed a special committee to review stock sales by company executives made weeks before the credit-reporting service disclosed a massive data breach.",
        "date": "09292017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax board launches review of executive stock sales after data breach -letter "
    },
    {
        "content": "WASHINGTON  Oct 4 U.S. Senator Elizabeth Warren criticized Equifax Inc on Wednesday  saying it failed to protect customers adequately  after a massive data breach and stood to gain financially from a hack that exposed information on more than 140 million people.",
        "date": "10042017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "U.S. Senator Warren criticizes Equifax potential to profit from breach "
    },
    {
        "content": "WASHINGTON  Oct 3 U.S. lawmakers are due to question the former head of Equifax Inc at a Tuesday hearing that could shed light on how hackers accessed the personal data of more than 140 million consumers.",
        "date": "10032017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Former Equifax chief will face questions from U.S. Congress over hack "
    },
    {
        "content": "* Equifax interim CEO in WSJ article says by Jan 31 co will offer new service allowing all consumers option of controlling access to personal credit data Source text - http://on.wsj.com/2fsBnKz Further company coverage: (Bengaluru Newsroom)",
        "date": "09272017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "BRIEF-Equifax interim CEO in WSJ says by Jan 31 co will offer new service allowing all consumers option of controlling access to personal credit data "
    },
    {
        "content": "WASHINGTON Equifax Inc  was alerted in March to the software security vulnerability that led to hackers obtaining personal information of more than 140 million Americans but took months to patch it  its former CEO said in testimony to be delivered to Congress on Tuesday.",
        "date": "10022017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "Equifax failed to patch security vulnerability in March: former CEO "
    },
    {
        "content": "NEW YORK  Sept 28 Equifax has been cooperating with regulators on issues resulting from the credit reporting agency's massive data breach and has addressed many of them  New York Attorney General Eric Schneiderman's office said on Thursday.",
        "date": "09282017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "NY regulator says Equifax making progress on post-breach issues "
    },
    {
        "content": "WASHINGTON  Sept 29 Equifax Inc told the U.S. House of Representatives in a letter made public on Friday that its board of directors has formed a special committee to review stock sales by company executives made weeks before the credit-reporting service disclosed a massive data breach.",
        "date": "09292017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 2-Equifax board launches review of executive stock sales after data breach -letter "
    },
    {
        "content": "* Equifax board weighing executive pay clawbacks in next few days- CNBC  citing DJ Further company coverage:",
        "date": "09292017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "BRIEF-Equifax board weighing executive pay clawbacks in next few days- CNBC  citing DJ "
    },
    {
        "content": "Property Claim Services (PCS)  a Verisk Analytics company  estimated an insured loss of $125 million from a massive data breach disclosed last month by Equifax Inc   that has plunged the credit-monitoring company into crisis.",
        "date": "10022017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax data breach to cost insurers $125 million: Property Claim Services "
    },
    {
        "content": "WASHINGTON  Sept 29 A lawyer for Equifax Inc told the U.S. House of Representatives that the company's board of directors has formed a special committee to review stock trades made by executives after a data breach.",
        "date": "09292017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax board reviewing executive stock trading after data breach -- letter "
    },
    {
        "content": "Sept 29 Equifax Inc's board has formed a special committee to review the stock sales made by some of its executives days after a massive data breach at the credit-monitoring firm  Bloomberg News reported on Friday. https://bloom.bg/2yyc3dt",
        "date": "09292017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax board forms panel to look into executives' stock sales-Bbg "
    },
    {
        "content": "WASHINGTON The chairman of the U.S. Securities and Exchange Commission (SEC) told a congressional committee on Tuesday he did not believe his predecessor Mary Jo White knew of a 2016 cyber breach to the regulator's corporate disclosure system  the exact timing of which could not be known \"for sure.\"",
        "date": "09262017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "U.S. SEC chair grilled by Senate panel over cyber breach  Equifax "
    },
    {
        "content": "WASHINGTON The U.S. consumer finance watchdog agency is expected to punish Equifax for its cyber breach with the wide-ranging powers it has used with Wall Street  former agency officials and lawyers said this week.",
        "date": "09222017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "U.S. consumer finance agency expected to punish Equifax -lawyers "
    },
    {
        "content": "* Equifax - ‍during period of time Barros serves as interim CEO  he will get  monthly cash payment of $25 000 in addition to $470 000 annual base salary​",
        "date": "10022017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "BRIEF-Equifax - interim CEO will get monthly cash payment of $25 000 "
    },
    {
        "content": " (In 5th paragraph of Sept. 27 item corrects to show that free service allows consumers to lock and unlock their Equifax credit reports  not freeze them)",
        "date": "09282017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax apologizes as U.S. watchdog calls for more oversight "
    },
    {
        "content": "Sept 27 Equifax Inc promised to make it easier for consumers to control access to their credit records in the wake of the company's massive breach after the top U.S. consumer financial watchdog called on the industry to introduce such a system.",
        "date": "09282017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "CORRECTED-UPDATE 2-Equifax apologizes as U.S. watchdog calls for more oversight "
    },
    {
        "content": "* Equifax board forms panel to review executives' share sales- Bloomberg Source https://bloom.bg/2wp1WHo Further company coverage:",
        "date": "09292017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "BRIEF-Equifax board forms panel to review executives' share sales- Bloomberg "
    },
    {
        "content": "WASHINGTON The chairman of the U.S. Securities and Exchange Commission (SEC) told a congressional committee on Tuesday he did not believe his predecessor Mary Jo White knew of a 2016 cyber breach to the regulator's corporate disclosure system  the exact timing of which could not be known \"for sure.\"",
        "date": "09262017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "SEC chair grilled by Senate panel over cyber breach  Equifax "
    },
    {
        "content": "* Dodd-Frank gives CFPB wide-ranging powers to go after company",
        "date": "09222017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "RPT-U.S. consumer finance agency expected to punish Equifax -lawyers "
    },
    {
        "content": "WASHINGTON Equifax Inc was alerted in March to the software security vulnerability that led to hackers obtaining personal information of more than 140 million Americans but took months to patch it  its former CEO said in testimony to be delivered to Congress on Tuesday.",
        "date": "10022017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax failed to patch security vulnerability in March -former CEO "
    },
    {
        "content": "Sept 28 Britain's FTSE 100 index is seen opening 2 points higher on Thursday  according to financial bookmakers  with futures up 0.12 percent ahead of the cash market open.",
        "date": "09282017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 1-UK Stocks-Factors to watch on Sept 28 "
    },
    {
        "content": "* Equifax suffered a hack almost five months earlier than the date it disclosed - Bloomberg  citing sources Source text for Eikon: Further company coverage:",
        "date": "09182017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "BRIEF-Equifax suffered a hack almost five months earlier than the date it disclosed - Bloomberg  citing sources "
    },
    {
        "content": "* SEC chair-Does not believe Mary Jo White knew of 2016 breach",
        "date": "09262017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 2-U.S. SEC chair grilled by Senate panel over cyber breach  Equifax "
    },
    {
        "content": "LONDON  Sept 22 Following are five big themes likely to dominate thinking of investors and traders in the coming week and the Reuters stories related to them.",
        "date": "09222017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "GRAPHIC-Take Five: World markets themes for the week ahead "
    },
    {
        "content": "WASHINGTON  Oct 2 Equifax Inc was alerted in March to the software security vulnerability that led to hackers obtaining personal information of more than 140 million Americans but took months to patch it  its former CEO said in testimony to be delivered to Congress on Tuesday.",
        "date": "10022017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 2-Equifax failed to patch security vulnerability in March -former CEO "
    },
    {
        "content": "    Sept 28 Britain's FTSE 100 index is seen opening 2 points higher on Thursday  according to financial bookmakers.           * BRITAIN BOE: Bank of England Chief Economist Andy Haldane said he saw encouraging signs of pay growth and any increase in interest rates should be seen as a \"good news story\" for Britain's economy  Sky News quoted him as saying on Wednesday.     * BOMBARDIER: Britain told U.S. planemaker Boeing that it could lose out on future British defence contracts beca",
        "date": "09282017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UK Stocks-Factors to watch on Sept 28 "
    },
    {
        "content": "* U.S. prosecutors open criminal probe into whether Equifax Inc execs violated insider trading laws- Bloomberg Source text : https://bloom.bg/2fuPmjk Further company coverage:",
        "date": "09182017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "BRIEF-U.S. prosecutors open criminal probe into whether Equifax execs violated insider trading laws- Bloomberg "
    },
    {
        "content": "Equifax Inc said on Tuesday that Chief Executive Richard Smith would leave the company and forgo this year's bonus as criticism mounts over a massive cyber attack that has plunged the credit-monitoring firm into crisis.",
        "date": "09262017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax CEO departs  forgoes bonus after massive data breach "
    },
    {
        "content": " (This September 21 story was refiled to include Truong's full title in fifth paragraph)",
        "date": "09222017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "U.S. consumer finance agency expected to punish Equifax: lawyers "
    },
    {
        "content": "NEW YORK  Sept 21 U.S. consumer credit reporting bureau Equifax Inc risks losing support from banks unless it can show its database on millions of borrowers is secure from another cyber-attack. Banks are critical to Equifax's operations as they give the company information on consumer debts and payments which it compiles into credit reports sold to other creditors  including mortgage and credit card lenders  landlords and hospitals. \"If we don't feel that they can do the job  then we",
        "date": "09222017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "RPT-Equifax under pressure from banks to shape up "
    },
    {
        "content": "U.S. credit reporting firm Equifax Inc  said about 2.5 million additional U.S. consumers may have been impacted by a cyber attack at the company last month.",
        "date": "10022017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax says cyber attack may have hit 2.5 million more U.S. consumers "
    },
    {
        "content": "* Equifax announces cybersecurity firm has concluded forensic investigation of cybersecurity incident",
        "date": "10022017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "BRIEF-Equifax says concluded forensic investigation of cybersecurity incident "
    },
    {
        "content": "WASHINGTON Equifax said on Friday that it made changes in its top management as part of its review of a massive data breach  with two technology and security executives leaving the company \"effective immediately.\" | Video ",
        "date": "09162017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "Equifax two top technology executives leave company 'effective immediately' "
    },
    {
        "content": "NEW YORK  Sept 21 U.S. consumer credit reporting bureau Equifax Inc risks losing support from banks unless it can show its database on millions of borrowers is secure from another cyber-attack. Banks are critical to Equifax's operations as they give the company information on consumer debts and payments which it compiles into credit reports sold to other creditors  including mortgage and credit card lenders  landlords and hospitals. \"If we don't feel that they can do the job  then we",
        "date": "09212017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax under pressure from banks to shape up "
    },
    {
        "content": "NEW YORK  Sept 20 The House Financial Services Committee is seeking information about certain Equifax Inc options trades made weeks before the credit reporting company disclosed a data breach  according to CNBC report on Wednesday.",
        "date": "09202017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "House Finance Committee delves into unusual Equifax options trades -CNBC "
    },
    {
        "content": "WASHINGTON  Sept 18 New York Governor Andrew Cuomo said in a statement on Monday that all credit reporting agencies must register with the state and comply with its cybersecurity rules.",
        "date": "09182017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "New York governor says Equifax  other credit reporting companies must register with state "
    },
    {
        "content": "Sept 26 Equifax Inc said on Tuesday that Chief Executive Richard Smith would leave the company and forgo this year's bonus as criticism mounts over a massive cyber attack that has plunged the credit-monitoring firm into crisis.",
        "date": "09262017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 4-Equifax CEO departs  forgoes bonus after massive data breach "
    },
    {
        "content": "Property Claim Services (PCS)  a Verisk Analytics company  estimated an insured loss of $125 million from a massive data breach disclosed last month by Equifax Inc  that has plunged the credit-monitoring company into crisis.",
        "date": "10022017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax data breach to cost insurers $125 mln - Property Claim Services "
    },
    {
        "content": "* House finance committee seeks information from traders about questionable Euifax options activity - CNBC  citing source Further company coverage:",
        "date": "09202017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "BRIEF-House finance committee seeks information from traders about questionable Equifax options activity - CNBC "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - Equifax can't even oust its hapless chairman and chief executive effectively. Rick Smith is \"retiring \" as the corporate euphemism goes  after failing to prevent a massive cyber attack and fumbling the response - and with little financial penalty to boot. An interim management plan makes clear the board hadn't planned succession adequately either. Equifax needs regime change at every level.",
        "date": "09262017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Breakingviews - Equifax can't even oust its failed CEO effectively "
    },
    {
        "content": "Oct 2 Property Claim Services (PCS)  a Verisk Analytics company  estimated an insured loss of $125 million from a massive data breach disclosed last month by Equifax Inc   that has plunged the credit-monitoring company into crisis.",
        "date": "10022017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax data breach to cost insurers $125 mln- Property Claim Services "
    },
    {
        "content": "WASHINGTON  Oct 2 Equifax Inc failed to patch a software security vulnerability after being alerted in March by the U.S. Homeland Security Department to the issue that led to hackers obtaining personal information from over 140 million Americans  the company's former chief executive will tell Congress in written testimony made public Monday.",
        "date": "10022017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax failed to patch security vulnerability in March -- testimony "
    },
    {
        "content": "Massachusetts Attorney General Maura Healey filed a lawsuit on Tuesday against credit reporting firm Equifax Inc following a breach that exposed the personal data of up to 143 million people  including 3 million in the state.",
        "date": "09192017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Massachusetts sues Equifax as hack concerns spread to Canada "
    },
    {
        "content": "WASHINGTON The U.S. Federal Trade Commission said on Thursday it was investigating Equifax Inc's massive data breach  and a top Democrat suggested the credit-monitoring company's corporate leaders might need to resign.",
        "date": "09142017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "U.S. FTC probes Equifax  top Democrat likens it to Enron "
    },
    {
        "content": "WASHINGTON  Sept 15 Equifax said on Friday that it made changes in its top management as part of its review of a massive data breach  with two technology and security executives leaving the company \"effective immediately.\"",
        "date": "09152017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "UPDATE 3-Equifax two top technology executives leave company 'effective immediately' "
    },
    {
        "content": "Sept 13 Nearly 40 states have joined a probe of Equifax's handling of a massive data breach that exposed valuable information on up to 143 million Americans  according to the Illinois attorney general's office  which is leading the probe.",
        "date": "09132017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Nearly 40 states probe Equifax's handling of massive data breach "
    },
    {
        "content": "Equifax Inc said on Wednesday that investigators had determined that an online dispute website at the heart of the theft of some 143 million consumer records was initially compromised by hackers on March 10  four months before the company noticed any suspicious activity. | Video ",
        "date": "09212017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax says server first compromised on March 10 "
    },
    {
        "content": "TORONTO Credit scoring company Equifax Inc said on Tuesday that  the personal details of around 100 000 Canadians were exposed in the massive breach it disclosed earlier this month.",
        "date": "09202017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax says 100 000 Canadians likely affected by data breach "
    },
    {
        "content": "* Equifax - Richard Smith will not receive annual bonus opportunity as described in his employment agreement for period ending Dec. 31  2017‍​",
        "date": "09262017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "BRIEF-Equifax - Richard Smith will not receive annual bonus opportunity "
    },
    {
        "content": "Sept 19 Massachusetts Attorney General Maura Healey filed a lawsuit on Tuesday against credit reporting firm Equifax Inc following a breach that exposed the personal data of up to 143 million people  including 3 million in the state.",
        "date": "09192017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 3-Massachusetts sues Equifax as hack concerns spread to Canada "
    },
    {
        "content": "WASHINGTON  Sept 14 The U.S. Federal Trade Commission said on Thursday it was investigating Equifax Inc's massive data breach  and a top Democrat suggested the credit-monitoring company's corporate leaders might need to resign.",
        "date": "09142017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 6-U.S. FTC probes Equifax  top Democrat likens it to Enron "
    },
    {
        "content": "NEW YORK  Sept 14 The heightened drama in Equifax Inc's shares after the credit reporting company last week disclosed a massive data breach has turned its sparsely traded options contracts into one of the busiest names in the U.S. options market.",
        "date": "09142017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Wild stock swings put Equifax options on traders' radar "
    },
    {
        "content": "* Equifax Inc chief information officer & chief security officer to retire effective immediately - CNBC  citing DJ Source: http://cnb.cx/2w0d0dC Further company coverage:",
        "date": "09152017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "BRIEF-Equifax chief information officer and chief security officer to retire - CNBC  citing DJ "
    },
    {
        "content": "Sept 15 Credit score company Equifax Inc's chief information officer and chief security officer will retire effective immediately  CNBC said on Friday  citing Dow Jones.",
        "date": "09152017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax's information  security heads to retire immediately - CNBC  citing DJ "
    },
    {
        "content": "WASHINGTON U.S. Senator Elizabeth Warren said on Friday she has begun an investigation into Equifax's  massive data breach  and along with 11 other Democratic senators  introduced a bill to allow consumers to freeze their credit for free. | Video ",
        "date": "09152017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "U.S. Senator Warren introduces Equifax bill  launches industry probe "
    },
    {
        "content": "NEW YORK (Thomson Reuters Regulatory Intelligence) - The New York Department of Financial Services on Monday responded to the Equifax cyber attack by proposing to extend its ground-breaking data protection rules to credit reporting firms  in an attempt to fill a perceived regulatory gap. The New York regulator also issued a warning to banks on potential risk from the massive data breach and issued guidelines on how to limit damage.",
        "date": "09212017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "New York proposes cyber security rules for credit-reporting  warns banks after Equifax breach "
    },
    {
        "content": "Sept 20 Equifax Inc said on Wednesday that investigators had determined that an online dispute website at the heart of the theft of some 143 million consumer records was initially compromised by hackers on March 10  four months before the company noticed any suspicious activity.",
        "date": "09212017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 1-Equifax says server first compromised on March 10 "
    },
    {
        "content": "* Equifax chairman  CEO  Richard Smith retires; board of directors appoints current board member Mark Feidler chairman; Paulino do Rego Barros  Jr Appointed interim CEO; company to initiate CEO search",
        "date": "09262017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "BRIEF-Equifax chairman CEO Richard Smith retires "
    },
    {
        "content": "Sept 26 U.S. credit reporting firm Equifax Inc said on Tuesday its Chief Executive Richard Smith will retire  a week before he was expected to testify before a Senate Banking Committee in the wake of a massive cyber attack.",
        "date": "09262017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax CEO retires following massive cyber attack "
    },
    {
        "content": "Sept 11 More than 30 lawsuits have been filed in the United States against Equifax Inc after the credit reporting company said thieves may have stolen personal information for 143 million Americans in one of the largest hackings ever.",
        "date": "09112017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "UPDATE 1-Lawsuits against Equifax pile up after massive data breach "
    },
    {
        "content": "WASHINGTON  Sept 12 Equifax Inc \"will make changes\" after a security breach in July that may have exposed the data of up to 143 million people  the company's Chief Executive Officer Richard Smith said in an opinion piece in USA Today on Tuesday.",
        "date": "09122017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax CEO says company 'will make changes' after security breach "
    },
    {
        "content": "TORONTO  Sept 19 Credit scoring company Equifax Inc said on Tuesday that  the personal details of around 100 000 Canadians were exposed in the massive breach it disclosed earlier this month.",
        "date": "09192017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax says 100 000 Canadians likely affected by data breach "
    },
    {
        "content": "Sept 19 The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.",
        "date": "09192017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "PRESS DIGEST - Wall Street Journal - Sept 19 "
    },
    {
        "content": "WASHINGTON  Sept 14 The Federal Trade Commission has opened a probe into Equifax's massive data breach  where hackers stole a treasure trove of personal information about up to 143 million people.",
        "date": "09142017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "U.S. FTC opens probe into massive Equifax hack "
    },
    {
        "content": "TORONTO  Sept 15 Canada's privacy commissioner said on Friday that it has launched an investigation into the massive data breach at Equifax Inc after receiving complaints from Canadian consumers.",
        "date": "09152017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Canadian privacy commissioner launches probe of Equifax breach "
    },
    {
        "content": "NEW YORK  Sept 13 Shareholders haven’t had much success in securities class actions blaming investor losses on corporate data breach disclosures.",
        "date": "09132017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "COLUMN-Will Equifax securities class action break jinx for shareholders?: Frankel "
    },
    {
        "content": "Equifax Inc  faced a storm of criticism on Friday over a hack that may have compromised personal data for some 143 million Americans  with consumers clamoring for answers and cyber security experts questioning the response to the massive breach. | Video ",
        "date": "09092017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "Criticism of Equifax data breach response mounts  shares tumble "
    },
    {
        "content": "WASHINGTON  Sept 11 Two key U.S. senators on Monday asked Equifax Inc to answer detailed questions on the breach of information about up to 143 million Americans' personal information  including whether U.S. government agency records were compromised in the hack.",
        "date": "09112017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "EXCLUSIVE-Key U.S. senators demand answers on Equifax hacking "
    },
    {
        "content": "TORONTO  Sept 12 Canada's privacy commissioner on Tuesday asked credit bureau Equifax Inc to quickly implement a system for allowing Canadians to determine if their data was compromised in a massive cyber attack that the company disclosed last week.",
        "date": "09122017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Canada watchdog asks Equifax to help citizens impacted by breach "
    },
    {
        "content": "WASHINGTON/NEW YORK New York Governor Andrew Cuomo said on Monday that he wants credit-reporting firms to comply with the state's cyber-security regulations  the latest government official to crack down on the industry in the wake of the massive Equifax hack.",
        "date": "09192017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "New York governor wants credit-reporting firms to follow cyber rules "
    },
    {
        "content": "WASHINGTON/NEW YORK  Sept 18 New York Governor Andrew Cuomo said on Monday that he wants credit-reporting firms to comply with the state's cyber-security regulations  the latest government official to crack down on the industry in the wake of the massive Equifax hack.",
        "date": "09192017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 6-New York governor wants credit-reporting firms to follow cyber rules "
    },
    {
        "content": "NEW YORK/WASHINGTON Nearly 40 states have joined a probe of Equifax Inc's  handling of a massive data breach that exposed valuable information on up to 143 million Americans and sent shares of the credit reporting company tumbling. | Video ",
        "date": "09142017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax CEO to testify to Congress as states begin probes "
    },
    {
        "content": "NEW YORK/WASHINGTON  Sept 13 Nearly 40 states have joined a probe of Equifax Inc's handling of a massive data breach that exposed valuable information on up to 143 million Americans and sent shares of the credit reporting company tumbling.",
        "date": "09142017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 2-Equifax CEO to testify to Congress as states begin probes "
    },
    {
        "content": "TORONTO  Sept 15 Canada's privacy commissioner said on Friday that it has launched an investigation into the massive data breach at Equifax Inc after receiving complaints from Canadian consumers.",
        "date": "09152017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 1-Canadian privacy commissioner launches probe of Equifax breach "
    },
    {
        "content": "NEW YORK Wall Street edged up to a record high on Wednesday as gains in consumer discretionary and energy stocks offset losses in technology heavyweight Apple Inc. | Video ",
        "date": "09132017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Wall Street hits record high - without help from Apple "
    },
    {
        "content": "* Equifax drops 14.6 pct  hits more than 1-1/2-year low (Updates with market close)",
        "date": "09132017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "US STOCKS-Wall Street hits record high - without help from Apple "
    },
    {
        "content": "Sept 8 Equifax Inc faced a storm of criticism on Friday over a hack that may have compromised personal data for some 143 million Americans  with consumers clamoring for answers and cyber security experts questioning the response to the massive breach.",
        "date": "09092017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 8-Criticism of Equifax data breach response mounts  shares tumble "
    },
    {
        "content": "Sept 11 More than two dozen lawsuits have been filed in the United States against Equifax Inc after the credit reporting company said thieves may have stolen personal information for 143 million Americans in one of the largest hackings ever.",
        "date": "09112017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Lawsuits against Equifax pile up "
    },
    {
        "content": "WASHINGTON  Sept 15 Connecticut's attorney general  and others investigating Equifax Inc's data breach  which affected some 143 million people  asked the company on Friday to disable links to collect fees for credit monitoring.",
        "date": "09152017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Connecticut attorney general  others ask Equifax to stop collecting fees "
    },
    {
        "content": "WASHINGTON  Sept 13 Rhode Island said on Wednesday that it had joined a group of states probing the Equifax data breach  as the credit company's shares fell another 14 percent amid growing pressure to explain its handling of the hack.",
        "date": "09132017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Rhode Island joins U.S. states investigating Equifax data breach "
    },
    {
        "content": "Equifax Inc faced a storm of criticism on Friday over a hack that may have compromised personal data for some 143 million Americans  with consumers clamoring for answers and cyber security experts questioning the response to the massive breach.",
        "date": "09082017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "Criticism of Equifax data breach response mounts  shares tumble "
    },
    {
        "content": "Equifax Inc  a provider of consumer credit scores  said personal details of as many as 143 million U.S. consumers were accessed by hackers between mid-May and July  in what could be one of the largest data breaches in the United States.",
        "date": "09072017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "Equifax says hack potentially exposed details of 143 mln consumers "
    },
    {
        "content": "Sept 12 Massachusetts attorney general announces her intention to sue equifax following recent security breach -- statement HEALEY SAYS SHE INTENDS TO ALLEGE THAT EQUIFAX LACKED APPROPRIATE SAFEGUARDS TO PROTECT CONSUMER DATA  VIOLATING STATE LAW STATE ATTORNEY GENERAL MAURA HEALEY SAYS LAWSUIT WOULD CONCERN EQUIFAX'S FAILURE TO PROTECT PERSONAL INFORMATION OF AS MANY AS NEARLY 3 MILLION MASSACHUSETTS RESIDENTS",
        "date": "09122017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "BRIEF-Massachusetts intends to sue Equifax over security breach "
    },
    {
        "content": "Shareholders haven’t had much success in securities class actions blaming investor losses on corporate data breach disclosures.",
        "date": "09132017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Will Equifax securities class action break jinx for shareholders? "
    },
    {
        "content": "Seven hours is all it took for Equifax Inc  to be hit with two lawsuits over a hacking that may have compromised personal information for 143 million American consumers.",
        "date": "09082017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax: First the hacking  then the lawsuits "
    },
    {
        "content": "Sept 8 Seven hours is all it took for Equifax Inc to be hit with two lawsuits over a hacking that may have compromised personal information for 143 million American consumers.",
        "date": "09082017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 2-Equifax: First the hacking  then the lawsuits "
    },
    {
        "content": "NEW YORK In the wake of the Equifax Inc  data breach that has exposed an estimated 143 million customer records to hackers  consumer credit experts have been recommending freezing one's credit as a protection against identity theft.",
        "date": "09122017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Your Money: Why you should freeze your credit now "
    },
    {
        "content": "* Dow flat  S&P off 0.03 pct  Nasdaq down 0.06 pct (Adds details  comment  updates prices)",
        "date": "09132017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "US STOCKS-Apple halts Wall St rally  but S&P ekes out record high "
    },
    {
        "content": "WASHINGTON Two committees in the U.S. House of Representatives will hold hearings on the Equifax Inc  data breach that may have exposed personal information of many as 143 million U.S. consumers  committee spokesmen said on Friday.",
        "date": "09082017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "U.S. House panels to hold hearings on Equifax data breach "
    },
    {
        "content": "NEW YORK  Sept 12 In the wake of the Equifax Inc data breach that has exposed an estimated 143 million customer records to hackers  consumer credit experts have been recommending freezing one's credit as a protection against identity theft.",
        "date": "09122017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "YOUR MONEY-Why you should freeze your credit now "
    },
    {
        "content": "WASHINGTON Thirty-six U.S. senators on Tuesday called on federal authorities to investigate the sale of nearly $2 million in shares of credit bureau Equifax Inc  by company executives after a massive data breach  and one compared their actions to insider trading.",
        "date": "09132017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "U.S. senator on Equifax hack: 'Somebody needs to go to jail' "
    },
    {
        "content": "WASHINGTON  Sept 8 Two committees in the U.S. House of Representatives will hold hearings on the Equifax Inc data breach that may have exposed personal information of many as 143 million U.S. consumers  committee spokesmen said on Friday.",
        "date": "09082017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 3-U.S. House panels to hold hearings on Equifax data breach "
    },
    {
        "content": "More than 30 lawsuits have been filed in the United States against Equifax Inc  after the credit reporting company said thieves may have stolen personal information for 143 million Americans in one of the largest hackings ever.",
        "date": "09122017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Lawsuits against Equifax pile up after massive data breach "
    },
    {
        "content": "WASHINGTON  Sept 12 Thirty-six U.S. senators on Tuesday called on federal authorities to investigate the sale of nearly $2 million in shares of credit bureau Equifax Inc by company executives after a massive data breach  and one compared their actions to insider trading.",
        "date": "09132017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 5-U.S. senator on Equifax hack: 'Somebody needs to go to jail' "
    },
    {
        "content": "* Says Equifax's security breach is credit negative but Baa1 rating unaffected​",
        "date": "09082017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "BRIEF-‍Moody's says Equifax security breach is credit negative  Baa1 rating unaffected​ "
    },
    {
        "content": "WASHINGTON Two key U.S. senators on Monday asked Equifax Inc  to answer detailed questions about a breach of information affecting up to 143 million Americans  including whether U.S. government agency records were compromised in the hack.",
        "date": "09122017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Key U.S. senators demand answers on Equifax hacking "
    },
    {
        "content": "NEW YORK (Reuters Breakingviews) - When Americans are hacked  they turn to three big consumer-credit agencies for help with identity theft. What happens when one of them  Equifax  is hit by hackers who steal sensitive personal information on 143 million people?",
        "date": "09082017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Breakingviews - Equifax hack provides an Exxon Valdez moment "
    },
    {
        "content": "NEW YORK  Sept 8 Less than a day after Equifax revealed one of the biggest data breaches in U.S. corporate history  the credit reporting company has already been hit with two proposed class actions in federal court – and one of those cases was filed by consumer lawyers who just won the right to move forward with gargantuan data breach litigation against Yahoo.",
        "date": "09082017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "COLUMN-Equifax data breach liability could hinge on where case is tried: Frankel "
    },
    {
        "content": "Less than a day after Equifax revealed one of the biggest data breaches in U.S. corporate history  the credit reporting company has already been hit with two proposed class actions in federal court – and one of those cases was filed by consumer lawyers who just won the right to move forward with gargantuan data breach litigation against Yahoo.",
        "date": "09082017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax data breach liability could hinge on where case is tried "
    },
    {
        "content": "Sept 8 At least two proposed federal class-action lawsuits have been filed against Equifax Inc after the credit reporting company disclosed a hacking that may have compromised personal information for 143 million American consumers.",
        "date": "09082017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "Equifax data breach spurs lawsuits "
    },
    {
        "content": "* ID Watchdog shareholders vote in favor of acquisition of the company by Equifax Source text for Eikon: Further company coverage:",
        "date": "08112017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "BRIEF-ID Watchdog shareholders vote in favor of acquisition of the company by Equifax "
    },
    {
        "content": "* Equifax acquires ID Watchdog  a leading identity protection and resolution services company",
        "date": "08112017",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "BRIEF-Equifax acquires ID Watchdog for about $63 million "
    },
    {
        "content": "* Q2 earnings per share view $1.57 -- Thomson Reuters I/B/E/S",
        "date": "07262017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "BRIEF-Equifax Q2 earnings per share $1.36 "
    },
    {
        "content": "* ID Watchdog signs definitive agreement to be acquired by equifax inc.",
        "date": "06162017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "BRIEF-ID Watchdog to be acquired by Equifax Inc "
    },
    {
        "content": "* Transunion - co and equifax have entered into agreement to launch theft protection feature  multi-bureau lock",
        "date": "06072017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "BRIEF-Transunion says entered into agreement with Equifax to launch theft protection feature "
    },
    {
        "content": "* Sees Q2 adjusted earnings per share $1.55 to $1.58 excluding items",
        "date": "04262017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "BRIEF-Equifax reports Q1 earnings per share $1.26 "
    },
    {
        "content": "A federal judge in Chicago has dismissed a proposed class action against U.S. credit bureau Equifax alleging it violated the Fair Credit Reporting Act by misreporting child support payments as delinquent.",
        "date": "04062017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "Judge tosses lawsuit alleging Equifax misreported child support "
    },
    {
        "content": "* Equifax Inc - CEO Richard F. Smith's 2016 total compensation $15 million versus. $12.9 million in 2015 - SEC filing  Source text: (http://bit.ly/2mYustK) Further company coverage:",
        "date": "03242017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "BRIEF-Equifax CEO Richard Smith's 2016 total compensation $15 mln "
    },
    {
        "content": "A U.S. regulator on Tuesday ordered credit reporting agencies TransUnion  and Equifax Inc  to pay more than $23.2 million in fines and restitution for deceiving consumers about the usefulness and cost of credit scores they bought.",
        "date": "01032017",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "U.S. fines TransUnion  Equifax for deceit over credit scores "
    },
    {
        "content": "* Elane stock elected to Equifax board of directors  Source text for Eikon:  Further company coverage:",
        "date": "11182016",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "BRIEF-Elane stock elected to Equifax board of directors "
    },
    {
        "content": "* FY2016 earnings per share view $5.38  revenue view $3.14 billion -- Thomson Reuters I/B/E/S",
        "date": "10262016",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "BRIEF-Equifax releases Q3 2016 results "
    },
    {
        "content": "* Equifax Inc- Alliance with Formfree  for Formfree to provide asset verification services  Source text for Eikon:  Further company coverage:",
        "date": "10242016",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "BRIEF-Equifax allies with Formfree for Formfree to provide asset verification services "
    },
    {
        "content": "* Following Hough's election  Equifax board will consist of 11 directors  including 10 independent directors  Source text for Eikon:  Further company coverage:",
        "date": "09192016",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "BRIEF-Tom Hough elected to Equifax board "
    },
    {
        "content": "* Q2 earnings per share view $1.36 -- Thomson Reuters I/B/E/S",
        "date": "07272016",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "BRIEF-Equifax posts Q2 adj. earnings $1.43/shr "
    },
    {
        "content": "* Says ceo richard smith's fy 2015 total compensation $12.9 million versus $13.9 million in fy 2014 - sec filing",
        "date": "03252016",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "BRIEF-Equifax CEO Richard Smith's 2015 total compensation was $12.9 mln "
    },
    {
        "content": "SYDNEY  Oct 6 U.S. credit agency Equifax Inc  sweetened its takeover offer for rival Veda Group Ltd  on Tuesday  winning the Australian target's approval  as the weak Aussie dollar and stumbling share market fuel a frenzy of inbound M&A deals.",
        "date": "10062015",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "U.S.-based Equifax sweetens $1.6 bln tilt at Australian rival Veda "
    },
    {
        "content": "LONDON British retailer Philip Green said on Thursday his struggling department store chain BHS had been acquired by buyout firm Retail Acquisitions.",
        "date": "03122015",
        "name": "Equifax Inc",
        "news_type": "topStory",
        "symbol": "EFX",
        "title": "UK retailer Philip Green offloads BHS to buyout firm "
    },
    {
        "content": "LONDON  March 12 British retailer Philip Green said on Thursday his struggling department store chain BHS had been acquired by buyout firm Retail Acquisitions.",
        "date": "03122015",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UPDATE 1-UK retailer Philip Green offloads BHS to buyout firm "
    },
    {
        "content": "LONDON  March 12 British retailer Philip Green said on Thursday his struggling department store chain BHS had been acquired by buyout firm Retail Acquisitions.",
        "date": "03122015",
        "name": "Equifax Inc",
        "news_type": "normal",
        "symbol": "EFX",
        "title": "UK retailer Philip Green's BHS sold to Retail Acquisitions "
    }
]