[
    {
        "content": "* Edison International reports third quarter 2017 results; increases guidance",
        "date": "10302017",
        "name": "Edison International",
        "news_type": "topStory",
        "symbol": "EIX",
        "title": "BRIEF-Edison International Q3 earnings per share $1.44 "
    },
    {
        "content": "* Edison International files for potential offering of senior notes due 2022; size undisclosed - SEC filing‍​ Source text: [http://bit.ly/2uT0igm] Further company coverage:",
        "date": "08172017",
        "name": "Edison International",
        "news_type": "topStory",
        "symbol": "EIX",
        "title": "BRIEF-Edison International files for potential offering of senior notes due 2022 "
    },
    {
        "content": "* Edison International reports second quarter 2017 results; increases guidance",
        "date": "07272017",
        "name": "Edison International",
        "news_type": "topStory",
        "symbol": "EIX",
        "title": "BRIEF-Edison International Q2 earnings per share $0.85 "
    },
    {
        "content": "* Q1 earnings per share view $0.90 -- Thomson Reuters I/B/E/S",
        "date": "05012017",
        "name": "Edison International",
        "news_type": "topStory",
        "symbol": "EIX",
        "title": "BRIEF-Edison International Q1 earnings per share $1.11 "
    },
    {
        "content": "* Southern California Edison-Edison international's units got decision from ICC International court of arbitration on claims against Mitsubishi heavy",
        "date": "03132017",
        "name": "Edison International",
        "news_type": "topStory",
        "symbol": "EIX",
        "title": "BRIEF-Southern California Edison- Edison international's units got decision from ICC international court of arbitration on claims against Mitsubishi Heavy "
    },
    {
        "content": "TOKYO Japan's Mitsubishi Heavy Industries Ltd  (MHI) expects arbitrators to rule by the end of March on a compensation claim related to the shutdown of California's San Onofre nuclear plant brought by a unit of Edison International .",
        "date": "02022017",
        "name": "Edison International",
        "news_type": "topStory",
        "symbol": "EIX",
        "title": "Japan's Mitsubishi Heavy expects ruling on San Onofre nuclear plant claim by end March: CEO "
    },
    {
        "content": "TOKYO  Feb 2 Japan's Mitsubishi Heavy Industries Ltd (MHI) expects arbitrators to rule by the end of March on a compensation claim related to the shutdown of California's San Onofre nuclear plant brought by a unit of Edison International.",
        "date": "02022017",
        "name": "Edison International",
        "news_type": "normal",
        "symbol": "EIX",
        "title": "Japan's Mitsubishi Heavy expects ruling on San Onofre nuclear plant claim by end March-CEO "
    },
    {
        "content": "A U.S. appeals court on Friday revived a nearly decade-old lawsuit by Edison International employees in California who say the utility favored higher-cost mutual funds over lower-cost ones in its retirement plan.",
        "date": "12162016",
        "name": "Edison International",
        "news_type": "topStory",
        "symbol": "EIX",
        "title": "U.S. court revives long-running case over Edison International 401(k) plan "
    },
    {
        "content": "* FY2016 earnings per share view $3.91 -- Thomson Reuters I/B/E/S",
        "date": "11012016",
        "name": "Edison International",
        "news_type": "topStory",
        "symbol": "EIX",
        "title": "BRIEF-Edison International Q3 EPS $1.29 vs I/B/E/S view $1.27 "
    },
    {
        "content": "* Theodore F. Craver Jr.  Edison International's chairman  president and chief executive officer  will retire effective Sept. 30  2016",
        "date": "05252016",
        "name": "Edison International",
        "news_type": "topStory",
        "symbol": "EIX",
        "title": "BRIEF-Edison International says CEO Theodore Craver Jr to retire "
    },
    {
        "content": "* Edison International reports first quarter 2016 results; reaffirms 2016 earnings guidance",
        "date": "05022016",
        "name": "Edison International",
        "news_type": "topStory",
        "symbol": "EIX",
        "title": "BRIEF-Edison International reports first quarter 2016 results "
    },
    {
        "content": "April 13 A U.S. appeals court on Wednesday dismissed a lawsuit by Edison International employees in California who accused the utility of favoring higher-cost mutual funds over lower-cost ones in its retirement plan  despite a U.S. Supreme Court ruling backing the workers.",
        "date": "04132016",
        "name": "Edison International",
        "news_type": "normal",
        "symbol": "EIX",
        "title": "Edison International wins dismissal of U.S. lawsuit over 401(k) plan "
    },
    {
        "content": "* Says CEO Theodore Craver's FY 2015 total compensation $11.1 million versus $14.2 million in FY 2014 - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "03182016",
        "name": "Edison International",
        "news_type": "topStory",
        "symbol": "EIX",
        "title": "BRIEF-Edison international announces CEO FY 2015 total compensation "
    },
    {
        "content": "WASHINGTON The U.S. Supreme Court on Monday revived claims made by Edison Internationalemployees who accused the utility of favoring higher-cost mutual funds over lower-cost ones in its retirement plan.",
        "date": "05182015",
        "name": "Edison International",
        "news_type": "normal",
        "symbol": "EIX",
        "title": "U.S. top court hands win to employees in Edison International 401(k) dispute "
    },
    {
        "content": "WASHINGTON  May 18 The U.S. Supreme Court on Monday revived claims made by Edison International  employees who accused the utility of favoring higher-cost mutual funds over lower-cost ones in its retirement plan.",
        "date": "05182015",
        "name": "Edison International",
        "news_type": "normal",
        "symbol": "EIX",
        "title": "UPDATE 1-U.S. top court hands win to employees in Edison International 401(k) dispute "
    },
    {
        "content": "LONDON  April 13 Falkland Oil and Gas (FOGL)  said on Monday it had decided together with its joint venture partners Noble Energy and Edison International  to shelve plans to drill a second oil well in the south and east Falkland basin.",
        "date": "04132015",
        "name": "Edison International",
        "news_type": "topStory",
        "symbol": "EIX",
        "title": "Falkland Oil and Gas  partners shelve parts of Falklands oil drilling "
    },
    {
        "content": "WASHINGTON  Feb 24 The U.S. Supreme Court on Tuesday appeared set to revive certain claims in a class action lawsuit against Edison International by employees who accused the utility of favoring higher-cost mutual funds over-lower cost ones in its retirement plan.",
        "date": "02242015",
        "name": "Edison International",
        "news_type": "normal",
        "symbol": "EIX",
        "title": "U.S. justices signal support for plaintiffs in Edison 401(k) case "
    },
    {
        "content": "WASHINGTON  Feb 24 The U.S. Supreme Court on Tuesday appeared ready to give Edison International  employees who accused the utility of favoring higher-cost mutual funds over lower-cost ones in its retirement plan a chance to revive some of their claims.",
        "date": "02242015",
        "name": "Edison International",
        "news_type": "normal",
        "symbol": "EIX",
        "title": "UPDATE 1-U.S. justices signal support for plaintiffs in Edison 401(k) case "
    }
]