[
    {
        "content": "* Enbridge Inc files for mixed shelf of up to $4.9 billion – SEC filing‍​ Source text - (http://bit.ly/2yxtafV) Further company coverage:",
        "date": "11132017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge Inc files for mixed shelf of up to $4.9 billion "
    },
    {
        "content": "* Fintech Select enters definitive agreement with Canadian Bitcoins",
        "date": "11132017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Fintech Select enters definitive agreement with Canadian Bitcoins "
    },
    {
        "content": "CALGARY  Alberta Canada's Enbridge Inc  is eyeing opportunities to expand its pipeline network if the proposed Capline pipeline reversal goes ahead  providing access to the eastern Gulf Coast refining market for Canadian oil  the company said on Thursday.",
        "date": "11022017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge weighing opportunities from potential Capline reversal "
    },
    {
        "content": "CALGARY  Alberta  Nov 2 Canada's Enbridge Inc is eyeing opportunities to expand its pipeline network if the proposed Capline pipeline reversal goes ahead  providing access to the eastern Gulf Coast refining market for Canadian oil  the company said on Thursday.",
        "date": "11022017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 3-Enbridge weighing opportunities from potential Capline reversal "
    },
    {
        "content": "* Expecting final decision from Minnesota on Line 3 pipeline approval in Q2 2018  line in service by H2 2019",
        "date": "11022017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge expecting Line 3 pipeline to start up in H2 2019 "
    },
    {
        "content": "* Q3 earnings per share view c$0.43 -- Thomson Reuters I/B/E/S",
        "date": "11022017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge reports Q3 earnings per share C$0.47 "
    },
    {
        "content": "* Q3 earnings per share view C$0.43 -- Thomson Reuters I/B/E/S",
        "date": "11022017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge Q3 adjusted earnings per share C$0.39 "
    },
    {
        "content": "Nov 2 Enbridge Inc   North America's largest pipeline operator  on Thursday reported a quarterly profit  getting a boost from the acquisition of natural gas pipeline company Spectra Energy Corp.",
        "date": "11022017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge posts profit on Spectra deal "
    },
    {
        "content": "CALGARY  Alberta The United States issued a long-awaited permit covering a three-mile segment of Enbridge Inc's  Line 67 crude oil pipeline on Monday  allowing the company to nearly double capacity on the cross-border conduit.",
        "date": "10162017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "U.S. issues permit to expand Enbridge cross-border oil pipeline "
    },
    {
        "content": "Canadian energy company Enbridge Inc  and Michigan's DTE Energy Co  plan to complete their $2 billion Nexus natural gas pipeline from Ohio to Ontario late in the third quarter of 2018  they said on Thursday.",
        "date": "10122017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge  DTE to finish Ohio-Ontario Nexus gas pipe in third quarter 2018 "
    },
    {
        "content": "CALGARY  Alberta  Oct 16 After years of regulatory delays  the United States on Monday issued a presidential permit to a three-mile segment of Enbridge Inc's Line 67 crude oil pipeline  which will enable the company to nearly double capacity on the cross-border conduit.",
        "date": "10162017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "U.S. issues presidential permit to Enbridge cross-border crude pipeline "
    },
    {
        "content": "Oct 12 Canadian energy company Enbridge Inc and Michigan's DTE Energy Co plan to complete their $2 billion Nexus natural gas pipeline from Ohio to Ontario late in the third quarter of 2018  they said on Thursday.",
        "date": "10122017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge  DTE to finish Ohio-Ontario Nexus gas pipe in Q3 2018 "
    },
    {
        "content": "CALGARY  Alberta Regulatory hearings for Enbridge Inc's   C$8.2 billion ($6.5 billion) Line 3 crude oil pipeline upgrade will begin on Tuesday in the U.S. state of Minnesota  which presents the last hurdle for the biggest project by North America's top pipeline operator.",
        "date": "09262017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Minnesota public hearings begin for Enbridge's $6.5 billion oil pipe expansion "
    },
    {
        "content": "CALGARY  Alberta  Sept 26 Regulatory hearings for Enbridge Inc's  C$8.2 billion ($6.5 billion) Line 3 crude oil pipeline upgrade will begin on Tuesday in the U.S. state of Minnesota  which presents the last hurdle for the biggest project by North America's top pipeline operator.",
        "date": "09262017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Minnesota public hearings begin for Enbridge's $6.5 bln oil pipe expansion "
    },
    {
        "content": "* Enbridge inc files for mixed shelf of up to $7.0 billion - SEC Filing‍​ Source text: (http://bit.ly/2xEqznG) Further company coverage:",
        "date": "09152017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge files for mixed shelf of up to $7 bln "
    },
    {
        "content": "CALGARY  Alberta Enbridge Inc's upgrade of its Line 3 crude oil pipeline hit an obstacle on Monday after the U.S. state of Minnesota told a regulatory committee that it has no need for the project  and that the existing pipe should be shut.",
        "date": "09122017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge's Line 3 oil pipeline upgrade challenged by Minnesota government "
    },
    {
        "content": "CALGARY  Alberta  Sept 11 Enbridge Inc's upgrade of its Line 3 crude oil pipeline hit an obstacle on Monday after the U.S. state of Minnesota told a regulatory committee that it has no need for the project  and that the existing pipe should be shut.",
        "date": "09122017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge's Line 3 oil pipeline upgrade challenged by Minnesota govt "
    },
    {
        "content": "* Enbridge gas distribution announces sale of St. Lawrence Gas business Source text for Eikon: Further company coverage:",
        "date": "08312017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "CORRECTED-BRIEF-Enbridge Gas Distribution to sell St. Lawrence Gas business in deal for $70 million​ "
    },
    {
        "content": "OSLO  Aug 29 Nordic investors rejected on Tuesday allegations in a lawsuit by the operator of Dakota Access Pipeline (DAPL) that they divested from the project due to pressure from Greenpeace and other environmental groups.",
        "date": "08292017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Nordic investors reject Dakota pipeline operator’s allegations "
    },
    {
        "content": "Regulatory delays and route modifications will increase the cost of Enbridge Inc's    Line 3 pipeline replacement project  the company said on Thursday  as it reported a lower-than-expected quarterly profit.",
        "date": "08032017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge's Line 3 to cost more  profit lower-than-expected "
    },
    {
        "content": "Aug 3 Regulatory delays and route modifications will increase the cost of Enbridge Inc's   Line 3 pipeline replacement project  the company said on Thursday  as it reported a lower-than-expected quarterly profit.",
        "date": "08032017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 3-Enbridge's Line 3 to cost more  profit lower-than-expected "
    },
    {
        "content": "* Q2 earnings per share view c$0.48 -- Thomson Reuters I/B/E/S",
        "date": "08032017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge reports Q2 adjusted earnings per share C$0.41 "
    },
    {
        "content": "Aug 3 Enbridge Inc   North America's largest pipeline operator  on Thursday reported a quarterly profit that more than tripled  helped partly by its purchase of natural gas pipeline company Spectra Energy Corp.",
        "date": "08032017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge second-quarter profit more than triples "
    },
    {
        "content": "OTTAWA Canada's top court on Wednesday handed aboriginals a partial victory on the need to be consulted on resource projects  throwing out permits to conduct seismic testing for oil and gas in the north but dismissing a separate attempt to quash changes to an Enbridge Inc pipeline.",
        "date": "07262017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Canada top court rules for aboriginals on seismic testing permits "
    },
    {
        "content": "OTTAWA  July 26 Canada's top court ruled on Wednesday that aboriginals were adequately consulted on changes to an Enbridge Inc oil pipeline  dismissing an attempt to quash the national energy regulator's approval of the project.",
        "date": "07262017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canada's top court finds aboriginals consulted on Enbridge pipeline "
    },
    {
        "content": "CALGARY  Alberta  July 24 Enbridge Inc's move not to ration space on heavy oil pipelines out of western Canada for the first time in 16 months is likely to give producers only a short respite from difficulties in getting crude to market  industry players said.",
        "date": "07242017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Break in rationing on Enbridge Canada pipelines likely short lived "
    },
    {
        "content": "* Enbridge announces pricing of tender offer by Spectra Energy Capital  LLC",
        "date": "07122017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge announces pricing of tender offer by Spectra Energy Capital LLC "
    },
    {
        "content": "CALGARY  Alberta  July 12 Enbridge inc has taken a natural gas compressor station offline after wildfires in the western Canadian province of British Columbia  but there had been no \"significant reduction\" in volumes shipped  the company said on Wednesday.",
        "date": "07122017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge gas compressor offline after western Canada wildfires "
    },
    {
        "content": "* Enbridge announces expiration and results of offer by Spectra Energy Capital  LLC to purchase notes due in 2019",
        "date": "07072017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge announces expiration and results of offer by Spectra Energy Capital LLC to purchase notes due in 2019 "
    },
    {
        "content": "CALGARY  Alberta  June 21 The U.S. State of Michigan said on Wednesday it has fired a consultant after state officials discovered a conflict of interest with an employee of the company conducting an independent analysis on the risks of an oil spill from Calgary-based Enbridge Inc's Line 5 pipeline in the Great Lakes.",
        "date": "06212017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Michigan fires contractor doing Enbridge oil pipeline risk analysis "
    },
    {
        "content": "CALGARY  Alberta  June 12 Canada's National Energy Board (NEB) will push for a shift in standards for pipeline parts after TransCanada Corp and Enbridge Inc discovered some that they were using had been substandard  a senior regulatory official told Reuters.",
        "date": "06122017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Canada regulator plans new rules as firms find bad pipeline parts "
    },
    {
        "content": "HOUSTON  June 14 Strong demand for shale oil-and-gas infrastructure is giving rise to an important new financing vehicle for pipeline  processing and storage ventures that are needed to get more shale fuels to market.",
        "date": "06142017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Surging shale spawns new financing structure for energy infrastructure "
    },
    {
        "content": "HOUSTON  June 14 Strong demand for shale oil-and-gas infrastructure is giving rise to an important new financing vehicle for pipeline  processing and storage ventures that are needed to get more shale fuels to market.",
        "date": "06142017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "RPT-Surging shale spawns new financing structure for energy infrastructure "
    },
    {
        "content": "CALGARY  Alberta  June 8 Canada's Enbridge Inc will take advantage of the uncertainty facing competitors' pipelines to gain market share  including starting early discussions on a new tolling agreement after 2022  a senior executive said on Thursday.",
        "date": "06082017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canada's Enbridge eyes market share as competitors' pipes in limbo "
    },
    {
        "content": "CALGARY  Alberta Enbridge Inc  North America's largest energy infrastructure company  said on Thursday it may acquire more assets and forecast a rise in adjusted earnings this year following its purchase of Spectra Energy Corp.",
        "date": "05112017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Canada's Enbridge eyes acquisitions and profit rise on Spectra deal "
    },
    {
        "content": "CALGARY  Alberta  May 11 Enbridge Inc   North America's largest energy infrastructure company  said on Thursday it may acquire more assets and forecast a rise in adjusted earnings this year following its purchase of Spectra Energy Corp.",
        "date": "05112017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 3-Canada's Enbridge eyes acquisitions and profit rise on Spectra deal "
    },
    {
        "content": "May 11 Enbridge Inc   Canada's largest pipeline company  reported on Thursday a smaller quarterly profit  hurt by lower earnings from its liquids pipeline business and a smaller derivatives gain.",
        "date": "05112017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge profit falls on weak liquids pipeline business "
    },
    {
        "content": "* Enbridge inc - company expects to generate consolidated acffo per share of between $3.60 and $3.90 for full 2017 year",
        "date": "05112017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge Q1 adjusted earnings per share C$0.57 "
    },
    {
        "content": "* Enbridge Inc announces additional quarterly dividend increase Source text for Eikon: Further company coverage:",
        "date": "05042017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge announces additional quarterly dividend increase "
    },
    {
        "content": "CALGARY  Alberta The growing protest movement against U.S. oil and gas pipelines has so far focused on stopping or delaying new construction  with some high-profile successes.",
        "date": "05012017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Next battleground: An aging Great Lakes pipeline stirs new protest "
    },
    {
        "content": "* Enbridge Inc announces conclusion and outcomes of Enbridge Energy Partners L.P. strategic review",
        "date": "04282017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge Inc announces conclusion and outcomes of Enbridge Energy Partners L.P. strategic review "
    },
    {
        "content": "* Enbridge Inc announces conclusion and outcomes of Enbridge Energy Partners L.P strategic review",
        "date": "04282017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge announces conclusion of Enbridge Energy Partners strategic review "
    },
    {
        "content": "* Enbridge recommends shareholders reject TRC Capital's \"mini-tender offer\"",
        "date": "04072017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge recommends shareholders reject TRC Capital's \"mini-tender offer\" "
    },
    {
        "content": "* Enbridge Inc. raises $0.5 billion through secondary offering of Enbridge Income Fund Holdings Inc. shares; achieves previously announced asset monetization target",
        "date": "03272017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge raises $0.5 bln through secondary offering of Enbridge Income Fund Holdings shares "
    },
    {
        "content": "NEW YORK Enbridge Inc  has agreed to sell its dormant crude-by-rail terminal outside Philadelphia to Union Core America  a privately held company that wants to make road fuels with high  concentrations of ethanol.",
        "date": "03292017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Green-fuel company to buy Enbridge's East Coast rail facility "
    },
    {
        "content": "CALGARY  Alberta Canada's Enbridge Inc said on Wednesday it would cut about 1 000 positions  or 6 percent of its work force  after buying Spectra Energy Corp of Houston  the first layoffs for the combined energy infrastructure company  the biggest in North America.",
        "date": "03222017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Canada's Enbridge to cut 1 000 jobs after buying Spectra "
    },
    {
        "content": "CALGARY  Alberta  March 22 Canada's Enbridge Inc  said on Wednesday it would cut about 1 000 positions  or 6 percent of its work force  after buying Spectra Energy Corp  of Houston  the first layoffs for the combined energy infrastructure company  the biggest in North America.",
        "date": "03222017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 2-Canada's Enbridge to cut 1 000 jobs after buying Spectra "
    },
    {
        "content": "CALGARY  Alberta  March 22 Canada's Enbridge Inc  said on Wednesday it would cut about 1 000 positions  or 6 percent of its work force  after buying Spectra Energy Corp  of Houston.",
        "date": "03222017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canada's Enbridge to cut 1 000 positions after buying Spectra "
    },
    {
        "content": "Crude oil that leaked into a creek in the Canadian province of Alberta from an Enbridge Inc storage facility has been contained but there is no estimate yet of its volume  the National Energy Board regulator said on Tuesday.",
        "date": "03212017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge oil leak in Canada contained  volume unknown: regulator "
    },
    {
        "content": "March 21 Crude oil that leaked into a creek in the Canadian province of Alberta from an Enbridge Inc storage facility has been contained but there is no estimate yet of its volume  the National Energy Board regulator said on Tuesday.",
        "date": "03212017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 2-Enbridge oil leak in Canada contained  volume unknown -regulator "
    },
    {
        "content": "TORONTO A push by Canadian companies and pension funds to aggressively pursue overseas acquisitions is helping global investment banks to win a bigger share of M&A advisory mandates and prompting once-dominant domestic rivals to beef up their international operations.",
        "date": "03212017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Record outbound Canadian M&A gives foreign banks an upper hand "
    },
    {
        "content": "March 21 Canada's energy regulator said there were no injuries  fire or evacuations from an oil leak that occurred on Monday at Enbridge Inc's storage facility in Strathcona County  Alberta.",
        "date": "03212017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canada's energy regulator says no injuries  fire from Enbridge leak "
    },
    {
        "content": "CALGARY  Alberta  Feb 17 Two new crude oil export pipelines will provide enough capacity to ship Canadian production to market until at least the mid 2020s  Enbridge Inc  Chief Executive Al Monaco said on Friday  making clear his company's Line 3 should be one of them.",
        "date": "03112017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "CORRECTED-UPDATE 3-Enbridge CEO says Canada only needs two more export pipelines "
    },
    {
        "content": "CALGARY  Alberta  March 3 Enbridge Inc is restricting volumes on feeder lines of light crude oil by 10 percent as a result of the shutdown on its Line 2a pipeline  according to a shipper notice seen by Reuters.",
        "date": "03032017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge restricting light oil feeder lines after Line 2a leak "
    },
    {
        "content": "Houston  March 6 Enbridge Chief Executive Al Monaco said opposition to new energy transportation routes is driving permitting delays and increasing costs for new pipeline projects.",
        "date": "03062017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "CERAWEEK -Pipeline opposition driving permit delays  raising costs -Enbridge CEO "
    },
    {
        "content": "* Spectra Energy Partners announces change in general partner and appointment of new directors and officers",
        "date": "02272017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Spectra Energy Partners reports change in general partner "
    },
    {
        "content": "* Enbridge and Spectra Energy complete merger  Source text for Eikon:  Further company coverage:",
        "date": "02272017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge and Spectra Energy report completion of merger "
    },
    {
        "content": "* Enbridge and Spectra Energy merger expected to close February 27  2017  Source text for Eikon:  Further company coverage:",
        "date": "02232017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge  Spectra Energy merger expected to close February 27  2017 "
    },
    {
        "content": "CALGARY  Alberta  Feb 21 Part of the shut Enbridge Inc 2A pipeline will need to be drained for \"several days \" Canada's National Energy Board regulator said on Tuesday  without giving an estimation of when it will be back online.",
        "date": "02212017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Shut Enbridge pipeline to be drained for 'several days' -regulator "
    },
    {
        "content": "CALGARY  Alberta Part of the shut Enbridge Inc  2A pipeline in Alberta will need to be drained for several days  Canada's National Energy Board said on Tuesday  and it is not clear when shipments will resume.",
        "date": "02222017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Shut Enbridge pipeline in Alberta to be drained for several days "
    },
    {
        "content": "CALGARY  Alberta  Feb 21 Part of the shut Enbridge Inc 2A pipeline in Alberta will need to be drained for several days  Canada's National Energy Board said on Tuesday  and it is not clear when shipments will resume.",
        "date": "02222017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 3-Shut Enbridge pipeline in Alberta to be drained for several days "
    },
    {
        "content": "* Enbridge and Spectra Energy obtain FTC clearance for their proposed combination",
        "date": "02162017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge and Spectra Energy obtain FTC clearance for their proposed combination "
    },
    {
        "content": "CALGARY  Alberta Two new crude oil export pipelines will provide enough capacity to ship Canadian production to market until at least the mid 2020s  Enbridge Inc  Chief Executive Al Monaco said on Friday  making clear his company's Line 3 should be one of them.",
        "date": "02172017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge CEO says Canada only needs two more export pipelines "
    },
    {
        "content": "WASHINGTON Canada's Enbridge Inc  and Spectra Energy Corp  have won U.S. antitrust approval to merge with conditions  the Federal Trade Commission said on Thursday.",
        "date": "02162017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "FTC approves Enbridge deal to buy Spectra with conditions "
    },
    {
        "content": "WASHINGTON  Feb 16 Canada's Enbridge Inc  and Spectra Energy Corp have won U.S. antitrust approval for a $28 billion merger that will create the largest North American energy infrastructure company.",
        "date": "02162017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 1-FTC approves Enbridge deal to buy Spectra with conditions "
    },
    {
        "content": "Energy infrastructure firms Enbridge Inc  and Spectra Energy Corp have agreed to settle charges their merger would hurt competition in the market for gas pipeline transportation in three areas off the Louisiana coast  the Federal Trade Commission said on Thursday.",
        "date": "02162017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge  Spectra Energy to settle charges merger would harm competition - FTC "
    },
    {
        "content": "* Says Mainline crude oil pipeline system is getting pretty close to full utilization",
        "date": "02172017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge says Dakota Access pipeline could be in service in Q2 2017 "
    },
    {
        "content": "WASHINGTON  Feb 16 Energy infrastructure firms Enbridge Inc and Spectra Energy Corp have agreed to settle charges their merger would hurt competition in the market for gas pipeline transportation in three areas off the Louisiana coast  the Federal Trade Commission said on Thursday.",
        "date": "02162017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge  Spectra Energy to settle charges merger would harm competition -FTC "
    },
    {
        "content": "Feb 17 Enbridge Inc   Canada's largest pipeline company  reported a smaller-than-expected quarterly profit on Friday as expenses jumped and the company said its deal to buy Spectra Energy Corp was on track to close this quarter.",
        "date": "02172017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "CORRECTED-UPDATE 1-Canada's Enbridge misses profit estimate as expenses rise "
    },
    {
        "content": "* Enbridge Inc - adjusted earnings were $522 million or $0.56 per common share for q4",
        "date": "02172017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge Q4 adjusted EPS 56 Canadian cents "
    },
    {
        "content": "Feb 17 Enbridge Inc   Canada's largest pipeline company  reported a 3.4 percent fall in fourth-quarter profit  hurt by charges  including for asset impairment and restructuring.",
        "date": "02172017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canada's Enbridge post drop in profit  hurt by charges "
    },
    {
        "content": "FRANKFURT Canadian energy infrastructure group Enbridge Inc  has bought a 49.9 percent stake in EnBW's  1.8 billion euro ($1.9 billion) North Sea offshore park Hohe See  EnBW said on Friday.",
        "date": "02172017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge buys stake in EnBW's 1.8 billion euro Hohe See wind park "
    },
    {
        "content": "MPLX LP filed a petition with the Federal Energy Regulatory Commission on Wednesday seeking permission to expand the 230 000 barrel per day (bpd) Ozark crude pipeline.",
        "date": "02162017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "MPLX files with U.S. agency to expand Ozark pipeline "
    },
    {
        "content": "Feb 16 MPLX LP filed a petition with the Federal Energy Regulatory Commission on Wednesday seeking permission to expand the 230 000 barrel per day (bpd) Ozark crude pipeline.",
        "date": "02162017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 1-MPLX files with U.S. agency to expand Ozark pipeline "
    },
    {
        "content": "* Enbridge has option to participate in expansion project   (Adds Enbridge option on Albatros wind park  further details on financing  background)",
        "date": "02172017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 1-Enbridge buys stake in EnBW's 1.8 bln euro Hohe See wind park "
    },
    {
        "content": "Feb 16 MPLX LP filed a petition with the Federal Energy Regulatory Commission on Wednesday seeking permission to expand Ozark Pipeline  which carries crude oil from Cushing  Oklahoma to Wood River  Illinois.",
        "date": "02162017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "MPLX files with U.S. to expand Ozark pipeline expansion project "
    },
    {
        "content": "FRANKFURT  Feb 17 EnBW  Germany's third largest utility group  said it had teamed up with Canada's Enbridge Inc for its offshore park Hohe See in the North Sea  which has an investment volume of around 1.8 billion euros ($1.92 billion).",
        "date": "02172017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge buys stake in EnBW's Hohe See wind park "
    },
    {
        "content": "* Enbridge - Company to participate in construction operation of project. Once in service in late 2019  company's total investment in project to be $1.7 billion",
        "date": "02172017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge Partners with EnBW on 497-MW German offshore wind project "
    },
    {
        "content": "* Oceanic and 154619 Canada Inc finalize settlement of 2016 advance royalty payment  Source text for Eikon:  Further company coverage:",
        "date": "02012017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Oceanic and 154619 Canada Inc finalize settlement of 2016 advance royalty payment "
    },
    {
        "content": "Enbridge Inc said on Friday it would pay about $170 million to take private Midcoast Energy Partners LP  which also has a stake in natural gas pipelines owned by Enbridge Energy Partners LP.",
        "date": "01272017",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge to take Midcoast Energy Partners private for $170 million "
    },
    {
        "content": "Jan 27 Enbridge Inc said on Friday it would pay about $170 million to take private Midcoast Energy Partners LP  which also has a stake in natural gas pipelines owned by Enbridge Energy Partners LP.",
        "date": "01272017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge to take Midcoast Energy Partners private for $170 mln "
    },
    {
        "content": "* Enbridge announces privatization of midcoast energy partners lp and provides update on enbridge energy partners strategic review",
        "date": "01272017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge announces privatization of Midcoast Energy Partners LP "
    },
    {
        "content": "* Enbridge Energy Partners  L.P. declares distribution for fourth quarter 2016; announces 2017 financial outlook and strategic review update",
        "date": "01272017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge Energy Partners expects 2017 adj. EBITDA to be $1.7 - $1.8 bln "
    },
    {
        "content": "CALGARY  Alberta  Jan 10 Enbridge Inc  has approved a new stream of heavy Canadian crude for export on one of its major oil pipelines to the United States  according to four trading sources. The only problem? No one wants it.",
        "date": "01102017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Refiners shun new Canadian crude blend offer from Enbridge line "
    },
    {
        "content": "CALGARY  Alberta  Jan 11 Enbridge Inc  may be set for a bruising legal battle in Wisconsin after a Native American tribe voted against renewing land use agreements on a major crude oil pipeline  potentially shutting down a conduit that has been in operation since the 1950s  legal experts said.",
        "date": "01112017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge may face tough legal battle to keep 60-yr-old pipeline running "
    },
    {
        "content": "CALGARY  Alberta Enbridge Inc may be set for a bruising legal battle in Wisconsin after a Native American tribe voted against renewing land use agreements on a major crude oil pipeline  potentially shutting down a conduit that has been in operation since the 1950s  legal experts said.",
        "date": "01112017",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge may face tough legal battle to keep 60-year-old pipeline running "
    },
    {
        "content": "* Says size of offering has been increased to 30 million from 20 million",
        "date": "11152016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge increases size of preferred share offering "
    },
    {
        "content": "* Enbridge Inc - To sell 20 million cumulative redeemable minimum rate reset preference shares  series 17 at a price of $25.00 per share",
        "date": "11152016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge announces $500 million preferred share offering "
    },
    {
        "content": "CALGARY  Alberta Enbridge Inc   Canada's largest pipeline company  said on Thursday it has identified C$5 billion to C$6 billion ($3.74 billion to $4.49 billion) in potential asset sales  on top of an already announced C$2 billion divestiture target.",
        "date": "11032016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Canada's Enbridge mulls up to $4.5 billion in extra divestitures "
    },
    {
        "content": "CALGARY  Alberta  Nov 3 Enbridge Inc  Canada's largest pipeline company  said on Thursday it has identified C$5 billion to C$6 billion ($3.74 billion to $4.49 billion) in potential asset sales  on top of an already announced C$2 billion divestiture target.",
        "date": "11032016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 3-Canada's Enbridge mulls up to $4.5 bln in extra divestitures "
    },
    {
        "content": "* Says highly confident Line 3 replacement project will be in service in 2019  but possibility that date could slip",
        "date": "11032016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge 2016 maintenance capital may be below C$800-C$850 mln "
    },
    {
        "content": "* Q3 earnings per share view c$0.49 -- Thomson Reuters I/B/E/S  Source text for Eikon:  Further company coverage:",
        "date": "11032016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge Inc posts Q3 adj EPS C$0.47 "
    },
    {
        "content": "* Enbridge inc- expect full year financial results to come in well within previously announced 2016 guidance ranges",
        "date": "11032016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge Q3 adjusted earnings per share c$0.47 "
    },
    {
        "content": "Nov 2 Canada's largest pipeline company Enbridge Inc   which is buying Spectra Energy Corp  in a $28 billion deal  reported a smaller quarterly loss on Thursday  as it moved more volume of crude oil and natural gas liquids.",
        "date": "11032016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canada's Enbridge reports smaller quarterly loss "
    },
    {
        "content": "Oct 27 Marathon Petroleum Corp reported a much smaller-than-expected quarterly profit on lower pricing and said it would place some assets into MPLX Inc  the master limited partnership that it spun off in 2012.",
        "date": "10272016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 2-Marathon Petroleum profit misses; strategic moves planned "
    },
    {
        "content": "Oct 27 Marathon Petroleum Corp reported an 84.7 percent drop in quarterly profit  partly hurt by lower refining margins.",
        "date": "10272016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Refiner Marathon Petroleum reports 84.7 pct fall in profit "
    },
    {
        "content": "CALGARY  Alberta  Oct 19 Enbridge Inc  Canada's largest pipeline company  is laying off 5 percent of its work force after an organizational review  a spokeswoman said on Wednesday.",
        "date": "10192016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge cuts 5 percent of work force in Canada  U.S. "
    },
    {
        "content": "CALGARY  Alberta  Oct 19 Enbridge Inc  Canada's largest pipeline company  is laying off 5 percent of its work force after an organizational review  a spokeswoman said on Wednesday.",
        "date": "10192016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 2-Enbridge cuts 5 percent of work force in Canada  U.S. "
    },
    {
        "content": "* Saudis says market balancing; Exxon says shale will return   (Adds Enbridge's layoff announcement  paragraph 14)",
        "date": "10192016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 10-Oil up over 2 pct; U.S. crude at 15-month high on big drawdown "
    },
    {
        "content": "* Enbridge to cut 370 jobs in Canada  160 in the U.S. - Globe and Mail   Source : (http://bit.ly/2e1Mh9s)",
        "date": "10192016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge to cut 370 jobs in Canada  160 in the U.S. - Globe and Mail "
    },
    {
        "content": "* Enbridge Inc says  closing of transaction is expected to occur around end of Q4 of 2016",
        "date": "09292016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge inc. Announces $1.075-billion sale of South Prairie region assets "
    },
    {
        "content": "TORONTO Oil company Enbridge Inc's Northern Gateway pipeline project will not appeal a recent Canadian Federal Court of Appeal decision that reversed its approval pending consultations with aboriginal groups  it said on Tuesday.",
        "date": "09202016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Northern Gateway pipeline project will not appeal Canadian court decision "
    },
    {
        "content": "TORONTO  Sept 20 Oil company Enbridge Inc's  Northern Gateway pipeline project will not appeal a recent Canadian Federal Court of Appeal decision that reversed its approval pending consultations with aboriginal groups  it said on Tuesday.",
        "date": "09202016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 1-Northern Gateway pipeline project will not appeal Canadian court decision "
    },
    {
        "content": "TORONTO  Sept 20 Oil company Enbridge Inc's  Northern Gateway pipeline project will not appeal a recent Canadian Federal Court of Appeal decision that reversed its approval pending consultations with aboriginal groups  it said on Tuesday.",
        "date": "09202016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Northern Gateway pipeline project won't appeal Canadian court decision "
    },
    {
        "content": "Canada's Enbridge Inc said on Tuesday it would buy Spectra Energy Corp of Houston in an all-stock deal valued at about $28 billion (C$37 billion) to create the largest North American energy infrastructure company. | Video ",
        "date": "09072016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge buying Spectra in $28 billion deal "
    },
    {
        "content": "Sept 1 Enbridge Inc  Canada's largest pipeline company  said it will withdraw its regulatory applications pending with the Minnesota Public Utilities Commission for the Sandpiper Pipeline Project.",
        "date": "09022016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge announces delay of Sandpiper Pipeline Project "
    },
    {
        "content": "* Enbridge Energy Partners  L.P. plans to defer implementation of Sandpiper beyond company's current five-year planning horizon",
        "date": "09012016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge Energy plans to defer implementation of Sandpiper beyond co's current 5-yr planning horizon "
    },
    {
        "content": "* Moody's affirms Enbridge and subsidiaries on spectra announcement; outlooks remain negative",
        "date": "09062016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Moody's affirms Enbridge on Spectra announcement "
    },
    {
        "content": "* Enbridge Energy Partners  L.P. and co announced today that EEP and Marathon Petroleum Corporation have formed a new joint venture",
        "date": "09012016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge - Enbridge Energy Partners L.P and Marathon Petroleum form new JV "
    },
    {
        "content": "* Spectra shares up more than 10 pct  Enbridge up 4 pct   (Adds graphic link)",
        "date": "09062016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 7-Enbridge buying Spectra in $28 bln deal "
    },
    {
        "content": "* Enbridge Inc.  Enbridge Pipelines Inc. ratings affirmed at 'BBB+' on announced merger with Spectra Energy Corp.  Source text (http://bit.ly/2bRt0sK) Further company coverage:",
        "date": "09062016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-S&P affirms Enbridge Inc.  Enbridge Pipelines Inc. ratings at 'BBB+' on announced merger with Spectra Energy Corp "
    },
    {
        "content": "Canada's Enbridge Inc said on Tuesday it would buy Spectra Energy Corp of Houston in an all-stock deal valued at about $28 billion (C$37 billion) to create the largest North American energy infrastructure company.",
        "date": "09062016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge buying Spectra in $28 bln deal "
    },
    {
        "content": "TORONTO  Sept 6 Canada's main stock index rose on Tuesday as higher metal prices supported mining stocks  while shares of Enbridge Inc advanced after the company said it would buy Spectra Energy Corp.",
        "date": "09062016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "CANADA STOCKS-TSX rises as higher metal prices support mining stocks "
    },
    {
        "content": "* Said about 694 million new shares issued   Further company coverage:",
        "date": "09062016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge will assume about $22 bln of existing Spectra debt - Conf Call "
    },
    {
        "content": "* Enbridge and Spectra energy to combine to create North America's premier energy infrastructure company with C$165 billion enterprise value",
        "date": "09062016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge to buy Spectra in a deal valued at about C$37 billion "
    },
    {
        "content": "Sept 6 Enbridge Inc  Canada's largest pipeline company  said  on Tuesday it would buy Spectra Energy Corp in an all-stock deal valued at about C$37 billion ($28 billion) to create the largest North American energy infrastructure company.",
        "date": "09062016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge to buy Spectra Energy in C$37 bln deal "
    },
    {
        "content": "HOUSTON Enbridge Inc has planned an 18-hour outage for its 215 000 barrel per day Ozark crude pipeline from Cushing  Oklahoma to Wood River  Illinois  for Aug. 30 to replace the Niangua River pipe  according to a shipper notice seen by Reuters.",
        "date": "08222016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge plans 18-hour Ozark crude pipeline outage for  Aug. 30: shipper notice "
    },
    {
        "content": "CALGARY  Alberta  Aug 22 Enbridge Inc  Canada's largest pipeline company  filed a mixed shelf offering of up to $7 billion with the U.S. Securities and Exchange Commissions on Monday  according to a SEC filing.",
        "date": "08222016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 1-Enbridge files mixed shelf offering of up to $7 bln - U.S. SEC "
    },
    {
        "content": "CALGARY  Alberta  Aug 22 Enbridge Inc  Canada's largest pipeline company  filed a mixed shelf offering of up to $7 billion with the U.S. Securities and Exchange Commissions on Monday  according to a SEC filing.",
        "date": "08222016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge files mixed shelf offering of up to $7 billion - SEC "
    },
    {
        "content": "* Says files for mixed shelf of up to $7 billion with U.S. SEC - SEC Filing",
        "date": "08222016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge says files for mixed shelf of up to $7 bln with U.S. SEC "
    },
    {
        "content": "Aug 8 Pipeline company Williams Cos Inc  and its master limited partnership agreed on Monday to sell their Canadian natural gas liquids midstream businesses to Inter Pipeline Ltd for total cash proceeds of C$1.35 billion ($1.03 billion).",
        "date": "08082016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 1-Williams Cos  Williams Partners to sell Canadian operations "
    },
    {
        "content": "VANCOUVER Enbridge Inc  said on Tuesday it had formed a joint venture with Marathon Petroleum Corp  to take a minority stake in a holding company that owns 75 percent of the Bakken Pipeline System.",
        "date": "08032016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge  Marathon take minority stake in Bakken pipeline "
    },
    {
        "content": "CALGARY  Alberta Enbridge Inc   Canada's largest pipeline company  reported a slightly lower-than-expected quarterly profit on Friday as its liquids pipeline business was hit by a massive wildfire in Fort McMurray  Alberta.",
        "date": "07292016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge profit misses slightly  hurt by Fort McMurray wildfire "
    },
    {
        "content": "* Enbridge Energy Partners  L.P. and Enbridge Inc. announce agreement to acquire equity interest in Bakken Pipeline system establishing new path to U.S. Gulf coast",
        "date": "08022016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge Energy  Enbridge Inc to acquire equity interest in Bakken Pipeline "
    },
    {
        "content": "VANCOUVER  Aug 2 Enbridge Inc said on Tuesday it had formed a joint venture with Marathon Petroleum Corp to take a minority stake in a holding company that owns 75 percent of the Bakken Pipeline System.",
        "date": "08032016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "CORRECTED-Enbridge  Marathon take minority stake in Bakken pipeline "
    },
    {
        "content": "CALGARY  Alberta  July 29 Enbridge Inc  Canada's largest pipeline company  reported a slightly lower-than-expected quarterly profit on Friday as its liquids pipeline business was hit by a massive wildfire in Fort McMurray  Alberta.",
        "date": "07292016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 2-Enbridge profit misses slightly  hurt by Fort McMurray wildfire "
    },
    {
        "content": "* Says new project to optimize crude slates will add about 60 000-80 000 bpd of pipeline capacity in western Canada  expected in September",
        "date": "07292016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge adding 60 000-80 000 bpd of Mainline pipeline capacity "
    },
    {
        "content": "* Energy Transfer and Sunoco Logistics announce sale of minority stake in Bakken Pipeline Project to Enbridge and Marathon Petroleum",
        "date": "08022016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Energy Transfer  Sunoco Logistics sell minority stake in Bakken Pipeline "
    },
    {
        "content": "FRANKFURT/LONDON Canadian energy firm Enbridge  has won the auction for a stake in EnBW's  Hohe See  one of Europe's largest offshore wind power projects  a person familiar with the matter told Reuters on Tuesday.",
        "date": "08022016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge to buy stake in EnBW offshore wind park project: source "
    },
    {
        "content": "FRANKFURT/LONDON  Aug 2 Canadian energy firm Enbridge has won the auction for a stake in EnBW's  Hohe See  one of Europe's largest offshore wind power projects  a person familiar with the matter told Reuters on Tuesday.",
        "date": "08022016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge to buy stake in EnBW offshore wind park project -source "
    },
    {
        "content": "July 29 Enbridge Inc   Canada's largest pipeline company  reported a 47.8 percent fall in quarterly profit as  the company's liquids pipeline business was hit by a massive wildfire in Fort McMurray  Alberta.",
        "date": "07292016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge profit nearly halves  hurt by Fort McMurray wildfire "
    },
    {
        "content": "WASHINGTON Canadian pipeline operator Enbridge Inc  has agreed to pay $177 million in penalties and improved safety measures in a settlement with the U.S. government tied to one of the largest inland oil spills in U.S. history.",
        "date": "07202016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "U.S.  Enbridge reach $177 million pipeline spill settlement "
    },
    {
        "content": "WASHINGTON  July 20 Canadian pipeline operator Enbridge Inc has agreed to pay $177 million in penalties and improved safety measures in a settlement with the U.S. government tied to one of the largest inland oil spills in U.S. history.",
        "date": "07202016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 3-U.S.  Enbridge reach $177 million pipeline spill settlement "
    },
    {
        "content": "July 20 The U.S. Justice Department and Environmental Protection Agency and U.S. units of Enbridge Inc  reached a settlement under which the pipeline company will pay $177 million after a 2010 oil spill that released crude oil in Michigan and Illinois  Enbridge said on Wednesday.",
        "date": "07202016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "U.S.  Enbridge reach $177 mln settlement after 2010 oil spills "
    },
    {
        "content": "July 20 The U.S. Justice Department and Environmental Protection Agency will fine Enbridge Inc  $62 million for a 2010 oil spill that released crude oil into the Kalamazoo River in Michigan  a Michigan TV station reported Wednesday  citing a source.",
        "date": "07202016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge to pay $62 mln fine  $120 mln costs for Michigan spill -report "
    },
    {
        "content": "* Williams shares rise after Reuters report   (Adds share price reaction)",
        "date": "07142016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 1-Williams attracts at least 7 bidders for Canadian unit -sources "
    },
    {
        "content": "WASHINGTON  July 19 U.S. Justice Department and Environmental Protection Agency said they would make a \"major announcement\" related to the 2010 Enbridge oil spills on Wednesday at 11 a.m.",
        "date": "07192016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "U.S. to make announcement related to Enbridge spills "
    },
    {
        "content": "TORONTO  July 14 Williams Cos Inc's  Canadian unit has attracted at least seven bidders  including Enbridge Inc and Pembina Pipeline Corp  that could bring the U.S. pipeline company up to $2 billion  people familiar with the situation said.",
        "date": "07142016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Williams attracts at least 7 bidders for Canadian unit -sources "
    },
    {
        "content": "July 8 The National Energy Board (NEB) said it suspended a review of Enbridge Inc's request to extend its permit for the proposed Northern Gateway crude oil pipeline project.",
        "date": "07082016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge's request for pipeline permit extension suspended "
    },
    {
        "content": "VANCOUVER  June 30 A Canadian court has overturned the approval of Enbridge Inc's Northern Gateway oil pipeline  again delaying a project fiercely opposed by environmentalists and many aboriginal groups.",
        "date": "06302016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "UPDATE 4-Canada court overturns federal approval of Enbridge oil pipeline "
    },
    {
        "content": "CALGARY  Alberta  May 16 The massive wildfire raging around the oil sands hub of Fort McMurray in northern Alberta is currently around 1 kilometre away from Enbridge Inc's  Cheecham crude oil tank farm  Alberta Premier Rachel Notley said on Monday.",
        "date": "05162016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Wildfire approximately 1 km from Enbridge Cheecham tank farm "
    },
    {
        "content": "CALGARY  Alberta  May 16 A massive wildfire burning around the oil sands hub of Fort McMurray was growing and moving rapidly north late on Monday  forcing firefighters to shift their focus to protecting major oil sand facilities north of the city  officials said.",
        "date": "05172016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "UPDATE 4-Oil sand work camps evacuated as Alberta wildfire moves north "
    },
    {
        "content": "CALGARY  Alberta  May 11 Enbridge Inc  restarted its 550 000 barrel per day Line 18 pipeline on Wednesday after it was shut down as a precaution because of a wildfire in the Fort McMurray area in northern Alberta last week  the company said in a statement.",
        "date": "05112016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge restarts Line 18 after Fort McMurray wildfire shutdown "
    },
    {
        "content": "* Canada wildfire outages could have impact on Mainline volumes  should not be significant if restarts go as planned    (Reporting by Nia Williams in Calgary)",
        "date": "05122016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Canada wildfire outages could impact Mainline volumes-Enbridge CEO "
    },
    {
        "content": "VANCOUVER  May 12 Enbridge Inc   said on Thursday it was steadily resuming service on its pipeline network through Canada's energy heartland about a week after a massive wildfire spread through the Fort McMurray  Alberta  area  forcing a shutdown.",
        "date": "05122016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 3-Enbridge says slowly resumes operations after Canadian wildfire "
    },
    {
        "content": "* Enbridge CEO says wildfire shutdown of its regional oilsands pipelines impacted an estimated 900 000 bpd of oil",
        "date": "05122016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge CEO gives update on pipeline restarts after Canada wildfire "
    },
    {
        "content": "* Crews have been inspecting facilities and pipelines in Fort Mcmurray region",
        "date": "05102016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge inspects sites for safe restart after wildfires "
    },
    {
        "content": "* Enbridge working to restart regional oil sands pipelines as risk from wildfires in northeastern Alberta moderates",
        "date": "05122016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge reports Q1 adjusted earnings of $0.76 per share "
    },
    {
        "content": "PARIS  May 10 French utility EDF  announced a deal on Tuesday to build three offshore wind parks in France with Canada's Enbridge  which will replace EDF's original consortium partner Dong Energy of Denmark.",
        "date": "05102016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canada's Enbridge to replace Dong as EDF offshore wind partner "
    },
    {
        "content": "May 12 Enbridge Inc   Canada's largest pipeline company  reported a quarterly profit  compared with a year ago loss  as crude shipments increased.",
        "date": "05122016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canada's Enbridge posts quarterly profit as shipments rise "
    },
    {
        "content": "VANCOUVER Enbridge Inc filed a request with Canada's energy regulator on Friday for an extension of its permit for the proposed Northern Gateway crude oil pipeline project that would allow talks to continue with communities in northwest British Columbia.",
        "date": "05062016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge requests extension to Northern Gateway pipeline permit "
    },
    {
        "content": "* Enbridge to acquire 50% interest in french offshore wind development company",
        "date": "05102016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Enbridge to acquire 50 pct interest in Eolien Maritime France "
    },
    {
        "content": "May 6 Enbridge Inc filed a request on Friday with Canada's national energy regulator for an extension of its Northern Gateway project permit to continue talks with communities in northwest British Columbia.",
        "date": "05062016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge requests regulator extend Northern Gateway permit "
    },
    {
        "content": "* Says signs a strategic partnership with Enbridge for the three first offshore wind farms projects off the French coast  totaling 1 400 MW of installed capacity",
        "date": "05102016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-EDF  Enbridge sign French offshore wind farm partnership "
    },
    {
        "content": "CALGARY  Alberta  April 27 Cenovus Energy  is looking into building a diluent recovery unit at its Bruderheim crude-by-rail terminal near Edmonton  Alberta  which would allow the company to ship raw bitumen in tank cars and save on condensate costs.",
        "date": "04272016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Cenovus mulling diluent recovery unit at Alberta rail terminal "
    },
    {
        "content": "CALGARY  Alberta Canadian regulators on Monday recommended the federal government approve Enbridge Inc's plan to replace one of its major crude oil export pipelines  but also imposed 89 conditions on the project to enhance safety and environmental protection.",
        "date": "04252016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Canadian regulator approves Enbridge Line 3 with conditions "
    },
    {
        "content": "CALGARY  Alberta  April 25 Canadian regulators on Monday recommended the federal government approve Enbridge Inc's plan to replace one of its major crude oil export pipelines  but also imposed 89 conditions on the project to enhance safety and environmental protection.",
        "date": "04252016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 3-Canadian regulator approves Enbridge Line 3 with conditions "
    },
    {
        "content": "* Minister says will engage with indigenous peoples along pipeline route  seek additional public input \"before making a final decision in fall 2016\"",
        "date": "04252016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "BRIEF-Canada energy minister says will make Enbridge Line 3 decision later this year "
    },
    {
        "content": "CALGARY  Alberta  April 25 Canadian regulators recommended the federal government approve Enbridge Inc's  Line 3 pipeline replacement project on Monday  but imposed 89 project-specific conditions designed to enhance safety and environmental protection.",
        "date": "04252016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canadian regulator okays Enbridge Line 3  imposes 89 conditions "
    },
    {
        "content": "KANANASKIS  Alberta Canada's approval process for pipelines to export crude from the landlocked province of Alberta to the coast could be shorter  Natural Resources Minister Jim Carr said on Monday  in response to pressure to help get the region's oil to market.",
        "date": "04252016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canada timelines for pipelines could be shorter: govt "
    },
    {
        "content": "KANANASKIS  Alberta  April 25 Canada's approval process for pipelines to export crude from the landlocked province of Alberta to the coast could be shorter  Natural Resources Minister Jim Carr said on Monday  in response to pressure to help get the region's oil to market.",
        "date": "04252016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canada timelines for pipelines could be shorter -govt "
    },
    {
        "content": "CALGARY  Alberta  Feb 19 Enbridge Inc  Canada's largest pipeline company  reported a higher-than-expected quarterly profit on Friday and said it will defer C$5 billion ($3.62 billion) in spending from this year and next until 2018 due to project delays.",
        "date": "02192016",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "UPDATE 2-Enbridge posts higher profit  defers C$5 bln in spending "
    },
    {
        "content": "Feb 19 Canadian pipeline company Enbridge Inc   reported a more than fourfold rise in quarterly profit  partly helped by an increase in crude volumes.",
        "date": "02192016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge posts higher profit as crude shipments increase "
    },
    {
        "content": "Jan 27 Canada's largest pipeline company Enbridge Inc said it would buy Murphy Oil Corp's  Tupper Main and Tupper West gas plants in northeastern British Columbia for C$538 million.",
        "date": "01272016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge to buy some Murphy Oil gas plants in British Columbia "
    },
    {
        "content": "Jan 27 Enbridge Inc  Canada's largest pipeline company  said it would buy Murphy Oil Corp's  Tupper Main and Tupper West gas plants in northeastern British Columbia for C$538 million  ($382 million).",
        "date": "01272016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 1-Enbridge to buy some Murphy Oil gas plants in British Columbia "
    },
    {
        "content": "HOUSTON  Jan 27 Enbridge Inc. has started shipping crude on its 300 000 barrel per day Southern Access Extension (SAX) pipeline from Flanagan to Patoka  Illinois  a company spokesman confirmed on Wednesday.",
        "date": "01272016",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge's Southern Access Extension pipeline starts service "
    },
    {
        "content": "CALGARY  Alberta Enbridge Inc shut down its 300 000 barrel per day Line 9 crude oil pipeline on Monday after three protesters locked themselves to equipment at a valve site in Quebec  a company spokesman said.",
        "date": "12082015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge shuts crude pipeline due to protest at valve site "
    },
    {
        "content": "CALGARY  Alberta  Dec 7 Enbridge Inc  shut down its 300 000 barrel per day Line 9 crude oil pipeline on Monday after three protesters locked themselves to equipment at a valve site in Quebec  a company spokesman said.",
        "date": "12072015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge shuts crude pipeline due to protest at valve site "
    },
    {
        "content": "CALGARY  Alberta  Dec 7 Enbridge Inc  shut down its 300 000 barrel per day Line 9 crude oil pipeline on Monday after three protesters locked themselves to equipment at a valve site in Quebec  a company spokesman said.",
        "date": "12082015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 1-Enbridge shuts crude pipeline due to protest at valve site "
    },
    {
        "content": "Enbridge Inc   said it expected to make a decision on whether to go ahead with the controversial Northern Gateway pipeline in the latter half of 2016  though it could not commit to a timeline.",
        "date": "12032015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge to decide on controversial pipeline in second half of 2016 "
    },
    {
        "content": "BOSTON  Dec 1 Several of the world's biggest climate-focused mutual funds have stakes in traditional oil and gas companies mixed in with their solar  wind and clean tech holdings  a potential shock to green investors seeking to avoid fossil fuels altogether.",
        "date": "12012015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Green investors take note: climate-focused mutual funds dabble in oil "
    },
    {
        "content": "* Shares close down nearly 4 pct   (Adds conference call comments  background  shares)",
        "date": "12032015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 2-Enbridge to decide on controversial pipeline in 2nd half of 2016 "
    },
    {
        "content": "Dec 3 Enbridge Inc  Canada's largest pipeline company  raised its quarterly dividend by 14 percent to 53 Canadian cents per share.",
        "date": "12032015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Pipeline operator Enbridge raises dividend by 14 pct "
    },
    {
        "content": "HOUSTON  Nov 12 Enbridge's 600 000 barrel per day (bpd) Flanagan South pipeline  which transports crude from Flanagan  Illionis to Cushing  Oklahoma  is experiencing operational issues  according to two sources.",
        "date": "11122015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge's Flanagan South pipeline having operational issues  congestion - sources "
    },
    {
        "content": "NEW YORK/CALGARY Canadian pipeline company Enbridge Inc is considering spending about $5 billion on oil storage assets in the U.S. Gulf Coast region  but has made no concrete investment decisions yet  a company spokesman said on Wednesday.",
        "date": "11042015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Canada's Enbridge mulling $5 billion investment in U.S. Gulf Coast "
    },
    {
        "content": "NEW YORK/CALGARY Nov 4 Canadian pipeline company Enbridge Inc is considering spending about $5 billion on oil storage assets in the U.S. Gulf Coast region  but has made no concrete investment decisions yet  a company spokesman said on Wednesday.",
        "date": "11042015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 3-Canada's Enbridge mulling $5 bln investment in U.S. Gulf Coast "
    },
    {
        "content": "CALGARY Enbridge Inc   Canada's largest pipeline company  said on Thursday it was moving into offshore wind development as part of a broader shift in the coming decades away from carbon-intensive energy.",
        "date": "11052015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge sees hit from delay in start of Line 9 pipeline "
    },
    {
        "content": "CALGARY  Alberta  Oct 29 Suncor Energy  commenced linefill on Enbridge Inc's Line 9 pipeline earlier this month and the first inland crude volumes will reach the company's Montreal refinery by year-end  Suncor Chief Executive Steve Williams said on a third-quarter earnings call on Thursday.",
        "date": "10292015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Suncor says Line 9 to deliver inland crude to Montreal by year-end "
    },
    {
        "content": "Nov 4 Canadian pipeline company Enbridge Inc  is planning to spend $5 billion to build three oil storage facilities in the Gulf of Mexico region  Wall Street Journal reported  citing a company official.",
        "date": "11042015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canada's Enbridge to invest $5 bln in Gulf Coast - WSJ "
    },
    {
        "content": "CALGARY  Nov 5 Enbridge Inc  Canada's largest pipeline company  said on Thursday it was moving into offshore wind development as part of a broader shift in the coming decades away from carbon-intensive energy.",
        "date": "11052015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 3-Enbridge sees hit from delay in start of Line 9 pipeline "
    },
    {
        "content": "* Second deal in Europe offshore in less than a week   (Recasts  adds CEO quote)",
        "date": "11052015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 1-Enbridge takes stake in $2.1 bln British offshore wind project "
    },
    {
        "content": "Nov 5 Enbridge Inc  Canada's largest pipeline company  reported a 15.7 percent rise in quarterly adjusted profit  helped by increased throughput as producers moved more oil by pipelines than on rail.",
        "date": "11052015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Pipeline operator Enbridge's profit rises as shipments increase "
    },
    {
        "content": "FRANKFURT  Nov 5 Canadian energy group Enbridge  has taken a 24.9 percent stake in E.ON's 1.9 billion euro ($2.07 billion) offshore wind project Rampion  E.ON said on Thursday.",
        "date": "11052015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canada's Enbridge takes stake in E.ON offshore wind project "
    },
    {
        "content": "Nov 5 Enbridge Inc  Canada's largest pipeline company  said it had bought a 24.9 percent stake in an offshore wind energy project in the United Kingdom for C$750 million ($570 million).",
        "date": "11052015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canadian pipeline company Enbridge buys stake in UK wind farm "
    },
    {
        "content": "CALGARY Enbridge Inc  Canada's largest pipeline company  is planning C$38 billion ($29.09 billion) in new capital investments over the next four years  Chief Executive Al Monaco said on Wednesday.",
        "date": "10072015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Canada's Enbridge plans C$38 billion in new investments through 2019 "
    },
    {
        "content": "CALGARY  Oct 7 Enbridge Inc  Canada's largest pipeline company  is planning C$38 billion ($29.09 billion) in new capital investments over the next four years  Chief Executive Al Monaco said on Wednesday.",
        "date": "10072015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canada's Enbridge plans C$38 bln in new investments through 2019 "
    },
    {
        "content": "* Nov WCS trades at $14.50/bbl below WTI   (Updates prices  adds quote)",
        "date": "10012015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "CANADA CRUDE-Synthetic rises on Enbridge Line 9 approval "
    },
    {
        "content": "CALGARY  Alberta  Oct 1 Enbridge Inc's  long-awaited start of its Line 9 oil pipeline to Montreal will allow Quebec refineries to run on 100 percent cheap North American inland crude  leaving around 100 000 barrels per day of foreign crude searching for a new home.",
        "date": "10012015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge's Line 9 oil pipeline to displace foreign crude in Quebec "
    },
    {
        "content": "CALGARY  Alberta  Oct 1 Canadian light synthetic crude and North Dakota Bakken crude for November delivery strengthened on Thursday after Enbridge Inc received approval from regulators to open its Line 9 crude pipeline.",
        "date": "10012015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canadian synthetic and Bakken crude rise on Line 9 approval "
    },
    {
        "content": "Aug 17 Canadian pipeline operator Enbridge Inc  is rationing space for mid-month on its line 4/67 ex Kerrobert for August  according to a notice to shippers on Monday that was seen by Reuters.",
        "date": "08182015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "UPDATE 1-Enbridge mid-month apportionment adds to Canada crude woes "
    },
    {
        "content": "Enbridge Inc. said it shut its Line 55 Spearhead pipeline and adjacent Line 59 Flanagan South pipeline  following a crude oil release along Line 55 in Shelby County  Missouri  near Shelbina on Tuesday.",
        "date": "08112015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge shuts Flanagan South  Spearhead lines after Missouri leak "
    },
    {
        "content": "NEW YORK The restart date Enbridge Inc's 193 300 barrel per day Spearhead crude pipeline remained unknown  the company said on Thursday afternoon  a day after the adjacent Flanagan South pipeline was put into service.",
        "date": "08132015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Spearhead oil pipeline restart date still unknown: Enbridge "
    },
    {
        "content": "CALGARY  Alberta  Aug 12 Heavy Canadian crude slumped to its lowest level in at least a decade on Wednesday after Enbridge Inc closed two of its main pipelines in the United States because of a leak  piling fresh misery on Canadian oil companies that are close to producing at a loss.",
        "date": "08122015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "UPDATE 1-Canadian heavy crude slumps to lowest in at least a decade "
    },
    {
        "content": "CALGARY  Alberta  Aug 12 Heavy Canadian crude slumped to its lowest level in at least a decade on Wednesday after Enbridge Inc closed two of its main pipelines in the United States because of a leak  piling fresh misery on Canadian oil companies that are close to producing at a loss.",
        "date": "08122015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canadian heavy crude slumps to lowest in at least a decade "
    },
    {
        "content": "NEW YORK/CALGARY Enbridge Inc was racing on Wednesday to reopen major U.S. Midwest oil pipelines that were shut by a small leak late on Tuesday  disrupting the flow of nearly 800 000 barrels per day of Canadian crude and sending cash prices tumbling.",
        "date": "08122015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Key Canadian crude pipelines in U.S. shut by leak; prices sink "
    },
    {
        "content": "July 31 The following bids  mergers  acquisitions and disposals were reported by 2015 GMT on Friday:",
        "date": "07312015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "VANCOUVER  July 31 Enbridge Inc  Canada's largest pipeline company  said additional testing on its Sarnia  Ontario  to Montreal project should wrap up by the end of the year  allowing the company to finally start up the delayed Line 9 oil pipeline.",
        "date": "07312015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 2-Enbridge says Line 9 testing to wrap by year end; profit beats "
    },
    {
        "content": "July 31 Enbridge Inc  Canada's largest pipeline operator  is considering natural gas and power generation acquisitions to help boost the diversity of its asset base  the company's CEO said on Friday.",
        "date": "07312015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge eyeing M&A in natural gas  power generation "
    },
    {
        "content": "July 31 Enbridge Inc  Canada's largest pipeline company  posted a 54 percent rise in quarterly adjusted profit on Friday  helped by increased throughput as producers moved more oil by pipes than on rail.",
        "date": "07312015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Pipeline operator Enbridge's adjusted profit rises 54 pct "
    },
    {
        "content": "CALGARY  July 15 Canada's energy regulator has concluded that Alberta-based Enbridge Inc is operating safely  despite finding the pipeline operator had violated rules designed to identify threats to the public and protect whistleblowers.",
        "date": "07152015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Canada regulator says Enbridge safely operating pipelines  despite violations "
    },
    {
        "content": "June 19 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Friday:",
        "date": "06192015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "CALGARY  Alberta  June 15 The two biggest customers on Enbridge Inc's newly reversed pipeline to carry Western Canadian oil from Sarnia  Ontario  to Montreal want to meet Canada's energy regulator to find out why the pipeline's opening has been delayed by months.",
        "date": "06152015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge shippers question regulator's delay of pipeline to Montreal "
    },
    {
        "content": "June 19 Enbridge Inc said it would transfer its Canadian liquids pipelines business and certain Canadian renewable energy assets to Enbridge Income Fund in a deal valued at C$30.4 billion ($24.81 billion).",
        "date": "06192015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge to transfer some assets to Enbridge Income Fund for C$30.4 bln "
    },
    {
        "content": "CALGARY  Alberta  June 18 Canada's energy regulator imposed new conditions on Enbridge Inc's  Sarnia  Ontario  to Montreal oil pipeline on Thursday  including additional testing  before it allows the 300 000 barrel per day Line 9 to enter service.",
        "date": "06182015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "UPDATE 1-Canada regulator sets new conditions for Enbridge pipeline to Montreal "
    },
    {
        "content": "CALGARY  Alberta  June 18 Canada's National Energy Board on Thursday imposed new conditions on Enbridge Inc's 300 000 barrel per day Line 9  including additional testing  before the regulator allows the oil pipeline to enter service.",
        "date": "06182015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canada regulator imposes new conditions on Enbridge's Line 9 "
    },
    {
        "content": "WASHINGTON  June 8 The United States on Monday filed a proposed settlement requiring Enbridge Inc to complete natural resource restoration projects and pay about $4 million following its 2010 oil pipeline spill in Michigan  the Justice Department said.",
        "date": "06082015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "US says Enbridge to pay $4 mln  restore area hit by 2010 oil spill "
    },
    {
        "content": "WASHINGTON  May 13 Enbridge Energy and its affiliated will pay $75 million to settle a 2010 oil spill into Michigan's Talmadge Creek and Kalamazoo River that dumped 800 000 gallons of oil  state officials said on Wednesday.",
        "date": "05132015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge to pay $75 mln to settle 2010 oil spill -Michigan officials "
    },
    {
        "content": "May 6 Enbridge Inc   Canada's largest oil pipeline company  reported on Wednesday a lower-than-expected adjusted quarterly profit as lower pipeline tolls and higher operating costs outweighed increased throughput.",
        "date": "05062015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "CORRECTED-UPDATE 2-Enbridge adjusted profit misses on tolls  operating costs "
    },
    {
        "content": "WASHINGTON Enbridge Energy and its affiliates will pay $75 million to settle a 2010 oil spill into Michigan's Talmadge Creek and Kalamazoo River that dumped 800 000 gallons of oil  state officials said on Wednesday.",
        "date": "05132015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge to pay $75 million to settle 2010 oil spill: Michigan officials "
    },
    {
        "content": "May 6 Enbridge Inc   Canada's largest pipeline company  reported a quarterly loss compared with a year-ago profit  hurt by the impact of a steep drop in oil and gas prices and hedging losses.",
        "date": "05062015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Canada's Enbridge posts quarterly loss "
    },
    {
        "content": "WASHINGTON  May 13 Enbridge Energy and its affiliates will pay $75 million to settle a 2010 oil spill into Michigan's Talmadge Creek and Kalamazoo River that dumped 800 000 gallons of oil  state officials said on Wednesday.",
        "date": "05132015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "UPDATE 2-Enbridge to pay $75 mln to settle 2010 oil spill -Michigan officials "
    },
    {
        "content": "CALGARY  Alberta  March 5 Enbridge Inc  Canada's largest pipeline operator  said on Thursday it plans to boost the size of two lines carrying crude from the oil sands while shaving C$400 million ($320.4 million) from their original price tag.",
        "date": "03052015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Canada's Enbridge reduces costs of oil sands pipelines by C$400 mln "
    },
    {
        "content": "CALGARY  Alberta  Feb 20 Canada's largest pipeline company Enbridge Inc moved record crude volumes of 2.2 million barrels a day on its Mainline system in December and in January  Chief Executive Officer Al Monaco said on Friday.",
        "date": "02202015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "UPDATE 1-Enbridge Mainline ships record 2.2 million bpd of crude in Dec and Jan "
    },
    {
        "content": "CALGARY  Alberta  Feb 20 Enbridge Inc  Canada's largest pipeline company  said on Friday it returned to profit in the fourth-quarter as new projects entered service.",
        "date": "02192015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "UPDATE 1-Enbridge fourth-quarter profit boosted by new projects "
    },
    {
        "content": "CALGARY  Alberta  Feb 20 Canadian pipeline company Enbridge Inc hopes to get a U.S. presidential permit for its proposed Alberta Clipper pipeline expansion by the end of 2015  president of liquids pipelines Guy Jarvis said on Friday.",
        "date": "02202015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge hoping for cross-border pipeline presidential permit by end-2015 "
    },
    {
        "content": "CALGARY  Alberta  Feb 20 Canada's largest pipeline company Enbridge Inc moved record crude volumes of 2.2 million barrel per day on its Mainline pipeline system in December and in January  executive officer Al Monaco said on Friday on a fourth quarter earnings call.",
        "date": "02202015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge Mainline ships record 2.2 million bpd of crude in Dec and Jan "
    },
    {
        "content": "CALGARY  Alberta  Feb 6 Canada's National Energy Board approved two of Enbridge Inc's condition filings on the reversed Line 9 pipeline on Friday  but also imposed additional ones on the company.",
        "date": "02062015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Canada regulator OKs two conditions on Enbridge Line 9  imposes others "
    },
    {
        "content": "CALGARY  Alberta  Feb 4 A U.S. investigation into oil major BP Plc breaking anti-fraud and reporting rules on using oil pipelines is related to crude shipped on Enbridge Inc's Mainline system  Enbridge said on Wednesday.",
        "date": "02042015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "UPDATE 1-U.S. regulators probing BP crude shipments on Enbridge pipeline "
    },
    {
        "content": "CALGARY  Alberta  Feb 3 Enbridge Inc  Canada's largest pipeline operator  plans to begin filling its new 570 000 barrel per day Edmonton to Hardisty  Alberta  pipeline with oil on March 17  according to a regulatory filing.",
        "date": "02032015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge applies to fill new 570 000 bpd oil pipeline next month "
    },
    {
        "content": "CALGARY  Alberta  Feb 4 A U.S. investigation into oil major BP Plc breaking anti-fraud and reporting rules on using oil pipelines is related to crude shipped on Enbridge Inc's Mainline system  Enbridge said on Wednesday.",
        "date": "02042015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "U.S. regulators probing BP crude shipments on Enbridge pipeline "
    },
    {
        "content": "Jan 22 Enbridge Inc's new 570 000 barrel-per-day Edmonton to Hardisty crude oil pipeline will start up around April 1  Enbridge president of liquid pipelines Guy Jarvis said on Thursday.",
        "date": "01222015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge's Edmonton to Hardisty pipeline to start up around April 1 "
    },
    {
        "content": "Jan 21 Suncor Energy expects Enbridge Inc's reversed Line 9B crude pipeline to start up towards the end of the second quarter of 2015  the company's chief financial officer Alister Cowan said on Wednesday.",
        "date": "01212015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "UPDATE 1-Suncor expects Enbridge Line 9B to start up towards end of Q2 2015 "
    },
    {
        "content": "CALGARY  Alberta  Jan 22 Enbridge Inc  Canada's largest pipeline operator  is nearing full capacity for light crudes on its North American pipeline system and expects crude-by-rail shipments from Western Canada to continue to rise  the head of its pipeline division said on Thursday.",
        "date": "01222015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Enbridge sees oil pipeline squeeze despite low prices "
    },
    {
        "content": "Oil pipelines in the United States are undergoing a historic realignment in response to new production in the Eagle Ford development in south-central Texas  redevelopment of older production in the Permian Basin  and new flows of oil from the Midwest and Canada that have oversupplied Midwest markets.",
        "date": "01212015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "U.S. crude oil pipeline projects: Kinder Morgan acquiring Hiland Crude "
    },
    {
        "content": "Jan 21 Suncor Energy expects Enbridge Inc's Line 9B crude pipeline to start up towards the end of the second quarter of 2015  Suncor chief financial officer Alister Cowan said on Wednesday.",
        "date": "01212015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "Suncor expects Enbridge Line 9B to start up towards end of Q2 2015 "
    },
    {
        "content": "TORONTO  Jan 21 Canada's main stock index rallied on Wednesday after the central bank cut its benchmark rate in a shock move  helping boost shares of energy companies as well as interest-sensitive banks and other financial issues.",
        "date": "01212015",
        "name": "Enbridge Inc",
        "news_type": "normal",
        "symbol": "ENB",
        "title": "CANADA STOCKS-Shock Bank of Canada rate cut boosts TSX  banks climb "
    },
    {
        "content": "WILLISTON  N.D.  Jan 1 An Enbridge Inc  crude oil storage and pipeline facility just south of Williston  N.D.  has caught fire  eyewitnesses said.",
        "date": "01022015",
        "name": "Enbridge Inc",
        "news_type": "topStory",
        "symbol": "ENB",
        "title": "Enbridge oil facility in North Dakota catches fire; damage unclear "
    }
]