[
    {
        "content": "* Enterprise Products Partners files to say it ‍​may offer and sell up to $2.54 billion of common units representing limited partner interests in the co Source text: (http://bit.ly/2zq1b33) Further company coverage:",
        "date": "11072017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise Products Partners ‍​may offer and sell up to $2.54 billion of common units "
    },
    {
        "content": "* Enterprise Products - GP declared increase in quarterly cash distribution paid to limited partners to $0.4225 per unit",
        "date": "10122017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise Products increases quarterly cash distribution to limited partners "
    },
    {
        "content": "HOUSTON  Sept 15 A fire broke out on Friday night at an Enterprise Products Partners LP brine pit at its natural gas liquid (NGL) fractionation and storage complex in Mont Belvieu  Texas  said a spokesman for the company.",
        "date": "09162017",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "Enterprise says fire nearly out at Texas NGL complex "
    },
    {
        "content": "* Enterprise enters into new revolving credit facilities to extend maturities",
        "date": "09132017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise enters into new revolving credit facilities to extend maturities "
    },
    {
        "content": "* Enterprise Products Partners - ‍made \"significant progress\" in restoring service at substantially all of its major assets impacted by Hurricane Harvey​",
        "date": "09052017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise Products resumes service at substantially all of its major assets "
    },
    {
        "content": "* ‍Is evaluating potential curtailment of NGL fractionation and storage services at its Mont Belvieu Complex​",
        "date": "08312017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise products gives Harvey update in Mont Belvieu Complex​ "
    },
    {
        "content": "* Enterprise Products Partners spokesman says all pipelines continue to operate; not aware of any issues on injection points preventing co from serving refineries still running Source text for Eikon: [Statement from spokesman] Further company coverage: (Reporting By Devika  Krishna Kumar)",
        "date": "08292017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise Products Partners spokesman says all pipelines continue to operate "
    },
    {
        "content": "* Q2 earnings per share view $0.33 -- Thomson Reuters I/B/E/S",
        "date": "08032017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise reports Q2 earnings per share $0.30 "
    },
    {
        "content": "* Enterprise Products Partners Lp - \"‍company has prevailed in its appeal against energy transfer partners.\"",
        "date": "07192017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise Products Partners says prevailed in appeal against Energy Transfer Partners "
    },
    {
        "content": "* Enterprise announces additional contracts for midland to echo pipeline system",
        "date": "07052017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise announces additional contracts for Midland to ECHO pipeline system "
    },
    {
        "content": "* Enterprise products partners lp - board of general partner declared an increase in quarterly cash distribution paid to partners to $0.42 per common unit",
        "date": "07052017",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise declares quarterly distribution increase "
    },
    {
        "content": "* Enterprise products partners - adding 300 million cubic feet/day of capacity at cryogenic natural gas processing facility under construction near Orla  Texas",
        "date": "06292017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise announces Orla II Natural Gas Processing Plant in West Texas "
    },
    {
        "content": "* Q1 earnings per share view $0.33 -- Thomson Reuters I/B/E/S",
        "date": "05022017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise reports Q1 earnings per share $0.36 "
    },
    {
        "content": "* Construction of a new 571-mile pipeline to transport volumes of natural gas liquids",
        "date": "04102017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise Products Partners to build shin oak NGL pipeline from Permian basin to Mont Belvieu "
    },
    {
        "content": "* Enterprise Products Partners LP - general partner declared an increase in quarterly cash distribution paid to partners to $0.415 per common unit Source text for Eikon: Further company coverage:",
        "date": "04052017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise declares quarterly distribution increase "
    },
    {
        "content": "* Agreement was result of Azure's bankruptcy auction proceedings  which enterprise won with a bid price of $189 million",
        "date": "03152017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise acquires Azure Natural Gas Gathering System "
    },
    {
        "content": "NEW YORK  March 6 Enterprise Products Partners LP's Seaway crude oil pipeline was shut this weekend after a potential leak was found  two trading sources said on Monday.",
        "date": "03062017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "UPDATE 2-Enterprise Products Partners' Seaway pipeline shut after leak -traders "
    },
    {
        "content": "NEW YORK  March 6 Enterprise Products Partners LP's Seaway crude oil pipeline was shut this weekend after a potential leak was found  two trading sources said on Monday.",
        "date": "03062017",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "Enterprise Products Partners' Seaway pipeline shut after leak: traders "
    },
    {
        "content": "* Enterprise Products Partners says renegotiated  extended agreement with Ultra Petroleum to process natural gas from Ultra's production in Pinedale field",
        "date": "02232017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise Products Partners says renegotiated  extended agreement with Ultra Petroleum to process natural gas from Ultra's production in Pinedale field "
    },
    {
        "content": "Feb 2 Enterprise Products Partners LP's  Seaway pipeline is expected to resume service on or before Tuesday following its closure due to a leak in Collin County  Texas  earlier this week  the company said on Thursday.",
        "date": "02022017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "Enterprise says Seaway pipeline to resume service by Feb. 7 "
    },
    {
        "content": "* Enterprise products - plans to construct new isobutane dehydrogenation unit in texas with capability to produce 425 000 tons/year of isobutylene",
        "date": "01302017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise to build isobutane dehydrogenation unit "
    },
    {
        "content": "* Enterprise Products Partners LP qtrly fully diluted earnings per unit $0.31",
        "date": "01302017",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise Products Partners LP Qtrly fully diluted earnings per unit $0.31 "
    },
    {
        "content": "HOUSTON Exports of liquefied petroleum gas out of Enterprise Products Partners Houston Ship Channel terminal could average a record 17.5 million barrels this month if weather conditions permit  chief executive Jim Teague said on Thursday at a conference.",
        "date": "01192017",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "Enterprise Products Partners eyes record LPG exports for January: CEO "
    },
    {
        "content": "A leak late on Sunday prompted Enterprise Products Partners to shut its Seaway Crude Pipeline system  the largest conduit for moving oil from the major storage hub in Cushing  Oklahoma to Gulf coast refineries.",
        "date": "10242016",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "Enterprise's Seaway Crude pipeline system shut after Cushing  Oklahoma spill "
    },
    {
        "content": "Oct 24 A leak late on Sunday prompted Enterprise Products Partners to shut its Seaway Crude Pipeline system  the largest conduit for moving oil from the major storage hub in Cushing  Oklahoma to Gulf coast refineries.",
        "date": "10242016",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "UPDATE 5-Enterprise's Seaway Crude pipeline system shut after Cushing  Oklahoma spill "
    },
    {
        "content": "* Increase in quarterly cash distribution paid to partners to $0.405 per common unit  or $1.62 per unit on an annualized basis",
        "date": "10052016",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise Products Partners increases quarterly cash distribution paid to partners to $0.405 per common unit "
    },
    {
        "content": "* Its unit  has amended its 364-day revolving credit agreement to extend maturity date of facility to september 2017",
        "date": "09142016",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise extends 364-day revolving credit agreement "
    },
    {
        "content": "NEW YORK Oil and gas pipeline company Enterprise Products Partners  submitted a new  all-stock bid for rival Williams Cos Inc  in late August  topping a previous bid from earlier in the summer  according to a source familiar with the matter.",
        "date": "09082016",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "Enterprise made new bid for Williams in late August: source "
    },
    {
        "content": "NEW YORK  Sept 8 Oil and gas pipeline company Enterprise Products Partners submitted a new  all-stock bid for rival Williams Cos Inc in late August  topping a previous bid from earlier in the summer  according to a source familiar with the matter.",
        "date": "09082016",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "Enterprise made new bid for Williams in late August - source "
    },
    {
        "content": "* Withdrawn its indication of interest in Williams Companies Inc  Source text for Eikon:  Further company coverage:",
        "date": "09082016",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise withdraws indication of interest in Williams "
    },
    {
        "content": "Aug 18 Enterprise Products Partners LP  approached Williams Companies Inc earlier this summer about combining their   businesses  two of the largest U.S. oil and gas pipeline operations  people familiar with the matter said.",
        "date": "08182016",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "UPDATE 4-Enterprise Products approached Williams over acquisition -sources "
    },
    {
        "content": "HOUSTON Enterprise Products Partners on Thursday said the first ship to load ethane for export from its new terminal on the Houston Ship Channel will arrive on Aug. 1  the first such export of the light natural gas liquid from the U.S. Gulf Coast.",
        "date": "07282016",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "Enterprise to export first ethane cargo from Houston terminal in August "
    },
    {
        "content": "HOUSTON  July 28 Enterprise Products Partners  on Thursday said the first ship to load ethane for export from its new terminal on the Houston Ship Channel will arrive on Aug. 1  the first such export of the light natural gas liquid from the U.S. Gulf Coast.",
        "date": "07282016",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "UPDATE 1-Enterprise to export first ethane cargo from Houston terminal in August "
    },
    {
        "content": "HOUSTON  July 28 Enterprise Products Partners  on Thursday said the first ship to load ethane for export from its new terminal on the Houston Ship Channel will arrive on August 1  the first such export of the light natural gas liquid from the U.S. Gulf Coast.",
        "date": "07282016",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "Enterprise to export first cargo of ethane from Houston terminal in August "
    },
    {
        "content": "* Loaded first two vessels with polymer grade propylene for export at enterprise hydrocarbons terminal",
        "date": "07192016",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise Products Partners adds propylene exports to service offerings at Houston ship channel facility "
    },
    {
        "content": "* For 2016  we currently expect to invest approximately $2.8 billion for growth projects",
        "date": "07282016",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise Products Partners reports Q2 earnings per unit $0.27 "
    },
    {
        "content": "* New distribution represents a 5.3 percent increase over distribution declared with respect to q2 of 2015",
        "date": "07072016",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise Products raises qtrly dividend "
    },
    {
        "content": "HOUSTON  June 28 Firefighters in Pascagoula  Mississippi were monitoring a dwindling fire at an Enterprise Products Partners natural gas processing plant on Tuesday morning  the company said.",
        "date": "06282016",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "CORRECTED-Fire under control at Pascagoula  Mississippi gas plant "
    },
    {
        "content": "HOUSTON  April 28 Enterprise Products Partners  said on Thursday that it has ample dock capacity to ramp up U.S. crude exports and could handle much more volume without further spending.",
        "date": "04282016",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "Enterprise sees ample capacity to ramp up crude exports "
    },
    {
        "content": "* Enterprise products partners lp qtrly earnings per unit $0.32",
        "date": "04282016",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise Products Partners qtrly earnings per unit $0.32 "
    },
    {
        "content": "* Files for stock shelf of up to $1.75 billion - SEC filing  Source text: http://1.usa.gov/1SzOJBo  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "04222016",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "BRIEF-Enterprise Products Partners files for stock shelf of up to $1.75 bln "
    },
    {
        "content": "BRASILIA  March 21 Brazilian petrochemical company Braskem SA signed a 10-year contract with U.S.-based Enterprise Products Partners LP for the supply of ethane imported from the United States  Braskem said in a statement on Monday.",
        "date": "03212016",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "Brazil's Braskem contracts to buy ethane from Enterprise Products "
    },
    {
        "content": "HOUSTON  Feb 24 Enterprise Products Partners  expects to export 6 million barrels of crude and condensate out of its Gulf Coast terminal in March  its chief executive said at the IHS CERAWeek conference in Houston on Wednesday.",
        "date": "02252016",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "Enterprise Products Partners to export 6 mln bbls of crude/condensate in March "
    },
    {
        "content": "Dec 23 Enterprise Products Partners LP  said it won its first contract to export U.S crude  days after the U.S. Congress voted to lift a four-decade ban on oil exports.",
        "date": "12232015",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "Enterprise Products secures first crude oil export contract "
    },
    {
        "content": "Sept 14 Enterprise Products Partners LP  will lower the tariff rates for crude shipments into its ECHO crude terminal in Houston  Texas  according to a regulatory notice filed on Monday.",
        "date": "09142015",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "UPDATE 1-Enterprise Products cuts pipeline tariff into Texas terminal -filing "
    },
    {
        "content": "Sept 14 Enterprise Products Partners  will lower the tariff rates for crude shipments into its ECHO crude terminal in Houston Texas  according to a regulatory notice filed Monday.",
        "date": "09142015",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "Enterprise Products cuts pipeline tariff into Texas terminal - filing "
    },
    {
        "content": "July 16 Pipeline company Genesis Energy LP  said it would buy Enterprise Products Partners LP's  Gulf of Mexico pipelines and services business for about $1.5 billion to expand its offshore pipelines business.",
        "date": "07162015",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "UPDATE 1-Pipeline operator Genesis to buy Enterprise's U.S. Gulf business "
    },
    {
        "content": "July 16 Pipeline company Genesis Energy LP  said it would buy Enterprise Products Partners LP's  offshore Gulf of Mexico pipelines and services business for about $1.5 billion.",
        "date": "07162015",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "Pipeline company Genesis to buy Enterprise's Gulf of Mexico business "
    },
    {
        "content": "June 1 The following bids  mergers  acquisitions and disposals were reported by 2020 GMT on Monday:",
        "date": "06012015",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "June 1 Enterprise Products Partners LP  said it would buy pipeline and processing assets in the Eagle Ford shale in Texas from Pioneer Natural Resources Co  and India's Reliance Industries Ltd for $2.15 billion.",
        "date": "06012015",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "UPDATE 1-Enterprise Products to buy Eagle Ford pipeline for $2.15 bln "
    },
    {
        "content": "Pipeline company Enterprise Products Partners LP  said it would buy member interests in EFS Midstream LLC from affiliates of Pioneer Natural Resources Co  and Reliance Industries Ltd  for $2.15 billion.",
        "date": "06012015",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "Enterprise Products to buy midstream assets for $2.15 billion "
    },
    {
        "content": "June 1 Pipeline company Enterprise Products Partners LP said it would buy member interests in EFS Midstream LLC from affiliates of Pioneer Natural Resources Co  and Reliance Industries Ltd for $2.15 billion.",
        "date": "06012015",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "Enterprise Products to buy midstream assets for $2.15 bln "
    },
    {
        "content": "SINGAPORE U.S. exports of condensate have been given an important boost after pipeline company Enterprise Products Partners LP agreed annual contracts with at least two major trading companies to sell the light crude  trade sources said.",
        "date": "01272015",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "U.S. crude exports boosted as Enterprise signs term contracts: sources "
    },
    {
        "content": "* Signs 2015 contracts with PDS  Vitol; seeks one more term buyer",
        "date": "01272015",
        "name": "Enterprise Products Partners LP",
        "news_type": "normal",
        "symbol": "EPD",
        "title": "U.S. crude exports boosted as Enterprise signs term contracts-sources "
    },
    {
        "content": "FREEPORT  Texas  Jan 16 Enterprise Products Partners said on Friday its Seaway Twin pipeline may not run at full capacity for the time being on low oil prices.",
        "date": "01162015",
        "name": "Enterprise Products Partners LP",
        "news_type": "topStory",
        "symbol": "EPD",
        "title": "Enterprise says Seaway Twin running at around half capacity "
    }
]