[
    {
        "content": "Nov 13 The following bids  mergers  acquisitions and disposals were reported by 1045 GMT on Monday:",
        "date": "11132017",
        "name": "Equity Commonwealth",
        "news_type": "normal",
        "symbol": "EQC",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Equity Commonwealth   a U.S. real estate investment trust (REIT) focused on office space and chaired by property mogul Sam Zell  has approached Forest City Realty Trust Inc  to discuss a possible merger  people familiar with the matter said.",
        "date": "11112017",
        "name": "Equity Commonwealth",
        "news_type": "topStory",
        "symbol": "EQC",
        "title": "Exclusive: Equity Commonwealth approaches Forest City about merging - sources "
    },
    {
        "content": "* Q3 FFO per share $0.22 Source text for Eikon: Further company coverage:",
        "date": "10242017",
        "name": "Equity Commonwealth",
        "news_type": "topStory",
        "symbol": "EQC",
        "title": "BRIEF-Equity Commonwealth reports Q3 adjusted FFO per share $0.19 "
    },
    {
        "content": "* Equity Commonwealth says currently has seven properties totaling 4.7 million square feet in various stages of sale process​ - sec filing Source text for Eikon: (http://bit.ly/2y2dsfq) Further company coverage:",
        "date": "10042017",
        "name": "Equity Commonwealth",
        "news_type": "topStory",
        "symbol": "EQC",
        "title": "BRIEF-Equity Commonwealth says has 7 properties totaling 4.7 mln square feet in various stages of sale process​ "
    },
    {
        "content": "Aug 14 Corvex Management threatened a proxy battle against Energen Corp if the U.S. oil and gas producer did not agree to add the activist investor's nominees to its board.",
        "date": "08142017",
        "name": "Equity Commonwealth",
        "news_type": "normal",
        "symbol": "EQC",
        "title": "UPDATE 1-Corvex warns of proxy fight with Energen after raising stake "
    },
    {
        "content": "* Qtrly same property NOI decreased 5.5% when compared to same period in 2016",
        "date": "07242017",
        "name": "Equity Commonwealth",
        "news_type": "topStory",
        "symbol": "EQC",
        "title": "BRIEF-Equity Commonwealth reports Q2 FFO per share $0.25 "
    },
    {
        "content": "Stocks slated to deliver large gains in 2017 range from movie-theater chain AMC Entertainment Holdings Inc  to two companies with ties to billionaire Sam Zell - Equity Commonwealth  and Real Industry Inc   Barron's said in a report.",
        "date": "12192016",
        "name": "Equity Commonwealth",
        "news_type": "topStory",
        "symbol": "EQC",
        "title": "AMC Entertainment  Equity Commonwealth are stocks to watch: Barron's "
    },
    {
        "content": "* Q3 FFO per share $0.25  Source text for Eikon:  Further company coverage:",
        "date": "11022016",
        "name": "Equity Commonwealth",
        "news_type": "topStory",
        "symbol": "EQC",
        "title": "BRIEF-Equity Commonwealth Q3 adjusted ffo per share $0.23 "
    }
]