[
    {
        "content": "DUBAI/MONTREAL  Nov 14 State-owned EgyptAir on Tuesday signed an initial order for 12 Bombardier CSeries jets  marking the Canadian plane maker's second deal for its largest planes this month -  agreements that end an 18-month drought of no sales of the aircraft. The two orders  the other for 31 aircraft from an undisclosed European buyer  are expected to be finalized by the end of 2017  a senior Bombardier executive said.",
        "date": "11142017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "AIRSHOW-EgyptAir signs $1.1 bln deal for 12 Bombardier CSeries jets "
    },
    {
        "content": "DUBAI Ethiopian Airlines would be interested in buying around 10 to 20 of the mid-sized jets that Boeing is studying whether to develop  the  African airline's chief executive said on Tuesday.",
        "date": "11142017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Ethiopian could buy 10-20 of Boeing's proposed mid-sized jet "
    },
    {
        "content": "DUBAI  Nov 14 Ethiopian Airlines would be interested in buying around 10 to 20 of the mid-sized jets that Boeing is studying whether to develop  the  African airline's chief executive said on Tuesday.",
        "date": "11142017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "AIRSHOW-Ethiopian could buy 10-20 of Boeing's proposed mid-sized jet "
    },
    {
        "content": "SAO PAULO  Nov 9 The top executive at the biggest European operator of Embraer passenger jets took a close look at the planemaker's next-generation aircraft on Wednesday  but said it is too early to think about placing an order.",
        "date": "11092017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Regional airline KLM Cityhopper has kind words but no orders for Embraer's E2 "
    },
    {
        "content": "SAO PAULO Embraer SA has stopped flying the first prototype of its new military cargo jet after a stall test last month pushed the aircraft beyond its operating limits  the planemaker said on Wednesday  adding that the project is still on schedule.",
        "date": "11082017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer halts flights of military cargo jet after test incident "
    },
    {
        "content": "SAO PAULO  Nov 8 Embraer SA has stopped flying the first prototype of its new military cargo jet after a stall test last month pushed the aircraft beyond its operating limits  the planemaker said on Wednesday  adding that the project is still on schedule.",
        "date": "11082017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 2-Embraer halts flights of military cargo jet after test incident "
    },
    {
        "content": "SAO PAULO  Nov 8 Brazilian planemaker Embraer SA said on Wednesday that its first prototype of the KC-390 military transport aircraft sustained no damage to its primary structure in an incident that occurred during an Oct. 12 flight test.",
        "date": "11082017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer says no major damage to military transport prototype after incident "
    },
    {
        "content": "* Embraer SA - co and American Airlines Inc signed a firm order for ten E175 jets​",
        "date": "10312017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "BRIEF-Embraer SA - Co and American Airlines Inc signed a firm order for ten E175 jets​ "
    },
    {
        "content": "SAO PAULO Brazilian planemaker Embraer SA  said on Friday that revenue and profits could suffer next year during the transition to a new generation of commercial aircraft  known as E2  which is likely to slow deliveries and consume cash.",
        "date": "10272017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer warns of weaker 2018 due to E2 ramp-up "
    },
    {
        "content": "SAO PAULO  Oct 31 American Airlines Inc ordered 10 additional E-175 jets from Brazilian planemaker Embraer SA valued at $457 million at current list prices.",
        "date": "10312017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "American Airlines orders 10 additional Embraer E-175 jets "
    },
    {
        "content": "SAO PAULO  Oct 27 Brazilian planemaker Embraer SA said on Friday that revenue and profits could suffer next year during the transition to a new generation of commercial aircraft  known as E2  which is likely to slow deliveries and consume cash.",
        "date": "10272017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 2-Embraer warns of weaker 2018 due to E2 ramp-up "
    },
    {
        "content": "SAO PAULO  Oct 27 A weaker 2018 performance outlook for Embraer SA is not related to a newly announced partnership between Airbus SA and Bombardier Inc  which should have a limited effect on the Brazilian planemaker next year  Chief Financial Officer Jose Filippo told journalists on Friday.",
        "date": "10272017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer CFO says weaker 2018 unrelated to Airbus-Bombardier JV "
    },
    {
        "content": "SAO PAULO  Oct 27 Brazilian planemaker Embraer SA on Friday posted third-quarter net income of 351 million reais ($107 million) versus a net loss of 111 million a year earlier  a securities filing showed on Friday.",
        "date": "10272017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer swings to profit  holds 2017 performance targets "
    },
    {
        "content": "* ‍Embraer Defense & Security and Sierra Nevada Corp-received orders from U.S. air force's A-29 Afghanistan program for 6 more A-29 super tucano aircraft​ Source text for Eikon: Further company coverage:",
        "date": "10252017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "BRIEF-‍Embraer Defense & Security and Sierra Nevada Corp says received orders from U.S. air force's A-29 Afghanistan program "
    },
    {
        "content": "PARIS  Oct 26 Canada has urged the World Trade Organisation to block attempts by Brazil to trigger a detailed investigation of its aerospace industry to buttress its case that subsidies to Bombardier caused \"serious prejudice\" to Brazil's Embraer.",
        "date": "10262017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Canada in bid to limit Brazil aircraft subsidy probe at WTO "
    },
    {
        "content": "BRASILIA  Oct 18 Brazil planemaker Embraer said on Wednesday it would deliver its first E190-E2 jet in April 2018 to Norway-based airline Wideroe.",
        "date": "10182017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil planemaker Embraer to deliver first E190-E2 in April 2018 "
    },
    {
        "content": "MONTREAL Airbus SE takes a majority stake in Bombardier Inc's CSeries jet program for $1  in a game-changing aerospace deal that puts pressure on rivals Boeing Co and Embraer.",
        "date": "10172017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Factbox: Winners and losers in Bombardier/Airbus CSeries deal "
    },
    {
        "content": "* Boeing says deal has no impact on pending anti-dumping case",
        "date": "10172017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "WRAPUP 1-Boeing says Bombardier CSeries jets may face hefty duties despite Airbus deal "
    },
    {
        "content": "MONTREAL/TOULOUSE  France  Oct 17 Airbus has agreed to take a majority stake in Bombardier's troubled CSeries jetliner programme  securing the plane's future and giving the Canadian firm a possible way out of a damaging trade dispute with Boeing.",
        "date": "10172017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "WRAPUP 5-Airbus takes control of Bombardier CSeries in rebuff to U.S. threat "
    },
    {
        "content": "    By Bruno Federowski     SAO PAULO  Oct 17 Brazilian stocks fell on Tuesday as lawmakers debated whether to put President Michel Temer on trial before the Supreme Court  a potential blow to his agenda of market-friendly reforms.     Traders largely expect the center-right president to successfully dodge corruption charges  as he did with a similar string of accusations earlier this year.     Still  a smaller-than-expected show of support for Temer could indicate he will struggle t",
        "date": "10172017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "EMERGING MARKETS-Brazil stocks fall on political woes; Embraer drops "
    },
    {
        "content": "BRASILIA  Oct 17 Brazilian planemaker Embraer SA on Tuesday said Airbus taking a majority stake in Bombardier Inc's CSeries jetliner program underscores huge opportunities in the 100-150-seat airliner market.",
        "date": "10172017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer says CSeries deal underscores huge opportunities "
    },
    {
        "content": "TOULOUSE  France Two years ago  Airbus Chief Executive Tom Enders halted negotiations to buy Canada's CSeries program at midnight after the talks with Bombardier leaked to Reuters. On Tuesday  he performed a U-turn by backing a similar deal after all - again at dead of night.",
        "date": "10172017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Midnight in Toulouse: How CSeries deal shook status quo "
    },
    {
        "content": "* Embraer selected Gogo business aviation's inflight connectivity technology for its Legacy 450  Legacy 500 business jets ​ Source text for Eikon: [ID: nPn5Z1HxRa] Further company coverage:",
        "date": "10102017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "BRIEF-Embraer selects Gogo AVANCE L5 for Legacy 450  Legacy 500 business jets "
    },
    {
        "content": "SAO PAULO  Oct 10 Embraer SA delivered 25 commercial jets and 20 executive jets in the third quarter of 2017  the Brazilian planemaker said in a securities filing on Tuesday.",
        "date": "10102017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer delivers 25 commercial  20 executive jets in Q3 "
    },
    {
        "content": "LAS VEGAS  Oct 9 Embraer SA's most popular corporate jet will be revamped next year  with the Brazilian planemaker on Monday announcing a redesigned cabin and new inflight entertainment system for its eight-seater Phenom 300.",
        "date": "10092017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer redesigns top-selling light jet for 2018 "
    },
    {
        "content": "* Chorus aviation announces acquisition of two Embraer 195 aircraft on lease to Azul Brazilian Airlines",
        "date": "09282017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "BRIEF-Chorus Aviation announces acquisition of two Embraer 195 aircraft on lease to Azul Brazilian Airlines "
    },
    {
        "content": "SAO PAULO A U.S. decision to slap steep anti-subsidy duties on Bombardier Inc  jets should bolster Brazil's case against Canadian subsidies at the World Trade Organization  the chief executive of Brazilian planemaker Embraer SA  said on Wednesday.",
        "date": "09272017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer CEO sees U.S. duties boosting Brazil's WTO case "
    },
    {
        "content": "SAO PAULO  Sept 26 Brazilian planemaker Embraer SA cheered a decision by the U.S. Department of Commerce on Tuesday to slap preliminary anti-subsidy duties of 220 percent on CSeries jets made by  Bombardier Inc after U.S. rival Boeing Co claimed the aircraft were unfairly subsidized by Canada.",
        "date": "09262017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer cheers U.S. decision on Bombardier subsidies "
    },
    {
        "content": "* Embraer SA - ‍order has a value of USD 914 million  based on current list prices  and will be included in Embraer's 2017 third-quarter backlog​ Source text for Eikon: Further company coverage:",
        "date": "10022017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "BRIEF-Embraer announces firm order for 20 E-Jets from SkyWest "
    },
    {
        "content": "SAO PAULO  Sept 14 Brazilian planemaker Embraer SA is considering the development of a new turboprop passenger plane  the company said on Thursday  potentially returning to a segment dominated by the Franco-Italian ATR and Canada's Bombardier Inc.",
        "date": "09142017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer eyes making turboprop plane to rival ATR  Bombardier "
    },
    {
        "content": "BRASILIA  Sept 6 Brazilian planemaker Embraer SA on Wednesday said it had received a firm order from SkyWest Inc. for 25 E-jets  with a total value of $1.1 billion.",
        "date": "09062017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer gets $1.1 bln firm order from SkyWest "
    },
    {
        "content": "WASHINGTON  Aug 28 The Pentagon has notified the U.S. Congress of the sale to Nigeria of 12 Super Tucano A-29 planes and weapons worth $593 million  which the West African country wants for its fight against the militant group Boko Haram.",
        "date": "08302017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "CORRECTED-UPDATE 1-Pentagon notified U.S. Congress of $593 mln military sale to Nigeria "
    },
    {
        "content": "BRASILIA/RIO DE JANEIRO  Aug 22 Brazil's surprise move to privatize Centrais Eletricas Brasileiras SA sent the utility's shares soaring nearly 50 percent on Tuesday as investors bet the plan augured further moves to loosen the government's grip on the economy.",
        "date": "08222017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 4-Brazil's move to privatize Eletrobras sparks investor euphoria "
    },
    {
        "content": "SAO PAULO  July 28 Brazilian planemaker Embraer SA is seeing strong demand across its commercial  executive and defense aviation divisions  which should support earnings next year  Chief Executive Paulo Cesar Silva told analysts on Friday.",
        "date": "07282017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer CEO sees solid demand across segments next year "
    },
    {
        "content": "SAO PAULO  July 28 Brazilian planemaker Embraer SA posted a lower second-quarter gross profit margin on its business jets due to a delivery mix with fewer of its light Phenom jets  Chief Financial Officer Jose Filippo told journalists on Friday.",
        "date": "07282017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer business jet mix hurt margins  but orders are solid -CFO "
    },
    {
        "content": "SAO PAULO  July 28 Embraer SA returned to profit in the second quarter as the Brazilian planemaker ramped up deliveries of narrow body E-Jets to airlines and brought down operating costs through job cuts and controls on corporate expenses.",
        "date": "07282017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 1-Brazil's Embraer returns to profit as E-Jet deliveries surge "
    },
    {
        "content": "SAO PAULO  July 28 Brazil's Embraer SA   the world's third-largest commercial planemaker  reported a second-quarter net income of 193 million reais ($61 million) after a net loss of 337 million reais a year earlier  a securities filing on Friday showed.",
        "date": "07282017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil planemaker Embraer returns to profit in Q2 "
    },
    {
        "content": "* Aerocentury Corp expands credit facility to $170 million; purchases three Embraer 175 jets",
        "date": "07262017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "BRIEF-AeroCentury purchases three Embraer 175 jets "
    },
    {
        "content": "* Chorus Aviation announces agreement to acquire two additional embraer 190 aircraft on lease to Aeromexico connect",
        "date": "07272017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "BRIEF-Chorus Aviation announces agreement to acquire 2 Embraer 190 aircraft "
    },
    {
        "content": "SAO PAULO Embraer SA   the world's No. 1 regional planemaker  delivered 35 commercial jets and 24 executive jets in the second quarter  representing increases on a quarterly and annual basis.",
        "date": "07112017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer deliveries rise  driven by commercial jet segment "
    },
    {
        "content": "SAO PAULO  July 11 Embraer SA  the world's No. 1 regional planemaker   delivered 35 commercial jets and 24 executive jets in the second quarter  representing increases on a quarterly and annual basis.",
        "date": "07112017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "CORRECTED-Embraer deliveries rise  driven by commercial jet segment "
    },
    {
        "content": "June 21 Embraer SA announced on Wednesday that South African regional carrier Airlink had signed a 10-year flight hour pool program covering 13 E-Jets the airline has ordered  adding to the planemaker's push to boost services as a share of revenue.",
        "date": "06212017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer signs pool program deal to service Airlink fleet "
    },
    {
        "content": "Brazil's Embraer SA  booked firm orders for 18 planes from five different airlines in deals worth about $1 billion at the Paris Airshow on Tuesday  with demand focused mostly on its next-generation E2 narrowbody jets.",
        "date": "06202017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer books $1 bln in orders  mostly next-gen jets "
    },
    {
        "content": " (Adds peso slipping on Fed member comments)     June 19 Brazilian stocks rose on Monday  supported by planemaker Embraer SA  while the Mexican peso slipped from a 13-month peak after comments by a Federal Reserve official supported bets of further U.S. interest rate hikes.     Embraer SA rose 4.6 percent as traders bet on fresh orders for the jetmaker at the start of the Paris Airshow  the global aviation industry's biggest event.     Gains in Brazilian markets were limited due to c",
        "date": "06192017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "EMERGING MARKETS-Brazilian stocks rise  led by Embraer; Mexican peso slips "
    },
    {
        "content": "June 20 Brazil's Embraer SA booked firm orders for 18 planes from five different airlines in deals worth about $1 billion at the Paris Airshow on Tuesday  with demand focused mostly on its next-generation E2 narrowbody jets.",
        "date": "06202017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "AIRSHOW-Embraer books $1 bln in orders  mostly next-gen jets "
    },
    {
        "content": "    By Bruno Federowski     SAO PAULO  June 19 Brazilian stocks rose on Monday  supported by shares of miners and planemaker Embraer SA  though lingering concerns that a political crisis could delay structural reforms kept a lid on gains.     Shares of miner Vale SA added the most points to Brazil's benchmark Bovespa stock index  tracking iron ore futures higher.     Embraer SA was the biggest gainer on the Bovespa as traders bet on fresh orders for the jetmaker at the start of the P",
        "date": "06192017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "EMERGING MARKETS-Brazil stocks track commodities higher  political worries linger "
    },
    {
        "content": "SAO PAULO  June 19 Savis Tecnologia e Sistemas SA and Bradar SA  two subsidiaries of Brazilian planemaker Embraer SA  signed a partnership agreement with France's Thales SA on air traffic control  according to an Embraer statement on Monday.",
        "date": "06192017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer units Savis  Bradar sign partnership with France's Thales "
    },
    {
        "content": "BRASILIA  June 20 Brazilian planemaker Embraer SA booked firm orders for 18 planes from five different clients in deals totaling about $1 billion during the Paris International Air Show  according to a securities filing on Tuesday.",
        "date": "06202017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer books about $1 bln in orders at Paris Air Show "
    },
    {
        "content": "RIO DE JANEIRO  June 13 Embraer SA expects to reach terms on the sale of at least five KC-390 airlifters to Portugal within three months  landing the first foreign order for the new plane with a NATO member country  two people familiar with talks said on Tuesday.",
        "date": "06132017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer nears sale of five military cargo jets to Portugal-sources "
    },
    {
        "content": "SAO PAULO  June 2 Brazil's planemaker Embraer SA will buy back up to 3 million shares  equivalent to 0.4 percent of total shares in circulation  the company said in a securities filing.",
        "date": "06022017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer to buy back up to 3 million shares "
    },
    {
        "content": "CANCUN  Mexico The biggest passenger jet ever made by Brazil's Embraer SA  may become its top-selling model  emerging from the shadows of smaller siblings due to extra rows and big wings that have changed its economics  a senior executive told Reuters.",
        "date": "06062017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer's biggest passenger jet may be its best-seller "
    },
    {
        "content": "CANCUN  Mexico  June 5 AirBaltic is planning to buy at least 14 new planes with more than 100 seats to replace the turboprops in its fleet  with planemakers Bombardier or Embraer in the running  the Latvian-based airline's CEO said on Monday.",
        "date": "06052017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "AirBaltic eyes order for at least 14 jets "
    },
    {
        "content": "CANCUN  Mexico  June 5 AirBaltic is planning to buy at least 14 new planes with more than 100 seats to replace the turboprops in its fleet  with planemakers Bombardier or Embraer in the running for the deal  the Latvian-based airline's CEO said on Monday.",
        "date": "06052017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 1-AirBaltic eyes order for at least 14 jets "
    },
    {
        "content": "SAO PAULO  May 12 Brazil's Embraer SA on Friday said its A-29 Super Tucano will participate in the U.S. Air Force's OA-X program assessing low-cost options for acquiring light attack aircraft  with tests starting in July.",
        "date": "05122017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer says U.S. Air Force to try out Super Tucano "
    },
    {
        "content": "SAO PAULO Brazilian planemaker Embraer SA  reported a sharp drop in profit on Tuesday as its revenue was hurt by a big seasonal dip in deliveries and a delayed satellite launch  sending its share price down by more than 3 percent.",
        "date": "05022017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer profit drops after delay in deliveries  satellite launch "
    },
    {
        "content": "SAO PAULO  May 2 Brazilian planemaker Embraer SA reported a sharp drop in profit on Tuesday as its revenue was hurt by a big seasonal dip in deliveries and a delayed satellite launch  sending its share price down by more than 3 percent.",
        "date": "05022017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 2-Embraer profit drops after delay in deliveries  satellite launch "
    },
    {
        "content": "SAO PAULO  May 2 Brazilian planemaker Embraer SA has seen \"great activity\" in sales campaigns for its commercial aircraft in the United States and elsewhere  Chief Executive Paulo Cesar Silva told analysts on a Tuesday earnings call.",
        "date": "05022017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer CEO reports strong sales activity in commercial jet unit "
    },
    {
        "content": "SAO PAULO  May 2 U.S. regional jet operator Republic Airways Holdings Inc  the biggest operator of commercial aircraft made by Embraer SA  will expand its fleet this year through leasing arrangements  Embraer's Chief Financial Officer Jose Filippo said on Tuesday.",
        "date": "05022017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer says Republic to add new jets through leasing deals "
    },
    {
        "content": "SAO PAULO  May 2 Brazil's Embraer SA  the world's third-largest commercial planemaker  reported first-quarter net income of 135 million reais ($43 million) on Tuesday  down from a profit of 386 million reais a year earlier due to a drop in deliveries.",
        "date": "05022017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer reports smaller profit as deliveries fall "
    },
    {
        "content": "SAO PAULO  April 25 Embraer SA has signed a partnership with Uber Technologies Inc to develop and implement small electric vehicles with vertical takeoff and landing capabilities  the Brazilian planemaker said on Tuesday.",
        "date": "04252017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer to partner with Uber to develop electric vehicles "
    },
    {
        "content": "SAO PAULO  April 13 Embraer SA delivered 18 commercial jets and 15 executive jets in the first three months of 2017  the Brazilian planemaker said in a securities filing on Thursday.",
        "date": "04132017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer delivers 18 commercial jets and 15 executive jets in Q1 "
    },
    {
        "content": "WASHINGTON/ABUJA  April 10 President Donald Trump's administration is pushing forward with plans to sell up to a dozen aircraft to Nigeria's air force for the fight against the extremist group Boko Haram  sources said on Monday  in a deal that could be worth up to $600 million.",
        "date": "04102017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 2-Trump plans to move ahead with Nigeria planes sale: sources "
    },
    {
        "content": "RIO DE JANEIRO  April 5 Brazilian planemaker Embraer SA sees $1.5 billion in annual exports as \"a good target\" for its KC-390 military cargo jet entering service next year  Jackson Schneider  head of the company's defense unit  said on Wednesday.",
        "date": "04062017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "REFILE-UPDATE 2-Brazil's Embraer sees solid demand for new military cargo jet "
    },
    {
        "content": "RIO DE JANEIRO Brazilian planemaker Embraer SA sees $1.5 billion in annual exports as \"a good target\" for its KC-390 military cargo jet entering service next year  Jackson Schneider  head of the company's defense unit  said on Wednesday.",
        "date": "04052017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer sees solid demand for new military cargo jet "
    },
    {
        "content": "RIO DE JANEIRO  April 5 Brazilian planemaker Embraer SA sees $1.5 billion in annual exports as \"a good target\" for its KC-390 military cargo jet scheduled to enter service next year  Jackson Schneider  head of the company's defense unit  told journalists on Wednesday.",
        "date": "04052017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer targets $1.5 bln in yearly exports of KC-390 "
    },
    {
        "content": "RIO DE JANEIRO U.S. aviation electronics maker Rockwell Collins Inc  and Brazil's Embraer SA  will assess each other's remote sensing and border control technology for possible joint sales  a senior executive for the Brazilian planemaker told Reuters.",
        "date": "04042017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Exclusive: Embraer  Rockwell Collins eye shared remote sensing portfolio "
    },
    {
        "content": "RIO DE JANEIRO U.S. aviation electronics maker Rockwell Collins Inc  and Brazilian planemaker Embraer SA  agreed on Tuesday to work on integrating their remote sensing  targeting and communications portfolios for joint defense sales.",
        "date": "04042017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer  Rockwell Collins to combine products for defense sales "
    },
    {
        "content": "SAO PAULO  March 29 Embraer's biggest passenger jet ever took to the skies more than three months ahead of schedule on Wednesday  giving the world's third-largest commercial planemaker more time to refine the aircraft before it enters service in early 2019.",
        "date": "03292017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "UPDATE 1-Embraer holds E195-E2 timeline after early first flight "
    },
    {
        "content": "RIO DE JANEIRO  April 4 U.S. aviation electronics maker Rockwell Collins Inc and Brazilian planemaker Embraer SA agreed on Tuesday to work on integrating their remote sensing  targeting and communications portfolios for joint defense sales.",
        "date": "04042017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 1-Embraer  Rockwell Collins to combine products for defense sales "
    },
    {
        "content": "SAO PAULO  March 29 Brazilian planemaker Embraer SA still plans to make the first deliveries of its next-generation E195-E2 passenger jet in the first half of 2019  a senior executive said on Wednesday  despite flying the first prototype of the model well ahead of schedule.",
        "date": "03292017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer holds delivery timeline for E195-E2 after early first flight "
    },
    {
        "content": "SAO PAULO  April 4 The partnership between Brazilian planemaker Embraer and U.S. aviation electronics maker Rockwell Collins could eventually lead to the joint development of a new product  the head of Embraer's defense division Jackson Schneider said on Tuesday.",
        "date": "04042017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer says partnership with Rockwell could lead to joint product "
    },
    {
        "content": "SAO PAULO  March 29 Brazilian planemaker Embraer SA said on Wednesday its biggest commercial aircraft ever took to the skies more than three months ahead of schedule  confirming healthy progress on a re-engined new generation of airliners.",
        "date": "03292017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer's E195-E2 makes first flight well ahead of schedule "
    },
    {
        "content": "BRASILIA  March 20 Brazil's Embraer SA   the world's third-largest commercial planemaker  on Monday announced the launch of a fourth prototype of a next-generation narrow-body jet slated to enter service in 2018.",
        "date": "03202017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer launches fourth E190-E2 jet prototype "
    },
    {
        "content": "SAO PAULO  March 14 Brazil's Embraer SA   the world's third-largest commercial planemaker  announced on Tuesday it was establishing teams in Silicon Valley and Boston to collaborate on research with startup companies  investors  academics and others.",
        "date": "03142017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer to set up Silicon Valley  Boston research teams "
    },
    {
        "content": "SAO PAULO Embraer SA  is on track to fly its next-generation E195-E2 commercial jet by June after an earlier-than-expected rollout of its first prototype on Tuesday  a senior executive at the Brazilian planemaker said.",
        "date": "03072017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Exclusive: Embraer sees new E195 first flight sooner than expected "
    },
    {
        "content": "SAO PAULO Brazilian planemaker Embraer SA  posted better-than-expected earnings on Thursday and forecast stronger operating profit this year  lifting shares to a 10-month high as investors bought in to a new chief executive's cost-cutting campaign.",
        "date": "03092017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer beats profit estimates  cost cuts boost 2017 outlook "
    },
    {
        "content": "SAO PAULO  March 9 Brazilian planemaker Embraer SA posted better-than-expected earnings on Thursday and forecast stronger operating profit this year  lifting shares to a 10-month high as investors bought in to a new chief executive's cost-cutting campaign.",
        "date": "03092017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 3-Embraer beats profit estimates  cost cuts boost 2017 outlook "
    },
    {
        "content": "SAO PAULO Brazilian planemaker Embraer SA  can produce current and upcoming generations of its E175 regional jet on the same assembly line without sacrificing profitability  Chief Executive Paulo Cesar Silva told analysts on a Thursday earnings call.",
        "date": "03092017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer can make two generations of E175 efficiently: CEO "
    },
    {
        "content": "SAO PAULO  March 9 Brazilian planemaker Embraer SA can produce current and upcoming generations of its E175 regional jet on the same assembly line without sacrificing profitability  Chief Executive Paulo Cesar Silva told analysts on a Thursday earnings call.",
        "date": "03092017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer can make two generations of E175 efficiently -CEO "
    },
    {
        "content": "SAO PAULO Brazilian planemaker Embraer SA  expects to deliver slightly more of its larger E190 and E195 jets as a share of its commercial jet deliveries in 2017  Chief Financial Officer Jose Antonio Filippo said on a Thursday earnings call with reporters.",
        "date": "03092017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer sees slightly larger mix of E-Jet deliveries in 2017: CFO "
    },
    {
        "content": "SAO PAULO  March 9 Brazilian planemaker Embraer SA expects to deliver slightly more of its larger E190 and E195 jets as a share of its commercial jet deliveries in 2017  Chief Financial Officer Jose Antonio Filippo said on a Thursday earnings call with reporters.",
        "date": "03092017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer sees slightly larger mix of E-Jet deliveries in 2017 -CFO "
    },
    {
        "content": "SAO PAULO  March 9 Brazil's Embraer SA   the world's third-largest commercial planemaker  reported on Thursday a 52 percent rise in its fourth-quarter net income to 648 million reais ($205 million).",
        "date": "03092017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer posts stronger fourth-quarter profit "
    },
    {
        "content": "SAO PAULO  Feb 24 Brazilian planemaker Embraer SA said on Friday that its former head of executive aviation Marco Tulio Pellegrini will take over Portuguese maintenance and production unit OGMA starting on April 3.",
        "date": "02242017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer's Pellegrini to run OGMA division in Portugal "
    },
    {
        "content": "SAO PAULO  Feb 16 Brazilian planemaker Embraer SA on Thursday tapped Michael Amalfitano to lead its struggling business jet division  turning for the second time in a year to a leasing industry veteran for a senior leadership post.",
        "date": "02162017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "UPDATE 1-Embraer taps leasing veteran to run business jet unit "
    },
    {
        "content": "SAO PAULO  Feb 16 Brazilian planemaker Embraer SA on Thursday said Michael Amalfitano  a veteran of the leasing industry  will run its business jet division  according to a securities filing.",
        "date": "02162017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer picks Michael Amalfitano to run business jet unit "
    },
    {
        "content": "BRASILIA  Feb 14 Brazilian planemaker Embraer SA  said on Tuesday that Norwegian airline Widerøe will be the first to fly its next-generation E190-E2 jet  which is scheduled to enter service in the first half of next year.",
        "date": "02142017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "UPDATE 1-Norwegian airline to fly first of Embraer's next-generation jet "
    },
    {
        "content": "BRASILIA  Feb 14 Brazilian planemaker Embraer SA  on Tuesday said it had received a firm order from Norwegian airline Widerøe for three E190-E2 jets.",
        "date": "02142017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer gets firm order for 3 E190-E2 jets from Widerøe "
    },
    {
        "content": "SAO PAULO Shares of Brazilian Embraer SA  rose the most in almost a month on Friday  after stronger-than-expected  deliveries fueled expectations of solid fourth-quarter results.",
        "date": "01132017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer shares jump; deliveries fuel profit hopes "
    },
    {
        "content": "SAO PAULO  Jan 13 Shares of Brazilian Embraer SA  rose the most in almost a month on Friday  after stronger-than-expected  deliveries fueled expectations of solid fourth-quarter results.",
        "date": "01132017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 1-Brazil's Embraer shares jump; deliveries fuel profit hopes "
    },
    {
        "content": "SAO PAULO  Jan 13 Brazil's Embraer SA   the world's third-largest commercial planemaker  said on Friday it delivered 32 commercial jets and 43 executive jets in the final three months of 2016.",
        "date": "01132017",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer delivers 32 commercial jets  43 private jets in 4th qtr "
    },
    {
        "content": "SAO PAULO Brazilian planemaker Embraer SA  called on Tuesday for the aviation industry to set limits on state funding of aircraft development  a day after Brazil said it would challenge Canada over government support for rival Bombardier Inc .",
        "date": "12202016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer calls for industry limits on aircraft development funding "
    },
    {
        "content": "SAO PAULO  Nov 28 Embraer SA said on Monday that unions for workers at most Brazil-based operations approved collective bargaining agreements providing for an average 5 percent pay raise next year  with the exception of one metalworkers union at the aircraft maker's largest factory.",
        "date": "11282016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "UPDATE 1-Embraer says most Brazil unions agree to 5 pct raise next year "
    },
    {
        "content": "SAO PAULO  Nov 28 Brazilian planemaker Embraer SA on Monday said unions at most of its operations in Brazil had signed collective bargaining agreements  however a metalworkers union at its biggest factory had held off on formalizing the deal.",
        "date": "11282016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer says most Brazil unions agree to 5 pct raise in 2017 "
    },
    {
        "content": "MONTREAL  Nov 25 Delta Air Lines Inc  pilots are expected to keep existing rules in their new labor contract that prevent the U.S. No. 2 carrier from flying aircraft above a certain weight on regional routes  in a blow to Embraer SA and Mitsubishi Heavy Industries Ltd   whose latest models exceed that limit.",
        "date": "11252016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Delta pilots oppose larger regional aircraft  in blow to Embraer -sources "
    },
    {
        "content": "BRASILIA  Nov 23 The U.S. Treasury has reassured Brazilian banks they can finance trade with Iran without fear of sanctions  opening the way to billions of dollars in potential exports of jet planes  buses and equipment  a senior Brazilian official said on Wednesday.",
        "date": "11232016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 1-U.S. Treasury reassures Brazil banks trade with Iran OK "
    },
    {
        "content": "BRASILIA  Nov 23 The U.S. Treasury has reassured Brazilian banks they can finance trade with Iran without fear of sanctions  opening the way to billions of dollars in potential exports of jet planes  buses and equipment  a senior Brazilian official said on Wednesday.",
        "date": "11232016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "U.S. Treasury encourages Brazil trade with Iran - official "
    },
    {
        "content": "* Embraer Sa- backlog movement will be reflected on Co's 2016 fourth-quarter results   does not have an incremental impact on company's current backlog",
        "date": "11162016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "BRIEF-Embraer signs agreements with United Airlines and Republic Airways "
    },
    {
        "content": "BRASILIA  Nov 15 Brazilian planemaker Embraer  said on Tuesday it has signed a deal with United Airlines for 24 E175 jets  transferring a firm order previously placed by Republic Airways Holdings  .",
        "date": "11152016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer inks deal with United to transfer jets order "
    },
    {
        "content": "SAO PAULO  Nov 10 Brazilian planemaker Embraer SA said on Thursday it had begun negotiations with a metalworkers union to put up to 2 000 workers on two- to five-month furloughs over the course of 2017 and 2018 in order to cut costs as production slows.",
        "date": "11102016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer proposes furlough for up to 2 000 workers "
    },
    {
        "content": "* expects to generate an extra $4.8 billion per year by 2020 from new initiatives",
        "date": "11152016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "BRIEF-United Continental says will defer 61 Boeing planes due in next 2 yrs "
    },
    {
        "content": "* Awarded supplemental work by Embraer to provide landing gear components and assemblies for KC-390 aircraft",
        "date": "11042016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "BRIEF-Heroux-Devtek awarded supplemental work by Embraer to provide components and assemblies for KC-390 aircraft "
    },
    {
        "content": "SAO PAULO Brazilian planemaker Embraer SA  is determined to offer fewer discounts on its executive jets  even at the risk of hurting sales  in order to restore the profit margin at the unit which produces them  Chief Executive Paulo Cesar de Souza e Silva told analysts on Monday.",
        "date": "10312016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer ready to cut executive jet sales to protect profits: CEO "
    },
    {
        "content": "SAO PAULO  Oct 31 Brazilian planemaker Embraer SA is determined to offer fewer discounts on its executive jets  even at the risk of hurting sales  in order to restore the profit margin at the unit which produces them  Chief Executive Paulo Cesar de Souza e Silva told analysts on Monday.",
        "date": "10312016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer ready to cut executive jet sales to protect profits -CEO "
    },
    {
        "content": "* Saudi Aramco confirms it unveiled a corruption case associated with Embraer",
        "date": "10282016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "BRIEF-Saudi Aramco confirms it unveiled corruption case associated with Embraer "
    },
    {
        "content": "SAO PAULO Strong year-end demand for aircraft  especially executive jets  should help Brazilian planemaker Embraer SA  hit its 2016 operating targets  Chief Financial Officer Jose Antonio Filippo told journalists on a Monday earnings call.",
        "date": "10312016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Strong year-end demand seen lifting Embraer to 2016 targets: CFO "
    },
    {
        "content": "SAO PAULO  Oct 31 Strong year-end demand for aircraft  especially executive jets  should help Brazilian planemaker Embraer SA hit its 2016 operating targets  Chief Financial Officer Jose Antonio Filippo told journalists on a Monday earnings call.",
        "date": "10312016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Strong year-end demand seen lifting Embraer to 2016 targets -CFO "
    },
    {
        "content": "SAO PAULO  Oct 31 Brazilian planemaker Embraer SA booked a quarterly net loss of 111 million reais ($35 million) on Monday due to one-time costs related to staff cuts  used aircraft writedowns and a corruption settlement with U.S. and Brazilian authorities.",
        "date": "10312016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer books quarterly loss on buyouts and writedowns "
    },
    {
        "content": "SAO PAULO Brazilian planemaker Embraer SA  on Monday reached an agreement with U.S. and Brazilian authorities to settle a six-year corruption investigation  paying $205.5 million to turn the page on signs of graft in four foreign contracts.",
        "date": "10242016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer reaches $205.5 mln graft settlement with U.S.  Brazil "
    },
    {
        "content": "SAO PAULO Brazilian planemaker Embraer SA  on Monday reached an agreement with U.S. and Brazilian authorities to settle a six-year corruption investigation  paying $205.5 million to turn the page on signs of graft in four foreign contracts.",
        "date": "10242016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer reaches $205.5 million graft settlement with U.S.  Brazil "
    },
    {
        "content": "SAO PAULO  Oct 24 Brazilian planemaker Embraer SA on Monday reached an agreement with U.S. and Brazilian authorities to settle a six-year corruption investigation  paying $205.5 million to turn the page on signs of graft in four foreign contracts.",
        "date": "10242016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 2-Embraer reaches $205.5 mln graft settlement with U.S.  Brazil "
    },
    {
        "content": "BRASILIA Brazil's Embraer   the world's third-largest commercial planemaker  is negotiating an order with Surf Air of California for up to 50 Phenom 300 executive jets worth $495 million  the Valor Economico newspaper reported on Monday.",
        "date": "10242016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer negotiating $495 million aircraft sale to Surf Air: paper "
    },
    {
        "content": "BRASILIA  Oct 24 Brazil's Embraer  the world's third-largest commercial planemaker  is negotiating an order with Surf Air of California for up to 50 Phenom 300 executive jets worth $495 million  the Valor Economico newspaper reported on Monday.",
        "date": "10242016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer negotiating $495 mln aircraft sale to Surf Air -paper "
    },
    {
        "content": "SAO PAULO Brazilian planemaker Embraer SA  on Friday reported its strongest third quarter for commercial jet deliveries in seven years  boosting shares on hopes that a strong result in its airline division would offset weak demand for executive jets.",
        "date": "10142016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Strong commercial jet deliveries lift Embraer shares "
    },
    {
        "content": "SAO PAULO  Oct 13 Brazilian planemaker Embraer SA said on Thursday that 180 employees had volunteered for a second round of buyouts opened last week  which could bring total layoffs this year to nearly 9 percent of the company's workforce.",
        "date": "10132016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer says 180 workers opt for second-round buyout "
    },
    {
        "content": "SAO PAULO  Oct 14 Brazilian planemaker Embraer SA on Friday reported its strongest third quarter for commercial jet deliveries in seven years  boosting shares on hopes that a strong result in its airline division would offset weak demand for executive jets.",
        "date": "10142016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 1-Strong commercial jet deliveries lift Embraer shares "
    },
    {
        "content": "SAO PAULO  Oct 6 Brazilian jet manufacturer Embraer SA said in a securities filing on Thursday that talks with U.S. authorities to settle a bribery investigation are at an advanced stage but that no agreement has yet been reached.",
        "date": "10062016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer: still no agreement yet with US authorities in bribery talks "
    },
    {
        "content": "SAO PAULO  Oct 5 Brazilian planemaker Embraer SA  said on Wednesday it was opening another voluntary buyout program for employees at the request of unions  adding to a nearly 8 percent reduction to its workforce in the last round of cuts.",
        "date": "10052016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazilian planemaker Embraer opens new employee buyout program "
    },
    {
        "content": "SAO PAULO  Oct 6 Brazil's Embraer SA  the world's third-largest commercial planemaker  said on Thursday that leasing company AerCap Holdings NV had placed five of its next-generation E-Jets with Turkish carrier Borajet Airlines.",
        "date": "10062016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer says Aercap leases 5 next-generation jets to Turkey's Borajet "
    },
    {
        "content": "SAO PAULO  Oct 6 A U.S. investigation of Brazilian planemaker Embraer SA  is looking into alleged bribery in the sale of aircraft to Mozambique's state airline in 2008  newspaper Folha de S.Paulo reported on Thursday.",
        "date": "10062016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "U.S. graft probe of Brazil's Embraer eyes Mozambique deal -report "
    },
    {
        "content": "SAO PAULO Brazilian planemaker Embraer SA confirmed on Monday that it would cut nearly 8 percent of its workforce through a voluntary buyout program  slashing costs amid weak business jet sales and downsized defense contracts.",
        "date": "09262016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer to cut nearly 8 percent of workforce through buyouts "
    },
    {
        "content": "SAO PAULO  Sept 26 Brazilian planemaker Embraer SA confirmed on Monday that it would cut nearly 8 percent of its workforce through a voluntary buyout program  slashing costs amid weak business jet sales and downsized defense contracts.",
        "date": "09262016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer to cut nearly 8 pct of workforce through buyouts "
    },
    {
        "content": "BRASILIA  Sept 2 Brazilian planemaker Embraer SA  signed an agreement with Chinese Colorful Guizhou Airlines  with two firm orders and three purchase rights for five E190s for a total $249 million at the current list price  Embraer said in a statement.   (Reporting by Silvio Cascione)",
        "date": "09022016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer books five orders from Chinese Colorful Guizhou Airlines "
    },
    {
        "content": "* Brazil's new president arrives in China for G20   (Adds details of deals)",
        "date": "09022016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 1-Brazil  China to sign multibillion-dlr business deals-Brazil foreign ministry "
    },
    {
        "content": "SAO PAULO  Sept 6 Brazilian planemaker Embraer SA said it has not been affected by delayed deliveries of Pratt & Whitney engines  which led Bombardier Inc  to cut its 2016 delivery forecast for the CSeries aircraft on Tuesday.",
        "date": "09062016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer sees no impact from engine delays troubling Bombardier "
    },
    {
        "content": "SAO PAULO Shareholders filed a class action lawsuit against Brazil's Embraer SA in New York  alleging that actions by management at the world third-largest commercial planemaker inflated the company's stock price for a four-year period.",
        "date": "08102016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Investors sue Embraer in New York  claim stock was inflated "
    },
    {
        "content": "SAO PAULO  Aug 10 Shareholders filed a class action lawsuit against Brazil's Embraer SA in New York  alleging that actions by management at the world third-largest commercial planemaker inflated the company's stock price for a four-year period.",
        "date": "08102016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 2-Investors sue Embraer in New York  claim stock was inflated "
    },
    {
        "content": "SAO PAULO  Aug 9 Shares in Embraer SA  the world's No. 3 commercial aircraft producer  fell on Tuesday after management launched a plan to reduce its workforce in Brazil and cut costs.",
        "date": "08092016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer stock drops on plans to cut Brazil workforce to cut costs "
    },
    {
        "content": "SAO PAULO  Aug 8 Brazilian planemaker Embraer SA  will launch a voluntary redundancy plan to reduce workforce in Brazil and cut costs  a company spokesman said on Monday  confirming information released earlier by a local metal workers union.",
        "date": "08082016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer to reduce workforce in Brazil to cut costs "
    },
    {
        "content": "SAO PAULO Shareholders filed a class action lawsuit against Brazil's Embraer SA  in New York  alleging the world third-largest commercial planemaker inflated its share price over a 4-year period  it said in a securities filing on Wednesday.",
        "date": "08102016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Shareholders sue Brazil's Embraer in NY  claming stock inflated "
    },
    {
        "content": "SAO PAULO  Aug 10 A class action suit has been filed against Brazil's Embraer SA in New York  seeking damages for shareholders  the world third-largest commercial planemaker said in a securities filing on Wednesday.",
        "date": "08102016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Class action suit filed in New York against Brazil's Embraer - filing "
    },
    {
        "content": "* CPI Aero has received a binding go ahead notice for first shipset to be delivered to Embraer during q1 of 2017  Source text for Eikon:  Further company coverage:",
        "date": "08042016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "BRIEF-CPI Aerostructures awarded contract for E-JETS E2S "
    },
    {
        "content": "SAO PAULO  July 29 Embraer SA  followed some competitors' move to offer discounts on certain business jets  but the Brazilian planemaker is now focused on maintaining pricing discipline  said Chief Executive Paulo Cesar Silva on a Friday earnings call.   (Reporting by Brad Haynes)",
        "date": "07292016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer CEO promises price discipline after business jet discounts "
    },
    {
        "content": "SAO PAULO Brazilian planemaker Embraer SA  cut its outlook for executive jet sales this year and set aside $200 million to settle a U.S. graft probe  triggering an unexpected quarterly loss and sending shares to a more than two-year low on Friday.",
        "date": "07292016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer cuts sales outlook; makes graft probe provision "
    },
    {
        "content": "SAO PAULO  July 29 Brazil's Embraer SA   the world's third-largest commercial planemaker  posted an unexpected second-quarter net loss of $99 million on Friday due to a $200 million provision for the possible settlement of a U.S. corruption probe.",
        "date": "07292016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Provision for U.S. corruption settlement triggers steep Embraer loss "
    },
    {
        "content": "BRASILIA Brazil may launch a trade challenge against Canada over state funding to struggling planemaker Bombardier Inc that could hurt Brazilian rival Embraer  Foreign Minister Jose Serra told Reuters on Thursday.",
        "date": "07152016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Exclusive: Brazil considers WTO challenge to Bombardier state funding "
    },
    {
        "content": "SAO PAULO  July 11 Brazilian planemaker Embraer SA booked a firm order for four current-generation E190 aircraft from Nordic Aviation Capital (NAC)  worth $199 million at list prices  according to a securities filing on Monday.",
        "date": "07112016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer books nine firm orders from NAC  Indonesia's Kalstar "
    },
    {
        "content": "* Program expands Boeing and Embraer's cooperation agreement and will test technologies to improve airplane environmental performance  Source text for Eikon:  Further company coverage:",
        "date": "07072016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "BRIEF-Boeing says co  Embraer unveil newest Ecodemonstrator aircraft "
    },
    {
        "content": "SAO PAULO  July 6 Brazil's Embraer SA  has signed a deal to sell up to a dozen Legacy 450 business jets to Canadian plane-share operator AirSprint Inc  the planemaker said on Wednesday.",
        "date": "07062016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Canada's AirSprint agrees to buy up to 12 Embraer business jets "
    },
    {
        "content": "SAO PAULO  July 11 Brazilian planemaker Embraer SA kept its commercial jet deliveries and order backlog roughly steady in the second quarter and wound down sales of an unprofitable executive jet that weighed on earnings in recent years.",
        "date": "07112016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 1-Brazil's Embraer books steady commercial deliveries  backlog "
    },
    {
        "content": "RIO DE JANEIRO  July 11 Brazil's Embraer SA  said on Monday it delivered 26 commercial jets and 26 executive jets during the second quarter  with an order backlog totaling $21.9 billion on June 30.    (Reporting by Stephen Eisenhammer)",
        "date": "07112016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer delivered 26 commercial jets  26 executive jets in Q2 "
    },
    {
        "content": "RIO DE JANEIRO  July 11 Brazil's Embraer SA  said on Monday it has signed an agreement with Boeing  to jointly market and support its military cargo KC-390 aircraft.",
        "date": "07112016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer and Boeing sign KC-390 marketing and support agreement "
    },
    {
        "content": "June 30 U.S. metal company Alcoa Inc has won a long-term $470 million contract to provide aluminum sheet and plate for Brazilian aircraft maker Embraer SA's  E2 model  which is scheduled to enter service in 2018  they said on Thursday.",
        "date": "06302016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Alcoa gets $470 million aluminum contract from Embraer aircraft "
    },
    {
        "content": "* Alcoa awarded multi-year  $470 million contract with Embraer",
        "date": "06302016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "BRIEF-Alcoa awarded multi-year  $470 mln contract with Embraer "
    },
    {
        "content": "SAO PAULO  June 21 Brazilian planemaker Embraer SA named its new head of commercial aviation on Tuesday  elevating John Slattery  the head of sales for the division  after five years at the company.",
        "date": "06212016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer names new head of commercial aviation division "
    },
    {
        "content": "SAO PAULO  June 13 Embraer SA  the world's third-largest planemaker  on Monday tapped Fabiana Leschziner as the new vice president for legal affairs  replacing Terena Penteado Rodrigues.",
        "date": "06132016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer taps Leschziner to head legal affairs department "
    },
    {
        "content": "SAO PAULO  June 9 Brazil's Embraer SA  will replace its chief executive with the current head of its commercial aviation division next month  the company said on Thursday  in a surprise decision.",
        "date": "06102016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "UPDATE 2-Brazil's Embraer names commercial aviation chief as new CEO "
    },
    {
        "content": "SAO PAULO  June 9 Brazilian planemaker Embraer SA said on Thursday that Paulo Cesar Silva  the current head of its commercial aviation division  will take over as chief executive.",
        "date": "06092016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer says commercial aviation chief to be new CEO "
    },
    {
        "content": "SAO PAULO  May 23 The first re-engined aircraft in Brazilian planemaker Embraer SA's narrowbody E-Jet family took its first flight on Monday  months ahead of schedule and below the expected weight.",
        "date": "05232016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "UPDATE 1-Embraer's new E-Jet makes first flight underweight  ahead of time "
    },
    {
        "content": "SAO PAULO  May 23 Brazil's Embraer SA   the world's third-largest commercial planemaker  on Monday announced the first flight of a next-generation narrow-body jet slated to enter service in 2018.",
        "date": "05232016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "CORRECTED-Brazil's Embraer announces first flight of E190-E2 "
    },
    {
        "content": "SAO PAULO  May 16 Brazilian planemaker Embraer SA may challenge the state funding received by Canadian rival Bombardier Inc at the World Trade Organization (WTO)  a senior executive told Reuters on Monday.",
        "date": "05162016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "UPDATE 2-Embraer eyes WTO challenge to Bombardier state funding "
    },
    {
        "content": "SAO PAULO  May 16 Brazilian planemaker Embraer SA may challenge the state funding received by Canadian rival Bombardier Inc before the World Trade Organization  a senior executive told Reuters on Monday.",
        "date": "05162016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer eyes WTO challenge to Bombardier's government funding "
    },
    {
        "content": "SAO PAULO  April 26 Brazil's securities regulator CVM rejected a settlement with the former head of defense for planemaker Embraer SA  citing the severity of corruption allegations related to a $92 million deal with the Dominican Republic.",
        "date": "04262016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil regulator rejects deal with former Embraer defense chief "
    },
    {
        "content": "SAO PAULO  April 29 Brazilian planemaker Embraer SA assured investors that its business jet division should return to profitability this year after sharp discounting dented first-quarter profits  dragging shares to their lowest in nearly two years.",
        "date": "04292016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "UPDATE 2-Embraer shares near two-year low on business jet concerns "
    },
    {
        "content": "BRASILIA  April 14 Brazil's Embraer SA  delivered 21 commercial jets and 23 executive aircraft in the first quarter  37.5 percent more than in the same period of last year  the company said in a statement on Thursday.",
        "date": "04142016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer delivers 21 commercial jets  23 executive jets in Q1 "
    },
    {
        "content": "* Horizon Air places largest aircraft order in its history  adding 30 Embraer E175 regional jets to fleet",
        "date": "04122016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "BRIEF-Alaska Air Group adds 30 Embraer E175 regional jets to fleet "
    },
    {
        "content": "* Says to supply complete training equipment for new Embraer KC-390 transport plane",
        "date": "04112016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "BRIEF-Rheinmetall wins 100 mln euro order from Embraer "
    },
    {
        "content": "SANTIAGO  March 29 The development of a key military cargo plane by Brazilian planemaker Embraer is progressing on schedule  a company executive said  although he suggested that a delay last year had upset some potential customers.",
        "date": "03302016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer's delayed military cargo jet on schedule now - exec "
    },
    {
        "content": "A sales consultant told Brazilian prosecutors he believes planemaker Embraer SA's top officials  including Chief Executive Frederico Curado  knew of illicit payments related to the sale of military aircraft to the Dominican Republic  the Wall Street Journal reported.",
        "date": "03172016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer consultant says believes CEO knew of bribery: WSJ "
    },
    {
        "content": "HYDERABAD  India  March 18 Indian airlines are in talks with ATR  Bombardier and Embraer  to buy smaller planes to fly to the country's booming second and third tier cities ahead of a government drive to get more of the country connected by air.",
        "date": "03182016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "AIRSHOW-Indian airlines look to smaller planes in regional push "
    },
    {
        "content": "SAO PAULO  March 2 Brazilian planemaker Embraer SA is expected to post a stronger fourth-quarter net income on Thursday than a year earlier  according to analysts  due to a more profitable sales mix and currency tailwinds.     Below are the average forecasts of four analysts in a Reuters poll  given in U.S. dollars  as well as a comparison with results reported a year earlier:                Net Revenue  EBITDA*     Net Income  4Q 2015 (e)   $2.103 bln   $314 mln    $162 mln  pct chg",
        "date": "03022016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer expected to post stronger profit on sales mix "
    },
    {
        "content": "SAO PAULO Shares of planemaker Embraer SA  tumbled on Thursday after the company offered more modest profit targets than many analysts expected  deflating hopes that a strong U.S. dollar meant easy profits for Brazil's biggest industrial exporter.",
        "date": "03032016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer shares tumble on modest profit outlook "
    },
    {
        "content": "SAO PAULO Brazil and local planemaker Embraer SA  are closely watching news of state support for Canadian rival Bombardier Inc's  new C-Series program with concern  Embraer Chief Executive Frederico Curado told analysts on Thursday.",
        "date": "03032016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer  Brazil concerned about state support for Bombardier: CEO "
    },
    {
        "content": "SAO PAULO  March 3 Brazil and local planemaker Embraer SA are closely watching news of state support for Canadian rival Bombardier Inc's new C-Series program with concern  Embraer Chief Executive Frederico Curado told analysts on Thursday.",
        "date": "03032016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer  Brazil concerned about state support for Bombardier -CEO "
    },
    {
        "content": "SAO JOSE DOS CAMPOS  Brazil  Feb 25 Brazilian planemaker Embraer SA will extend the range of its biggest commercial aircraft  executives said on Thursday as they rolled out the first of the re-engined E-Jet planes to compete with Bombardier Inc's new C-Series.",
        "date": "02252016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "UPDATE 2-Embraer extends range of biggest commercial jet "
    },
    {
        "content": "* Embraer shares down 11 pct  biggest drop in more than 4 years     * EBIT margin target 8-8.5 pct; BTG Pactual forecast 10 pct     * Q4 profit misses expectations on Republic charge   (Updates with share performance)     By Brad Haynes     SAO PAULO  March 3 Shares of planemaker Embraer SA tumbled on Thursday after the company offered more modest profit targets than many analysts expected  deflating hopes that a strong U.S. dollar meant easy profits for Brazil's biggest industrial e",
        "date": "03032016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 2-Embraer shares tumble on modest profit outlook "
    },
    {
        "content": "SAO PAULO  March 3 Brazilian planemaker expects stronger demand for its airliners and mid-size executive jets to lift 2016 net revenue to between $6 billion and $6.4 billion  up from $5.9 billion last year despite weaker sales from its defense division.",
        "date": "03032016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer sees 2016 sales up on commercial  mid-size executive jets "
    },
    {
        "content": "SAO JOSE DOS CAMPOS  Brazil  Feb 25 Brazilian planemaker Embraer SA is in early talks with Iran  with a focus on commercial aviation  following the end of international sanctions  Chief Executive Frederico Curado told journalists on Thursday.",
        "date": "02252016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer says Iran talks in early stages "
    },
    {
        "content": "SAO PAULO  March 3 Brazilian planemaker Embraer SA booked a 22 percent rise in fourth-quarter net income on Thursday  boosted by a more profitable sales mix and currency effects.",
        "date": "03032016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer books stronger profit despite Republic impact "
    },
    {
        "content": "BRASILIA  Feb 22 Iran is interested in buying 50 airliners from Brazilian planemaker Embraer SA  a presidential aide in Brazil with knowledge of the negotiations said on Monday  as the end of international sanctions against the Middle East country triggers a flurry of trade deals.",
        "date": "02222016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "UPDATE 2-Iran eyes Brazil deal for taxis  50 Embraer jets -source "
    },
    {
        "content": "PARIS  Feb 22 Boeing Co has won an order for 25 current-generation Boeing 737 aircraft from United Continental Holdings Inc  beating rivals including Canada's Bombardier Inc for the second time in a month  two industry sources said on Monday.",
        "date": "02222016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 1-United orders 25 more Boeing 737s worth $2 bln -sources "
    },
    {
        "content": "SAO PAULO  Feb 3 Brazilian planemaker Embraer  will supply five Phenom 100 ultralight executive jets to train pilots in the British armed forces  the company said on Wednesday.",
        "date": "02032016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer supplies Phenom 100 for UK military training "
    },
    {
        "content": "TEHRAN  Jan 24 Iran's Kish Air is talking to Airbus about buying six of its A321 jets and is also studying possible purchases from Brazil's Embraer  the Kish Air chief executive told Reuters on Sunday.",
        "date": "01242016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Iran Kish Air says talks to Airbus  studies Embraer  for planes "
    },
    {
        "content": "SAO PAULO  Jan 14 Commercial jet deliveries from Brazil's Embraer SA beat its outlook for 2015  and the executive aviation unit hit its targets due to a late surge in deliveries of larger private aircraft.",
        "date": "01142016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "UPDATE 1-Embraer tops 2015 E-Jet target; bigger business jets jump "
    },
    {
        "content": "PARIS/NEW YORK  Jan 14 United Airlines  is close to deciding an order for about 30 small jets worth around $2 billion at list prices and Boeing looks well placed to win at least part of the deal after undercutting smaller rivals  industry sources said.",
        "date": "01142016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Boeing sets sights on $2 bln United small jets order  - sources "
    },
    {
        "content": "BRASILIA  Jan 14 Brazil's Embraer SA  delivered 33 commercial jets and 45 executive aircraft in the final three months of 2015  according to a Thursday filing.",
        "date": "01142016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer delivers 33 commercial jets  45 private jets in 4th qtr "
    },
    {
        "content": "SAO PAULO  Jan 13 KLM Cityhopper has confirmed purchase options for two E175 regional jets from Embraer SA   worth a combined $88.8 million at list prices  the Brazilian planemaker said in a Wednesday statement.",
        "date": "01132016",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "KLM Cityhopper confirms two E175 options with Brazil's Embraer "
    },
    {
        "content": "U.S. aviation regulators are to propose on Monday mandatory inspections and  potentially  the replacement of suspect parts on nearly 1 600 jetliners to prevent serious flight failures  the Wall Street Journal reported.",
        "date": "11292015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "U.S. to propose safety fixes for certain Boeing  Embraer jets: WSJ "
    },
    {
        "content": "* To decide between Airbus A320 NEO and Boeing 737 Max -chairman",
        "date": "11292015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 1-India's SpiceJet to choose between Airbus and Boeing for plane order "
    },
    {
        "content": "U.S. aviation regulators are to propose on Monday mandatory inspections and  potentially  the replacement of suspect parts on nearly 1 600 jetliners to prevent serious flight failures  the Wall Street Journal reported.",
        "date": "11302015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "U.S. to propose safety fixes for certain Boeing  Embraer jets: WSJ "
    },
    {
        "content": "LAS VEGAS  Nov 16 Embraer said on Monday it would extend the range of its Legacy 450 business jet  aiming to match demand it sees for smaller jets that can fly farther.",
        "date": "11162015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer extends range of Legacy 450 jet  aiming at sweet spot "
    },
    {
        "content": "DUBAI A top executive at Brazil's Embraer expressed concern on Tuesday about Quebec's decision to pump $1 billion into the struggling airplane project of a Canadian rival  saying planemakers should compete on a level playing field.",
        "date": "11102015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer wary over Quebec funding for rival's jet "
    },
    {
        "content": "DUBAI  Nov 9 Brazilian planemaker Embraer's  head of business jets said on Monday emerging market sales would slow for the next three years and the company would focus more on the United States where it is spending more on marketing and sales.",
        "date": "11092015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "UPDATE 1-AIRSHOW-Embraer business jet sales to slow in emerging markets "
    },
    {
        "content": "DUBAI  Nov 10 A top executive at Brazil's Embraer expressed concern on Tuesday about Quebec's decision to pump $1 billion into the struggling airplane project of a Canadian rival  saying planemakers should compete on a level playing field.",
        "date": "11102015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "CORRECTED-AIRSHOW-Embraer wary over Quebec funding for rival's jet "
    },
    {
        "content": "DUBAI  Nov 9 Brazilian planemaker Embraer's  head of business jets said on Monday emerging market sales would slow for the next three years  with the Middle East flat due to low oil prices.",
        "date": "11092015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "AIRSHOW-Embraer business jet sales to slow for next 3 yrs in emerging mkts "
    },
    {
        "content": "SAO PAULO Brazilian planemaker Embraer SA  is likely to report a solid quarterly profit on Tuesday  according to a survey of analysts  but a tumbling local currency could hurt its bottom line.",
        "date": "10262015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer seen reporting third-quarter profit  but FX weighs "
    },
    {
        "content": "SAO PAULO  Oct 27 Brazil's Embraer SA   the world's No.3 commercial planemaker  has sold out its E-Jet production this year and is likely to do so again next year  Chief Executive Frederico Curado told analysts on a Tuesday conference call after reporting quarterly earnings.",
        "date": "10272015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer CEO confident of keeping up E-Jet production "
    },
    {
        "content": "SAO PAULO  Oct 27 Brazilian planemaker Embraer SA posted a third-quarter net loss of $110 million on Tuesday  as the country's  weaker currency improved long-term profitability but drove up tax obligations.",
        "date": "10272015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 2-Brazil currency drop triggers Embraer loss but bolsters outlook "
    },
    {
        "content": "SAO PAULO  Oct 27 Brazilian planemaker Embraer SA has already begun hedging its 2016 cash flow against the impact of a volatile exchange rate  Chief Financial Officer Jose Antonio Filippo told journalists on a Tuesday earnings call.",
        "date": "10272015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer already hedging 2016 cash flow against FX risk -CFO "
    },
    {
        "content": "SAO PAULO  Oct 27 Brazil's Embraer SA   the world's third-largest commercial planemaker  on Tuesday reported a third-quarter net loss of 388 million reais ($100 million)  as a weaker Brazilian currency drove up its deferred tax bill.",
        "date": "10272015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer posts loss as weaker currency boosts taxes "
    },
    {
        "content": "RIO DE JANEIRO  Oct 21 Brazil's Embraer SA  said on Wednesday that Skywest Inc. will buy an additional 19 of its E175 regional jets to fly for Delta Airlines Inc..",
        "date": "10212015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil Embraer sells another 19 E175 jets to Skywest "
    },
    {
        "content": "Oct 15 Brazil's Embraer SA delivered 21 commercial planes and 30 executive aircraft in the third quarter  according to a Thursday filing.",
        "date": "10152015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "CORRECTED-(OFFICIAL)- Brazil's Embraer delivers 21 commercial  30 executive jets in Q3 "
    },
    {
        "content": "BRASILIA  Oct 15 Brazil's Embraer SA  delivered 21 commercial planes and 30 executive aircraft in the third quarter  according to a Thursday filing.",
        "date": "10152015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer delivers 21 commercial  30 executive jets in Q3 "
    },
    {
        "content": "SAO PAULO Flexjet  which offers fractional ownership and leasing of private jets  is counting on Embraer's  new Legacy 450 and 500 for the bulk of a mid-size business jet program that could grow beyond a quarter of its fleet  Chief Executive Mike Silvestro said on Tuesday.",
        "date": "09292015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Flexjet gets first Embraer Legacy jet anchoring mid-size program "
    },
    {
        "content": "BEIJING  Sept 16 China's heavy import duty is hurting the competitiveness of locally assembled foreign airplanes  Embraer SA's country head said on Wednesday  and that the company was in talks with the government to resolve the matter.",
        "date": "09162015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "UPDATE 1-AIRSHOW-China's hefty duties hurt locally built foreign jets - Embraer "
    },
    {
        "content": "RIO DE JANEIRO  Sept 14 SkyWest Inc  the world's largest regional airline group  booked a firm order for 18 E175 jets made by Brazil's Embraer SA  the world's third-largest commercial planemaker said on Monday in a statement.",
        "date": "09142015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer says to sell 18 jets to SkyWest for $800 mln "
    },
    {
        "content": "SAO PAULO  Aug 10 Deliveries of four-passenger HondaJets will start in 2017 in Brazil  Michimasa Fujino  chief executive of the Honda Aircraft unit of Honda Motor Co  said at an event in Sao Paulo on Monday.",
        "date": "08102015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "HondaJet deliveries to start in Brazil in 2017 - CEO "
    },
    {
        "content": "SAO PAULO Brazilian planemaker Embraer SA said on Friday that the first Legacy 450 jet from a factory in Melbourne  Florida  will roll off the line in December 2016  as the company migrates business jet production there in a bet on the U.S. market.",
        "date": "08072015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer's new business jet rolls off Florida line in 2016 "
    },
    {
        "content": "SAO PAULO  Aug 7 Brazilian planemaker Embraer SA  said on Friday that the first Legacy 450 jet from a factory in Melbourne  Florida  will roll off the line in December 2016  as the company migrates business jet production there in a bet on the U.S. market.",
        "date": "08072015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 2-Embraer's new business jet rolls off Florida line in 2016 "
    },
    {
        "content": "BRASILIA  Aug 5 Brazil's Senate approved on Wednesday a $4.6 billion financing agreement reached last week with Sweden for the purchase of 36 Gripen fighter jets from Swedish planemaker Saab AB for the Brazilian Air Force.",
        "date": "08062015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazilian Senate approves Saab fighter deal with Sweden "
    },
    {
        "content": "SAO PAULO  Aug 7 Brazilian planemaker Embraer SA  said on Friday that the production of its Legacy 450/500 business jet line would migrate to an assembly line in Florida  with the first delivery expected at the end of 2016.",
        "date": "08072015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer to build new business jet in Florida  eyeing U.S. market "
    },
    {
        "content": "SAO PAULO  July 30 Brazilian planemaker Embraer SA said on Thursday it will delay development of a military cargo jet and forgo $300 million of revenue this year due to Brazil's weaker currency and defense spending cuts  triggering the biggest drop in its shares in nearly four years.",
        "date": "07302015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "UPDATE 2-Brazil's Embraer delays cargo jet  loses revenue on defense cuts "
    },
    {
        "content": "SAO PAULO  July 30 Planemaker Embraer SA  does not expect any \"new surprises\" from the Brazilian government next year to disrupt its defense contracts  Chief Executive Frederico Curado said on a Thursday earnings call.",
        "date": "07302015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer sees no \"new surprises\" on Brazil defense contracts "
    },
    {
        "content": "SAO PAULO  July 30 Brazilian planemaker Embraer SA is sticking to a strategy of trying to maintain prices for its executive jets despite a sluggish recovery in the market  Chief Financial Officer Jose Antonio Filippo said on an earnings call on Thursday.   (Reporting by Brad Haynes; Editing by Chizu Nomiyama)",
        "date": "07302015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer working to hold executive jet prices -CFO "
    },
    {
        "content": "BRASILIA  July 15 Brazilian planemaker Embraer SA delivered 27 commercial jets and 33 business jets in the second quarter of 2015  the company said in an e-mailed statement on Wednesday.",
        "date": "07152015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer order book hits record high of $22.9 bln "
    },
    {
        "content": "* Airbus helped by last-minute deal with Wizz Air   (Adds quotes  details  Embraer orders  updates shares)",
        "date": "06182015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "AIRSHOW-Airbus steals show with last-minute $14 bln Wizz deal "
    },
    {
        "content": "MELBOURNE  Fla. Brazilian aircraft maker Embraer SA will build an airplane seat plant in Titusville  Florida  expanding its facilities in a region hit hard by the shutdown of NASA's space shuttle program four years ago  officials said on Monday.",
        "date": "06162015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer to add airplane seat plant in Florida expansion "
    },
    {
        "content": "MELBOURNE  Fla.  June 15 Brazilian aircraft maker Embraer SA will build an airplane seat plant in Titusville  Florida  expanding its facilities in a region hit hard by the shutdown of NASA's space shuttle program four years ago  officials said on Monday.",
        "date": "06162015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "CORRECTED-UPDATE 1-Embraer to add airplane seat plant in Florida expansion "
    },
    {
        "content": "MELBOURNE  Fla.  June 15 Brazilian aircraft manufacturer Embraer SA will build an airplane seat manufacturing plant in Titusville  Florida  expanding its facilities in the region hit hard by the shutdown of NASA's space shuttle program four years ago  officials said on Monday.",
        "date": "06152015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer to add airplane seat plant in Florida expansion "
    },
    {
        "content": "MELBOURNE  Fla.  June 15 Brazilian aircraft maker Embraer SA will build an airplane seat plant in Titusville  Florida  expanding its facilities in a region hit hard by the shutdown of NASA's space shuttle program four years ago  officials said on Monday.",
        "date": "06152015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 1-Embraer to add airplane seat plant in Florida expansion "
    },
    {
        "content": "PARIS Brazil's Embraer SA  on Monday announced 50 firm orders at the Paris air show for regional jets worth a total of $2.6 billion  including deliveries in China starting this year.",
        "date": "06152015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer wins 50 firm orders  including with China  for 2015 delivery "
    },
    {
        "content": "PARIS  June 15 Brazil's Embraer SA on Monday announced 50 firm orders at the Paris air show for regional jets worth a total of $2.6 billion  including deliveries in China starting this year.",
        "date": "06152015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "AIRSHOW-Embraer wins 50 firm orders  including with China  for 2015 delivery "
    },
    {
        "content": "June 15 Brazil's Embraer signed a deal on Monday to send six Super Tucano light attack aircraft to Mali at the Paris air show  according to a securities filing that did not disclose the value of the contract.   (Reporting by Brad Haynes; Editing by Chizu Nomiyama)",
        "date": "06152015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer signs Mali deal for six Super Tucanos "
    },
    {
        "content": "PARIS Brazilian aircraft maker Embraer  announced 50 firm orders for its narrow-body jets at the Paris air show on Monday worth a total of $2.6 billion.",
        "date": "06152015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer wins 50 firm orders worth $2.6 billion "
    },
    {
        "content": "NEW YORK  June 8 (IFR) - Brazilian airline manufacturer Embraer got the ball rolling in the LatAm primary markets on Monday with its largest ever bond -a US$1bn 10-year - despite a somewhat soft backdrop.",
        "date": "06082015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer kicks off primary activity in soft day for LatAm credits "
    },
    {
        "content": "PARIS  June 15 Brazilian aircraft maker Embraer  announced 50 firm orders for its narrow-body jets at the Paris air show on Monday worth a total of $2.6 billion.",
        "date": "06152015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "AIRSHOW-Embraer wins 50 firm orders worth $2.6 bln "
    },
    {
        "content": "NEW YORK  June 8 (IFR) - Brazilian aircraft manufacturer Embraer is out with a new 10-year bond on Monday and is enticing investors with initial price thoughts that seem to carry a hefty new issue premium.",
        "date": "06082015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer offering generous premium on new 10-year bond "
    },
    {
        "content": "SAO PAULO  May 19 Brazil's Embraer SA  booked a firm order for 22 aircraft with a Chinese airline on Tuesday  confirming part of a prior accord during a visit from China's Premier Li Keqiang.",
        "date": "05192015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer confirms Chinese order  Azul gets new lease "
    },
    {
        "content": "SAO PAULO  May 12 Embraer SA  the world's third-largest commercial planemaker  forecasts 2 060 deliveries of 70- to 130-seat jets in the North American market over the next 20 years  according to a market study released by the company on Tuesday.",
        "date": "05122015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer forecast for North American market edges higher "
    },
    {
        "content": "SAO PAULO Brazil's Embraer SA  the world's third-largest commercial planemaker  plans to move production of its Phenom executive jets to its factory in the United States next year  a Brazilian union said on Monday.",
        "date": "05112015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer to move Phenom executive jet production to U.S.: union "
    },
    {
        "content": "SAO PAULO  May 11 Brazil's Embraer SA   the world's third-largest commercial planemaker  plans to move production of its Phenom executive jets to its factory in the United States next year  a Brazilian union said on Monday.",
        "date": "05112015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer to move Phenom executive jet production to U.S. -union "
    },
    {
        "content": "SAO PAULO  April 30 Embraer SA has to consider slowing down development of the KC-390 military cargo jet if the Brazilian Air Force  which is funding the program  does not catch up on late payments  Chief Executive Officer Frederico Curado said on a Thursday conference call.",
        "date": "04302015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer eyeing slowdown of KC-390 program if Brazil cannot pay "
    },
    {
        "content": "SAO PAULO  April 30 Brazil's Embraer SA   the world's third-largest commercial planemaker  posted a quarterly net loss on Thursday as business jet sales weakened  defense programs stalled and a stronger U.S. dollar lifted tax expenses.",
        "date": "04302015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 1-Brazil's Embraer posts quarterly loss on currency swing "
    },
    {
        "content": "BRASILIA  April 30 Brazil's Embraer SA   the world's third-largest commercial planemaker  on Thursday booked a first-quarter net loss of $58.9 million  down from a profit of $112.3 million a year earlier.",
        "date": "04302015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer posts $58.9 mln net loss in Q1 "
    },
    {
        "content": "SAO PAULO  April 16 Brazilian planemaker Embraer SA delivered 20 commercial jets and 12 business jets in the first three months of 2015  the company said in an e-mailed statement on Thursday.",
        "date": "04162015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer delivers 20 commercial  12 business jets in 1st-qtr "
    },
    {
        "content": "RIO DE JANEIRO  April 14 Brazilian planemaker Embraer SA and Swedish partner Saab AB  hope to devise a plan by June for exporting the Gripen fighter jet from the South American country beginning in 2023  a senior Embraer official said on Tuesday.",
        "date": "04142015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer and Saab discuss exporting Brazilian fighters from 2023 "
    },
    {
        "content": "April 15 The Brazilian government freed up about 120 million reais ($39 million) of a debt owed to planemaker Embraer SA  Defense Minister Jacques Wagner said on Wednesday.",
        "date": "04152015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil frees up $39 mln owed to planemaker Embraer "
    },
    {
        "content": " ",
        "date": "03302015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer signs Air France-KLM order for 17 E-Jets "
    },
    {
        "content": "SAO PAULO  March 30 Brazilian planemaker Embraer SA has signed a firm order from Air France-KLM  for 17 of its regional E-Jets in a deal worth $764 million at list prices  it said on Monday.",
        "date": "03302015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "RPT-Brazil's Embraer signs Air France-KLM order for 17 E-Jets "
    },
    {
        "content": "RIO DE JANEIRO  March 11 Brazil's Embraer SA   the world's third largest commercial plane maker  said on Wednesday it booked a firm order from U.S. regional operator Republic Airways Holdings Inc. for five of its next-generation E-175 aircraft.",
        "date": "03112015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer to sell 5 E-175 jets to Republic Airways in $222 mln deal "
    },
    {
        "content": "SAO PAULO  March 5 Embraer SA  the world's No.3 commercial planemaker  is still working to collect unpaid accounts from the Brazilian government that contributed to negative free cash flow in 2014  Chief Financial Officer Jose Antonio Filippo said on Thursday.",
        "date": "03052015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Embraer still trying to collect 2014 payments from government "
    },
    {
        "content": "SAO PAULO  March 4 Brazil's Embraer SA  said on Wednesday it expects operating profit margins to slip this year as the planemaker makes more of its smaller-cabin E175 regional jets  weighing on profitability despite the boost of a stronger U.S. dollar.",
        "date": "03052015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "UPDATE 1-Embraer sees profitability slipping despite stronger dollar "
    },
    {
        "content": "SAO PAULO  March 4 Brazilian planemaker Embraer SA trimmed its forecasts for operating profit this year compared with 2014  according to a securities filing on Wednesday.",
        "date": "03042015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer trims profit targets in 2015 from 2014 "
    },
    {
        "content": "SAO PAULO  March 4 Brazil's Embraer SA   the world's third-largest commercial planemaker  said on Wednesday that fourth-quarter net income fell 60 percent from a year earlier to 242 million Brazilian reais ($81 million)  according to a securities filing.",
        "date": "03042015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer's fourth quarter profit falls sharply from year ago "
    },
    {
        "content": "SAO PAULO  Feb 3 Embraer's new military cargo jet flew for the first time on Tuesday and the planemaker is making progress on collecting late government payments in the next few months  the company's defense chief said in an interview.",
        "date": "02032015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "UPDATE 1-Embraer military cargo jet makes successful first flight "
    },
    {
        "content": "SAO PAULO  Feb 3 Brazilian planemaker Embraer SA  expects to collect delayed payments from the government \"in the first months of this year \" said the company's defense chief Jackson Schneider in a phone interview with Reuters on Tuesday.",
        "date": "02032015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Brazil's Embraer expects to get delayed gov't payments in early 2015 "
    },
    {
        "content": "* Said on Wednesday its McMurdo Group unit has been selected by Embraer to provide complete Emergency Locator Transmitter (ELT) shipsets for its E-Jets second generation of aircraft  the E-Jets E2",
        "date": "01222015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "BRIEF-Orolia unit McMurdo Group selected by Embraer "
    },
    {
        "content": "RIO DE JANEIRO  Jan 14 Brazil's planemaker Embraer said on Wednesday its free cash flow turned negative in 2014 as some clients extended payment due dates.",
        "date": "01142015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "CORRECTED-Brazil's Embraer expects negative cash flow in 2014 "
    },
    {
        "content": "RIO DE JANEIRO  Jan 13 Embraer SA  delivered 30 commercial and 52 executive jets in the fourth quarter  the Brazilian aircraft manufacturer said on Tuesday.",
        "date": "01132015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "topStory",
        "symbol": "ERJ",
        "title": "Brazil's Embraer delivered 82 commercial  executive jets in Q4 "
    },
    {
        "content": "SINGAPORE  Jan 13 Brazilian aircraft maker Embraer SA is supplying its first jets to an Indonesian airline as cost-conscious Southeast Asian carriers seek smaller planes to serve the region's second-tier cities more efficiently than large aircraft.",
        "date": "01132015",
        "name": "Embraer-Empresa Brasileira de Aeronautica",
        "news_type": "normal",
        "symbol": "ERJ",
        "title": "Embraer wins first Indonesia aircraft deal  bets on SE Asia's second-tier cities "
    }
]