[
    {
        "content": "TEL AVIV  Nov 14 Israeli defence electronics firm Elbit Systems  reported higher third-quarter profit on Tuesday and forecast continued revenue and profit growth based on its expanding backlog of orders.",
        "date": "11142017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "UPDATE 1-Israel's Elbit Systems Q3 profit up as defence budgets grow "
    },
    {
        "content": "* Q3 backlog of orders at $7.6 billion​ Source text for Eikon: Further company coverage:",
        "date": "11142017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "BRIEF-Elbit Systems reports Q3 non-gaap earnings of $1.57 per share "
    },
    {
        "content": "TEL AVIV  Nov 14 Israeli defence electronics firm Elbit Systems  reported higher third-quarter net profit on Tuesday and said its backlog of orders has expanded due to growing defence budgets in its target markets.",
        "date": "11142017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems Q3 profit up as defence budgets grow "
    },
    {
        "content": "* Q3 revenue $800.7 million versus $780.8 million Further company coverage: (Reporting by Tova Cohen)",
        "date": "11142017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "BRIEF-Israel's Elbit Systems Q3 results "
    },
    {
        "content": "TEL AVIV Defense electronics firm Elbit Systems  is splitting its cyber security unit as products from its civilian operations and government-grade spyware division diverge  an executive said.",
        "date": "10272017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Israel's Elbit to split civilian cyber from spyware as products diverge "
    },
    {
        "content": "TEL AVIV  Oct 27 Defence electronics firm Elbit Systems is splitting its cyber security unit as products from its civilian operations and government-grade spyware division diverge  an executive said.",
        "date": "10272017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "REUTERS SUMMIT-Israel's Elbit to split civilian cyber from spyware as products diverge "
    },
    {
        "content": "* Elbit systems U.S. Subsidiary awarded $31.5 million contract to provide head-up displays for aviator night vision imaging systems",
        "date": "10032017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "BRIEF-Elbit Systems U.S. Subsidiary awarded $31.5 million contract "
    },
    {
        "content": "* Elbit Systems awarded approximately US$300 million contract for the supply of command and control systems to a customer in Asia-Pacific",
        "date": "09272017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "BRIEF-Elbit Systems awarded about $300 mln contract for supply of command & control systems "
    },
    {
        "content": "TEL AVIV Israel's Elbit Systems Ltd said on Tuesday it won a contract worth $240 million to provide a wide array of defense electronic systems to an unnamed country in Africa.",
        "date": "09262017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Elbit gets $240 million Africa deal to protect aircraft from missiles "
    },
    {
        "content": "TEL AVIV  Sept 27 Israeli defence electronics firm Elbit Systems Ltd said on Wednesday it won a contract worth about $300 million for the supply of command and control systems to a customer in Asia-Pacific.",
        "date": "09272017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems wins $300 mln deal in Asia-Pacific "
    },
    {
        "content": "TEL AVIV  Sept 26 Israel's Elbit Systems Ltd said on Tuesday it won a contract worth $240 million to provide a wide array of defense electronic systems to an unnamed country in Africa.",
        "date": "09262017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Elbit gets $240 mln Africa deal to protect aircraft from missiles "
    },
    {
        "content": "* Elbit Systems Ltd  - Will reorganize business of CYBERBIT solutions ltd.  its wholly-owned subsidiary",
        "date": "09182017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "BRIEF-Elbit Systems to reorganize the business of CYBERBIT "
    },
    {
        "content": "* Lockheed Martin and Elbit Systems to partner on the Maritime Electronic Warfare Programme for The Royal Navy",
        "date": "09132017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "BRIEF-Lockheed Martin and Elbit Systems to partner on the Maritime Electronic Warfare Programme "
    },
    {
        "content": "TEL AVIV Israeli defense electronics provider Elbit Systems  said on Tuesday it won a contract worth about $93 million from an Asia-Pacific country to upgrade its F-5 aircraft fleet.",
        "date": "08292017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems wins $93 million F-5 upgrade contract "
    },
    {
        "content": "TEL AVIV  Aug 29 Israeli defence electronics provider Elbit Systems said on Tuesday it won a contract worth about $93 million from an Asia-Pacific country to upgrade its F-5 aircraft fleet.",
        "date": "08292017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems wins $93 mln F-5 upgrade contract "
    },
    {
        "content": "* Elbit Systems confirmed that a jury found Hughes Network Systems to have infringed an Elbit Systems patent",
        "date": "08172017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "BRIEF-Elbit Systems confirms that jury found Hughes Network to have infringed patent "
    },
    {
        "content": "JERUSALEM  Aug 15 Israeli defence electronics firm Elbit Systems  reported higher second-quarter profit on Tuesday and said demand was growing in the United States  Europe and Asia.",
        "date": "08152017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "UPDATE 1-Israel's Elbit Systems Q2 profit up  sees further sales gains "
    },
    {
        "content": "* Backlog of orders for the quarter ended June 30  2017 totaled $7 329 million  as compared to $6 818 million as of June 30  2016 Source text for Eikon: Further company coverage: (Bengaluru Newsroom)",
        "date": "08152017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "BRIEF-Elbit Systems reports Q2 non-GAAP earnings per share of $1.61 "
    },
    {
        "content": "JERUSALEM  Aug 15 Israeli defence electronics firm Elbit Systems  reported higher second-quarter profit on Tuesday  helped by a rise in sales to the United States  Europe and Africa.",
        "date": "08152017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems Q2 profit up as U.S.  Europe  Africa sales rise "
    },
    {
        "content": "* Q2 revenue $818.3 million versus $804.5 million Further company coverage: (Reporting by Steven Scheer)",
        "date": "08152017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "BRIEF-Israel's Elbit Systems Q2 results "
    },
    {
        "content": "* Israeli defence contractor Elbit Systems said on Wednesday one of its subsidiaries in Europe was awarded a contract from a European country to supply thousands of advanced electro-optic systems for infantry soldiers.",
        "date": "07052017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems gets $35 mln European defence contract "
    },
    {
        "content": "PARIS Israeli defense electronics company Elbit Systems Ltd    is moving quickly to innovate and maintain its edge in a global market in which it faces increasing competition from China  France  Turkey and others.",
        "date": "06232017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Elbit Systems says innovation key to crowded drone market "
    },
    {
        "content": "PARIS  June 23 Israeli defence electronics company Elbit Systems Ltd  is moving quickly to innovate and maintain its edge in a global market in which it faces increasing competition from China  France  Turkey and others.",
        "date": "06232017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "AIRSHOW-Elbit Systems says innovation key to crowded drone market "
    },
    {
        "content": "TEL AVIV Israeli defense electronics company Elbit Systems said on Sunday it won a $390 million contract to supply ground electronic intelligence systems to a European country.",
        "date": "05282017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems gets $390 million electronic intelligence deal "
    },
    {
        "content": "TEL AVIV  May 28 Israeli defence electronics company Elbit Systems said on Sunday it won a $390 million contract to supply ground electronic intelligence systems to a European country.",
        "date": "05282017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems gets $390 mln electronic intelligence deal "
    },
    {
        "content": "* Elbit systems subsidiary in the U.S. awarded an approximately $166 million contract",
        "date": "05172017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "BRIEF-Elbit Systems says U.S. unit awarded about $166 million contract "
    },
    {
        "content": "* Israeli defence electronics firm Elbit Systems said on Wednesday it won a $166 million contract from a prime contractor to provide operator interface and computer processing capabilities for a U.S. Army platform.",
        "date": "05172017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems wins $166 million U.S. Army contract "
    },
    {
        "content": "TEL AVIV  May 16 Israeli defence electronics firm Elbit Systems reported slightly higher quarterly net profit  boosted by a rise in revenue that was partly offset by increased research and marketing spending aimed at boosting future revenue growth.",
        "date": "05162017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "UPDATE 1-Israeli defence firm Elbit Systems Q1 profit  revenue up "
    },
    {
        "content": "TEL AVIV  May 16 Israeli defence electronics firm Elbit Systems reported slightly higher quarterly net profit  boosted by a rise in revenue that was partly offset by increased research  financial and marketing expenses.",
        "date": "05162017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Israeli defence firm Elbit Systems Q1 profit edges up "
    },
    {
        "content": "* Israel's Elbit Systems Q1 revenue $749.2 million versus $721.2 million",
        "date": "05162017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "BRIEF-Israel's Elbit Systems Q1 earnings "
    },
    {
        "content": "* Elbit systems awarded an approximately $40 million contract to provide advanced c4isr modernization program to the Brazilian marine corps",
        "date": "05102017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "BRIEF-Elbit awarded $40 mln contract to provide advanced C4ISR modernization program to the Brazilian Marine Corps "
    },
    {
        "content": "RAANANA  Israel Israeli defense electronics company Elbit Systems forecasts double-digit growth for its Cyberbit business  which is transforming the technology it has long provided for military intelligence to the fast-growing commercial market.    Cyberbit took shape after Elbit's $150 million acquisition of the cyber and intelligence unit of Israel's Nice Systems in 2015  blending Nice's technology designed for law enforcement and intelligence agencies with Elbit's military-focused",
        "date": "04132017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Elbit's Cyberbit hones military technology for commercial market "
    },
    {
        "content": "TEL AVIV Israeli defense electronics firm Elbit Systems  said on Sunday its U.S. subsidiary won a contract worth about $50 million from the U.S. Navy to provide the Helmet Display and Tracker System for the MH-60S fleet of helicopters.",
        "date": "04022017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems U.S. unit wins $50 million Navy contract "
    },
    {
        "content": "* Israeli defence electronics firm Elbit Systems said on Sunday its U.S. subsidiary won a contract worth about $50 million from the U.S. Navy to provide the Helmet Display and Tracker System for the MH-60S fleet of helicopters.",
        "date": "04022017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems U.S. unit wins $50 mln Navy contract "
    },
    {
        "content": "* Israeli defence electronics firm Elbit Systems said on Wednesday it won a deal worth $82 million to supply an unnamed Asia-Pacific country with an airborne system for use in intelligence  surveillance  target acquisition and reconnaissance missions.",
        "date": "03292017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Israel's Elbit wins $82 mln Asia-Pacific airborne system deal "
    },
    {
        "content": "TEL AVIV Israeli defense electronics company Elbit Systems  expects to benefit from increased defense spending globally in response to Donald Trump's elevation to the White House  it said on Wednesday after reporting a rise in fourth-quarter earnings.",
        "date": "03222017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Israeli defense company Elbit optimistic in age of Trump "
    },
    {
        "content": "* Israeli start-ups raised nearly $5 billion in 2016  up 11 pct",
        "date": "03222017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Mobileye deal to fuel investment in late-stage Israeli start-ups "
    },
    {
        "content": "TEL AVIV  March 22 Israeli defence electronics company Elbit Systems expects to benefit from increased defence spending globally in response to Donald Trump's elevation to the White House  it said on Wednesday after reporting a rise in fourth-quarter earnings.",
        "date": "03222017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "UPDATE 1-Israeli defence company Elbit optimistic in age of Trump "
    },
    {
        "content": "* Elbit systems awarded israel ministry of defense contract to supply and maintain radio systems in an amount of approximately $100 million  Source text for Eikon:  Further company coverage:",
        "date": "03222017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "BRIEF-Elbit Systems awarded Israel Ministry of Defense contract "
    },
    {
        "content": "* Elbit Systems reports fourth quarter and full year 2016 results",
        "date": "03222017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "BRIEF-Elbit Systems Q4 non-GAAP shr $1.82 "
    },
    {
        "content": "TEL AVIV  March 22 Israeli defence electronics firm Elbit Systems Ltd said on Wednesday it won a $100 million contract from Israel's Ministry of Defence for the supply of advanced radio systems.",
        "date": "03222017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Elbit Systems wins $100 mln deal from Israel's Defence Ministry "
    },
    {
        "content": "TEL AVIV  March 22 Israeli defence electronics firm Elbit Systems reported higher quarterly net profit  boosted by a rise in revenue  and the company said it sees increasing demand for its products.",
        "date": "03222017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems Q4 profit  revenue gain "
    },
    {
        "content": "* Israel's Elbit Systems Q4 revenue $953.7 million versus $886.6 million",
        "date": "03222017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "BRIEF-Israel's Elbit Systems Q4 results "
    },
    {
        "content": "TEL AVIV  Feb 21 Investors are betting heavily that Israeli defence and cyber-security firms will reap a windfall from President Donald Trump's big U.S. spending plans  although likely benefits for the wider economy remain like the man himself - hard to predict.",
        "date": "02212017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Investors bet on Israel tech stock windfall under Trump "
    },
    {
        "content": "TEL AVIV Israeli defense electronics firm Elbit Systems said on Thursday its American subsidiary  Elbit Systems of America  won a deal worth as much as $102 million from the United States Army to provide and maintain mortar fire control systems. ",
        "date": "02162017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Elbit Systems wins $102 million U.S. Army mortar fire systems deal "
    },
    {
        "content": "TEL AVIV  Feb 16 Israeli defence electronics firm Elbit Systems said on Thursday its American subsidiary  Elbit Systems of America  won a deal worth as much as $102 million from the United States Army to provide and maintain mortar fire control systems.",
        "date": "02162017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Elbit Systems wins $102 mln U.S. Army mortar fire systems deal "
    },
    {
        "content": "JERUSALEM Israeli defense electronics firm Elbit Systems Ltd  said on Sunday its Brazilian subsidiary Ares won a contract worth about $100 million to supply remote controlled weapon",
        "date": "01082017",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Elbit System wins Brazilian army contract worth $100 million "
    },
    {
        "content": "JERUSALEM  Jan 8 Israeli defence electronics firm Elbit Systems Ltd said on Sunday its Brazilian subsidiary Ares won a contract worth about $100 million to supply remote controlled weapon stations to the Brazilian army.",
        "date": "01082017",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Elbit System wins Brazilian army contract worth $100 mln "
    },
    {
        "content": "TEL AVIV Israeli defense electronics firm Elbit Systems Ltd said on Wednesday its U.S. subsidiary  Elbit Systems of America  won a contract worth as much as $103 million for the production of mortar weapon systems.",
        "date": "11232016",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Elbit Systems wins U.S. army contract worth up to $103 million "
    },
    {
        "content": "TEL AVIV  Nov 23 Israeli defence electronics firm Elbit Systems Ltd said on Wednesday its U.S. subsidiary  Elbit Systems of America  won a contract worth as much as $103 million for the production of mortar weapon systems.",
        "date": "11232016",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Elbit Systems wins U.S. army contract worth up to $103 mln "
    },
    {
        "content": "TEL AVIV  Nov 17 Israeli defence electronics firm Elbit Systems reported higher quarterly net profit  boosted by increased revenue and a gain from a commercial spin-off business.",
        "date": "11172016",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems Q3 profit  revenue gain "
    },
    {
        "content": "* Q3 EPS $1.48 versus $1.16   Further company coverage:    (Reporting by Steven Scheer)",
        "date": "11172016",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "BRIEF-Elbit Systems Q3 results "
    },
    {
        "content": "JERUSALEM  Nov 16 Israel defence firm Elbit Systems said on Wednesday it won a deal from South Korean software services company Samsung SDS to protect its customers against cyber threats and attacks on industrial control systems.",
        "date": "11162016",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Elbit gets Samsung SDS deal for critical infrastructure security "
    },
    {
        "content": "TEL AVIV  Aug 16 Israeli defence electronics firm Elbit Systems reported higher quarterly net profit and revenue  especially in Europe and Israel  as well as a growing order backlog.",
        "date": "08162016",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems reports higher Q2 profit  revenue "
    },
    {
        "content": "* Q2 non-GAAP EPS $1.47 versus $1.25   Further company coverage: [ESLT.TA ESLT.O]   (Reporting by Tova Cohen)",
        "date": "08162016",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "BRIEF-Israel's Elbit Systems Q2 results "
    },
    {
        "content": "* Elbit systems to establish a new company in field of energy for civilian transportation",
        "date": "07072016",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "BRIEF-Elbit Systems to establish a new company in field of energy for civilian transportation "
    },
    {
        "content": "TEL AVIV  July 7 Israeli defence electronics firm Elbit Systems Ltd said on Thursday it is establishing a new company based on its own energy technology for transportation.",
        "date": "07072016",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Israel's Elbit sets up energy firm for civilian transportation "
    },
    {
        "content": "NETANYA  Israel  June 8 Elbit Systems  Israel's biggest publicly listed defence firm  is targeting the increasingly significant homeland security market with several new systems  it said on Wednesday.",
        "date": "06082016",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Israeli defence firm Elbit eyes growing homeland security market "
    },
    {
        "content": "* Contract for  total amount of approximately $40 million;  contracts will be performed over a one-year period",
        "date": "05242016",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "BRIEF-Elbit Systems awarded contracts to supply radio systems to a European country "
    },
    {
        "content": "TEL AVIV  May 24 Israeli defence firm Elbit Systems said on Tuesday it won contracts worth $40 million from a European country for the supply of advanced tactical communications systems.",
        "date": "05242016",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems wins $40 mln European contracts "
    },
    {
        "content": "TEL AVIV  May 17 Israeli defence electronics firm Elbit Systems reported higher quarterly net profit  boosted by a rise in sales  a growing order backlog and lower financial expenses.",
        "date": "05172016",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "UPDATE 1-Asia Pacific  Europe sales boost Elbit Systems Q1 profit "
    },
    {
        "content": "TEL AVIV  May 17 Israeli defence electronics firm Elbit Systems reported higher quarterly net profit  boosted by a rise in sales  a growing order backlog and lower financial expenses.",
        "date": "05172016",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems Q1 profit  revenue rise "
    },
    {
        "content": "* Israel's Elbit Systems Q1 revenue $721.2 million versus $706.6 million",
        "date": "05172016",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "BRIEF-Israel's Elbit Systems Q1 results "
    },
    {
        "content": "JERUSALEM  April 4 Defence electronics firm Elbit Systems  said on Monday its Cyberbit unit won a contract to supply intelligence and cyber analysis and research systems to an unnamed Asia-Pacific country for $22 million.",
        "date": "04042016",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Elbit Systems gets $22 mln Asia-Pacific cyber analysis deal "
    },
    {
        "content": "TEL AVIV Defense electronics firm Elbit Systems Ltd said on Monday it won a contract worth about $70 million from the Israeli Ministry of Defense for the supply of electronic warfare systems.",
        "date": "12282015",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Elbit Systems gets $70 million deal for electronic warfare systems "
    },
    {
        "content": "TEL AVIV  Dec 28 Defence electronics firm Elbit Systems Ltd  said on Monday it won a contract worth about $70 million from the Israeli Ministry of Defence for the supply of electronic warfare systems.",
        "date": "12282015",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Elbit Systems gets $70 mln deal for electronic warfare systems "
    },
    {
        "content": "JERUSALEM  Dec 22 Israeli defence electronics firm Elbit Systems  said on Tuesday it won a $50 million contract to supply an airborne system to an unnamed Asia-Pacific country.",
        "date": "12222015",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Israel's Elbit wins $50 mln Asia-Pacific airborne system deal "
    },
    {
        "content": "JERUSALEM  Nov 26 Israeli defence electronics firm Elbit Systems said on Thursday it received a $200 million contract to supply Switzerland with unmanned aircraft systems.",
        "date": "11262015",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems wins $200 mln Swiss drone deal "
    },
    {
        "content": "TEL AVIV  Nov 11 Israeli defence electronics firm Elbit Systems reported higher quarterly profit  boosted by higher sales  a growing order backlog and favourable exchange rates.",
        "date": "11112015",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems Q3 profit  revenue rise "
    },
    {
        "content": "JERUSALEM Israeli defense electronics firm Elbit Systems  reported slightly higher quarterly profit  boosted by higher sales and a growing order backlog.",
        "date": "08112015",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems second-quarter profit  revenue rise "
    },
    {
        "content": "JERUSALEM  Aug 11 Israeli defence electronics firm Elbit Systems reported slightly higher quarterly profit  boosted by higher sales and a growing order backlog.",
        "date": "08112015",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems Q2 profit  revenue rise "
    },
    {
        "content": "* Declares Q2 dividend of $0.37 per share  Further company coverage:    (Reporting by Steven Scheer)",
        "date": "08112015",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "BRIEF-Elbit Systems Q2 results "
    },
    {
        "content": "HAIFA  Israel  July 15 Israeli defence electronics firm Elbit Systems says it has developed a body sensor that could help save the lives of pilots by forewarning of possible loss of consciousness in extreme manoeuvres or because of oxygen starvation.",
        "date": "07152015",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Israeli firm develops health-warning sensor for pilots "
    },
    {
        "content": "JERUSALEM  July 6 Israeli defense electronics firm Elbit Systems said on Monday it signed a contract to supply its latest wearable head-up display to regional planemaker ATR to assist pilots of the new ATR-600 series.",
        "date": "07062015",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Elbit to supply Skylens display to planemaker ATR "
    },
    {
        "content": "TEL AVIV  July 2 Israeli defence electronics firm Elbit Systems Ltd said on Thursday a subsidiary won a contract worth $150 million from the Dutch Ministry of Defence to supply advanced systems for infantry soldiers in the Benelux countries.",
        "date": "07022015",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems wins $150 mln Benelux contract "
    },
    {
        "content": "* Elbit shares up 1 pct  Nice down 0.8 pct   (Adds analyst's comments  share reaction)",
        "date": "05212015",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "UPDATE 1-Elbit Systems buys Nice's cyber unit for up to $158 mln "
    },
    {
        "content": "TEL AVIV  May 18 Israeli defence electronics firm Elbit Systems expects its cyber security and intelligence systems to boost business in the coming years and reported higher quarterly profit and revenue on Monday.",
        "date": "05182015",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "UPDATE 1-Israel's Elbit Systems Q1 revenue  profit rise "
    },
    {
        "content": "TEL AVIV  May 21 Israeli defence electronics firm Elbit Systems has  agreed to buy Nice Systems'  cyber and intelligence division for $157.9 million as it seeks to boost its presence in this fast-growing market.",
        "date": "05212015",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Elbit Systems buys Nice's cyber unit for up to $158 mln "
    },
    {
        "content": "TEL AVIV  May 18 Israeli defence electronics firm Elbit Systems reported on Monday slightly higher quarterly profit as the boost in its backlog over the past two years translated into revenue growth.",
        "date": "05182015",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems Q1 revenue  profit rise "
    },
    {
        "content": "* Elbit seeks to adapt military tech to civilian applications",
        "date": "05072015",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Israeli defence firm Elbit shifts gears with electric buses "
    },
    {
        "content": "TEL AVIV Israeli defense electronics firm Elbit Systems Ltd said on Sunday the U.S. Marine Corps (USMC) awarded its subsidiary Elbit Systems of America a $73.4 million contract for laser range finder systems.",
        "date": "03222015",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems wins $73 million contract from U.S. Marines "
    },
    {
        "content": "TEL AVIV  March 22 Israeli defence electronics firm Elbit Systems Ltd said on Sunday the U.S. Marine Corps (USMC) awarded its subsidiary Elbit Systems of America a $73.4 million contract for laser range finder systems.",
        "date": "03222015",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Israel's Elbit Systems wins $73 mln contract from U.S. Marines "
    },
    {
        "content": "* Declared dividend of 35 cents per share for the quarter   (Adds CEO comments  stock reaction  details)",
        "date": "03112015",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "UPDATE 1-Elbit Systems sees big growth in cyber  commercial products "
    },
    {
        "content": "TEL AVIV  March 11 Israeli defence electronics firm Elbit Systems reported higher quarterly profit and revenue  boosted by strong growth in Latin America and Asia-Pacific  the company said on Wednesday.",
        "date": "03112015",
        "name": "Elbit Systems Ltd",
        "news_type": "normal",
        "symbol": "ESLT",
        "title": "Elbit Systems Q4 revenue boosted by Latin America  Asia-Pacific "
    },
    {
        "content": "TEL AVIV  Jan 15 Elbit Systems Ltd  said on Thursday it won contracts worth $117 million from Israel's Ministry of Defence for the supply of command  control  computer  communications and intelligence (C4I) systems.",
        "date": "01152015",
        "name": "Elbit Systems Ltd",
        "news_type": "topStory",
        "symbol": "ESLT",
        "title": "Elbit Systems wins $117 mln in Israel defence contracts "
    }
]