[
    {
        "content": "* Expects negative $0.03 impact on net income and operating EPS in Q3 2017 from recent natural disasters​",
        "date": "10102017",
        "name": "Eaton Corporation PLC",
        "news_type": "topStory",
        "symbol": "ETN",
        "title": "BRIEF-Eaton Corporation sees negative impact in Q3 from hurricanes "
    },
    {
        "content": "Sept 20 Eaton corp wins dismissal of shareholder lawsuit accusing company of securities fraud -- u.s. Judge INVESTORS CLAIMED THAT EATON MISLED THEM ABOUT A PLANNED STRATEGIC SHIFT AWAY FROM ITS TRADITIONAL VEHICLE AND AUTOMOTIVE BUSINESS KOELTL SAYS INVESTORS FAILED TO SHOW EATON HAD A DUTY TO DISCLOSE HYPOTHETICAL TAX CONSEQUENCES OF A SPINOFF OF ITS AUTOMOTIVE BUSINESS  WHICH NEVER TOOK PLACE U.S. DISTRICT JUDGE JOHN KOELTL IN MANHATTAN DISMISSES CLAIMS BROUGHT ON BEHALF OF INVEST",
        "date": "09202017",
        "name": "Eaton Corporation PLC",
        "news_type": "topStory",
        "symbol": "ETN",
        "title": "BRIEF-Eaton wins dismissal of shareholder lawsuit alleging securities fraud--US judge "
    },
    {
        "content": "* Eaton Corporation Plc - ‍announced a contract for Turnkey engineering of a scalable research environment at Tyndall air force base in Florida​ Source text for Eikon: Further company coverage:",
        "date": "09192017",
        "name": "Eaton Corporation PLC",
        "news_type": "topStory",
        "symbol": "ETN",
        "title": "BRIEF-Eaton Corporation enters into a contract for Turnkey engineering "
    },
    {
        "content": "* Eaton Corp - Co's unit issued $700 million amount of 3.103% senior notes due 2027 and $300 million of 3.915% notes due 2047 - SEC filing",
        "date": "09152017",
        "name": "Eaton Corporation PLC",
        "news_type": "topStory",
        "symbol": "ETN",
        "title": "BRIEF-Eaton Corp updates on notes offering "
    },
    {
        "content": "* Eaton and cummins Inc announce joint venture for automated transmissions for heavy- and medium-duty commercial vehicles",
        "date": "04102017",
        "name": "Eaton Corporation PLC",
        "news_type": "topStory",
        "symbol": "ETN",
        "title": "BRIEF-Eaton  Cummins announce joint venture "
    },
    {
        "content": "* Sets quarterly dividend of $0.60per share  Source text for Eikon:  Further company coverage:",
        "date": "02222017",
        "name": "Eaton Corporation PLC",
        "news_type": "topStory",
        "symbol": "ETN",
        "title": "BRIEF-Eaton increases dividend by five percent "
    },
    {
        "content": "* Eaton reports third quarter net income and operating earnings per share of $1.15",
        "date": "11012016",
        "name": "Eaton Corporation PLC",
        "news_type": "topStory",
        "symbol": "ETN",
        "title": "BRIEF-Eaton Corp reports Q3 operating earnings per share $1.15 "
    },
    {
        "content": "* Eaton reports second quarter net income and operating earnings per share of $1.07  above midpoint of guidance",
        "date": "08022016",
        "name": "Eaton Corporation PLC",
        "news_type": "topStory",
        "symbol": "ETN",
        "title": "BRIEF-Eaton Q2 operating earnings per share $1.07 "
    },
    {
        "content": "* Says board expanded its size to fourteen members and elected Dorothy C. Thompson to fill the vacancy - sec filing  Source - http://bit.ly/2aBOeuy Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "07292016",
        "name": "Eaton Corporation PLC",
        "news_type": "topStory",
        "symbol": "ETN",
        "title": "BRIEF-Eaton Corporation says board expanded its size to fourteen members "
    },
    {
        "content": "World champions Shawn Barber and Derek Drouin and heptathlon favorite Brianne Theisen-Eaton headline a 65-member Canadian athletics team for the Rio Olympics announced on Monday.",
        "date": "07112016",
        "name": "Eaton Corporation PLC",
        "news_type": "topStory",
        "symbol": "ETN",
        "title": "World champions Barber and Drouin lead Canadian team "
    },
    {
        "content": "July 11 World champions Shawn Barber and Derek Drouin and heptathlon favourite Brianne Theisen-Eaton headline a 65-member Canadian athletics team for the Rio Olympics announced on Monday.",
        "date": "07112016",
        "name": "Eaton Corporation PLC",
        "news_type": "normal",
        "symbol": "ETN",
        "title": "Athletics-World champions Barber and Drouin lead Canadian team "
    },
    {
        "content": "* Catalyst Pharmaceuticals announces agreement with FDA on confirmatory phase 3 study protocol for Firdapse in Lambert-Eaton Myasthenic Syndrome",
        "date": "06132016",
        "name": "Eaton Corporation PLC",
        "news_type": "topStory",
        "symbol": "ETN",
        "title": "BRIEF-Catalyst Pharma finalizes late-stage trial design with FDA for Firdapse "
    },
    {
        "content": "* Q1 earnings per share view $0.85 -- Thomson Reuters I/B/E/S",
        "date": "04292016",
        "name": "Eaton Corporation PLC",
        "news_type": "topStory",
        "symbol": "ETN",
        "title": "BRIEF-Eaton Corporation Plc says Q1 operating EPS $0.88 "
    },
    {
        "content": "* New Hungary service centre to create over 150 jobs by end-2016  could rise to 250 later  Further company coverage:    (Reporting by Gergely Szakacs)",
        "date": "08132015",
        "name": "Eaton Corporation PLC",
        "news_type": "topStory",
        "symbol": "ETN",
        "title": "BRIEF-Eaton to open new EMEA service centre in Hungary "
    },
    {
        "content": "June 16 Diversified manufacturer Eaton Corp  on Tuesday named the head of its industrial sector businesses to replace longtime Chief Executive Officer Sandy Cutler who is retiring.",
        "date": "06162015",
        "name": "Eaton Corporation PLC",
        "news_type": "normal",
        "symbol": "ETN",
        "title": "Eaton taps industrial head to replace longtime CEO Cutler "
    },
    {
        "content": "April 29 Eaton Corp Plc  a maker of electrical and hydraulic systems  reported a 5 percent drop in quarterly revenue  hurt by a decline in sales in its electrical business.",
        "date": "04292015",
        "name": "Eaton Corporation PLC",
        "news_type": "topStory",
        "symbol": "ETN",
        "title": "Eaton revenue falls 5 pct  cuts 2015 forecast "
    },
    {
        "content": "Shares of diversified industrial company Eaton Corp Plc trade at a discount to the S&P 500 index and could rise 20 percent in the next year  according to Barron's.",
        "date": "03152015",
        "name": "Eaton Corporation PLC",
        "news_type": "topStory",
        "symbol": "ETN",
        "title": "Eaton shares could rise 20 pct in next year: Barron's "
    },
    {
        "content": "U.S. diversified manufacturer Eaton Corp Plc  posted higher-than-expected quarterly profit on Tuesday helped by  higher margins  sending its shares up more than 8 percent.",
        "date": "02032015",
        "name": "Eaton Corporation PLC",
        "news_type": "topStory",
        "symbol": "ETN",
        "title": "Eaton shares jump as higher margins help profit top views "
    },
    {
        "content": "Feb 3 U.S. diversified manufacturer Eaton Corp Plc posted higher-than-expected quarterly profit on Tuesday helped by  higher margins  sending its shares up more than 8 percent.",
        "date": "02032015",
        "name": "Eaton Corporation PLC",
        "news_type": "normal",
        "symbol": "ETN",
        "title": "UPDATE 3-Eaton shares jump as higher margins help profit top views "
    },
    {
        "content": "Feb 3 Eaton Corp Plc  a maker of electrical and hydraulics systems  reported a 21 percent rise in quarterly profit  helped by lower costs.",
        "date": "02032015",
        "name": "Eaton Corporation PLC",
        "news_type": "normal",
        "symbol": "ETN",
        "title": "Eaton profit rises 21 pct on lower costs "
    }
]