[
    {
        "content": "* Energy Transfer Partners  L.P. announces pricing of series A and series B preferred unit offering",
        "date": "11142017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners announces pricing of series A and series B preferred unit offering "
    },
    {
        "content": "* Energy Transfer Partners LP files for potential mixed shelf offering; size undisclosed - SEC filing‍​ Source text for Eikon: (http://bit.ly/2zt67nX) Further company coverage:",
        "date": "11082017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners files for potential mixed shelf offering "
    },
    {
        "content": "* Energy Transfer Partners Lp qtrly net income per common unit $0.33‍​",
        "date": "11072017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners reports third quarter results "
    },
    {
        "content": "* Energy transfer announces FERC approval to place Rover Pipeline’S mainline compressor station 1 into partial service",
        "date": "10092017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer announces FERC approval for Rover Pipeline's Ohio compressors "
    },
    {
        "content": "* Energy Transfer Partners announces pricing of $2.25 billion of senior notes",
        "date": "09202017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners announces pricing of $2.25 bln of senior notes "
    },
    {
        "content": "Sept 19 Oil and gas pipeline company Energy Transfer Partners LP said on Tuesday it received approval from U.S. energy regulators to resume drilling along its $4.2 billion Rover pipeline project.",
        "date": "09192017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "ETP says U.S. approves drilling along Rover gas pipeline "
    },
    {
        "content": "* Energy Transfer receives FERC approval to resume horizontal directional drilling operations on the Rover Pipeline Project",
        "date": "09192017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer receives FERC approval to resume drilling operations on the Rover Pipeline Project "
    },
    {
        "content": "* Energy Transfer announces operational update related to Hurricane Harvey",
        "date": "09012017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer announces operational update related to Hurricane Harvey "
    },
    {
        "content": "* Energy Transfer announces FERC approval to put phase 1A of the Rover pipeline in service",
        "date": "08312017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer announces FERC approval to put phase 1A of the Rover pipeline in service "
    },
    {
        "content": "Energy Transfer Partners LP on Tuesday sued Greenpeace and other environmental groups  accusing them of launching an \"eco-terrorism\" campaign aimed at blocking the Dakota Access Pipeline  the center of months of opposition by Native American and green groups.",
        "date": "08222017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "Energy Transfer sues Greenpeace over Dakota pipeline "
    },
    {
        "content": "Aug 22 Energy Transfer Partners LP on Tuesday sued Greenpeace and other environmental groups  accusing them of launching an \"eco-terrorism\" campaign aimed at blocking the Dakota Access Pipeline  the center of months of opposition by Native American and green groups. The pipeline operator said Greenpeace  Earth First and other organizations engaged in \"acts of terrorism\" to solicit donations and interfere with its pipeline construction activities  damaging its \"critical business and f",
        "date": "08222017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "UPDATE 2-Energy Transfer sues Greenpeace over Dakota pipeline "
    },
    {
        "content": "* Says ‍has commenced a public offering of 54 million common units representing limited partner interests​",
        "date": "08142017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners LP announces common unit offering "
    },
    {
        "content": "* Energy transfer partners announces pricing of common unit offering",
        "date": "08152017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy transfer prices 54.0 mln common shares priced at $18.65/share "
    },
    {
        "content": "* Energy Transfer Partners LP - qtrly ‍net loss per common unit diluted $0.04​",
        "date": "08082017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners Q2 ‍revenue $6.58 billion "
    },
    {
        "content": "Aug 4 Energy Transfer Partners LP said on Friday sabotage or an accident might have caused diesel to get into drilling fluid that spilled into an Ohio wetland during construction of its Rover natural gas pipeline  but opponents of the project disagreed with the sabotage theory.",
        "date": "08042017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "ETP says diesel at Ohio Rover natgas pipe spill may have been sabotage "
    },
    {
        "content": "Energy Transfer Partners L.P.  said on Monday it would sell a 32.44 percent stake in a firm associated with the Rover pipeline project to Blackstone funds for about $1.57 billion.",
        "date": "07312017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "Energy Transfer to sell stake in Rover pipeline entity to Blackstone "
    },
    {
        "content": "July 31 Energy Transfer Partners L.P. said on Monday it would sell a 32.44 percent stake in a firm associated with the Rover pipeline project to Blackstone funds for about $1.57 billion.",
        "date": "07312017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "UPDATE 1-Energy Transfer to sell stake in Rover pipeline entity to Blackstone "
    },
    {
        "content": "* Energy Transfer announces sale of 32.44% stake in entity of Rover Pipeline Project to Blackstone Energy Partners for approximately $1.57 billion",
        "date": "07312017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "BRIEF-ETP to sell stake in Rover pipeline project entity for about $1.57 bln "
    },
    {
        "content": "* Energy Transfer Partners Lp - ‍announced a $0.015 increase in its quarterly cash distribution to $0.55 per etp common unit​ Source text for Eikon: Further company coverage:",
        "date": "07272017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners reports quarterly cash distribution of $0.55 per common unit​ "
    },
    {
        "content": "Energy Transfer Partners LP said on Wednesday it was analyzing the possible impact to the construction schedule of its Sunoco Pipeline unit's Mariner East 2 natural gas liquids pipeline after Pennsylvania environmental regulators halted horizontal directional drilling in the state.",
        "date": "07262017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "ETP reviews startup of Pennsylvania Mariner East NGL pipe after drilling halt "
    },
    {
        "content": "An administrative law judge temporarily halted work on Energy Transfer Partners LP's Sunoco Mariner East 2 natural gas liquids pipeline in a southeast Pennsylvania town due to a dispute over the location of a valve and other equipment.",
        "date": "07252017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "Judge halts work on ETP Mariner East NGL pipe in Pennsylvania town "
    },
    {
        "content": "Energy Transfer Partners LP's Rover pipeline  the biggest natural gas pipeline under construction in the United States  received more bad news after West Virginia told the company to stop some work  citing environmental violations  regulators said on Monday.",
        "date": "07242017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "ETP's $4 bln Rover line hits another snag  this time in W. Virginia "
    },
    {
        "content": "Energy Transfer Partners LP said on Wednesday it is analyzing the impact  if any  to the construction schedule of its Sunoco Pipeline unit's Mariner East 2 natural gas liquids pipeline after Pennsylvania environmental regulators halted all horizontal directional drilling in the state.",
        "date": "07262017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "ETP reviews startup of Penn. Mariner East NGL pipe after drilling halt "
    },
    {
        "content": "Energy Transfer Partners LP's  Rover pipeline  the biggest natural gas pipeline under construction in the United States  received more bad news after West Virginia told the company to stop some work  citing environmental violations  regulators said on Monday.",
        "date": "07242017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "ETP's $4 billion Rover line hits another snag  this time in West Virginia "
    },
    {
        "content": "July 24 Energy Transfer Partners LP's Rover pipeline  the biggest natural gas pipeline under construction in the United States  received more bad news after West Virginia told the company to stop some work  citing environmental violations  regulators said on Monday.",
        "date": "07242017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "UPDATE 3-ETP's $4 bln Rover line hits another snag  this time in W. Virginia "
    },
    {
        "content": "West Virginia environmental regulators ordered Energy Transfer Partners LP to stop work on the Rover natural gas pipeline in the state due to alleged water and waste management violations of its permit.",
        "date": "07242017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "W. Virginia orders Energy Transfer to stop work on Rover pipeline "
    },
    {
        "content": "Energy Transfer Partners LP  said on Tuesday it has delayed the start of its Rover natural gas pipeline running from Pennsylvania to Ontario until later this summer.",
        "date": "07182017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "ETP delays start of U.S.-Canada Rover natgas pipe until late summer "
    },
    {
        "content": "July 12 U.S. energy regulators on Wednesday gave Energy Transfer Partners LP a list of tasks to complete before the Rover natural gas pipeline can enter service.",
        "date": "07122017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "U.S. wants more from ETP before Rover natgas pipe can start up "
    },
    {
        "content": "Ohio regulators have asked the state's attorney general to pursue civil penalties against Energy Transfer Partners LP  for environmental violations during construction of the Rover natural gas pipeline.",
        "date": "07102017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Ohio attorney general urged to penalize ETP for Rover violations "
    },
    {
        "content": "* Unit Lake Charles LNG Export has entered into a memorandum of understanding with south korea-based korea gas corporation​",
        "date": "06292017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-‍Energy Transfer and Unit Lake Charles LNG Export enters into a MOU "
    },
    {
        "content": "* Penntex Midstream Partners - as of June 19  about 12.4 million common units representing limited partner interests in partnership were validly tendered",
        "date": "06202017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-PennTex Midstream announces expiration of Energy Transfer tender offer "
    },
    {
        "content": "Shares of Energy Transfer Partners Inc  owner of the Dakota Access Pipeline  fell on Thursday  one day after a U.S. judge ordered additional environmental review that could potentially lead to a stoppage of the line.",
        "date": "06152017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "Energy Transfer shares drop after judge ruling "
    },
    {
        "content": "* Energy Transfer Partners LP- Mike Hennigan  president  crude  liquids and refined products to depart partnership effective June 16",
        "date": "05302017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer announces senior management updates "
    },
    {
        "content": "* Energy Transfer Partners L.P. announces tender offer to purchase common units of Penntex Midstream Partners LP for $20.00 per unit in cash",
        "date": "05182017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners L.P. announces tender offer to purchase common units of Penntex Midstream Partners LP "
    },
    {
        "content": "* Energy Transfer announces binding open season for project permian express 3",
        "date": "05162017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer announces binding open season for project permian express 3 "
    },
    {
        "content": "* Energy transfer partners lp -  on may 10  2017  energy transfer partners  l.p. Entered into an equity distribution agreement",
        "date": "05102017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners says entered into an equity distribution agreement "
    },
    {
        "content": "Completion of the Rover pipeline  the biggest natural gas pipe under construction in the United States  is not expected to be delayed by a U.S. federal order to stop new drilling to install pipe  Energy Transfer Partners LP said on Thursday.",
        "date": "05112017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "ETP says U.S. drilling ban unlikely to delay Ohio gas pipeline "
    },
    {
        "content": "May 11 Completion of the Rover pipeline  the biggest natural gas pipe  under construction in the United States  is not expected to be delayed by a U.S. federal order to stop new drilling to install pipe  Energy Transfer Partners LP said on Thursday.",
        "date": "05112017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "UPDATE 1-ETP says U.S. drilling ban unlikely to delay Ohio gas pipeline "
    },
    {
        "content": "* Energy Transfer Partners Lp - qtrly net income per unit $0.02 Source text for Eikon: Further company coverage:",
        "date": "05032017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners reports Q1 results "
    },
    {
        "content": "* Energy Transfer Partners L.P. unitholders approve merger with Sunoco Logistics Partners L.P.",
        "date": "04262017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners unitholders approve merger with Sunoco Logistics "
    },
    {
        "content": "* Sunoco Logistics Partners and Energy Transfer Partners announce successful completion of merger",
        "date": "04282017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Sunoco Logistics Partners and Energy Transfer Partners announce completion of merger "
    },
    {
        "content": "* Institutional shareholder services recommends energy transfer partners  L.P. Unitholders vote for merger with sunoco logistics partners L.P. Source text for Eikon: Further company coverage:",
        "date": "04142017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Institutional shareholder services recommends energy transfer partners unitholders vote for merger with sunoco logistics partners "
    },
    {
        "content": "* Glass Lewis and Egan-Jones recommend Energy Transfer Partners  L.P. unitholders vote for the proposed merger with Sunoco Logistics Partners L.P. Source text for Eikon: Further company coverage:",
        "date": "04132017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Glass Lewis and Egan-Jones recommend Energy Transfer unitholders to vote for proposed merger with Sunoco Logistics "
    },
    {
        "content": "* Press release - energy transfer announces binding supplemental open season for bakken pipeline transport",
        "date": "03312017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer provides details on open season for Bakken pipeline "
    },
    {
        "content": "OSLO  March 27 Standing Rock Sioux tribe representatives will meet the ethics watchdog for Norway's $915 billion sovereign wealth fund on Monday over a U.S. oil pipeline  a watchdog official said on Monday.",
        "date": "03272017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Native Americans to meet Norway's wealth fund watchdog over pipeline "
    },
    {
        "content": "NEW YORK Energy Transfer Partners LP said on Thursday that 99 percent of its controversial Dakota Access Pipeline is complete after receiving all federal authorizations necessary earlier this month.",
        "date": "02232017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "Energy Transfer says Dakota Access pipeline 99 percent complete "
    },
    {
        "content": "* Qtrly revenues $6.53 billion versus $5.83 billion  Source text for Eikon:  Further company coverage:",
        "date": "02222017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners quarterly loss per share $1.47 per unit "
    },
    {
        "content": "NEW YORK  Feb 23 Energy Transfer Partners LP  said on Thursday that 99 percent of its controversial Dakota Access Pipeline is complete after receiving all federal authorizations necessary earlier this month.",
        "date": "02232017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Energy Transfer says Dakota Access pipeline 99 pct complete "
    },
    {
        "content": "HOUSTON Energy Transfer Partners  on Thursday said it had begun drilling under Lake Oahe and that it expects its Dakota Access Pipeline to begin service in approximately 83 days  according to a company spokeswoman.",
        "date": "02092017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "Energy Transfer Partners begins drilling under Lake Oahe: spokesperson "
    },
    {
        "content": "NEW YORK The chief executive of Phillips 66 said on Friday he expects the Dakota Access Pipeline to start operations in the second quarter  even though the project - which has sparked protests by Native Americans and environmentalists - is still in the midst of legal battles and a U.S. regulatory review.",
        "date": "02042017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "Dakota Access Pipeline to start in second quarter: stakeholder "
    },
    {
        "content": "NEW YORK  Feb 3 The chief executive of Phillips 66 said on Friday he expects the Dakota Access Pipeline to start operations in the second quarter  even though the project - which has sparked protests by Native Americans and environmentalists - is still in the midst of legal battles and a U.S. regulatory review.",
        "date": "02042017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "UPDATE 2-Dakota Access Pipeline to start in 2nd quarter -stakeholder "
    },
    {
        "content": "* ALPS Advisors Inc reports 5.09 percent passive stake in energy transfer partners lp as of december 31  2016 - sec filing  Source text (http://bit.ly/2ko81ya) Further company coverage:",
        "date": "01262017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-ALPS Advisors Inc reports 5.09 pct passive stake in Energy Transfer Partners LP as of Dec 31  2016 "
    },
    {
        "content": "WILMINGTON  Del. A Delaware court revived an investor lawsuit against Energy Transfer Partners  over its $11 billion acquisition of Regency Energy Partners in a case focused on protections for investors in master limited partnerships.",
        "date": "01232017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "Court revives investor suit vs. ETP over $11 billion pipeline deal "
    },
    {
        "content": "WILMINGTON  Del.  Jan 23 A Delaware court revived an investor lawsuit against Energy Transfer Partners  over its $11 billion acquisition of Regency Energy Partners in a case focused on protections for investors in master limited partnerships.",
        "date": "01232017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Court revives investor suit vs ETP over $11 bln pipeline deal "
    },
    {
        "content": "HOUSTON  Jan 17 Energy Transfer Partners  has filed a motion to bar the U.S. Army Corps of Engineers from initiating an environmental study for its controversial Dakota Access pipeline crossing at Lake Oahe in North Dakota.",
        "date": "01172017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Dakota Access company files motion to halt environmental study "
    },
    {
        "content": "* Energy Transfer Partners announces pricing of $1.5 billion of senior notes",
        "date": "01122017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners announces pricing of $1.5 bln senior notes "
    },
    {
        "content": "Private-equity firm Blackstone Group LP  is no longer looking at buying a $5 billion stake in Energy Transfer Partners   a source familiar with the matter confirmed on Monday.",
        "date": "01092017",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "Blackstone ends talks for $5 billion Energy Transfer stake "
    },
    {
        "content": "Jan 9 Private-equity firm Blackstone Group LP  is no longer looking at buying a $5 billion stake in Energy Transfer Partners  a source familiar with the matter confirmed on Monday.",
        "date": "01092017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "UPDATE 1-Blackstone ends talks for $5 bln Energy Transfer stake "
    },
    {
        "content": "Jan 9 Private-equity firm Blackstone Group LP  is no longer looking at buying a $5 billion stake in Energy Transfer Partners  Bloomberg reported on Monday  citing people familiar with the matter.",
        "date": "01092017",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Blackstone ends talks for $5 bln Energy Transfer stake - Bloomberg "
    },
    {
        "content": "Private-equity firm Blackstone Group LP is in talks to buy a stake in assets owned by Energy Transfer Partners LP  the company building the controversial Dakota Access pipeline  a source familiar with the situation said on Thursday.",
        "date": "12232016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "Blackstone in talks to buy stake in Energy Transfer assets "
    },
    {
        "content": "HOUSTON Delays to the Dakota Access Pipeline have added millions of dollars to Energy Transfer Partners' construction tab - but even if the line is approved  the freezing temperatures will bring their own challenges to finishing the drilling process.",
        "date": "12022016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "As winter nears  Dakota Access faces frigid weather and costly delays "
    },
    {
        "content": "* Sunoco logistics partners-upon termination of deal under certain circumstances etp may be required to reimburse sxl's expenses up to $30 million-sec filing",
        "date": "11212016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Sunoco Logistics says upon termination of deal ETP may be required to pay SXL termination fee of $630 mln "
    },
    {
        "content": "Nov 21 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Monday:",
        "date": "11212016",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "Pipeline companies Sunoco Logistics Partners LP  and Energy Transfer Partners (ETP)   both of which are controlled by general partner Energy Transfer Equity LP   said on Monday they would combine in a corporate consolidation to cut borrowing and operating costs.",
        "date": "11212016",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Energy Transfer MLPs Sunoco Logistics and ETP to combine "
    },
    {
        "content": "Nov 21 Pipeline companies Sunoco Logistics Partners LP and Energy Transfer Partners (ETP)  both of which are controlled by general partner Energy Transfer Equity LP  said on Monday they would combine in a corporate consolidation to cut borrowing and operating costs.",
        "date": "11212016",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "UPDATE 3-Energy Transfer MLPs Sunoco Logistics and ETP to combine "
    },
    {
        "content": "Nov 21 Sunoco Logistics Partners LP said on Monday it would buy Energy Transfer Partners LP in a deal valued at $19.93 billion.",
        "date": "11212016",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Sunoco Logistics to buy Energy Transfer Partners "
    },
    {
        "content": "WASHINGTON  Nov 18 Energy Transfer Partners LP  Chief Executive Officer Kelcy Warren said the company will not consider rerouting its Dakota Access oil pipeline despite concerns voiced by U.S. native groups  according to an Associated Press interview published on Friday.",
        "date": "11182016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "REFILE-UPDATE 2-Developer says Dakota Access pipeline will not be rerouted - AP "
    },
    {
        "content": "Nov 15 Energy Transfer Partners LP  which is building the controversial Dakota Access pipeline  is seeking federal court intervention to finish the project without further action from the Army Corps of Engineers  which owns some of the land where it is to be built.",
        "date": "11152016",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Energy Transfer seeks court intervention on Dakota pipeline "
    },
    {
        "content": "HOUSTON Energy Transfer Partners on Thursday said an easement from the Army Corps of Engineers to drill under Lake Oahe would unlock an additional $1.4 billion in financing for its Dakota Access Pipeline.",
        "date": "11102016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "Army Corps easement would unlock $1.4 billion in Dakota Access financing "
    },
    {
        "content": "* Energy Transfer Partners Lp - qtrly revenues $5 531 million versus $6 601 million",
        "date": "11092016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners Lp reports qtrly loss per share of $0.49 "
    },
    {
        "content": "HOUSTON  Nov 10 Energy Transfer Partners  on Thursday said an easement from the Army Corps of Engineers to drill under Lake Oahe would unlock an additional $1.4 billion in financing for its Dakota Access Pipeline.",
        "date": "11102016",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "UPDATE 2-Army Corps easement would unlock $1.4 bln in Dakota Access financing "
    },
    {
        "content": "HOUSTON  Nov 10 Energy Transfer Partners  on Thursday said an easement from the Army Corps of Engineers to drill under Lake Oahe will unlock an additional $1.4 billion in financing for its Dakota Access Pipeline.",
        "date": "11102016",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "CORRECTED-UPDATE 1-Army Corps easement to unlock $1.4 bln in financing for Dakota Access "
    },
    {
        "content": "HOUSTON/WASHINGTON  Oct 26 The top executive at the company behind the embattled Dakota Access Pipeline has donated more than $100 000 to Republican presidential candidate Donald Trump since June  according to campaign finance disclosure records.",
        "date": "10262016",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Top exec behind Dakota Access has donated more than $100 000 to Trump "
    },
    {
        "content": "* Energy Transfer Partners to acquire certain interests in Penntex Midstream Partners",
        "date": "10252016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners to buy certain interests in Penntex Midstream Partners for about $640 mln "
    },
    {
        "content": "Nov 8 Energy Transfer Partners LP on Tuesday said it was not slowing down construction of an oil pipeline in North Dakota that is contested by environmentalists and Native Americans groups.",
        "date": "11082016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "UPDATE 1-Energy Transfer says not slowing construction of North Dakota pipeline "
    },
    {
        "content": "HOUSTON  Sept 23 Sunoco Logistics  the future operator of the oil pipeline delayed this month after Native American protests in North Dakota  spills crude more often than any of its competitors with more than 200 leaks since 2010  according to a Reuters analysis of government data.",
        "date": "09232016",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "INSIGHT-Sunoco  behind protested Dakota pipeline  tops U.S. crude spill charts "
    },
    {
        "content": "The company building a pipeline to transport oil from North Dakota to the U.S. Gulf Coast said on Tuesday it remained committed to completing construction even after the U.S. Justice Department blocked the project while Native Americans and other protesters geared up for another day of demonstrations.",
        "date": "09132016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "Energy Transfer committed to building North Dakota pipeline - letter "
    },
    {
        "content": "NEW YORK  Sept 13 The company building a pipeline to transport oil from North Dakota to the U.S. Gulf Coast said on Tuesday it remained committed to completing construction even after the U.S. Justice Department blocked the project while Native Americans and other protesters geared up for another day of demonstrations.",
        "date": "09132016",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Energy Transfer committed to building North Dakota pipeline-letter "
    },
    {
        "content": "* Declines comment on judge's ruling or government's request on Dakota Access pipeline  Source text for Eikon:  Further company coverage:    (Reporting by Anna Driver)",
        "date": "09092016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer declines comment on judge's Dakota Access ruling "
    },
    {
        "content": "* Enbridge Energy Partners  L.P. and co announced today that EEP and Marathon Petroleum Corporation have formed a new joint venture",
        "date": "09012016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Enbridge - Enbridge Energy Partners L.P and Marathon Petroleum form new JV "
    },
    {
        "content": "* On August 2  Dakota Access LLC and Energy Transfer Crude Oil entered into a credit and guaranty agreement",
        "date": "08082016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners says Dakota Access LLC and Energy Transfer Crude Oil entered into a credit and guaranty agreement "
    },
    {
        "content": "* Q2 shr view $0.10  rev view $5.71 bln -- Thomson Reuters I/B/E/S  Source text for Eikon:  Further company coverage:",
        "date": "08032016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners reports qtrly earnings per unit of $0.10 "
    },
    {
        "content": "VANCOUVER Enbridge Inc  said on Tuesday it had formed a joint venture with Marathon Petroleum Corp  to take a minority stake in a holding company that owns 75 percent of the Bakken Pipeline System.",
        "date": "08032016",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Enbridge  Marathon take minority stake in Bakken pipeline "
    },
    {
        "content": "* Energy Transfer and Sunoco Logistics announce sale of minority stake in Bakken Pipeline Project to Enbridge and Marathon Petroleum",
        "date": "08022016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer  Sunoco Logistics sell minority stake in Bakken Pipeline "
    },
    {
        "content": "* Energy Transfer  Sunoco Logistics and Phillips 66 announce successful completion of project financing for Bakken Pipeline Joint Ventures",
        "date": "08022016",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer  Sunoco Logistics  Phillips 66 complete Bakken Pipeline financing "
    },
    {
        "content": "* Moody's Changes Energy Transfer Partners' Outlook To Negative",
        "date": "06292016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Moody's Changes Energy Transfer Partners' Outlook To Negative "
    },
    {
        "content": "Energy Transfer Equity  walked away from its more than $20 billion takeover of Williams Cos Inc  on Wednesday after months of lawsuits and heated arguments between the rival pipeline companies.",
        "date": "06292016",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Energy Transfer succeeds in ending Williams takeover saga "
    },
    {
        "content": "* Energy Transfer Partners Lp files for stock shelf of up to $1.5 billion in common units - SEC filing  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05102016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners files for stock shelf of up to $1.5 bln "
    },
    {
        "content": "* Qtrly revenues $4.48 billion versus $10.33 billion  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "05042016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners reports Q1 net loss per common unit $0.15 "
    },
    {
        "content": "* Announced a quarterly distribution of $1.055 per etp common unit  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04262016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners announces qtrly distribution of $1.055 per etp common unit "
    },
    {
        "content": "* Phillips 66 partners  Energy Transfer Partners and Sunoco Logistics announce start of commercial operations on Bayou Bridge Pipeline",
        "date": "04212016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Phillips 66 Partners  Energy Transfer Partners and Sunoco logistics start commercial operations on Bayou Bridge Pipeline "
    },
    {
        "content": "* Energy Transfer Partners and Sunoco LP complete the dropdown of remaining wholesale fuel and retail marketing assets  Source text for Eikon:  Further company coverage:     (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "03312016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BRIEF-Energy Transfer Partners and Sunoco LP complete the dropdown of remaining wholesale fuel and retail marketing assets "
    },
    {
        "content": "NEW YORK Shares of Williams Companies  fell sharply in afternoon trading on Thursday following a New York Times report that Energy Transfer may be searching for a way to pull out of its deal with the company.",
        "date": "02252016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "Williams Cos shares drop after NY Times report on deal problems "
    },
    {
        "content": "HOUSTON  Jan 29 Phillips 66 may consider increasing its 25 percent stake in Energy Transfer Partners'  pipeline project to move North Dakota Bakken oil to Illinois and Texas  but likes its current commitment as is  President Tim Taylor told analysts on Friday.",
        "date": "01292016",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "UPDATE 1-Phillips 66 may consider higher stake in Bakken pipeline project "
    },
    {
        "content": "HOUSTON Phillips 66  may consider increasing its 25 percent stake in Energy Transfer Partners' pipeline project to move North Dakota Bakken oil to Illinois  but the company's current commitment \"is where we would like it to be at this point \" President Tim Taylor told analysts on Friday.",
        "date": "01292016",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Phillips 66 may consider higher stake in Bakken pipeline project "
    },
    {
        "content": "LONDON  Dec 18 BG Group and Energy Transfer Partners have gained approval from the U.S. energy regulator for their liquefied natural gas (LNG) production and export plant in Lake Charles  Louisiana  the companies said.",
        "date": "12182015",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "BG  Energy Transfer get approval for U.S. Lake Charles LNG project "
    },
    {
        "content": "* \u007fFinal investment decisions from both BG Group and Energy Transfer are expected to be taken in 2016\u007f",
        "date": "12182015",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "RPT-BRIEF-BG says Lake Charles LNG project approved by U.S. regulator "
    },
    {
        "content": "Nov 16 Pipeline operator Energy Transfer Partners LP said it would sell its 68.42 percent stake in Sunoco LLC  which distributes motor fuel  to convenience store operator Sunoco LP for about $2.23 billion.",
        "date": "11162015",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "UPDATE 1-Energy Transfer to sell stake in Sunoco LLC to Sunoco LP "
    },
    {
        "content": "Nov 16 Energy Transfer Partners LP said it would sell its 68.42 percent stake in convenience store operator Sunoco LLC to Sunoco LP for about $2.23 billion.",
        "date": "11162015",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Energy Transfer to sell stake in Sunoco LLC to Sunoco LP "
    },
    {
        "content": "July 15 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Wednesday:",
        "date": "07152015",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "July 15 Pipeline company Energy Transfer Partners said it would sell convenience store operator Susser Holdings for about $1.94 billion to its unit Sunoco LP .",
        "date": "07152015",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Energy Transfer Partners sells convenience stores to Sunoco "
    },
    {
        "content": "July 15 Pipeline company Energy Transfer Partners said it would sell convenience store operator Susser Holdings to its unit Sunoco LP for about $1.94 billion in cash and stock.",
        "date": "07152015",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "UPDATE 1-Energy Transfer Partners sells convenience stores to Sunoco "
    },
    {
        "content": "Jan 26 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Monday:",
        "date": "01262015",
        "name": "Energy Transfer Partners LP",
        "news_type": "topStory",
        "symbol": "ETP",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Pipeline company Energy Transfer Partners LP  said on Monday it would buy affiliate Regency Energy Partners LP for about $11 billion  the latest example of master limited partnerships (MLP) trying to simplify their structures and lift returns.",
        "date": "01262015",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Energy Transfer Partners to buy Regency unit for $11 bln "
    },
    {
        "content": "Pipeline company Energy Transfer Partners LP  said on Monday it would buy affiliate Regency Energy Partners LP  for about $11 billion  the latest example of master limited partnerships (MLP) trying to simplify their structures and lift returns.",
        "date": "01262015",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Energy Transfer Partners to buy Regency unit for $11 billion "
    },
    {
        "content": "Jan 26 Pipeline company Energy Transfer Partners LP said on Monday it would buy affiliate Regency Energy Partners LP for about $11 billion  the latest example of master limited partnerships (MLP) trying to simplify their structures and lift returns.",
        "date": "01262015",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "UPDATE 2-Energy Transfer Partners to buy Regency unit for $11 bln "
    },
    {
        "content": "Jan 26 Pipeline operator Energy Transfer Partners LP said it would buy affiliate Regency Energy Partners LP in a deal valued at about $18 billion  including debt.",
        "date": "01262015",
        "name": "Energy Transfer Partners LP",
        "news_type": "normal",
        "symbol": "ETP",
        "title": "Energy Transfer to buy affiliate Regency Energy "
    }
]