[
    {
        "content": "Edwards Lifesciences Corp  on Tuesday reported slightly lower-than-expected third-quarter profit and revenue and saw a dip in sales of its critically important transcatheter heart valves from the prior quarter  although they grew about 17 percent from a year earlier.",
        "date": "10242017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "Edwards results fall short of Street estimates; shares tumble "
    },
    {
        "content": "Oct 24 Edwards Lifesciences Corp on Tuesday reported slightly lower-than-expected third-quarter profit and revenue and saw a dip in sales of its critically important transcatheter heart valves from the prior quarter  although they grew about 17 percent from a year earlier.",
        "date": "10242017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "UPDATE 1-Edwards results fall short of Street estimates; shares tumble "
    },
    {
        "content": "Oct 24 Edwards Lifesciences Corp on Tuesday reported slightly lower-than-expected third-quarter profit and revenue and saw a dip in sales of its critically important transcatheter heart valves from the prior quarter  although they grew about 17 percent from a year earlier.",
        "date": "10242017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Edwards 3rd-quarter results short of Street estimates; shares fall "
    },
    {
        "content": "July 26 Edwards Lifesciences Corp on Wednesday provided a revised full-year earnings forecast with the new low end of the range above Wall Street estimates  and it posted higher-than-expected second-quarter profit on double-digit growth in sales of its transcatheter heart valve replacements.",
        "date": "07262017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Edwards Lifesciences raises 2017 forecast after strong quarter "
    },
    {
        "content": "July 26 Edwards Lifesciences Corp on Wednesday provided a revised full-year earnings forecast with the new low end of the range above Wall Street estimates  and it posted higher-than-expected second-quarter profit on double-digit growth in sales of its transcatheter heart valves.",
        "date": "07262017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "UPDATE 2-Edwards Lifesciences raises 2017 forecast after strong quarter "
    },
    {
        "content": "* Edwards Lifesciences Corp - Received U.S. FDA approval for its Inspiris Resilia aortic valve  first in a new class of resilient heart valves Source text for Eikon: Further company coverage:",
        "date": "07052017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "BRIEF-Edwards' Inspiris Resilia valve receives FDA approval "
    },
    {
        "content": "* District court in Munich has partially found in favour of Edwards Lifesciences Corporation in its case against Neovasc",
        "date": "06162017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "BRIEF-Neovasc says German Court partially found in favor of Edwards Lifesciences in its case against co "
    },
    {
        "content": "The U.S. Food and Drug Administration on Monday approved Edwards Lifesciences Corp's Sapien 3 artificial heart valve for high-risk patients whose previously implanted heart valves are failing  a procedure designed to avoid repeat open heart surgery.",
        "date": "06062017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "FDA approves new use for Edwards' Sapien 3 heart valve "
    },
    {
        "content": "* Edwards SAPIEN 3 valve receives FDA approval for aortic  mitral valve-in-valve procedures Source text for Eikon: Further company coverage:",
        "date": "06052017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "BRIEF-Edwards Lifesciences says SAPIEN 3 valve receives FDA approval for aortic  mitral valve-in-valve procedures "
    },
    {
        "content": "June 5 The U.S. Food and Drug Administration on Monday approved Edwards Lifesciences Corp's Sapien 3 artificial heart valve for high-risk patients whose previously implanted heart valves are failing  a procedure designed to avoid repeat open heart surgery.",
        "date": "06052017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "FDA approves new use for Edwards' Sapien 3 heart valve "
    },
    {
        "content": "June 5 The U.S. Food and Drug Administration on Monday approved Edwards Lifesciences Corp's Sapien 3 artificial heart valve for high-risk patients whose previously implanted heart valves are failing  a procedure designed to avoid repeat open heart surgery.",
        "date": "06052017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "UPDATE 1-FDA approves new use for Edwards' Sapien 3 heart valve "
    },
    {
        "content": "* Says Q1 earnings per share $1.06; Q1 adjusted earnings per share $0.94; Q1 sales grew 27 percent to $884 million",
        "date": "04252017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "BRIEF-Edwards Lifesciences Q1 earnings per share $1.06 "
    },
    {
        "content": "April 25 Edwards Lifesciences Corp on Tuesday reported higher-than expected first-quarter profit and revenue on surging sales of  transcatheter heart valve replacements  and raised its full-year earnings forecast to reflect the strong start to the year.",
        "date": "04252017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Edwards profit tops expectations on soaring heart valve sales "
    },
    {
        "content": "April 25 Edwards Lifesciences Corp on Tuesday reported higher-than expected first-quarter profit and revenue on surging sales of  transcatheter heart valve replacements and raised its full-year earnings forecast to reflect the strong start to the year.",
        "date": "04252017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "UPDATE 1-Edwards profit tops expectations on soaring heart valve sales "
    },
    {
        "content": "* District court in Germany ruled that Boston Scientific's lotus valve infringes one of co's patents for transcatheter aortic valves",
        "date": "03092017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "BRIEF-German patent court issues initial decision "
    },
    {
        "content": "* Boston scientific receives favorable rulings in edwards lifesciences litigation",
        "date": "03092017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "BRIEF-Boston Scientific receives favorable rulings in Edwards Lifesciences litigation "
    },
    {
        "content": "Edwards Lifesciences Corp  on Wednesday reported higher-than-expected fourth-quarter profit and revenue on surging demand for its minimally invasive heart valve replacement systems.",
        "date": "02012017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "Edwards Lifesciences fourth-quarter sales  profit top expectations "
    },
    {
        "content": "Feb 1 Edwards Lifesciences Corp on Wednesday reported higher-than-expected fourth-quarter profit and revenue on surging demand for its minimally invasive heart valve replacement systems.",
        "date": "02012017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Edwards Lifesciences 4th-quarter sales  profit top expectations "
    },
    {
        "content": "* Q4 global transcatheter heart valve therapy sales up 29 percent to $432 million",
        "date": "02012017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "BRIEF-Edwards Lifesciences Corp Q4 EPS $0.73 "
    },
    {
        "content": "A federal judge in Boston awarded Edwards Lifesciences Corp $20.7 million in prejudgment interest on top of the $91 million it already won in a trade secret lawsuit against rival Neovasc Inc  bringing the total to more than $111 million.",
        "date": "01192017",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "Edwards wins more than $20 million in interest in heart valve dispute "
    },
    {
        "content": "JERUSALEM Edwards Lifesciences Corp  on Monday said it has agreed to buy Israel's Valtech Cardio for $340 million in stock and cash  with the potential for an additional $350 million in pre-specified milestone-driven payments over the next 10 years.",
        "date": "11282016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "Edwards Lifesciences to buy Israel's Valtech for up to $690 million "
    },
    {
        "content": "JERUSALEM  Nov 28 Edwards Lifesciences Corp  on Monday said it has agreed to buy Israel's Valtech Cardio for $340 million in stock and cash  with the potential for an additional $350 million in pre-specified milestone-driven payments over the next 10 years.",
        "date": "11282016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "UPDATE 1-Edwards Lifesciences to buy Israel's Valtech for up to $690 mln "
    },
    {
        "content": "JERUSALEM  Nov 28 Edwards Lifesciences Corp  on Monday said it has agreed to buy Israel's Valtech Cardio for $340 million in stock and cash  with the potential for an additional $350 million in pre-specified milestone-driven payments over the next 10 years.",
        "date": "11282016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Edwards Lifesciences to buy Israel's Valtech for up to $690 mln "
    },
    {
        "content": "* Purchase price of Valtech is $340 million in stock and cash at closing ",
        "date": "11282016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "BRIEF-Edwards enters into agreement to acquire Valtech Cardio "
    },
    {
        "content": "A federal judge in Boston has ordered medical device maker Neovasc Inc to pay an extra $21 million in enhanced damages on top of a $70 million jury verdict in a trade secret lawsuit filed by a former client.",
        "date": "10312016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "Edwards wins $21 mln in enhanced damages in heart valve trade secrets case "
    },
    {
        "content": "Edwards Lifesciences Corp  on Tuesday reported third quarter sales of its minimally invasive heart valve replacements that fell short of Wall Street estimates  and its previously high-flying shares plunged more than 14 percent.",
        "date": "10252016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "Edwards Lifesciences third quarter sales disappoint  shares slide "
    },
    {
        "content": "Oct 25 Edwards Lifesciences Corp on Tuesday reported third quarter sales of its minimally invasive heart valve replacements that fell short of Wall Street estimates  and its previously high-flying shares plunged more than 14 percent.",
        "date": "10252016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "UPDATE 2-Edwards Lifesciences 3rd-qtr sales disappoint  shares slide "
    },
    {
        "content": "Oct 25 Edwards Lifesciences Corp on Tuesday reported higher third quarter profit in line with Wall Street estimates on increased sales of its minimally invasive heart valve replacement  and the company raised its full-year earnings forecast.",
        "date": "10252016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Edwards Lifesciences boosts outlook after profit meets Street view "
    },
    {
        "content": "Aug 18 The U.S. Food and Drug Administration has widened the use of Edwards Lifesciences Corp's heart valves to patients at intermediate risk of complications if they underwent open heart surgery.",
        "date": "08182016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "FDA widens use of Edwards' devices for heart valve replacement "
    },
    {
        "content": "* Edwards INTUITY Elite Rapid Deployment Valve receives FDA approval  Source text for Eikon:  Further company coverage:",
        "date": "08152016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "BRIEF-EDWARDS INTUITY Elite Rapid Deployment Valve receives FDA approval "
    },
    {
        "content": "* Stantec signs letter of intent to acquire NYC-based Edwards & Zuck: 120-person premiere buildings engineering firm  Source text for Eikon:  Further company coverage:",
        "date": "08122016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "BRIEF-Stantec  signs letter of intent to acquire NYC-based Edwards & Zuck "
    },
    {
        "content": "* Edwards Lifesciences receives approval for sapien 3 heart valve in canada  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +91 80 6749-1130; within U.S. +1 646 223 8780)",
        "date": "07272016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "BRIEF-Edwards Lifesciences gets pproval for Sapien 3 heart valve in Canada "
    },
    {
        "content": "July 26 Edwards Lifesciences Corp on Tuesday raised its full-year earnings forecast as quarterly profits beat estimates  and said U.S. regulators would soon likely approve its minimally invasive replacement heart valve for a broader range of patients.",
        "date": "07262016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "UPDATE 2-Edwards Lifesciences lifts forecast on heart valve sales "
    },
    {
        "content": "* Sees Q3 Sales Between $720 Mln - $760 Mln; Sees Q3 Adjusted Earnings Per Share Between $0.62 - $0.68",
        "date": "07262016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "BRIEF-Edwards Lifesciences Q2 Adjusted EPS $0.76 "
    },
    {
        "content": "Edwards Lifesciences Corp  on Tuesday boosted its full-year earnings outlook after posting a stronger-than-expected quarterly profit and said it expected to soon gain U.S. approval to offer its minimally invasive replacement heart valve to a broader range of patients.",
        "date": "07262016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Edwards Lifesciences lifts forecast on heart valve sales momentum "
    },
    {
        "content": "July 26 Edwards Lifesciences Corp on Tuesday boosted its full-year earnings outlook after posting a stronger-than-expected quarterly profit and said it expects to soon gain U.S. approval to offer its minimally invasive replacement heart valve to a broader range of patients.",
        "date": "07262016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Edwards Lifesciences lifts outlook on heart valve sales momentum "
    },
    {
        "content": "Medical device maker Edwards Lifesciences Corp has filed claims that rival Boston Scientific Corp's new heart valve replacement system  which is not yet for sale in the U.S.  infringes several of Edwards' patents.",
        "date": "06132016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "Edwards hits back at Boston Scientific in heart valve patent case "
    },
    {
        "content": "Medical device maker Neovasc Inc has been hit with a $70 million jury verdict in a trade secret lawsuit filed by a former client  Edwards Lifesciences Corp unit CardiAQ Valve Technologies Inc.",
        "date": "05202016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "Edwards unit wins $70 mln verdict in heart valve trade secrets case "
    },
    {
        "content": "Edwards Lifesciences Corp on Tuesday raised its full-year sales and profit outlook following strong first-quarter results and said approval for expanded use of its minimally invasive heart valve implant could come sooner than previously expected.",
        "date": "04262016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "Edwards raises outlook  plans for valve label expansion "
    },
    {
        "content": "April 26 Edwards Lifesciences Corp on Tuesday raised its full-year sales and profit outlook following strong first-quarter results and said approval for expanded use of its minimally invasive heart valve implant could come sooner than previously expected.",
        "date": "04262016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "UPDATE 2-Edwards raises outlook  plans for valve label expansion "
    },
    {
        "content": "April 26 EDWARDS LIFESCIENCES CEO SAYS PLANNING FOR FDA APPROVAL  LAUNCH OF TAVR FOR INTERMEDIATE-RISK PATIENTS AT BEGINNING OF Q4 EDWARDS CEO SAYS APPROVAL COULD COME SOONER DUE TO STRENGTH OF STUDY DATA  BUT HARD TO PREDICT REGULATORY TIMELINES EDWARDS CEO SAYS COMPANY ON TRACK TO SUBMIT FINAL DATA SETS FOR INTERMEDIATE-RISK PATIENTS TO FDA IN NEXT COUPLE OF WEEKS   (Reporting by Susan Kelly in Chicago)",
        "date": "04262016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Edwards CEO says aims for early Q4 launch of valve for new patient group "
    },
    {
        "content": "* Q1 earnings per share view $0.66 -- Thomson Reuters I/B/E/S",
        "date": "04262016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "BRIEF-Edwards Lifesciences Q1 adj shr $0.71 "
    },
    {
        "content": "* Edwards Lifesciences says 2016 THVT sales guidance raised to $1.4 - $1.6 bln",
        "date": "04262016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "BRIEF-Edwards lifesciences Q1 THVT sales up 37 pct to $367.8 mln "
    },
    {
        "content": "Boston Scientific Corp has sued a rival medical device company alleging that its replacement heart valve and several related products infringe Boston Scientific patents.",
        "date": "04212016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "Boston Scientific sues Edwards over heart valve replacement patents "
    },
    {
        "content": "April 26 Edwards Lifesciences Corp on Tuesday reported a better-than-expected quarterly profit and raised its full-year outlook on strong sales of its minimally invasive heart valve implants.",
        "date": "04262016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Edwards Lifesciences raises outlook on strong valve sales "
    },
    {
        "content": "* Says CEO Michael Mussallem's 2015 total compensation was $9.1 million versus $8.6 million in 2014 - sec filing  Source text for Eikon: (http://1.usa.gov/1SpQhLv) Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "03312016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "BRIEF-Edwards Lifesciences CEO's 2015 total compensation was $9.1 mln vs $8.6 mln in 2014 - SEC Filing "
    },
    {
        "content": "* Indexes down: Dow 0.27 pct  S&P 0.30 pct  Nasdaq 0.39 pct   (Adds details  changes comment  updates prices)",
        "date": "04042016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "US STOCKS-Wall St flat as investors pause after rally "
    },
    {
        "content": "* Indexes down: Dow 0.13 pct  S&P 0.1 pct  Nasdaq 0.09 pct   (Updates to open)",
        "date": "04042016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "US STOCKS-Wall St little changed as oil dips  health stocks rise "
    },
    {
        "content": "* Futures up: Dow 10 pts  S&P 3 pts  Nasdaq 5.25 pts   (Adds details  comment  updates prices)",
        "date": "04042016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "US STOCKS-Wall St set for slightly higher open "
    },
    {
        "content": "* Edwards Lifesciences receives approval for Sapien 3 valve in Japan",
        "date": "03162016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "BRIEF-Edwards Lifesciences gets approval for Sapien 3 valve in Japan "
    },
    {
        "content": "* Steven Loranger appointed to Edwards Lifesciences board of directors",
        "date": "03172016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "BRIEF-Steven loranger appointed to Edwards Lifesciences board "
    },
    {
        "content": "Edwards Lifesciences Corp  raised its full-year earnings forecast on Tuesday  anticipating stronger sales of its artificial heart valves implanted in a minimally invasive procedure that spares patients from open-chest surgery.",
        "date": "02022016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "Edwards lifts outlook as heart valve sales accelerate "
    },
    {
        "content": "Feb 2 Edwards Lifesciences Corp raised its full-year earnings forecast on Tuesday  anticipating stronger sales of its artificial heart valves implanted in a minimally invasive procedure that spares patients from open-chest surgery.",
        "date": "02022016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "UPDATE 2-Edwards lifts outlook as heart valve sales accelerate "
    },
    {
        "content": "* Q4 Transcatheter Heart Valve therapy (THV) sales $334.3 million  up 25 percent",
        "date": "02022016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "BRIEF-Edwards Lifesciences Q4 GAAP earnings per share $0.64 "
    },
    {
        "content": "Feb 2 Edwards Lifesciences Corp raised its full-year earnings forecast on Tuesday  anticipating stronger sales of its artificial heart valves implanted in a minimally invasive procedure that spares patients from open-chest surgery.",
        "date": "02022016",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Edwards Lifesciences boosts full-year profit outlook "
    },
    {
        "content": "Edwards Lifesciences Corp  reported better-than-expected third-quarter earnings and raised its full-year forecast on Monday  citing strong demand for its replacement heart valves that are implanted in minimally invasive procedures.",
        "date": "10262015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "Edwards Lifesciences lifts outlook on heart valve demand "
    },
    {
        "content": "Oct 26 Edwards Lifesciences Corp reported better-than-expected third-quarter earnings and raised its full-year forecast on Monday  citing strong demand for its replacement heart valves that are implanted in minimally invasive procedures.",
        "date": "10262015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "UPDATE 2-Edwards Lifesciences lifts outlook on heart valve demand "
    },
    {
        "content": "Oct 26 Edwards Lifesciences Corp on Monday reported stronger-than-expected third-quarter earnings on demand for its replacement heart valves that are implanted in minimally invasive procedures.",
        "date": "10262015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Edwards Lifesciences net income up on heart valve sales "
    },
    {
        "content": "July 28 Edwards Lifesciences Corp on Tuesday raised its full-year profit forecast due to strong demand for its replacement heart valves that are implanted in a minimally invasive procedure.",
        "date": "07282015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Edwards Lifesciences raises outlook on strong valve sales "
    },
    {
        "content": "July 28 Edwards Lifesciences Corp on Tuesday raised its full-year profit forecast  citing strong demand for the medical device maker's replacement heart valves that are implanted in a minimally invasive procedure.",
        "date": "07282015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "UPDATE 2-Edwards Lifesciences raises outlook on strong valve sales "
    },
    {
        "content": " (In July 10 story  corrects paragraph 6 to say \"has reached an agreement on protocol revisions to restart enrollment\" instead of \"it would restart enrollment\")",
        "date": "07122015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "Edwards Lifesciences to buy heart device maker for $400 million "
    },
    {
        "content": "July 10 Edwards Lifesciences Corp said it would buy privately held heart device maker CardiAQ Valve Technologies Inc for up to $400 million to expand its portfolio of less-invasive mitral valve replacement devices.",
        "date": "07122015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "CORRECTED-Edwards Lifesciences to buy heart device maker for $400 mln "
    },
    {
        "content": "July 10 Edwards Lifesciences Corp said it would buy privately held heart device maker CardiAQ Valve Technologies Inc for up to $400 million to expand its portfolio of less-invasive mitral valve replacement devices.",
        "date": "07102015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Edwards Lifesciences to buy heart device maker for $400 mln "
    },
    {
        "content": "The U.S. Food and Drug Administration on Wednesday said it approved Edwards Lifesciences Corp's Sapien 3 heart valve  the third-generation version of the company's system for replacing diseased aortic valves.",
        "date": "06172015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "Edwards gets U.S. approval for third generation heart valve "
    },
    {
        "content": "June 17 The U.S. Food and Drug Administration on Wednesday said it approved Edwards Lifesciences Corp's  Sapien 3 heart valve  the third-generation version of the company's system for replacing diseased aortic valves.",
        "date": "06172015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "UPDATE 1-Edwards gets U.S. approval for 3rd generation heart valve "
    },
    {
        "content": "June 17 The U.S. Food and Drug Administration on Wednesday said it approved Edwards Lifesciences Corp's  Sapien 3 heart valve  the third-generation version of the company's system for replacing diseased aortic valves.",
        "date": "06172015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Edwards gets U.S. approval for 3rd generation heart valve "
    },
    {
        "content": "Edwards Lifesciences Corp on Tuesday said it stopped enrolling patients in a small study of its less-invasive mitral heart valve device due to the formation of blood clots associated with the procedure.",
        "date": "05192015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "Edwards stops small mitral heart valve study "
    },
    {
        "content": "Medical device maker Edwards Lifesciences Corp said on Thursday quarterly net earnings doubled due to strong heart valve sales and a positive impact from foreign exchange.",
        "date": "04232015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "Edwards Lifesciences first-quarter net profit doubles  sales rise 13 percent "
    },
    {
        "content": "April 23 Medical device maker Edwards Lifesciences Corp said on Thursday quarterly net earnings doubled due to strong heart valve sales and a positive impact from foreign exchange.",
        "date": "04232015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Edwards Lifesciences 1st-qtr net profit doubles  sales rise 13 pct "
    },
    {
        "content": "Researchers on Sunday presented trial data showing very low mortality and stroke rates using the third generation version of Edwards Lifesciences Corp's non-invasive heart valve replacement system that could help support its U.S. approval.",
        "date": "03152015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "Low mortality  stroke seen with newest Edwards TAVR system: study "
    },
    {
        "content": "March 15 Researchers on Sunday presented trial data showing very low mortality and stroke rates using the third generation version of Edwards Lifesciences Corp's  non-invasive heart valve replacement system that could help support its U.S. approval.",
        "date": "03152015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Low mortality  stroke seen with newest Edwards TAVR system -study "
    },
    {
        "content": "Feb 3 Edwards Lifesciences Corp on Tuesday raised its 2015 earnings forecast to reflect strong demand for its non-invasive heart valve replacement system  but revised its overall sales forecast to account for a larger negative impact of foreign exchange due to the strong dollar .",
        "date": "02032015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "topStory",
        "symbol": "EW",
        "title": "UPDATE 1-Edwards raises 2015 earnings forecast; sees bigger forex hit "
    },
    {
        "content": "Feb 3 Edwards Lifesciences Corp on Tuesday raised its 2015 earnings forecast to reflect strong demand for its non-invasive heart valve replacement system  but revised its overall sales forecast to account for a larger negative impact of foreign exchange due to the strong dollar .",
        "date": "02032015",
        "name": "Edwards Lifesciences Corporation",
        "news_type": "normal",
        "symbol": "EW",
        "title": "Edwards raises 2015 earnings forecast; sees bigger forex hit "
    }
]