[
    {
        "content": "* East West Bank announces agreement to sell Desert Community Bank branches to Flagstar Bank  FSB",
        "date": "11132017",
        "name": "East West Bancorp Inc",
        "news_type": "topStory",
        "symbol": "EWBC",
        "title": "BRIEF-East West Bank announces agreement to sell Desert Community Bank Branches to Flagstar Bank  FSB "
    },
    {
        "content": "* East West Bancorp reports net income for third quarter 2017 of $132.7 million and diluted earnings per share of $0.91  both up by 12% from the prior quarter",
        "date": "10192017",
        "name": "East West Bancorp Inc",
        "news_type": "topStory",
        "symbol": "EWBC",
        "title": "BRIEF-East West Bancorp reports Q3 diluted EPS of $0.91 "
    },
    {
        "content": "* East West Bancorp reports net income for second quarter 2017 of $118.3 million and diluted earnings per share of $0.81",
        "date": "07202017",
        "name": "East West Bancorp Inc",
        "news_type": "topStory",
        "symbol": "EWBC",
        "title": "BRIEF-East West Bancorp reports its financial results for the Q2 2017 "
    },
    {
        "content": "* East West Bancorp reports net income for first quarter 2017 of $169.7 million and diluted earnings per share of $1.16  both up 53 pct from the prior quarter",
        "date": "04192017",
        "name": "East West Bancorp Inc",
        "news_type": "topStory",
        "symbol": "EWBC",
        "title": "BRIEF-East west Bancorp Q1 earnings per share $1.16 "
    },
    {
        "content": "* East West Bancorp reports record net income for full year 2016 of $431.7 million and diluted earnings per share of $2.97  both up 12% from prior year",
        "date": "01252017",
        "name": "East West Bancorp Inc",
        "news_type": "topStory",
        "symbol": "EWBC",
        "title": "BRIEF-East West Bancorp reports Q4 earnings per share of $0.76 "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 23 (Fitch) Fitch Ratings has affirmed East West Bancorp   Inc.'s (EWBC) ratings at 'BBB/F2' reflecting its solid earnings profile  good  asset quality  and a distinctive franchise. This is primarily offset by  historically strong loan growth  which has not fully seasoned  and a regulatory  agreement regarding BSA compliance. The Rating Outlook is Stable. The rating action follows a periodic review of the midtier region",
        "date": "01232017",
        "name": "East West Bancorp Inc",
        "news_type": "topStory",
        "symbol": "EWBC",
        "title": "Fitch Affirms East West Bancorp's IDRs at 'BBB/F2'; Outlook Stable "
    },
    {
        "content": " ",
        "date": "01252017",
        "name": "East West Bancorp Inc",
        "news_type": "normal",
        "symbol": "EWBC",
        "title": "A "
    },
    {
        "content": "* East West Bancorp reports net income for third quarter 2016 of $110 million  and diluted earnings per share of $0.76  both up 7% from prior quarter",
        "date": "10192016",
        "name": "East West Bancorp Inc",
        "news_type": "topStory",
        "symbol": "EWBC",
        "title": "BRIEF-East West Bancorp sees FY 2016 earnings per share $2.91 to $2.93 "
    },
    {
        "content": "* Estimates that fully diluted earnings per share for both third and q4 of 2016 will range from $0.69 to $0.71",
        "date": "07202016",
        "name": "East West Bancorp Inc",
        "news_type": "topStory",
        "symbol": "EWBC",
        "title": "BRIEF-East West Bancorp Q2 earnings per share $0.71 "
    },
    {
        "content": "* East West Bancorp says CEO Dominic NG'S total compensation for 2015 is $9 mln vs $5.9 mln last year - SEC Filing   Source text [http://1.usa.gov/1XLc1pn]  Further company coverage:    (Bengaluru Newsroom: +1-646-223-8780)",
        "date": "04212016",
        "name": "East West Bancorp Inc",
        "news_type": "topStory",
        "symbol": "EWBC",
        "title": "BRIEF-East West Bancorp says CEO Dominic NG's total compensation for 2015 is $9 mln vs $5.9 mln last year "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  January 28 (Fitch) Fitch Ratings has affirmed East West Bancorp  Inc.'s  (EWBC) ratings at 'BBB/F2' reflecting its solid earnings profile  good asset  quality  and a distinctive franchise. This is primarily offset by strong loan  growth and a recent regulatory agreement regarding BSA compliance. The Rating  Outlook is Stable The rating action follows a periodic review of the midtier regional banking  group  which includes BankU",
        "date": "01282016",
        "name": "East West Bancorp Inc",
        "news_type": "topStory",
        "symbol": "EWBC",
        "title": "Fitch Affirms East West Bancorp at 'BBB' Following Midtier Regional Bank Review; Outlook Stable "
    },
    {
        "content": "Nov 12 East West Bancorp Inc  which calls itself a \"financial bridge\" between the United States and China  agreed to improve its anti-money laundering controls and monitor high-risk customers more closely under an enforcement agreement announced on Thursday by the Federal Reserve.",
        "date": "11122015",
        "name": "East West Bancorp Inc",
        "news_type": "normal",
        "symbol": "EWBC",
        "title": "East West Bancorp agrees with Fed to improve laundering controls "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  January 30 (Fitch) Fitch Ratings has affirmed East West Bancorp (EWBC)  ratings at 'BBB/F2'. The Rating Outlook remains Stable. The affirmation reflects  the bank's strong profitability and solid franchise. The rating action follows a periodic review of the large regional banking group   which includes BOK Financial Corp. (BOKF)  Cathay General Bancorp (CATY)  First  Horizon National Corp. (FHN)  First National of Nebraska  In",
        "date": "01302015",
        "name": "East West Bancorp Inc",
        "news_type": "topStory",
        "symbol": "EWBC",
        "title": "Fitch Affirms East West Bancorp's Ratings at 'BBB/F2' Following Mid-Tier Regional Bank Peer Review "
    }
]