[
    {
        "content": "Shares of Expedia Inc  fell sharply on Friday after the U.S. online travel services company posted earnings that fell well short of analysts estimates and slashed its full-year profit forecast.",
        "date": "10272017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Expedia shares plunge on third-quarter results  full-year outlook "
    },
    {
        "content": "Online travel services company Expedia Inc  reported quarterly profit below Wall Street's consensus forecast  sending the brand's shares tumbling in after-hours trading on Thursday.",
        "date": "10262017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Expedia profit misses Wall Street view  shares tumble "
    },
    {
        "content": "Oct 27 Shares of Expedia Inc fell sharply on Friday after the U.S. online travel services company posted earnings that fell well short of analysts estimates and slashed its full-year profit forecast.",
        "date": "10272017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 1-Expedia shares plunge on Q3 results  full-year outlook "
    },
    {
        "content": "Oct 26 Online travel services company Expedia Inc reported quarterly profit below Wall Street's consensus forecast  sending the brand's shares tumbling in after-hours trading on Thursday.",
        "date": "10262017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 1-Expedia profit misses Wall Street view  shares tumble "
    },
    {
        "content": "Oct 27 Shares of U.S. online travel services company Expedia Inc fell sharply on Friday after a bleak earnings report that fell short of analysts estimates and saw the company cut its own forecast for full year profit.",
        "date": "10272017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia sinks after cut in profit outlook "
    },
    {
        "content": "Oct 26 Online travel-booking company Expedia Inc reported a 15 percent rise in third-quarter revenue on strong performance in the company's vacation rental unit HomeAway.",
        "date": "10262017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia revenue rises 15 percent in Q3 "
    },
    {
        "content": "* Expedia Inc - qtrly revenue $2 965.8 million versus $2 580.9 mln‍​",
        "date": "10262017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia reports qtrly earnings per share $2.23‍​ "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  September 18 (Fitch) Fitch Ratings has assigned a 'BBB-' rating to Expedia  Inc.'s (Expedia) announced issuance of senior unsecured notes. A full list of ratings follows at the end of this release. Expedia plans to use the note proceeds for general corporate purposes  which may include the repayment of $500 million senior unsecured notes due 2018  working capital  capital expenditures  acquisitions  and shareholder returns. Fi",
        "date": "09182017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Fitch Rates Expedia's Announced Senior Unsecured Notes 'BBB-' "
    },
    {
        "content": "* Expedia Inc announces proposed private offering of senior notes",
        "date": "09182017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia announces proposed private offering of senior notes "
    },
    {
        "content": "* Expedia  Inc. announces pricing of private offering of senior notes",
        "date": "09192017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia  announces pricing of private offering of senior notes "
    },
    {
        "content": "* Expedia Inc - announced a new strategic alliance with Thomas Cook Source text for Eikon: Further company coverage:",
        "date": "09142017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia Inc announced a new strategic alliance with Thomas Cook "
    },
    {
        "content": "LONDON  Sept 14 British tour operator Thomas Cook said on Thursday it had entered into a strategic alliance with Expedia to make the online travel company its preferred provider of hotels for certain holiday sales.",
        "date": "09142017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Thomas Cook partners with Expedia for hotel sales "
    },
    {
        "content": "* EXPEDIA WILL BECOME PREFERRED PROVIDER OF HOTELS FOR THOMAS COOK'S COMPLEMENTARY 1 CITY AND DOMESTIC HOLIDAY BUSINESS Source text for Eikon: Further company coverage: (Bangalore.newsroom@thomsonreuters.com)",
        "date": "09142017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "BRIEF-Thomas Cook and Expedia announce strategic alliance "
    },
    {
        "content": "SAN FRANCISCO  Sept 7 Startup company Hotel Tonight  betting that superior mobile technology will give it an edge  is expanding its hotel-booking offerings and going toe-to-toe with the big online travel companies.",
        "date": "09072017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Hotel Tonight faces off with Expedia  Priceline with advanced bookings "
    },
    {
        "content": "* Expedia CEO Dara Khosrowshahi confirms he plans to accept the top job at Uber Technologies Inc - WSJ Source text : http://on.wsj.com/2iEPgtx Further company coverage:",
        "date": "08292017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia CEO Dara Khosrowshahi says he plans to accept top job at Uber- WSJ "
    },
    {
        "content": "SAN FRANCISCO Expedia Inc Chief Executive Dara Khosrowshahi is poised to accept Uber Technologies Inc's [UBER.UL] offer to become its new CEO  according to an internal memo sent to Expedia staff  putting him in charge of turning around the loss-making  scandal-ridden company. | Video ",
        "date": "08292017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia's Khosrowshahi poised to take Uber CEO job: memo "
    },
    {
        "content": "SAN FRANCISCO  Aug 28 Expedia Inc Chief Executive Dara Khosrowshahi is poised to accept Uber Technologies Inc's offer to become its new CEO  according to an internal memo sent to Expedia staff  putting him in charge of turning around the loss-making  scandal-ridden company.",
        "date": "08292017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 4-Expedia's Khosrowshahi poised to take Uber CEO job - memo "
    },
    {
        "content": "Sept 1 Online travel services company Expedia Inc said on Friday it appointed Alan Pickerill as its chief financial officer.",
        "date": "09012017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia names Alan Pickerill CFO "
    },
    {
        "content": "Shares of Expedia Inc fell on Monday after reports that the online travel firm's long-time chief executive  Dara Khosrowshahi  is likely to head Uber Technologies  triggering concerns his exit might hurt the company's growth.",
        "date": "08282017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Dara Khosrowshahi's likely exit major loss for Expedia: analysts "
    },
    {
        "content": "Expedia Inc on Wednesday named Mark Okerstrom as its new president and chief executive  replacing Dara Khosrowshahi who left the U.S. travel-booking company to take the top job at car-ride provider Uber Technologies Inc [UBER.UL].",
        "date": "08302017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Expedia taps CFO Okerstrom to replace Khosrowshahi as CEO "
    },
    {
        "content": "Sept 1 Online travel services company Expedia Inc said on Friday it appointed Alan Pickerill as its chief financial officer.",
        "date": "09012017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 1-Expedia names Alan Pickerill CFO "
    },
    {
        "content": "Aug 28 Shares of Expedia Inc fell as much as 5.4 percent on Monday following reports that the online travel provider's long-standing chief executive  Dara Khosrowshahi  is joining Uber Technologies as its CEO  triggering concerns his exit might hurt the company's growth.",
        "date": "08282017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Dara Khosrowshahi's exit major loss for Expedia - analysts "
    },
    {
        "content": "* Dara Khosrowshahi has been asked to lead uber - Expedia's internal memo seen by Reuters",
        "date": "08282017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "BRIEF-Dara Khosrowshahi has been asked to lead Uber - Expedia's internal memo seen by Reuters "
    },
    {
        "content": "Aug 30 Expedia Inc on Wednesday named Mark Okerstrom as its new president and chief executive  replacing Dara Khosrowshahi who left the U.S. travel-booking company to take the top job at car-ride provider Uber Technologies Inc.",
        "date": "08302017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 2-Expedia taps CFO Okerstrom to replace Khosrowshahi as CEO "
    },
    {
        "content": "Aug 30 Expedia Inc named Chief Financial Officer Mark Okerstrom as its chief executive  replacing Dara Khosrowshahi  who took over the top job at Uber Technologies Inc.",
        "date": "08302017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia picks CFO Mark Okerstrom as new CEO "
    },
    {
        "content": "* Expedia Inc - ‍Okerstrom will also join Expedia's board of directors  and Khosrowshahi will continue to be a member of Expedia's board of directors​",
        "date": "08302017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia  Inc. Announces new CEO "
    },
    {
        "content": "* Expedia Inc - ‍approved appointment of Alan Pickerill to succeed Mark Okerstrom as executive vice president and chief financial officer​ Source text for Eikon: Further company coverage:",
        "date": "09012017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia Inc announces new chief financial officer "
    },
    {
        "content": "Uber Technologies Inc [UBER.UL] chose Dara Khosrowshahi  the chief executive of travel company Expedia Inc  as its chief executive on Sunday  according to two sources with knowledge of the matter  handing him the challenge of leading the ride-services company out of a nearly year-long crisis. | Video ",
        "date": "08282017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Uber picks Expedia's Dara Khosrowshahi as new CEO: sources "
    },
    {
        "content": "* Alice raises $26 million series B funding from Expedia  Inc.",
        "date": "08302017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "BRIEF-Alice raises $26 mln series B funding from Expedia "
    },
    {
        "content": "Aug 27 Uber Technologies Inc chose Dara Khosrowshahi  the chief executive of travel company Expedia Inc  as its chief executive on Sunday  according to two sources with knowledge of the matter  handing him the challenge of leading the ride-services company out of a nearly year-long crisis.",
        "date": "08282017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 6-Uber picks Expedia's Dara Khosrowshahi as new CEO - sources "
    },
    {
        "content": "Online travel provider Expedia Inc is looking to build up its rail booking services in the United States  Chief Executive Dara Khosrowshahi said in an interview with Reuters on Tuesday.",
        "date": "08222017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Expedia to expand U.S. passenger rail booking presence: CEO "
    },
    {
        "content": "* Expedia CEO Dara Khosrowshahi will be Uber's new CEO- Recode citing sources Source http://bit.ly/2wh3gNo",
        "date": "08282017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia CEO Dara Khosrowshahi will be Uber's new CEO- Recode citing sources "
    },
    {
        "content": "Aug 22 Online travel provider Expedia Inc is looking to build up its rail booking services in the United States  Chief Executive Dara Khosrowshahi said in an interview with Reuters on Tuesday.",
        "date": "08222017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia to expand U.S. passenger rail booking presence -CEO "
    },
    {
        "content": "Aug 15 Latin American online travel provider Despegar.com Corp on Tuesday filed to raise up to $100 million in an initial public offering on the New York Stock Exchange.",
        "date": "08152017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Online travel firm Despegar aims to raise $100 mln in IPO "
    },
    {
        "content": "* Co  Traveloka Holding Limited says Expedia made a $350 million primary minority investment in Traveloka",
        "date": "07272017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia deepens partnership with Traveloka "
    },
    {
        "content": "HAVANA U.S. online travel services company Expedia  said on Tuesday it had started offering online booking for hotels in Communist-run Cuba  hoping to capitalize on a boom in tourism to the Caribbean island. | Video ",
        "date": "05242017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Expedia begins offering online booking for hotels in Cuba "
    },
    {
        "content": "* Says travelers can now book hotels in Cuba on company's global points of sale Source text - (http://bit.ly/2rPYtPs) Further company coverage:",
        "date": "05232017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia enables booking hotels in Cuba on Co's global points of sale "
    },
    {
        "content": "HAVANA  May 23 U.S. online travel services company Expedia said on Tuesday it had started offering online booking for hotels in Communist-run Cuba  hoping to capitalize on a boom in tourism to the Caribbean island.",
        "date": "05232017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia begins offering online booking for hotels in Cuba "
    },
    {
        "content": "* Mastercard brings faster  safer payments to Expedia with Masterpass Source text for Eikon: Further company coverage:",
        "date": "05162017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Mastercard brings faster  safer payments to Expedia with Masterpass "
    },
    {
        "content": "* Expedia announces agreement to acquire majority of SilverRrail",
        "date": "05112017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia announces agreement to acquire majority of SilverRail "
    },
    {
        "content": "* Trivago increases full-year guidance after expedia releases first quarter results",
        "date": "04272017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Trivago increases FY17 guidance after Expedia releases Q1 results "
    },
    {
        "content": "* Expedia Inc - CEO Dara Khosrowshahi 2016 total compensation $2.4 million - SEC filing",
        "date": "05012017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia CEO Khosrowshahi 2016 total compensation $2.4 mln "
    },
    {
        "content": "* Expedia Inc - beginning with Q1 of FY 2017  co intends to include homeaway gross bookings and room nights in its reported consolidated operating metrics Source text:(http://bit.ly/2opb9Q0) Further company coverage:",
        "date": "04242017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia Inc intends to include homeaway gross bookings and room nights in its reported consolidated operating metrics "
    },
    {
        "content": "April 25 - A former Expedia Inc computer support technician was sentenced to 15 months in prison on Tuesday after admitting he stole confidential information from senior executives' emails to profit from insider trading.",
        "date": "04252017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Former Expedia IT employee gets 15 months in prison for insider trading "
    },
    {
        "content": "A former Expedia Inc computer support technician was sentenced to 15 months in prison on Tuesday after admitting he stole confidential information from senior executives' emails to profit from insider trading.",
        "date": "04252017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Former Expedia IT employee get 15 months in U.S. prison for insider trading "
    },
    {
        "content": "April 25 A former Expedia Inc computer support technician was sentenced to 15 months in prison on Tuesday after admitting he stole confidential information from senior executives' emails to profit from insider trading.",
        "date": "04252017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 1-Former Expedia IT employee get 15 months in U.S. prison for insider trading "
    },
    {
        "content": "April 25 A former Expedia Inc computer support technician was sentenced to 15 months in prison on Tuesday after admitting he stole confidential information from senior executives' emails to profit from insider trading.",
        "date": "04252017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Former Expedia IT employee get 15 months in prison for insider trading "
    },
    {
        "content": "* Expedia Inc - on March 16  2017  co expanded size of board from thirteen to fourteen members and elected chelsea clinton - sec filing  Source text for Eikon:  Further company coverage:",
        "date": "03172017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia announces board changes "
    },
    {
        "content": "Online travel services company Expedia Inc reported a better-than-expected increase in fourth-quarter revenue  helped by higher gross bookings.",
        "date": "02092017",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Expedia revenue rises more than expected as bookings increase "
    },
    {
        "content": "Feb 9 Online travel services company Expedia Inc  reported a better-than-expected increase in fourth-quarter revenue  helped by higher gross bookings.",
        "date": "02092017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 1-Expedia revenue rises more than expected as bookings increase "
    },
    {
        "content": "Feb 9 Online travel services company Expedia Inc  reported a 23.2 percent rise in fourth-quarter revenue  helped by higher gross bookings.",
        "date": "02092017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia revenue rises 23 pct as bookings increase "
    },
    {
        "content": "Please click on the link below for Expedia Inc's quarterly earnings press release:  Source text: http://bit.ly/2k8pz4I",
        "date": "02092017",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia Inc quarterly results press release "
    },
    {
        "content": "A former Expedia Inc computer support technician pleaded guilty on Monday to having secretly accessed senior executives' emails in order to engage in insider trading based on confidential information he stole.",
        "date": "12062016",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Ex-Expedia IT employee pleads guilty to insider trading "
    },
    {
        "content": "Trivago  the hotel search platform majority held by online travel firm Expedia Inc   filed with the U.S. regulators on Monday for an initial public offering of up to $400 million.",
        "date": "11142016",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Expedia's hotel search platform Trivago plans IPO of up to $400 million "
    },
    {
        "content": "* Liberty Expedia Holdings  Inc. reports 19.5 percent stake in Expedia Inc as of Nov. 4 - sec filing  Source text - http://bit.ly/2fstVQG Further company coverage:",
        "date": "11152016",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Liberty Expedia Holdings reports 19.5 pct stake in Expedia as of Nov. 4 "
    },
    {
        "content": "Nov 14 Trivago  the hotel search platform majority held by online travel firm Expedia Inc  filed with the U.S. regulators on Monday for an initial public offering of up to $400 million.",
        "date": "11142016",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia's hotel search platform Trivago plans IPO of up to $400 mln "
    },
    {
        "content": "* Jana Partners LLC takes sole share stake in Yahoo Inc - sec filing",
        "date": "11142016",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "BRIEF-Jana Partners takes sole share stake in Yahoo  Twitter "
    },
    {
        "content": "* Expedia Inc says it does not presently anticipate that it would sell any of its Trivago shares in any initial public offering  should it occur",
        "date": "10282016",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia comments on potential Trivago IPO "
    },
    {
        "content": "* Expedia Inc qtrly gross bookings increased $3.2 billion or 21% year-over-year to $18.6 billion",
        "date": "10272016",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia Q3 diluted EPS $1.81 "
    },
    {
        "content": "* Lone Pine Capital Reports 5.21 Pct Passive Stake In Expedia Inc As of sept 29 - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "10112016",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Lone Pine Capital reports 5.21 pct passive stake in expedia-sec filing "
    },
    {
        "content": "FRANKFURT  Oct 4 Travel booking site GoEuro has raised $70 million in a new funding round led by top Silicon Valley investors - becoming one of the few European venture-funded firms to bridge the funding gap that stops promising start-ups from later stage expansion.",
        "date": "10042016",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "GoEuro ground travel app takes fresh funds to extend reach to 30 countries "
    },
    {
        "content": "* Par Investment Partners  L.P. reports 5.2 pct passive stake in Expedia as of Sept 16  2016 - SEC filing  Source text for Eikon:  Further company coverage:",
        "date": "09262016",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Par investment reports 5.2 pct passive stake in Expedia "
    },
    {
        "content": "* Expedia  Inc. Announces consent solicitation to amend its 5.95% senior notes due 2020  Source text for Eikon:  Further company coverage:",
        "date": "09222016",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia Inc. Announces consent solicitation to amend its 5.95% senior notes due 2020 "
    },
    {
        "content": "FRANKFURT Online travel firm Expedia has picked advisors for the planned stock market listing of its Trivago travel search site  sources familiar with the matter said.",
        "date": "09152016",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Expedia picks banks for Trivago float: sources "
    },
    {
        "content": "FRANKFURT  Sept 15 Online travel firm Expedia  has picked advisors for the planned stock market listing of its Trivago travel search site  sources familiar with the matter said.",
        "date": "09152016",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia picks banks for Trivago float - sources "
    },
    {
        "content": "FRANKFURT/LONDON Online travel firm Expedia  is preparing to list its Trivago hotel search platform through an initial public offering that could value it at more than $1 billion  sources familiar with the matter said.",
        "date": "09012016",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Expedia prepares to list Trivago hotel search platform: sources "
    },
    {
        "content": "FRANKFURT/LONDON  Sept 1 Online travel firm Expedia is preparing to list its Trivago hotel search platform through an initial public offering that could value it at more than $1 billion  sources familiar with the matter said.",
        "date": "09012016",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 1-Expedia prepares to list Trivago hotel search platform - sources "
    },
    {
        "content": "FRANKFURT  Sept 1 Online travel group Expedia  has started preparations for a stock market listing of its Trivago hotel search platform  which may be valued at more than $1 billion  people familiar with the matter said.",
        "date": "09012016",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia moves ahead with listing of Trivago travel search unit -sources "
    },
    {
        "content": "Aug 4 Online travel services company Priceline Group Inc  reported a better-than-expected jump in quarterly profit as hotel bookings rose and forecast current-quarter earnings largely above estimates.",
        "date": "08042016",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 1-Priceline profit beats estimates as hotel bookings soar "
    },
    {
        "content": "Expedia Inc  reported lower-than-expected quarterly revenue due to higher promotions for its member loyalty program and discounts to promote new hotel listings  sending the company's shares down more than 6 percent in extended trading.",
        "date": "07292016",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Expedia revenue misses estimates  mulls listing for Trivago "
    },
    {
        "content": "July 28 Expedia Inc reported lower-than-expected quarterly revenue due to higher promotions for its member loyalty program and discounts to promote new hotel listings  sending the company's shares down more than 6 percent in extended trading.",
        "date": "07292016",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "CORRECTED-UPDATE 2-Expedia revenue misses estimates  mulls listing for Trivago "
    },
    {
        "content": "* Says recognized $10 million in restructuring and related reorganization charges during the three months ended June 30  2016",
        "date": "07282016",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia qtrly adjusted earnings per share $0.83 "
    },
    {
        "content": "* On June 21  2016  board expanded size of board from thirteen to fourteen members",
        "date": "06232016",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia expands size of board from 13 to 14 members "
    },
    {
        "content": "* Paulson & Co Inc Dissolves Share Stake In Abbvie Inc - Sec filing",
        "date": "05162016",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "BRIEF-Paulson & Co dissolves in Abbvie  takes in Expedia "
    },
    {
        "content": "Expedia Inc  the world's largest online travel services company by bookings  posted a surprise quarterly profit as a string of acquisitions helped boost revenue.",
        "date": "04282016",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Expedia posts surprise profit as acquisitions pay off "
    },
    {
        "content": "* Recognized $30 million in restructuring  related reorganization charges  including stock-based compensation  in three months ended march 31  2016",
        "date": "04282016",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "BRIEF-Expedia Q1 adjusted earnings per share $0.09 "
    },
    {
        "content": "April 28 Expedia Inc reported a 38.6 percent jump in quarterly revenue  helped largely by a string of acquisitions.",
        "date": "04282016",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Online travel services company Expedia's revenue jumps 38.6 pct "
    },
    {
        "content": "Expedia Inc  on Wednesday forecast a rise in 2016 earnings in part from recent acquisitions  pushing shares up even though the company warned that the Nov. 13 Paris attacks hurt travel demand and its fourth-quarter profit fell below analysts' estimates.",
        "date": "02102016",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Expedia sees earnings boost in 2016 despite demand hit from Paris attacks "
    },
    {
        "content": "Feb 10 Expedia Inc on Wednesday forecast a rise in 2016 earnings in part from recent acquisitions  pushing shares up even though the company warned that the Nov. 13 Paris attacks hurt travel demand and its fourth-quarter profit fell below analysts' estimates.",
        "date": "02102016",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 1-Expedia sees earnings boost in 2016 despite demand hit from Paris attacks "
    },
    {
        "content": "Feb 10 Expedia Inc on Wednesday posted a fourth-quarter profit below analysts' estimates  in part due to a drop in demand to travel to European cities after the Nov. 13 Paris attacks.",
        "date": "02102016",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia misses 4th-qtr profit estimates after Paris attacks "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  December 01 (Fitch) Fitch Ratings has assigned a 'BBB-' rating to  Expedia  Inc.'s (Expedia) announced issuance of senior unsecured notes. A full  list of ratings follows at the end of this release. Expedia plans to use the note proceeds for a portion of the HomeAway acquisition  and other general corporate purposes. KEY RATING DRIVERS Fitch calculates pro forma unadjusted leverage of 2.3x for the notes offering  and all three",
        "date": "12012015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Fitch Rates Expedia's Announced Senior Unsecured Notes 'BBB-' "
    },
    {
        "content": "Nov 12 John Malone's Liberty Interactive Corp  said it would spin-off its two newly-formed units  CommerceHub Inc and Liberty Expedia Holdings Inc  to holders of its Liberty Ventures Group stock.",
        "date": "11122015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Liberty Interactive to spin off CommerceHub  Liberty Expedia "
    },
    {
        "content": "Nov 12 Media mogul John Malone  known for striking complex deals and running companies with intricate structures  is restructuring two companies he controls using tracking stocks and spinoffs.",
        "date": "11122015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 2-John Malone to restructure Liberty Media  Liberty Interactive "
    },
    {
        "content": "* Priceline down 6 pct premarket  Expedia down 1.7 pct   (Adds details  updates shares)",
        "date": "11092015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "UPDATE 2-Priceline forecasts Q4 profit below estimate  shares fall "
    },
    {
        "content": "(The following statement was released by the rating agency) NEW YORK  November 05 (Fitch) Expedia  Inc.'s (EXPE) 'BBB-' Issuer Default  Rating (IDR) is not affected by the $3.9 billion acquisition of vacation  rental/alternative accommodation website HomeAway  Inc.  according to Fitch  Ratings. We expect the company's leverage to moderately exceed our 2.0x target  for the company at the 'BBB-' rating level. However  organic growth and Orbitz  and HomeAway acquisition-related synergies should all",
        "date": "11052015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Fitch: Expedia's Rating Unaffected by Acquisition of HomeAway "
    },
    {
        "content": "Expedia Inc on Wednesday said it agreed to buy vacation rental site HomeAway Inc for about $3.9 billion in cash and stock  in a move that could ramp up competition with apartment-sharing startup Airbnb.",
        "date": "11052015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia to buy HomeAway for $3.9 billion in cash  stock "
    },
    {
        "content": "Nov 4 Expedia Inc on Wednesday said it agreed to buy vacation rental site HomeAway Inc for about $3.9 billion in cash and stock  in a move that could ramp up competition with apartment-sharing startup Airbnb.",
        "date": "11052015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 2-Expedia to buy HomeAway for $3.9 bln in cash  stock "
    },
    {
        "content": "Online travel services company Expedia Inc said it agreed to buy HomeAway Inc  an online vacation rental marketplace operator  for about $3.9 billion in cash and stock.",
        "date": "11042015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Expedia to buy HomeAway for $3.9 billion in cash and stock "
    },
    {
        "content": "SAN FRANCISCO  Nov 4 Airbnb said on Wednesday it plans to form 100 home-sharing clubs in cities across the United States during 2016  seeking to organize advocates of home-and room-sharing companies to head off regulatory crackdowns.",
        "date": "11052015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 1-Airbnb to create 100 clubs to advocate for home-sharing "
    },
    {
        "content": "Nov 4 Expedia Inc on Wednesday said it agreed to buy vacation rental site HomeAway Inc for about $3.9 billion in cash and stock  in a move that could ramp up competition with apartment-sharing startup AirBnB.",
        "date": "11042015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 1-Expedia to buy HomeAway for $3.9 bln in cash  stock "
    },
    {
        "content": "Nov 4 Online travel services company Expedia Inc  said it agreed to buy HomeAway Inc  an online vacation rental marketplace operator  for about $3.9 billion in cash and stock.",
        "date": "11042015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia to buy HomeAway for $3.9 bln in cash and stock "
    },
    {
        "content": "Expedia Inc on Thursday posted a rise in third-quarter profit that beat analysts' estimates and said it now expects its takeover of Orbitz Worldwide Inc to yield greater benefits than previously anticipated.",
        "date": "10292015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Expedia third-quarter profit beats estimates  sees Orbitz deal boost "
    },
    {
        "content": "Oct 29 Expedia Inc on Thursday posted a rise in third-quarter profit that beat analysts' estimates  and said it now expects its merger with Orbitz Worldwide Inc  will generate more savings and revenue than previously anticipated.",
        "date": "10292015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia Q3 profit beats estimates  says expects more money from Orbitz deal "
    },
    {
        "content": "WASHINGTON  Sept 16 Online travel company Expedia Inc has won U.S. antitrust approval to buy rival Orbitz Worldwide Inc  the Justice Department said on Wednesday.",
        "date": "09162015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia  Orbitz win U.S. approval to merge "
    },
    {
        "content": "WASHINGTON  Sept 16 Online travel company Expedia Inc  the world's largest online travel services company by bookings  has won U.S. antitrust approval to buy rival Orbitz Worldwide Inc for $1.3 billion  the Justice Department said on Wednesday.",
        "date": "09162015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 3-Expedia  Orbitz win U.S. approval to merge "
    },
    {
        "content": "Expedia Inc  the world's largest online travel services company by bookings  said on Thursday it has completed its $1.3 billion purchase of rival Orbitz Worldwide Inc and turned its attention to integrating the two companies.",
        "date": "09172015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia begins integration of Orbitz after deal closes "
    },
    {
        "content": "Sept 17 Expedia Inc  the world's largest online travel services company by bookings  said on Thursday it has completed its $1.3 billion purchase of rival Orbitz Worldwide Inc and turned its attention to integrating the two companies.",
        "date": "09172015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 1-Expedia begins integration of Orbitz after deal closes "
    },
    {
        "content": "Sept 17 Expedia Inc  the world's largest online travel services company by bookings  said Thursday that it has completed its $1.3-billion purchase of Orbitz Worldwide Inc following U.S. antitrust approval Wednesday.",
        "date": "09172015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia completes Orbitz merger after U.S. grants antitrust approval "
    },
    {
        "content": "Priceline Group Inc  reported second-quarter profit above analysts' estimates on Wednesday  although weakness in foreign currencies against the U.S. dollar continued to weigh down results as well as its third-quarter outlook in dollar terms. | Video ",
        "date": "08052015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Priceline beats second-quarter profit estimates  sees solid third-quarter "
    },
    {
        "content": "* Indexes up: Dow 0.01 pct  S&P 0.14 pct  Nasdaq 0.40 pct   (Updates to early afternoon)",
        "date": "07312015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "US STOCKS-Wall St higher amid wage growth data  earnings "
    },
    {
        "content": "* At close: Dow down 0.03 pct  S&P flat  Nasdaq up 0.33 pct   (Updates with stock moves after the bell)",
        "date": "07302015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "US STOCKS-Wall Street ends flat; Expedia flies after the bell "
    },
    {
        "content": "* Indexes up: Dow 0.02 pct  S&P 0.13 pct  Nasdaq 0.35 pct   (Adds details  comment  updates prices)",
        "date": "07312015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "US STOCKS-Wall St edges up after wage growth data "
    },
    {
        "content": "Expedia Inc on Thursday posted a second-quarter profit above analysts' expectations and announced a larger dividend as travel bookings grow  sending its shares up more than 7 percent in after-market trade.",
        "date": "07302015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia beats Wall Street view  shares rise "
    },
    {
        "content": "July 30 Expedia Inc on Thursday posted a second-quarter profit above analysts' expectations and announced a larger dividend as travel bookings grow  sending its shares up more than 7 percent in after-market trade.",
        "date": "07302015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 1-Expedia beats Wall Street view  shares rise "
    },
    {
        "content": "* Dow down 0.33 pct  S&P down 0.09 pct  Nasdaq up 0.07 pct   (Updates to open)",
        "date": "07312015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "US STOCKS-Dow  S&P dragged down by poor earnings from Exxon  Chevron "
    },
    {
        "content": "* Futures up: Dow 2 pts  S&P 4 pts  Nasdaq 11 pts   (Adds details  comment  updates prices)",
        "date": "07312015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "US STOCKS-Wall St set to open little changed amid tepid earnings "
    },
    {
        "content": "* At close: Dow down 0.03 pct  S&P flat  Nasdaq up 0.33 pct   (Updates to close  adds comment  detail on quarterly results)",
        "date": "07302015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "US STOCKS-Wall Street ends flat; LinkedIn jumps after the bell "
    },
    {
        "content": "LONDON  July 31 European shares were expected to advance for a fourth straight session on Friday  with some forecast-beatings company results seen as underpinning positive market sentiment.",
        "date": "07312015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "European Factors to Watch-Shares seen up for 4th day  focus on earnings "
    },
    {
        "content": "LONDON  July 31 Financial spreadbetters predicted Britain's FTSE 100 to open 2 to 4 points higher  or up 0.06 percent  Germany's DAX  to gain 2 to 3 points  or almost flat in percentage terms  and France's CAC 40 to rise around 4 points  or up 0.08 percent  on Friday.",
        "date": "07312015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "European Factors to Watch-Shares head for steady open "
    },
    {
        "content": "PARIS  June 3 Accor said on Wednesday it would spend 22 million euros ($25 million) to enable independent hoteliers to offer their rooms on its booking website as it seeks ways to fight back against online travel agents such as Expedia and Booking.com.",
        "date": "06032015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Accor steps up digital push and changes name "
    },
    {
        "content": "Underlying govt bond    Over midswaps equivalent to 239.6 bps",
        "date": "05282015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "New Issue- Expedia prices 650 mln euro 2022 bond "
    },
    {
        "content": "(The following statement was released by the rating agency) AUSTIN  May 28 (Fitch) Fitch Ratings has assigned a 'BBB-' rating to Expedia   Inc.'s (Expedia) announced issuance of senior unsecured Euro notes. A full list  of ratings follows at the end of this release. Expedia plans to use the note proceeds for a portion of the Orbitz acquisition  and other general corporate purposes  which may include capital returns to  shareholders  or prefunding of the potential Trivago call option in first  qu",
        "date": "05282015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Fitch Rates Expedia's Announced Senior Unsecured Euro Notes 'BBB-' "
    },
    {
        "content": "* Indexes: Dow down 0.24 pct  S&P off 0.11 pct  Nasdaq up 0.08 pct   (Updates to early afternoon)",
        "date": "05222015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "US STOCKS-S&P  Dow dip after inflation rises; Yellen speech awaited "
    },
    {
        "content": "Expedia Inc  said it sold its entire stake in online travel company eLong Inc  to rival Ctrip.com International Ltd  and others for about $671 million  after struggling with mounting losses at the Chinese company.",
        "date": "05222015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia sells eLong stake to Ctrip  others for $671 million "
    },
    {
        "content": "May 22 Expedia Inc said it sold its entire stake in online travel company eLong Inc to rival Ctrip.com International Ltd and others for about $671 million  after struggling with mounting losses at the Chinese company.",
        "date": "05222015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 1-Expedia sells eLong stake to Ctrip  others for $671 mln "
    },
    {
        "content": "May 22 Expedia Inc said it sold its entire stake in Chinese online travel company eLong Inc  to rival Ctrip.com International Ltd and others for about $671 million.",
        "date": "05222015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia sells eLong stake to Ctrip  others for $671 mln "
    },
    {
        "content": "May 7 The Priceline Group Inc said Thursday first-quarter profit was up just slightly from a year ago  but expects growth to slow in the second quarter as weak foreign currencies relative to the U.S. dollar crimp its sales.",
        "date": "05072015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "UPDATE 2-Priceline expects slower growth in second quarter; shares drop "
    },
    {
        "content": "Expedia Inc on Thursday reported first-quarter profit that exceeded analysts' expectations as it earned more money from travel bookings in and outside the United States  despite foreign currencies falling relative to the U.S. dollar.",
        "date": "05012015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Expedia shares soar on strong bookings despite strong U.S. dollar "
    },
    {
        "content": "April 30 Expedia Inc on Thursday reported first-quarter profit that exceeded analysts' expectations as it earned more money from travel bookings in and outside the United States  despite foreign currencies falling relative to the U.S. dollar.",
        "date": "05012015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 2-Expedia shares soar on strong bookings despite strong U.S. dollar "
    },
    {
        "content": "Online travel services company Expedia Inc on Thursday affirmed earlier guidance for 2015 earnings but said it expects fierce competition for travel bookings in China to continue to produce quarterly losses for its subsidiary brand eLong Inc.",
        "date": "04302015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Expedia Inc maintains 2015 earnings guidance: CFO "
    },
    {
        "content": "April 30 Online travel services company Expedia Inc on Thursday affirmed earlier guidance for 2015 earnings but said it expects fierce competition for travel bookings in China to continue to produce quarterly losses for its subsidiary brand eLong Inc.",
        "date": "04302015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia Inc maintains 2015 earnings guidance -CFO "
    },
    {
        "content": "April 30 Expedia Inc on Thursday reported a first-quarter profit that exceeded analysts' expectations as it earned more money from people outside the United States booking travel despite currency fluctuations.",
        "date": "04302015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 1-Expedia 1st-qtr profit tops expectations "
    },
    {
        "content": "April 30 Expedia Inc on Thursday reported first-quarter profit above analysts' expectations.",
        "date": "04302015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia Inc first-quarter profit tops expectations "
    },
    {
        "content": "PARIS  April 21 France's competition watchdog said on Tuesday that in coordination with the European Commission  and Swedish and Italian regulators it had accepted sweetened commitments from online travel agent booking.com to address competition concerns.",
        "date": "04212015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "UPDATE 1-France  Sweden  Italy accept booking.com antitrust proposals "
    },
    {
        "content": "March 10 Expedia Inc said on Tuesday it will take a minority stake in Latin American online travel company Decolar.com Inc  expanding its exposure in the region.",
        "date": "03102015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia takes Decolar.com stake as it deepens Latin America ties "
    },
    {
        "content": "Feb 19 Priceline Group Inc does not view consolidation by competitors in the travel services industry as a negative but has no intention to buy another bookings site  following Expedia Inc's tentative purchase of Orbitz Worldwide Inc.",
        "date": "02192015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Priceline CEO says Expedia-Orbitz deal not a negative "
    },
    {
        "content": "Feb 13 The U.S. airline industry expressed concerns on Friday about the tentative merger of Expedia Inc  and Orbitz Worldwide Inc  saying it could hurt the travel business  but hinted it would not lobby actively against the deal.",
        "date": "02142015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "U.S. airlines  hotel industry wary of Expedia-Orbitz merger "
    },
    {
        "content": "* Indexes up: Dow 0.5 pct  S&P 0.8 pct  Nasdaq 0.9 pct   (Updates to close)",
        "date": "02122015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "US STOCKS-Wall St ends sharply higher on tech  Ukraine deal "
    },
    {
        "content": "Online travel company Expedia Inc said on Thursday that it would buy Orbitz Worldwide Inc for about $1.33 billion in cash to bring on the rival's programmers and widen its customer base.",
        "date": "02122015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Online travel agency Expedia to buy rival Orbitz for $1.33 billion "
    },
    {
        "content": "* Adds Expedia  Valeant  Enel  Sumitomo Mitsui  Centrica  BT  Fininvest",
        "date": "02122015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Feb 12 Online travel agency Expedia Inc  said it would buy rival Orbitz Worldwide for about $1.33 billion  as it looks to increase its customers base in a highly competitive industry.",
        "date": "02122015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "CORRECTED-Online travel agency Expedia to buy rival Orbitz for $1.33 bln "
    },
    {
        "content": "* Indexes up: Dow 0.5 pct  S&P 0.8 pct  Nasdaq 0.9 pct   (Updates to afternoon trading)",
        "date": "02122015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "US STOCKS-Tech rally  Ukraine deal boost Wall Street "
    },
    {
        "content": "* Indexes up: Dow 0.24 pct  S&P 0.55 pct  Nasdaq 0.68 pct   (Updates to late morning)",
        "date": "02122015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "US STOCKS-Wall St climbs on Ukraine deal  Swedish stimulus "
    },
    {
        "content": "* Indexes up: Dow 0.21 pct  S&P 0.46 pct  Nasdaq 0.65 pct   (Updates to market open  adds data)",
        "date": "02122015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "US STOCKS-Wall St rises after Ukraine deal  Swedish stimulus "
    },
    {
        "content": "NEW YORK  Feb 12 U.S. stocks were poised to open higher on Thursday  following a ceasefire agreement between Russia and Ukraine and surprising stimulus measures by Sweden's central bank  although soft economic data may keep gains in check.",
        "date": "02122015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "CORRECTED-US STOCKS-Wall St to open up after Ukraine deal  Swedish stimulus "
    },
    {
        "content": "Expedia Inc's  fourth-quarter profit fell more than 30 percent from a year ago  well below analysts' expectations  partly due to the stronger dollar and intense competition in China.",
        "date": "02062015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Expedia fourth-quarter profit misses estimates  shares slide "
    },
    {
        "content": "Feb 5 Expedia Inc on Thursday posted a fourth-quarter profit below analysts' expectations and over 30 percent lower than the same quarter a year ago  due in part to currency headwinds and heavy competition in China.",
        "date": "02052015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "RPT-UPDATE 1-Expedia 4th-qtr profit misses estimates  shares slide "
    },
    {
        "content": "Feb 12 Online travel agency Expedia Inc  said it would buy rival Orbitz Worldwide for about $1.38 billion  as it looks to increase its customers base in a highly competitive industry.",
        "date": "02122015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "CORRECTED-Online travel agency Expedia to buy rival Orbitz for $1.38 bln "
    },
    {
        "content": "Feb 5 Expedia Inc's fourth-quarter profit fell more than 30 percent from a year ago  well below analysts' expectations  partly due to the stronger dollar and intense competition in China.",
        "date": "02062015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "UPDATE 2-Expedia 4th-qtr profit misses estimates  shares slide "
    },
    {
        "content": "Expedia Inc  reported a fourth-quarter profit below analysts' expectations  due in part to currency headwinds.",
        "date": "02052015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia Inc quarterly profit falls short of estimates "
    },
    {
        "content": "Feb 5 Expedia Inc reported a fourth-quarter profit below analysts' expectations  due in part to currency headwinds.",
        "date": "02052015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia Inc quaterly profit falls short of estimates "
    },
    {
        "content": "Jan 23 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Friday:",
        "date": "01232015",
        "name": "Expedia Inc",
        "news_type": "topStory",
        "symbol": "EXPE",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Jan 23 Expedia Inc has acquired online travel agency Travelocity from technology company Sabre Corp  for $280 million in cash  the companies said in a statement on Friday  as consolidation in the online booking industry continues.",
        "date": "01232015",
        "name": "Expedia Inc",
        "news_type": "normal",
        "symbol": "EXPE",
        "title": "Expedia Inc acquires Travelocity in $280 million deal "
    }
]