[
    {
        "content": "* First American Financial reports third quarter 2017 results",
        "date": "10262017",
        "name": "First American Corporation (The)",
        "news_type": "topStory",
        "symbol": "FAF",
        "title": "BRIEF-First American Financial Q3 earnings per share $0.19 "
    },
    {
        "content": "* First American Financial Corporation increases quarterly cash dividend to 38 cents per share",
        "date": "08162017",
        "name": "First American Corporation (The)",
        "news_type": "topStory",
        "symbol": "FAF",
        "title": "BRIEF-First American Financial increases qtrly cash dividend to 38 cents per share "
    },
    {
        "content": "* First american financial reports second quarter 2017 results",
        "date": "07272017",
        "name": "First American Corporation (The)",
        "news_type": "topStory",
        "symbol": "FAF",
        "title": "BRIEF-First American Financial Q2 earnings per share $1.09 "
    },
    {
        "content": "* First American Financial reports results for the fourth quarter and full year of 2016",
        "date": "02092017",
        "name": "First American Corporation (The)",
        "news_type": "topStory",
        "symbol": "FAF",
        "title": "BRIEF-First American Financial posts Q4 earnings per share $0.73 "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  November 10 (Fitch) Fitch Ratings has affirmed the Issuer Default  Rating (IDR) of First American Financial Corporation (FAF) at 'BBB+' and the  Insurer Financial Strength (IFS) rating of the First American Title Insurance  Companies (First American) at 'A'.  See the complete list of ratings below.  The  Rating Outlook for all ratings is Stable. KEY RATING DRIVERS The rating affirmation is based on the company's strong capitali",
        "date": "11102016",
        "name": "First American Corporation (The)",
        "news_type": "topStory",
        "symbol": "FAF",
        "title": "Fitch Affirms First American Group's Ratings; Outlook Stable "
    },
    {
        "content": "* First American Financial reports third quarter 2016 results",
        "date": "10202016",
        "name": "First American Corporation (The)",
        "news_type": "topStory",
        "symbol": "FAF",
        "title": "BRIEF-First American Financial posts Q3 earnings of $0.96/share "
    },
    {
        "content": "* First American financial corp - dykema and co-chairman sandi dykema will retire following acquisition",
        "date": "10102016",
        "name": "First American Corporation (The)",
        "news_type": "topStory",
        "symbol": "FAF",
        "title": "BRIEF-First American acquires TD Service Financial Corp "
    },
    {
        "content": "* First american financial corp says redvision  will become part of first american's data and mortgage solutions division",
        "date": "09062016",
        "name": "First American Corporation (The)",
        "news_type": "topStory",
        "symbol": "FAF",
        "title": "BRIEF-First American Financial Corp to buy RedVision Systems Inc "
    },
    {
        "content": "* First American Financial Corporation increases quarterly cash dividend to 34 cents per share  Source text for Eikon:  Further company coverage:",
        "date": "08172016",
        "name": "First American Corporation (The)",
        "news_type": "topStory",
        "symbol": "FAF",
        "title": "BRIEF-First American Financial raises quarterly dividend to $0.34 per share "
    },
    {
        "content": "* First American Financial reports second quarter 2016 results",
        "date": "07212016",
        "name": "First American Corporation (The)",
        "news_type": "topStory",
        "symbol": "FAF",
        "title": "BRIEF-First American Q2 earnings per share $0.92 "
    },
    {
        "content": "* U.S. appeals court revives part of class action lawsuit against First American Financial Corp over allegations of improper dealings with title agencies-ruling",
        "date": "08242015",
        "name": "First American Corporation (The)",
        "news_type": "topStory",
        "symbol": "FAF",
        "title": "BRIEF-Appeals court revives part of class action lawsuit vs. First American "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO  June 29 (Fitch) Fitch Ratings has affirmed the Issuer Default Rating  (IDR) of First American Financial Corporation (FAF) at 'BBB+' and the Insurer  Financial Strength (IFS) rating of the First American Title Insurance Companies  (First American) at 'A'.  See the complete list of rating actions at the end of  this press release.  The Rating Outlook for all ratings is Stable. KEY RATING DRIVERS The affirmation is based on the co",
        "date": "06292015",
        "name": "First American Corporation (The)",
        "news_type": "topStory",
        "symbol": "FAF",
        "title": "Fitch Affirms First American Group's Ratings; Outlook Stable "
    }
]