[
    {
        "content": "SAO PAULO  Aug 28 Brazil's Fibria Celulose SA began wood pulp production at its Horizonte 2 project in midwestern Brazil  which will increase output by 1.95 million tonnes per year  according to a Monday securities filing.",
        "date": "08282017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazil's Fibria begins wood pulp production at Horizonte 2 "
    },
    {
        "content": "SAO PAULO  Aug 23 China Paper Holdings has joined a group of companies competing to buy control of Brazilian pulpmaker Eldorado Brasil Celulose SA  Folha de S. Paulo newspaper reported on Wednesday.",
        "date": "08232017",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "China Paper mulls $5 bln bid for Brazil's Eldorado -media "
    },
    {
        "content": "* Brazil wood pulp producer Fibria has not seen any pressure from paper producers' profit margins -executive",
        "date": "07252017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "BRIEF-Brazil's Fibria says Eldorado buy would not require share issue "
    },
    {
        "content": "SAO PAULO  July 25 Brazil's Fibria Celulose SA   the world's largest producer of eucalyptus pulp  has seen demand at the high end of forecasts this month  adding to optimism about the second half of 2017  executives said on a Tuesday conference call.",
        "date": "07252017",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "Fibria sees healthy wood pulp demand  bullish on second half "
    },
    {
        "content": "SAO PAULO  July 25 Brazil's Fibria Celulose SA   the world's largest producer of eucalyptus pulp  posted an unexpected second-quarter loss on Tuesday as a weaker currency inflated the value of its debt  but higher pulp prices and strong demand lifted revenues.",
        "date": "07252017",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "UPDATE 1-Brazil's Fibria posts unexpected Q2 loss on FX; operating profit up "
    },
    {
        "content": "SAO PAULO  July 25 Brazil's Fibria Celulose SA   the world's largest producer of eucalyptus pulp  posted a second-quarter net loss of 259 million reais ($82.4 million) on Tuesday  reversing a net profit of 745 million reais a year earlier.",
        "date": "07252017",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "Brazil's Fibria posts unexpected loss in second quarter "
    },
    {
        "content": "SAO PAULO  June 29 Brazil's Fibria SA  the world's No. 1 eucalyptus pulpmaker  denied media reports that it is analyzing an association with Chile's Empresas Copec SA unit Arauco to bid for rival Eldorado Brasil Celulose SA  it said in a securities filing on Thursday.",
        "date": "06292017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazil's Fibria denies teaming up with Chile's Copec unit for Eldorado "
    },
    {
        "content": "SAO PAULO  June 26 Brazil´s pulp company Fibria Celulose SA on Monday announced a price increase for North American and European customers starting on July 1.",
        "date": "06262017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazil's Fibria raises pulp price for North America  Europe on July 1 "
    },
    {
        "content": "SAO PAULO The board of directors of Brazil's pulp producer and exporter Fibria Celulose SA approved obtaining a revolving 1 billion-real credit facility from Banco Bradesco BBI  Fibria said in a securities filing on Friday.",
        "date": "06232017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Board of Brazil's Fibria approves borrowing revolving 1 billion real credit facility "
    },
    {
        "content": "BRASILIA  June 22 Brazil's Fibria SA  the world's No. 1 eucalyptus pulpmaker  is considering a bid for rival Eldorado Brasil Celulose SA  it said in a securities filing late on Wednesday.",
        "date": "06222017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazil's Fibria eyes bid for Eldorado Brasil -filing "
    },
    {
        "content": "SAO PAULO  June 23 The board of directors of Brazil's pulp producer and exporter Fibria Celulose SA approved obtaining a revolving 1 billion-real credit facility from Banco Bradesco BBI  Fibria said in a securities filing on Friday.",
        "date": "06232017",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "Board of Brazil's Fibria approves borrowing revolving 1 bln real credit facility "
    },
    {
        "content": "SAO PAULO Fibria SA  and two other pulp producers have hired banks to bid for rival Eldorado Brasil Celulose SA  which may go on the block after the controlling Batista family entered a plea deal in Brazil  Valor Econômico newspaper reported on Tuesday.",
        "date": "06132017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Fibria  Chile's Copec unit eye bid for Eldorado  paper says "
    },
    {
        "content": "SAO PAULO  June 13 Fibria SA and two other pulp producers have hired banks to bid for rival Eldorado Brasil Celulose SA  which may go on the block after the family that controls it entered a plea deal in Brazil  Valor Econômico newspaper reported on Tuesday.",
        "date": "06132017",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "CORRECTED-UPDATE 2-Fibria  Chile's Copec unit eye bid for Eldorado  paper says "
    },
    {
        "content": "SAO PAULO  June 13 Fibria SA and two other pulp producers have hired banks to bid for rival Eldorado Brasil Celulose SA  which may go on the block after the family that controls it entered a plea deal in Brazil  Valor Econômico newspaper reported on Tuesday.",
        "date": "06132017",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "Fibria  Chile's Arauco eye bid for Eldorado  report says "
    },
    {
        "content": "SAO PAULO  June 1 Brazilian wood pulp producer Fibria Celulose SA is not currently discussing acquiring rival Eldorado Brasil Celulose SA  focusing instead on organic growth  Chairman José Penido said on Thursday.",
        "date": "06012017",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "Brazil's Fibria not eyeing rival Eldorado  chairman says "
    },
    {
        "content": "LIMA  April 27 Workers at Brazilian group Votorantim's Cajamarquilla zinc smelter in Peru plan to start an indefinite strike on May 6  demanding a bigger share of profits and better working conditions  a union leader said on Thursday.",
        "date": "04272017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Votorantim zinc smelter workers in Peru plan strike "
    },
    {
        "content": "SAO PAULO  April 26 Brazilian wood pulp producer Fibria SA may continue hiking prices in coming months due to surprisingly strong second-quarter demand  executives told journalists on a conference call on Wednesday.",
        "date": "04262017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Fibria CEO sees room for new price hikes  cash costs falling "
    },
    {
        "content": "SAO PAULO  April 25 Fibria SA  the world's largest eucalyptus pulp producer  missed first-quarter profit estimates on Tuesday  reflecting declining output and revenues in the wake of higher unit costs.",
        "date": "04262017",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "Brazil's Fibria misses profit estimates as output  revenue fall "
    },
    {
        "content": "SAO PAULO Votorantim SA will focus on keeping debt metrics stable while completing key investment projects this year to help Brazil's largest diversified industrial conglomerate return to profit amid a challenging outlook  Chief Executive Officer João Miranda said on Thursday.",
        "date": "04062017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazil's Votorantim seeks stable debt metrics after annual loss "
    },
    {
        "content": "SAO PAULO  April 3 Brazil's Fibria Celulose SA   the world's largest eucalyptus pulpmaker  brought forward the startup date for pulp production at its Horizonte 2 project to early September  according to a Monday securities filing.",
        "date": "04032017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazil's Fibria to begin pulp production at Horizonte 2 in Sept "
    },
    {
        "content": "NEW YORK  March 31 Fibria SA  the world's largest eucalyptus pulp producer  is considering selling up to 1 billion reais ($319 million) worth of notes backed by agricultural receivables in Brazilian domestic debt markets  Chief Financial Officer Guilherme Cavalcanti said.",
        "date": "03312017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "CORRECTED-UPDATE 1-Brazil's Fibria mulls sale of local CRA notes "
    },
    {
        "content": "SAO PAULO  March 27 The board of Brazilian wood pulp producer Fibria SA has approved an 18-month share buyback plan to acquire up to 0.24 percent of its shares in circulation  according to a securities filing on Monday.   (Reporting by Brad Haynes; Editing by Daniel Flynn)",
        "date": "03272017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Board of Brazil's Fibria approves share buyback plan "
    },
    {
        "content": "NEW YORK  March 31 Fibria SA  the world's largest eucalyptus pulp producer  is considering selling up to 1 billion reais ($319 million) worth of notes backed by agricultural receivables in Brazilian domestic debt markets  Chief Executive Officer Guilherme Cavalcanti said.",
        "date": "03312017",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "Brazil's Fibria malls local CRA notes sale  CFO says "
    },
    {
        "content": "LIMA Brazilian group Votorantim has halted operations at its zinc smelter Cajamarquilla in Peru after floods and mudslides disrupted transport and restricted the availability of running water in the Andean country.",
        "date": "03232017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Votorantim says it has halted zinc smelting in Peru amid floods "
    },
    {
        "content": "LIMA  March 22 Brazilian group Votorantim has halted operations at its zinc smelter Cajamarquilla in Peru due to rains and mudslides that have disrupted transportation in the Andean country  the company said in an email on Wednesday.",
        "date": "03222017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Votorantim says it has halted zinc smelting in Peru amid floods "
    },
    {
        "content": "LIMA  March 22 Brazilian group Votorantim has halted operations at its zinc smelter Cajamarquilla in Peru after floods and mudslides disrupted transport and restricted the availability of running water in the Andean country.",
        "date": "03232017",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "UPDATE 2-Votorantim says it has halted zinc smelting in Peru amid floods "
    },
    {
        "content": "SAO PAULO  March 17 Brazil's Fibria Celulose SA   the world's largest producer of eucalyptus pulp  announced on Friday the latest in a series of price hikes as cyclical demand recovers in global markets.",
        "date": "03172017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazil's Fibria announces price hike in Europe  Asia  N. America "
    },
    {
        "content": "SAO PAULO ArcelorMittal Brasil SA and Votorantim SA said on Thursday they will merge their long steel operations in Brazil  creating a company with a combined production capacity of 5.4 million tonnes of rolled steel per year.",
        "date": "02232017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "ArcelorMittal  Votorantim to combine long steel ops in Brazil "
    },
    {
        "content": "SAO PAULO  Feb 23 ArcelorMittal Brasil SA and Votorantim SA said on Thursday they will merge their long steel operations in Brazil  creating a company with a combined production capacity of 5.4 million tonnes of rolled steel per year.",
        "date": "02232017",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "UPDATE 1-ArcelorMittal  Votorantim to combine long steel ops in Brazil "
    },
    {
        "content": "SAO PAULO  Feb 23 ArcelorMittal Brasil SA and Votorantim SA on Thursday said they will merge their long steel operations in Brazil  creating a company with combined capacity to produce 5.4 million tonnes of rolled steel per year.",
        "date": "02232017",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "ArcelorMittal  Votorantim combine long steel operations in Brazil "
    },
    {
        "content": "SAO PAULO  Jan 30 Brazil's Fibria Celulose SA   the world's largest eucalyptus pulp producer  posted a quarterly loss on Monday as weaker prices and a stronger local currency undermined its export-focused business.",
        "date": "01302017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "UPDATE 1-Brazil's Fibria posts loss on currency  wood pulp prices "
    },
    {
        "content": "SAO PAULO  Jan 30 Brazil's Fibria Celulose SA   the world's largest eucalyptus pulp producer  reported a fourth-quarter net loss of 92 million reais ($29 million) on Monday  compared to a net profit of 910 million reais a year earlier.",
        "date": "01302017",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "Brazil wood pulp producer Fibria posts quarterly loss "
    },
    {
        "content": "SAO PAULO  Jan 31 Brazil's Fibria Celulose SA   the world's largest producer of eucalyptus pulp  expects the outlook for higher global pulp prices to stretch into the second quarter of 2017  executives told journalists on an earnings call on Tuesday.",
        "date": "01312017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Fibria sees pulp prices holding on to most gains through 2017 "
    },
    {
        "content": "SAO PAULO  Jan 12 Brazilian pulpmaker Fibria Celulose SA will raise pulp prices for European  North American and Asian customers by $30 per tonne starting at Feb. 1.",
        "date": "01122017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazil's Fibria raises Asia  Europe  N. America pulp prices by $30/tn "
    },
    {
        "content": "NEW YORK  Jan 11 (IFR) - Brazilian pulp and paper company Fibria dropped controversial language on a 10-year Green bond on Wednesday amid strong investor pushback  sources told IFR.",
        "date": "01112017",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "UPDATE 3-Brazil's Fibria drops controversial covenant language "
    },
    {
        "content": "NEW YORK  Jan 11 (IFR) - Brazilian pulp and paper company Fibria has dropped controversial language on a 10-year bond amid investor pushback  sources told IFR.",
        "date": "01112017",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "Brazil's Fibria drops controversial covenant language on bond "
    },
    {
        "content": "SAO PAULO  Oct 31 Brazil's Fibria SA  the world's largest producer of eucalyptus pulp  reported third-quarter net income of 32 million reais ($10 million) on Monday  reversing a loss of 601 million reais a year earlier.",
        "date": "10312016",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazilian pulpmaker Fibria swings to profit in third quarter "
    },
    {
        "content": "* Through its horizon 2 project  Fibria is expanding its Três Lagoas facility  located in state of mato grosso do sul",
        "date": "10062016",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "BRIEF-Praxair signs long-term oxygen supply agreement with Brazilian pulp producer Fibria "
    },
    {
        "content": "SAO PAULO  Sept 29 Brazil's largest pulp producer Fibria SA said on Thursday it plans to raise its price per tonne by $20 for pulp sold on Asian markets starting Oct. 1  bringing the price for eucalyptus pulp to $530/tn.",
        "date": "09292016",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazil's Fibria to raise pulp price by $20 per tonne for Asian sales "
    },
    {
        "content": "Sept 21 Brazil wood pulp producer Fibria Celulose SA :",
        "date": "09212016",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "BRIEF-Brazil Fibria says pulp price close to production costs "
    },
    {
        "content": "SAO PAULO  Aug 29 Fibria SA  the world's largest producer of eucalyptus pulp  has completed 50 percent of the facilities included in an expansion project of the Três Lagoas processing compound  with expected start of operations slated for the end of next year.",
        "date": "08292016",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazil's Fibria says 50 pct of new Três Lagoas plan completed "
    },
    {
        "content": "SAO PAULO  July 25 Fibria SA  the world's largest producer of eucalyptus pulp  does not expect global pulp prices to rise sharply in the short term despite a clear recovery in Chinese demand for the commodity  executives said on Monday.",
        "date": "07252016",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "UPDATE 2-Fibria falls as pulp price outlook disappoints investors "
    },
    {
        "content": "SAO PAULO  July 25 Wood pulp producer Fibria SA  has put off 500 million reais ($152 million) of capital spending planned for 2016 because excess rail capacity in Brazil could make it more efficient to lease rather than invest in trains  Chief Executive Marcelo Castelli told journalists on Monday.",
        "date": "07252016",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "Brazil's Fibria delays investment due to excess rail capacity "
    },
    {
        "content": "SAO PAULO  July 25 Fibria SA  the world's largest producer of eucalyptus pulp  reported second-quarter net income of 745 million reais ($229 million) on Monday  up 21 percent from a year earlier.",
        "date": "07252016",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "Brazil's Fibria books 21 percent rise in quarterly profit "
    },
    {
        "content": "SAO PAULO  May 31 Brazil's Fibria SA  the world's largest producer of eucalyptus pulp  raised the output forecast for its Horizonte 2 plant  lifting shares to a two-month high and highlighting appetite for a rare Brazilian sector in full expansion.",
        "date": "05312016",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "UPDATE 2-Brazil's Fibria raises capacity of new wood pulp project "
    },
    {
        "content": "SAO PAULO  May 31 Brazil's Fibria SA  the world's largest producer of eucalyptus pulp  raised the estimated capacity of its new Horizonte 2 plant to 1.95 million tonnes from a forecast of 1.75 million tonnes last year.",
        "date": "05312016",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "Brazil's Fibria sees new plant producing more wood pulp "
    },
    {
        "content": "SAO PAULO  June 1 Profit at Votorantim SA rose in the first quarter as gains from asset sales and robust results at pulpmaker Fibria SA offset the impact of Brazil's recession on the nation's largest diversified industrial conglomerate.",
        "date": "06012016",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazil's Votorantim profit rises on asset sales  Fibria "
    },
    {
        "content": "SAO PAULO  April 27 Brazil's Fibria SA  expects Chinese wood pulp demand to recover this quarter  executives said on Wednesday after reporting weaker-than-expected earnings on soft sales there.",
        "date": "04272016",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "UPDATE 2-Fibria sees China demand rebounding from tough first quarter "
    },
    {
        "content": "SAO PAULO  Jan 28 Brazil's Fibria Celulose SA   the world's largest producer of eucalyptus pulp  is still seeing strong Chinese demand  supporting a strong global outlook for the market this year  executives told reporters on a Thursday earnings call.   (Reporting by Priscila Jordao and Brad Haynes; Editing by Chizu Nomiyama)",
        "date": "01282016",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazil's Fibria sees strong global 2016 outlook for wood pulp "
    },
    {
        "content": "* \u007fTo supply extensive centrifugal pump package to Fibria Celulose SA in Brazil\u007f  Source text - http://bit.ly/1OKZBIv Further company coverage:    (Gdynia Newsroom)",
        "date": "01222016",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "BRIEF-Sulzer to supply centrifugal pump package to Fibria Celulose in Brazil\u007f "
    },
    {
        "content": "BRASILIA  Dec 14 Brazilian paper and pulp maker Suzano Papel e Celulose SA is considering buying a minority stake in rival producer Fibria Celulose SA  Suzano chief executive Walter Schalka told newspaper O Estado de S. Paulo.",
        "date": "12142015",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazil's Suzano eyes minority stake in rival Fibria  Estado says "
    },
    {
        "content": "NEW YORK  Dec 2 (IFR) - Fibria is eyeing M&A options following a multi-year turnaround that has put the Brazilian pulp company firmly in high-grade territory  CEO Marcelo Castelli said in New York on Wednesday.",
        "date": "12022015",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "CORRECTED-Fibria eyes mergers after multi-year turnaround "
    },
    {
        "content": "SAO PAULO  Sept 2 Brazil's Fibria Celulose SA    the world's largest producer of eucalyptus pulp  expects its debt metrics to continue falling despite borrowing to expand its Tres Lagoas cellulose plant.",
        "date": "09022015",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazil's Fibria sees leverage falling despite plant expansion "
    },
    {
        "content": "SAO PAULO  Aug 19 Fibria SA  the world's largest producer of eucalyptus pulp  will raise its prices by $20 per tonne at the start of September  a press representative told Reuters on Wednesday.   (Reporting by Alberto Alerigi Jr.)",
        "date": "08192015",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazil's Fibria to raise wood pulp prices in September "
    },
    {
        "content": "SAO PAULO  July 23 Brazil's Fibria Celulose SA   the world's largest producer of eucalyptus pulp  on Thursday posted a second-quarter net profit of 614 million reais ($191 million)  slightly less than the 631 million reais it reported a year earlier.",
        "date": "07232015",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazil's Fibria posts lower quarterly profit  EBITDA jumps "
    },
    {
        "content": "* Hollande worried about lack of progress to December UN meeting",
        "date": "05202015",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "UPDATE 1-France's Hollande concerned about slow progress in climate talks "
    },
    {
        "content": "SAO PAULO  April 24 Brazil's Fibria Celulose SA    the world's largest producer of eucalyptus pulp  posted a first-quarter net loss of 566 million reais ($190 million)  as a weaker currency drove up the cost of servicing its dollar-denominated debts.",
        "date": "04242015",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "UPDATE 1-Brazil's Fibria posts $190 mln loss on currency swing "
    },
    {
        "content": "SAO PAULO  April 24 Brazil's Fibria Celulose SA    the world's largest producer of eucalyptus pulp  on Friday posted a first-quarter net loss of 566 million reais ($190 million)  down from a net profit of 19 million reais a year earlier.",
        "date": "04242015",
        "name": "Fibria Celulose SA",
        "news_type": "normal",
        "symbol": "FBR",
        "title": "Brazil's Fibria posts smaller-than-expected quarterly loss "
    },
    {
        "content": "SAO PAULO  March 18 Management at Fibria SA  the world's largest eucalyptus pulp producer  presented a plan to invest 8 billion reais ($2.4 billion) in the Três Lagoas plant to board members ahead of the expected June deadline  Valor Econômico newspaper reported on Wednesday.",
        "date": "03182015",
        "name": "Fibria Celulose SA",
        "news_type": "topStory",
        "symbol": "FBR",
        "title": "Brazil's Fibria to speed up $2.4 bln project  Valor says "
    }
]