[
    {
        "content": "* Carl Icahn cuts shared share stake in Freeport-Mcmoran Inc by 15.8 percent to 77.16 million Class B shares - SEC filing",
        "date": "11142017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Carl Icahn cuts shared share stake in Freeport-Mcmoran "
    },
    {
        "content": "TIMIKA  Indonesia  Nov 14 The Indonesian unit of Freeport-McMoRan Inc closed the main access road to its giant copper mine in the eastern province of Papua on Tuesday for the second time in three days after another shooting incident.",
        "date": "11142017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Freeport Indonesia closes mine access road again after shooting "
    },
    {
        "content": "TIMIKA  Indonesia A fire broke out at the main port used by copper miner Freeport-McMoRan Inc in Papua  Indonesia  on Thursday night  the company said.",
        "date": "11172017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Fire hits Freeport Indonesia port facility in Papua "
    },
    {
        "content": "TIMIKA  Indonesia The Indonesian unit of Freeport-McMoRan Inc closed the main access road to its giant copper mine in the eastern province of Papua on Tuesday for the second time in three days after another shooting incident.",
        "date": "11142017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport Indonesia closes mine access road again after shooting "
    },
    {
        "content": "TIMIKA  Indonesia  Nov 14 The Indonesian unit of Freeport-McMoRan Inc has closed the main access road to the giant Grasberg copper mine after a shooting incident on Tuesday morning in the Papuan highlands where the mine is situated.",
        "date": "11142017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport closes access road at Indonesia's Grasberg mine after shooting "
    },
    {
        "content": "TIMIKA  Indonesia  Nov 17 A fire broke out at the main port used by copper miner Freeport-McMoRan Inc in Papua  Indonesia  on Thursday night  the company said.",
        "date": "11172017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Fire hits Freeport Indonesia port facility in Papua "
    },
    {
        "content": "* Freeport-McMoRan announces redemption of two series of senior notes",
        "date": "11092017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-McMoRan announces redemption of two series of senior notes "
    },
    {
        "content": "TORONTO/VANCOUVER Freeport-McMoRan Inc is encouraged by talks to finalize an agreement for its massive Grasberg copper and gold mine in Indonesia this year  though it has not made as much progress as hoped  Chief Executive Richard Adkerson said on Wednesday.",
        "date": "10252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport CEO sees some progress in mine deal talks with Indonesia "
    },
    {
        "content": "TORONTO/VANCOUVER  Oct 25 Freeport-McMoRan Inc is encouraged by talks to finalize an agreement for its massive Grasberg copper and gold mine in Indonesia this year  though it has not made as much progress as hoped  Chief Executive Richard Adkerson said on Wednesday.",
        "date": "10252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 3-Freeport CEO sees some progress in mine deal talks with Indonesia "
    },
    {
        "content": "* Has made \"not as much progress as I had hoped for\" in talks since framework agreement announced in August - CEO Source text for Eikon: Further company coverage: (Reporting by Susan Taylor)",
        "date": "10252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport CEO says has not made as much Indonesia progress as hoped "
    },
    {
        "content": "* Freeport sees \"significant\" deficits for copper in future  Chief Executive Richard Adkerson",
        "date": "10252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport  Indonesia \"highly motivated\" on Grasberg deal "
    },
    {
        "content": "* Freeport-McMoRan reports third-quarter and nine-month 2017 results",
        "date": "10252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-McMoRan reports Q3 earnings per share $0.19 "
    },
    {
        "content": "TORONTO  Oct 25 Freeport-McMoRan Inc  the world's second largest publicly-listed copper miner by valuation  reported an increase in third-quarter adjusted profits on Wednesday  buoyed by a big jump in copper prices.",
        "date": "10252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport reports bigger third-quarter profit "
    },
    {
        "content": "JAKARTA  Oct 3 Miners operating in Indonesia will have to pay a share of their after-tax profits to both the central and local governments under new tax rules under consideration for next year  according to documents outlining the proposal reviewed by Reuters.",
        "date": "10032017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesia may require miners to pay share of after-tax profit under proposed rules "
    },
    {
        "content": "JAKARTA  Oct 6 Indonesian President Joko Widodo called for faster progress to wrap up a deal with Freeport-McMoRan Inc on rights to the giant Grasberg copper mine  which the U.S. firm owns  officials said on Friday.",
        "date": "10062017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesia president urges action on Freeport mine deal "
    },
    {
        "content": "JAKARTA/TORONTO Freeport-McMoRan Inc  the world's second-largest publicly traded copper company  strongly disagrees with a proposed divestment plan by the government of Indonesia  according to a company letter reviewed by Reuters on Friday.",
        "date": "09292017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport at loggerheads with Indonesia over divestment: letter "
    },
    {
        "content": "JAKARTA/TORONTO  Sept 29 Freeport-McMoRan Inc   the world's second-largest publicly traded copper company  strongly disagrees with a proposed divestment plan by the government of Indonesia  according to a company letter reviewed by Reuters on Friday.",
        "date": "09292017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport at loggerheads with Indonesia over divestment -letter "
    },
    {
        "content": "Indonesia and Freeport-McMoRan Inc  announced this week a \"framework agreement\" on a long-term plan to allow the U.S. miner to continue operating its giant Grasberg copper mine in the eastern province of Papua.",
        "date": "08302017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Factbox: Next steps for Indonesia  Freeport under deal for Grasberg mine "
    },
    {
        "content": "* Freeport says makes \"major concession\" on divestment  smelter",
        "date": "08302017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "RPT-UPDATE 5-Freeport  Indonesia to end years of wrangling over mining rights "
    },
    {
        "content": "JAKARTA Indonesia on Tuesday agreed to let Freeport-McMoRan Inc keep operating its giant Grasberg copper mine  after the U.S. company said it would cede control of its Indonesian unit  ending years of wrangling.",
        "date": "08302017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport  Indonesia to end years of wrangling over mining rights "
    },
    {
        "content": "* Freeport says makes \"major concession\" on divestment  smelter (Adds analyst comment; updates shares)",
        "date": "08292017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 5-Freeport  Indonesia to end years of wrangling over mining rights "
    },
    {
        "content": "* Olin declares Force Majeure for product shipments from Freeport  Texas",
        "date": "08312017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Olin declares Force Majeure for product shipments from Freeport  Texas "
    },
    {
        "content": "* Freeport-McMoRan announces framework for agreement with indonesian government regarding long-term operating rights for PT Freeport Indonesia",
        "date": "08292017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-McMoRan announces framework for agreement with Indonesian government regarding long-term operating rights for PT Freeport Indonesia "
    },
    {
        "content": "JAKARTA Indonesia's government left no doubts as to who it believes got the better deal in its landmark agreement with Freeport McMoRan Inc on the future of the Grasberg copper mine.",
        "date": "08312017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesia cheers Freeport 'win' as Grasberg valuation fight looms "
    },
    {
        "content": "SYDNEY  Aug 29 Chinese nickel futures led most base metals higher on Tuesday  helped by a resurgent market for steel.",
        "date": "08292017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "METALS-Nickel leads most Chinese metals higher "
    },
    {
        "content": "* Freeport valued Grasberg mine at $16.2 bln (Adds comment from Indonesian minister in paragraph 12  updates share prices)",
        "date": "08312017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Indonesia cheers Freeport \"win\" as Grasberg valuation fight looms "
    },
    {
        "content": "JAKARTA  Aug 30 Indonesia's government left no doubts as to who it believes got the better deal in its landmark agreement with Freeport McMoRan Inc on the future of the Grasberg copper mine.",
        "date": "08312017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "CORRECTED-UPDATE 1-Indonesia cheers Freeport \"win\" as Grasberg valuation fight looms "
    },
    {
        "content": "JAKARTA  Aug 30 Indonesia's government left no doubts as to who it believes got the better deal in its landmark agreement with Freeport McMoRan Inc on the future of the Grasberg copper mine.",
        "date": "08312017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "CORRECTED-Indonesia cheers Freeport \"win\" as Grasberg valuation fight looms "
    },
    {
        "content": "JAKARTA Indonesia expects to strike an agreement this month to allow  Freeport McMoRan Inc to keep operating its huge copper mine in Papua in the coming decades  the country's mining and energy minister said on Tuesday.",
        "date": "08232017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Indonesian Energy Minister Jonan expects mining deal with Freeport this month "
    },
    {
        "content": "The United States Coast Guard on Wednesday said the ports of Houston  Texas City  Galveston and Freeport have been reopened with restrictions on vessel traffic after they were closed due to storm Harvey.",
        "date": "08312017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "U.S. Coast Guard reopens some Texas ports with restrictions "
    },
    {
        "content": "    MELBOURNE  Aug 23 London metals slipped on Wednesday as the dollar stood tall ahead of a meeting of global central bankers at Jackson Hole in the United States later in the week.           FUNDAMENTALS     * LONDON COPPER: London Metal Exchange copper had slipped 0.6 percent to $6 542 a tonne by 0216 GMT  after ending little changed in the previous session  when prices touched their highest since November 2014 at $6 649 a tonne.      * SHANGHAI COPPER: Shanghai Futures Exchange c",
        "date": "08232017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "METALS-London metals consolidate on stronger dollar ahead of Jackson Hole "
    },
    {
        "content": "Aug 30 The United States Coast Guard on Wednesday said the ports of Houston  Texas City  Galveston and Freeport have been reopened with restrictions on vessel traffic after they were closed due to storm Harvey.",
        "date": "08312017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-U.S. Coast Guard reopens some Texas ports with restrictions "
    },
    {
        "content": "* Freeport-McMoRan announces redemption of five series of senior notes",
        "date": "08182017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-McMoRan announces redemption of five series of senior notes "
    },
    {
        "content": "JAKARTA IndustriALL Global Union  a federation of labour unions  said the Indonesian unit of copper miner Freeport McMoRan Inc and metal smelter PT Smelting had treated \"fired\" workers \"inhumanely and with contempt\"  urging both to reinstate staff and contractors.",
        "date": "08112017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Union federation accuses Freeport of treating 'fired' Indonesia mine workers 'with contempt' "
    },
    {
        "content": "* Union group says Freeport treated \"fired\" workers \"inhumanely\"",
        "date": "08112017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Union federation accuses Freeport of treating 'fired' Indonesia mine workers 'with contempt' "
    },
    {
        "content": "JAKARTA  Aug 11 IndustriALL Global Union  a federation of global workers unions  said on Friday that the Indonesian unit of copper miner Freeport McMoRan Inc and copper smelter PT Smelting treated \"fired\" workers \"inhumanely and with contempt\"  urging both to reinstate the workers.",
        "date": "08112017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Union federation accuses copper miner Freeport of treating 'fired' workers 'with contempt' "
    },
    {
        "content": "* Cox oil offshore purchases majority interest in Gulf of Mexico fields from Freeport-McMoran",
        "date": "08012017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Cox Oil Offshore purchases majority interest in Gulf of Mexico fields from Freeport-McMoran "
    },
    {
        "content": "JAKARTA Indonesia is closer to a deal with Freeport McMoRan Inc on its long-term future in the country  but key issues still need to be resolved before the U.S. miner gets a new operating permit for its huge copper mine  a mining ministry official said.",
        "date": "07262017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Indonesia closer to mining deal with Freeport  but hurdles remain "
    },
    {
        "content": "TORONTO Freeport-McMoRan Inc shares jumped to a 16-month high on Tuesday  as soaring metal prices and progress in a long-running  costly permit dispute with Indonesia buoyed the world's biggest publicly traded copper miner.",
        "date": "07252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport stock soars 15 percent on copper prices  permit progress "
    },
    {
        "content": "JAKARTA  July 26 Indonesia is closer to a deal with Freeport McMoRan Inc on its long-term future in the country  but key issues still need to be resolved before the U.S. miner gets a new operating permit for its huge copper mine  a mining ministry official said.",
        "date": "07262017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Indonesia closer to mining deal with Freeport  but hurdles remain "
    },
    {
        "content": "TORONTO  July 25 Freeport-McMoRan Inc shares jumped to a 16-month high on Tuesday  as soaring metal prices and progress in a long-running  costly permit dispute with Indonesia buoyed the world's biggest publicly traded copper miner.",
        "date": "07252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 3-Freeport stock soars 15 pct on copper prices  permit progress "
    },
    {
        "content": "JAKARTA  July 26 Indonesia has reached an agreement with U.S. miner Freeport McMoRan Inc that any new operating permit for its Grasberg copper mine will only be valid until 2021  an energy and mining ministry official said on Wednesday.",
        "date": "07262017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesia  Freeport agree on term of new copper mine permit -official "
    },
    {
        "content": "* Contract talks with Indonesia \"very active\"  \"mutual sense of optimism\" agreement can be reached -CEO Richard Adkerson",
        "date": "07252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport sees mining deal with Indonesia  but challenges -CEO "
    },
    {
        "content": "* Freeport-McMoRan reports second-quarter and six-month 2017 results",
        "date": "07252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-McMoRan reports Q2 adj. EPS $0.17; copper sales of 942 mln pounds "
    },
    {
        "content": "TORONTO  July 25 Freeport-McMoRan Inc reported a second-quarter adjusted profit on Tuesday and said it was encouraged by recent progress in talks with Indonesia to resolve a lengthy permit dispute for its massive Grasberg mine.",
        "date": "07252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Miner Freeport posts profit  \"encouraged\" by Indonesia talks "
    },
    {
        "content": "* Freeport negotiating new mining permit with govt (Recasts on Freeport Indonesia comment  adds background)",
        "date": "06222017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport Indonesia says giant copper mine running as normal despite strike "
    },
    {
        "content": "* Noted certain media report regarding company giving up its acquisition of copper-cobalt mine from Freeport-Mcmoran Inc",
        "date": "06152017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-China Molybdenum Co says acquisition of copper-cobalt mine from Freeport-Mcmoran has been completed "
    },
    {
        "content": "* Fibrocell receives rare pediatric disease designation from FDA for FCX-013 for treatment of localized scleroderma",
        "date": "06122017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Fibrocell receives rare pediatric disease designation from FDA for FCX-013 "
    },
    {
        "content": "TORONTO  June 14 Freeport-McMoRan Inc  the world's biggest publicly traded copper miner  and China Molybdenum Co Ltd (CMOC) have agreed to terminate discussions on CMOC's acquisition of Freeport's cobalt assets  Freeport said on Wednesday.",
        "date": "06142017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport  China Moly agree to end talks on cobalt assets "
    },
    {
        "content": "TORONTO  June 9 Activist investor Carl Icahn reduced his stake in Freeport-McMoRan Inc  the world's biggest publicly traded copper miner  to 6.33 percent as of June 6  from 7.2 percent in late November  according to a regulatory filing on Friday.",
        "date": "06092017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Activist Icahn reduces stake in miner Freeport-McMoRan "
    },
    {
        "content": "* Carl Icahn reports 6.33 percent stake in Freeport-McMoran Inc as of June 6 versus 7.20 percent stake as of Nov 23  2016 - sec filing Source text - http://bit.ly/2rV6OTl Further company coverage:",
        "date": "06092017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Carl Icahn cuts Freeport-McMoran stake to 6.33 pct from 7.20 pct "
    },
    {
        "content": "TORONTO Freeport-McMoRan Inc  the world's largest publicly traded copper miner  is \"on a path\" to get a new mining deal with Indonesia this year for its giant Grasberg mine  Chief Financial Officer Kathleen Quirk said on Thursday.",
        "date": "06092017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport 'on path' to new Indonesia mine deal this year  CFO says "
    },
    {
        "content": "TORONTO  June 9 Freeport-McMoRan Inc  the world's largest publicly traded copper miner  is \"on a path\" to get a new mining deal with Indonesia this year for its giant Grasberg mine  Chief Financial Officer Kathleen Quirk said on Thursday.",
        "date": "06092017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 3-Freeport 'on path' to new Indonesia mine deal this year  CFO says "
    },
    {
        "content": "TORONTO Freeport McMoRan Inc said Thursday that mining and milling rates at its Grasberg mine in Papua  Indonesia have been affected by an extended strike  and a \"large number\" of approximately 4 000 absentee workers were deemed to have resigned.",
        "date": "05252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Strike impacts Freeport's Grasberg mine  workers 'resigned' "
    },
    {
        "content": "TORONTO  May 25 Freeport McMoRan Inc said Thursday that mining and milling rates at its Grasberg mine in Papua  Indonesia have been affected by an extended strike  and a \"large number\" of approximately 4 000 absentee workers were deemed to have resigned.",
        "date": "05252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Strike impacts Freeport's Grasberg mine  workers 'resigned' "
    },
    {
        "content": "JAKARTA/TIMIKA  Indonesia An estimated 9 000 workers at the giant Grasberg copper mine operated by the Indonesian unit of Freeport McMoRan Inc will extend a strike for a second month  a union official said on Saturday  in an ongoing dispute over employment terms and layoffs.",
        "date": "05202017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Thousands of Freeport Indonesia workers to strike for second month: union "
    },
    {
        "content": "* Union says layoffs breach Indonesian labour law (Adds comment from Freeport  context)",
        "date": "05202017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Thousands of Freeport Indonesia workers to strike for second month -union "
    },
    {
        "content": "* \"For copper  chinese demand remains strong; europe   north america showing steady improvement\" - CEO",
        "date": "05162017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-McMoRan CEO says copper demand from China remains strong "
    },
    {
        "content": "SYDNEY  May 5 London copper edged higher on Friday after a second session of losses  but remained vulnerable to further sell downs amid concerns about rising inventories and weakening consumption.",
        "date": "05052017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "METALS-Copper edges up after overnight loss  still vulnerable "
    },
    {
        "content": "JAKARTA  May 4 Indonesian authorities on Thursday kicked off negotiations with Freeport McMoran Inc. over a contract dispute that has prompted the U.S. mining giant to scale down operations in the eastern province of Papua.",
        "date": "05042017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesia and U.S. miner Freeport start contract negotiations "
    },
    {
        "content": "TOKYO/SEOUL/JAKARTA  April 26 Freeport McMoRan Inc is preparing three copper concentrate export shipments from its giant Grasberg mine in Indonesia after a 15-week outage  sources with direct knowledge of the matter said.",
        "date": "04262017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport readies first Grasberg copper exports after 15-week halt "
    },
    {
        "content": "TORONTO Freeport-McMoRan Inc missed earnings expectations  cut its outlook and warned on Tuesday it would be difficult to secure a long-term Indonesian mining permit  but investors sent its stock soaring on relief over a temporary export resumption.",
        "date": "04262017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport results miss mark; investors cheer temporary exports "
    },
    {
        "content": "TORONTO  April 25 Freeport-McMoRan Inc missed earnings expectations  cut its outlook and warned on Tuesday it would be difficult to secure a long-term Indonesian mining permit  but investors sent its stock soaring on relief over a temporary export resumption.",
        "date": "04252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 2-Freeport results miss mark; investors cheer temporary exports "
    },
    {
        "content": "* Workers concerned over future employment amid contract dispute (Recasts with permit granted  adds comments on Pence  trade ministry comment)",
        "date": "04222017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport collects export permit after Pence visit "
    },
    {
        "content": "* CEO Richard Adkerson's total compensation for 2016 was about $16 million versus $8.6 million in 2015 - SEC filing",
        "date": "04252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-McMoRan reports CEO Richard Adkerson's total compensation for 2016 of about $16 mln "
    },
    {
        "content": "* Workers concerned over future employment amid contract dispute",
        "date": "04222017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "REFILE-Freeport warns Indonesia copper mine workers as Grasberg strike looms "
    },
    {
        "content": "JAKARTA  April 20 Indonesian workers at American mining giant Freeport McMoran Inc. will stage a month-long protest starting May 1 against layoffs  as the company ramps down production in the midst of a contract dispute with the Indonesian government.",
        "date": "04202017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport Indonesia workers plan month-long protest against layoffs "
    },
    {
        "content": "* CEO Richard Adkerson says capital spending at Indonesia's Grasberg mine slowed by about one-third in first quarter  now spending about $40 million each month on Grasberg block cave",
        "date": "04252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-McMoRan slows Grasberg development spend-CEO "
    },
    {
        "content": "TORONTO  April 25 Freeport-McMoRan Inc  the world's biggest publicly listed copper miner  reported first-quarter results on Tuesday that reflected a months-long Indonesian export ban at its massive Grasberg mine  which clipped sales.",
        "date": "04252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Miner Freeport's sales take hit from Indonesia export ban "
    },
    {
        "content": "* Q1 earnings per share view $0.19 -- Thomson Reuters I/B/E/S",
        "date": "04252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-McMoran posts Q1 earnings per share $0.16 "
    },
    {
        "content": "JAKARTA Freeport McMoRan Inc has received preliminary approval to resume copper concentrate exports from its Indonesian operation and hopes to lodge an application for an export permit this week  a company spokesman said.",
        "date": "04182017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport Indonesia has initial approval to resume copper exports: spokesman "
    },
    {
        "content": "* Northisle Copper and Gold Inc - Will now be raising up to $1.5 million by way of non-brokered private placements Source text for Eikon: Further company coverage:",
        "date": "04072017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Northisle Copper and Gold amends private placements "
    },
    {
        "content": "SANTIAGO Freeport McMoRan Inc is awaiting final details on a temporary export permit in Indonesia  which would end a 12-week ban that has cost the world's biggest publicly traded copper company nearly $1 billion in lost revenues  its top executives told Reuters in an interview on Wednesday.",
        "date": "04052017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport awaits permit to end costly Indonesia export ban: executives "
    },
    {
        "content": "SANTIAGO  April 5 Freeport McMoRan Inc is awaiting final details on a temporary export permit in Indonesia  which would end a 12-week ban that has cost the world's biggest publicly traded copper company nearly $1 billion in lost revenues  its top executives told Reuters in an interview on Wednesday.",
        "date": "04052017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Freeport awaits permit to end costly Indonesia export ban -execs "
    },
    {
        "content": "SANTIAGO  April 5 Freeport McMoRan Inc is awaiting final details on a temporary export permit in Indonesia  which would end a 12-week ban that has cost the world's biggest publicly traded copper company nearly $1 billion in lost revenues  its top executives told Reuters in an interview on Wednesday.",
        "date": "04052017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport awaits permit to end costly Indonesia export ban -execs "
    },
    {
        "content": "JAKARTA Indonesia is trying a new approach to ease a deadlock over mining rights  promising to allow Freeport McMoRan Inc to resume concentrate exports from its Grasberg mine  the world's second-biggest copper mine.",
        "date": "04052017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesia dials down heat in Freeport talks as temporary deal looms "
    },
    {
        "content": "JAKARTA  April 5 Indonesia is trying a new approach to ease a deadlock over mining rights  promising to allow Freeport McMoRan Inc to resume concentrate exports from its Grasberg mine  the world's second-biggest copper mine.",
        "date": "04052017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 3-Indonesia dials down heat in Freeport talks as temporary deal looms "
    },
    {
        "content": "SANTIAGO After a tumultuous period of falling copper prices and heavy cuts to its investment plans  Chile's Codelco has stabilized and its levels of debt and spending will likely stay steady in coming years  its chairman told Reuters on Tuesday.",
        "date": "04042017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Chile's Codelco sees copper prices stable  investment steady "
    },
    {
        "content": "JAKARTA/TORONTO Freeport McMoRan Inc's Indonesian unit is close to reaching a deal that would allow the world's biggest publicly listed copper producer to temporarily resume concentrate exports  Indonesia's mining minister said on Thursday.",
        "date": "03312017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport near deal allowing Indonesia exports: minister "
    },
    {
        "content": "LIMA Workers at Peru's biggest copper mine  Freeport-McMoRan Inc's Cerro Verde  will resume work on Friday after voting to end a nearly three-week strike that had halved output  the union said on Thursday.",
        "date": "03302017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Workers to end strike at Peru's top copper mine Cerro Verde "
    },
    {
        "content": " (Adds detail  updates prices)     By Melanie Burton     MELBOURNE  March 31 London copper slipped on Friday but was set to finish a second quarter higher lifted by kinks in mine supply  while a ramp-up in China's factory activity and fresh investor buys are expected to drive prices higher in the April quarter.      Activity in China's manufacturing sector unexpectedly expanded at the fastest pace in nearly five years in March  adding to evidence that the world's second-largest econo",
        "date": "03312017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "METALS-Copper eyes second quarterly gain as supplies shrink "
    },
    {
        "content": "MELBOURNE  March 31 London copper slipped on Friday but was set to finish a second quarter higher lifted by kinks in mine supply  while a ramp-up in factory activity and fresh investor buys are expected to drive prices higher in the second quarter.",
        "date": "03312017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "METALS-Copper eyes second quarterly gain as supplies dwindle "
    },
    {
        "content": "LIMA  March 30 Workers at Peru's biggest copper mine  Freeport-McMoRan Inc's Cerro Verde  will resume work on Friday after voting to end a nearly three-week strike that had halved output  the union said on Thursday.",
        "date": "03302017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Workers to end strike at Peru's top copper mine Cerro Verde "
    },
    {
        "content": "JAKARTA/TORONTO  March 30 Freeport McMoRan Inc's Indonesian unit is close to reaching a deal that would allow the world's biggest publicly listed copper producer to temporarily resume concentrate exports  Indonesia's mining minister said on Thursday.",
        "date": "03302017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Freeport near deal allowing Indonesia exports -minister "
    },
    {
        "content": "LIMA  March 23 Freeport-McMoRan Inc said Thursday that a nearly two-week strike has not materially impacted production levels at its Cerro Verde copper mine in Peru  the country's biggest  though the union said output has been cut in half.",
        "date": "03232017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoRan sees no material impact on output from Peru strike "
    },
    {
        "content": "* Europe shares hit two-week low  Asia biggest fall since Dec 15",
        "date": "03222017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "GLOBAL MARKETS-Trump tax cut doubts hit stocks  lift yen vs dollar "
    },
    {
        "content": "JAKARTA  March 21 Freeport McMoRan Inc's Indonesian unit has resumed production of copper concentrate at its giant Grasberg mine  a spokesman told Reuters on Tuesday  ending a more than one-month stoppage.",
        "date": "03212017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport Indonesia resumes copper concentrate production "
    },
    {
        "content": "MELBOURNE  March 15 London copper marked time on Wednesday ahead of the outcome of a U.S. Federal Reserve meeting that is expected to dictate direction in the dollar  with dissipating concerns over mine supply dragging on prices for the metal.",
        "date": "03152017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "METALS-London copper marks time ahead of Fed outcome "
    },
    {
        "content": "LIMA  March 13 A strike at Peru's biggest copper mine  Freeport-McMoRan Inc's Cerro Verde  stretched into its fourth day after a meeting between the union and management failed to resolve a dispute over labor demands  a union official said on Monday.",
        "date": "03132017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 1-Strike at Peru's top copper mine in 4th day   output at 50 pct -union "
    },
    {
        "content": "LIMA  March 13 A strike at Peru's biggest copper mine  Freeport-McMoRan Inc's Cerro Verde  continued on Monday after a meeting between the union and management failed to solve a dispute over labor demands  a union official said on Monday.",
        "date": "03132017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Strike at Peru's top copper mine continues  output at 50 pct -union "
    },
    {
        "content": "LIMA  March 10 Workers at Freeport-McMoRan's  Cerro Verde started an indefinite strike on Friday that halted output of about 40 000 tonnes per month at Peru's top copper mine  a union official said on Friday.",
        "date": "03102017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "CORRECTED-UPDATE 2-Strike halts output at top Peru copper mine Cerro Verde -union "
    },
    {
        "content": "LIMA  March 14 A strike at Peru's top copper mine  Cerro Verde  may end next week if the labor ministry declares it illegal  the head of the union said on Tuesday after negotiations with owner Freeport-McMoRan Inc ended without an agreement on labor demands.",
        "date": "03142017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 1-Cerro Verde strike may end next week if Peru rules against it "
    },
    {
        "content": "LIMA  March 14 An ongoing strike at Peru's top copper mine  Cerro Verde  may end next week if the labor ministry declares it illegal  the head of the union said on Tuesday after negotiations with owner Freeport-McMoRan Inc  ended without an agreement on labor demands.",
        "date": "03142017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Cerro Verde strike may end next week if Peru rules against it "
    },
    {
        "content": "* Investors look to Trump speech for clarity on economic policy",
        "date": "02282017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "METALS-Copper slips  attention shifts to Trump speech "
    },
    {
        "content": "HOLLYWOOD  Fla.  Feb 27 Shareholders are pressuring miner Freeport-McMoRan Inc to stand up to the Indonesian government over changes the Southeast Asian country wants to make in the U.S. miner's contract  Freeport's chief executive officer said on Monday.",
        "date": "02272017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 2-Shareholders tell miner Freeport to get tough with Indonesia "
    },
    {
        "content": "HOLLYWOOD  Fla.  Feb 27 Shareholders are pressuring miner Freeport-McMoRan to stand up to the Indonesian government over changes the southeast Asian country wants to make to the U.S. miner's contract of work  Freeport's chief executive said on Monday.",
        "date": "02272017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Shareholders want miner Freeport to get tough with Indonesia - CEO "
    },
    {
        "content": "Feb 24 U.S. mining giant Freeport-McMoRan Inc  warned this week that it could take the Indonesian government to arbitration and seek damages over a contractual dispute that has halted operations at the world's second-biggest copper mine.",
        "date": "02272017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "RPT-Q&A-How Freeport's row over its Indonesian mining contract has escalated "
    },
    {
        "content": "Feb 24 U.S. mining giant Freeport-McMoRan Inc  warned this week that it could take the Indonesian government to arbitration and seek damages over a contractual dispute that has halted operations at the world's second-biggest copper mine.",
        "date": "02242017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Q&A-How Freeport's row over its Indonesian mining contract has escalated "
    },
    {
        "content": "JAKARTA U.S. mining giant Freeport-McMoRan Inc  warned on Monday it could take the Indonesian government to arbitration and seek damages over a contractual dispute that has halted operations at the world's second-biggest copper mine.",
        "date": "02202017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport warns of arbitration as Indonesia mining dispute escalates "
    },
    {
        "content": "JAKARTA Indonesia's mining minister Ignasius Jonan on Monday said the government can also bring Freeport-McMoRan Inc  to arbitration if both sides fail to reach an agreement over a mining contract.",
        "date": "02202017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesia mining minister says government also has right to bring Freeport to arbitration "
    },
    {
        "content": "* Freeport Indonesia unit lays off about 10 pct of expat workforce",
        "date": "02202017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 4-Freeport warns of arbitration as Indonesia mining dispute escalates "
    },
    {
        "content": "* Freeport-McMoran updates status of PT Freeport Indonesia operations",
        "date": "02202017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-McMoran updates status of PT Freeport Indonesia operations "
    },
    {
        "content": "JAKARTA  Feb 20 Freeport McMoRan Inc's chief executive said on Monday the company's Indonesian unit has made its first lay-offs since a dispute over its mining contract started with the Indonesian government and may let go of more workers this week.",
        "date": "02202017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport CEO says Indonesian unit has begun laying off workers "
    },
    {
        "content": "JAKARTA  Feb 20 Freeport-McMoRan Inc's Indonesian unit has submitted a notification to Indonesia's mining ministry describing breaches and violations of its contract of work by the government  the company said on Monday.",
        "date": "02202017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport Indonesia has notified mining ministry of govt violations of contract -statement "
    },
    {
        "content": "JAKARTA  Feb 18 Chappy Hakim  the chief executive of Freeport-McMoran Inc's Indonesian unit  has resigned  the firm said in a statement on Saturday  after its parent company declared force majeure on copper concentrate shipments from its giant Grasberg mine in Papua.",
        "date": "02182017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport Indonesia CEO resigns after force majeure on copper exports "
    },
    {
        "content": "TORONTO Freeport-McMoRan Inc said on Friday it cannot meet contractual obligations for copper concentrate shipments from its Grasberg mine in Indonesia following a five-week export ban  the second big producer in a week to declare force majeure.",
        "date": "02172017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport declares force majeure at Indonesia copper mine "
    },
    {
        "content": "TORONTO  Feb 17 Freeport-McMoRan Inc said on Friday it cannot meet contractual obligations for copper concentrate shipments from its Grasberg mine in Indonesia following a five-week export ban  the second big producer in a week to declare force majeure.",
        "date": "02172017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 3-Freeport declares force majeure at Indonesia copper mine "
    },
    {
        "content": "TORONTO  Feb 17 Freeport-McMoRan Inc  the world's biggest publicly traded copper miner  has declared force majeure at its Grasberg mine in Indonesia  which cannot meet contractual obligations on copper concentrate shipments  a spokesman told Reuters on Friday",
        "date": "02172017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport declares force majeure on Indonesia mine -spokesman "
    },
    {
        "content": "TORONTO  Feb 17 Freeport-McMoRan Inc has declared force majeure on \"nearby deliveries\" of copper concentrate from its suspended Grasberg mine in Indonesia  Metal Bulletin reported on Friday  citing unnamed sources.",
        "date": "02172017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport declares force majeure on Grasberg contracts -Metal Bulletin "
    },
    {
        "content": "* Carl Icahn ups shared share stake in Herbalife Ltd by 14.7 percent to 22.5 million shares - SEC filing",
        "date": "02142017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Carl Icahn ups shared share stake in Herbalife  cuts in Freeport "
    },
    {
        "content": "JAKARTA Indonesia's mining ministry recommended on Friday that Freeport-McMoran Inc's Indonesian unit be granted a permit to export 1.1 million tonnes of copper concentrates until Feb. 16  2018  the ministry said in a statement.",
        "date": "02172017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesia gives Freeport green light to resume copper exports "
    },
    {
        "content": "JAKARTA  Feb 17 Indonesia's mining ministry said on Friday it has issued a recommendation that is expected to allow the local unit of Freeport McMoRan Inc to resume copper concentrate exports within days.",
        "date": "02172017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesian ministry backs Freeport's copper concentrate exports "
    },
    {
        "content": "JAKARTA  Feb 9 Rio Tinto  is considering walking away from its interest in the giant Grasberg copper mine operated by Freeport McMoRan Inc in Indonesia  The Australian newspaper reported on Thursday  citing the mining giant's chief executive.",
        "date": "02092017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Rio Tinto considers exiting interest in Freeport Indonesia mine -The Australian "
    },
    {
        "content": "JAKARTA/TORONTO Freeport-McMoRan Inc said on Friday that an export ban remains in place at its copper mine in Indonesia  the world's second-biggest  because it has not yet reached agreement with the government on a new mining permit.",
        "date": "02102017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport says no deal with Indonesia  export ban remains "
    },
    {
        "content": "JAKARTA/TORONTO  Feb 10 Freeport-McMoRan Inc  said on Friday that an export ban remains in place at its copper mine in Indonesia  the world's second-biggest  because it has not yet reached agreement with the government on a new mining permit.",
        "date": "02102017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 3-Freeport says no deal with Indonesia  export ban remains "
    },
    {
        "content": "TORONTO  Feb 10 Freeport-McMoRan Inc  the world's biggest publicly-listed copper miner  said on Friday that it has not reached an agreement with Indonesia on a new permit for its Grasberg mine and copper concentrate exports remain restricted.",
        "date": "02102017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport says Indonesia export restrictions remain  no new permit "
    },
    {
        "content": "JAKARTA  Feb 8 Freeport-McMoRan Inc said it will scale back activities at its Indonesian copper mine  an official at Indonesia's main copper smelter  PT Smelting  said on Wednesday  amid a worker strike and other issues.",
        "date": "02082017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Indonesia Freeport to reduce mining activities -smelter official "
    },
    {
        "content": "JAKARTA  Feb 10 Indonesia has issued new mining permits to the local unit of copper miner Freeport McMoRan Inc  and Medco Energi Internasional unit Amman Mineral Nusa Tenggara  an official at the country's mining ministry said on Friday.",
        "date": "02102017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesia issues new mining permits to Freeport  Amman -official "
    },
    {
        "content": "TORONTO Freeport-McMoRan Inc  the world's biggest publicly-listed copper miner  said on Friday it will cut staff  spending and production in Indonesia if it does not get a new export permit by mid-February  amplifying a warning it made last week.",
        "date": "02032017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport warns of cuts as it awaits Indonesian export permit "
    },
    {
        "content": "TORONTO  Feb 3 Freeport-McMoRan Inc  the world's biggest publicly-listed copper miner  said on Friday it will cut staff  spending and production in Indonesia if it does not get a new export permit by mid-February  amplifying a warning it made last week.",
        "date": "02032017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 3-Freeport warns of cuts as it awaits Indonesian export permit "
    },
    {
        "content": "* Freeport-McMoran updates status of pt freeport indonesia operations",
        "date": "02032017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport to cut Indonesia operations if export approval delayed "
    },
    {
        "content": "JAKARTA Indonesia will temporarily exempt the local unit of Freeport-McMoRan Inc from some new rules while processing its application for new mining rights  a ministry official said  potentially allowing for the resumption of copper concentrate exports.",
        "date": "01312017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Indonesia to temporarily exempt Freeport from some new mining rules: official "
    },
    {
        "content": "JAKARTA  Jan 31 Indonesia will temporarily exempt the local unit of Freeport-McMoRan Inc from some new rules while processing its application for new mining rights  a ministry official said  potentially allowing for the resumption of copper concentrate exports.",
        "date": "01312017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "CORRECTED-Indonesia to temporarily exempt Freeport from some new mining rules-official "
    },
    {
        "content": "LIMA  Jan 30 Copper output at Freeport-McMoRan Inc's Cerro Verde mine in southern Peru might be temporarily affected by heavy rains that have blocked roads in the region  the company's local unit said on Monday.",
        "date": "01302017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Rain in Peru may affect copper output at Cerro Verde -Freeport "
    },
    {
        "content": "* Moody's says Indonesia's new mining regulations credit negative for FCX",
        "date": "01272017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Moody's says Indonesia's new mining regulations credit negative for FCX "
    },
    {
        "content": "Freeport-McMoRan Inc   the world's biggest publicly-listed copper miner  warned on Wednesday that it would need to start slashing output and jobs at its Indonesia mine by mid-February if it fails to get an export permit from the government.",
        "date": "01252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport-McMoRan shares slump on earnings miss  Indonesia woes "
    },
    {
        "content": "KINSHASA Freeport-McMoRan Inc  paid $33 million to resolve claims brought against it by Congo state miner Gecamines over the sale of its majority stake in the Tenke copper mine to China Molybdenum Co Ltd (CMOC)   it said in a statement.",
        "date": "01262017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport-McMoRan paid Congo's Gecamines $33 million to settle Tenke dispute "
    },
    {
        "content": "Jan 25 Freeport-McMoRan Inc  the world's biggest publicly-listed copper miner  warned on Wednesday that it would need to start slashing output and jobs at its Indonesia mine by mid-February if it fails to get an export permit from the government.",
        "date": "01252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 3-Freeport-McMoRan shares slump on earnings miss  Indonesia woes "
    },
    {
        "content": "KINSHASA  Jan 26 Freeport-McMoRan Inc  paid $33 million to resolve claims brought against it by Congo state miner Gecamines over the sale of its majority stake in the Tenke copper mine to China Molybdenum Co Ltd (CMOC)  it said in a statement.",
        "date": "01262017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport-McMoRan paid Congo's Gecamines $33 mln to settle Tenke dispute "
    },
    {
        "content": "Jan 25     * Better Demand  Low Inventories And Future Deficits Point To \"Bright Future\" For Copper - Freeport-mcmoran CEO Richard Adkerson says",
        "date": "01252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport Indonesia mine would need to cut output by mid-Feb if no export license - CEO "
    },
    {
        "content": "KINSHASA  Jan 22 China Molybdenum Co Ltd (CMOC)  said on Sunday it had signed an agreement with Chinese private equity firm BHR to support BHR's acquisition of a 24 percent stake in Democratic Republic of Congo's massive Tenke copper mine.",
        "date": "01222017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-China Moly to help BHR acquire stake in Congo's Tenke copper mine "
    },
    {
        "content": "KINSHASA  Jan 26 Freeport-McMoRan Inc  paid $33 million to resolve claims brought against it by Congo state miner Gecamines over the sale of its majority stake in the Tenke copper mine to China Molybdenum Co Ltd (CMOC)  it said in a statement.",
        "date": "01262017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoRan paid Congo's Gecamines $33 mln to settle Tenke dispute "
    },
    {
        "content": "JAKARTA Indonesia's Papua province  home of the giant Grasberg copper mine operated by the local unit of Freeport McMoRan Inc   said it has won a court battle in a claim against the company for 2.51 trillion rupiah ($188 million) in outstanding surface water taxes.",
        "date": "01252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesian provincial government says Freeport loses $188 million tax appeal "
    },
    {
        "content": "JAKARTA  Jan 26 Mining giant Freeport McMoRan Inc said its Indonesian unit  facing $469 million in water taxes and penalties in Papua province dating back to 2011  will contest a ruling by a local tax court that rejected its lawsuit on the matter.",
        "date": "01262017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport says it will challenge $469m Indonesia water tax case "
    },
    {
        "content": "* Freeport-McMoran reports fourth-quarter and year ended December 31  2016 results  Source text for Eikon:  Further company coverage:",
        "date": "01252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-McMoran reports Q4 and year ended Dec 31  2016 results "
    },
    {
        "content": "JAKARTA  Jan 20 The Indonesian unit of Freeport-Mcmoran Inc is seeking fiscal and legal guarantees from the government over mining rules issued last week  a spokesman for the copper mining giant said late on Thursday.",
        "date": "01202017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "RPT-UPDATE 1-Freeport seeks guarantees from Indonesia amid mining shake-up "
    },
    {
        "content": "Jan 25 Diversified U.S. miner Freeport-McMoRan Inc reported a fourth-quarter profit  compared with a year-ago loss  when it recorded $4.1 billion in one-time charges.",
        "date": "01252017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoran reports quarterly profit vs. year-earlier loss "
    },
    {
        "content": "* Miners looking to restart metal ore exports   (Recasts; adds comment  detail)",
        "date": "01202017",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport seeks guarantees from Indonesia amid mining shake-up "
    },
    {
        "content": "JAKARTA  Jan 13 Broad changes to mining rules issued by Indonesia on Thursday will have many impacts  a spokesman for the Indonesian unit of Freeport-McMoRan Inc  said on Friday  noting that the company was still studying the new rules.",
        "date": "01132017",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport says new Indonesia mining rules have 'many impacts' "
    },
    {
        "content": "JAKARTA Chappy Hakim  a retired air force chief who says he knows next to nothing about mining  now heads Indonesia's biggest copper producer  entrusted to use his connections to guide it through regulatory uncertainty to a renewed contract for its mine.",
        "date": "12162016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "High-flying Freeport CEO steers towards new Indonesia mining deal "
    },
    {
        "content": "TORONTO Freeport-McMoRan Inc  the world's largest publicly listed copper producer  said on Wednesday it raised $1.5 billion in an equity offering  completing its plan to reduce debt with proceeds from asset sales and new equity.",
        "date": "11232016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport says debt repair plan complete with $1.5 billion offering "
    },
    {
        "content": "TORONTO  Nov 23 Freeport-McMoRan Inc  the world's largest publicly listed copper producer  said on Wednesday it raised $1.5 billion in an equity offering  completing its plan to reduce debt with proceeds from asset sales and new equity.",
        "date": "11232016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport says debt repair plan complete with $1.5 bln offering "
    },
    {
        "content": "JAKARTA  Nov 23 The Indonesian subsidiary of Freeport McMoRan Inc hopes to sell a 10.64 percent stake through an initial public offering  its incoming chief executive said on Wednesday.",
        "date": "11232016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport Indonesia hopes to sell 10.64 pct stake through IPO - new CEO "
    },
    {
        "content": "KINSHASA A landslide killed at least 13 people last week in southeastern Democratic Republic of Congo after thousands of artisanal miners began invading a copper mine controlled by Freeport-McMoRan Inc  the provincial governor said on Monday.",
        "date": "11212016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Landslide kills 13 as diggers invade Freeport mine in Congo: governor "
    },
    {
        "content": "KINSHASA  Nov 21 A landslide killed at least 13 people last week in southeastern Democratic Republic of Congo after thousands of artisanal miners began invading a copper mine controlled by Freeport-McMoRan Inc  the provincial governor said on Monday.",
        "date": "11212016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Landslide kills 13 as diggers invade Freeport mine in Congo -governor "
    },
    {
        "content": "HAMBURG  Nov 18 Aurubis  Europe's biggest copper smelter  said on Thursday that annual copper ore treatment and refining charges for 2017 reportedly agreed between Jiangxi Copper and Freeport McMoRan are \"too low\".",
        "date": "11182016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "CORRECTED-UPDATE 1-Aurubis says 2017 copper treatment charges are too low "
    },
    {
        "content": "* Freeport-Mcmoran completes sale of interest in TF Holdings Limited for $2.65 billion in cash  Source text for Eikon:  Further company coverage:",
        "date": "11162016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-McMoran completes sale of interest in Tf Holdings for $2.65 bln "
    },
    {
        "content": "* Inventories down 30 pct from 2016 peak   (Adds closing prices)",
        "date": "11172016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "METALS-Copper rises on speculative trades  inventories trend lower "
    },
    {
        "content": "LIMA  Nov 16 Freeport-McMoRan Inc is in talks with the Democratic Republic of Congo's state miner Gecamines to resolve its opposition to Freeport's $2.65 billion sale of its majority stake in the Tenke copper mine  chief executive Richard Adkerson said in an interview on Wednesday.",
        "date": "11162016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport confident Tenke sale will close by year-end - CEO "
    },
    {
        "content": "HAMBURG  Nov 17 Aurubis  Europe's biggest copper smelter  said on Thursday the reported agreement between Jiangxi Copper and Freeport McMoRan for annual copper ore treatment and refining charges for 2017 is \"too low\".",
        "date": "11172016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Aurubis says 2017 copper treatment charges are too low "
    },
    {
        "content": "DAKAR Congo state miner Gecamines said on Wednesday it is \"strongly opposed\" to a decision by Lundin Mining  to sell a 24 percent stake in the Tenke copper mine to a Chinese private equity firm  arguing it has a preemptive right to buy the stake.",
        "date": "11162016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Gecamines 'strongly opposed' to Lundin's Tenke mine stake sale "
    },
    {
        "content": "SHANGHAI Diversified miner Freeport-Mcmoran Inc has secured a 5 percent drop in charges it will pay China's biggest copper smelter Jiangxi Copper to process its concentrate for 2017  people familiar with the matter said  in a deal that will set the benchmark for the region.",
        "date": "11172016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport  Jiangxi Copper agree $92.50/T  9.25 cents/lb TCRCS for 2017: sources "
    },
    {
        "content": "DAKAR  Nov 16 Congo state miner Gecamines said on Wednesday it is \"strongly opposed\" to a decision by Lundin Mining to sell a 24 percent stake in the Tenke copper mine to a Chinese private equity firm  arguing it has a preemptive right to buy the stake.",
        "date": "11162016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Gecamines 'strongly opposed' to Lundin's Tenke mine stake sale "
    },
    {
        "content": "* Accord seen setting benchmark for region   (Adds sourcing  details on talks)",
        "date": "11172016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport  Jiangxi Copper agree $92.50/T  9.25 cents/lb TCRCS for 2017 -sources "
    },
    {
        "content": "SHANGHAI  Nov 17 Miner Freeport-Mcmoran Inc  has agreed to a 5 percent drop in charges that it will pay China smelter Jiangxi Copper to process its concentrate into refined copper for 2017  a person familiar with the matter told Reuters.",
        "date": "11172016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport  Jiangxi Copper agree $92.50/T  9.25 cents/lb TCRCS for 2017 -source "
    },
    {
        "content": "* update on the acquisition of freeport-mcmoran inc.'s copper and cobalt businesses",
        "date": "11162016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-China Molybdenum Co updates on acquisition of Freeport-Mcmoran's copper & cobalt businesses "
    },
    {
        "content": "LIMA/TORONTO Freeport-McMoRan Inc  said on Wednesday it had wrapped up the $2.65 billion sale of its stake in the Democratic Republic of Congo's Tenke mine  and the company's chief executive said he hopes negotiations will ease objections of Congo's state miner to the deal.",
        "date": "11172016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport closes Congo mine sale; Trump appointees keenly awaited "
    },
    {
        "content": "LIMA/TORONTO  Nov 16 Freeport-McMoRan Inc  said on Wednesday it had wrapped up the $2.65 billion sale of its stake in the Democratic Republic of Congo's Tenke mine  and the company's chief executive said he hopes negotiations will ease objections of Congo's state miner to the deal.",
        "date": "11172016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Freeport closes Congo mine sale; Trump appointees keenly awaited "
    },
    {
        "content": "Nov 15 Canada's Lundin Mining Corp is hopeful that the sale of its stake in the Tenke Fungurume copper-cobalt mine in the Democratic Republic of Congo will not be challenged by the country's state-owned miner  Lundin's chief executive said on Tuesday.",
        "date": "11152016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 1-Lundin Mining hopeful of Congo blessing for mine stake sale "
    },
    {
        "content": "KOBE  Japan  Nov 15 Diversified U.S. miner Freeport-McMoRan Inc expects treatment and refining charges for copper concentrates (TC/RCs) to be flat or slightly lower in 2017 compared to this year with supply and demand largely balanced  a senior executive said.",
        "date": "11152016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport sees 2017 copper TC/RCs flat to lower amid balanced market "
    },
    {
        "content": "* Lundin Mining-consideration to be received by company equal to implied value of co's stake in TF Holdings based on deal between Freeport-Mcmoran Inc",
        "date": "11152016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Lundin Mining agrees to sell interest in TF Holdings for $1.136 bln "
    },
    {
        "content": "KINSHASA  Nov 1 The prime minister of Democratic Republic of Congo said on Tuesday that Freeport McMoRan's  sale of its majority stake in the Tenke copper project to China Molybdenum should be swiftly concluded despite objections from state miner Gecamines.",
        "date": "11012016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 2-Congo PM urges swift sale of Freeport's Tenke mine stake "
    },
    {
        "content": "KINSHASA  Nov 1 The prime minister of Democratic Republic of Congo said on Tuesday that Freeport McMoRan's  sale of its majority stake in the Tenke copper project to China Molybdenum should be swiftly concluded despite objections from state miner Gecamines.",
        "date": "11012016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Congo PM urges swift conclusion of Freeport's Tenke mine stake sale "
    },
    {
        "content": "KINSHASA  Oct 27 Democratic Republic of Congo's mines minister said on Thursday that the government \"salutes and supports\" China Molybdenum Co's bid to buy Freeport McMoRan's majority stake in the giant Tenke copper project despite objections from state miner Gecamines.",
        "date": "10272016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 1-Congo gov't supports Freeport sale of Tenke copper mine - minister "
    },
    {
        "content": "* CEO says Congo state miner Gecamines' claim of pre-emptive rights on Tenke mine has no legal basis",
        "date": "10252016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Freeport does not expect to sell more mining assets - CEO "
    },
    {
        "content": "Diversified U.S. miner Freeport-McMoRan Inc  reported a weaker-than-expected quarterly profit and said it expects to sell less gold  copper and molybdenum this year.",
        "date": "10252016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Miner Freeport-McMoRan cuts sales forecast for 2016 "
    },
    {
        "content": "Oct 25 Diversified U.S. miner Freeport-McMoRan Inc reported a weaker-than-expected quarterly profit and said it expects to sell less gold  copper and molybdenum this year.",
        "date": "10252016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "REFILE-UPDATE 1-Miner Freeport-McMoRan cuts sales forecast for 2016 "
    },
    {
        "content": "* Freeport-Mcmoran reports third-quarter and nine-month 2016 results",
        "date": "10252016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-Mcmoran expects capex of $2.8 bln in 2016 "
    },
    {
        "content": "Oct 25 Diversified U.S. miner Freeport-McMoRan Inc swung to a profit after seven quarters of losses  helped by cost cutting and asset sales to combat a weakened commodity market.",
        "date": "10252016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Miner Freeport-McMoRan returns to profit after nearly 2 years "
    },
    {
        "content": "KINSHASA  Oct 19 Democratic Republic of Congo state miner Gecamines has challenged Freeport McMoRan Inc's  sale of its majority stake in the country's Tenke copper mine at the International Court of Arbitration in Paris  Gecamines said on Wednesday.",
        "date": "10192016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 1-Congo miner challenges Freeport sale of Tenke mine in international court "
    },
    {
        "content": "KINSHASA  Oct 19 Democratic Republic of Congo state miner Gecamines has challenged Freeport McMoRan Inc's  sale of its majority stake in the Tenke copper mine at the International Court of Arbitration in Paris  Gecamines said on Wednesday.",
        "date": "10192016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Congo miner challenges Freeport sale of Tenke mine in international court "
    },
    {
        "content": "TORONTO  Oct 14 Freeport-McMoRan said on Friday it will sell onshore California oil and gas assets to Sentinel Peak Resources California for up to $742 million  part of a push by the world's biggest listed copper miner to reduce its multi-billion dollar debt.",
        "date": "10142016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 3-Freeport to sell California energy assets for up to $742 mln "
    },
    {
        "content": "* Capital Research Global Investors discloses 10.5 percent passive stake in Freeport-McMoRan Inc as of  September 30 - SEC filing  Source text - (http://bit.ly/2dGLxHM) Further company coverage:",
        "date": "10112016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Capital Research Global Investors reports 10.5 pct passive stake in Freeport-McMoRan - SEC filing "
    },
    {
        "content": "Oct 14 Freeport-McMoRan Inc  the world's biggest publicly listed copper miner  said it would sell its onshore California oil and gas assets to Sentinel Peak Resources California LLC for up to $742 million  as part of its strategy to cut debt.",
        "date": "10142016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoRan to sell some oil and gas assets for up to $742 mln "
    },
    {
        "content": "* Co to sell its onshore California Oil And Gas Properties to Sentinel Peak Resources California Llc",
        "date": "10142016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-McMoran to sell onshore California Oil & Gas properties for $742 mln "
    },
    {
        "content": "JAKARTA  Oct 10 Mining operations at Freeport-McMoRan Inc.'s giant Grasberg open pit site in the Indonesian province of Papua \"have returned to normal\" after resolution of a labour dispute  the company said on Monday.",
        "date": "10102016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport reaches deal with workers to end Indonesia copper mine stoppage "
    },
    {
        "content": "* Sentinel Peak Resources announces the acquisition of Freeport-McMoran's onshore California assets for $742 million",
        "date": "10142016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Sentinel Peak reports acquisition of Freeport-McMoran's onshore California assets "
    },
    {
        "content": "* Freeport-Mcmoran announces extension of consent solicitations",
        "date": "09232016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-Mcmoran announces extension of consent solicitations "
    },
    {
        "content": "TORONTO  Sept 15 Canadian base metals miner Lundin Mining Corp has won a two week extension until Sept. 29 to bid on Freeport-McMoRan Inc's stake in the Tenke Fungurume copper and cobalt mine  Lundin said in a statement on Thursday.",
        "date": "09152016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Lundin gets second bid extension on Freeport Congo mine stake "
    },
    {
        "content": "Sept 13 Freeport-McMoRan Inc : Source text for Eikon:  Further company coverage: ",
        "date": "09132016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Moody's says Freeport's sale of its GOM oil & gas properties is credit positive "
    },
    {
        "content": "* Lundin mining receives further extension of TF Holdings offer period",
        "date": "09152016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Lundin Mining receives further extension of TF Holdings offer period "
    },
    {
        "content": "Sept 13 Activist investor Carl Icahn  the third-largest shareholder in Freeport McMoran Inc  said on Tuesday he endorsed the U.S. miner's efforts to reduce debt and explore strategic alternatives.",
        "date": "09132016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Icahn endorses Freeport's efforts to reduce debt  explore options "
    },
    {
        "content": "Freeport McMoRan Inc said on Monday it will sell its deepwater Gulf of Mexico oil and natural gas assets to Anadarko Petroleum Corp for $2 billion as it looks to cut its heavy debt load.",
        "date": "09122016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport to sell U.S. Gulf assets to Anadarko for $2 billion "
    },
    {
        "content": "Sept 12 Freeport McMoRan Inc said on Monday it will sell its deepwater Gulf of Mexico oil and natural gas assets to Anadarko Petroleum Corp for $2 billion as it looks to cut its heavy debt load.",
        "date": "09122016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Freeport to sell U.S. Gulf assets to Anadarko for $2 bln "
    },
    {
        "content": "* Freeport-McMoRan - if Anadarko deal is terminated by either co  terminating party entitled to either specific performance or $100 million termination fee  Source text (http://bit.ly/2cgb1gR) Further company coverage:",
        "date": "09122016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-McMoRan - If Anadarko deal is terminated by either co  terminating party entitled to either specific performance or $100 mln termination fee "
    },
    {
        "content": "* Freeport-Mcmoran announces agreement to sell its deepwater Gulf Of Mexico properties",
        "date": "09122016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-Mcmoran to sell its deepwater gulf of mexico assets to Anadarko for $2 bln "
    },
    {
        "content": "Sept 12 Anadarko Petroleum Corp said it agreed to buy deepwater Gulf of Mexico assets of Freeport McMoRan Inc's oil and gas unit for $2 billion.",
        "date": "09122016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Anadarko to buy Freeport's U.S. Gulf assets for $2 billion "
    },
    {
        "content": "KINSHASA  Sept 7 The Democratic Republic of Congo's state mining company Gecamines said on Wednesday it has submitted an offer to buy Freeport McMoRan Inc's  majority stake in the Tenke copper project.",
        "date": "09072016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 1-Congo state miner submits offer for Freeport's Tenke copper project "
    },
    {
        "content": "KINSHASA  Sept 7 Democratic Republic of Congo's state mining company Gecamines has submitted an offer to buy Freeport McMoRan Inc's majority stake in the Tenke copper project  Gecamines' interim director-general Jacques Kamenga told Reuters on Wednesday.",
        "date": "09072016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Congo state miner submits offer for Freeport's Tenke copper project "
    },
    {
        "content": "SANTIAGO  Aug 30 Chile's El Abra copper mine  controlled by Freeport-McMoran Inc  said on Tuesday that a worker died after an accident at its acid unloading terminal  forcing a halt to some operations.",
        "date": "08302016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Worker dies at Freeport El Abra copper mine; some operations halted "
    },
    {
        "content": "JAKARTA Indonesia's mining ministry recommended on Tuesday that Freeport-McMoran Inc's Indonesian unit be granted a new permit to export copper concentrates until Jan. 11  2017  an official said.",
        "date": "08092016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Indonesian ministry recommends renewing Freeport export permit "
    },
    {
        "content": "JAKARTA  Aug 9 Indonesia's mining ministry recommended on Tuesday that Freeport-McMoran Inc's  Indonesian unit be granted a new permit to export copper concentrates until Jan. 11  2017  an official said.",
        "date": "08092016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Indonesian ministry recommends renewing Freeport export permit "
    },
    {
        "content": "JAKARTA  Aug 9 Freeport-McMoRan Inc has not yet received an extension to its Indonesian copper export permit  which expired on Monday  but hopes the government will issue one soon  a company spokesman said on Tuesday.",
        "date": "08092016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport hopes will soon get Indonesia copper export extension "
    },
    {
        "content": "JAKARTA  Aug 8 Indonesia's mining ministry has not yet decided whether to extend Freeport-McMoRan Inc's  permit to export copper from the giant Grasberg copper mine  a government official told Reuters on Monday.",
        "date": "08082016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "As deadline nears  Indonesia yet to decide on Freeport copper export extension "
    },
    {
        "content": "July 27 Rig contractor Noble Corp Plc  reported a 12.8 percent rise in quarterly revenue  helped by a $379 million gain due a settlement after Freeport-McMoRan Inc  canceled a contract.",
        "date": "07272016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Noble Corp revenue rises 13 pct on gain from Freeport settlement "
    },
    {
        "content": "Freeport-McMoRan Inc   the world's biggest publicly listed copper miner  put its high-profile asset sales plan on the rear burner on Tuesday  and instead unveiled a $1.5 billion share issue to help it cut debt.",
        "date": "07262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport-McMoRan takes foot off gas on asset sales  to issue shares "
    },
    {
        "content": "July 27 Rig contractor Noble Corp Plc  reported a lower-than-expected quarterly profit and lowered its 2016 capital expenditure as oil producers reduced spending to weather a prolonged slump in crude prices.",
        "date": "07272016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Noble Corp reports disappointing profit  lowers capex "
    },
    {
        "content": "July 26 Freeport-McMoRan Inc  the world's biggest publicly listed copper miner  put its high-profile asset sales plan on the rear burner on Tuesday  and instead unveiled a $1.5 billion share issue to help it cut debt.",
        "date": "07262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 4-Freeport-McMoRan takes foot off gas on asset sales  to issue shares "
    },
    {
        "content": "* CEO says won't start spending money on big capital projects until the market justifies it",
        "date": "07262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-McMoRan has 'turned corner ' may not need to sell more assets-CEO "
    },
    {
        "content": "* Q2 earnings per share view $-0.01 -- Thomson Reuters I/B/E/S",
        "date": "07262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-McMoRan reports Q2 adjusted loss per share $0.02 "
    },
    {
        "content": "July 26 Diversified U.S. miner and oil producer Freeport-McMoRan Inc reported a smaller quarterly loss as aggressive cost cutting helped counter a near 20 percent drop in copper prices.",
        "date": "07262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Miner Freeport-McMoRan reports smaller quarterly loss "
    },
    {
        "content": "* Co  Freeport-McMoran  China Molybdenum agreed to extend period in which co has right to buy Freeport's indirect interest in TF Holdings Ltd",
        "date": "07192016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Lundin Mining receives extension of TF Holdings offer period "
    },
    {
        "content": "July 19 Lundin Mining Corp has been granted an extension until Sept. 15 to make a bid for Freeport-McMoRan Inc's stake in the Tenke Fungurume mine in the Democratic Republic of Congo  Lundin said on Tuesday. The previous deadline was Aug. 8.",
        "date": "07192016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Lundin Mining gets extension to bid on Freeport's Congo mine stake "
    },
    {
        "content": "After years of support for companies that hand board seats to activists to avoid a bruising public fight  some of the world's largest institutional investors are pushing back.     BlackRock Inc  the world's largest asset manager  and Norges Bank Investment Management  Norway's $872 billion sovereign wealth fund are among the major funds resisting  encouraging companies to consult them before responding to an activist.",
        "date": "07182016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Big funds push back against activist investor settlements "
    },
    {
        "content": "* To extend current stage 2 of Freeport Nevada's option to acquire interest in Yerington copper project in Nevada for up to 2 yrs",
        "date": "06132016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Quaterra Resources reaches agreement with Freeport-Mcmoran Nevada "
    },
    {
        "content": "* Effective June 8  board amended  restated laws to eliminate office of chairman structure  Source text: (http://1.usa.gov/24DKng6 ) Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "06092016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-McMoRan amends  restates laws to eliminate office of chairman structure "
    },
    {
        "content": "U.S. miner Freeport-McMoRan Inc  will consider a \"broad spectrum\" of asset sales and has attracted interest from parties wanting to buy a stake in a grouping of its assets  Chief Financial Officer Kathleen Quirk said on Wednesday.",
        "date": "06082016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport says buyers eager for a stake in its assets "
    },
    {
        "content": "June 8 U.S. miner Freeport-McMoRan Inc  will consider a \"broad spectrum\" of asset sales and has attracted interest from parties wanting to buy a stake in a grouping of its assets  Chief Financial Officer Kathleen Quirk said on Wednesday.",
        "date": "06082016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Freeport says buyers eager for a stake in its assets "
    },
    {
        "content": "China's Citic Metal Co is in talks with Freeport-McMoRan Inc  to buy a minority stake in the miner's North and South American operations  Bloomberg reported  citing people familiar with the matter.",
        "date": "05272016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Citic Metal in talks to buy Freeport Americas stake: Bloomberg "
    },
    {
        "content": "May 27 China's Citic Metal Co is in talks with Freeport-McMoRan Inc to buy a minority stake in the miner's North and South American operations  Bloomberg reported  citing people familiar with the matter.",
        "date": "05272016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Citic Metal in talks to buy Freeport Americas stake - Bloomberg "
    },
    {
        "content": "May 20 Freeport-McMoRan Inc's oil and gas business filed on Friday to withdraw its initial public offering amid a prolonged slump in oil prices.",
        "date": "05202016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport's oil and gas business scraps IPO "
    },
    {
        "content": "May 20 Freeport-McMoRan Inc's oil and gas business has withdrawn its initial public offering as weak oil prices dent valuations of oil producers.",
        "date": "05202016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport's oil and gas business scraps IPO "
    },
    {
        "content": "* On may 16  Noble Drilling (U.S.) LLC entered into a distribution agreement with Freeport-Mcmoran Inc - SEC filing",
        "date": "05182016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Noble Corp enters distribution agreement with Freeport-Mcmoran Inc - SEC filing "
    },
    {
        "content": "KINSHASA  May 24 The Chinese company buying Freeport McMoRan Inc's majority stake in the Tenke copper mine has told the Congolese government that Freeport staff will oversee the operation for a  transitional period of 12 to 18 months  an adviser to the prime minister said on Tuesday.",
        "date": "05242016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport staff to oversee transition at Tenke copper mine in Congo "
    },
    {
        "content": "KINSHASA Democratic Republic of Congo's mines minister said on Friday that he suspects Freeport-McMoRan Inc is hiding the true value of the sale of its majority stake in the Tenke copper project and should pay taxes on the deal.",
        "date": "05132016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport may be hiding value of Congo Tenke mine sale: minister "
    },
    {
        "content": "SANTIAGO  May 14 Codelco  the world's biggest copper exporter  has received many approaches over the sale of mining assets  including Freeport's El Abra stake  chairman Oscar Landerretche said in an interview published on Saturday.",
        "date": "05142016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Codelco approached over El Abra  other sales -chairman "
    },
    {
        "content": "KINSHASA  May 13 Democratic Republic of Congo's mines minister said on Friday that he suspects Freeport-McMoRan Inc is hiding the true value of the sale of its majority stake in the Tenke copper project and should pay taxes on the deal.",
        "date": "05132016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Freeport may be hiding value of Congo Tenke mine sale - minister "
    },
    {
        "content": "KINSHASA  May 13 Democratic Republic of Congo's mines minister said on Friday that he suspects Freeport-McMoRan Inc is hiding the true value of the sale of its majority stake in the Tenke copper project  adding that the company should pay taxes on the deal.",
        "date": "05132016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport may be hiding value of Congo Tenke mine sale - minister "
    },
    {
        "content": "Freeport-McMoRan Inc is in talks to sell more assets as it looks to cut its debt by half over the next two years  Chief Executive Richard Adkerson said on Tuesday.",
        "date": "05102016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport eyes more asset sale to cut debt by half "
    },
    {
        "content": "KINSHASA  May 10 Democratic Republic of Congo state miner Gecamines said on Tuesday it was not informed of Freeport-McMoRan Inc's sale of its majority stake in the Tenke copper project and \"will assert its rights.\"",
        "date": "05102016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Congo state miner says not informed of Freeport's copper mine sale "
    },
    {
        "content": "May 10 Freeport-McMoRan Inc is in talks to sell more assets as it looks to cut its debt by half over the next two years  Chief Executive Richard Adkerson said on Tuesday.",
        "date": "05102016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport eyes more asset sale to cut debt by half "
    },
    {
        "content": "* McMoran -  if stock purchase agreement is terminated  CMOC Ltd would be required to pay co's unit termination fee of $132.5 million - sec filing",
        "date": "05092016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-Mcmoran: CMOC to pay termination fee if purchase pact falls through "
    },
    {
        "content": "May 10 U.S. miner Freeport-McMoRan Inc  would like to get its debt down to $10 billion over the next two years and is in a series of discussions about selling more of its assets  Chief Executive Richard Adkerson said on Tuesday.",
        "date": "05102016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Miner Freeport wants to get debt down to $10 bln in two years "
    },
    {
        "content": "* Lundin Mining has right of first offer on Tenke   (Adds analyst comment  stock move  deal terms)",
        "date": "05092016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 3-Freeport to sell prized Tenke copper mine to China Moly for $2.65 bln "
    },
    {
        "content": "May 9 Freeport-McMoRan Inc said on Monday it would sell its 70 percent stake in a unit controlling the Tenke copper project in the Democratic Republic of Congo (DRC) to China Molybdenum Co Ltd (CMOC) for $2.65 billion.",
        "date": "05092016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport to sell Tenke copper interest to China Molybdenum "
    },
    {
        "content": "* Noble Corporation Plc announces agreement with Freeport-Mcmoran",
        "date": "05102016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Noble corporation announces agreement with Freeport-Mcmoran "
    },
    {
        "content": "May 9 Freeport-McMoRan Inc said on Monday it would sell its 70 percent stake in a unit controlling the Tenke copper project in the Democratic Republic of Congo to China Molybdenum Co Ltd (CMOC) for $2.65 billion in cash.",
        "date": "05092016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport to sell stake in unit controlling Tenke copper project "
    },
    {
        "content": "* Lundin Mining receives notice of right of first offer on Tenke Fungurume",
        "date": "05102016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Lundin Mining gets notice of first offer right on Tenke Fungurume "
    },
    {
        "content": "* Freeport-McMoran announces agreements to sell its interests in TF Holdings Limited for $2.65 billion in cash and up to $120 million in contingent consideration",
        "date": "05092016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-Mcmoran says to sell interests in TF Holdings "
    },
    {
        "content": "Freeport-McMoRan Inc has agreed to sell its majority stake in the Tenke copper project in the Democratic Republic of Congo to China Molybdenum Co Ltd (CMOC) for $2.65 billion in cash  reducing the U.S. miner's debt and handing the Chinese company one of the world's prized copper assets.",
        "date": "05102016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport to sell prized Tenke copper mine to China Moly for $2.65 billion "
    },
    {
        "content": "SANTIAGO Unionized workers at Chilean copper mine El Abra  controlled by Freeport-McMoran Inc  accepted a wage contract offered by the company  union President Juana Mejias said on Thursday.",
        "date": "04282016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport's Chile-based El Abra mine  union seal wage agreement "
    },
    {
        "content": "Freeport-McMoRan Inc  expects to have agreed $3 billion worth of asset sales by mid-year  its chief executive said on Tuesday  as the U.S. miner and oil producer tries to whittle down a nearly $21 billion debt pile he described as \"a killer.\"",
        "date": "04262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport confident of more copper asset sales by mid-year: CEO "
    },
    {
        "content": "* Freeport-Mcmoran Inc - CEO Richard C. Adkerson's 2015 total compensation was $8.6 million versus $10.1 million in 2014 - SEC Filing  Source - http://bit.ly/1pKvnza Further company coverage:    (Bengaluru Newsroom; +1 646 223 8780)",
        "date": "04282016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-Mcmoran CEO Richard C. Adkerson's 2015 total compensation $8.6 million "
    },
    {
        "content": "JAKARTA Indonesia has proposed a value for a 10.64 percent stake in Freeport-McMoran Inc's  local unit that is about two-thirds below the figure the company proposed in January.",
        "date": "04262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesia estimates value of Freeport unit two-thirds below offer "
    },
    {
        "content": "* Freeport offered to sell 10.64 pct stake at $1.7 bln in Jan   (Adds Freeport CEO comment)",
        "date": "04262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Indonesia estimates value of Freeport unit two-thirds below offer "
    },
    {
        "content": "April 26 Freeport-McMoRan Inc expects to have agreed $3 billion worth of asset sales by mid-year  its chief executive said on Tuesday  as the U.S. miner and oil producer tries to whittle down a nearly $21 billion debt pile he described as \"a killer.\"",
        "date": "04262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 3-Freeport confident of more copper asset sales by mid-year- CEO "
    },
    {
        "content": "* Has \"increasing confidence\" that it will be able to improve its balance sheet  says Chief Executive Richard Adkerson",
        "date": "04262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport expects to have agreed $3 bln in asset sales by mid-year - CEO "
    },
    {
        "content": "* Q1 earnings per share view $-0.18 -- Thomson Reuters I/B/E/S",
        "date": "04262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-Mcmoran Q1 loss per share $3.35 "
    },
    {
        "content": "JAKARTA  April 26 Indonesia estimates the value of a 10.64 percent stake in the local unit of miner Freeport McMoRan Inc at about $630 million and has asked the U.S.-based parent to revise its offer  a mining ministry spokesman said on Tuesday.",
        "date": "04262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesia says Freeport stake worth $630 mln -mining ministry "
    },
    {
        "content": "* Says CEO Richard C. Adkerson fy 2015 total compensation $8.6 million versus $10.1 million in FY 2014 - sec filing",
        "date": "04152016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BRIEF-Freeport-Mcmoran announces CEO Richard Adkerson 2015 total compensation "
    },
    {
        "content": "LIMA  March 31 Workers at Freeport McMoRan Inc's  Cerro Verde mine in Peru plan to go on a 48-hour strike April 8 to protest what they describe as the near disappearance of their profit-sharing bonus this year  the union said Thursday.",
        "date": "04012016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 1-Workers at Cerro Verde copper mine in Peru plan strike next week "
    },
    {
        "content": "April 5 Freeport-McMoRan Inc will axe its four top oil and gas executives and re-absorb the unit as an operating division  the mining and energy company said on Tuesday  announcing a move to cut costs as it tries to slash its $20 billion debt pile.",
        "date": "04052016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 2-Freeport-McMoRan axes 4 energy unit execs to cut costs "
    },
    {
        "content": "LIMA  April 8 Copper output from Freeport McMoRan Inc's Cerro Verde mine in Peru  one of the country's biggest  was partially affected during a 48-hour strike that started early on Friday  the labor union said.",
        "date": "04082016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 1-Copper output at Cerro Verde mine in Peru curbed by strike - union "
    },
    {
        "content": "April 5 Energy and mining company Freeport-McMoRan Inc said the chief executive of its oil and gas unit  Jim Flores  is stepping down as the company restructures the business.",
        "date": "04052016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoRan says oil & gas unit CEO stepping down "
    },
    {
        "content": "JAKARTA Indonesia on Wednesday granted Freeport-McMoRan Inc a new six-month export permit for shipments from one of the world's largest copper mines  ending a near two-week stoppage due to a dispute over payment for a new metal smelter.",
        "date": "02102016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Indonesia allows Freeport to resume copper exports for another six months "
    },
    {
        "content": "* Allows for shipment of 1.03 mln T of coper over next 6 mths   (Adds Freeport  president's comments)",
        "date": "02102016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Indonesia allows Freeport to resume copper exports for another 6 mths "
    },
    {
        "content": "JAKARTA Indonesia's mining ministry on Tuesday recommended that Freeport McMoRan Inc receive a new six-month copper export permit  potentially ending a near two-week stoppage after the previous permit expired last month.",
        "date": "02092016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Indonesia mines ministry backs new Freeport copper export permit "
    },
    {
        "content": "* Trade ministry still needs to issue permit   (Adds Freeport comment)",
        "date": "02092016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Indonesia mines ministry backs new Freeport copper export permit "
    },
    {
        "content": "* Tin bucks weaker trend and rises 1 pct   (Updates with closing prices)",
        "date": "02052016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "METALS--Copper slides after U.S. jobs data pushes up dollar "
    },
    {
        "content": "* Difference in \"interpretation\" of regulations -official   (Adds details and further comment from govt official  Freeport)",
        "date": "02052016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Indonesia govt optimistic Freeport export permit to be renewed next week -official "
    },
    {
        "content": "JAKARTA Freeport McMoRan Inc has asked Indonesia to reduce a $530 million smelter bond the local unit of the U.S. copper mining giant must set aside before receiving an extension of its export permit  Indonesia's mining minister said on Tuesday.",
        "date": "02022016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport asks Indonesia to cut or postpone $530 mln smelter bond: mining minister "
    },
    {
        "content": "TOKYO  Feb 1 Pan Pacific Copper (PPC)  Japan's biggest copper smelter  and Freeport have set 2016 treatment and refining charges 9 percent lower than last year's fees  as global mines cut output due to slumping prices.",
        "date": "02012016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Japan's Pan Pacific  Freeport agree 2016 TC/RCs at $97.35/T  9.735 cents/lb "
    },
    {
        "content": "* Freeport wants assurance that mining rights will be extended   (Updates throughout  adds details)",
        "date": "02022016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport asks Indonesia to cut or postpone $530 mln smelter bond -mining minister "
    },
    {
        "content": "JAKARTA  Jan 28 Indonesia's government and Freeport McMoRan Inc on Thursday failed to reach a deal on extending the U.S. mining giant's six-month export permit  potentially halting shipments from the country's massive Grasberg copper and gold mine.",
        "date": "01282016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 2-Indonesia  Freeport fail to reach deal over copper export permit "
    },
    {
        "content": "JAKARTA Freeport McMoRan Inc on Friday lost its right to export copper concentrate  valued at more than $1 billion  from one of the world's biggest mines as talks with Indonesia's government remained deadlocked over payment for a new metal smelter.",
        "date": "01292016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport loses right to export from Indonesia copper mine  talks ongoing "
    },
    {
        "content": "TORONTO  Jan 28 The Canadian arm of mining giant BHP Billiton has signed a letter of intent to help fund exploration at Aston Bay Holdings Ltd's Storm copper project  Aston Bay said on Thursday.",
        "date": "01282016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BHP Billiton set to fund Aston Bay's Storm copper project "
    },
    {
        "content": "JAKARTA  Jan 28 Indonesia's government and Freeport McMoRan Inc are meeting on Thursday in last-ditch talks to prevent a halt in exports of copper concentrate from the U.S. mining giant's massive Grasberg mine in the province of Papua.",
        "date": "01282016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesia  Freeport in last-ditch talks to prevent halt in copper exports "
    },
    {
        "content": "* Freeport says \"everything is normal\" at massive mine   (Releads  adds value of copper concentrate exports)",
        "date": "01292016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 3-Freeport loses right to export from Indonesia copper mine  talks ongoing "
    },
    {
        "content": "JAKARTA Indonesia's mines minister and Freeport McMoRan Inc expressed confidence on Wednesday that the two sides will find common ground to enable the U.S. mining giant to continue shipping copper concentrate for at least another six months.",
        "date": "01272016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Indonesia  Freeport confident export permit issue will be resolved "
    },
    {
        "content": "JAKARTA  Jan 25 Freeport McMoRan Inc's  copper concentrate export permit for its Indonesian unit will expire on Tuesday  Didi Sumedi  an official at the trade ministry told Reuters on Monday.",
        "date": "01252016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport Indonesia's copper export permit to end on Tuesday - govt "
    },
    {
        "content": "* Energy & mines minister indicates room to negotiate on deposit",
        "date": "01272016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Indonesia  Freeport confident export permit issue will be resolved "
    },
    {
        "content": "JAKARTA  Jan 27 Indonesia's government will work with Freeport McMoRan Inc to find common ground so the U.S. mining giant can continue to ship copper concentrate for at least another six months  the mines minister said on Wednesday.",
        "date": "01272016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesia  Freeport working to find common ground on copper export permit "
    },
    {
        "content": "Freeport-McMoRan Inc   the U.S. mining and oil group  on Tuesday made its strongest pledge yet to reduce its massive debt  saying it wants to lop off as much as $10 billion through proceeds from a mix of asset sales and joint ventures.",
        "date": "01262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport-McMoRan pledges to cut up to $10 billion debt; shares jump "
    },
    {
        "content": "* Fourth-quarter loss better than market expected   (Adds credit default swap activity)",
        "date": "01262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 4-Freeport-McMoRan pledges to cut up to $10 bln debt; shares jump "
    },
    {
        "content": "JAKARTA  Jan 20 Indonesia will reach a decision on whether to accept Freeport McMoRan Inc's $1.7 billion divestment price for its unit in the country by the end of the first quarter  a mines ministry official said on Wednesday.",
        "date": "01202016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Indonesia to give Freeport divestment verdict in March -official "
    },
    {
        "content": "* Adkerson says company facing \"serious challenges\" with what happening in commodities market and balance sheet",
        "date": "01262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport targeting $5 bln-$10 bln debt reduction - CEO Adkerson "
    },
    {
        "content": "JAKARTA Indonesia's demand that Freeport McMoRan Inc pay a deposit for a new smelter to continue exporting copper concentrate is \"inconsistent\" with an agreement reached between the two sides in mid-2014  the firm's CEO said on Tuesday.",
        "date": "01262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport questions Indonesia's demand for smelter deposit "
    },
    {
        "content": "* Govt will not extend Freeport's export permit if no payment",
        "date": "01262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 4-Freeport questions Indonesia's demand for smelter deposit "
    },
    {
        "content": "JAKARTA  Jan 22 The Indonesian unit of Freeport McMoRan Inc must put a further $530 million into an escrow account  a government official said  among other requirements for the miner to extend its permit to export copper concentrate from Indonesia.",
        "date": "01222016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Indonesia says Freeport must set aside further $530 mln for smelter "
    },
    {
        "content": "Jan 26 Diversified U.S. miner and oil producer Freeport-McMoRan Inc reported a bigger fourth-quarter loss  squeezed by plunging commodity prices and flagging Chinese demand.",
        "date": "01262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Miner Freeport-McMoRan reports quarterly loss as commodity prices fall "
    },
    {
        "content": "JAKARTA  Jan 18 The chief executive of Freeport McMoRan Inc's Indonesian unit  Maroef Sjamsuddin  has resigned for \"personal reasons\"  a company spokesman said on Monday  less than a month after the chairman of the U.S. mining giant stepped down.",
        "date": "01182016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 2-CEO of Freeport's Indonesian unit steps down  replacement sought "
    },
    {
        "content": "* Talks enters new chapter after resignations of key negotiators   (New throughout)",
        "date": "01192016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 1-Indonesian minister rejects Freeport price in a setback to talks "
    },
    {
        "content": "JAKARTA  Jan 26 Freeport McMoRan Inc's  copper concentrate export permit for its Indonesian unit will expire on Thursday  Didi Sumedi  an official at the trade ministry told Reuters on Tuesday.",
        "date": "01262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport Indonesia's copper export permit to end on Thursday -govt "
    },
    {
        "content": "Jan 18 The chief executive of Freeport-McMoRan's  Indonesian unit  Maroef Sjamsuddin  has resigned for personal reasons  a spokesman at the mining company's head office in the United States said on Monday.",
        "date": "01182016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport says Indonesian unit head resigned for personal reasons "
    },
    {
        "content": "JAKARTA  Jan 19 The price of shares in Freeport Indonesia  the local unit of U.S. mining giant Freeport McMoRan Inc  being offered to the government under divestment rules is too expensive  the state-owned enterprises minister said on Tuesday.",
        "date": "01192016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesia's SOE minister says Freeport divestment price too expensive "
    },
    {
        "content": " ",
        "date": "01262016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport yet to pay Indonesia smelter deposit as export deadline looms "
    },
    {
        "content": "JAKARTA Freeport McMoRan Inc's Indonesian unit has submitted a divestment price to the Indonesian government for an additional stake in one of the world's biggest copper mines  an energy ministry official said on Thursday.",
        "date": "01142016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport submits $1.7 billion Grasberg mine divestment price "
    },
    {
        "content": "JAKARTA  Jan 14 Freeport McMoRan Inc's  Indonesian unit has submitted a divestment price to the Indonesian government for an additional stake in one of the world's biggest copper mines  an energy ministry official said on Thursday.",
        "date": "01142016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport submits $1.7 billion Grasberg mine divestment price "
    },
    {
        "content": "JAKARTA  Jan 14 Freeport McMoRan Inc's  Indonesian unit offered the 10.64 percent stake it must divest to the government at a price of $1.7 billion  an energy ministry official said.",
        "date": "01142016",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport Indonesia offers stake to govt at $1.7 billion - energy ministry official "
    },
    {
        "content": "Shares of copper miner and oil producer Freeport-McMoRan Inc fell by as much as 20 percent on Monday  hammered by the twin blows of a slump in copper prices to six-year lows and weaker oil prices.",
        "date": "01112016",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Miner Freeport slumps to 15-year low on copper  oil price slump "
    },
    {
        "content": "Dec 28 Miner Freeport-McMoRan Inc said Chairman and co-founder James R. Moffett would step down from its board.",
        "date": "12282015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport-McMoRan Chairman James R. Moffett steps down "
    },
    {
        "content": "Dec 23 Freeport-McMoRan Inc  the U.S. miner that was targeted by activist investor Carl Icahn earlier this year  is planning to run an auction process for its oil and gas assets in early 2016  according to people familiar with the matter.",
        "date": "12232015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport-McMoRan to launch auction for oil and gas assets-sources "
    },
    {
        "content": "JAKARTA  Dec 14 A senior Indonesian minister on Monday sought to distance the administration from parliament speaker Setya Novanto  who is fighting allegations that he tried to extort shares worth $1.8 billion in the local unit of Freeport McMoRan Inc.",
        "date": "12142015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Indonesia minister distances govt from Freeport extortion allegation "
    },
    {
        "content": "JAKARTA  Dec 11 Indonesia's chief security minister on Friday said there was no connection between the government and parliament speaker Setya Novanto  who is fighting allegations that he tried to extort shares in the local unit of Freeport McMoRan Inc.",
        "date": "12112015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "No link between Indonesian govt and speaker over Freeport shares-minister "
    },
    {
        "content": "Dec 9 Freeport-McMoRan Inc on Wednesday suspended its annual dividend and made deeper cuts in capital spending and copper production  the latest mining company to act to preserve cash as a commodities' price downturn enters its fifth year.",
        "date": "12092015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 2-Freeport suspends dividend  eyes stake sales to weather price slump "
    },
    {
        "content": "** FreePort-McMoRan shares up 1 pct premarket as energy and mining co suspends its dividend and slashes capex plans  responding to slumping commodities markets",
        "date": "12092015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BUZZ-Freeport-McMoRan suspends dividend  slashes spending plans "
    },
    {
        "content": "Dec 9 Diversified U.S. miner and energy producer Freeport-McMoRan Inc said it had suspended its annual dividend of 20 cents per share to save cash amid a slump in commodity prices.",
        "date": "12092015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport suspends dividend  reduces spending plans "
    },
    {
        "content": "JAKARTA  Dec 3 The head of the Freeport McMoRan Inc's Indonesian unit  a former deputy at the state intelligence agency  told a parliament ethics probe he secretly recorded a meeting with the house speaker discussing the U.S. miner's divestment obligations to the government.",
        "date": "12032015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport Indonesia CEO says he taped meeting with house speaker "
    },
    {
        "content": "JAKARTA  Nov 24 A parliamentary ethics probe into a meeting between the speaker of Indonesia's house of representatives and officials from mining giant Freeport McMoRan  should not delay the company's divestment plans for its Indonesian unit  a mining ministry official said on Tuesday.",
        "date": "11242015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Ethics probe should not delay Freeport Indonesia divestment  says govt "
    },
    {
        "content": "TORONTO U.S. miner and oil producer Freeport-McMoRan   under pressure from activist investor Carl Icahn and falling prices  said on Thursday it will further cut copper and molybdenum output as it posted a bigger-than-expected quarterly loss.",
        "date": "10222015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport further cuts mining output on low prices  posts loss "
    },
    {
        "content": "TORONTO  Oct 22 U.S. miner and oil producer Freeport-McMoRan  under pressure from activist investor Carl Icahn and falling prices  said on Thursday it will further cut copper and molybdenum output as it posted a bigger-than-expected quarterly loss.",
        "date": "10222015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 3-Freeport further cuts mining output on low prices  posts loss "
    },
    {
        "content": "* Says \"more visibility\" on its oil and gas review within six months",
        "date": "10222015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport: \"more visibility\" on energy review within six months "
    },
    {
        "content": "TORONTO  Oct 22 U.S. miner and oil producer Freeport-McMoRan Inc  under pressure from activist investor Carl Icahn and deteriorating commodity markets  reported a third-quarter loss on Thursday  as prices for metals and oil declined.",
        "date": "10222015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoRan reports third-quarter loss "
    },
    {
        "content": "LONDON  Oct 13 Atlantic Copper  a subsidiary of Freeport McMoRan Inc in Spain  may set a new record this year by producing 284 000 to 285 000 tonnes of cathode  a top company official said on Tuesday.",
        "date": "10132015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "LMEWEEK-Freeport's Atlantic Copper aims record output in 2015 "
    },
    {
        "content": "JAKARTA  Oct 13 Freeport-McMoRan Inc  should significantly increase the amount it pays in royalty payments to the Indonesian government if it wants to extend a contract to operate one of the world's biggest copper mines  a cabinet minister said on Tuesday.",
        "date": "10132015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesia wants more royalties from Freeport for longer contract "
    },
    {
        "content": "JAKARTA  Oct 9 Indonesia plans to amend its rules on mining contracts by the end of the year  a government official said  allowing U.S. miner Freeport-McMoRan Inc  to apply for an extension of its contract at the Grasberg copper and gold mine.",
        "date": "10092015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 1-Indonesia plans new mining contract renewal rules by year-end "
    },
    {
        "content": "U.S. miner Freeport-McMoRan Inc said on Wednesday it will add two new directors to its board under an agreement with billionaire Carl Icahn  bowing to pressure from the activist investor  who is the company's largest shareholder.",
        "date": "10072015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport shares soar as Icahn execs gain seats on miner's board "
    },
    {
        "content": "Freeport-McMoRan Inc  under pressure from activist shareholder Carl Icahn and weak commodity prices  said on Tuesday it is slashing its board size and exploring a return to its roots as a copper-focused mining company.",
        "date": "10062015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport looks to return to mining roots with oil  gas review "
    },
    {
        "content": "TORONTO U.S. energy and mining company Freeport-McMoRan Inc said on Thursday it has been assured by the government of Indonesia that the mining contract for its giant Grasberg copper and gold mine will be extended beyond 2021.",
        "date": "10082015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Indonesia assures Freeport that Grasberg mine contract to be extended "
    },
    {
        "content": "Oct 7 U.S. miner Freeport-McMoRan Inc  said on Wednesday it will add two new directors to its board under an agreement with billionaire Carl Icahn  bowing to pressure from the activist investor  who is the company's largest shareholder.",
        "date": "10072015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Freeport shares soar as Icahn execs gain seats on miner's board "
    },
    {
        "content": "Oct 6 Freeport-McMoRan Inc  under pressure from activist shareholder Carl Icahn and weak commodity prices  said on Tuesday it is slashing its board size and exploring a return to its roots as a copper-focused mining company.",
        "date": "10062015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 4-Freeport looks to return to mining roots with oil  gas review "
    },
    {
        "content": "** Energy and mining company's shares up 2.4 pct at $11.45 premarket",
        "date": "10062015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BUZZ-Freeport-McMoRan Inc: Reviewing options for oil and gas unit "
    },
    {
        "content": "TORONTO  Oct 8 U.S. energy and mining company Freeport-McMoRan Inc said on Thursday it has been assured by the government of Indonesia that the mining contract for its giant Grasberg copper and gold mine will be extended beyond 2021.",
        "date": "10082015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Indonesia assures Freeport that Grasberg mine contract to be extended "
    },
    {
        "content": "Oct 7 Energy and mining company Freeport-McMoRan Inc named two new members to its board under an agreement with largest shareholder and activist investor Carl Icahn.",
        "date": "10072015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoRan names two board members associated with Icahn "
    },
    {
        "content": "Oct 8 Energy and mining company Freeport-McMoRan Inc said the government of Indonesia has assured the company's local unit that it will approve the extension of operations beyond 2021.",
        "date": "10082015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport says Indonesia promises approval to operate beyond 2021 "
    },
    {
        "content": "JAKARTA  Oct 8 Freeport Indonesia must propose its divestment share price to the government by Oct. 14  an energy and mining ministry official said on Thursday.",
        "date": "10082015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport Indonesia must propose divestment share price to govt by Oct 14 - energy official "
    },
    {
        "content": "NEW YORK  Sept 30 Billionaire activist investor Carl Icahn said on Wednesday he would recommend investors hold cash given market risks and that he was \"seriously considering\" buying \"a lot more\" shares of Apple Inc.",
        "date": "09302015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Carl Icahn says would 'keep cash' given market risks - CNBC "
    },
    {
        "content": "AREQUIPA  Peru  Sept 23 The expansion of Freeport-McMoRan Inc's Cerro Verde deposit in Peru is nearly finished and should double the mine's copper output after starting in April or May of 2016  the mine's spokesman said Wednesday.",
        "date": "09232015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Peru's Cerro Verde mine expansion to start copper output in 2d quarter "
    },
    {
        "content": "(Adds dropped word \"pct\" in headline) Sept 18 FREEPORT-MCMORAN INC:  * Carl C. Icahn reports 8.80% active stake in Freeport-McMoRan  -as of September 18  2015 - SEC filing  * Carl C. Icahn had earlier reported 8.46% active stake in Freeport-McMoRan -as of August 17  2015  * Source text for Eikon (http://1.usa.gov/1iofLhy)     (Reporting By Shubhankar Chakravorty in Bengaluru) ",
        "date": "09182015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "CORRECTED-BRIEF-Carl Icahn reports 8.8 pct stake in Freeport-McMoRan as of Sept 18 "
    },
    {
        "content": "Diversified U.S. miner and energy producer Freeport-McMoran Inc said it has filed to sell additional shares to raise up to $1 billion.",
        "date": "09182015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoran files to sell additional shares worth $1 billion "
    },
    {
        "content": "Sept 18 Diversified U.S. miner and energy producer Freeport-McMoran Inc said it has filed to sell additional shares to raise up to $1 billion.",
        "date": "09182015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoran files to sell additional shares worth $1 bln "
    },
    {
        "content": "* Grasberg exports already hurt by new rules  smelter closure",
        "date": "09102015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport Indonesia cuts copper sales forecast due to El Nino "
    },
    {
        "content": "JAKARTA  Sept 10 Freeport-McMoRan has revised down its forecast for copper concentrate sales from its Indonesian unit  an official at the U.S. mining giant said  after milling operations were hurt by the El Nino dry weather pattern.",
        "date": "09102015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport Indonesia cuts copper sales forecast due to El Nino "
    },
    {
        "content": "Mining company Freeport-McMoRan Inc has hired JPMorgan Chase & Co to help it explore options  a person familiar with the matter said on Friday  after activist investor Carl Icahn called the company undervalued and asked for corporate changes.",
        "date": "09052015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport-McMoRan hires JPMorgan to help explore options: source "
    },
    {
        "content": "Sept 4 Mining company Freeport-McMoRan Inc  has hired JPMorgan Chase & Co to help it explore options  a person familiar with the matter said on Friday  after activist investor Carl Icahn called the company undervalued and asked for corporate changes.",
        "date": "09052015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoRan hires JPMorgan to help explore options -source "
    },
    {
        "content": "SANTIAGO  Sept 2 Arizona-based mining company Freeport-McMoRan Inc said on Wednesday it was dismissing some 650 workers at its El Abra copper mine in Chile and partially suspending operations at the complex  until mid-September as it cuts mining rates in half.",
        "date": "09022015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport lays off 650  slows operations at Chile's El Abra mine "
    },
    {
        "content": "JAKARTA  Sept 4 Freeport-McMoran's  Indonesian unit exported only two shipments of copper concentrate during August  a union official said on Friday  as new payment rules for buyers and the closure of the company's domestic smelter hindered supplies.",
        "date": "09042015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport Indonesia's copper shipments fall in August - union "
    },
    {
        "content": "** Mining stocks  battered by a rout in commodity prices  get hefty boost from activist investor Carl Icahn disclosing a stake in diversified miner & energy producer Freeport-McMoRan",
        "date": "08282015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "BUZZ-Mining stocks: Icahn stake in Freeport-McMoRan lifts sector "
    },
    {
        "content": "TORONTO Activist investor Carl Icahn disclosed an 8.5 percent stake in Freeport-McMoran Inc  taking aim at the company's spending and capital structure  as well as executive compensation.",
        "date": "08272015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Icahn reveals stake in Freeport as miner makes deep cuts "
    },
    {
        "content": "TORONTO  Aug 27 Activist investor Carl Icahn disclosed an 8.5 percent stake in Freeport-McMoran Inc  taking aim at the company's spending and capital structure  as well as executive compensation.",
        "date": "08272015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 4-Icahn reveals stake in Freeport as miner makes deep cuts "
    },
    {
        "content": "Activist investor Carl Icahn disclosed an 8.5 percent stake in miner Freeport-McMoran Inc  saying the company was undervalued and needed to address several corporate governance and capital issues.",
        "date": "08272015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Icahn targets struggling miner Freeport-McMoran with 8.5 percent stake "
    },
    {
        "content": "Aug 27 Activist investor Carl Icahn disclosed an 8.5 percent stake in miner Freeport-McMoran Inc  saying the company was undervalued and needed to address several corporate governance and capital issues.",
        "date": "08272015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Icahn targets struggling miner Freeport-McMoran with 8.5 pct stake "
    },
    {
        "content": "Aug 27 Diversified U.S. miner and energy producer Freeport-McMoran Inc said it would lower its capital budget for mining in 2016 by 25 percent  or $700 million  as commodity prices continue to weaken.",
        "date": "08272015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoran lowers 2016 mining capex  to cut jobs "
    },
    {
        "content": "JAKARTA  Aug 14 U.S. miner Freeport-McMoRan  said on Friday it expected the resumption of copper concentrate exports from Indonesia to be delayed further while buyers adjusted to rules that stopped shipments from its Grasberg complex last month.",
        "date": "08142015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport sees no quick fix to Indonesian copper export stoppage "
    },
    {
        "content": "JAKARTA  Aug 12 Freeport-McMoRan has stopped exporting since last month from one of the world's largest copper mines that it runs in Indonesia  a spokesman said on Wednesday  as the U.S. miner awaits approval from the trade ministry.",
        "date": "08122015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport Indonesia halts copper exports after permit expires "
    },
    {
        "content": "JAKARTA  Aug 12 Freeport-McMoRan has stopped exporting since last month from one of the world's largest copper mines that it runs in Indonesia  a spokesman said on Wednesday  as the U.S. miner awaits approval from the trade ministry.",
        "date": "08122015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport indonesia halts copper exports after permit expires "
    },
    {
        "content": "TORONTO Freeport-McMoRan Inc may issue up to $1 billion in common shares  the diversified miner said on Monday in a regulatory filing  a decision that highlights how sliding commodity prices are deepening woes of mining and energy companies.",
        "date": "08102015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport-McMoRan outlines $1 billion equity issue plan "
    },
    {
        "content": "JAKARTA  Aug 12 U.S. mining giant Freeport  has stopped its shipments of copper concentrate from Indonesia after failing to obtain an exemption from a new rule requiring mining exports to use letters of credit  the Jakarta Globe newspaper reported  quoting Riza Pratama  a spokesman for the company's Indonesia unit.",
        "date": "08122015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "INDONESIA PRESS-Freeport halts copper exports from Indonesia amid rule hiccup - Jakarta Globe "
    },
    {
        "content": "TORONTO  Aug 10 Freeport-McMoRan Inc may issue up to $1 billion in common shares  the diversified miner said on Monday in a regulatory filing  a decision that highlights how sliding commodity prices are deepening woes of mining and energy companies.",
        "date": "08102015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoRan outlines $1 bln equity issue plan "
    },
    {
        "content": "Aug 5 Diversified U.S. miner and energy producer Freeport-McMoRan Inc said it would cut its budget for oil and gas operations and defer investments in several long-term projects.",
        "date": "08052015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport-McMoRan cuts capital budget for oil  gas operations "
    },
    {
        "content": "Aug 5 Miner Freeport-McMoRan Inc said it would cut its budget for oil and gas operations due to weak prices and defer investments in several long-term projects.",
        "date": "08052015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoRan cuts capital budget for oil  gas operations "
    },
    {
        "content": "JAKARTA Indonesia and Freeport-McMoRan reached a deal on Monday that will allow the U.S. mining giant to export up to 775 000 tonnes of copper over the next six months.",
        "date": "07272015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Indonesia  Freeport agree six-month export permit extension "
    },
    {
        "content": "Freeport-McMoRan Inc  may cut output at its small North American copper and molybdenum mines to help it reduce costs  analysts said on Tuesday after the miner and oil producer announced a cost and spending review amid weak commodity prices.",
        "date": "07282015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport may cut output at small N. American mines: analysts "
    },
    {
        "content": "JAKARTA  July 27 Indonesia and Freeport-McMoRan  reached a deal on Monday that will allow the U.S. mining giant to export up to 775 000 tonnes of copper over the next six months.",
        "date": "07272015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Indonesia  Freeport agree 6-month export permit extension "
    },
    {
        "content": "July 28 Freeport-McMoRan Inc may cut output at its small North American copper and molybdenum mines to help it reduce costs  analysts said on Tuesday after the miner and oil producer announced a cost and spending review amid weak commodity prices.",
        "date": "07282015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Freeport may cut output at small N. American mines -analysts "
    },
    {
        "content": "July 28 Freeport-McMoRan Inc said on Tuesday it is reviewing its mining and oil and gas businesses for significant additional cuts in capital spending and operating costs because of weak prices for copper  molybdenum and gold.",
        "date": "07282015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Miner Freeport to review all costs  may cut copper  moly output "
    },
    {
        "content": "TORONTO/JAKARTA Shares of diversified miner and energy producer Freeport-McMoRan sank for a second session on Friday  as uncertainty around Indonesian mining contracts added to worries about spending plans  high debt and falling commodity prices.",
        "date": "07252015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport stock sinks as Indonesian copper mine uncertainty rattles market "
    },
    {
        "content": "VANCOUVER/TORONTO North American mining stocks slumped on Thursday  stripping two global producers of hundreds of millions of dollars in value  as market-beating results failed to appease investors fed up with bloated debt and hefty capital commitments.",
        "date": "07232015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "North American mining stocks fall on debt fears despite strong results "
    },
    {
        "content": "VANCOUVER/TORONTO  July 23 Shares of global miners Freeport-McMoRan Inc and Teck Resources Ltd  took a pounding on Thursday as investors worried about balance sheets stretched by debt and capital commitments as metal prices continued to tumble.",
        "date": "07232015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Teck  Freeport shares slide on debt  metals price worries "
    },
    {
        "content": "Diversified U.S. miner and energy producer Freeport-McMoran Inc  reported an unexpectedly strong adjusted profit on Thursday as sales of the metals and oil it produces rose  but its hefty debt load swelled and it also posted a big net loss.",
        "date": "07232015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoRan profit beats expectations; shares slide "
    },
    {
        "content": "July 23 Diversified U.S. miner and energy producer Freeport-McMoran Inc reported an unexpectedly strong adjusted profit on Thursday as sales of the metals and oil it produces rose  but its hefty debt load swelled and it also posted a big net loss.",
        "date": "07232015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Freeport-McMoRan profit beats expectations; shares slide "
    },
    {
        "content": "TORONTO  July 23 Diversified U.S. miner and energy company Freeport-McMoran Inc reported a sizeable second-quarter net loss on Thursday  reflecting a big write-down for the value of its oil and gas properties and slumping prices for the copper  gold and oil that it produces.",
        "date": "07232015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoRan posts Q2 loss as metal  oil prices drop "
    },
    {
        "content": "Freeport-McMoRan Oil & Gas Inc  a unit of U.S.-based Freeport-McMoRan Inc   on Tuesday filed documents with the U.S. Securities and Exchange Commission for an initial public offering.",
        "date": "06242015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport-McMoRan Oil & Gas files for IPO "
    },
    {
        "content": "June 23 Freeport-McMoRan Oil & Gas Inc  a unit of U.S.-based Freeport-McMoRan Inc  on Tuesday filed documents with the U.S. Securities and Exchange Commission for an initial public offering.",
        "date": "06242015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "CORRECTED-UPDATE 1-Freeport-McMoRan Oil & Gas files for IPO "
    },
    {
        "content": "Freeport-McMoRan Oil & Gas Inc  a unit of U.S.-based Freeport-McMoRan Inc   on Tuesday filed documents with the U.S. Securities and Exchange Commission for an initial public offering of up to $100 million.",
        "date": "06232015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport-McMoRan Oil & Gas files for IPO of up to $100 million "
    },
    {
        "content": "June 23 Freeport-McMoRan Oil & Gas Inc  a unit of U.S.-based Freeport-McMoRan Inc  on Tuesday filed documents with the U.S. Securities and Exchange Commission for an initial public offering of up to $100 million.",
        "date": "06232015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport-McMoRan Oil & Gas files for IPO of up to $100 mln "
    },
    {
        "content": "June 3 Freeport-McMoRan Inc  which is exploring a public offer for a stake in its oil and gas business  will likely sell off less than 20 percent of the unit  Freeport Chief Financial Officer Kathleen Quirk said on Wednesday.",
        "date": "06032015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport may sell less than 20 pct of oil  gas unit in IPO "
    },
    {
        "content": "TORONTO  April 23 Freeport-McMoRan Inc  is mulling a public offering of its oil and gas business to help kick-start production growth for its energy business  along with joint ventures or asset sales  the diversified miner said on Thursday.",
        "date": "04232015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 2-Freeport-McMoRan eyes oil and gas unit IPO to fund growth "
    },
    {
        "content": "TORONTO  April 23 U.S. miner and oil producer Freeport-McMoRan Inc reported a first-quarter loss on Thursday  as it recorded one-time charges of $2.4 billion  mainly for the reduction of the carrying value of its oil and gas properties.",
        "date": "04232015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Miner Freeport-McMoRan reports first-quarter loss on charges "
    },
    {
        "content": "April 15 Freeport McMoRan Inc's copper smelter in Spain will produce 15 000-20 000 tonnes less copper this year due to 20-day planned maintenance in September  a senior executive said on Wednesday.",
        "date": "04152015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport's Atlantic Copper smelter to cut output due to maintenance "
    },
    {
        "content": "* Indexes off: Dow 0.31 pct  S&P 0.3 pct  Nasdaq 0.05 pct   (Updates to late afternoon)",
        "date": "03242015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "US STOCKS-Wall St drifts lower; Google buoys Nasdaq "
    },
    {
        "content": "* Indexes: Dow off 0.23 pct  S&P off 0.21 pct  Nasdaq up 0.05 pct   (Updates to midday  changes byline)",
        "date": "03242015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "US STOCKS-Wall St near unchanged mark; Nasdaq up on Google lift "
    },
    {
        "content": "* Dow  S&P 500 flat; Nasdaq up 0.26 pct   (Updates prices  adds data  comment)",
        "date": "03242015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "US STOCKS-Wall St little changed; Google boosts Nasdaq "
    },
    {
        "content": "TORONTO  March 24 Diversified U.S. mining and energy company Freeport-McMoRan Inc slashed its quarterly dividend by 84 percent on Tuesday in response to the impact of lower commodity prices.",
        "date": "03242015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoRan slashes dividend as commodity prices weigh "
    },
    {
        "content": "TORONTO  March 24 Diversified U.S. mining and energy company Freeport-McMoRan Inc said on Tuesday it is slashing its quarterly dividend by 84 percent in response to the impact of lower commodity prices.",
        "date": "03242015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport-McMoRan slashes dividend as commodity prices weigh "
    },
    {
        "content": "JAKARTA  March 20 A blockade by workers at Freeport-McMoRan Inc's Indonesian mine extended into a fifth day on Friday  a union official said  with output still halted but maintenance workers allowed into the Grasberg site by protesters.",
        "date": "03202015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 2-Freeport Indonesia blockade enters 5th day  output still halted "
    },
    {
        "content": "JAKARTA  March 18 Newmont Mining Corp's  Indonesian copper export permit has been extended for six months  a mining ministry official said on Wednesday  after the company gave assurances over its commitment to build a smelter with Freeport-McMoRan Inc.",
        "date": "03182015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 1-Newmont's Indonesian copper export permit extended "
    },
    {
        "content": "JAKARTA  March 20 A blockade by workers at Freeport-McMoRan Inc's Indonesian mine extended into a fifth day on Friday  a union official said  with output still halted but maintenance workers allowed into the Grasberg site by protestors.",
        "date": "03202015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport Indonesia output stoppage enters 5th day as talks continue "
    },
    {
        "content": "JAKARTA  March 18 Newmont Mining Corp's  Indonesian copper export permit will be extended for six months on Wednesday  a mines ministry official said  after the company gave assurances over its commitment to build a smelter with Freeport-McMoRan Inc.",
        "date": "03182015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Newmont to get Indonesian export permit extension - govt official "
    },
    {
        "content": "Natural resources conglomerate Freeport-McMoRan Inc has hired Goldman Sachs Group Inc and Barclays Plc to help find private equity firms that will finance some of its projects  according to people familiar with the matter.",
        "date": "03172015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport taps Goldman  Barclays to help find partners: sources "
    },
    {
        "content": "March 17 Natural resources conglomerate Freeport-McMoRan Inc has hired Goldman Sachs Group Inc  and Barclays Plc to help find private equity firms that will finance some of its projects  according to people familiar with the matter.",
        "date": "03172015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport taps Goldman  Barclays to help find partners -sources "
    },
    {
        "content": "March 16 Credit Suisse Group Inc will pay $10 million in cash and provide $6.25 million worth of advisory work to Freeport-McMoRan Inc to settle allegations it contributed to the natural resources company having overpaid significantly for two oil and gas companies.",
        "date": "03162015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Credit Suisse settles Freeport-McMoRan litigation for $16.25 mln "
    },
    {
        "content": "JAKARTA  March 17 More than a hundred workers at Freeport-McMoRan Inc's Indonesian unit have blocked an access road to one of the world's biggest copper mines for a second day  government and union officials said on Tuesday.",
        "date": "03172015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport Indonesia workers block Grasberg access road for second day "
    },
    {
        "content": "JAKARTA  March 2 Newmont Mining Corp's  Indonesian copper export permit will not be renewed beyond March 19 unless it strikes a deal with Freeport-McMoRan Inc to invest in the latter's planned smelter  a mines ministry official said on Monday.",
        "date": "03022015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "UPDATE 2-Indonesia sets Newmont deadline for Freeport smelter deal "
    },
    {
        "content": "JAKARTA Newmont Mining Corp's Indonesian copper export permit will not be renewed beyond March 19 unless it strikes a deal with Freeport-McMoRan Inc to invest in the latter's planned smelter  a mines ministry official said on Monday.",
        "date": "03022015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesia sets Newmont deadline for Freeport smelter deal "
    },
    {
        "content": "JAKARTA  March 2 Newmont Mining Corp's  Indonesian copper export permit will not be renewed beyond March 19 unless it strikes a deal with Freeport-McMoRan Inc to invest in the latter's planned smelter  a mines ministry official said on Monday.",
        "date": "03022015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "REFILE-UPDATE 1-Indonesia sets Newmont deadline for Freeport smelter deal "
    },
    {
        "content": "JAKARTA  March 2 Newmont Mining Corp's  Indonesian copper export permit will not be renewed beyond March 19 unless it strikes a deal with Freeport-McMoRan Inc to invest in the latter's planned smelter  a mines ministry official said on Monday.",
        "date": "03022015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Indonesia give Newmont three weeks to strike smelter deal "
    },
    {
        "content": "Feb 23 Freeport-McMoRan Inc is unlikely to sell oil  gas and copper assets in the current market as buyers are unwilling to pay good prices for quality assets due to weak commodities prices  the company's chief executive said on Monday.",
        "date": "02232015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport CEO says unlikely to sell assets "
    },
    {
        "content": "Feb 23 Freeport-McMoRan Inc is unlikely to sell oil  gas and copper assets in the current market as buyers are unwilling to pay good prices for quality assets due to weak commodities prices  the company's chief executive said on Monday.",
        "date": "02232015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport CEO says unlikely to sell assets "
    },
    {
        "content": "JAKARTA  Feb 16 Indonesia has dropped its demand that Freeport-McMoran Inc build a $1.5 billion copper smelter in Papua province  saying a regionally owned enterprise would take on the project instead  website Detik.com reported  quoting the mining minister.",
        "date": "02162015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Indonesia lifts demand on Freeport to build Papua smelter -media "
    },
    {
        "content": "* Coming up: FOMC statement at 1900 GMT   (Updates with official prices)",
        "date": "01282015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "METALS-Copper edges higher ahead of Fed meeting "
    },
    {
        "content": "Pummeled by falling oil and copper prices  Freeport-McMoRan Inc  said on Tuesday it is abandoning its debt reduction target  bringing in partners to help fund two oil projects and slashing its capital spend and costs by $2 billion in 2015.",
        "date": "01272015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Miner Freeport-McMoRan abandons debt target but dividend safe  for now "
    },
    {
        "content": "JAKARTA  Jan 26 U.S. mining firm Freeport-McMoRan Inc is expected to export 500 000 tonnes of copper concentrate from its Indonesian operations over the next six months  down 100 000 tonnes from the previous six months  a company official said.",
        "date": "01262015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport Indonesia copper exports seen declining over next 6 months "
    },
    {
        "content": "NEW YORK  Jan 22 Freeport-McMoRan Inc  said on Thursday it has picked Gresik  East Java  as the location for its planned new copper smelter in Indonesia  the latest move by the Arizona-based miner to comply with an export deal with the government last year.",
        "date": "01222015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport picks site for new Indonesian copper plant as deadline looms "
    },
    {
        "content": "NEW YORK Freeport-McMoRan Inc  Chief Executive Officer Richard Adkerson said on Tuesday he expects relatively tight supplies due to mine delays  falling ore grades and spending cuts to support copper prices even as the market remains in oversupply this year.",
        "date": "01272015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport CEO says lower supplies should help copper price "
    },
    {
        "content": "Jan 27 Pummeled by falling oil and copper prices  Freeport-McMoRan Inc said on Tuesday it is abandoning its debt reduction target  bringing in partners to help fund two oil projects and slashing its capital spend and costs by $2 billion in 2015.",
        "date": "01272015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Miner Freeport-McMoRan abandons debt target but dividend safe  for now "
    },
    {
        "content": "* Bonded China nickel premiums highest since June   (Recasts  adds detail  closing prices)",
        "date": "01212015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "METALS-Copper gains  ECB policy meeting in focus "
    },
    {
        "content": "NEW YORK  Jan 27 Freeport-McMoRan Inc  Chief Executive Officer Richard Adkerson said on Tuesday he expects relatively tight supplies due to mine delays  falling ore grades and spending cuts to support copper prices even as the market remains in oversupply this year.",
        "date": "01272015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 1-Freeport CEO says lower supplies should help copper price "
    },
    {
        "content": "* Bonded China nickel premiums highest since June   (Adds official midday prices)",
        "date": "01212015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "METALS-Copper falls  ECB policy meeting in focus "
    },
    {
        "content": "* Coming Up: U.S. building permits for Dec at 1330 GMT   (Updates prices  adds comment  details; previous MELBOURNE)",
        "date": "01212015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "METALS-Copper edges lower  ECB policy meeting in focus "
    },
    {
        "content": "NEW YORK  Jan 27 Freeport-McMoRan Inc expects copper sales this year to rise by 8 percent to 4.3 billion lb as output improves in Indonesia where the company operates the giant Grasberg complex  Chief Executive Officer Richard Adkerson said on Tuesday.",
        "date": "01272015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-Mcmoran sees 2015 copper sales rising 8 percent "
    },
    {
        "content": "Jan 27 Freeport-McMoRan's target to reduce its debt to $12 billion by the end of 2016 is \"unrealistic\" in the current weak commodities price environment  Chief Executive Richard Adkerson said.",
        "date": "01272015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoRan says 2016 debt reduction target is \"unrealistic\" "
    },
    {
        "content": "Jan 27 U.S. miner Freeport-McMoRan Inc  reported a fourth-quarter loss due to net charges of $3.1 billion  mainly related to the value of its oil and gas properties and goodwill impairment.",
        "date": "01272015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "REFILE-Miner Freeport-McMoRan posts loss on $3.1 bln charges "
    },
    {
        "content": "NEW YORK  Jan 27 The copper market surplus this year will be smaller than expected due to disruptions in mines and low exchange inventory  Freeport-McMoRan Inc chief executive officer Richard Adkerson said on Tuesday.",
        "date": "01272015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoRan CEO sees smaller-than-expected copper surplus this year "
    },
    {
        "content": "JAKARTA  Jan 20 Freeport-McMoRan Inc  could lose its permit to export copper concentrate from its massive Indonesian mine in West Papua  the country's mining minister said on Tuesday  unless it can show progress in developing a new copper smelter this week.",
        "date": "01202015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Indonesia warns Freeport may lose export permit if smelter delayed "
    },
    {
        "content": "* Aluminium stocks in Japan ports hit record high   (Updates with closing prices)",
        "date": "01162015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "METALS-Copper up for second day  lifted by boost in China grid spending "
    },
    {
        "content": "Freeport-McMoRan Inc agreed on Thursday to pay $137.5 million to resolve a lawsuit claiming executives and directors had conflicts of interest that caused the natural resources company to overpay significantly for two oil and gas companies in 2013.",
        "date": "01152015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "Freeport-McMoRan in $137.5 mln settlement over purchases "
    },
    {
        "content": "Freeport-McMoRan Inc  agreed on Thursday to pay $137.5 million to resolve a lawsuit claiming executives and directors had conflicts of interest that caused the natural resources company to overpay significantly for two oil and gas companies in 2013.",
        "date": "01152015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoRan in $137.5 million settlement over purchases "
    },
    {
        "content": "* Energy index ends higher as U.S. oil futures rally late in session",
        "date": "01142015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "US STOCKS-Wall St ends down for 4th day on global growth worries "
    },
    {
        "content": "Jan 15 Freeport-McMoRan Inc agreed on Thursday to pay $137.5 million to resolve a lawsuit claiming executives and directors had conflicts of interest that caused the natural resources company to overpay significantly for two oil and gas companies in 2013.",
        "date": "01152015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "UPDATE 2-Freeport-McMoRan in $137.5 mln settlement over purchases "
    },
    {
        "content": "* Indexes off: Dow 1.3 pct  S&P 0.9 pct  Nasdaq 0.7 pct   (Updates to afternoon)",
        "date": "01142015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "US STOCKS-Wall St cuts losses with energy shares as U.S. oil jumps "
    },
    {
        "content": "NEW YORK/CHICAGO (Reuters Breakingviews) - F reeport-McMoRan's M&A tab isn't fully settled yet. The company did agree to write a $138 million check to shareholders to resolve a lawsuit over two conflict-riddled acquisitions. That should turn up the heat on James \"Jim Bob\" Moffett  chairman of Freeport-McMoRan Copper & Gold  whose cross-holdings factored in the case. Better governance would enhance the big payout.",
        "date": "01152015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Breakingviews-Freeport-McMoRan has yet to fully settle M&A tab "
    },
    {
        "content": "Jan 15 Freeport-McMoRan Inc :  * Says to receive proceeds for $137.5 million settlement of shareholder lawsuit",
        "date": "01152015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "BRIEF-Freeport McMoRan says insurers to cover $137.5 million derivative settlement "
    },
    {
        "content": "* Indexes down: Dow 0.2 pct  S&P 0.3 pct  Nasdaq 0.1 pct   (Updates close with latest volume  adds details on reversal)",
        "date": "01132015",
        "name": "Freeport-McMoran Inc",
        "news_type": "topStory",
        "symbol": "FCX",
        "title": "US STOCKS-Wall St ends down in volatile day; materials a drag "
    },
    {
        "content": "* Indexes fall: Dow by 1.5 percent; S&P 500 1.2 percent; Nasdaq 0.8 percent",
        "date": "01142015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "US STOCKS-Wall St extends losses  hit by global growth concerns "
    },
    {
        "content": "Jan 15 Freeport-McMoRan Inc has reached a $137.5 million settlement of shareholder litigation that accused the natural resources company of overpaying for two affiliates in 2013  lawyers for the shareholders said on Thursday.",
        "date": "01152015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Freeport-McMoRan in $137.5 mln settlement over acquisitions "
    },
    {
        "content": "* Indexes down: Dow 0.2 pct  S&P 0.3 pct  Nasdaq 0.1 pct   (Updates to close)",
        "date": "01132015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "US STOCKS-Wall St ends down in volatile session; materials a drag "
    },
    {
        "content": "* Indexes off: Dow 1.34 pct  S&P 1.08 pct  Nasdaq 0.81 pct   (Updates to late morning)",
        "date": "01142015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "US STOCKS-Wall Street tumbles on global economic worries "
    },
    {
        "content": "* Indexes down: Dow 0.4 pct  S&P 0.5 pct  Nasdaq 0.3 pct   (Updates to late afternoon)",
        "date": "01132015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "US STOCKS-Wall St down with materials  energy after reversing early gain "
    },
    {
        "content": "* Indexes off: Dow 1.3 pct  S&P 1.01 pct  Nasdaq 0.71 pct   (Updates to market open)",
        "date": "01142015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "US STOCKS-Wall St drops on global economic worries "
    },
    {
        "content": "* Futures off: Dow 237 pts  S&P 25.25 pts  Nasdaq 41 pts   (Adds quote  data  updates futures prices)",
        "date": "01142015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "US STOCKS-Wall St to drop at open on global economic worries "
    },
    {
        "content": "LONDON  Jan 14 A sudden plunge in the price of copper pulled the shares of global miner Glencore to their lowest level on record on Wednesday and risks frustrating any intention to make a fresh move on larger rival Rio Tinto.",
        "date": "01142015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "Copper tumble risks hampering Glencore's takeover ambitions "
    },
    {
        "content": "* Futures off: Dow 106 pts  S&P 11.25 pts  Nasdaq 19 pts   (Adds premarket actives)",
        "date": "01142015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "US STOCKS-Futures fall on global growth concern  JPMorgan results "
    },
    {
        "content": "NEW YORK  Jan 14 U.S. stock index futures fell on Wednesday  putting equities on track to extend their three-day losing streak  as global demand worries continue to put pressure on commodities such as oil and copper.",
        "date": "01142015",
        "name": "Freeport-McMoran Inc",
        "news_type": "normal",
        "symbol": "FCX",
        "title": "US STOCKS-Futures lower on global growth worry  JPMorgan results "
    }
]