[
    {
        "content": "* Paulson & Co Inc dissolves share stake in Facebook Inc ‍​- SEC filing",
        "date": "11142017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Paulson & Co dissolves share stake in Facebook  cuts share stake in Allergan "
    },
    {
        "content": "PARIS ATR  the world's largest maker of regional turboprop planes  on Wednesday announced an order from FedEx Express for at least 30 newly designed 72-600F freighter models  sealing its return to the lucrative U.S. market for the first time in over two decades.",
        "date": "11082017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Turboprop maker ATR clinches U.S. comeback with FedEx order "
    },
    {
        "content": "PARIS  Nov 8 ATR  the world's largest maker of regional turboprop planes  on Wednesday announced an order from FedEx Express for at least 30 newly designed 72-600F freighter models  sealing its return to the lucrative U.S. market for the first time in over two decades.",
        "date": "11082017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 1-Turboprop maker ATR clinches U.S. comeback with FedEx order "
    },
    {
        "content": "PARIS  Nov 8 ATR  the world's largest maker of turboprop planes  announced on Wednesday an order from FedEx Express for up to 50 of its 72-600F freighter planes.",
        "date": "11082017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx Express orders up to 50 ATR 72-600F freighter planes "
    },
    {
        "content": "By Robert Iafolla President Donald Trump will nominate FedEx Corp worker safety official Scott Mugno to lead the U.S. Labor Department's Occupational Safety and Health Administration  the White House announced Friday.",
        "date": "10302017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Trump administration taps FedEx worker safety official to head OSHA "
    },
    {
        "content": "* FedEx Freight says National Labor Relations Board (NLRB) has issued an order officially revoking certification of Teamsters union​ Source text for Eikon: Further company coverage:",
        "date": "10062017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-FedEx Freight says NLRB issues order revoking certification of Teamsters union​ "
    },
    {
        "content": "Oct 5 Shares of United Parcel Service Inc and FedEx Corp fell on Thursday after a report that Amazon.com Inc was testing its own delivery service  potentially encroaching on the territory of the package delivery companies.",
        "date": "10052017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPS  FedEx down on report of Amazon's own delivery service "
    },
    {
        "content": "* Says ‍Fedex Sameday City expands to 1 800 cities nationwide covering 30 markets​ Source text for Eikon: Further company coverage:",
        "date": "10042017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Fedex says Fedex Sameday City expands to 1 800 cities nationwide "
    },
    {
        "content": "* ‍Moody's says UPS  FedEx peak-season surcharges will partially offset rising e-commerce delivery costs​",
        "date": "09262017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-‍Moody's says UPS  FedEx peak-season surcharges will partially offset rising e-commerce delivery costs​ "
    },
    {
        "content": "Package delivery company FedEx Corp  said on Tuesday a June cyber attack on its Dutch unit slashed $300 million from its quarterly profit  and the company lowered its full-year earnings forecast.",
        "date": "09192017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Cyber attack  hurricane weigh on FedEx quarterly profit "
    },
    {
        "content": "Sept 19 Package delivery company FedEx Corp on Tuesday reported a lower quarterly net profit due to service disruptions following June's Petya cyber attack on its Dutch delivery unit TNT Express and the impact of Hurricane Harvey.",
        "date": "09192017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx quarterly profit falls "
    },
    {
        "content": "Package delivery company FedEx Corp  said on Wednesday its expects to incur roughly $350 million in integration costs related to its acquisition of Netherlands-based TNT Express during 2018  some $75 million higher than previous estimates.",
        "date": "09202017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx raises TNT integration costs by $75 million: filings "
    },
    {
        "content": "Sept 18 Package delivery company FedEx Corp said on Monday it would raise shipping rates for some of its services from Jan. 1.",
        "date": "09182017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx to raise shipping rates for some services "
    },
    {
        "content": "Sept 20 Package delivery company FedEx Corp said on Wednesday its expects to incur roughly $350 million in integration costs related to its acquisition of Netherlands-based TNT Express during 2018  some $75 million higher than previous estimates.",
        "date": "09202017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 2-FedEx raises TNT integration costs by $75 mln -filings "
    },
    {
        "content": "Sept 20 Package delivery company FedEx Corp said on Wednesday a June cyber attack on its Dutch unit will continue to hurt revenue through its second fiscal quarter and fiscal full-year 2018 and force bigger investments in information technology.",
        "date": "09202017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx says financial drain from cyber attack to linger through 2018 "
    },
    {
        "content": "* FedEx - While progress has been made on restoration of TNT express operations  TNT express revenues  volumes  profits remain below pre-attack levels‍​",
        "date": "09202017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-FedEx says Hurricanes Harvey and Irma will negatively impact Q2 2018 results - SEC Filing "
    },
    {
        "content": "* Shipping rates to increase for FedEx Express  FedEx Ground and FedEx Freight services",
        "date": "09182017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-Shipping rates to increase for FedEx Express  FedEx Ground and FedEx Freight services "
    },
    {
        "content": "Sept 12 FedEx Corp said on Tuesday it has resumed flights into airports  including in Miami  that were closed due to Hurricane Irma and that have since been re-opened.",
        "date": "09122017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx resumes flights into airports closed by Hurricane Irma "
    },
    {
        "content": "Sept 12 FedEx is assessing the full effect of Hurricane Irma on facilities and operations and is hopeful it can resume service this week in safely accessible areas  a company spokesman said on Tuesday.",
        "date": "09122017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx hopes to resume service this week to some hurricane-hit areas "
    },
    {
        "content": "United Parcel Service Inc  and FedEx Corp  said they resumed flights at Houston's main airport on Thursday afternoon and restarted some Texas operations crippled by Hurricane Harvey.",
        "date": "08312017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "UPS  FedEx resume operations in some parts of storm-battered Texas "
    },
    {
        "content": "Aug 31 United Parcel Service Inc and FedEx Corp said they resumed flights at Houston's main airport on Thursday afternoon and restarted some Texas operations crippled by Hurricane Harvey.",
        "date": "08312017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 4-UPS  FedEx resume operations in some parts of storm-battered Texas "
    },
    {
        "content": "Aug 31 FedEx Corp said on Thursday it resumed limited delivery service in parts of Corpus Christi and Victoria  Texas  previously halted by Hurricane Harvey  and was running some ramp operations at Houston's George Bush Intercontinental Airport. (Reporting by Eric M. Johnson in Seattle; Editing by Chris Reese)",
        "date": "08312017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx resumes limited delivery service in two Texas cities "
    },
    {
        "content": "* Mark R. Allen named Fedex Corp. executive vice president  general counsel  and secretary",
        "date": "08162017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Fedex names Mark Allen executive vice president "
    },
    {
        "content": "* ‍Announces expansion of FedEx SameDay City  a local courier delivery service  to Jacksonville​ Source text for Eikon: Further company coverage:",
        "date": "08212017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-FedEx Office extends SameDay City Service to Jacksonville "
    },
    {
        "content": "* Announces expansion of FedEx SameDay City  a local courier delivery service  to Austin and San Antonio​ Source text for Eikon: Further company coverage:",
        "date": "08212017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-Fedex Office expands SameDay City Service in Texas "
    },
    {
        "content": "* Paulson & Co ups share stake in FedEx Corp by 52.3 percent to 75 400 shares - SEC filing",
        "date": "08142017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Paulson & Co ups share stake in FedEx "
    },
    {
        "content": "* Fedex Corp  - Ceo Frederick W. Smith's 2017 total annual compensation was $15.6 million versus $16.8 million in 2016 Source text: (http://bit.ly/2w7Ir8N) Further company coverage:",
        "date": "08142017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-Fedex Corp's CEO Frederick W. Smith 's 2017 total annual compensation was $15.6 million "
    },
    {
        "content": "FedEx Corp  said on Thursday it will not charge customers extra fees for most packages delivered to homes during the peak holiday shopping season this year  challenging rival United Parcel Service  which plans more widespread peak-season surcharges.",
        "date": "08032017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx will not charge extra for most holiday home deliveries "
    },
    {
        "content": "Aug 3 FedEx Corp said on Thursday it will not charge customers extra fees for most packages delivered to homes during the peak holiday shopping season this year  challenging rival United Parcel Service  which plans more widespread peak-season surcharges.",
        "date": "08032017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 2-FedEx will not charge extra for most holiday home deliveries "
    },
    {
        "content": "* FedEx - will not apply residential holiday season surcharges  except in case of packages requiring additional handling  are oversized/ unauthorized",
        "date": "08032017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-Fedex says will not apply residential holiday season surcharges "
    },
    {
        "content": "Aug 3 FedEx Corp said on Thursday it will not apply residential surcharges during the 2017 holiday season  except for packages that require additional handling  are oversized or unauthorized.",
        "date": "08032017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx says will not apply residential surcharge for holiday season "
    },
    {
        "content": "* Fedex corp -on july 17  2017  board  approved a performance-based cash award for Alan Graf  Jr.  Executive Vice President And Cfo",
        "date": "07202017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Fedex board approves performance-based cash award for CFO Alan Graf  Jr. "
    },
    {
        "content": "* Fedex Corp Executive Vice President  General Counsel and Secretary  Christine P. Richards  to retire September 30  2017",
        "date": "07202017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-Fedex general counsel and secretary to retire September 2017 "
    },
    {
        "content": "* City and road drivers in Croydon voted to decertify teamsters union as their bargaining representative Source text for Eikon: Further company coverage:",
        "date": "07202017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-Fedex freight drivers reject Teamsters in Pennsylvania "
    },
    {
        "content": "Package delivery company FedEx Corp  said a disruption in services in its TNT Express unit following a cyber attack last month would hurt its full-year results.",
        "date": "07172017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx says cyber attack to hurt full-year results "
    },
    {
        "content": "July 17 Package delivery company FedEx Corp said a disruption in services in its TNT Express unit following a cyber attack last month would hurt its full-year results.",
        "date": "07172017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 2-FedEx says cyber attack to hurt full-year results "
    },
    {
        "content": "* FedEx Corp - as of date of 10-K filing  all TNT Express depots  hubs and facilities are operational and most TNT services are available - SEC filing",
        "date": "07172017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-FedEx says all TNT Express depots  hubs and facilities are operational "
    },
    {
        "content": "* Says ‍\"reaffirms commitment to improve FedEx express operating income by $1.2-$1.5 billion by FY 2020\"​ Source text for Eikon: Further company coverage:",
        "date": "07172017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-FedEx reaffirms commitment to improve Express operating income "
    },
    {
        "content": "* Boeing  Fedex Express to collaborate on ecoDemonstrator testing",
        "date": "07062017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Boeing  Fedex Express to collaborate on ecoDemonstrator testing "
    },
    {
        "content": "June 28 Package delivery company FedEx Corp said on Wednesday operations of its TNT Express unit were disrupted after being hit by an information system virus attack.",
        "date": "06282017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx says operations at TNT Express disrupted after virus attack "
    },
    {
        "content": "* FedEx spokeswoman says \"FedEx systems are operating normally after resolving limited functionality issues overnight.\" Further company coverage: (Bengaluru Newsroom)",
        "date": "06272017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-FedEx spokeswoman says \"FedEx systems are operating normally after resolving limited functionality issues overnight.\" "
    },
    {
        "content": "June 28 Package delivery company FedEx Corp said on Wednesday operations in its TNT Express unit were disrupted after its information systems were hit by a virus attack.",
        "date": "06282017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 1-FedEx says operations at TNT Express disrupted after virus attack "
    },
    {
        "content": "* The Fedex site is down  working to resolve the issue - Fedex tweet Further company coverage:",
        "date": "06272017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-Fedex site is down  working to resolve the issue - tweet "
    },
    {
        "content": "FedEx Corp's  quarterly profit beat analysts' estimates and the package delivery company forecast higher earnings for fiscal 2018 as it gains from the acquisition of TNT Express and higher sales across its business units.",
        "date": "06202017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx forecasts higher profit for FY 2018 "
    },
    {
        "content": "* Says no final decision on additional peak pricing changes (Adds details from conference call  analyst comment; updates shares)",
        "date": "06202017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 2-FedEx forecasts higher profit for FY 2018 "
    },
    {
        "content": "* FedEx Corp. Reports record fourth quarter and full-year earnings",
        "date": "06202017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-FedEx Q4 adjusted earnings per share $4.25 "
    },
    {
        "content": "June 20 Package delivery company FedEx Corp reported a quarterly profit compared with loss in the year-ago period  boosted by higher sales across all its business units.",
        "date": "06202017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx reports quarterly profit "
    },
    {
        "content": "* FedEx may get involved with Trump's push to privatize airports- CNBC  citing source Source http://cnb.cx/2s429OM",
        "date": "06122017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-FedEx may get involved with Trump's push to privatize airports- CNBC  citing source "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.50 per share Source text for Eikon: Further company coverage:",
        "date": "06122017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-Fedex sets quarterly cash dividend of $0.50 per share "
    },
    {
        "content": "Two FedEx mechanics have accused the shipping company of short-changing thousands of its workers nationwide who took military leave to serve in the National Guard and reserves by contributing less to their pensions than they were entitled to.",
        "date": "05152017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx workers accuse company of pension calculation errors in class action "
    },
    {
        "content": "WASHINGTON FedEx said on Friday it was experiencing issues with some of its Microsoft Corp Windows systems in relation to a global cyber attack that had disrupted hospitals in England and infected computers in dozens of other countries around the world.",
        "date": "05122017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx reports malware interference in global cyberattack: statement "
    },
    {
        "content": "WASHINGTON  May 12 FedEx said on Friday it was experiencing issues with some of its Microsoft Corp Windows systems in relation to a global cyber attack that had disrupted hospitals in England and infected computers in dozens of other countries around the world.",
        "date": "05122017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx reports malware interference in global cyberattack -statement "
    },
    {
        "content": "* FedEx says it is \"experiencing interference with some of our windows-based systems caused by malware\" as part of the cyberattack - NBC Further company coverage:",
        "date": "05122017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-FedEx experiencing interference with some windows-based systems as part of cyberattack -  NBC "
    },
    {
        "content": "WASHINGTON Federal Express Corp  was awarded a five-year $2.35 billion contract  the Pentagon said on Wednesday.",
        "date": "04262017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Fedex wins $2.35 billion U.S. defense contract: Pentagon "
    },
    {
        "content": "WASHINGTON  April 26 Federal Express Corp was awarded a five-year $2.35 billion contract  the Pentagon said on Wednesday.",
        "date": "04262017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "Fedex wins $2.35 bln U.S. defense contract -Pentagon "
    },
    {
        "content": "SAN FRANCISCO The U.S. Justice Department in San Francisco has instituted new oversight for complex cases  a federal prosecutor said  following a failed drug conspiracy prosecution against delivery service FedEx Corp.",
        "date": "04182017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "U.S. prosecutors to monitor corporate cases after failed FedEx trial "
    },
    {
        "content": "SAN FRANCISCO The U.S. Justice Department in San Francisco has instituted new oversight for complex cases  a federal prosecutor said  following a failed drug conspiracy prosecution against delivery service FedEx Corp .",
        "date": "04172017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "U.S. prosecutors to monitor corporate cases after failed FedEx trial "
    },
    {
        "content": "SAN FRANCISCO  April 17 The U.S. Justice Department in San Francisco has instituted new oversight for complex cases  a federal prosecutor said  following a failed drug conspiracy prosecution against delivery service FedEx Corp .",
        "date": "04172017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "REFILE-U.S. prosecutors to monitor corporate cases after failed FedEx trial "
    },
    {
        "content": "NEW YORK FedEx Corp  on Tuesday reported worse-than-expected quarterly operating earnings  but an optimistic outlook for margins in the near-term soothed investor concerns and pushed the stock higher in after-hours trading.",
        "date": "03212017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx misses on earnings  but sees higher margins ahead "
    },
    {
        "content": "NEW YORK  March 21 FedEx Corp on Tuesday reported worse-than-expected quarterly operating earnings  but an optimistic outlook for margins in the near-term soothed investor concerns and pushed the stock higher in after-hours trading.",
        "date": "03212017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 2-FedEx misses on earnings  but sees higher margins ahead "
    },
    {
        "content": "March 21 Package delivery company FedEx Corp  reported an 18.5 percent rise in quarterly revenue  helped by the TNT Express acquisition and strength in its ground business  its second biggest unit.",
        "date": "03212017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx quarterly revenue rises 18.5 percent "
    },
    {
        "content": "A federal appeals court on Wednesday revived age discrimination claims against Federal Express Corp by a former manager  saying a lower court erred in finding that derogatory comments a supervisor made about older workers were irrelevant.",
        "date": "03152017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "6th Circuit delivers win to former FedEx worker in age bias case "
    },
    {
        "content": "* FedEx Express will use Boeing 777 freighters offering 116 tons of capacity for Liège-Memphis service",
        "date": "03212017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-FedEx Express to launch Liege-Memphis flight "
    },
    {
        "content": "BRUSSELS  March 7 An EU court agreed with United Parcel Service on  Tuesday that the EU had wrongly blocked its takeover of Dutch peer TNT four years ago  potentially allowing the world's largest package delivery company to sue regulators for damages.",
        "date": "03072017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 2-UPS wins court challenge against EU block to TNT bid "
    },
    {
        "content": "HONG KONG (Reuters Breakingviews) - Stock-market investors have sent a love letter to China's FedEx. A rally in the newly listed firm behind SF Express makes boss Wang Wei one of China's richest men. At roughly $40 billion  his company is now worth nearly as much as Deutsche Post. That looks like an overreaction  driven by hype over e-commerce and a shortage of tradable shares.",
        "date": "03022017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Market delivers crazy love letter to China's FedEx "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.40per share  Source text for Eikon:  Further company coverage:",
        "date": "02172017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Fedex sets quarterly cash dividend of $0.40 per share "
    },
    {
        "content": "* Paulson & co cuts share stake in fedex corp by 89.7 percent to 11 000 shares  - sec filing",
        "date": "02142017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Paulson & Co cuts share stake in Fedex  Mylan "
    },
    {
        "content": "SAN FRANCISCO Amazon.com Inc plans to invest $1.49 billion to build a large air cargo hub in northern Kentucky  state officials said on Tuesday  stoking expectations it may one day opt to directly compete with FedEx Corp and United Parcel Service Inc. | Video ",
        "date": "02012017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Amazon to spend $1.49 billion on air cargo hub  fans talk of bigger ambitions "
    },
    {
        "content": "CHICAGO  Jan 31 Facing lower margins from its rising e-commerce business  package delivery company United Parcel Service Inc said on Tuesday that it would pull forward investments in automation and technology and could raise prices to offset the reduced profits from delivering packages to consumers.",
        "date": "01312017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 5-Facing rising e-commerce  UPS looks to automation  higher prices "
    },
    {
        "content": "SAN FRANCISCO  Jan 31 Amazon.com Inc  plans to invest $1.49 billion to build a large air cargo hub in northern Kentucky  state officials said on Tuesday  stoking expectations it may one day opt to directly compete with FedEx Corp and United Parcel Service Inc.",
        "date": "02012017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "Amazon to spend $1.49 bln on air cargo hub  fans talk of bigger ambitions "
    },
    {
        "content": "* David J. Bronczek promoted to President and Chief Operating Officer of FedEx Corp.",
        "date": "01232017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-FedEx names David Bronczek COO "
    },
    {
        "content": "WASHINGTON U.S. President Donald Trump should reconsider his positions on international trade and work to embrace China and its vast market  FedEx Corp's  chief executive officer said on Tuesday  one day after Trump made good on a campaign promise to pull out of a major trade deal with Asian allies.",
        "date": "01242017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx CEO calls Trump's withdrawal from trade deal 'unfortunate' "
    },
    {
        "content": "WASHINGTON  Jan 24 U.S. President Donald Trump should reconsider his positions on international trade and work to embrace China and its vast market  FedEx Corp's chief executive officer said on Tuesday  one day after Trump made good on a campaign promise to pull out of a major trade deal with Asian allies.",
        "date": "01242017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 3-FedEx CEO calls Trump's withdrawal from trade deal 'unfortunate' "
    },
    {
        "content": "WASHINGTON  Jan 24 U.S. President Donald Trump should reconsider his positions on international trade and work to embrace China and its vast market  FedEx Corp CEO Fred Smith said on Tuesday  one day after Trump made good on his campaign pledge to pull out of the Trans-Pacific Partnership trade deal with Asian allies.",
        "date": "01242017",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx CEO urges Trump to rethink trade  embrace China "
    },
    {
        "content": "* Walgreens and FedEx team up to offer FedEx dropoff and pickup at thousands of Walgreens locations nationwide",
        "date": "01112017",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Walgreens and FedEx teams up to offer FedEx dropoff and pickup at Walgreens locations nationwide "
    },
    {
        "content": "CHICAGO Package delivery company FedEx Corp  on Tuesday reported a higher quarterly net profit  boosted by revenue growth across all business units but results lagged Wall Street expectations and the company's stock fell nearly 3 percent in after-market trading.",
        "date": "12202016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx quarterly profit up but misses expectations; stock falls "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.40per share  Source text for Eikon:  Further company coverage:",
        "date": "11182016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Fedex Corp sets quarterly cash dividend of $0.40per share "
    },
    {
        "content": "FedEx Corp is grounding one of its planes temporarily that has an engine General Electric Co flagged after a passenger jet erupted in flames last month  a spokesman for the cargo airline told Reuters on Monday.",
        "date": "11082016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Exclusive: FedEx grounds one plane over GE engine part concern "
    },
    {
        "content": "BEIJING - China's October exports fell 7.3 percent from a year earlier   while imports shrank 1.4 percent  both declining more than expected  official data showed. (CHINA-ECONOMY/TRADE (URGENT)  moved  125 words)",
        "date": "11082016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "Reuters Business News Schedule at 0430 GMT/00.30AM ET "
    },
    {
        "content": "The landing gear of a FedEx Corp.  DC-10 cargo plane collapsed on Friday at the main airport in Fort Lauderdale  Florida  causing a fire that was quickly extinguished  the U.S. Federal Aviation Administration said. | Video ",
        "date": "10292016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx plane catches fire at airport in Fort Lauderdale  Florida "
    },
    {
        "content": "* Boeing will send a technical team to Ft. Lauderdale to assist in the NTSB investigation of the FedEx DC-10 - tweet  Further company coverage:",
        "date": "10292016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-Boeing will send technical team to Ft. Lauderdale to assist in the NTSB investigation of the FedEx DC-10 "
    },
    {
        "content": "Oct 28 A FedEx Corp. airplane caught fire on Friday at an airport in Fort Lauderdale  Florida and the fire has been extinguished  a company spokeswoman said  giving no details on whether anyone was injured in the incident.",
        "date": "10282016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx plane catches fire at airport in Fort Lauderdale  Florida "
    },
    {
        "content": "* US FAA says FeDex flight 910  DC-10  MEM>FLL  landing gear collapsed  fire extinguished  runway 10l closed  ground stop Ft. Laude-Hlwd Interest'l  Further company coverage:",
        "date": "10282016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-US FAA says FeDex flight 910 landing gear collapsed  fire extinguished "
    },
    {
        "content": "* ZTO selling 72.1 mln ADS in New York in $16.50-$18.50 range",
        "date": "10212016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "ZTO spurns huge China valuations for benefits of US listing "
    },
    {
        "content": "PARIS Package delivery company FedEx Corp  said on Tuesday it would invest 1.4 billion euros ($1.5 billion) to double the capacity of its logistics activities at Charles de Gaulle International Airport in the Paris suburb of Roissy.",
        "date": "10192016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx to invest $1.5 billion in France to double capacity at Roissy airport "
    },
    {
        "content": "PARIS  Oct 18 Package delivery company FedEx Corp said on Tuesday it would invest 1.4 billion euros ($1.5 billion) to double the capacity of its logistics activities at Charles de Gaulle International Airport in the Paris suburb of Roissy.",
        "date": "10182016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "UPDATE 1-FedEx to invest $1.5 bln in France to double capacity at Roissy airport "
    },
    {
        "content": "PARIS  Oct 18 Package delivery company FedEX Corp said on Tuesday it would invest 1.4 billion euros ($1.54 billion) to double the capacity of its logistics activities at the Charles de Gaulle International Airport in the Paris suburb of Roissy.",
        "date": "10182016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "Fedex to invest $1.54 billion in France to double capacity at Roissy airport "
    },
    {
        "content": "A federal appeals court on Wednesday grappled with whether to uphold a National Labor Relations Board decision that FedEx Home Delivery drivers in Connecticut were employees despite the court's earlier ruling that strikingly similar drivers were independent contractors.",
        "date": "09222016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "D.C. Circuit mulls NLRB decision that FedEx drivers were employees "
    },
    {
        "content": "* Fedex to increase shipping rates for express  ground and freight services",
        "date": "09192016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Fedex to raise shipping rates for express ground freight services "
    },
    {
        "content": "CHICAGO Package delivery company FedEx Corp  said on Tuesday quarterly profit rose more than expected on stronger revenue in its express  ground and freight business units  lifting its stock by almost 3 percent.",
        "date": "09202016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Rising revenue boosts FedEx quarterly profit "
    },
    {
        "content": "CHICAGO  Sept 20 Package delivery company FedEx Corp said on Tuesday quarterly profit rose more than expected on stronger revenue in its express  ground and freight business units  lifting its stock by almost 3 percent.",
        "date": "09202016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 3-Rising revenue boosts FedEx quarterly profit "
    },
    {
        "content": "* Sees fy 2017 earnings per share $11.85 to $12.35 excluding items",
        "date": "09202016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-FedEx posts Q1 adjusted earnings of $2.90/share "
    },
    {
        "content": "CHICAGO  Sept 20 Package delivery company FedEx Corp on Tuesday reported a higher net profit  driven by rising revenue in its express  ground and freight business units.",
        "date": "09202016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx quarterly profit rises "
    },
    {
        "content": "* Fedex freight invests in cng fueling at oklahoma city service center",
        "date": "09132016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Fedex Freight invests in CNG fueling at Oklahoma city service center "
    },
    {
        "content": "* International Brotherhood Of Teamsters -urges Fedex shareholders to vote against advisory vote to approve executive compensation at AGM - sec filing  Source text (http://bit.ly/2bFW7Qz) Further company coverage:",
        "date": "09012016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-International Brotherhood Of Teamsters urges Fedex shareholders to vote against advisory vote to approve executive compensation at AGM "
    },
    {
        "content": "* Entered into a five-year agreement with FedEx express to provide it with five 747-400 freighter aircraft",
        "date": "08242016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Atlas Air Worldwide says announces new contract with FedEx "
    },
    {
        "content": "* Sets quarterly cash dividend of $0.40 per share  Source text for Eikon:  Further company coverage:",
        "date": "08192016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Fedex sets quarterly cash dividend of $0.40 per share "
    },
    {
        "content": "* Ups share stake in Valeant Pharmaceuticals International Inc by 43.6 pct to 19.1 mln shares - SEC filing",
        "date": "08152016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Paulson & Co raises share stake in Valeant  Facebook - SEC filing "
    },
    {
        "content": "* CEO Frederick Smith's FY 2016 total compensation was $16.8 million versus $13.8 million in FY 2015 - SEC Filing",
        "date": "08152016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-Fedex CEO Frederick Smith's FY 2016 total compensation $16.8 million "
    },
    {
        "content": "SAN FRANCISCO/WASHINGTON  July 15 The U.S. Department of Justice has begun a rare internal examination of what went wrong in the prosecution of a controversial drug conspiracy case against delivery service Federal Express   the department's top prosecutor in San Francisco told Reuters.",
        "date": "07152016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "U.S. prosecutors launch review of failed FedEx drug case "
    },
    {
        "content": "SAN FRANCISCO/WASHINGTON  July 15 The U.S. Department of Justice has begun a rare internal examination of what went wrong in the prosecution of a controversial drug conspiracy case against delivery service Federal Express   the department's top prosecutor in San Francisco told Reuters.",
        "date": "07152016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "repeat-U.S. prosecutors launch review of failed FedEx drug case "
    },
    {
        "content": "CHICAGO Package delivery company FedEx Corp  on Tuesday reported a quarterly loss due to mark-to-market pension adjustments and expenses related to acquiring Dutch package delivery company TNT  and said it did not know how those two factors would affect its earnings for the coming fiscal year.",
        "date": "06212016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Pensions hit FedEx  may weigh on fiscal 2017 results "
    },
    {
        "content": "CHICAGO  June 21 Package delivery company FedEx Corp on Tuesday reported a quarterly loss due to mark-to-market pension adjustments and expenses related to acquiring Dutch package delivery company TNT  and said it did not know how those two factors would affect its earnings for the coming fiscal year.",
        "date": "06212016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 3-Pensions hit FedEx  may weigh on fiscal 2017 results "
    },
    {
        "content": "SAN FRANCISCO The U.S. Department of Justice on Friday dismissed all criminal charges against FedEx Corp  in a case where the company was accused of shipping packages from illegal online pharmacies despite repeated warnings  according to a court filing.",
        "date": "06172016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "U.S. ends $1.6 billion criminal case against FedEx "
    },
    {
        "content": "* With adjustments  Fedex's Q4 earnings were $3.30 per diluted share",
        "date": "06212016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-Fedex Q4 loss per share $0.26 "
    },
    {
        "content": "CHICAGO  June 21 Package delivery company FedEx Corp on Tuesday reported a quarterly loss  citing mark-to-market pension adjustments and expenses related to its acquisition of Dutch package delivery company TNT.",
        "date": "06212016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx posts loss due to pension accounting adjustments "
    },
    {
        "content": "SAN FRANCISCO  June 17 The U.S. Department of Justice on Friday dismissed all criminal charges against FedEx Corp in a case where the company was accused of shipping packages from illegal online pharmacies despite repeated warnings  according to a court filing.",
        "date": "06172016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 1-U.S. ends $1.6 billion criminal case against FedEx "
    },
    {
        "content": "SAN FRANCISCO  June 17 The U.S. Department of Justice on Friday dismissed all criminal charges against FedEx Corp  according to a court filing  in a case where the company was accused of shipping packages from illegal online pharmacies despite repeated warnings.    (Reporting by Dan Levine)",
        "date": "06172016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "U.S. ends criminal case against FedEx over online pharmacies "
    },
    {
        "content": "* Fedex announces successful conclusion of internet pharmacy case",
        "date": "06172016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-Fedex says concluded internet pharmacy case "
    },
    {
        "content": "June 6 Fedex Corp * Sets quarterly cash dividend of $0.40 per share * Raises quarterly cash dividend from $0.25 per share Source text for Eikon: Further company coverage: ",
        "date": "06062016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Fedex raises quarterly dividend to $0.40/shr from $0.25/shr "
    },
    {
        "content": "* Following statutory buy-out proceedings  FedEx will own 100 pct of TNT Express",
        "date": "06022016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-FedEx holds 98.45% of all tnt express shares "
    },
    {
        "content": "* Fedex has settled tnt express shares tendered in acceptance period",
        "date": "05252016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Fedex acquires TNT Express "
    },
    {
        "content": "* Remaining tnt express shares can be tendered during post-closing acceptance period  commencing on 19 may 2016 and ending on 1 june 2016  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom: +1 646 223 8780)",
        "date": "05182016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Fedex declares offer for TNT Express unconditional "
    },
    {
        "content": "* Fedex and tnt express announce that 88.4% of all tnt express shares have been tendered  Source text for Eikon:  Further company coverage:    (Bengaluru Newsroom +1-646-223-8780)",
        "date": "05132016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-FedEx  TNT Express announce that 88.4 pct of all TNT shares have been tendered "
    },
    {
        "content": "* Ministry of commerce People's republic of china unconditionally approves Fedex intended acquisition of TNT Express",
        "date": "04292016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Fedex intended acquisition of TNT Express approved in China "
    },
    {
        "content": "* Q1 revenue of 1.59 billion euro versus 1.62 billion euro  ($1.82 billion) a year ago",
        "date": "04252016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-TNT Express Q1 revenue down at 1.59 billion euro "
    },
    {
        "content": "* On April 11  2016  FedEx corporation issued EUR 500 million aggregate principal amount of its floating rate notes due 2019",
        "date": "04112016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-FedEx on April 11  2016 issued EUR 500 mln aggregate principal amount of its floating rate notes due 2019 "
    },
    {
        "content": "NEW YORK  April 1 FedEx Corp must face a second lawsuit claiming it shipped thousands of cartons of untaxed cigarettes in New York over roughly a decade  cheating the state and New York City out of tax revenue and undercutting their efforts to curb smoking.",
        "date": "04012016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx fails to end New York lawsuit over illegal cigarettes "
    },
    {
        "content": "March 28 Cosmetics maker Avon Products Inc  said it named former FedEx Corp executive Cathy Ross as a director to its board.",
        "date": "03282016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Avon adds former FedEx executive Cathy Ross to board "
    },
    {
        "content": "* Issued $750 million aggregate principal amount of its 3.250% notes due 2026",
        "date": "03242016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-FedEx issues $750 mln aggregate principal amount of 3.250 pct notes due 2026 "
    },
    {
        "content": "CHICAGO Package delivery company FedEx Corp  forecast better than expected full year earnings and reported fiscal third quarter earnings that also beat analysts expectations  sending its stock up 5.0 percent in after-hours trade on Wednesday.",
        "date": "03162016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Robust FedEx fiscal 2016 outlook sends stock up 5.0 percent "
    },
    {
        "content": "Shares of U.S. delivery services company FedEx Corp  could rise another 15 to 20 percent over the next year after soaring 12 percent on Thursday  Barron's reported on Sunday.",
        "date": "03212016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx shares could rise 15-20 percent over next year: Barron's "
    },
    {
        "content": "CHICAGO  March 16 Package delivery company FedEx Corp forecast better than expected full year earnings and reported fiscal third quarter earnings that also beat analysts expectations  sending its stock up 5.0 percent in after-hours trade on Wednesday.",
        "date": "03162016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 2-Robust FedEx fiscal 2016 outlook sends stock up 5.0 percent "
    },
    {
        "content": "* Moody's downgrades Fedex' long term ratings  senior unsecured to Baa2; stable outlook",
        "date": "03152016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Moody's downgrades Fedex' long term ratings  senior unsecured to Baa2 "
    },
    {
        "content": "March 9 Amazon.com Inc said on Wednesday it had signed a deal to lease 20 Boeing 767 widebody freighter aircraft to handle more of its own deliveries in the United States.",
        "date": "03092016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "UPDATE 3-Amazon to start air delivery network with leasing deal "
    },
    {
        "content": "* Reports Q4 revenues of 1 861 million euros ($2.08 billion)  up 4.1 pct yoy",
        "date": "02162016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-TNT Express Q4 operating result turns to profit of 57 mln euros "
    },
    {
        "content": "AMSTERDAM  Feb 5 TNT Express will sell its airline operations to ASL Aviation Group to comply with European Union rules if the Dutch logistics company's sale to larger rival FedEx goes ahead  the company said on Friday.",
        "date": "02052016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "TNT to sell airlines to meet EU rules after FedEx acquisition "
    },
    {
        "content": "* \u007fBrazil's Conselho Administrativo De Defesa Econômica unconditionally approves Fedex intended acquisition of TNT Express\u007f  Source text for Eikon:  Further company coverage:    (Gdynia Newsroom)",
        "date": "02022016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-Fedex intended acquisition of TNT Express approved by Brazilian reg. authority\u007f "
    },
    {
        "content": "NEW YORK  Jan 27 A U.S. judge on Wednesday dismissed a U.S. racketeering lawsuit claiming FedEx Corp  overcharged customers by inflating package weights  and wrongly collecting customs duties on products sent to Canada from shippers instead of recipients.",
        "date": "01272016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "U.S. judge dismisses FedEx billing fraud  racketeering lawsuit "
    },
    {
        "content": "NEW YORK  Jan 27 A U.S. judge on Wednesday dismissed a federal racketeering lawsuit claiming FedEx Corp  overcharged customers by inflating package weights  and wrongly collecting customs duties on products sent to Canada from shippers instead of recipients.",
        "date": "01272016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 1-U.S. judge dismisses FedEx billing fraud  racketeering lawsuit "
    },
    {
        "content": "Jan 8 The following bids  mergers  acquisitions and disposals were reported by 2100 GMT on Friday:",
        "date": "01082016",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "BRUSSELS  Jan 8 The following are mergers under review by the European Commission and a brief guide to the EU merger process:",
        "date": "01082016",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "EU mergers and takeovers (Jan 8) "
    },
    {
        "content": "CHICAGO  Dec 29 After two consecutive years of problems during its holiday peak package season  UPS delivered on time at Christmas this year while its main rival FedEx had a last-minute stumble that left some gifts undelivered until after the holiday.",
        "date": "12292015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "Third time's a charm for UPS at Christmas  but FedEx stumbles "
    },
    {
        "content": "CHICAGO Package delivery company FedEx Corp  on Wednesday reported a better-than-expected quarterly net profit  saying higher margins  cost-cutting and a lower effective tax rate offset weak industrial production and global trade.",
        "date": "12162015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx profit beats forecasts as margins rise; shares jump "
    },
    {
        "content": "CHICAGO  Dec 16 Package delivery company FedEx Corp on Wednesday reported a better-than-expected quarterly net profit  saying higher margins  cost-cutting and a lower effective tax rate offset weak industrial production and global trade.",
        "date": "12162015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 2-FedEx profit beats forecasts as margins rise; shares jump "
    },
    {
        "content": "CHICAGO  Dec 16 Package delivery company FedEx Corp on Wednesday reported a higher quarterly net profit  reflecting higher margins and cost-cutting and a lower effective tax rate.",
        "date": "12162015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx quarterly profit rises "
    },
    {
        "content": "WASHINGTON  Nov 24 Tennessee-based Fedex Corp  and Dutch counterpart TNT Express have won U.S. antitrust permission to merge  according to a listing of approved deals the Federal Trade Commission issued on Tuesday.",
        "date": "11242015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "Fedex  TNT win U.S. approval to merge "
    },
    {
        "content": "CHICAGO Package delivery company FedEx Corp  said on Monday that it expects to see a record number of shipments during this year's busy holiday season  driven by rising retail sales and a jump in ecommerce.",
        "date": "10262015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx sees record holiday shipments on rising retail  e-commerce "
    },
    {
        "content": "BRUSSELS EU antitrust regulators have no objections to FedEx's 4.4 billion euro ($5 billion) acquisition of Dutch peer TNT Express  the companies said on Tuesday  confirming what two people familiar with the matter previously told Reuters.",
        "date": "10202015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx  TNT say no EU antitrust objections to $5 billion merger "
    },
    {
        "content": "CHICAGO  Oct 26 Package delivery company FedEx Corp said on Monday that it expects to see a record number of shipments during this year's busy holiday season  driven by rising retail sales and a jump in ecommerce.",
        "date": "10262015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx sees record holiday shipments on rising retail  ecommerce "
    },
    {
        "content": "BRUSSELS  Oct 20 EU antitrust regulators have no objections to FedEx's 4.4 billion euro ($5 billion) acquisition of Dutch peer TNT Express  the companies said on Tuesday  confirming what two people familiar with the matter previously told Reuters.",
        "date": "10202015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 3-FedEx  TNT say no EU antitrust objections to $5 bln merger "
    },
    {
        "content": "CHICAGO Package delivery company FedEx Corp  posted a higher quarterly profit on Wednesday  but missed Wall Street expectations due to weak global economic conditions and the strong U.S. dollar. | Video ",
        "date": "09162015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx profit misses expectations  lowers earnings forecast "
    },
    {
        "content": "CHICAGO  Sept 16 Package delivery company FedEx Corp posted a higher quarterly profit on Wednesday  but missed Wall Street expectations due to weak global economic conditions and the strong U.S. dollar.",
        "date": "09162015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 2-FedEx profit misses expectations  lowers earnings forecast "
    },
    {
        "content": "CHICAGO  Sept 16 Package delivery company FedEx Corp on Wednesday reported a higher quarterly net profit  but missed Wall Street estimates as weak global economic conditions and the strong U.S. dollar weighed on results.",
        "date": "09162015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx quarterly earnings rise  miss Wall Street estimates "
    },
    {
        "content": "SEOUL  Sept 11 It's not Amazon or FedEx  but in North Korea's fledgling market economy a fleet of repurposed old passenger buses is the next best thing for moving trade goods  from rice to textiles and livestock  between far-flung corners of the country.",
        "date": "09102015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "In North Korea  deals on the bus make markets go round "
    },
    {
        "content": "Aug 28 FedEx Corp pilot union's executive council has voted in favor of a tentative contract that seeks better employment terms including higher hourly pay rates and retirement plan enhancement  the Air Line Pilots Association said.",
        "date": "08282015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx pilot union's executive council votes in favor of labor contract "
    },
    {
        "content": "A federal appeals court on Friday overturned a lower court's finding that FedEx drivers in Missouri were employees and not independent contractors  dealing the shipping giant a victory in its nationwide legal battle over job classification.",
        "date": "08242015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Appeals court sends FedEx driver classification case to Missouri jury "
    },
    {
        "content": "FedEx  pilots tentatively agreed with the package delivery company on an amended collective bargaining agreement  the Air Line Pilots Association (ALPA) said.",
        "date": "08212015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Fedex reaches tentative agreement with pilots "
    },
    {
        "content": "Aug 20 FedEx pilots tentatively agreed with the package delivery company on an amended collective bargaining agreement  the Air Line Pilots Association (ALPA) said.",
        "date": "08212015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 1-Fedex reaches tentative agreement with pilots "
    },
    {
        "content": "Aug 20 FedEx pilots tentatively agreed with the package delivery company on an amended collective bargaining agreement  the Air Line Pilots Association (ALPA) said.",
        "date": "08202015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "Fedex reaches tentative agreement with pilots "
    },
    {
        "content": "Aug 3 A challenge by U.S. airlines that accuses three Gulf carriers of distorting competition via government subsidies took another turn on Monday with the formation of a U.S. airline group that backs the Gulf-carriers' cause.",
        "date": "08032015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "New U.S. airline group backs Gulf carriers in Open Skies dispute "
    },
    {
        "content": "July 31 The following bids  mergers  acquisitions and disposals were reported by 2015 GMT on Friday:",
        "date": "07312015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "BRUSSELS The European Commission said on Friday it had opened an in-depth investigation into Fedex's  proposed 4.4 billion euro ($4.9 billion) takeover of Dutch rival TNT Express .",
        "date": "07312015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "EU opens in-depth inquiry into Fedex's planned takeover of TNT "
    },
    {
        "content": "BRUSSELS  July 31 The European Commission said on Friday it had opened an in-depth investigation into Fedex's  proposed 4.4 billion euro ($4.9 billion) takeover of Dutch rival TNT Express.",
        "date": "07312015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 1-EU opens in-depth inquiry into Fedex's planned takeover of TNT "
    },
    {
        "content": "* Has opened an in-depth investigation to assess whether the proposed acquisition of TNT Express by Fedex Corporation",
        "date": "07312015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-European Commission opens in-depth investigation into proposed acquisition of TNT by FedEx "
    },
    {
        "content": "AMSTERDAM  July 27 Dutch logistics company TNT Express reported underlying revenue growth of 4.1 percent in the second quarter  beating analysts' estimates  after revenue from small and medium units globally recovered after years of decline.",
        "date": "07272015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Small business recovery helps TNT Express ahead of FedEx takeover "
    },
    {
        "content": "NEW YORK  July 24 Amazon.com founder and Chief Executive Officer Jeff Bezos got a lot richer while he slept on Thursday night  after the company reported its quarterly earnings and its shares rose 20.1 percent.",
        "date": "07242015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 1-Amazon.com CEO Bezos up $8 billion  down $4 billion on stock swing "
    },
    {
        "content": "NEW YORK  July 24 Amazon.com founder and Chief Executive Officer Jeff Bezos got a lot richer while he slept on Thursday night  after the company reported its quarterly earnings and its shares rose 20.1 percent.",
        "date": "07242015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "Amazon.com CEO Bezos up $8 billion  down $3 billion on stock swing "
    },
    {
        "content": "SINGAPORE FedEx Corp   the world's largest cargo firm  has signed a deal to buy 50 additional Boeing Co  767-300 freighters in the biggest order ever for the plane  allowing the aircraft maker to extend its production line well into the next decade.",
        "date": "07222015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx orders 50 Boeing freighters in deal worth $9.97 billion at list prices "
    },
    {
        "content": "* Allows Boeing to extend production into next decade   (Adds comments from statement  industry context)",
        "date": "07222015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 1-FedEx orders 50 Boeing freighters in deal worth $9.97bn at list prices "
    },
    {
        "content": "SINGAPORE  July 22 Fedex Express  a subsidiary of the world's largest cargo firm FedEx Corp  has ordered 50 additional Boeing Co 767-300 freighters  the company said in a statement.",
        "date": "07222015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx orders 50 Boeing freighters in deal worth $9.97bn at list prices "
    },
    {
        "content": "Package delivery company FedEx Corp  is in talks to buy at least 25 more 767 freighters from Boeing Co  for about $5 billion  Bloomberg reported  citing people familiar with the matter.",
        "date": "07142015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx in talks to buy 25 Boeing 767 freighters: Bloomberg "
    },
    {
        "content": "July 14 Package delivery company FedEx Corp  is in talks to buy at least 25 more 767 freighters from Boeing Co for about $5 billion  Bloomberg reported  citing people familiar with the matter.",
        "date": "07142015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx in talks to buy 25 Boeing 767 freighters - Bloomberg "
    },
    {
        "content": "FedEx drivers in Kansas were misclassified as independent contractors under state law  a U.S. appeals court said Wednesday  weeks after the company agreed to pay more than $200 million to settle similar claims in California.",
        "date": "07092015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Kansas FedEx drivers were employees - 7th Circuit "
    },
    {
        "content": "BRUSSELS  June 29 European Union antitrust regulators will rule by Aug. 3 whether to clear U.S. package delivery service company FedEx's 4.4-billion-euro ($4.9 billion) bid for Dutch peer TNT Express  the European Commission said on Monday.",
        "date": "06292015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "EU regulators to decide on Fedex's   TNT deal by Aug. 3 "
    },
    {
        "content": "June 26 The following bids  mergers  acquisitions and disposals were reported by 1330 GMT on Friday:",
        "date": "06262015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "Brooks Koepka fired a three-under-par 67 for a one-shot lead after the second round of the FedEx St. Jude Classic in Memphis on Friday. Big-hitting Koepka made four birdies and a single bogey to move to nine under for the tournament  with Austin Cook a shot behind after one of the day’s top rounds  a six-under 64.",
        "date": "06132015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Koepka hits the front at St. Jude Classic "
    },
    {
        "content": "* Indexes up: Dow 0.17 pct  S&P 0.2 pct  Nasdaq 0.18 pct   (Updates to close)",
        "date": "06172015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "US STOCKS-Wall St ends higher in choppy post-Fed trading "
    },
    {
        "content": "CHICAGO Package delivery company FedEx Corp  on Wednesday posted a fiscal fourth-quarter net loss of $895 million  weighed by pension costs  a stronger dollar and lower fuel surcharges.",
        "date": "06172015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx swings to quarterly net loss  weighed by pensions "
    },
    {
        "content": "CHICAGO  June 17 Package delivery company FedEx Corp on Wednesday posted a fiscal fourth-quarter net loss of $895 million  weighed by pension costs  a stronger dollar and lower fuel surcharges.",
        "date": "06172015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 2-FedEx swings to quarterly net loss  weighed by pensions "
    },
    {
        "content": "* Indexes up: Dow 0.29 pct  S&P 0.26 pct  Nasdaq 0.29 pct   (Updates to open)",
        "date": "06172015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "US STOCKS-Wall St opens higher ahead of Fed statement "
    },
    {
        "content": "* Futures up: Dow 40 pts  S&P 3.5 pts  Nasdaq 5.25 pts   (Adds details  comment; updates prices)",
        "date": "06172015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "US STOCKS-Wall St set to open little changed ahead of Fed statement "
    },
    {
        "content": "CHICAGO  June 17 Package delivery firm FedEx Corp on Wednesday reported a quarterly net loss due to a $2.2 non-cash pretax charge related to a move to mark-to-market accounting for employee pensions.",
        "date": "06172015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "CORRECTED-FedEx posts quarterly loss due to pension charges "
    },
    {
        "content": "Parcel delivery service FedEx Corp  said it would record a $2.2 billion non-cash pretax charge related to a change in the way it accounts for pensions.",
        "date": "06122015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx to take $2.2 billion charge on pension accounting change "
    },
    {
        "content": "* Settles independent contractor litigation for $228 mln   (Adds details on settlement)",
        "date": "06122015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 2-FedEx to take $2.2 bln charge on pension accounting change "
    },
    {
        "content": "June 12 Parcel delivery service FedEx Corp  said it would record a $2.2 billion non-cash pretax charge related to a change in the way it accounts for pensions.",
        "date": "06122015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx to take $2.2 bln charge on pension accounting change "
    },
    {
        "content": "A U.S. appeals court on Thursday handed FedEx its latest setback in a nationwide legal battle over the employment status of its drivers  reviving claims by workers in Florida that they were unlawfully classified as independent contractors.",
        "date": "05282015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Jury should decide whether FedEx drivers are employees - 11th Circuit "
    },
    {
        "content": "May 14 FedEx Corp lost a motion to dismiss charges by the U.S. Justice Department of conspiracy to distribute controlled substances in connection with the package delivery company's alleged role in transporting illegal prescription drugs.",
        "date": "05152015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx loses U.S. court motion to dismiss drug-shipping charges "
    },
    {
        "content": "A U.S. appeals court Tuesday ruled that a former FedEx Corp employee diagnosed with Lyme disease and other maladies but whose lab tests came back negative was not entitled to disability benefits.",
        "date": "05052015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "6th Circuit upholds denial of disability benefits for FedEx worker "
    },
    {
        "content": "CHICAGO Package delivery giant UPS does not expect to change its current expansion plan in Europe despite a recent acquisition bid by main rival FedEx that would knock the firm into third place on the continent  a top executive said on Tuesday.",
        "date": "04282015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "UPS CFO - Europe plans unchanged by possible TNT deal "
    },
    {
        "content": "* FedEx and TNT Express confirm that the companies are making timely progress on the preparations for the offer",
        "date": "05012015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "BRIEF-TNT Express says makes progress on FedEx deal "
    },
    {
        "content": "LONDON  April 8 Global stocks remained upbeat on Wednesday as a $70 billion mega-deal in the European oil and gas sector stoked the merger and acquisition fever that has gripped investors this week.",
        "date": "04082015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "GLOBAL MARKETS-Oil & gas mega-merger keeps stocks fizzing "
    },
    {
        "content": "NEW YORK U.S. stocks ended slightly lower on Tuesday  reversing course late in the session as strength in the dollar offset optimism about deal news.",
        "date": "04072015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Wall Street ends down  dollar gains offset deal news optimism "
    },
    {
        "content": "NEW YORK The U.S. dollar rose more than 1 percent on Tuesday  resuming a recent upward trend and weighing on Wall Street stocks as investors fretted the currency's strength would hurt multinational corporate profits.",
        "date": "04072015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "U.S. dollar rallies  eroding Wall Street gains "
    },
    {
        "content": "* Indexes down: Dow 0.03 pct  S&P 0.2 pct  Nasdaq 0.1 pct   (Updates to close)",
        "date": "04072015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "US STOCKS-Wall St ends down  dollar gains offset deal news optimism "
    },
    {
        "content": "April 7 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Tuesday:",
        "date": "04072015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "Deals of the day- Mergers and acquisitions "
    },
    {
        "content": "AMSTERDAM FedEx Corp  is to buy Dutch package delivery firm TNT Express  for an agreed 4.4 billion euros ($4.8 billion)  stepping up the challenge to rivals United Parcel Service  and Deutsche Post  in Europe. | Video ",
        "date": "04072015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx to buy TNT for $4.8 billion to take on rivals in Europe "
    },
    {
        "content": "CHICAGO  April 7 FedEx Corp's $4.8 billion bid Tuesday for TNT Express took the world's last large potential package delivery acquisition target off the table  marking a victory in FedEx's battle to gain market share from rival United Parcel Service Inc.",
        "date": "04072015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "In TNT  FedEx may get last major package target UPS once sought "
    },
    {
        "content": "* Indexes up: Dow 0.4 pct  S&P 0.3 pct  Nasdaq 0.5 pct   (Updates to early afternoon)",
        "date": "04072015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "US STOCKS-Wall St gains on deal news; biotechs jump "
    },
    {
        "content": "NEW YORK  April 7 U.S. stocks rose on Tuesday  extending two sessions of gains for the S&P 500  with deals including a bid from FedEx for a Dutch peer indicating companies still see value in the market.",
        "date": "04072015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "CORRECTED-US STOCKS-Wall St up on deals  biotech boost "
    },
    {
        "content": "* France's CAC  Italy's MIB  Spain's IBEX hit multi-year highs",
        "date": "04072015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "Europe shares rise as FedEx/TNT bid feeds M&A fever "
    },
    {
        "content": "Package delivery company FedEx Corp  reported a better-than-expected quarterly net profit on Wednesday but forecast full-year earnings below analysts' estimates as it looked for the global economy to grow at a lackluster rate.",
        "date": "03182015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx third-quarter profit jumps  but outlook lags market view "
    },
    {
        "content": "March 18 Package delivery company FedEx Corp  reported a better-than-expected quarterly net profit on Wednesday but forecast full-year earnings would be below analysts' estimates due to lackluster global economic growth.",
        "date": "03182015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 3-FedEx 3rd-qtr profit jumps  outlook lags market view "
    },
    {
        "content": "* U.S. crude futures hit fresh 6-year low   (Updates prices  changes comment)",
        "date": "03182015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "US STOCKS-Wall Street falls ahead of Fed statement  Yellen comments "
    },
    {
        "content": "* U.S. crude futures hit fresh 6-year low   (Updates prices  adds comment)",
        "date": "03182015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "US STOCKS-Wall St falls with eyes on Fed statement "
    },
    {
        "content": "* U.S. crude futures hit fresh 6-year low   (Updates prices  adds comment)",
        "date": "03182015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "US STOCKS-Wall St to open lower ahead of Fed statement "
    },
    {
        "content": "CHICAGO  March 18 Package delivery company FedEx Corp on Wednesday said that higher package volumes and yields drove a strong jump in quarterly profit  which came in above market expectations.",
        "date": "03182015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx profit jumps on higher package volumes  yields "
    },
    {
        "content": "MEMPHIS  Tenn. -- After getting a reboot during the end of a forgettable Eastern road swing  the Memphis Grizzlies regained their balance as a team and rolled to a 96-83 win over the Milwaukee Bucks on Saturday night before a sellout crowd of 18 119 at FedEx Forum.",
        "date": "03152015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Grizzlies bounce back to defeat Bucks "
    },
    {
        "content": "NEW YORK A federal judge on Monday said FedEx Corp must face claims that it violated federal law by delivering contraband cigarettes in New York  cheating the state and New York City out of millions of dollars of excise taxes.",
        "date": "03102015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "FedEx must face NY claims over contraband cigarettes "
    },
    {
        "content": "NEW YORK  March 6 U.S. consumers battered by the wretched winter weather still afflicting much of the eastern half of the country have responded by ordering in rather than eating out  flying more frequently to Florida and cutting out trips to the mall  according to a Reuters review of company data.",
        "date": "03062015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "CORRECTED--Weather-battered US consumers skip mall  order in and head south "
    },
    {
        "content": "March 5 U.S. airline unions have added their voices to their employers' escalating campaign to persuade the United States to alter commercial flying agreements with Qatar and the United Arab Emirates amid allegations of unfair subsidies.",
        "date": "03052015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "U.S. airline unions join campaign against Gulf carriers "
    },
    {
        "content": "NEW YORK  March 6 U.S. consumers battered by the wretched winter weather still afflicting much of the eastern half of the country have responded by ordering in rather than eating out  flying more frequently to Florida and cutting out trips to the mall  according to a Reuters review of company data.",
        "date": "03062015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "Weather-battered US consumers skip mall  order in and head south "
    },
    {
        "content": "NEW YORK A federal judge on Monday said FedEx Corp must face claims that it violated federal law by delivering contraband cigarettes in New York  cheating the state and New York City out of millions of dollars of excise taxes.",
        "date": "03092015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "FedEx must face NY claims over contraband cigarettes "
    },
    {
        "content": "NEW YORK  March 9 A federal judge on Monday said FedEx Corp must face claims that it violated federal law by delivering contraband cigarettes in New York  cheating the state and New York City out of millions of dollars of excise taxes.",
        "date": "03092015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 3-FedEx must face NY claims over contraband cigarettes "
    },
    {
        "content": "March 9 FedEx Corp :  * Judge rejects FedEx Corp bid to dismiss New York state  New York City",
        "date": "03092015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "BRIEF-Judge rejects FedEx bid to dismiss New York lawsuit over cigarette shipments "
    },
    {
        "content": "Feb 26 A push by three U.S. airlines to curb competition from Gulf state carriers has exposed divisions over free trade with other powerful U.S. aviation players including Boeing Co and FedEx Corp  potentially complicating the airlines' campaign for Obama administration support.",
        "date": "02262015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "UPDATE 1-U.S. aviation giants split on Gulf carrier subsidy row "
    },
    {
        "content": "Feb 26 A push by three U.S. airlines to curb competition from Gulf state carriers has triggered a sharp response from other powerful U.S. aviation companies including Boeing Co and FedEx Corp  potentially complicating the airlines' campaign for Obama administration support.",
        "date": "02262015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "Boeing  FedEx battle back vs U.S. airlines on Gulf competition "
    },
    {
        "content": "Feb 26 A push by three U.S. airlines to curb competition from Gulf state carriers has triggered a sharp response from other powerful U.S. aviation companies including Boeing Co and FedEx Corp  potentially complicating the airlines' campaign for Obama administration support.",
        "date": "02262015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "RPT-Boeing  FedEx battle back vs U.S. airlines on Gulf competition "
    },
    {
        "content": "* Dow down 0.5 pct  S&P 500 off 0.35 pct  Nasdaq up 0.2 pct   (Updates to afternoon trading)",
        "date": "01232015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "US STOCKS-Wall St dips on UPS  miners; Starbucks jumps "
    },
    {
        "content": "* Dow down 0.2 pct  S&P 500 off 0.1 pct  Nasdaq up 0.4 pct   (Updates to early afternoon)",
        "date": "01232015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "US STOCKS-Wall St dips weighed by UPS  miners; Starbucks shines "
    },
    {
        "content": "CHICAGO  Jan 23 United Parcel Service Inc  on Friday said its fourth-quarter performance was hurt as lackluster holiday demand pushed up costs  and that it will likely raise prices for this year's peak season.",
        "date": "01232015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "UPDATE 3-UPS hurt by disappointing holiday season  eyes costs  pricing "
    },
    {
        "content": "* Dow  S&P 500 down 0.3 pct  Nasdaq flat   (Updates to midday trading)",
        "date": "01232015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "US STOCKS-Wall St dips on earnings  but set to end week strong "
    },
    {
        "content": "CHICAGO  Jan 22 FedEx Corp said on Thursday the Teamsters have lost a ballot among drivers at a FedEx Freight facility in West Virginia  the latest blow to the union's campaign to organize workers at the package delivery company.",
        "date": "01222015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "Teamsters lose another vote at FedEx Freight facility "
    },
    {
        "content": "CHICAGO FedEx Corp  said on Wednesday that the Teamsters have lost a ballot among drivers at a FedEx Freight facility and withdrawn another ballot petition  a fresh sign that the union's campaign to organize the company may have run out of steam.",
        "date": "01212015",
        "name": "FedEx Corporation",
        "news_type": "topStory",
        "symbol": "FDX",
        "title": "Teamsters lose one FedEx Freight ballot  withdraw another "
    },
    {
        "content": "CHICAGO  Jan 21 FedEx Corp said on Wednesday that the Teamsters have lost a ballot among drivers at a FedEx Freight facility and withdrawn another ballot petition  a fresh sign that the union's campaign to organize the company may have run out of steam.",
        "date": "01212015",
        "name": "FedEx Corporation",
        "news_type": "normal",
        "symbol": "FDX",
        "title": "CORRECTED-Teamsters lose one FedEx Freight ballot  withdraw another "
    }
]