[
    {
        "content": "FRANKFURT  Nov 2 German healthcare group Fresenius said third-quarter adjusted net income gained 11 percent on higher drug sales and helped by the addition of Spanish hospitals chain Quironsalud.",
        "date": "11022017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "Fresenius adj EBIT up 11 pct on hospitals  drugs "
    },
    {
        "content": "* ‍Says Q3 sales up 3 pct at ‍4.336​ billion eur (+8 pct at constant currency)",
        "date": "11022017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "BRIEF-FMC Q3 impacted by natural disasters in North America "
    },
    {
        "content": "* NXSTAGE ANNOUNCES STOCKHOLDER APPROVAL OF MERGER AGREEMENT WITH FRESENIUS MEDICAL CARE",
        "date": "10272017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "BRIEF-NXSTAGE SAYS STOCKHOLDER APPROVE MERGER WITH FRESENIUS MEDICAL CARE "
    },
    {
        "content": "* Quest Diagnostics to acquire Shiel Medical Laboratory from Fresenius Medical Care",
        "date": "09282017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "BRIEF-Quest Diagnostics to acquire Shiel Medical Laboratory from Fresenius Medical Care "
    },
    {
        "content": "* ‍DESIGN WIN WITH FRESENIUS MEDICAL CARE TO SUPPLY HARDWARE AND SOFTWARE BUILDING BLOCKS FOR THEIR IOT PROJECT​",
        "date": "09082017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "BRIEF-Eurotech wins order from Fresenius Medical Care for IoT project​ "
    },
    {
        "content": "Fresenius Medical Care has asked a federal judge in Massachusetts to grant it summary judgment in 10 lawsuits by individuals who claimed the death of a family member was caused by the company's dialysis products  arguing a March jury verdict cleared it of liability.",
        "date": "08242017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "Fresenius asks court to toss 10 suits from dialysis MDL "
    },
    {
        "content": "* NxStage Medical - if merger agreement terminated under certain circumstances Fresenius Medical Care Holdings to pay co a termination fee of $100 million Source text: (http://bit.ly/2ujNeVi) Further company coverage:",
        "date": "08072017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "BRIEF-NxStage Medical says if merger terminated  Fresenius Medical Care Holdings to pay termination fee of $100 mln- SEC Filing "
    },
    {
        "content": "Aug 7 The following bids  mergers  acquisitions and disposals were reported by 2000 GMT on Monday:",
        "date": "08072017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "Deals of the day-Mergers and acquisitions "
    },
    {
        "content": "FRANKFURT Germany's Fresenius Medical Care (FMC)  has struck a $2 billion deal to acquire U.S. home dialysis equipment maker NxStage Medical Inc   looking to capitalize on a trend for more patients to opt for domestic treatment.",
        "date": "08072017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "Fresenius Medical banks on home dialysis with $2 billion NxStage acquisition "
    },
    {
        "content": "* Profit at parent Fresenius jumps on new drug launches (Adds company comment on costs  premarket shares  parent Fresenius)",
        "date": "08012017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "UPDATE 1-Dialysis provider FMC's Q2 profit misses consensus as costs weigh "
    },
    {
        "content": "FRANKFURT  Aug 1 Fresenius Medical Care   the world's largest provider of kidney dialysis  posted a 2 percent gain in quarterly operating profit  missing consensus  as growth in the number of dialysis patients was offset by higher personnel expenses and other costs.",
        "date": "08012017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "Dialysis provider FMC's Q2 profit edges up 2 pct as costs weigh "
    },
    {
        "content": "FRANKFURT  June 8 German kidney dialysis specialist Fresenius Medical Care on Thursday said it was targeting up to 200 million euros ($225 million) in annual cost savings from 2020 as part of a new efficiency drive.",
        "date": "06082017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "Fresenius Medical launches cost savings programme "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  May 25 (Fitch) Fitch Ratings has assigned senior unsecured ratings of 'BBB-' to debt instruments issued by the various finance companies of Fresenius Medical Care AG & Co. KG (FMC). The issuing companies are FMC Finance VII S A.  FMC Finance VIII S.A.  Fresenius Medical Care US Finance II  Inc. and Fresenius Medical Care US Finance  Inc. The senior unsecured ratings are in line with FMC's Long-Term Issuer Default Rating (IDR) of",
        "date": "05252017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "Fitch Rates Fresenius Medical Care Bonds 'BBB-' "
    },
    {
        "content": "* Vifor Pharma and Akebia announce exclusive license agreement to provide Vadadustat to Fresenius medical care in the U.S. Upon FDA approval",
        "date": "05162017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "BRIEF-Vifor Pharma and Akebia announce license agreement to provide Vadadustat to Fresenius in U.S. "
    },
    {
        "content": "* Akebia and Vifor Pharma announce exclusive license agreement to provide vadadustat to Fresenius Medical Care in the U.S. upon FDA approval",
        "date": "05152017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "BRIEF-Akebia and Vifor Pharma announce license agreement to provide vadadustat to Fresenius Medical Care in the U.S. upon FDA approval "
    },
    {
        "content": "* Unit FMC shored up by reimbursement  drug cost control (Adds FMC results  premarket shares)",
        "date": "05032017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "UPDATE 1-Fresenius ups guidance on growth at generic drugs unit "
    },
    {
        "content": "FRANKFURT  May 3 Fresenius Medical Care   the German kidney dialysis provider which derives about three quarters of sales from North America  posted a 17 percent gain in quarterly adjusted net income  benefiting from higher reimbursement rates and lower costs of medicines for dialysis patients.",
        "date": "05032017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "Dialysis provider FMC posts higher earnings "
    },
    {
        "content": "* FMC sees slowing profit growth in 2017   (Adds details  Fresenius results)",
        "date": "02222017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "UPDATE 1-Fresenius aims for double-digit growth through 2020 "
    },
    {
        "content": "FRANKFURT  Feb 22 The world's largest kidney dialysis provider Fresenius Medical Care (FMC) said it expected its net income growth to slow to between 7 and 9 percent this year  after a 21 percent jump last year.",
        "date": "02222017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "FMC forecasts slowing net income growth for 2017 "
    },
    {
        "content": "* FMC diversifying into therapeutic areas beyond kidney   (Adds strategic rationale  percentage of stake taken  report on price)",
        "date": "02032017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "UPDATE 1-FMC takes control of Australian outpatient treatment chain "
    },
    {
        "content": "FRANKFURT  Feb 3 Germany dialysis specialist Fresenius Medical Care said it was buying a majority stake in Cura Group  a leading operator of high-quality day hospitals in Australia.",
        "date": "02032017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "FMC buys majority stake in Australian hospital group Cura "
    },
    {
        "content": "* Is acquiring a majority stake in Cura Group and scales up in Australia",
        "date": "02032017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "BRIEF-Fresenius Medical Care acquires majority stake in Cura Group "
    },
    {
        "content": "FRANKFURT  Jan 31 Dialysis provider Fresenius Medical Care (FMC) settled a dispute with the United States Departments of Veterans Affairs and Justice over outstanding payments and expects to book a net income gain of 45 to 50 million euros ($48.2-$53.5 million) as a result.",
        "date": "01312017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "Dialysis provider FMC settles with U.S. veterans department "
    },
    {
        "content": "* Reached amicable agreement with U.S. Departments of veterans affairs and justice resolving reimbursement for services provided to veterans",
        "date": "01312017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "BRIEF-Fresenius Medical Care reaches agreement on outstanding payments "
    },
    {
        "content": "* Fresenius Medical Care  Cytosorbents agreed to broaden terms of existing partnership to add expansive co-marketing deal for Cytosorb",
        "date": "01092017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "BRIEF-Cytosorbents and Fresenius Medical Care agree to broaden terms of existing partnership "
    },
    {
        "content": "* U.S. court has granted a temporary restraining order (TRO) requested by dialysis patients citizens  Fresenius Medical Care  Davita  and US Renal  with the support of the American kidney foundation",
        "date": "01132017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "BRIEF-Fresenius Medical Care: U.S. court grants temporary restraining order "
    },
    {
        "content": "BERLIN/NEW YORK German's Fresenius Medical Care and U.S. rival DaVita Inc said they had both received subpoenas from federal prosecutors investigating their ties with a charity that helps patients pay for kidney dialysis.",
        "date": "01072017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "Fresenius Medical  DaVita subpoenaed over premium assistance "
    },
    {
        "content": "BERLIN/NEW YORK  Jan 7 German's Fresenius Medical Care and U.S. rival DaVita Inc said they had both received subpoenas from federal prosecutors investigating their ties with a charity that helps patients pay for kidney dialysis.",
        "date": "01072017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "UPDATE 2-Fresenius Medical  DaVita subpoenaed over premium assistance "
    },
    {
        "content": "BERLIN  Jan 7 German kidney dialysis provider Fresenius Medical Care (FMC) said it is challenging a U.S. move to end assistance to patients with end-stage renal disease (ESRD) that it said could have a \"material adverse affect\" on its business.",
        "date": "01072017",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "Fresenius Medical files suit over US rule change on renal disease care "
    },
    {
        "content": "* Says has sold medical technology company XENIOS AG to Fresenius Medical Care AG & Co. KGaA",
        "date": "10312016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "BRIEF-zfhn Zukunftsfonds Heilbronn sells XENIOS to Fresenius Medical Care "
    },
    {
        "content": "* Improvements driven by strong North America sales   (Recasts throughout  adds details)",
        "date": "10272016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "UPDATE 1-Fresenius group benefits from North America business  cost cuts "
    },
    {
        "content": "FRANKFURT  Oct 27 German healthcare group Fresenius SE slightly upped its earnings guidance on Thursday  citing strong prospects for the remaining months of 2016 and a solid third-quarter performance.",
        "date": "10272016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "Fresenius SE notches up lower end of 2016 earnings guidance "
    },
    {
        "content": "* Group revenue +9% (+9% at constant currency)  driven by a strong performance in health care services",
        "date": "10272016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "BRIEF-Fresenius Medical Care confirms 2016 outlook "
    },
    {
        "content": "* Says acquires dialysis service provider Sandor Nephro services in India  which is expected to generate around $3 mln in 2016 revenues",
        "date": "09022016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "BRIEF-Germany's FMC buys Indian dialysis group Sandor Nephro "
    },
    {
        "content": "BERLIN German healthcare group Fresenius SE  raised its profit target for the year after reporting a 12 percent rise in adjusted net income for the second quarter bolstered by the launch of new generic intravenous drugs and rivals' supply shortages.",
        "date": "08012016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "Fresenius ups 2016 earnings goal after good first half "
    },
    {
        "content": "(The following statement was released by the rating agency) FRANKFURT/BARCELONA/LONDON  July 29 (Fitch) Fitch Ratings has upgraded Fresenius  Medical Care AG & Co. KGaA's (FMC) and Fresenius SE & Co. KGaA's (FSE; together  Fresenius) Long-Term Issuer Default Ratings to 'BBB-' from 'BB+'. The Outlooks  are Stable. Fitch has also upgraded the Short-Term IDR to 'F3' from 'B'. A full  list of rating actions is below. The upgrade reflects Fresenius' improving business risk profile  driven by its  inc",
        "date": "07292016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "Fitch Upgrades Fresenius to 'BBB-'; Outlook Stable "
    },
    {
        "content": "* Reuters poll average for fmc q2 net revenue was $4.44 billion  ebit $634 million  net income $284 million",
        "date": "08012016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "BRIEF-FMC sticks to guidance after Q2 results "
    },
    {
        "content": "BERLIN  Aug 1 German healthcare group Fresenius SE raised its profit target for the year on Monday after a better than expected performance in the first half of 2016.",
        "date": "08012016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "Fresenius ups 2016 earnings guidance after good 1st half "
    },
    {
        "content": "* Parent Fresenius raises FY profit goal on infusion drugs   (Releads  adds shares  analyst comment)",
        "date": "08022016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "UPDATE 2-Fresenius Medical's cost cuts lift earnings and shares "
    },
    {
        "content": "BERLIN/FRANKFURT  Aug 2 The DAX top-30 index  looked set to open 0.1 percent lower on Tuesday  according to premarket data from brokerage Lang & Schwarz at 0607 GMT.",
        "date": "08022016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "German stocks - Factors to watch on August 2 "
    },
    {
        "content": "FRANKFURT  May 1 German healthcare group Fresenius Medical Care (FMC) has pulled out of the bidding for Irish clinic chain Mater Private  daily Frankfurter Allgemeine Zeitung reported  citing people familiar with the matter.",
        "date": "05012016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "Germany's FMC pulls out of bidding for Irish clinic chain - paper "
    },
    {
        "content": "* FMC Q1 net income up 9 pct on higher U.S. reimbursement   (Adds details on intravenous drugs unit Kabi  FMC anaemia drug)",
        "date": "05032016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "UPDATE 1-Fresenius net profit up 24 percent on generic intravenous drugs "
    },
    {
        "content": "* Says 120 000 patients on Mircera at end-Q1  Further company coverage:",
        "date": "05032016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "BRIEF-FMC says 120 000 patients on Mircera at end-Q1 "
    },
    {
        "content": "FRANKFURT  May 3 German healthcare group Fresenius SE saw adjusted net income rise 24 percent in the first quarter  bolstered by the launch of new generic infusion drugs and rivals' supply shortages.",
        "date": "05032016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "Fresenius net profit up 24 percent on generic infusion drugs "
    },
    {
        "content": "* Says \u007fcts eventim ag & co. kgaa: egmont and cts eventim create joint scandinavian ticketing operator\u007f",
        "date": "03162016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "BRIEF-CTS Eventim in JV for Scandinavian ticketing operator "
    },
    {
        "content": "* Says Gerd Krick  chairman of the supervisory board   to run again for supervisory board",
        "date": "03112016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "BRIEF-FMC says Citi's McWhinney  Sanofi's Witz to run for supervisory board "
    },
    {
        "content": "FRANKFURT Kidney dialysis provider Fresenius Medical Care (FMC) expects more than 70 percent of eligible U.S. patients to have switched to cheaper alternative anemia treatment Mircera by the end of March  the German group's chief executive said.",
        "date": "02242016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "FMC aims for 110 000 U.S. patients to be on Mircera in first-quarter "
    },
    {
        "content": "FRANKFURT  Feb 24 Kidney dialysis provider Fresenius Medical Care (FMC) expects more than 70 percent of eligible U.S. patients to have switched to cheaper alternative anaemia treatment Mircera by the end of March  the German group's chief executive said.",
        "date": "02242016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "FMC aims for 110 000 U.S. patients to be on Mircera in Q1 "
    },
    {
        "content": "* Fresenius up 1.2 pct pre-market  FMC down 1 pct   (Adds background on dialysis unit FMC  Helios hospitals  Kabi infusion drugs)",
        "date": "02242016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "UPDATE 1-Fresenius eyes 8-12 pct profit growth on hospitals  dialysis "
    },
    {
        "content": "FRANKFURT German kidney dialysis provider Fresenius Medical Care has acquired Japan's largest dialysis group with about 6 000 patients  newspaper Frankfurter Allgemeine Zeitung reported on Monday  citing a presentation made by the company in January.",
        "date": "02152016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "FMC acquires Japan's largest dialysis group: FAZ newspaper "
    },
    {
        "content": "FRANKFURT  Feb 17 Dialysis specialist Fresenius Medical Care (FMC) settled out of court for $250 million with U.S. plaintiffs who had accused the German company of understating the side effects of a medical product  it said late on Wednesday.",
        "date": "02172016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "FMC takes $60 mln pretax burden on GranuFlo settlement "
    },
    {
        "content": "FRANKFURT  Feb 15 German kidney dialysis provider Fresenius Medical Care has acquired Japan's largest dialysis group with about 6 000 patients  newspaper Frankfurter Allgemeine Zeitung reported on Monday  citing a presentation made by the company in January.",
        "date": "02152016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "FMC acquires Japan's largest dialysis group -FAZ newspaper "
    },
    {
        "content": "* Roberto Fuste (64)  the management board member responsible for the region Asia-Pacific  has decided to resign   Further company coverage:",
        "date": "01282016",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "BRIEF-Fresenius medical care says Asia-Pac board member resigns "
    },
    {
        "content": "FRANKFURT Fresenius Medical Care   the world's largest dialysis provider  is looking for opportunities to grow in Europe and Asia as it feels the limits to growth in its largest market  the United States  its chief executive told Reuters in an interview.",
        "date": "11232015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "FMC seeks growth outside main U.S. market "
    },
    {
        "content": "FRANKFURT Fresenius Medical Care   the world's largest dialysis provider  is looking for opportunities to grow in Europe and Asia as it feels the limits to growth in its largest market  the United States  its chief executive told Reuters in an interview.",
        "date": "11232015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "FMC sees growth outside main U.S. market "
    },
    {
        "content": "* Debiotech and Fresenius Medical Care announce exclusive partnership for new home dialysis product development",
        "date": "11032015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "BRIEF-FMC and  Debiotech announce partnership for home dialysis product development "
    },
    {
        "content": "* Subsidiary FMC Q3 net income down 3 pct   (Adds infusion drugs industry background  FMC results)",
        "date": "10292015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "UPDATE 1-Fresenius raises profit guidance again on drug demand "
    },
    {
        "content": "FRANKFURT  Oct 29 Kidney dialysis specialist Fresenius Medical Care (FMC)  the separately listed subsidiary of Fresenius SE  on Thursday confirmed its projections for 2016 sales growth of 7-10 percent.",
        "date": "10292015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "FMC keeps 2016 sales forecast "
    },
    {
        "content": "FRANKFURT  Oct 23 Kidney dialysis specialist Fresenius Medical Care is buying Israel-based peer Nephromor for about 350 million shekels  ($90.23 million)  German business paper Frankfurter Allgemeine Zeitung reported on Friday  citing industry sources.",
        "date": "10232015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "Fresenius Medical Care buys dialysis specialist Nephromor -paper "
    },
    {
        "content": "FRANKFURT  Oct 6 German healthcare group Fresenius has its sights trained on takeovers in the medical nutrition market  its chief executive said -- even after it failed  according to sources  to purchase a large Danone  business last year.",
        "date": "10062015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "Fresenius CEO says would look at medical nutrition assets "
    },
    {
        "content": "* Says plan to sell Venezuela dialysis service business  to incur $30 million loss  Further company coverage:",
        "date": "07302015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "BRIEF-Fresenius Medical to sell Venezuela dialysis services unit "
    },
    {
        "content": "FRANKFURT German healthcare group Fresenius SE  on Wednesday lifted its full-year earnings target for the second time as its rivals in the U.S. generic infusion drug market struggled with longer-than-expected production outages.",
        "date": "07292015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "Fresenius raises 2015 profit guidance on generic infusion drugs "
    },
    {
        "content": "* Fresenius boosted by drug launches  rivals' production blunders",
        "date": "07292015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "UPDATE 1-Fresenius raises 2015 profit guidance on generic infusion drugs "
    },
    {
        "content": "* Says q2 dialysis product revenue decreased by 4% on year to $854 million mainly due to negative currency developments",
        "date": "07292015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "BRIEF-Fresenius Medical Care confirms guidance for 2015 "
    },
    {
        "content": "* Says expects care coordination businesses to start adding to earnings from 2016",
        "date": "05192015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "BRIEF-FMC sees care coordination adding to earnings from 2016 "
    },
    {
        "content": "FRANKFURT German healthcare group Fresenius SE  lifted its full-year earnings forecast as its rivals in the U.S. generic infusion drug market grappled with supply shortages longer than expected.",
        "date": "04292015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "Fresenius ups profit forecast on higher infusion drug sales "
    },
    {
        "content": "* Expects adj net income growth of 13-16 pct  before forex effects",
        "date": "04292015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "UPDATE 1-Fresenius ups profit forecast on higher infusion drug sales "
    },
    {
        "content": "FRANKFURT  April 29 Kidney dialysis specialist Fresenius Medical Care (FMC) reported a 2 percent rise in quarterly net profit  meeting expectations  and confirmed its guidance for 2015.",
        "date": "04292015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "FMC confirms outlook as quarterly profit in line "
    },
    {
        "content": "(The following statement was released by the rating agency) LONDON  March 19 (Fitch) Fitch Ratings has revised Fresenius Medical Care AG &  Co. KGaA's (FMC) and Fresenius SE & Co. KGaA's (FSE  consolidated 'Fresenius')  Outlook to Stable from Positive. Its Long- and Short-term Issuer Default Ratings  (IDRs) have been affirmed at 'BB+' and 'B'  respectively. Please see below for a  detailed list of rating actions. Although Fresenius' business risk profile has improved  with its scale   profitabil",
        "date": "03192015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "Fitch Revises Fresenius' Outlook to Stable; Affirms at 'BB+' "
    },
    {
        "content": "FRANKFURT  Feb 25 Dialysis provider Fresenius Medical Care is eyeing Europe as a place to take a first step into so-called care coordination businesses outside its main market North America.",
        "date": "02252015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "FMC sees opportunities in care coordination in Europe "
    },
    {
        "content": "FRANKFURT Kidney dialysis specialist Fresenius Medical Care  forecast strong profit growth in 2016 after more modest progress this year while it cuts costs to counter pressures on payments for treatment in the United States and moves into new healthcare services.",
        "date": "02252015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "Fresenius Medical Care sees strong profit growth in 2016 "
    },
    {
        "content": "* FMC sees forex-adjusted net income growth of 0-5 pct in 2015",
        "date": "02252015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "UPDATE 3-Fresenius Medical Care sees strong profit growth in 2016 "
    },
    {
        "content": "FRANKFURT  Feb 25 German kidney dialysis specialist Fresenius Medical Care (FMC) said net income could be flat this year but would grow again in 2016  as it cuts costs to counter pressure in the United States on reimbursement for dialysis treatments.",
        "date": "02252015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "normal",
        "symbol": "FMS",
        "title": "Fresenius Medical Care says profit may not grow until 2016 "
    },
    {
        "content": "FRANKFURT  Jan 19 German healthcare group Fresenius  the owner of Europe's largest private-sector hospitals chain  received investment-grade status from a ratings agency for the first time  after recent acquisitions have spread its business risks.",
        "date": "01192015",
        "name": "Fresenius Medical Care Corporation",
        "news_type": "topStory",
        "symbol": "FMS",
        "title": "Fresenius sheds 'junk' credit rating for first time "
    }
]