[
    {
        "content": "MEXICO CITY Mexican bottler and retailer Fomento Economico Mexicano (Femsa)  said on Friday it could see a slowdown in sales in the fourth quarter and in 2018 as high inflation  concerns over trade talks and an upcoming election dampen consumer appetite.",
        "date": "10272017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "Femsa sees Mexico inflation hitting consumption in fourth quarter  2018 "
    },
    {
        "content": "MEXICO CITY  Oct 27 Mexican bottler and retailer Fomento Economico Mexicano (Femsa) said on Friday it could see a slowdown in sales in the fourth quarter and in 2018 as high inflation  concerns over trade talks and an upcoming election dampen consumer appetite.",
        "date": "10272017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Femsa sees Mexico inflation hitting consumption in Q4  2018 "
    },
    {
        "content": "MEXICO CITY Mexico's Coca-Cola Femsa   the world's largest Coke bottler  said on Wednesday its third-quarter net profit surged 39.2 percent from the year-earlier period  as sales increased.",
        "date": "10252017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "Mexico's Coca-Cola Femsa reports 39 percent jump in profit "
    },
    {
        "content": "MEXICO CITY  Oct 25 Mexico's Coca-Cola Femsa   the world's largest Coke bottler  said on Wednesday its third-quarter net profit surged 39.2 percent from the year-earlier period  as sales increased.",
        "date": "10252017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "UPDATE 2-Mexico's Coca-Cola Femsa reports 39 pct jump in profit "
    },
    {
        "content": "MEXICO CITY Mexican bottler and retailer Fomento Economico Mexicano (Femsa)  reported on Thursday a nearly four-fold surge in third-quarter net profit after selling a 5.24 percent stake in Dutch beer company Heineken NV .",
        "date": "10262017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "Mexico's Femsa third-quarter profit jumps 385 percent "
    },
    {
        "content": "MEXICO CITY  Oct 26 Mexican bottler and retailer Fomento Economico Mexicano (Femsa) reported on Thursday a nearly four-fold surge in third-quarter net profit after selling a 5.24 percent stake in Dutch beer company Heineken NV.",
        "date": "10262017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "UPDATE 1-Mexico's Femsa third-quarter profit jumps 385 pct "
    },
    {
        "content": "MEXICO CITY  Oct 26 Mexican bottler and retailer Fomento Economico Mexicano (Femsa) reported on Thursday a 385 percent surge in third quarter net profit to 32.4 billion pesos ($1.70 billion) after selling a 2.5 billion euros ($3 billion) stake in Heineken.",
        "date": "10262017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Mexico Femsa's third quarter net profit surges 385 pct "
    },
    {
        "content": "MEXICO CITY Heineken shareholder Fomento Economico Mexicano (Femsa) said on Monday it was planning to sell an approximate 5 percent stake in the world's second largest brewer  worth 2.5 billion euros ($3 billion).",
        "date": "09182017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "Mexico's Femsa to sell 5 percent of Heineken  worth 2.5 billion euros "
    },
    {
        "content": "MEXICO CITY  Sept 18 Fomento Economico Mexicano (Femsa) said on Monday it had sold a stake of 5.24 percent in Heineken  the world's second largest brewer for some 2.5 billion euros ($3 billion).",
        "date": "09192017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "UPDATE 4-Mexico's Femsa sells 5.24 pct of Heineken for 2.5 bln euros "
    },
    {
        "content": "* FEMSA announces the completion of the offering of shares in Heineken N.V. and Heineken Holding N.V. Source text for Eikon: Further company coverage:",
        "date": "09192017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "BRIEF-FEMSA announces the completion of the offering of shares in Heineken N.V. and Heineken Holding N.V. "
    },
    {
        "content": "MEXICO CITY  Aug 29 Mexican bottler and retailer Fomento Economico Mexicano (Femsa) on Tuesday named veteran executive Eduardo Padilla as the firm's next chief executive officer effective next year  the company said in a statement.",
        "date": "08302017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "Mexican bottler and retailer Femsa names Eduardo Padilla next CEO "
    },
    {
        "content": "MEXICO CITY  July 25 Shares in Mexican bottler and retailer Fomento Economico Mexicano (Femsa) fell on Tuesday after it reported a drop in quarterly profits  hurt by rising costs.",
        "date": "07252017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "UPDATE 2-Mexico's Femsa Q2 profit falls  dragging down shares "
    },
    {
        "content": "MEXICO CITY Mexico's Coca-Cola Femsa   the world's largest Coke bottler  said on Monday it is poised to lose a key distribution contract in Brazil  sending its shares down 5 percent  even as it reported an 11.5 percent jump in quarterly net profit.",
        "date": "07242017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "Coke Femsa loses key Brazil distribution deal; shares slump "
    },
    {
        "content": "MEXICO CITY  July 25 Mexican bottler and retailer Fomento Economico Mexicano (Femsa) reported a 4.4 percent year-on-year fall in its second-quarter net profit on Tuesday.",
        "date": "07252017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Mexico's Femsa posts 4.4 pct yr/yr fall in Q2 net profit "
    },
    {
        "content": "MEXICO CITY  July 24 Mexico's Coca-Cola Femsa   the world's largest Coke bottler  said on Monday it is poised to lose a key distribution contract in Brazil  sending its shares down 5 percent  even as it reported an 11.5 percent jump in quarterly net profit.",
        "date": "07242017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "UPDATE 4-Coke Femsa loses key Brazil distribution deal; shares slump "
    },
    {
        "content": "MEXICO CITY Mexican bottler and retailer Fomento Economico Mexicano on Friday said its first-quarter net profit rose 9.7 percent year-on-year  below market expectations as a spike in electricity prices ate into a surge in sales.",
        "date": "04282017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "Femsa first-quarter profit rises  but electricity costs took a bite "
    },
    {
        "content": "MEXICO CITY  April 28 Mexican bottler and retailer Fomento Economico Mexicano on Friday said its first-quarter net profit rose 9.7 percent year-on-year  below market expectations as a spike in electricity prices ate into a surge in sales.",
        "date": "04282017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "UPDATE 2-Femsa 1st-quarter profit rises  but electricity costs took a bite "
    },
    {
        "content": "MEXICO CITY  April 28 Mexican bottler and retailer Fomento Economico Mexicano (Femsa) reported a 9.7 percent year-on-year rise in its first-quarter net profit on Friday.",
        "date": "04282017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Mexico's Femsa reports 9.7 pct yr/yr rise in net profit in Q1 "
    },
    {
        "content": "MEXICO CITY  Feb 27 Mexican bottler and retailer Fomento Economico Mexicano (Femsa) on Monday reported a 23 percent rise in fourth-quarter profit compared to the same period a year earlier  driven by currency gains stemming from a deep slump in the Mexican peso.",
        "date": "02272017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "UPDATE 1-Mexico's Femsa reports profit jump  cautious on Trump-led headwinds "
    },
    {
        "content": "MEXICO CITY  Feb 27 Mexico's Fomento Economico Mexicano (Femsa) said on Monday it expected consolidated capital expenditures of $1.3 billion in 2017.",
        "date": "02272017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Mexico's Femsa says expects 2017 capex of $1.3 bln "
    },
    {
        "content": "MEXICO CITY  Feb 27 Mexico's Fomento Economico Mexicano (Femsa) on Monday reported a 23 percent rise in fourth-quarter profit compared to the same period a year earlier.",
        "date": "02272017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Mexico's Femsa 4th-qtr profit rises 23 pct "
    },
    {
        "content": "* Says comparable total revenues grew 3.7% to ps. 44 300 million",
        "date": "02242017",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "BRIEF-Coca-Cola Femsa Q4 EPS 1.69 pesos "
    },
    {
        "content": "MEXICO CITY Coca-Cola Femsa   the largest Coke bottler in the world  on Tuesday reported a 13.9 percent rise in third-quarter profit  helped by fewer foreign exchange losses  lower taxes  and higher prices to consumers.",
        "date": "10252016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "Mexico's Coke Femsa net profit up 14 percent in third quarter "
    },
    {
        "content": "MEXICO CITY  Oct 28 Mexican bottler and retailer Fomento Economico Mexicano (Femsa)said on Friday its third-quarter profit rose 34.5 percent from the year earlier  helped by growth in its retail division and foreign exchange gains.",
        "date": "10282016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "UPDATE 1-Mexico's Femsa reports 34.5 pct rise in net profit in 3rd qtr "
    },
    {
        "content": "MEXICO CITY  Oct 25 Coca-Cola Femsa  the largest Coke bottler in the world  on Tuesday reported a 13.9 percent rise in third-quarter profit  helped by fewer foreign exchange losses  lower taxes  and higher prices to consumers.",
        "date": "10252016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "UPDATE 2-Mexico's Coke Femsa net profit up 14 pct in 3rd qtr "
    },
    {
        "content": "MEXICO CITY  Oct 28 Mexican bottler and retailer Fomento Economico Mexicano (Femsa) said on Friday that its third-quarter net profit rose 34.5 percent compared with the year-earlier period.",
        "date": "10282016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "CORRECTED-Mexico's Femsa reports 34.5 pct rise in net profit in 3rd-qtr "
    },
    {
        "content": "MEXICO CITY  Oct 6 Mexico's Femsa said on Thursday its convenience store chain Oxxo had signed a deal with U.S. payments company Western Union   that will allow customers to receive international money transfers in its stores in Mexico.",
        "date": "10062016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Femsa's Oxxo signs Western Union remittances deal "
    },
    {
        "content": "MEXICO CITY  Sept 23 Coca-Cola Femsa  Latin America's largest Coke bottler  on Friday said it would buy Brazilian bottler Vonpar in a cash  stock and debt deal valued at 3.5 billion reais ($1.09 billion).",
        "date": "09232016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "Mexico's Coke Femsa says to buy Brazil's Vonpar in $1.1 bln deal "
    },
    {
        "content": "* Coca-Cola Femsa reaches an agreement to acquire Vonpar in Brazil",
        "date": "09232016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "BRIEF-Coca-Cola Femsa to acquire Vonpar in brazil "
    },
    {
        "content": "MEXICO CITY  July 27 Mexican bottler and retailer Fomento Economico Mexicano (Femsa) said on Wednesday that second-quarter net profit rose more than a quarter compared with the year-earlier period  helped by its fast-growing retail division.",
        "date": "07272016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "UPDATE 3-Femsa's profit jumps on Mexico retail strength "
    },
    {
        "content": "MEXICO CITY  July 27 Mexican bottler and retailer Fomento Economico Mexicano (Femsa) said on Wednesday that second-quarter net profit rose more than a quarter compared with the year-earlier period  helped by its fast-growing retail division.",
        "date": "07272016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "CORRECTED-UPDATE 2-Femsa's profit jumps on Mexico retail strength "
    },
    {
        "content": "* Qtrly income from operations grew 13.0% compared to q2 of 2015",
        "date": "07272016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "BRIEF-Fomento Economico Mexicano Sab de CV Qtrly REV. rose 25.9% "
    },
    {
        "content": "MEXICO CITY  July 27 Mexican bottling and retail company Fomento Economico Mexicano (Femsa) on Wednesday posted a 16.2 percent rise in second-quarter net profit compared to the year-earlier period.",
        "date": "07272016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Mexico's Femsa says 2nd-qtr profit rises 16.2 pct "
    },
    {
        "content": "July 27 Coca-Cola Femsa  Latin America's largest Coke bottler  reported a 25 percent fall in second-quarter profit  hurt by lower margins and higher raw material costs.",
        "date": "07272016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "CORRECTED-Mexican bottler Coke Femsa's profit falls 25 pct "
    },
    {
        "content": "* Qtrly comparable total revenues grew 9.1 pct to ps. 38 536 million",
        "date": "07272016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "BRIEF-Coca-Cola Femsa says Q2 comparable revenue rose 9.1 pct "
    },
    {
        "content": "MEXICO CITY  June 6 Mexican bottling and retail company Femsa said on Monday it had acquired Chilean convenience store Big John  but gave no financial details about the transaction.",
        "date": "06062016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "Mexico's Femsa says acquires Chile convenience store chain Big John "
    },
    {
        "content": "May 23 The Venezuelan bottler of Coca-Cola has halted production of the sugar-sweetened beverage due to a lack of sugar  a Coca-Cola Co spokeswoman said on Monday.",
        "date": "05242016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "UPDATE 2-Production of Coke halted in Venezuela for lack of sugar "
    },
    {
        "content": "MEXICO CITY  April 28 Mexican bottling and retail company Femsa on Thursday reported a 4.3 percent fall in first-quarter profit  compared to the year-earlier period  dragged down by higher costs.",
        "date": "04282016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "UPDATE 1-Mexico's Femsa 1st-qtr profit falls 4.3 pct as costs rise "
    },
    {
        "content": "MEXICO CITY  April 28 Mexican bottling and retail company Femsa on Thursday reported a 4.33 percent fall in first-quarter profit  compared to the year-earlier period.",
        "date": "04282016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Mexico's Femsa posts 4.3 pct fall in 1st-qtr net profit "
    },
    {
        "content": "* Qtrly comparable revenue 34.62 billion pesos  Source text for Eikon:  Further company coverage:",
        "date": "04272016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "BRIEF-Coca-cola Femsa reports Q1 non-gaap earnings 1.13 peson per share "
    },
    {
        "content": "MEXICO CITY  Feb 24 Mexican bottling and retail company Femsa on Wednesday said its fourth-quarter profit fell by a quarter  as higher operating and administrative expenses at its retail business offset a bumper revenue.",
        "date": "02242016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "UPDATE 1-Mexico's Femsa's profit falls in Q4 despite bumper revenues "
    },
    {
        "content": "MEXICO CITY  Feb 24 Mexican bottling and retail company Femsa on Wednesday reported a lower fourth-quarter profit.",
        "date": "02242016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Mexico's Femsa reports lower fourth-quarter profit "
    },
    {
        "content": "MEXICO CITY  Feb 23 Latin America's biggest Coke bottler Coca-Cola Femsa on Tuesday said its fourth-quarter profit rose 1.5 percent.",
        "date": "02232016",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "Mexico's Coke Femsa reports slightly higher 4th-qtr profit "
    },
    {
        "content": "MEXICO CITY  Oct 28 Mexican bottling and retail company Femsa on Wednesday reported a 3.5 percent increase in third-quarter profit.",
        "date": "10282015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "RPT-Mexico's Femsa reports higher third-quarter profit "
    },
    {
        "content": "MEXICO CITY  Oct 28 Mexican bottling and retail company Femsa on Wednesday reported a 3.5 percent increase in third-quarter profit.",
        "date": "10282015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Mexico's Femsa reports higher third-quarter profit "
    },
    {
        "content": "MEXICO CITY  Oct 28 Latin America's largest Coke bottler  Coca-Cola Femsa  reported lower third-quarter profit on Wednesday  hurt by currency volatility and weak sales.",
        "date": "10282015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "UPDATE 2-Mexico's Coke Femsa 3rd-qtr profit slumps on volatile forex "
    },
    {
        "content": "MEXICO CITY  Oct 28 Latin America's largest Coke bottler  Coca-Cola Femsa  on Wednesday reported a weaker third-quarter profit  hurt by currency volatility.",
        "date": "10282015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Mexico's Coke Femsa reports lower third-quarter profit "
    },
    {
        "content": "MEXICO CITY  Oct 28 Latin America's largest Coke bottler  Coca-Cola Femsa  on Wednesday reported a preliminary third-quarter profit of 1.988 billion pesos ($117.4 million).",
        "date": "10282015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Coke Femsa reports preliminary third-quarter profit "
    },
    {
        "content": "MEXICO CITY  Aug 14 Mexican retail group Femsa has acquired a 60 percent stake in Chilean pharmacy operator Socofar  which runs the Cruz Verde chain in Chile and Colombia  the Mexican company said on Friday.",
        "date": "08142015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "UPDATE 1-Mexico's Femsa takes 60 pct stake in operator of Chile pharmacy chain Cruz Verde "
    },
    {
        "content": "SANTIAGO  Aug 13 Mexican retail group Femsa  is close to sealing an agreement to buy privately owned Chilean pharmacy chain Cruz Verde for about $1 billion  Chilean newspaper Pulso reported on Thursday.",
        "date": "08132015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "Mexico's Femsa to buy Chile pharmacy chain Cruz Verde for $1 bln -paper "
    },
    {
        "content": "MEXICO CITY  Aug 14 Mexican retail group Femsa has aquired a 60 percent stake in Chilean pharmacy operator Socofar  which runs the Cruz Verde chain in Chile  the Mexican company said on Friday.",
        "date": "08142015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Mexico's Femsa takes 60 pct stake in operator of Chile pharmacy chain Cruz Verde "
    },
    {
        "content": "MEXICO CITY Mexican retailer and bottling company Femsa  on Thursday said its second-quarter profit rose 28 percent  driven by growth in its retail division which now includes a new venture into gasoline stations.",
        "date": "07232015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "Mexico's Femsa's second-quarter profit jumps 28 percent on retail unit "
    },
    {
        "content": "MEXICO CITY  July 23 Mexican retailer and bottling company Femsa on Thursday said its second-quarter profit rose 28 percent  driven by growth in its retail division which now includes a new venture into gasoline stations.",
        "date": "07232015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "UPDATE 1-Mexico's Femsa's 2nd-qtr profit jumps 28 pct on retail unit "
    },
    {
        "content": "MEXICO CITY  July 23 Mexican retailer and bottling company Femsa on Thursday said its second-quarter profit rose 28.3 percent.",
        "date": "07232015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Mexico's Femsa's profit jumps 28 pct in 2nd-qtr "
    },
    {
        "content": "MONTERREY  Mexico  July 23 Coca-Cola Femsa  Latin America's biggest Coke bottler  on Thursday reported that second-quarter profit fell 0.4 percent compared to the same period in 2014  dragged down by weak growth in sales volumes and foreign exchange effects in Venezuela.",
        "date": "07232015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "UPDATE 1-Mexico's Coca Cola Femsa second-quarter profit falls 0.4 pct "
    },
    {
        "content": "MEXICO CITY  April 29 Coca-Cola Femsa  Latin America's largest Coke bottler  on Wednesday reported that first-quarter profit fell 5 percent as it sold less of the carbonated drink and other beverages across the region.",
        "date": "04292015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "UPDATE 1-Mexico's Coke Femsa profit slips on declining drink sales "
    },
    {
        "content": "MEXICO CITY  April 29 Coca-Cola Femsa  Latin America's largest Coke bottler  on Wednesday reported a 5-percent lower first-quarter profit.",
        "date": "04292015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Mexico's Coke Femsa reports lower first-quarter results "
    },
    {
        "content": "MEXICO CITY  April 30 Mexican retailer and bottling company Femsa on Thursday said its first-quarter profit rose 26 percent compared with a year earlier  boosted by store openings in its retail division and a one-time gain from its stake in Heineken.",
        "date": "04302015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "UPDATE 2-Mexico's Femsa profit jumps on Heineken gain  store openings "
    },
    {
        "content": "(The following statement was released by the rating agency) CHICAGO/LONDON  March 27 (Fitch) Fitch Ratings has published its new Rating  Navigators for: --The Coca-Cola Company --Coca-Cola Enterprises Inc. --PepsiCo Inc. --Coca-Cola Icecek --Coca-Cola FEMSA SAB --Corporacion Lindley --Embotelladora Andina --Grupo Embotellador Atic --Ajecorp  These reports should be read in conjunction with the 'Introducing Rating  Navigators for Corporates' report dated Nov. 5  2014 and 'Non-Alcoholic  Beverages",
        "date": "03272015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "Fitch Publishes Ratings Navigator for 9 Non-Alcoholic Beverage Companies "
    },
    {
        "content": "MEXICO CITY  Feb 26 Mexico's IPC index  rose on Thursday as Mexican bottling and retail firm Femsa  reported soaring profit  while a weak showing from Brazil's miner Vale sent the Bovespa down amid mixed data from the United States.",
        "date": "02262015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "EMERGING MARKETS-Femsa profit boosts Mexico shares  Bovespa down on Vale "
    },
    {
        "content": "MEXICO CITY  Feb 26 Mexican bottling and retail company Femsa on Thursday reported a 45 percent rise in its fourth-quarter profit  mostly due to higher gains from its stake in brewer Heineken.",
        "date": "02262015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "UPDATE 3-Mexico's Femsa profit jumps  fueled by gains from Heineken stake "
    },
    {
        "content": "MEXICO CITY  Feb 26 Mexican bottling and retail company Femsa on Thursday reported a 45 percent increase in its fourth-quarter profit.",
        "date": "02262015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Mexico's Femsa reports a 45 pct rise in 4th-qtr profit "
    },
    {
        "content": "MEXICO CITY  Feb 25 Coca-Cola Femsa  the biggest Coke bottler in Latin America  on Wednesday reported a 0.3 percent increase in fourth-quarter earnings  hurt by muted sales and currency weakness in Venezuela and Mexico.",
        "date": "02252015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "topStory",
        "symbol": "FMX",
        "title": "UPDATE 2-Mexico's Coke Femsa reports flat fourth-quarter profit "
    },
    {
        "content": "MEXICO CITY  Feb 25 Coca-Cola Femsa  the biggest Coke bottler in Latin America  on Wednesday reported a 0.3 percent increase in its fourth-quarter profit.",
        "date": "02252015",
        "name": "Fomento Economico Mexicano SAB de CV",
        "news_type": "normal",
        "symbol": "FMX",
        "title": "Mexico's Coke Femsa reports flat fourth-quarter profit "
    }
]